[{"num":60,"verse":"Arise [from the depression and prostration in which circumstances have kept you—rise to a new life]! Shine (be radiant with the glory of the Lord), for your light has come, and the glory of the Lord has risen upon you!"},{"num":2,"verse":"For behold, darkness shall cover the earth, and dense darkness [all] peoples, but the Lord shall arise upon you [O Jerusalem], and His glory shall be seen on you."},{"num":3,"verse":"And nations shall come to your light, and kings to the brightness of your rising."},{"num":4,"verse":"Lift up your eyes round about you and see! They all gather themselves together, they come to you. Your sons shall come from afar, and your daughters shall be carried and nursed in the arms."},{"num":5,"verse":"Then you shall see and be radiant, and your heart shall thrill and tremble with joy [at the glorious deliverance] and be enlarged; because the abundant wealth of the [Dead] Sea shall be turned to you, unto you shall the nations come with their treasures."},{"num":6,"verse":"A multitude of camels [from the eastern trading tribes] shall cover you [Jerusalem], the young camels of Midian and Ephah; all the men from Sheba [who once came to trade] shall come, bringing gold and frankincense and proclaiming the praises of the Lord."},{"num":7,"verse":"All the flocks of Kedar shall be gathered to you [as the eastern pastoral tribes join the trading tribes], the rams of Nebaioth shall minister to you; they shall come up with acceptance on My altar, and My glorious house I will glorify."},{"num":8,"verse":"Who are these who fly like a cloud, and like doves to their windows?"},{"num":9,"verse":"Surely the isles and distant coastlands shall wait for and expect Me; and the ships of Tarshish [shall come] first, to bring your sons from afar, their silver and gold with them, for the name of the Lord your God, for the Holy One of Israel, because He has beautified and glorified you."},{"num":10,"verse":"Foreigners shall build up your walls, and their kings shall minister to you; for in My wrath I smote you, but in My favor, pleasure, and goodwill I have had mercy, love, and pity for you."},{"num":11,"verse":"And your gates shall be open continually, they shall not be shut day or night, that men may bring to you the wealth of the nations—and their kings led in procession [your voluntary captives]."},{"num":12,"verse":"For the nation and kingdom that will not serve you in that day [Jerusalem] shall perish; yes, those nations shall be utterly laid waste."},{"num":13,"verse":"The glory of Lebanon shall come to you, the cypress, the plane, and the pine [trees] together, to beautify the place of My sanctuary; and I will make the place of My feet glorious."},{"num":14,"verse":"The sons of those who afflicted you shall come bending low to you, and all those who despised you shall bow down at your feet, and they shall call you the City of the Lord, the Zion of the Holy One of Israel."},{"num":15,"verse":"Whereas you have been forsaken and hated, so that no man passed through you, I will make you [Jerusalem] an eternal glory, a joy from age to age."},{"num":16,"verse":"You shall suck the milk of the [Gentile] nations and shall suck the breast of kings; and you shall recognize and know that I, the Lord, am your Savior and your Redeemer, the Mighty One of Jacob."},{"num":17,"verse":"Instead of bronze I will bring gold, and instead of iron I will bring silver; and instead of wood, bronze, and instead of stones, iron. [Instead of the tyranny of the present] I will appoint peace as your officers and righteousness as your taskmasters."},{"num":18,"verse":"Violence shall no more be heard in your land, nor devastation or destruction within your borders, but you shall call your walls Salvation and your gates Praise."},{"num":19,"verse":"The sun shall no more be your light by day, nor for brightness shall the moon give light to you, but the Lord shall be to you an everlasting light, and your God your glory and your beauty."},{"num":20,"verse":"Your sun shall no more go down, nor shall your moon withdraw itself, for the Lord shall be your everlasting light, and the days of your mourning shall be ended."},{"num":21,"verse":"Your people also shall all be [uncompromisingly and consistently] righteous; they shall possess the land forever, the branch of My planting, the work of My hands, that I may be glorified."},{"num":22,"verse":"The least one shall become a thousand [a clan], and the small one a strong nation. I, the Lord, will hasten it in its [appointed] time."}]