[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(28) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye are they which have continued with me in my temptations.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We trace a kind of loving tenderness in this recognition of faithfulness following upon the words of rebuke. The “temptations” cannot, it is clear, be those of which we commonly speak as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Temptation of the Christ, for that had been encountered in absolute solitude. The word must, accordingly be taken in its wider sense of “trials,” as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Corinthians 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Peter 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and probably referred to the crises in our Lord’s ministry (such, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e.g.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as those in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:60",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:68",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") when the enmity of scribes and rulers was most bitter, and many disciples had proved faithless and faint-hearted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Luke",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "PARTING PROMISES AND WARNINGS",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE LONELY CHRISTLuke 22:28",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE LONELY CHRIST",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We wonder at the disciples when we read of the unseemly strife for precedence which jars on the tender solemnities of the Last Supper. We think them strangely unsympathetic and selfish; and so they were. But do not let us be too hard on them, nor forget that there was a very natural reason for the close connection which is found in the gospels between our Lord’s announcements of His sufferings and this eager dispute as to who should be the greatest in the kingdom. They dimly understood what He meant, but they did understand this much, that His ‘sufferings’ were immediately to precede His ‘glory’-and so it is not, after all, to be so much wondered at if the apparent approach of these made the settlement of their places in the impending kingdom seem to them a very pressing question. We should probably have thought so too, if we had been among them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Perhaps, too, the immediate occasion of this strife who should be accounted the greatest, which drew from Christ the words of our text, may have been the unwillingness of each to injure his possible claim to pre-eminence by doing the servant’s tasks at the modest meal. May we not suppose that the basin and the towel were refused by one after another, with muttered words growing louder and angrier: ‘It is not my place,’ says Peter; ‘you, Andrew, take it-and so from hand to hand it goes, till the Master ends the strife and takes it Himself to wash their feet. Then, when He had sat down again, He may have spoken the words of which our text is part-in which He tells the wrangling disciples what is the true law of honour in His kingdom, namely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "service",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and points to Himself as the great example. With what emphasis the pathetic incident of the foot-washing invests the clause before our text: ‘I am among you as he that serveth.’ On that disclosure of the true law of pre-eminence in His kingdom there follows in this and following verses the assurance, that, unseemly as their strife, there was reward for them, and places of dignity there, because in all their selfishness and infirmity, they had still clung to their Master.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This being the original purpose of these words, I venture to use them for another. They give us, if I mistake not, a wonderful glimpse into the heart of Christ, and a most pathetic revelation of His thoughts and experiences, all the more precious because it is quite incidental and, we may say, unconscious.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. See then, here, the tempted Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. See then, here, the tempted Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In one sense, our Lord is His own perpetual theme. He is ever speaking of Himself, inasmuch as He is ever presenting what He is to us, and what He claims of us. In another sense, He scarcely ever speaks of Himself, inasmuch as deep silence, for the most part, lies over His own inward experiences. How precious, therefore, and how profoundly significant is that word here-’in My temptations’! So He summed up all His life. To feel the full force of the expression, it should be remembered that the temptation in the wilderness was past before His first disciple attached himself to Him, and that the conflict in Gethsemane had not yet come when these words were spoken. The period to which they refer, therefore, lies altogether within these limits, including neither. After the former, ‘Satan,’ we read, ‘departed from Him for a season.’ Before the latter, we read, ‘the prince of this world cometh.’ The space between, of which people are so apt to think as free from temptation, is the time of which our Lord is speaking now. The time when His followers ‘companied with Him’ is to His consciousness the time of His ‘temptations.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is not the point of view from which the Gospel narratives present it, for the plain reason that they are not autobiographies, and that Jesus said little about the continuous assaults to which He was exposed. It is not the point of view from which we often think of it. We are too apt to conceive of Christ’s temptations as all gathered together-curdled and clotted, as it were, at the two ends of His life, leaving the space between free. But we cannot understand the meaning of that life, nor feel aright the love and help that breathe from it, unless we think of it as a field of continual and diversified temptations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How remarkable is the choice of the expression! To Christ, His life, looking back on it, does not so much present itself in the aspect of sorrow, difficulty or pain, as in that of temptation. He looked upon all outward things mainly with regard to their power to help or to hinder His life’s work. So for us, sorrow or joy should matter comparatively little. The evil in the evil should be felt to be sin, and the true cross and burden of life should be to us, as to our Master, the appeals it makes to us to abandon our tasks, and fling away our filial dependence and submission.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is not the place to plunge into the thorny questions which surround the thought of the tempted Christ. However these may be solved, the great fact remains, that His temptations were most real and unceasing. It was no sham fight which He fought. The story of the wilderness is the story of a most real conflict; and that conflict is waged all through His life. True, the traces of it are few. The battle was fought on both sides in grim silence, as sometimes men wage a mortal struggle without a sound. But if there were no other witness of the sore conflict, the Victor’s shout at the close would be enough. His last words, ‘I have overcome the world,’ sound the note of triumph, and tell how sharp had been the strife. So long and hard had it been that He cannot forget it even in heaven, and from the throne holds forth to all the churches the hope of overcoming, ‘even as I also overcame.’ As on some battlefield whence all traces of the agony and fury have passed away, and harvests wave, and larks sing where blood ran and men groaned their lives out, some grey stone raised by the victors remains, and only the trophy tells of the forgotten fight, so that monumental word, ‘I have overcome’ stands to all ages as the record of the silent, life-long conflict.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is not for us to know how the sinless Christ was tempted. There are depths beyond our reach. This we can understand, that a sinless manhood is not above the reach of temptation; and this besides, that, to such a nature, the temptations must be suggested from without, not presented from within. The desire for food is simply a physical craving, but another personality than His own uses it to incite the Son to abandon dependence for His physical life on God. The trust in God’s protection is holy and good, and it may be truest wisdom and piety to incur danger in dependence on it, when God’s service calls, but a mocking voice without suggests, under the cloak of it, a needless rushing into peril at no call of conscience, and for no end of mercy, which is not religion but self-will. The desire to have the world for His own lay in Christ’s deepest heart, but the enemy of Christ and man, who thought the world his already, used it as giving occasion to suggest a smoother and shorter road to win all men unto Him than the ‘Via Dolorosa’ of the Cross. So the sinless Christ was tempted at the beginning, and so the sinless Christ was tempted, in various forms of these first temptations, throughout His life. The path which He had to tread was ever before Him, the shadow of the Cross was flung along His road from the first. The pain and sorrow, the shame and spitting, the contradiction of sinners against Himself, the easier path which needed but a wish to become His, the shrinking of flesh-all these made their appeal to Him, and every step of the path which He trod for us was trodden by the power of a fresh consecration of Himself to His task and a fresh victory over temptation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us not seek to analyse. Let us be content to worship, as we look, Let us think of the tempted Christ, that our conceptions of His sinlessness may be increased. His was no untried and cloistered virtue, pure because never brought into contact with seducing evil, but a militant and victorious goodness, that was able to withstand in the evil day. Let us think of the tempted Christ that our thankful thoughts of what He bore for us may be warmer and more adequate, as we stand afar off and look on at the mystery of His battle with our enemies and His. Let us think of the tempted Christ to make the lighter burden of our cross, and our less terrible conflict easier to bear and to wage. So will He ‘continue with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " temptations,’ and patience and victory flow to us from Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. See here the lonely Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. See here the lonely Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is no aspect of our Lord’s life more pathetic than that of His profound loneliness. I suppose the most utterly solitary man that ever lived was Jesus Christ. If we think of the facts of His life, we see how His nearest kindred stood aloof from Him, how ‘there were none to praise, and very few to love’; and how, even in the small company of His friends, there was absolutely none who either understood Him or sympathised with Him. We hear a great deal about the solitude in which men of genius live, and how all great souls are necessarily lonely. That is true, and that solitude of great men is one of the compensations which run through all life, and make the lot of the many little, more enviable than that of the few great. ‘The little hills rejoice together on every side,’ but far above their smiling companionships, the Alpine peak lifts itself into the cold air, and though it be ‘visited all night by troops of stars,’ it is lonely amid the silence and the snow. Talk of the solitude of pure character amid evil, like Lot in Sodom, or of the loneliness of uncomprehended aims and unshared thoughts-who ever experienced that as keenly as Christ did? That perfect purity must needs have been hurt by the sin of men as none else have ever been. That loving heart yearning for the solace of an answering heart must needs have felt a sharper pang of unrequited love than ever pained another. That spirit to which the things that are seen were shadows, and the Father and the Father’s house the ever-present, only realities must have felt itself parted from the men whose portion was in this life, by a gulf broader than ever opened between any other two souls that shared together human life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The more pure and lofty a nature, the more keen its sensitiveness, the more exquisite its delights, and the sharper its pains. The more loving and unselfish a heart, the more its longing for companionship: and the more its aching in loneliness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Very significant and pathetic are many points in the Gospel story bearing on this matter. The very choice of the Twelve had for its first purpose, ‘that they should be with Him,’ as one of the Evangelists tells us. We know how constantly He took the three who were nearest to Him along with Him, and that surely not merely that they might be ‘eyewitnesses of His majesty’ on the holy mount, or of His agony in Gethsemane, but as having a real gladness and strength even in their companionship amid the mystery of glory as amid the power of darkness. We read of His being alone but twice in all the gospels, and both times for prayer. And surely the dullest ear can hear a note of pain in that prophetic word: ‘The hour cometh that ye shall be scattered, every man to his own, and shall leave Me alone’; while every heart must feel the pitiful pathos of the plea, ‘Tarry ye here, and watch with Me.’ Even in that supreme hour, He longs for human companionship, however uncomprehending, and stretches out His hands in the great darkness, to feel the touch of a hand of flesh and blood-and, alas, for poor feeble love!-He gropes for it in vain. Surely that horror of utter solitude is one of the elements of His passion grave and sorrowful enough to be named by the side of the other bitterness poured into that cup, even as it was pain enough to form a substantive feature of the great prophetic picture: ‘I looked for some to take pity, but there was none; and for comforters, but I found none.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So here, a deep pain in His loneliness is implied in these words of our text which put the disciples’ participation in the glories of His throne as the issue of their loyal continuance with Him in the conflict of earth. These, and these only, had been by His side, and so much does He care for their companionship, that therefore they shall share His dominion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That lonely Christ sympathises with all solitary hearts. If ever we feel ourselves misunderstood and thrown back upon ourselves; if ever our hearts’ burden of love is rejected; if our outward lives be lonely and earth yields nothing to stay our longing for companionship; if our hearts have been filled with dear ones and are now empty or filled only with tears, let us think of Him and say, ‘Yet I am not alone.’ He lived alone, alone He died, that no heart might ever be solitary any more. ‘Could ye not watch with Me?’ was His gentle rebuke in Gethsemane. ‘Lo, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " am with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " always,’ is His mighty promise from the throne. In every step of life we may have Him for a companion, a friend closer than all others, nearer us than our very selves, if we may so say-and in the valley of the shadow of death we need fear no evil, for He will be with us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. See here the grateful Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. See here the grateful Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I almost hesitate to use the word, but there seems a distinct ring of thanks in the expression, and in the connection. And we need not wonder at that, if we rightly understand it. There is nothing in it inconsistent with our Lord’s character and relations to His disciples. Do you remember another instance in which one seems to hear the same tone, namely, in the marked warmth with which He acknowledges the beautiful service of Mary in breaking the fragrant casket of nard upon His head?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " All true love is glad when it is met, glad to give, and glad to receive. Was it not a joy to Jesus to be waited on by the ministering women? Would He not thank them because they served Him for love? I trow, yes. And if any one stumbles at the word ‘grateful’ as applied to Him, we do not care about the word so long as it is seen that His heart was gladdened by loving friends, and that He recognised in their society a ministry of love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Notice, too, the loving estimate of what these disciples had done. Their companionship had been imperfect enough at the best. They had given Him but blind affection, dashed with much selfishness. In an hour or two they would all have forsaken Him and fled. He knew all that was lacking in them, and the cowardly abandonment which was so near. But He has not a word to say of all this. He does not count jealously the flaws in our work, or reject it because it is incomplete. So here is the great truth clearly set forth, that where there is a loving heart, there is acceptable service. It is possible that our poor, imperfect deeds shall be an odour of a sweet smell, acceptable, well-pleasing to Him. Which of us that is a father is not glad at his children’s gifts, even though they be purchased with his own money, and be of little use? They mean love, so they are precious. And Christ, in like manner, gladly accepts what we bring, even though it be love chilled by selfishness, and faith broken by doubt,-submission crossed by self-will. The living heart of the disciples’ acceptable service was their love, far less intelligent and entire than ours may be. They were joined to their Lord, though with but partial sympathy and knowledge, in His temptations. It is possible for us to be joined to Jesus Christ more closely and more truly than they were during His earthly life. Union with Him here is union with Him hereafter. If we abide in Him amid the shows and shadows of earth, He will continue with us in our temptations, and so the fellowships begun on earth will be perfected in heaven, ‘if so be that we suffer with Him, that we may also be glorified together.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 22:28-30. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:28-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye have continued with me in my temptations ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εν τοις πειρασμοις μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in my trials ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and afflictions: and his whole life was little else than one continued series of them, particularly from the time of his entering on his public ministry. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I appoint unto you a kingdom ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— I will preserve you in all your temptations and trials here, and will confer on you a kingdom of glory hereafter: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I appoint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "not a primacy to one, but a kingdom to every one; and that on the same terms ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as my Father hath appointed to me ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who have fought and conquered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That ye may eat and drink at my table, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That ye may enjoy the highest happiness as guests, not as servants, and the highest dignity, not as subjects, but as princes. Now as these honours, which I shall hereafter confer on you, are incomparably beyond those about which you seem so solicitous, let a consideration of this awaken a nobler ambition in your minds, than that which appears now to influence them; and, instead of contending for superiority over each other, in my church militant, in which you must expect to meet with continual reproach and suffering, aspire after high degrees of that celestial glory, which you are to share with me in my church triumphant. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 19:28-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words seem to be primarily applicable to the twelve apostles, and secondarily to all Christ’s servants and disciples, whose spiritual powers, honours, and delights, are here represented in figurative terms, with respect to their advancement both in the kingdom of grace and glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:21-38 How unbecoming is the worldly ambition of being the greatest, to the character of a follower of Jesus, who took upon him the form of a servant, and humbled himself to the death of the cross! In the way to eternal happiness, we must expect to be assaulted and sifted by Satan. If he cannot destroy, he will try to disgrace or distress us. Nothing more certainly forebodes a fall, in a professed follower of Christ, than self-confidence, with disregard to warnings, and contempt of danger. Unless we watch and pray always, we may be drawn in the course of the day into those sins which we were in the morning most resolved against. If believers were left to themselves, they would fall; but they are kept by the power of God, and the prayer of Christ. Our Lord gave notice of a very great change of circumstances now approaching. The disciples must not expect that their friends would be kind to them as they had been. Therefore, he that has a purse, let him take it, for he may need it. They must now expect that their enemies would be more fierce than they had been, and they would need weapons. At the time the apostles understood Christ to mean real weapons, but he spake only of the weapons of the spiritual warfare. The sword of the Spirit is the sword with which the disciples of Christ must furnish themselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My temptations - My trials, my humiliations, and my assaults from the power of Satan and a wicked world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28. continued, &c.—affecting evidence of Christ's tender susceptibility to human sympathy and support! (See on [1723]Joh 6:66, 67; see Joh 16:32.)",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 28-30. These verses seem to contain (though in a few more words) the substance of what we met with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 19:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 19:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". There they are spoken as an answer to Peter, speaking on the behalf of himself and the rest of the apostles, who had forsaken all to follow Christ. Christ tells them there, that those ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which had followed him, in the regeneration when the Son of man should sit on the throne of his glory, should sit upon twelve thrones, judging the twelve tribes of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That time which our Lord there calleth the regeneration, is the time when he had been giving a new birth to the church, reforming the world by his doctrine and holy example. That time he here calleth the time of his temptations, by which he meaneth trials, afflictions, and persecutions, as the word is often taken in holy writ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Galatians 4:14 Jam 1:12 2 Peter 2:9 Revelation 3:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jam 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Peter 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "To those of the disciples (they were eleven of the twelve) he promises ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a kingdom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a state of great honour and dignity, as his Father had appointed him; and therefore they might satisfy themselves with the titles and qualities of ministers and servants while they were here, and be content to meet with troubles and temptations, as he had done, to hunger and thirst, &c.; when that time came which he had appointed, they should then eat and drink at his table, they should sit also upon thrones, judging the twelve tribes of Israel. Terms expressive of that rest and satisfaction, that glory, honour, and dignity, which the saints in God shall in heaven be possessed of. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye are they which have continued with me,.... From the beginning of his ministry, to that very time, they abode by him, and never departed from him, when others withdrew and walked no more with him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in my temptations: not in the wilderness by Satan; for they were not with him then, not being as yet called to be his disciples and followers: but in his afflictions, by the reproaches, and cavils, and ensnaring questions of the Scribes and Pharisees, and their attempts upon him to take away his life by stoning, &c. which were trials and temptations to him. So the Ethiopic version renders it, \"in my affliction\": now, since they had stood their ground, and firmly adhered to him in all his trials, he would have them still continue with him, and in his interest, though they should not have that temporal glory and grandeur they expected; but, on the contrary, fresh troubles and exercises, reproach, persecution, and death itself; and, for their encouragement, he promises both pleasure and honour, though of another sort, than what they were seeking after. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in my temptations: not in the wilderness by Satan; for they were not with him then, not being as yet called to be his disciples and followers: but in his afflictions, by the reproaches, and cavils, and ensnaring questions of the Scribes and Pharisees, and their attempts upon him to take away his life by stoning, &c. which were trials and temptations to him. So the Ethiopic version renders it, \"in my affliction\": now, since they had stood their ground, and firmly adhered to him in all his trials, he would have them still continue with him, and in his interest, though they should not have that temporal glory and grandeur they expected; but, on the contrary, fresh troubles and exercises, reproach, persecution, and death itself; and, for their encouragement, he promises both pleasure and honour, though of another sort, than what they were seeking after. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{9} Ye are they which have continued with me in my temptations.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{9}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Ye are they which have continued with me in my temptations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(9) Those who are partakers of the affliction of Christ will also be partakers of his kingdom.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 22:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑμεῖς δέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ye, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " making transition from words of correction to a more congenial style of address.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ διαμεμενηκότες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who have continued all through; the perfect participle, pointing them out as in possession of a permanent character, a body of thoroughly tried, faithful men.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πειρασμοῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in my ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temptations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pointing to all past experiences fitted to try faith and patience, which were of daily occurrence: temptations even to the Master, but still more to the disciples (in view of their spiritual weakness) to lose confidence in, and attachment to, One so peculiar, so isolated, and so much disliked and opposed by the people of repute and influence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in my temptations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 22:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Δε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") More shall be vouchsafed to you than you even hope for; not a mere precedency (primacy) of some kind or other among yourselves, but a kingdom to each of you individually. [The Lord knows truly how to advance His people to signal distinction. He revealed to them this very privilege, which was awaiting them, at that precise time when there was less danger impending of their being elated with pride by it.—V. g.]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πειρασμοῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temptations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The disciples were called after His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temptation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the wilderness. Therefore the whole life of Jesus Christ was full of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temptations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [to which He was exposed from Satan, the world, the Scribes, etc.—V. g.], through which (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temptations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He entered into glory. And such is the case with believers also. Christ also tempted (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " tried the faith of) the disciples. [They stood well at all points (in all respects). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:68",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“Jesus said, Will ye also go away—Lord to whom shall we go, thou?” etc.).—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "are they which have continued with me in my temptations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But after the gentle rebuke of their jealous ambition, which rebuke was veiled in the great instruction, their Master, with the tenderest grace, referred to their unswerving loyalty to him. Their faithfulness stood out at that hour in strong contrast with the conduct of Judas. It is always thus with their Master and ours. Every good deed, every noble thought, each bit of generosity and self-forgetfulness on our part, is at once recognized and rewarded a hundredfold ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "then.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke 22:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Continued (διαμεμενηκότες)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., \"have remained through\" (διά). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Luke 22:28Continued (διαμεμενηκότες)",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Continued (διαμεμενηκότες)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., \"have remained through\" (διά). ",
        "children": []
      }
    ]
  }
]