[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(43) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There appeared an angel unto him from heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This and the following verses are omitted by not a few of the best MSS., but the balance of evidence is, on the whole, in their favour. Assuming their truth as part of the Gospel, we ask—(1) How came the fact to be known to St. Luke, when St. Matthew and St. Mark had made no mention of it? and (2) What is the precise nature of the fact narrated? As regards (2), it may be noted that the angel is said to have “appeared to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him,”",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to our Lord only, and not to the disciples. He was conscious of a new strength to endure even to the end. And that strength would show itself to others, to disciples who watched Him afar off, in a new expression and look, flashes of victorious strength and joy alternating with throbs and spasms of anguish. Whence could that strength come but from the messengers of His Father, in Whose presence, and in communion with Whom He habitually lived (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The ministrations which had been with Him in His first temptation were now with Him in the last (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As to (1) we may think of one of the disciples who were present having reported to the “devout women,” from whom St. Luke probably, as we have seen, derived so much of the materials for his Gospel (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Introduction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ",",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that he had thus seen what seemed to him to admit of no other explanation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:39-46 Every description which the evangelists give of the state of mind in which our Lord entered upon this conflict, proves the tremendous nature of the assault, and the perfect foreknowledge of its terrors possessed by the meek and lowly Jesus. Here are three things not in the other evangelists. 1. When Christ was in his agony, there appeared to him an angel from heaven, strengthening him. It was a part of his humiliation that he was thus strengthened by a ministering spirit. 2. Being in agony, he prayed more earnestly. Prayer, though never out of season, is in a special manner seasonable when we are in an agony. 3. In this agony his sweat was as it were great drops of blood falling down. This showed the travail of his soul. We should pray also to be enabled to resist unto the shedding of our blood, striving against sin, if ever called to it. When next you dwell in imagination upon the delights of some favourite sin, think of its effects as you behold them here! See its fearful effects in the garden of Gethsemane, and desire, by the help of God, deeply to hate and to forsake that enemy, to ransom sinners from whom the Redeemer prayed, agonized, and bled.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Strengthening him - His human nature, to sustain the great burden that was upon his soul. Some have supposed from this that he was not divine as well as human; for if he was \"God,\" how could an angel give any strength or comfort? and why did not the divine nature \"alone\" sustain the human? But the fact that he was \"divine\" does not affect the case at all. It might be asked with the same propriety, If he was, as all admit, the friend of God, and beloved of God, and holy, why, if he was a mere man, did not \"God\" sustain him alone, without an angel's intervening? But the objection in neither case would have any force. The \"man, Christ Jesus,\" was suffering. His human nature was in agony, and it is the \"manner\" of God to sustain the afflicted by the intervention of others; nor was there any more \"unfitness\" in sustaining the human nature of his Son in this manner than any other sufferer.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "40. the place—the Garden of Gethsemane, on the west or city side of the mount. Comparing all the accounts of this mysterious scene, the facts appear to be these: (1) He bade nine of the Twelve remain \"here\" while He went and prayed \"yonder.\" (2) He \"took the other three, Peter, James, and John, and began to be sore amazed [appalled], sorrowful, and very heavy [oppressed], and said, My soul is exceeding sorrowful even unto death\"—\"I feel as if nature would sink under this load, as if life were ebbing out, and death coming before its time\"—\"tarry ye here, and watch with Me\"; not, \"Witness for Me,\" but, \"Bear Me company.\" It did Him good, it seems, to have them beside Him. (3) But soon even they were too much for Him: He must be alone. \"He was withdrawn from them about a stone's-cast\"—though near enough for them to be competent witnesses and kneeled down, uttering that most affecting prayer (Mr 14:36), that if possible \"the cup,\" of His approaching death, \"might pass from Him, but if not, His Father's will be done\": implying that in itself it was so purely revolting that only its being the Father's will would induce Him to taste it, but that in that view of it He was perfectly prepared to drink it. It is no struggle between a reluctant and a compliant will, but between two views of one event—an abstract and a relative view of it, in the one of which it was revolting, in the other welcome. By signifying how it felt in the one view, He shows His beautiful oneness with ourselves in nature and feeling; by expressing how He regarded it in the other light, He reveals His absolute obediential subjection to His Father. (4) On this, having a momentary relief, for it came upon Him, we imagine, by surges, He returns to the three, and finding them sleeping, He addresses them affectingly, particularly Peter, as in Mr 14:37, 38. He then (5) goes back, not now to kneel, but fell on His face on the ground, saying the same words, but with this turn, \"If this cup may not pass,\" &c. (Mt 26:42)—that is, 'Yes, I understand this mysterious silence (Ps 22:1-6); it may not pass; I am to drink it, and I will'—\"Thy will be done!\" (6) Again, for a moment relieved, He returns and finds them \"sleeping for sorrow,\" warns them as before, but puts a loving construction upon it, separating between the \"willing spirit\" and the \"weak flesh.\" (7) Once more, returning to His solitary spot, the surges rise higher, beat more tempestuously, and seem ready to overwhelm Him. To fortify Him for this, \"there appeared an angel unto Him from heaven strengthening Him\"—not to minister light or comfort (He was to have none of that, and they were not needed nor fitted to convey it), but purely to sustain and brace up sinking nature for a yet hotter and fiercer struggle. And now, He is \"in an agony, and prays more earnestly\"—even Christ's prayer, it seems, admitted of and now demanded such increase—\"and His sweat was as it were great drops [literally, 'clots'] of blood falling down to the ground.\" What was this? Not His proper sacrificial offering, though essential to it. It was just the internal struggle, apparently hushing itself before, but now swelling up again, convulsing His whole inner man, and this so affecting His animal nature that the sweat oozed out from every pore in thick drops of blood, falling to the ground. It was just shuddering nature and indomitable will struggling together. But again the cry, If it must be, Thy will be done, issues from His lips, and all is over. \"The bitterness of death is past.\" He has anticipated and rehearsed His final conflict, and won the victory—now on the theater of an invincible will, as then on the arena of the Cross. \"I will suffer,\" is the grand result of Gethsemane: \"It is finished\" is the shout that bursts from the Cross. The Will without the Deed had been all in vain; but His work was consummated when He carried the now manifested Will into the palpable Deed, \"by the which WILL we are sanctified THROUGH THE OFFERING OF THE BODY OF Jesus Christ once for all\" (Heb 10:10). (8) At the close of the whole scene, finding them still sleeping (worn out with continued sorrow and racking anxiety), He bids them, with an irony of deep emotion, \"sleep on now and take their rest, the hour is come, the Son of man is betrayed into the hands of sinners, rise, let us be going, the traitor is at hand.\" And while He spoke, Judas approached with his armed band. Thus they proved \"miserable comforters,\" broken reeds; and thus in His whole work He was alone, and \"of the people there was none with Him.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 43,44. We have formerly opened these verses in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 26:44-46",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:44-46",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where we took them in, as being a part of the history of our Saviour’s praying before his passion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there appeared an angel unto him from heaven,.... Whether this was Michael the archangel, as some have conjectured, or Gabriel, or what particular angel, is not for us to know, nor is it of any importance: it is certain, it was a good angel: \"an angel of God\", as the Ethiopic version reads; since he came from heaven, and was one of the angels of heaven, sent by God on this occasion; and it is clear also, that he was in a visible form, and was seen by Christ, since he is said to appear to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "strengthening him; under his present distress, against the terrors of Satan, and the fears of death, by assuring him of the divine favour, as man, and of the fulfilment of the promises to him to stand by him, assist, strengthen, and carry him through what was before him; and by observing to him the glory and honour he should be crowned with, after his sufferings and death, find the complete salvation of his people, which would be obtained hereby, and which was the joy set before him; and which animated him, as man, to bear the cross, and despise the shame with a brave and heroic Spirit. Now, though God the Father could have strengthened the human nature of Christ, without making use of an angel; and Christ could have strengthened it himself, by his divine nature, to which it was united; but the human nature was to be brought into so low a condition, and to be left to itself, as to stand in need of the assistance of an angel: and this shows not only the ministration of angels to Christ, as man, but that he was at this present time made a little lower than the angels, who was the Creator and Lord of them; as he afterwards more apparently was, through the sufferings of death. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "strengthening him; under his present distress, against the terrors of Satan, and the fears of death, by assuring him of the divine favour, as man, and of the fulfilment of the promises to him to stand by him, assist, strengthen, and carry him through what was before him; and by observing to him the glory and honour he should be crowned with, after his sufferings and death, find the complete salvation of his people, which would be obtained hereby, and which was the joy set before him; and which animated him, as man, to bear the cross, and despise the shame with a brave and heroic Spirit. Now, though God the Father could have strengthened the human nature of Christ, without making use of an angel; and Christ could have strengthened it himself, by his divine nature, to which it was united; but the human nature was to be brought into so low a condition, and to be left to itself, as to stand in need of the assistance of an angel: and this shows not only the ministration of angels to Christ, as man, but that he was at this present time made a little lower than the angels, who was the Creator and Lord of them; as he afterwards more apparently was, through the sufferings of death. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And there appeared an angel unto him from heaven, strengthening him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "43.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there appeared an angel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As after His temptation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This and the next verse are not of absolutely certain authenticity, since they are omitted in A, B, and by the first corrector of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "א",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Jerome and Hilary say that they were omitted in “very many” Greek and Latin MSS. Their omission may have been due to mistaken reverence; or their insertion may have been made by the Evangelist himself in a later recension.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 22:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at this moment!) The very appearance of the angel was a sign of His actually then drinking the cup, and of His prayer being granted [",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "], So utterly incapable is human reason of comprehending the profound depths of His agony in the garden, that some have in former times omitted this whole paragraph. See the Apparat.[247] When His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "baptism",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is mentioned along with the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cup",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cup",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " means His internal passion [suffering], as, for instance, His desertion by the Father on the cross; the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "baptism",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " means His external suffering: comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 10:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. Where the ‘cup’ is mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "alone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", His whole passion generally is understood, at least in such a way as that, under the internal, there is also included the external suffering.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐνισχύων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strengthening",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") not by exhortation, but by invigoration. The same verb occurs, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 9:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Paul, “when he had ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "received meat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strengthened",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "”].",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[247] AB 1 MS. of Memph. Theb. omit from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὤφθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γῆν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 22:43-44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hilary 1062, writes, “Nec sane ignorandum a nobis est, et in Græcis et in Latinis codicibus complurimis vel de adveniente angelo, vel de sudore sanguinis, nil scriptum reperiri.” But Hilary, 1061, “(Lucas) angelum astitisse comfortantem eum, quo assistante orare prolixius cæperit ita ut guttis sanguinum corporis sudor efflueret (non Matt. et Marc.)” The Syrians are charged by Photius, the Armenians by Nicon, with having erased the passage in question. DQLX",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Vulg. and Euseb. Canons have it. Iren. 219, writes, “Nec (si veram carnem non habuisset) sudasset globos sanguinis.” Just, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cum Tryph.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " p. 331 (Ed. Col.), also supports it.—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 43.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And there appeared an angel unto him from heaven, strengthening him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Lord's words reported by St. Matthew were no mere figure of rhetoric. \"My soul is exceeding sorrowful, even unto death.\" The anguish and horror were so great that he himself, according to his humanity, must have before the time become the victim of death had he not been specially strengthened from above. This is the deep significance and necessity of the angel's appearance. So Stier and Godet, the latter of whom writes, \"As when in the wilderness under the pressure of famine he felt himself dying, the presence of this heavenly being sends a vivifying breath over him, - a Divine refreshing pervades him, body and soul, and it is thus he receives strength to continue to the last the struggle.\" Luke 22:43",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There appeared (ὤφθη)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The word most commonly used in the New Testament of seeing visions. See Matthew 17:3; Mark 9:4; Luke 1:11; Luke 22:43; Acts 2:17; Acts 7:35. The kindred noun ὀπτασία, wherever it occurs in the New Testament, means a vision. See Luke 1:2; Luke 24:23, etc.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The word most commonly used in the New Testament of seeing visions. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The kindred noun ὀπτασία, wherever it occurs in the New Testament, means a vision. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Strengthening (ἐνισχύων)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Only here and Acts 9:19. See on was not able, Luke 14:30; and cannot, Luke 16:3. Commonly intransitive; to prevail in or among. Used transitively only by Hippocrates and Luke. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Only here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 9:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See on was not able, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 14:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and cannot, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Commonly intransitive; to prevail in or among. Used transitively only by Hippocrates and Luke. ",
            "children": []
          }
        ]
      }
    ]
  }
]