[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(45) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He found them sleeping for sorrow.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is, perhaps, again characteristic of St. Luke, that while the other Gospels state simply the fact that the disciples slept, he assigns it psychologically and physiologically to its cause. Prolonged sorrow has, at last, a numbing and narcotising effect. (See Note on “believing not for joy,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 22:45-46",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:45-46",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when he rose up from prayer — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "After this dreadful conflict; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and was come to his disciples ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, the third time; notwithstanding the repeated admonitions he had given them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he again found them sleeping ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— And that, as the evangelist says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for sorrow ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The sensations of grief which they felt at the sight of their Master’s distress so overpowering them, that they sunk into sleep; a circumstance which shows how much they were affected with his sufferings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And said unto them, Why sleep ye ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Why do you still persist to sleep at such a season as this? I call upon you yet once more, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to rise and pray, lest ye enter into ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and fall by the approaching most dangerous ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temptation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See the various circumstances attending this dreadful scene of our Lord’s sufferings in the garden more fully elucidated in the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:36-46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 14:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:39-46 Every description which the evangelists give of the state of mind in which our Lord entered upon this conflict, proves the tremendous nature of the assault, and the perfect foreknowledge of its terrors possessed by the meek and lowly Jesus. Here are three things not in the other evangelists. 1. When Christ was in his agony, there appeared to him an angel from heaven, strengthening him. It was a part of his humiliation that he was thus strengthened by a ministering spirit. 2. Being in agony, he prayed more earnestly. Prayer, though never out of season, is in a special manner seasonable when we are in an agony. 3. In this agony his sweat was as it were great drops of blood falling down. This showed the travail of his soul. We should pray also to be enabled to resist unto the shedding of our blood, striving against sin, if ever called to it. When next you dwell in imagination upon the delights of some favourite sin, think of its effects as you behold them here! See its fearful effects in the garden of Gethsemane, and desire, by the help of God, deeply to hate and to forsake that enemy, to ransom sinners from whom the Redeemer prayed, agonized, and bled.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sleeping for sorrow - On account of the greatness of their sorrow. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "40. the place—the Garden of Gethsemane, on the west or city side of the mount. Comparing all the accounts of this mysterious scene, the facts appear to be these: (1) He bade nine of the Twelve remain \"here\" while He went and prayed \"yonder.\" (2) He \"took the other three, Peter, James, and John, and began to be sore amazed [appalled], sorrowful, and very heavy [oppressed], and said, My soul is exceeding sorrowful even unto death\"—\"I feel as if nature would sink under this load, as if life were ebbing out, and death coming before its time\"—\"tarry ye here, and watch with Me\"; not, \"Witness for Me,\" but, \"Bear Me company.\" It did Him good, it seems, to have them beside Him. (3) But soon even they were too much for Him: He must be alone. \"He was withdrawn from them about a stone's-cast\"—though near enough for them to be competent witnesses and kneeled down, uttering that most affecting prayer (Mr 14:36), that if possible \"the cup,\" of His approaching death, \"might pass from Him, but if not, His Father's will be done\": implying that in itself it was so purely revolting that only its being the Father's will would induce Him to taste it, but that in that view of it He was perfectly prepared to drink it. It is no struggle between a reluctant and a compliant will, but between two views of one event—an abstract and a relative view of it, in the one of which it was revolting, in the other welcome. By signifying how it felt in the one view, He shows His beautiful oneness with ourselves in nature and feeling; by expressing how He regarded it in the other light, He reveals His absolute obediential subjection to His Father. (4) On this, having a momentary relief, for it came upon Him, we imagine, by surges, He returns to the three, and finding them sleeping, He addresses them affectingly, particularly Peter, as in Mr 14:37, 38. He then (5) goes back, not now to kneel, but fell on His face on the ground, saying the same words, but with this turn, \"If this cup may not pass,\" &c. (Mt 26:42)—that is, 'Yes, I understand this mysterious silence (Ps 22:1-6); it may not pass; I am to drink it, and I will'—\"Thy will be done!\" (6) Again, for a moment relieved, He returns and finds them \"sleeping for sorrow,\" warns them as before, but puts a loving construction upon it, separating between the \"willing spirit\" and the \"weak flesh.\" (7) Once more, returning to His solitary spot, the surges rise higher, beat more tempestuously, and seem ready to overwhelm Him. To fortify Him for this, \"there appeared an angel unto Him from heaven strengthening Him\"—not to minister light or comfort (He was to have none of that, and they were not needed nor fitted to convey it), but purely to sustain and brace up sinking nature for a yet hotter and fiercer struggle. And now, He is \"in an agony, and prays more earnestly\"—even Christ's prayer, it seems, admitted of and now demanded such increase—\"and His sweat was as it were great drops [literally, 'clots'] of blood falling down to the ground.\" What was this? Not His proper sacrificial offering, though essential to it. It was just the internal struggle, apparently hushing itself before, but now swelling up again, convulsing His whole inner man, and this so affecting His animal nature that the sweat oozed out from every pore in thick drops of blood, falling to the ground. It was just shuddering nature and indomitable will struggling together. But again the cry, If it must be, Thy will be done, issues from His lips, and all is over. \"The bitterness of death is past.\" He has anticipated and rehearsed His final conflict, and won the victory—now on the theater of an invincible will, as then on the arena of the Cross. \"I will suffer,\" is the grand result of Gethsemane: \"It is finished\" is the shout that bursts from the Cross. The Will without the Deed had been all in vain; but His work was consummated when He carried the now manifested Will into the palpable Deed, \"by the which WILL we are sanctified THROUGH THE OFFERING OF THE BODY OF Jesus Christ once for all\" (Heb 10:10). (8) At the close of the whole scene, finding them still sleeping (worn out with continued sorrow and racking anxiety), He bids them, with an irony of deep emotion, \"sleep on now and take their rest, the hour is come, the Son of man is betrayed into the hands of sinners, rise, let us be going, the traitor is at hand.\" And while He spoke, Judas approached with his armed band. Thus they proved \"miserable comforters,\" broken reeds; and thus in His whole work He was alone, and \"of the people there was none with Him.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 45,46. The relations which Matthew and Mark give us are both more particular than that given us by Luke, to which we refer the reader. Luke speaketh but of his praying once; Matthew saith he prayed thrice. Luke mentions nothing of his withdrawing with Peter, James, and John from the other eight; Matthew and Mark both mention it. Luke maketh mention of an angel’s appearing to him, of the agony in which he was, and his sweating drops as it were of blood; which neither Matthew nor Mark take notice of: yet we must not think, that either any one of the evangelists, or all of them together, give a perfect account of all the words our Saviour used in these prayers, only they tell us the sum of them in different words; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 26:40\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and following verses to ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 26:41",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:41",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 14:37\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and following verses to ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 14:38",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:38",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where we have fully considered whatsoever is said by any of the evangelists upon this argument. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he rose from prayer,.... The Syriac version reads, \"from his prayer\", having finished it; and the Persic and Ethiopic versions read, \"from the place of prayer\", or where he prayed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and was come to his disciples; to the three, which he had left about the distance of a stone's cast: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he found them sleeping for sorrow; on his account; for he had signified unto them, how exceeding sorrowful he was; and they might perceive by his looks and gestures, the anxiety and distress of mind he was in, which must needs affect them; and besides, he had given them some intimations of his being to be betrayed by one of them, and of his sufferings and death, and speedy departure from them; and because of these things, sorrow had filled their hearts, and this had induced heaviness and sleep upon them; See Gill on Matthew 26:40. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he found them sleeping for sorrow; on his account; for he had signified unto them, how exceeding sorrowful he was; and they might perceive by his looks and gestures, the anxiety and distress of mind he was in, which must needs affect them; and besides, he had given them some intimations of his being to be betrayed by one of them, and of his sufferings and death, and speedy departure from them; and because of these things, sorrow had filled their hearts, and this had induced heaviness and sleep upon them; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{15} And when he rose up from prayer, and was come to his disciples, he found them sleeping for sorrow,",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{15}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And when he rose up from prayer, and was come to his disciples, he found them sleeping for sorrow,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(15) Men are utterly sluggish, even in their greatest dangers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 22:45-46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Return of Jesus to His disciples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ τῆς προσευχῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": rising up ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the prayer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", seems to continue the narrative from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 22:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ τῆς λύπης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", asleep ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from grief",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", apologetic; Hebraistic construction, therefore not added by Lk., but got from a Jewish-Christian document, says J. Weiss (in Meyer). Doubtless Lk.’s, added out of delicate feeling for the disciples, and with truth to nature, for grief does induce sleep (“moestitia somnum affert,” Wolf).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "45.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sleeping for sorrow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The last two words give rather the cause than the excuse. They are analogous to “the spirit indeed is willing, but the flesh is weak” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". St Luke here abbreviates the fuller records given in Matthew 26; Mark 14, from which we find that Jesus ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thrice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " came to His Apostles, and thrice found them sleeping (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "),—each momentary pause of prayer marking a fresh step in His victorious submission. This was the Temptation of Jesus by every element of anguish, as He had been tempted in the wilderness by every element of desire.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "[45. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καὶ ἀναστὰς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and when He rose up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Given up completely to the will of the Father.—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 45, 46.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He found them sleeping for sorrow, and said unto them, Why sleep ye rise and pray, lest ye enter into temptation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The events of the past evening; the long excitement stirred up by listening to such words as their Master had been speaking to them during the sad hours of the Last Supper; the sure consciousness of coming sorrow; then the walk through the silent city: - all predisposed them to sleep. Commentators are never weary with pressing these excuses for the slumber of the eleven at that awful moment. But all these things, though they may well have predisposed them to slumber, are not sufficient to account for that strange heavy sleep which seems to have paralyzed the eleven in Gethsemane. In spite of their Master's solemn injunction to watch and pray, he finds them, several times during that dreadful watch of his in the garden, asleep, in spite of his asking them for sympathy and prayer, in spite of his evident longing for their sympathy - each time he cast his eyes on them, he sees them, not watching, but sleeping! Many a time in their work-filled lives those fishermen he loved so well, John and Peter and Andrew, had toiled all night with their nets; but on this night of sorrow, when their pleading voices were listened for, possibly their hand-press waited for, their silent sympathy certainly longed for, they slept, seemingly forgetful of all save their own ease and comfort. Surely on this night of temptation they were influenced by some invisible power, who lulled them to sleep during those precious moments when they should have been agonizing with their Master in prayer, and so arming themselves against the supreme moment of temptation just coming upon them. But swayed by the power of evil of whom the Lord had been warning them, but in vain, they let the moments slip by, and the hour of temptation came on them unawares. We know how grievously they all fell. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"'Forsake the Christ thou sawest transfigured! himWho trod the sea and brought the dead to life?What should wring this from thee?' - ye laugh and ask.What wrung it? Even a torchlight and a noise,The sudden Roman faces, violent hands,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"'Forsake the Christ thou sawest transfigured! him",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Who trod the sea and brought the dead to life?",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "What should wring this from thee?' - ye laugh and ask.",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "What wrung it? Even a torchlight and a noise,",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The sudden Roman faces, violent hands,",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And fear of what the Jews might do! Just that;And it is written, 'I forsook and fled:'There was my trial, and it ended thus .\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And fear of what the Jews might do! Just that;",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And it is written, 'I forsook and fled:'",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "There was my trial, and it ended thus .\"",
            "children": []
          }
        ]
      },
      {
        "element": "br",
        "class": "",
        "text": "",
        "children": []
      },
      {
        "element": "br",
        "class": "",
        "text": "",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "note_acc",
        "text": "Browning, 'A Death in the Desert.'",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Luke 22:45",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For sorrow",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The mention of the cause of the drowsiness is characteristic.",
        "children": []
      }
    ]
  }
]