[{"num":10,"verse":"And it came to pass after this, that Melech Bnei Ammon died, and Chanun bno reigned in his place."},{"num":2,"verse":"Then said Dovid, I will show chesed unto Chanun Ben Nachash, as aviv (his father) showed chesed unto me. And Dovid sent to console him by the yad of his avadim for aviv. And avadim of Dovid came into Eretz Bnei Ammon."},{"num":3,"verse":"And the sarim (princes) of the Bnei Ammon said unto Chanun their adon, Thinkest thou that Dovid doth honor avicha, that he hath sent menachamim (comforters) unto thee? Hath not Dovid rather sent his avadim unto thee, to explore the Ir, and to spy it out, and to overthrow it?"},{"num":4,"verse":"Therefore, Chanun took the avadim of Dovid, and shaved off half of their zekanim (beards), and cut off their garments in the middle, even to their buttocks, and sent them away."},{"num":5,"verse":"When they told it unto Dovid, he sent to meet them, because the anashim were greatly humiliated; and HaMelech said, Tarry at Yericho until your zekanim be grown, and then return."},{"num":6,"verse":"And when the Bnei Ammon saw that they became stench before Dovid, the Bnei Ammon sent and hired the Syrians of Beit-Rechov and the Syrians of Tzova, twenty elef foot soldiers, and of Melech Ma’akhah an elef ish, and of Ish-Tov, twelve elef ish."},{"num":7,"verse":"And when Dovid heard of it, he sent Yoav, and all the tzava (host, army) of the Gibborim."},{"num":8,"verse":"And the Bnei Ammon came out, arrayed for milchamah at the petach hasha’ar (city gate); and the Syrians of Tzova, and of Rechov, and Ish-Tov, and Ma’akhah, were by themselves in the sadeh."},{"num":9,"verse":"When Yoav saw that the front of the milchamah (battle) was against him before and behind, he chose of all the choice men of Yisroel, and put them in array against the Syrians;"},{"num":10,"verse":"And the rest of the people he delivered under the yad (command) of Avishai achiv (his brother), that he might put them in array against the Bnei Ammon."},{"num":11,"verse":"And he said, If the Syrians be too strong for me, then thou shalt be for me for yeshuah (salvation, rescue); but if the Bnei Ammon be too strong for thee, then I will come for you for yeshuah (salvation, rescue)."},{"num":12,"verse":"Chazak (be strong)! And let us play the man for amenu (our people), and for the towns of Eloheinu; and Hashem do that which seemeth Him hatov in His einayim."},{"num":13,"verse":"And Yoav drew near, and HaAm that were with him, unto the milchamah against the Syrians; and they fled before him."},{"num":14,"verse":"And when the Bnei Ammon saw that the Syrians were fled, then fled they also before Avishai, and entered into the Ir. So Yoav returned from the Bnei Ammon, and came to Yerushalayim."},{"num":15,"verse":"And when the Syrians saw that they were defeated before Yisroel, they gathered themselves together."},{"num":16,"verse":"And Hadadezer sent, and brought out the Syrians that were beyond the Nahar; and they came to Chelam; and Shovach the Sar Tzeva (commander of the army) of Hadadezer went before them."},{"num":17,"verse":"And when it was told Dovid, he gathered kol Yisroel together, and crossed over Yarden, and came to Chelam. And the Syrians set themselves in array against Dovid, and fought against him."},{"num":18,"verse":"And the Syrians fled before Yisroel; and Dovid slaughtered the men of seven hundred chariots of the Syrians, and forty elef parashim, and struck down Shovach the Sar of his Tzeva (army), who died there."},{"num":19,"verse":"And when all the melachim that were avadim (vassals) to Hadadezer saw that they were defeated before Yisroel, they made shalom with Yisroel, and served them. So the Syrians feared to help the Bnei Ammon any more."}]