[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It is a light thing for the shadow to go down.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Because that was the ordinary course of things. As a natural phenomenon, of course, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sudden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " extension of the shadow would have been as wonderful as its retrogression; but what is in any way a familiar occurrence must needs ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " easier than what has never fallen under observation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To go down.—Rather, to spread. The LXX. has κλῖναι, another use of the Hebrew verb. The Targum, Syriac, and Arabic render “to go forward” (march).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "To go down.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "to spread.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The LXX. has ",
            "children": []
          },
          {
            "element": "span",
            "class": "greekheb",
            "text": "κλῖναι",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ",",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " another use of the Hebrew verb. The Targum, Syriac, and Arabic render “to go forward” (march).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 20:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 20:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is a light thing for the sun to go down ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, in an instant: for that motion of the sun is natural as to the kind of it, though miraculous for the swiftness of it; but the motion backward would be both ways miraculous.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:1-11 Hezekiah was sick unto death, in the same year in which the king of Assyria besieged Jerusalem. A warning to prepare for death was brought to Hezekiah by Isaiah. Prayer is one of the best preparations for death, because by it we fetch in strength and grace from God, to enable us to finish well. He wept sorely: some gather from hence that he was unwilling to die; it is in the nature of man to dread the separation of soul and body. There was also something peculiar in Hezekiah's case; he was now in the midst of his usefulness. Let Hezekiah's prayer, see Isa 38. interpret his tears; in that is nothing which is like his having been under that fear of death, which has bondage or torment. Hezekiah's piety made his sick-bed easy. O Lord, remember now; he does not speak as if God needed to be put in mind of any thing by us; nor, as if the reward might be demanded as due; it is Christ's righteousness only that is the purchase of mercy and grace. Hezekiah does not pray, Lord, spare me; but, Lord, remember me; whether I live or die, let me be thine. God always hears the prayers of the broken in heart, and will give health, length of days, and temporal deliverances, as much and as long as is truly good for them. Means were to be used for Hezekiah's recovery; yet, considering to what a height the disease was come, and how suddenly it was checked, the cure was miraculous. It is our duty, when sick, to use such means as are proper to help nature, else we do not trust God, but tempt him. For the confirmation of his faith, the shadow of the sun was carried back, and the light was continued longer than usual, in a miraculous manner. This work of wonder shows the power of God in heaven as well as on earth, the great notice he takes of prayer, and the great favour he bears to his chosen.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It is a light thing - It seemed to Hezekiah comparatively easy that the shadow, which had already begun to lengthen, should merely make a sudden jump in the same direction; but, wholly contrary to all experience that it should change its direction, advancing up the steps again when it had once begun to descend them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2Ki 20:8-20. The Sun Goes Ten Degrees Backward.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8-11. Hezekiah said unto Isaiah, What will be the sign that the Lord shall heal me—His recovery in the course of nature was so unlooked for, that the king asked for some token to justify his reliance on the truth of the prophet's communication; and the sign he specified was granted to him. The shadow of the sun went back upon the dial of Ahaz the ten degrees it had gone down. Various conjectures have been formed as to this dial. The word in the original is \"degrees,\" or \"steps,\" and hence many commentators have supposed that it was a stair, so artfully contrived, that the shadows on the steps indicated the hours and course of the sun. But it is more probable that it was a proper instrument, and, from the Hebrews having no term to designate it, that it was one of the foreign novelties imported from Babylon by Ahaz. It seems to have been of such magnitude, and so placed in the court, that Isaiah could point to it, and the king see it, from his chamber. The retrogression of the sun's shadow on the dial was miraculously accomplished by the omnipotent power of God; but the phenomenon was temporary, local, confined to the notice, and intended for the satisfaction, only of Hezekiah and his court.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To go down ten degrees, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, in an instant; for that course or motion of the sun is natural for the kind of it, though miraculous for the swiftness of it; but the other would be both ways miraculous. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Hezekiah answered, it is a light thing for the shadow to go down ten degrees,.... That is, it was comparatively so, otherwise to go down ten degrees at once would be extraordinary and miraculous; but that was more agreeable to the nature and course of it to go forward, and so the miracle would be less apparent: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "nay, but let the shadow return backward ten degrees; which was directly contrary to its natural order and course, whereby the miracle would appear more clear and manifest: these degrees are by some said (x) to be half hours, and not full ones, since it is observed the sun shines not twenty full hours on any dial, unless under the pole; the sun is supposed to have been now at the fifth full hour; the sun was brought back five whole hours, then came forward five, then came forward two degrees, or one hour, to the sixth hour; which made sixteen; then it was six hours to sunset; so that day was prolonged twenty two hours: the Chinese (y) relate, that, in the time of Kingcungus, the planet Mars, for sake of the king, went back three degrees. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Weemse's Christ. Synagog. l. 1. c. 6. sect. 6. p. 167. See his Exposition of the Judicial Laws, c. 25. p. 90. &c. (y) Martin. Sinic. Hist. l. 4. p. 138. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x) Weemse's Christ. Synagog. l. 1. c. 6. sect. 6. p. 167. See his Exposition of the Judicial Laws, c. 25. p. 90. &c. (y) Martin. Sinic. Hist. l. 4. p. 138. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Hezekiah answered, It is a light thing for the shadow to go down ten degrees: nay, but let the shadow {g} return backward ten degrees.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Hezekiah answered, It is a light thing for the shadow to go down ten degrees: nay, but let the shadow ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " return backward ten degrees.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Let the sun go so many degrees back, that the hours may be fewer in the king's dial.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is a light thing for the shadow to go down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "decline",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ten degrees",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "steps",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The verb is not the same as that translated ‘to go down’ in verse 11. The king’s meaning is that it appears more natural and therefore easier, for the shadow to make a sudden advance in the direction in which it has been already going, than to turn in the contrary way.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let the shadow return backward ten degrees",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "steps",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus reversing the order of nature.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Hezekiah answered, It is a light thing for the shadow to go down ten degrees.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hezekiah views it as a comparatively easy thing for the shadow, which is already descending the steps, to accelerate its pace and rapidly descend fifteen degrees instead of slowly traversing them; and therefore accepts Isaiah's other offer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Nay, but let the shadow return backward ten degrees.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Let it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", change its direction, and having descended a certain distance, suddenly return and ascend again. This will be no \"light thing,\" but a great marvel, which will thoroughly convince him. The thought was natural, though perhaps not strictly logical. 2 Kings 20:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "הצּל הלך: \"the shadow is gone ten degrees, if it should go back ten degrees?\" The rendering, visne umbram solarii decem gradibus progredi an ... regredi, which Maurer still gives after the Vulgate, vis an ut ascendat ... an ut revertatur, cannot be grammatically reconciled with the perfect הלך, and is merely a conjecture founded upon the answer of Hezekiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Hitzig and Knobel would therefore read הלך, though without furnishing any proofs that the inf. abs. is used for the future in the first clause of a double question, especially if the ה interrog. is wanting, and there is no special emphasis upon the verbal idea.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "According to this answer, \"it is easy for the shadow to decline (i.e., to go farther down) ten degrees; no (sc., that shall not be a sign to me), but if the shadow turn ten degrees backwards,\" Isaiah seems to have given the king a choice as to the sign, namely, whether the shadow should go ten degrees forward or backward. But this does not necessarily follow from the words quoted. Hezekiah may have understood the prophet's words וגו הצּל הלך hypothetically: \"has the shadow gone (advanced) ten degrees, whether it should,\" etc.; and may have replied, the advance of the shadow would not be a sure sign to him, but only its going back.",
        "children": []
      }
    ]
  }
]