[{"num":2,"verse":"¶ Now these are the sons of the province that went up out of the captivity, of those which had been carried away, whom Nebuchadnezzar the king of Babylon had carried away unto Babylon, and that returned unto Jerusalem and Judah, every one unto his city,"},{"num":2,"verse":"which came with Zerubbabel: Jeshua, Nehemiah, Seraiah, Reelaiah, Mordecai, Bilshan, Mispar, Bigvai, Rehum, Baanah. The number of the men of the people of Israel:"},{"num":3,"verse":"The sons of Parosh, two thousand one hundred seventy-two."},{"num":4,"verse":"The sons of Shephatiah, three hundred seventy-two."},{"num":5,"verse":"The sons of Arah, seven hundred seventy-five."},{"num":6,"verse":"The sons of Pahathmoab, of the sons of Jeshua and Joab, two thousand eight hundred and twelve."},{"num":7,"verse":"The sons of Elam, one thousand two hundred and fifty-four."},{"num":8,"verse":"The sons of Zattu, nine hundred and forty-five."},{"num":9,"verse":"The sons of Zaccai, seven hundred and seventy."},{"num":10,"verse":"The sons of Bani, six hundred and forty-two."},{"num":11,"verse":"The sons of Bebai, six hundred and twenty-three."},{"num":12,"verse":"The sons of Azgad, one thousand two hundred and twenty-two."},{"num":13,"verse":"The sons of Adonikam, six hundred and sixty-six."},{"num":14,"verse":"The sons of Bigvai, two thousand and fifty-six."},{"num":15,"verse":"The sons of Adin, four hundred and fifty-four."},{"num":16,"verse":"The sons of Ater of Hezekiah, ninety-eight."},{"num":17,"verse":"The sons of Bezai, three hundred and twenty-three."},{"num":18,"verse":"The sons of Jorah, one hundred and twelve."},{"num":19,"verse":"The sons of Hashum, two hundred and twenty-three."},{"num":20,"verse":"The sons of Gibbar, ninety-five."},{"num":21,"verse":"The sons of Bethlehem, one hundred and twenty-three."},{"num":22,"verse":"The men of Netophah, fifty-six."},{"num":23,"verse":"The men of Anathoth, one hundred and twenty-eight."},{"num":24,"verse":"The sons of Azmaveth, forty-two."},{"num":25,"verse":"The sons of Kirjatharim, Chephirah, and Beeroth, seven hundred and forty-three."},{"num":26,"verse":"The sons of Ramah and Gaba, six hundred and twenty-one."},{"num":27,"verse":"The men of Michmas, one hundred and twenty-two."},{"num":28,"verse":"The men of Bethel and Ai, two hundred and twenty-three."},{"num":29,"verse":"The sons of Nebo, fifty-two."},{"num":30,"verse":"The sons of Magbish, one hundred and fifty-six."},{"num":31,"verse":"The sons of the other Elam, one thousand two hundred and fifty-four."},{"num":32,"verse":"The sons of Harim, three hundred and twenty."},{"num":33,"verse":"The sons of Lod, Hadid, and Ono, seven hundred and twenty-five."},{"num":34,"verse":"The sons of Jericho, three hundred and forty-five."},{"num":35,"verse":"The sons of Senaah, three thousand six hundred and thirty."},{"num":36,"verse":"¶ The priests: the sons of Jedaiah, of the house of Jeshua, nine hundred and seventy-three."},{"num":37,"verse":"The sons of Immer, one thousand and fifty-two."},{"num":38,"verse":"The sons of Pashur, one thousand two hundred and forty-seven."},{"num":39,"verse":"The sons of Harim, one thousand and seventeen."},{"num":40,"verse":"The Levites: the sons of Jeshua and of Kadmiel, of the sons of Hodaviah, seventy-four."},{"num":41,"verse":"The singers: the sons of Asaph, one hundred and twenty-eight."},{"num":42,"verse":"The sons of the porters: the sons of Shallum, the sons of Ater, the sons of Talmon, the sons of Akkub, the sons of Hatita, the sons of Shobai, in all one hundred and thirty-nine."},{"num":43,"verse":"The Nethinims: the sons of Ziha, the sons of Hasupha, the sons of Tabbaoth,"},{"num":44,"verse":"the sons of Keros, the sons of Siaha, the sons of Padon,"},{"num":45,"verse":"the sons of Lebanah, the sons of Hagabah, the sons of Akkub,"},{"num":46,"verse":"the sons of Hagab, the sons of Shalmai, the sons of Hanan,"},{"num":47,"verse":"the sons of Giddel, the sons of Gahar, the sons of Reaiah,"},{"num":48,"verse":"the sons of Rezin, the sons of Nekoda, the sons of Gazzam,"},{"num":49,"verse":"the sons of Uzza, the sons of Paseah, the sons of Besai,"},{"num":50,"verse":"the sons of Asnah, the sons of Mehunim, the sons of Nephusim,"},{"num":51,"verse":"the sons of Bakbuk, the sons of Hakupha, the sons of Harhur,"},{"num":52,"verse":"the sons of Bazluth, the sons of Mehida, the sons of Harsha,"},{"num":53,"verse":"the sons of Barkos, the sons of Sisera, the sons of Thamah,"},{"num":54,"verse":"the sons of Neziah, the sons of Hatipha."},{"num":55,"verse":"The sons of Solomon’s slaves: the sons of Sotai, the sons of Sophereth, the sons of Peruda,"},{"num":56,"verse":"the sons of Jaalah, the sons of Darkon, the sons of Giddel,"},{"num":57,"verse":"the sons of Shephatiah, the sons of Hattil, the sons of Pochereth of Zebaim, the sons of Ami."},{"num":58,"verse":"All the Nethinims and the sons of Solomon’s slaves, were three hundred and ninety-two."},{"num":59,"verse":"And these were those which went up from Telmelah, Telharsa, Cherub, Addan, and Immer, but they could not show their father’s house and their seed, whether they were of Israel."},{"num":60,"verse":"The sons of Delaiah, the sons of Tobiah, the sons of Nekoda, six hundred and fifty-two."},{"num":61,"verse":"And of the sons of the priests: the sons of Habaiah, the sons of Koz, the sons of Barzillai; who took a wife of the daughters of Barzillai, the Gileadite, and was called after their name."},{"num":62,"verse":"These sought their register among those that were reckoned by genealogy, but they were not found; therefore, they were, as polluted, put from the priesthood."},{"num":63,"verse":"And the Tirshatha said unto them that they should not eat of the most holy things until there stood up a priest with Urim and Thummim."},{"num":64,"verse":"¶ The whole congregation united as one man was forty-two thousand three hundred and seventy,"},{"num":65,"verse":"besides their slaves and their maids, of whom there were seven thousand three hundred and thirty-seven; and there were among them two hundred men and women who were singers."},{"num":66,"verse":"Their horses were seven hundred and thirty-six; their mules, two hundred and forty-five;"},{"num":67,"verse":"their camels, four hundred and thirty-five; their asses, six thousand seven hundred and twenty."},{"num":68,"verse":"And some of the heads of the fathers, when they came to the house of the LORD which was at Jerusalem, offered freely for the house of God to set it up in his place."},{"num":69,"verse":"They gave after their ability unto the treasure of the work sixty-one thousand drams of gold and five thousand pounds of silver and one hundred priests’ garments."},{"num":70,"verse":"So the priests and the Levites and those of the people and the singers and the porters and the Nethinims dwelt in their cities, and all Israel in their cities."}]