[{"num":2,"verse":"Now these are the people of the province that went up out of the captivity, of those of the Golus, whom Nevuchadnetzar Melech Bavel had carried away unto Babylon, and returned unto Yerushalayim and Yehudah, every one unto his town;"},{"num":2,"verse":"Which came with Zerubavel; Yeshua, Nechemyah, Serayah, Re’elyah, Mordechai, Bilshan, Mispar, Bigvai, Rechum, Ba’anah. The number of the men of the Am Yisroel;"},{"num":3,"verse":"The Bnei Parosh, 2,172."},{"num":4,"verse":"The Bnei Shephatyah, 372."},{"num":5,"verse":"The Bnei Arach, 775."},{"num":6,"verse":"The Bnei Pachat-Moav, of the Bnei Yeshua and Yoav, 2,812."},{"num":7,"verse":"The Bnei Elam, 1,254."},{"num":8,"verse":"The Bnei Zattu, 945."},{"num":9,"verse":"The Bnei Zaccai, 760."},{"num":10,"verse":"The Bnei Bani, 642."},{"num":11,"verse":"The Bnei Bevai, 623."},{"num":12,"verse":"The Bnei Azgad, 1,222."},{"num":13,"verse":"The Bnei Adonikam, 666."},{"num":14,"verse":"The Bnei Bigvai, 2,056."},{"num":15,"verse":"The Bnei Adin, 454."},{"num":16,"verse":"The Bnei Ater of Yechizkiyah, 98."},{"num":17,"verse":"The Bnei Betzai, 323."},{"num":18,"verse":"The Bnei Yorah, 112."},{"num":19,"verse":"The Bnei Chashum, 223."},{"num":20,"verse":"The Bnei Gibbar, 95."},{"num":21,"verse":"The Bnei Beit-Lechem, 123."},{"num":22,"verse":"The men of Netophah, 56."},{"num":23,"verse":"The men of Anatot, 128."},{"num":24,"verse":"The Bnei Azmavet, 42."},{"num":25,"verse":"The Bnei Kiryat-Arim, Kephirah, and Be’erot, 743."},{"num":26,"verse":"The Bnei Ramah and Geva, 621."},{"num":27,"verse":"The men of Michmas, 122."},{"num":28,"verse":"The men of Beit-El and Ai, 223."},{"num":29,"verse":"The Bnei Nevo, 52."},{"num":30,"verse":"The Bnei Magbish, 156."},{"num":31,"verse":"The children of the other Elam, 1,254."},{"num":32,"verse":"The Bnei Charim, 320."},{"num":33,"verse":"The Bnei Lod, Chadid and Ono, 725."},{"num":34,"verse":"The Bnei Yericho, 345."},{"num":35,"verse":"The Bnei Senaah, 3,630."},{"num":36,"verse":"The kohanim; the Bnei Yedayah, of the Bais Yeshua, 973."},{"num":37,"verse":"The Bnei Immer, 1,052."},{"num":38,"verse":"The Bnei Pashchur, 1,247."},{"num":39,"verse":"The Bnei Charim, 1,017."},{"num":40,"verse":"The Levi’im; the Bnei Yeshua and Kadmiel, of the Bnei Hodavyah, 74."},{"num":41,"verse":"The singers; the Bnei Asaph, 128."},{"num":42,"verse":"The children of the gatekeepers; the Bnei Shallum, the Bnei Ater, the Bnei Talmon, the Bnei Akuv, the Bnei Chatita, the Bnei Shovai; in all 139."},{"num":43,"verse":"The Netinim; the Bnei Tzicha, the Bnei Chasupha, the Bnei Tabbaot,"},{"num":44,"verse":"The Bnei Keros, the Bnei Siaha, the Bnei Padon,"},{"num":45,"verse":"The Bnei Levanah, the Bnei Chagavah, the children of Akuv,"},{"num":46,"verse":"The Bnei Chagav, the Bnei Shalmai, the Bnei Chanan,"},{"num":47,"verse":"The Bnei Giddel, the Bnei Gachar, the Bnei Reayah,"},{"num":48,"verse":"The Bnei Retzin, the Bnei Nekoda, the Bnei Gazzam,"},{"num":49,"verse":"The Bnei Uzza, the Bnei Paseach, the Bnei Besai,"},{"num":50,"verse":"The Bnei Asnah, the Bnei Meunim, the Bnei Nephusim,"},{"num":51,"verse":"The Bnei Bakbuk, the Bnei Chakupha, the Bnei Chachur,"},{"num":52,"verse":"The Bnei Batzlut, the Bnei Mechida, the Bnei Charsha,"},{"num":53,"verse":"The Bnei Barkos, the Bnei Sisra, the Bnei Temach,"},{"num":54,"verse":"The Bnei Netziach, the Bnei Chatipha."},{"num":55,"verse":"The Bnei Avdei Sh’lomo; the Bnei Sotai, the Bnei Hasopheret, the Bnei Peruda,"},{"num":56,"verse":"The Bnei Ya’alah, the Bnei Darkon, the Bnei Giddel,"},{"num":57,"verse":"The Bnei Shephatyah, the Bnei Chattil, the Bnei Pocheret-Hatzvayim, the Bnei Ami."},{"num":58,"verse":"All the Netinim, and the Bnei Avdei Sh’lomo, were three hundred ninety and two."},{"num":59,"verse":"And these were they which went up from Telmelach, Telcharsa, Keruv, Addan, and Immer; but they could not show their Bais Avot, and their zera, whether they were of Yisroel;"},{"num":60,"verse":"The Bnei Delaiah, the Bnei Toviyah, the Bnei Nekoda, six hundred fifty and two."},{"num":61,"verse":"And of the Bnei HaKohanim; the Bnei Chaviyah, the Bnei Hakotz, the Bnei Barzillai; which took a wife of the banot of Barzillai the Gileadi, and was named after their shem."},{"num":62,"verse":"These sought their register among those that were reckoned by genealogy, but they were not found; therefore were they, as polluted, put from the kehunah."},{"num":63,"verse":"And the Tirshata (Governor) said unto them, that they should not eat of kodesh hakodashim, until there stood up a kohen with Urim and with Tummim."},{"num":64,"verse":"The Kol HaKahal together was forty and two thousand three hundred and threescore."},{"num":65,"verse":"This was in addition to their avadim (man servants) and their amahot (female servants) of whom there were seven thousand three hundred thirty and seven; and there were among them two hundred singing men and singing women."},{"num":66,"verse":"Their susim were seven hundred thirty and six; their mules, two hundred forty and five;"},{"num":67,"verse":"Their camels, four hundred thirty and five; their donkeys, six thousand seven hundred and twenty."},{"num":68,"verse":"And some of the chief of the avot, when they came to the Beis Hashem which is at Yerushalayim, offered nedavot for the Beis HaElohim to rebuild it in its place."},{"num":69,"verse":"They gave according to their ability unto the Otzar for the work threescore and one thousand drachmas of zahav, and five thousand minas of kesef, and one hundred ketanot for the kohanim."},{"num":70,"verse":"So the kohanim, and the Levi’im, and some of the people, and the singers, and the gatekeepers, and the Netinim (servants of the Beis Hamikdash), dwelt in their towns, and kol Yisroel in their towns."}]