[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A little.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A natural reflection, when it is remembered that great riches bring corresponding cares (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and often lead to ruinous indulgence and luxury (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 13:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Besides, the contentment which is often enjoyed in virtuous poverty seldom dwells with the mammon of unrighteousness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 37:16-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:16-17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is better than the riches of many wicked — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Because he hath it with many great and glorious advantages; with God’s favour and blessing, with great serenity and satisfaction of his own mind, which is infinitely more desirable and comfortable than all earthly possessions, with the consolations of God’s Spirit, and the assurance of everlasting felicity: while wicked men’s riches are loaded with many encumbrances; with the wrath and curse of God; the torment of their own consciences and passions; and the dreadful expectation of an after-reckoning, and of endless miseries. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord upholdeth the righteous — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is a proof of what he had said ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For what the wicked have shall suddenly be lost and gone, but God will maintain the righteous in their happy estate.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "37:7-20 Let us be satisfied that God will make all to work for good to us. Let us not discompose ourselves at what we see in this world. A fretful, discontented spirit is open to many temptations. For, in all respects, the little which is allotted to the righteous, is more comfortable and more profitable than the ill-gotten and abused riches of ungodly men. It comes from a hand of special love. God provides plentifully and well, not only for his working servants, but for his waiting servants. They have that which is better than wealth, peace of mind, peace with God, and then peace in God; that peace which the world cannot give, and which the world cannot have. God knows the believer's days. Not one day's work shall go unrewarded. Their time on earth is reckoned by days, which will soon be numbered; but heavenly happiness shall be for ever. This will be a real support to believers in evil times. Those that rest on the Rock of ages, have no reason to envy the wicked the support of their broken reeds.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A little that a righteous man hath - literally, \"Good is a little to the righteous, more than,\" etc. Our translation, however, has expressed the sense with sufficient accuracy. There are two things implied here:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) that it happens not unfrequently that the righteous have little of the wealth of this world; and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) that this little is to them of more real value, accompanied, as it is, with higher blessings, than the more abundant wealth which the wicked often possess.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is better to have but little of this world's goods with righteousness, than it is to have the riches of many wicked men - or the wealth which is often found in the possession of wicked men - with their ungodliness. It is not always true, indeed, that the righteous are poor; but if they are poor, their lot is more to be desired than that of the wicked man, though he is rich. Compare Luke 16:19-31.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is better to have but little of this world's goods with righteousness, than it is to have the riches of many wicked men - or the wealth which is often found in the possession of wicked men - with their ungodliness. It is not always true, indeed, that the righteous are poor; but if they are poor, their lot is more to be desired than that of the wicked man, though he is rich. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 16:19-31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Is better than the riches of many wicked - Of many wicked people. The small property of one truly good man, with his character and hopes, is of more value than would be the aggregate wealth of many rich wicked men with their character and prospects. The word rendered \"riches\" here - המון  hâmôn - means properly noise, sound, as of rain or of a multitude of people; then, a multitude, a crowd of people; and then, a \"multitude\" of possessions; that is, riches or wealth. The allusion here is not, as Prof. Alexander supposes, to the tumult or bustle which often attends the acquisition of property, or to the disorder and disquiet which attends its possession, but simply to the \"amount\" considered as large, or as accumulated or brought together. It is true that its acquisition is often attended with bustle and noise; it is true that its possessor has not often the peace and calmness of mind which the man has who has a mere competence; but the simple thought here is that, in reference to the amount, or the actual possession, it is better, on the whole, to have what the poor, pious man has, than to have what many wicked men have, if it were all gathered together. It does more to make a man happy on earth; it furnishes a better prospect for the life to come. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Is better than the riches of many wicked - Of many wicked people. The small property of one truly good man, with his character and hopes, is of more value than would be the aggregate wealth of many rich wicked men with their character and prospects. The word rendered \"riches\" here - המון  hâmôn - means properly noise, sound, as of rain or of a multitude of people; then, a multitude, a crowd of people; and then, a \"multitude\" of possessions; that is, riches or wealth. The allusion here is not, as Prof. Alexander supposes, to the tumult or bustle which often attends the acquisition of property, or to the disorder and disquiet which attends its possession, but simply to the \"amount\" considered as large, or as accumulated or brought together. It is true that its acquisition is often attended with bustle and noise; it is true that its possessor has not often the peace and calmness of mind which the man has who has a mere competence; but the simple thought here is that, in reference to the amount, or the actual possession, it is better, on the whole, to have what the poor, pious man has, than to have what many wicked men have, if it were all gathered together. It does more to make a man happy on earth; it furnishes a better prospect for the life to come. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. riches—literally, \"noise and tumult,\" as incidental to much wealth (compare Ps 39:6). Thus the contrast with the \"little\" of one man is more vivid.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16 A little that a righteous man hath is better than the riches of many wicked.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 For the arms of the wicked shall be broken: but the Lord upholdeth the righteous.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18 The Lord knoweth the days of the upright: and their inheritance shall be for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19 They shall not be ashamed in the evil time: and in the days of famine they shall be satisfied.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20 But the wicked shall perish, and the enemies of the Lord shall be as the fat of lambs: they shall consume; into smoke shall they consume away.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21 The wicked borroweth, and payeth not again: but the righteous sheweth mercy, and giveth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22 For such as be blessed of him shall inherit the earth; and they that be cursed of him shall be cut off.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23 The steps of a good man are ordered by the Lord: and he delighteth in his way.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24 Though he fall, he shall not be utterly cast down: for the Lord upholdeth him with his hand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 37:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:16",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"A little that a righteous man hath is better than the riches of many wicked.\" This is a fine proverb. The little of one good man is contrasted with the riches of many wicked, and so the expression is rendered the more forcible. There is more happiness in the godly dinner of herbs than in the stalled ox of profane rioters. In the original there is an allusion to the noise of a multitude, as if to hint at the turmoil and hurly-burly of riotous wealth, and to contrast it with the quiet of the humbler portion of the godly. We would sooner hunger with John than feast with Herod; better feed on scant fare with the prophets in Obadiah's cave than riot with the priests of Baal. A man's happiness consists not in the heaps of gold which he has in store. Content finds multum in parvo, while for a wicked heart the whole world is too little.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 37:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For the arms of the wicked shall be broken.\" Their power to do mischief shall be effectually taken away, for the arms which they lifted up against God shall be crushed even to the bone. God often makes implacable men incapable men. What is a more contemptible sight than toothless malice, aimless malevolence! \"But the Lord upholdeth the righteous.\" Their cause and course shall be safe, for they are in good keeping. The sword of two edges smites the wicked and defends the just.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 37:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:18",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Because he hath it with many great and glorious advantages, with God’s favour and blessings, with great serenity, and satisfaction of his own mind, which is infinitely more desirable and comfortable than all earthly possessions; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with the consolations of God’s Spirit, and the assurance of everlasting felicity;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst wicked men’s riches are loaded with many encumbrances, with the wrath and curse of God, the torment of their own consciences and passions, and the dreadful expectation of an after-reckoning, and of endless miseries. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A little that a righteous man hath,.... It is the portion of the righteous, for the most part, to have but little of this world's goods; some indeed have been rich, as Abraham, Lot, David, Joseph of Arimathea, and others; but, generally speaking, the wicked have the largest share of worldly things, and the righteous but little, and are as having nothing comparatively; and yet their little ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "is better than the riches of many wicked; not that a little is better than much, or that poverty is better than riches, or a poor man better than a rich man; but the comparison is between a righteous man and a wicked man; the emphasis lies there; and the sense is, that a \"righteous\" man's \"little\" is better than a \"wicked\" man's \"much\"; the righteous have a right to what they have, through Christ, who is heir of all things, but not the wicked; they have what they have in love and with a blessing, not so the wicked; they are contented in their state and condition, when the wicked are never satisfied; they possess and enjoy what they have, even all they have, when God oftentimes does not give the wicked an heart to eat and drink of what they are possessed, but a stranger eats it; they have the presence of God with them, and that makes a little sweet, and to go a great way; and they live without any anxious, distressing, burdensome care; not so the wicked; and before long the tables will be turned, and they will have their good things, and the wicked their evil things; see Proverbs 16:8; wherefore they have no need to fret under present circumstances, nor envy the happiness of wicked men. Arama interprets it, of a little help that a righteous man has, better than the riches of many wicked; and Gussetius (r) understands all this not of the smallness and largeness of the substance of different persons, but of their numbers, the one small, the other large; and Jarchi, that the sense is, that a few persons with the righteous, which was the case of Abraham and Gideon, are better and succeed more than the multitude of many wicked persons; and the church should be content with a small number of believers, and not draw in a multitude of wicked men into their communion. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "is better than the riches of many wicked; not that a little is better than much, or that poverty is better than riches, or a poor man better than a rich man; but the comparison is between a righteous man and a wicked man; the emphasis lies there; and the sense is, that a \"righteous\" man's \"little\" is better than a \"wicked\" man's \"much\"; the righteous have a right to what they have, through Christ, who is heir of all things, but not the wicked; they have what they have in love and with a blessing, not so the wicked; they are contented in their state and condition, when the wicked are never satisfied; they possess and enjoy what they have, even all they have, when God oftentimes does not give the wicked an heart to eat and drink of what they are possessed, but a stranger eats it; they have the presence of God with them, and that makes a little sweet, and to go a great way; and they live without any anxious, distressing, burdensome care; not so the wicked; and before long the tables will be turned, and they will have their good things, and the wicked their evil things; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; wherefore they have no need to fret under present circumstances, nor envy the happiness of wicked men. Arama interprets it, of a little help that a righteous man has, better than the riches of many wicked; and Gussetius (r) understands all this not of the smallness and largeness of the substance of different persons, but of their numbers, the one small, the other large; and Jarchi, that the sense is, that a few persons with the righteous, which was the case of Abraham and Gideon, are better and succeed more than the multitude of many wicked persons; and the church should be content with a small number of believers, and not draw in a multitude of wicked men into their communion. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) Ebr. Comment. p. 213, 475. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) Ebr. Comment. p. 213, 475. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{k} A little that a righteous man hath is better than the riches of many wicked.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " A little that a righteous man hath ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " better than the riches of many wicked.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) For they are daily fed as with manna from heaven and have sufficient, while the wicked never have enough, but always hunger.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Better is a little that the righteous hath",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Than the abundance of many wicked. (R.V.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Abundance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tumult",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (a different word from that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 37:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), suggests the idea of noisy, ostentatious opulence. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Tob 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “a little with righteousness is better than much with unrighteousness.” The P.B.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great riches of the ungodly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows the LXX, Vulg. and Jer.: but the present Heb. text cannot be so rendered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "16, 17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Stanza of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Teth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The nature of true wealth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A little that a righteous man hath is better than the riches of many wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 37:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "With ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " accord ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. Tobit 12:8. The ל of לצּדּיק is a periphrastic indication of the genitive (Ges. 115). המון is a noisy multitude, here used of earthly possessions. רבּים is not per attract. (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", הם for הוּא) equivalent to רב, but the one righteous man is contrasted with many unrighteous. The arms are here named instead of the bow in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He whose arms are broken can neither injure others nor help himself. Whereas Jahve does for the righteous what earthly wealth and human power cannot do: He Himself upholds them. ",
        "children": []
      }
    ]
  }
]