[{"header":"Psalm 79"},{"num":1,"verse":"O God, the nations have come into [the land of Your people] Your inheritance; Your sacred temple have they defiled; they have made Jerusalem heaps of ruins."},{"num":2,"verse":"The dead bodies of Your servants they have given as food to the birds of the heavens, the flesh of Your saints to the beasts of the earth."},{"num":3,"verse":"Their blood they have poured out like water round about Jerusalem, and there was none to bury them."},{"num":4,"verse":"[Because of such humiliation] we have become a taunt and reproach to our neighbors, a mocking and derision to those who are round about us."},{"num":5,"verse":"How long, O Lord? Will You be angry forever? Shall Your jealousy [which cannot endure a divided allegiance] burn like fire?"},{"num":6,"verse":"Pour out Your wrath on the Gentile nations who do not acknowledge You, and upon the kingdoms that do not call on Your name."},{"num":7,"verse":"For they have devoured Jacob and laid waste his dwelling and his pasture."},{"num":8,"verse":"O do not [earnestly] remember against us the iniquities and guilt of our forefathers! Let Your compassion and tender mercy speedily come to meet us, for we are brought very low."},{"num":9,"verse":"Help us, O God of our salvation, for the glory of Your name! Deliver us, forgive us, and purge away our sins for Your name’s sake."},{"num":10,"verse":"Why should the Gentile nations say, Where is their God? Let vengeance for the blood of Your servants which is poured out be known among the nations in our sight [not delaying until some future generation]."},{"num":11,"verse":"Let the groaning and sighing of the prisoner come before You; according to the greatness of Your power and Your arm spare those who are appointed to die!"},{"num":12,"verse":"And return into the bosom of our neighbors sevenfold the taunts with which they have taunted and scoffed at You, O Lord!"},{"num":13,"verse":"Then we Your people, the sheep of Your pasture, will give You thanks forever; we will show forth and publish Your praise from generation to generation."}]