[{"num":79,"verse":"The psalm of Asaph. God, heathen men came into thine heritage; they defouled thine holy temple, they setted Jerusalem into the keeping of apples. (The song of Asaph. God, the heathen came to thy inheritance; they defiled thy holy Temple, and they laid Jerusalem in ruins.)"},{"num":2,"verse":"They setted the slain bodies of thy servants to be meats to the volatiles of heavens; the fleshes of thy saints to the beasts of the earth. (They left the dead bodies of thy servants to be food for the birds of the air; yea, the flesh of thy saints for the beasts of the earth.)"},{"num":3,"verse":"They shedded out the blood of them, as water in the compass of Jerusalem; and none there was that buried (them). (They poured out their blood like water all around Jerusalem; and there was no one left to bury them.)"},{"num":4,"verse":"We be made (a) shame to our neighbours; mocking and scorning to them, that be in our compass. (We were made a reproach to our neighbours; mocked and scorned by those who be all around us.)"},{"num":5,"verse":"Lord, how long shalt thou be wroth into the end? shall thy vengeance be kindled as fire? (Lord, how long shalt thou be angry, forever? shall thy anger burn like fire?)"},{"num":6,"verse":"Pour out thine ire into heathen men, that know not thee; and into realms, that called not thy name. (Pour out thy anger upon the heathen, who know thee not; and upon the kingdoms, that have not called upon thy name.)"},{"num":7,"verse":"For they ate Jacob; and made desolate his place. (For they have devoured, or destroyed, the people of Jacob; and made their place desolate.)"},{"num":8,"verse":"Have thou not mind on our eld wickednesses; thy mercies before take us soon, for we be made poor greatly. (Remember not our past wickednesses; let thy constant love come soon to us, for we be made so very low.)"},{"num":9,"verse":"God, our health, help thou us, and, Lord, for the glory of thy name, deliver thou us; and be thou merciful to our sins, for thy name. (God, our salvation/God, our deliverance, help thou us, and, Lord, for the glory of thy name, save thou us; and have thou mercy on our sins, for the sake of thy name.)"},{"num":10,"verse":"Lest peradventure they say among heathen men, Where is the God of them? and be he known among nations before our eyes. The vengeance of the blood of thy servants, which is shed out; (Lest perhaps they say among the heathen, Where is their God? Let thyself be known among the nations around us, by the vengeance which is poured out upon them; for the blood of thy servants.)"},{"num":11,"verse":"the wailing of fettered men enter into thy sight. After the greatness of thine arm; wield thou the sons of slain men. (Let the wailing of the fettered come before thee. And by the greatness of thy power, free thou those who be condemned to die.)"},{"num":12,"verse":"And yield thou to our neighbours sevenfold in(to) the bosom of them; the shame of them (the same rebuke), which they did shamefully to thee, thou Lord."},{"num":13,"verse":"But we that be thy people, and the sheep of thy pasture; shall acknowledge to thee into the world. In generation and into generation, we shall tell thy praising. (Then we who be thy people, and the sheep of thy pasture, shall give thanks to thee forever. Yea, in all generations, we shall tell out thy praises.)"}]