[{"num":5,"verse":"After the Lord’s temple was finished, Solomon put in its storage rooms everything that his father David had dedicated to the Lord, including the gold and silver, and the objects used in worship."},{"header":"Solomon Brings the Sacred Chest to the Temple"},{"num":2,"verse":"The sacred chest had been kept on Mount Zion, also known as the city of David. But Solomon decided to have the chest moved to the temple while everyone was in Jerusalem to celebrate the Festival of Shelters during the seventh month."},{"num":4,"verse":"Then the priests and the Levites picked up the sacred chest, the sacred tent, and the objects used for worship, and they carried them to the temple. "},{"num":6,"verse":"Solomon and a crowd of people walked in front of the chest, and along the way they sacrificed more sheep and cattle than could be counted."},{"num":7,"verse":"The priests carried the chest into the most holy place and put it under the winged creatures, "},{"num":8,"verse":"whose wings covered the chest and the poles used for carrying it. "},{"num":9,"verse":"The poles were so long that they could be seen from just outside the most holy place, but not from anywhere else. And they stayed there from then on."},{"num":10,"verse":"The only things kept in the chest were the two flat stones Moses had put there when the Lord made his agreement with the people of Israel at Mount Sinai, after bringing them out of Egypt."},{"num":11,"verse":"The priests of every group had gone through the ceremony to make themselves clean and acceptable to the Lord. The Levite musicians, including Asaph, Heman, Jeduthun, and their sons and relatives, were wearing robes of fine linen. They were standing on the east side of the altar, playing cymbals, small harps, and other stringed instruments. One hundred twenty priests were with these musicians, and they were blowing trumpets."},{"num":14,"verse":"The Lord’s glory was in that cloud, and the light from it was so bright that the priests could not stay inside to do their work."}]