[{"num":5,"verse":"1 The things dedicated by David are put in the Temple. 2 The Ark is brought into the Tmple. 10 What was within it. 12 They sing praise to the Lord."},{"num":1,"verse":"So was all the work finished that Solomon made for the house of the Lord, and Solomon brought in the things that David his father had dedicated, with the silver and the gold, and all the vessels, and put them among the treasures of the house of God."},{"num":2,"verse":"Then Solomon assembled the Elders of Israel, and all the heads of the tribes, the chief fathers of the children of Israel unto Jerusalem, to bring up the Ark of the covenant of the Lord from the city of David, which is Zion."},{"num":3,"verse":"And all the men of Israel assembled unto the king at the feast: it was in the seventh month."},{"num":4,"verse":"And all the Elders of Israel came, and the Levites took up the Ark."},{"num":5,"verse":"And they carried up the Ark, and the Tabernacle of the Congregation: and all the holy vessels that were in the Tabernacle, those did the Priests and Levites bring up."},{"num":6,"verse":"And king Solomon and all the Congregation of Israel that were assembled unto him, were before the Ark, offering sheep and bullocks, which could not be told nor numbered for multitude."},{"num":7,"verse":"So the Priests brought the Ark of the covenant of the Lord unto his place, into the Oracle of the house, into the most Holy place, even under the wings of the Cherubims."},{"num":8,"verse":"For the Cherubims stretched out their wings over the place of the Ark, and the Cherubims covered the Ark and the bars thereof above."},{"num":9,"verse":"And they drew out the bars, that the ends of the bars might be seen out of the Ark before the Oracle, but they were not seen without: and there they are unto this day."},{"num":10,"verse":"Nothing was in the Ark, save the two Tables, which Moses gave at Horeb, where the Lord made a covenant with the children of Israel when they came out of Egypt."},{"num":11,"verse":"And when the Priests were come out of the Sanctuary (for all the Priests that were present, were sanctified and did not wait by course."},{"num":12,"verse":"And the Levites the singers of all sorts, as of Asaph, of Heman, of Jeduthun, and of their sons and of their brethren, being clad in fine linen, stood with cymbals, and with viols, and harps at the East end of the Altar, and with them an hundred and twenty Priests blowing with trumpets."},{"num":13,"verse":"And they were as one, blowing trumpets, and singing, and made one sound to be heard in praising and thanking the Lord, and when they lifted up their voice with trumpets, and with cymbals, and with instruments of music, and when they praised the Lord, singing, For he is good, because his mercy lasteth forever) then the house, even the house of the Lord was filled with a cloud,"},{"num":14,"verse":"So that the Priests could not stand to minister, because of the cloud: for the glory of the Lord had filled the house of God."}]