[{"header":"Chapter 5"},{"num":1,"verse":"Dedication of the Temple. When all the work undertaken by Solomon for the house of the Lord was completed, he brought in the votive offerings of David his father, putting the silver, the gold, and other articles in the treasuries of the house of God. "},{"num":2,"verse":"Then Solomon assembled the elders of Israel and all the heads of the tribes, the princes in the ancestral houses of the Israelites, to Jerusalem to bring up the ark of the Lord’s covenant from the City of David, which is Zion. "},{"num":3,"verse":"All the people of Israel assembled before the king during the festival of the seventh month. "},{"num":4,"verse":"When all the elders of Israel had arrived, the Levites took up the ark; "},{"num":5,"verse":"and they brought up the ark and the tent of meeting with all the sacred vessels that were in the tent. The levitical priests brought them up."},{"num":6,"verse":"King Solomon and the entire community of Israel, gathered for the occasion before the ark, sacrificed sheep and oxen too many to number or count. "},{"num":7,"verse":"The priests brought the ark of the covenant of the Lord to its place: the inner sanctuary of the house, the holy of holies, beneath the wings of the cherubim. "},{"num":8,"verse":"The cherubim had their wings spread out over the place of the ark, covering the ark and its poles from above. "},{"num":9,"verse":"The poles were so long that their ends could be seen from the holy place in front of the inner sanctuary. (They cannot be seen from outside, but they remain there to this day.) "},{"num":10,"verse":"There was nothing in the ark but the two tablets which Moses had put there at Horeb when the Lord made a covenant with the Israelites after they went forth from Egypt."},{"num":11,"verse":"When the priests left the holy place (all the priests who were present had purified themselves regardless of the rotation of their various divisions), "},{"num":12,"verse":"the Levites who were singers, all who belonged to Asaph, Heman, Jeduthun, and their sons and brothers, clothed in fine linen, with cymbals, harps, and lyres, stood east of the altar, and with them a hundred and twenty priests blowing trumpets."},{"num":13,"verse":"When the trumpeters and singers were heard as a single voice praising and giving thanks to the Lord, and when they raised the sound of the trumpets, cymbals, and other musical instruments to “Praise the Lord, who is so good, whose love endures forever,” the cloud filled the house of the Lord. "},{"num":14,"verse":"The priests could no longer minister because of the cloud, since the glory of the Lord had filled the house of God."}]