[{"num":5,"verse":"When all this work was completed for the Eternal’s house, Solomon brought in the silver, gold, and utensils, which his father, David, had dedicated for use in His temple. These things were stored in the True God’s temple treasuries, where they would be guarded by the Levites."},{"num":2,"verse":"Just as his father had done when he moved the covenant chest to Jerusalem, Solomon assembled all of Israel (the generals, the judges, and every tribal leader) to move the covenant chest of the Eternal from the city of David (also called Zion) into the new temple "},{"num":3,"verse":"in the seventh month. First all the men of Israel celebrated a feast with the king, "},{"num":4,"verse":"and when the elders of Israel arrived, the Levites who were priests carried the covenant chest, the congregation tent, and all the holy utensils in the tent to the temple. "},{"num":6,"verse":"As King Solomon and the assembly stood before the covenant chest, they sacrificed innumerable sheep and uncountable oxen. "},{"num":7,"verse":"Following the sacrifices, the Levitical priests carried the covenant chest of the Eternal to its new home in the most holy place, under the protective wings of the creatures that covered the covenant chest and its carrying poles. "},{"num":9,"verse":"These poles were so long that their ends could be seen in front of the most holy place (although they were not visible outside), and they are there today. "},{"num":10,"verse":"Only the two tablets Moses received on Mount Horeb (where the Eternal made a covenant with the Israelites after they left Egypt) were inside the covenant chest."},{"num":11,"verse":"When the Levitical priests returned to the crowd from the most holy place (for all the priests who were present had sanctified themselves for this special occasion, regardless of their duties), "},{"num":12,"verse":"all the Levitical singers (Asaph, Heman, Jeduthun, and their sons and their relatives) were wearing fine linen, standing east of the altar, playing cymbals, harps, and lyres, along with priests blowing 120 trumpets. "},{"num":13,"verse":"In unison, the musicians and singers with trumpets and cymbals and instruments praised and glorified the Eternal."},{"num":14,"verse":"which prevented the priests from continuing to minister to the Eternal. The descent of the glory of God filled the house of the God of Israel."}]