[{"num":11,"verse":"Open your doors, O Lebanon, that the fire may devour your cedars!"},{"num":2,"verse":"Wail, O fir tree and cypress, for the cedar has fallen, because the glorious and lofty trees are laid waste! Wail, O you oaks of Bashan, for the thick and inaccessible forest [on the steep mountainside] has in flames been felled!"},{"num":3,"verse":"A voice of the wailing of the shepherds, for their glory, the broad pasturage, is laid waste! A voice of the roaring of young lions, for the pride of the Jordan [the jungle or thickets] is ruined!"},{"num":4,"verse":"Thus says the Lord my God: Shepherd the flock [destined] for slaughter,"},{"num":5,"verse":"Whose buyers or possessors slay them and hold themselves not guilty; and they who sell them say, Blessed be the Lord, for I have become rich! And their own shepherds neither pity nor spare them [from the wolves]."},{"num":6,"verse":"For I will no more pity or spare the inhabitants of the land, says the Lord; but behold, I will deliver every man into his neighbor’s hand and into the hand of his [foreign] king. And [the enemy] shall lay waste the land, and I will not deliver [the people] out of the hand [of the foreign oppressor]."},{"num":7,"verse":"So I [Zechariah] shepherded the flock of slaughter, truly [as the name implies] the most miserable of sheep. And I took two [shepherd’s] staffs, the one I called Beauty or Grace and the other I called Bands or Union; and I fed and shepherded the flock."},{"num":8,"verse":"And I cut off the three shepherds [the civil authorities, the priests, and the prophets] in one month, for I was weary and impatient with them, and they also loathed me."},{"num":9,"verse":"So I [Zechariah] said, I will not be your shepherd. What is to die, let it die, and what is to be destroyed, let it be destroyed; and let the survivors devour one another’s flesh."},{"num":10,"verse":"And I took my staff, Beauty or Grace, and broke it in pieces to show that I was annulling the covenant or agreement which I had made with all the peoples [not to molest them]."},{"num":11,"verse":"So the covenant was annulled on that day, and thus the most wretched of the flock and the traffickers in the sheep who were watching me knew (recognized and understood) that it was truly the word of the Lord."},{"num":12,"verse":"And I said to them, If it seems just and right to you, give me my wages; but if not, withhold them. So they weighed out for my price thirty pieces of silver."},{"num":13,"verse":"And the Lord said to me, Cast it to the potter [as if He said, To the dogs!]—the munificently [miserable] sum at which I [and My shepherd] am priced by them! And I [Zechariah] took the thirty pieces of silver and cast them to the potter in the house of the Lord."},{"num":14,"verse":"Then I broke into pieces my other staff, Bands or Union, indicating that I was annulling the brotherhood between Judah and Israel."},{"num":15,"verse":"And the Lord said to me, Take up once more the implements [the staff and rod of a shepherd, but this time] of a worthless and wicked shepherd."},{"num":16,"verse":"For behold, I will raise up a false shepherd in the land; the lost and perishing he will not miss or visit, the young and scattered he will not go to seek, the wounded and broken he will not heal, nor will he feed those that are sound and strong; but he will eat the flesh of the fat ones and break off their hoofs [to consume all the flesh]."},{"num":17,"verse":"Woe to the worthless and foolish shepherd who deserts the flock! The sword shall smite his arm and his right eye; his arm shall be utterly withered and his right eye utterly blinded."}]