[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Even a meat offering.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The returning favour of the Lord will enable the daily sacrifices to be restored, which had failed through the visitation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-14 The priests were to alarm the people with the near approach of the Divine judgments. It is the work of ministers to warn of the fatal consequences of sin, and to reveal the wrath from heaven against the ungodliness and unrighteousness of men. The striking description which follows, shows what would attend the devastations of locusts, but may also describe the effects from the ravaging of the land by the Chaldeans. If the alarm of temporal judgments is given to offending nations, how much more should sinners be warned to seek deliverance from the wrath to come! Our business therefore on earth must especially be, to secure an interest in our Lord Jesus Christ; and we should seek to be weaned from objects which will soon be torn from all who now make idols of them. There must be outward expressions of sorrow and shame, fasting, weeping, and mourning; tears for trouble must be turned into tears for the sin that caused it. But rending the garments would be vain, except their hearts were rent by abasement and self-abhorrence; by sorrow for their sins, and separation from them. There is no question but that if we truly repent of our sins, God will forgive them; but whether he will remove affliction is not promised, yet the probability of it should encourage us to repent.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who knoweth if He will return - God has promised forgiveness of sins and of eternal punishment to those who turn to Him with their whole heart. Of this, then, there could be no doubt. But He has not promised either to individuals or to Churches, that He will remit the temporal punishment which He had threatened. He forgave David the sin. Nathan says, \"The Lord also hath put away thy sin.\" But he said at the same time, \"the sword shall never depart from thy house ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the temporal punishment of his sin pursued him, even on the bed of death. David thought that the temporal punishment of his sin, in the death of the child, might be remitted to him. He used the same form of words as Joel, \"I said, who can tell whether God will be gracious unto me, that the child may live?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But the child died. The king of Nineveh used the like words, \"Who can tell if God will return and repent and turn away from His fierce anger, that we perish not?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he was heard. God retained or remitted the temporal punishment, as He saw good for each. This of the prophet Joel is of a mixed character. The \"blessing\" which they crave, he explains to be \"the meat offering and the drink offering,\" which had been \"cut off or withholden\" from the house of their God. For  \"if He gave them wherewith to serve Him,\" after withdrawing it, it was clear that \"He would accept of them and be pleased with their service.\" Yet this does not imply that He would restore all to them. A Jewish writer  notes that after the captivity, \"the service of sacrifices alone returned to them,\" but that \"prophecy, (soon after), the ark, the Urim and Thummim, and the other things (the fire from heaven) were missing there.\" As a pattern, however, to all times, God teaches them to ask first what belongs to His kingdom and His righteousness, and to leave the rest to Him. So long as the means of serving Him were left, there was hope of all. Where the sacrament of the Body and Blood of Christ (whereof \"the meat offering and the drink offering\" were symbols) remains, there are  \"the pledges of His love,\" the earnest of all other blessing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He says, \"leave a blessing behind Him,\" speaking of God as one estranged, who had been long absent and who returns, giving tokens of His forgiveness and renewed good-pleasure. God often visits the penitent soul and, by some sweetness with which the soul is bathed, leaves a token of His renewed presence. God is said to repent, not as though He varied in Himself, but because He deals variously with us, as we receive His inspirations and follow His drawings, or no. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He says, \"leave a blessing behind Him,\" speaking of God as one estranged, who had been long absent and who returns, giving tokens of His forgiveness and renewed good-pleasure. God often visits the penitent soul and, by some sweetness with which the soul is bathed, leaves a token of His renewed presence. God is said to repent, not as though He varied in Himself, but because He deals variously with us, as we receive His inspirations and follow His drawings, or no. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. leave … a meat offering and a drink offering—that is, give plentiful harvests, out of the first-fruits of which we may offer the meat and drink offering, now \"cut off\" through the famine (Joe 1:9, 13, 16). \"Leave behind Him\": as God in visiting His people now has left behind Him a curse, so He will, on returning to visit them, leave behind Him a blessing.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " None need be discouraged, as if it were too late to seek and hope for mercy; God will pardon the truly penitent, and deliver them from eternal miseries, and it is possible he may deliver from present temporal calamities also. If you obtain not all you would, you shall obtain enough to show that it was worth your while to seek God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Return:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God doth not locally move from one place to another, but when he withholds his blessings, the fruits of his favour, he is said to withdraw himself; so when he gives out his blessings, he is said to return. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Repent:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joel 2:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leave a blessing behind him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cause the locusts to depart before they have eaten up all that is in the land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A meat-offering and a drink-offering:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joel 1:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who knoweth if he will return and repent,.... Which some understand of man, and of his returning and repentance; either thus whosoever he be that knows the ways of repentance, he will return, and God will repent of this evil: which sense is mentioned by Kimchi and Ben Melech: or he that knoweth that iniquity is on him will return and repent; so Jarchi, with which agrees the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"he that knows that sins are in him will return from them, and he shall obtain mercy; and whoever repents, his sins shall be forgiven him;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but rather they are to be understood of God, as some in Kimchi, and paraphrase it, who knows? perhaps God may return; and this is the sense of Aben Ezra, and seems to be most correct; and to be interpreted, either as carrying some doubt in it; not as if it was questionable whether God will give pardon to repenting sinners, but whether he will at once remove the present affliction and chastisement; which may be thus expressed to check the presumption and awaken the security of the people, and rouse them from their sluggishness and stupidity: or rather as expressive of hope that God would return and change the dispensation of his providence, and repent of the evil he had threatened, or brought upon them; which might be justly grounded upon the character before given of him, and that from the revelation of himself, and the proclamation of his own perfections; see Jonah 3:9; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but rather they are to be understood of God, as some in Kimchi, and paraphrase it, who knows? perhaps God may return; and this is the sense of Aben Ezra, and seems to be most correct; and to be interpreted, either as carrying some doubt in it; not as if it was questionable whether God will give pardon to repenting sinners, but whether he will at once remove the present affliction and chastisement; which may be thus expressed to check the presumption and awaken the security of the people, and rouse them from their sluggishness and stupidity: or rather as expressive of hope that God would return and change the dispensation of his providence, and repent of the evil he had threatened, or brought upon them; which might be justly grounded upon the character before given of him, and that from the revelation of himself, and the proclamation of his own perfections; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and leave a blessing behind him; meaning not behind God himself, as if he was departed, or about to depart, for which there was no great concern, provided he left a temporal blessing with them; but behind the army of the locust, after that had made all the devastation it did: or rather \"cause to leave\"; stop the locust in its progress, and not suffer it to make a total desolation, but cause it to leave some of the fruits of the earth behind it. So Aben Ezra gives the sense of the words, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"perhaps God will return, and cause the locust to leave a blessing;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to the same purpose Jarchi, of which they make a meat offering and a drink offering, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "even a meat offering and a drink offering to the Lord your God; at least leave so much of the wheat, that a meat offering might be made of it; and so many of the vines, as that so much wine might be produced by them as would furnish out a drink offering to be offered to the Lord, agreeably to the laws given about these; for which the greatest concern is expressed, this being cut off and withheld from the house of the Lord, by reason of the present scarcity, Joel 1:9; which shows a truly pious and religious mind, having more at heart the worship of God than themselves and families. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "even a meat offering and a drink offering to the Lord your God; at least leave so much of the wheat, that a meat offering might be made of it; and so many of the vines, as that so much wine might be produced by them as would furnish out a drink offering to be offered to the Lord, agreeably to the laws given about these; for which the greatest concern is expressed, this being cut off and withheld from the house of the Lord, by reason of the present scarcity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which shows a truly pious and religious mind, having more at heart the worship of God than themselves and families. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Who knoweth if he will {k} return and repent, and leave a blessing behind him; even a meat offering and a drink offering unto the LORD your God?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who knoweth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "if",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he will ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " return and repent, and leave a blessing behind him; ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "even",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a meat offering and a drink offering unto the LORD your God?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) He speaks this to stir up their slothfulness, and not that he doubted of God's mercies, if they did repent. For the way in which God repents, read Geneva Jer 18:8",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who knoweth if he will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who knoweth? he will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …, i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Peradventure he will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …, or (R.V.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who knoweth whether he will not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …? The same idiom in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and (in the same phrase as here) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "turn back",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] viz. from the path of judgment upon which he has entered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and leave a blessing behind him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] as he turns back.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a blessing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] viz. by permitting the earth again to mature its fruits and yield materials for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "meal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-and drink-offerings in the sanctuary (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The fruits of the earth are a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blessing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " bestowed by God upon man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.); and they are a double blessing, when, as here, being such as can be offered to Jehovah, they help to ensure His good-will.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who knoweth if he will return and repent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is, return from and repent of his purpose of executing judgment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And leave a blessing behind him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is, leave behind him when returning from the exercise of judgment to resume his seat on the heavenly throne, the blessing being a replacement of the harvest fruits which the locusts had consumed, even a meat offering and a drink offering, for the service of the sanctuary as well as sustenance to supply the people's own bodily wants. Jerome explains the question of ver. 14 with much judgment as follows: \"Lest perchance they might either despair on account of the magnitude of their crimes, or the greatness of the Divine clemency might make them careless.\" Besides ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the interrogative rendering, there is ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that of the Chaldee, followed by Rashi and Kimchi. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The latter says, \"He that knows the way of repentance, let him repent, and God will repent of this evil.\" Also in addition to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, Authorized Version, he (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God) \"shall leave a blessing,\" there is ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that of Rashi and Aben Ezra, who explain as follows: \"Perhaps God will repent, and that army shall leave a blessing, out of which they may make a meat offering and a drink offering.\" Joel 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But there is still time to avert the completion of the judgment by sincere repentance and mourning; for God is merciful, and ready to forgive the penitent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Yet even now, is the saying of Jehovah, turn ye to me with all your heart, and with fasting, and with weeping, and with mourning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And rend your heart and not your garments, and turn back to Jehovah your God; for He is gracious and merciful, long-suffering, and great in kindness, and suffers Himself to repent of the evil. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Who knoweth He turns and repents, and leaves behind Him blessing, meat-offering and drink-offering for Jehovah your God?\" As the plague of locusts was intended to bring the people to reflect upon their conduct towards the Lord, so was the announcement of the great day of judgment and all its terrors made with no other object than to produce repentance and conversion, and thereby promote the good of the people of God. Joel therefore appends to the threatening of judgment a summons to sincere conversion to the Lord; and this he does by first of all addressing the summons to the people as a saying of Jehovah (v. 12), and then explaining this word of God in the most emphatic manner (vv. 13, 14). The Lord God requires conversion to Himself with all the heart (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and for שׂוּב עד, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), associated with deep-rooted penitence on account of sin, which is to be outwardly manifested in fasting and mourning. But lest the people should content themselves with the outward signs of mourning, he proceeds in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the warning admonition, \"Rend your heart, and not your garments.\" Rending the heart signifies contrition of heart (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 36:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He then assigns the motive for this demand, by pointing to the mercy and grace of God, in the words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with which the Lord made known to Moses His inmost nature, except that in the place of ואמת, which we find in this passage, he adds, on the ground of the facts recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 32:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 24:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ונחם על הרעה. On the strength of these facts he hopes, even in the present instance, for forgiveness on the part of God, and the removal of the judgment. \"Who knoweth?\" equivalent to \"perhaps;\" not because \"too confident a hope would have had in it something offensive to Jehovah\" (Hitzig), but \"lest perchance they might either despair on account of the magnitude of their crimes, or the greatness of the divine clemency might make them careless\" (Jerome).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"He speaks after the manner of a terrified conscience, which is lifted up again with difficulty after a season of affliction, and begins to aspire after hope and the mercy of God. Moreover, the expression 'who knoweth' is a Hebrew phrase, which does not indicate doubt, but rather affirmation, coupled with desire, as if we were to say, 'And yet surely God will turn again.'\" - Luther, Enarrat. in Joelem, Opp., Jena 1703, p. iii.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ישׁוּב, to turn, sc. from coming to judgment. נהם as in Joel 2:13. השׁאיר אחריו, to leave behind Him, sc. when He returns to His throne in heaven (Hosea 5:15). Berâkhâh, a blessing, viz., harvest-produce for a meat-offering and drink-offering, which had been destroyed by the locusts (Joel 1:9, Joel 1:13). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ישׁוּב, to turn, sc. from coming to judgment. נהם as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". השׁאיר אחריו, to leave behind Him, sc. when He returns to His throne in heaven (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 5:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Berâkhâh, a blessing, viz., harvest-produce for a meat-offering and drink-offering, which had been destroyed by the locusts (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]