[{"num":16,"verse":"1 The parable of the steward accused to his master. 13 To serve two masters. 16 The law and the Prophets. 19 Of Dives and Lazarus."},{"num":1,"verse":"And he said also unto his disciples, There was a certain rich man, which had a steward, and he was accused unto him, that he wasted his goods. "},{"num":2,"verse":"And he called him, and said unto him, How is it that I hear this of thee? Give an account of thy stewardship: for thou mayest be no longer steward. "},{"num":3,"verse":"Then the steward said within himself, What shall I do? for my master taketh away from me the stewardship. I cannot dig, and to beg I am ashamed. "},{"num":4,"verse":"I know what I will do, that when I am put out of the stewardship, they may receive me into their houses. "},{"num":5,"verse":"Then called he unto him everyone of his master’s debtors, and said unto the first, How much owest thou unto my master? "},{"num":6,"verse":"And he said, An hundred measures of oil. And he said to him, Take thy writing, and sit down quickly, and write fifty. "},{"num":7,"verse":"Then said he to another, How much owest thou? And he said, An hundred measures of wheat. Then he said to him, Take thy writing and write fourscore. "},{"num":8,"verse":"And the Lord commended the unjust steward, because he had done wisely. Wherefore the children of this world are in their generation wiser than the children of light. "},{"num":9,"verse":"And I say unto you, Make you friends with the riches of iniquity, that when ye shall want, they may receive you into everlasting habitations. "},{"num":10,"verse":"He that is faithful in the least, he is also faithful in much: and he that is unjust in the least, is unjust also in much. "},{"num":11,"verse":"If then ye have not been faithful in the wicked riches, who will trust you in the true treasure? "},{"num":12,"verse":"And if ye have not been faithful in another man’s goods, who shall give you that which is yours? "},{"num":13,"verse":"No servant can serve two masters: for either he shall hate the one, and love the other: or else he shall lean to the one, and despise the other. Ye cannot serve God and riches. "},{"num":14,"verse":"All these things heard the Pharisees also which were covetous, and they scoffed at him."},{"num":15,"verse":"Then he said unto them, Ye are they, which justify yourselves before men: but God knoweth your hearts: for that which is highly esteemed among men, is abomination in the sight of God. "},{"num":16,"verse":"The Law and the Prophets endured until John: and since that time the kingdom of God is preached, and every man presseth into it. "},{"num":17,"verse":"Now it is more easy that heaven and earth should pass away, than that one tittle of the Law should fall. "},{"num":18,"verse":"¶ Whosoever putteth away his wife, and marrieth another, commiteth adultery: and whosoever marrieth her that is put away from her husband, commiteth adultery. "},{"num":19,"verse":"¶ There was a certain rich man, which was clothed in purple and fine linen, and fared well and delicately every day. "},{"num":20,"verse":"Also there was a certain beggar named Lazarus, which was laid at his gate full of sores, "},{"num":21,"verse":"And desired to be refreshed with the crumbs that fell from the rich man’s table: yea, and the dogs came and licked his sores. "},{"num":22,"verse":"And it was so that the beggar died, and was carried by the Angels into Abraham’s bosom. The rich man also died, and was buried. "},{"num":23,"verse":"And being in hell in torments, he lifted up his eyes, and saw Abraham afar off, and Lazarus in his bosom. "},{"num":24,"verse":"Then he cried, and said, Father Abraham, have mercy on me, and send Lazarus that he may dip the tip of his finger in water, and cool my tongue: for I am tormented in this flame. "},{"num":25,"verse":"But Abraham said, Son, remember that thou in thy lifetime receivedst thy pleasures, and likewise Lazarus pains: now therefore is he comforted, and thou art tormented. "},{"num":26,"verse":"Besides all this, between you and us there is a great gulf set, so that they which would go from hence to you, cannot: neither can they come from thence to us. "},{"num":27,"verse":"Then he said, I pray thee therefore father, that thou wouldest send him to my father’s house, "},{"num":28,"verse":"(For I have five brethren) that he may testify unto them, lest they also come into this place of torment. "},{"num":29,"verse":"Abraham said unto him, They have Moses and the Prophets: let them hear them. "},{"num":30,"verse":"And he said, Nay, father Abraham: but if one came unto them from the dead, they will amend their lives. "},{"num":31,"verse":"Then he said unto him, If they hear not Moses and the Prophets, neither will they be persuaded, though one rise from the dead again. "}]