[{"header":"A clever rogue, and the right use of money"},{"num":1,"verse":"Then there is this story he told his disciples: “Once there was a rich man whose agent was reported to him to be mismanaging his property. So he summoned him and said, ‘What’s this I hear about you? Give me an account of your stewardship—you’re not fit to manage my household any longer.’ At this the agent said to himself, ‘What am I going to do now that my employer is taking away the stewardship from me? I am not strong enough to dig and I can’t sink to begging. Ah, I know what I’ll do so that when I lose my position people will welcome me into their homes!’ So he sent for each one of his master’s debtors. ‘How much do you owe my master?’ he said to the first. ‘A hundred barrels of oil,’ he replied. ‘Here,’ replied the agent, ‘take your bill, sit down, hurry up and write in fifty.’ Then he said to another, ‘And what’s the size of your debt?’ ‘A thousand bushels of wheat,’ he replied. ‘Take your bill,’ said the agent, ‘and write in eight hundred.’ Now the master praised this rascally steward because he had been so careful for his own future. For the children of this world are considerably more shrewd in dealing with their contemporaries than the children of light. Now my advice to you is to use ‘money’, tainted as it is, to make yourselves friends, so that when it comes to an end, they may welcome you into eternal habitations."},{"num":10,"verse":"“The man who is faithful in the little things will be faithful in the big things, and the man who cheats in the little things will cheat in the big things too. So that if you are not fit to be trusted to deal with the wicked wealth of this world, who will trust you with the true riches? And if you are not trustworthy with someone else’s property, who will give you property of your own?”"},{"num":13,"verse":"“No servant can serve two masters. He is bound to hate one and love the other, or give his loyalty to one and despise the other. You cannot serve God and the power of money at the same time.”"},{"num":14,"verse":"Now the Pharisees, who were very fond of money, heard all this with a sneer. But he said to them, “You are the people who advertise your goodness before men, but God knows your hearts. Remember, there are things men consider perfectly splendid which are detestable in the sight of God!”"},{"header":"Jesus states that the kingdom of God has superseded “the Law and the Prophets”"},{"num":16,"verse":"“The Law and the Prophets were in force until John’s day. From then on the good news of the kingdom of God has been proclaimed and men are forcing their way into it."},{"num":17,"verse":"“Yet it would be easier for heaven and earth to disappear than for a single point of the Law to become a dead letter.”"},{"num":18,"verse":"“Any man who divorces his wife and marries another woman commits adultery. And so does any man who marries the woman who was divorced from her husband.”"},{"header":"Jesus shows the fearful consequence of social injustice"},{"num":19,"verse":"“There was once a rich man who used to dress in purple and fine linen and lead a life of daily luxury. And there was a poor man called Lazarus who was put down at his gate. He was covered with sores. He used to long to be fed with the scraps from the rich man’s table. Yes, and the dogs used to come and lick his sores. Well, it happened that the poor man died, and was carried by the angels into Abraham’s bosom. The rich man also died and was buried. And from among the dead he looked up and saw Abraham a long way away, and Lazarus in his arms. ‘Father Abraham!’ he cried out, ‘please pity me. Send Lazarus to dip the tip of his finger in water and cool my tongue, for I am in agony in these flames.’ But Abraham replied, ‘Remember, my son, that you used to have the good things in your lifetime, while Lazarus suffered the bad. Now he is being comforted here, while you are in agony. And besides this, a great chasm has been set between you and us, so that those who want to go to you from this side cannot do so, and people cannot come to us from your side.’ At this he said, ‘Then I beg you, father, to send him to my father’s house for I have five brothers. He could warn them about all this and prevent their coming to this place of torture.’ But Abraham said, ‘They have Moses and the Prophets: they can listen to them.’ ‘Ah no, father Abraham,’ he said, ‘if only someone were to go to them from the dead, they would change completely.’ But Abraham told him, ‘If they will not listen to Moses and the Prophets, they would not be convinced even if somebody were to rise from the dead.’”"}]