[{"header":"Ezekiel Speaks Against Jerusalem"},{"num":22,"verse":"The word of the Lord came to me. He said,"},{"num":2,"verse":"“Son of man, will you judge the city of murderers? Will you tell her about all the terrible things she has done?"},{"num":3,"verse":"You must say, ‘This is what the Lord God says: The city is full of murderers, so her time of punishment will come. She made filthy idols for herself, and those idols made her filthy!"},{"num":4,"verse":"“‘People of Jerusalem, you killed many people. You made filthy idols. You are guilty, and the time has come to punish you. Your end has come. Other nations will make fun of you and laugh at you."},{"num":5,"verse":"People far and near will make fun of you. You have ruined your name. You are filled with confusion."},{"num":6,"verse":"“‘Look, all the leaders in Israel are using their strength just to kill other people."},{"num":7,"verse":"And the people in Jerusalem don’t respect their parents. There in the city, they abuse the foreigners. They cheat orphans and widows in that place."},{"num":8,"verse":"You hate all that I consider holy. You treat my special days of rest as if they are not important."},{"num":9,"verse":"In Jerusalem, people tell lies in order to kill innocent people. They go to the mountains to worship false gods and then come back to Jerusalem to eat their fellowship meals."},{"num":10,"verse":"There men commit sexual sins with their father’s wife. There the men rape women—even during their monthly time of bleeding."},{"num":11,"verse":"One man commits a terrible sin against his own neighbor’s wife. Another man has sex with his daughter-in-law and makes her unclean. Another man rapes his father’s daughter—his very own sister."},{"num":12,"verse":"There men accept bribes to kill people. You lend money and charge interest on the loans. You cheat your neighbors just to make a little money. You have even forgotten me.’ This is what the Lord God said."},{"num":13,"verse":"“‘Now look! I will slam my hand down and stop you! I will punish you for cheating and killing people."},{"num":14,"verse":"Will you be brave then? Will you be strong at the time I come to punish you? I am the Lord. I have spoken, and I will do what I said!"},{"num":15,"verse":"I will scatter you among the nations. I will force you to go to many countries. I will completely destroy the filthy things in this city."},{"num":16,"verse":"But Jerusalem, you will become unclean. And the other nations will see all these things happen. Then you will know that I am the Lord.’”"},{"header":"Israel Is Like Worthless Waste"},{"num":17,"verse":"The word of the Lord came to me. He said,"},{"num":18,"verse":"“Son of man, bronze, iron, lead, and tin are important metals, but when a worker melts silver to make it pure, those metals are poured off as waste. Israel has become like that waste to me."},{"num":19,"verse":"So this is what the Lord God says: ‘All of you have become like worthless waste. So I will gather you into Jerusalem."},{"num":20,"verse":"Workers put silver, bronze, iron, lead, and tin into a fire. They blow on the fire to make it hotter. Then the metals begin to melt. In the same way I will put you in my fire and melt you. That fire is my hot anger."},{"num":21,"verse":"I will put you in my fire of anger and blow on it, and you will begin to melt."},{"num":22,"verse":"In that city, you will be like silver melting in a fire. Then you will know that I am the Lord, and that I poured out my anger on you.’”"},{"header":"Ezekiel Speaks Against Jerusalem"},{"num":23,"verse":"The word of the Lord came to me. He said,"},{"num":24,"verse":"“Son of man, speak to Israel. Tell her that she is not pure. I am angry at that country, so that country has not received its rain."},{"num":25,"verse":"The prophets in Jerusalem are making evil plans. They are like a lion—it roars when it begins to eat the animal it caught. They have destroyed many lives. They have taken many valuable things and made widows of many of the women in Jerusalem."},{"num":26,"verse":"“The priests have really hurt my teachings. They don’t treat my holy things right—they don’t show they are important. They treat holy things the same as things that are not holy. They treat clean things like things that are unclean. They don’t teach the people about these things. They refuse to respect my special days of rest. They treat me as though I am not important."},{"num":27,"verse":"“The leaders in Jerusalem are like a wolf eating the animal it has caught. They attack people and kill them just to get rich."},{"num":28,"verse":"“The prophets don’t warn the people—they cover up the truth. They are like workers who don’t really repair a wall—they only put plaster over the holes. They only see lies. They do their magic to learn the future, but they only tell lies. They say, ‘This is what the Lord God said.’ But they are only lying—the Lord did not speak to them!"},{"num":29,"verse":"“The common people take advantage of each other. They cheat and steal from each other. They get rich by taking advantage of poor, helpless beggars, and they really cheat the foreigners. They are not fair to them at all!"},{"num":30,"verse":"“I asked the people to change their lives and protect their country. I asked people to fix the walls. I wanted them to stand by those holes in the wall and fight to protect their city. But no one came to help!"},{"num":31,"verse":"So I will show them my anger—I will completely destroy them. I will punish them for the evil things they have done. It is all their fault.” This is what the Lord God said."}]