[{"num":22,"verse":"Now another message came from the Lord. He said:"},{"num":2,"verse":"“Son of dust, indict Jerusalem as the City of Murder. Publicly denounce her terrible deeds. "},{"num":3,"verse":"City of Murder, doomed and damned—City of Idols, filthy and foul—"},{"num":4,"verse":"you are guilty both of murder and idolatry. Now comes your day of doom. You have reached the limit of your years. I will make you a laughingstock and a reproach to all the nations of the world. "},{"num":5,"verse":"Near and far they will mock you, a city of infamous rebels."},{"num":6,"verse":"“Every leader in Israel who lives within your walls is bent on murder. "},{"num":7,"verse":"Fathers and mothers are contemptuously ignored; immigrants and visitors are forced to pay you for your ‘protection’; orphans and widows are wronged and oppressed. "},{"num":8,"verse":"The things of God are all despised; my Sabbaths are ignored. "},{"num":9,"verse":"Prisoners are falsely accused and sent to their death. Every mountaintop is filled with idols; lewdness is everywhere. "},{"num":10,"verse":"There are men who commit adultery with their fathers’ wives and lie with menstruous women. "},{"num":11,"verse":"Adultery with a neighbor’s wife, a daughter-in-law, a half sister—this is common. "},{"num":12,"verse":"Hired murderers, loan racketeers, and extortioners are everywhere. You never even think of me and my commands,” the Lord God says."},{"num":13,"verse":"“But now I snap my fingers and call a halt to your dishonest gain and bloodshed. "},{"num":14,"verse":"How strong and courageous will you be then, in my day of reckoning? For I, the Lord, have spoken, and I will do all that I have said. "},{"num":15,"verse":"I will scatter you throughout the world and burn out the wickedness within you. "},{"num":16,"verse":"You will be dishonored among the nations, and you shall know I am the Lord.”"},{"num":17,"verse":"Then the Lord said this:"},{"num":18,"verse":"“Son of dust, the people of Israel are the worthless slag left when silver is smelted. They are the dross, compounded from the brass, the tin, the iron, and the lead. Therefore the Lord God says: ‘Because you are worthless dross, I will bring you to my crucible in Jerusalem, to smelt you with the heat of my wrath. "},{"num":21,"verse":"I will blow the fire of my wrath upon you, "},{"num":22,"verse":"and you will melt like silver in fierce heat, and you will know that I, the Lord, have poured my wrath upon you.’”"},{"num":23,"verse":"Again the message of the Lord came to me, saying:"},{"num":24,"verse":"“Son of dust, say to the people of Israel: ‘In the day of my indignation you shall be like an uncleared wilderness or a desert without rain.’ "},{"num":25,"verse":"Your ‘prophets’ have plotted against you like lions stalking prey. They devour many lives; they seize treasures and extort wealth; they multiply the widows in the land. "},{"num":26,"verse":"Your priests have violated my laws and defiled my Temple and my holiness. To them the things of God are no more important than any daily task. They have not taught my people the difference between right and wrong, and they disregard my Sabbaths, so my holy name is greatly defiled among them. "},{"num":27,"verse":"Your leaders are like wolves, who tear apart their victims, and they destroy lives for profit. "},{"num":28,"verse":"Your ‘prophets’ describe false visions and speak false messages they claim are from God, when he hasn’t spoken one word to them at all. Thus they repair the walls with whitewash! "},{"num":29,"verse":"Even the common people oppress and rob the poor and needy and cruelly extort from aliens."},{"num":30,"verse":"“I looked in vain for anyone who would build again the wall of righteousness that guards the land, who could stand in the gap and defend you from my just attacks, but I found not one.” "},{"num":31,"verse":"And so the Lord God says: “I will pour out my anger upon you; I will consume you with the fire of my wrath. I have heaped upon you the full penalty for all your sins.”"}]