[{"num":9,"verse":"If only my head were a well of water, and my eyes a well of tears, that I might cry day and night for my people who have been killed! "},{"num":2,"verse":"If only I had a place in the desert for travelers to stay, that I might leave my people, and go away from them! For none of them are faithful. They are a gathering of men who cannot be trusted. "},{"num":3,"verse":"“They use their tongue like their bow. Lies, and not truth, rule the land. For they go from sin to sin, and they do not know Me,” says the Lord. "},{"num":4,"verse":"“Let every one watch his neighbor. Do not trust any brother. Because every brother sets traps, and every neighbor goes about hurting people with his talk. "},{"num":5,"verse":"Every one fools his neighbor, and does not tell the truth. They have taught their tongue to tell lies. They become tired doing so many sins. "},{"num":6,"verse":"You live in the center of false ways. In their false ways they are not willing to know Me,” says the Lord."},{"num":7,"verse":"So the Lord of All says, “See, I will make them pure and test them. For what else can I do with My people? "},{"num":8,"verse":"Their tongue is an arrow that kills. It lies. A man speaks peace to his neighbor with his mouth, but in his heart he plans to trap him. "},{"num":9,"verse":"Should I not punish them for these things?” says the Lord. “Should I not make a nation such as this pay for its sins?"},{"num":10,"verse":"“I will cry with a loud voice for the mountains. I will cry out in sorrow for the fields, because they are laid waste. No one passes through them. The sound of the cattle is not heard. The birds of the sky and the wild animals have run away. They are gone. "},{"num":11,"verse":"I will break down Jerusalem into pieces, a place where wild dogs live. And I will lay waste the cities of Judah. No people will live there.”"},{"num":12,"verse":"Who is the man wise enough to understand this? To whom has the mouth of the Lord spoken, that he may make it known? Why is the land destroyed and laid waste like a desert, so that no one passes through? "},{"num":13,"verse":"And the Lord said, “They have turned away from My Law that I have given them. They have not obeyed My voice and would not be led by it. "},{"num":14,"verse":"But they have followed the strongwill of their own hearts, and have gone after the false gods of Baal, as their fathers taught them.” "},{"num":15,"verse":"So the Lord of All, the God of Israel, says, “See, I will feed these people with wormwood and put poison in their drinking water. "},{"num":16,"verse":"I will spread them out among the nations whom they and their fathers have not known. And I will go after them with the sword until I have put an end to them.”"},{"header":"Jerusalem Cries for Help"},{"num":17,"verse":"The Lord of All says, “Take thought and call for the women who are filled with sorrow, that they may come. Call for the women who cry for the dead, that they may come. "},{"num":18,"verse":"Let them hurry and cry in a loud voice for us, that tears may come from our eyes, and that our eyes will flow with water. "},{"num":19,"verse":"For a sound of loud crying is heard from Zion: ‘How we are destroyed! We are filled with shame, for we have left the land because they have broken down our houses.’” "},{"num":20,"verse":"Now hear the Word of the Lord, O you women. Let your ear receive the Word of His mouth. Teach your daughters a song of sorrow. Every one teach her neighbor a song for the dead. "},{"num":21,"verse":"For death has come in through our windows. It has come into our beautiful houses of kings. It has cut off the children from the streets, and the young men from the open spaces of the city. "},{"num":22,"verse":"Say, “This is what the Lord says: ‘The dead bodies of men will fall like animal waste on the open field, and like grain after the gatherer. But no one will gather them.’”"},{"num":23,"verse":"The Lord says, “Let not a wise man speak with pride about his wisdom. Let not the strong man speak with pride about his strength. And let not a rich man speak with pride about his riches. "},{"num":24,"verse":"But let him who speaks with pride speak about this, that he understands and knows Me, that I am the Lord who shows loving-kindness and does what is fair and right and good on earth. For I find joy in these things,” says the Lord."},{"num":25,"verse":"“See, the days are coming,” says the Lord, “when I will punish all who have gone through the religious act of the Jews, but have not had the sin cut from their heart. "},{"num":26,"verse":"I will punish Egypt, Judah, Edom, the sons of Ammon, Moab, and all those who live in the desert. For none of these nations have had their flesh cut. And none of the people of Israel have had the sin cut from their heart.”"}]