[{"num":19,"verse":"Jehoshaphat, the king of Judah, returned safely to his palace in Jerusalem. "},{"num":2,"verse":"Jehu the prophet went out to meet him. He was the son of Hanani. Jehu said to the king, “You shouldn’t help evil people. You shouldn’t love those who hate the Lord. The Lord is angry with you. "},{"num":3,"verse":"But there’s some good in you. You have removed all the poles in the land used to worship the female god named Asherah. And you have worshiped God with all your heart.”"},{"header":"Jehoshaphat Appoints Judges"},{"num":4,"verse":"Jehoshaphat lived in Jerusalem. He went out again among the people. He went from Beersheba to the hill country of Ephraim. He turned the people back to the Lord, the God of Israel. "},{"num":5,"verse":"Jehoshaphat appointed judges in the land. He put them in all the cities of Judah that had high walls around them. "},{"num":6,"verse":"He told the judges, “Think carefully about what you do. After all, you aren’t judging for human beings. You are judging for the Lord. He’s with you every time you make a decision. "},{"num":7,"verse":"Have respect for the Lord. Judge carefully. He is always right. He treats everyone the same. Our God doesn’t want his judges to take money from people who want special favors.”"},{"num":8,"verse":"In Jerusalem, Jehoshaphat chose some Levites and priests. He also chose some leaders of Israelite families. He appointed all of them to apply the law of the Lord fairly. He wanted them to decide cases. He wanted them to settle matters between people. All those judges lived in Jerusalem. "},{"num":9,"verse":"Here are the orders Jehoshaphat gave them. He said, “Have respect for the Lord. Serve him faithfully. Do it with all your heart. "},{"num":10,"verse":"Cases will come to you from your people who live in the other cities. The cases might be about murder or other matters dealt with by the law, commands, directions and rules. Warn the people not to sin against the Lord. If you don’t warn them, he will be angry with you and your people. Do what I say. Then you won’t sin."},{"num":11,"verse":"“Amariah the chief priest will be over you in any matter that concerns the Lord. Zebadiah is the leader of the tribe of Judah. He is the son of Ishmael. Zebadiah will be over you in any matter that concerns the king. The Levites will serve as your officials. Be brave. And may the Lord be with those of you who do well.”"}]