[{"num":19,"verse":"King Jehoshaphat of Judah returned in peace to his house in Jerusalem. "},{"num":2,"verse":"Jehu the son of Hanani the man who tells what will happen in the future went out to meet King Jehoshaphat, and said to him, “Should you help the sinful? Should you love those who hate the Lord? Because of this, the Lord is angry with you. "},{"num":3,"verse":"But there is some good in you. For you have destroyed from the land the false goddess Asherah. And you have set your heart to follow God.”"},{"header":"The Changes Made by Jehoshaphat"},{"num":4,"verse":"So Jehoshaphat lived in Jerusalem. He went out again among the people from Beersheba to the hill country of Ephraim. And he brought them back to the Lord, the God of their fathers. "},{"num":5,"verse":"He chose judges in the land in all the strong cities of Judah, city by city. "},{"num":6,"verse":"And he said to the judges, “Think about what you do. For you do not judge for man, but for the Lord. He is with you when you judge between right and wrong. "},{"num":7,"verse":"So now let the fear of the Lord be upon you. Be very careful what you do. For the Lord our God will have nothing to do with what is not right and good, or with what is not fair, or with taking pay for doing what is wrong.”"},{"num":8,"verse":"In Jerusalem also Jehoshaphat chose some of the Levites and religious leaders, and heads of families of Israel. He chose them to judge for the Lord, and to judge the troubles among the people of Jerusalem. "},{"num":9,"verse":"Then he told them what they must do. He said, “Do this in the fear of the Lord. Be faithful, and do your duty with your whole heart. "},{"num":10,"verse":"Whenever trouble comes to you between your brothers who live in the cities, between blood and blood, between one law and another, tell them not to sin before the Lord, so God’s anger may not come upon you and your brothers. Do this, and you will not be guilty. "},{"num":11,"verse":"See, Amariah the head religious leader will be over you in everything that has to do with the Lord. And Zebadiah the son of Ishmael, the ruler of the family of Judah, will be over you in everything that has to do with the king. The Levites will work for you as leaders. Be strong in what you do, and the Lord will be with the good.”"}]