[{"num":15,"verse":"Then some P’rushim and Torah-teachers from Yerushalayim came to Yeshua and asked him, "},{"num":2,"verse":"“Why is it that your talmidim break the Tradition of the Elders? They don’t do n’tilat-yadayim before they eat!” "},{"num":3,"verse":"He answered, “Indeed, why do you break the command of God by your tradition? "},{"num":4,"verse":"For God said, ‘Honor your father and mother,’ and ‘Anyone who curses his father or mother must be put to death.’ "},{"num":5,"verse":"But you say, ‘If anyone says to his father or mother, “I have promised to give to God what I might have used to help you,” "},{"num":6,"verse":"then he is rid of his duty to honor his father or mother.’ Thus by your tradition you make null and void the word of God! "},{"num":7,"verse":"You hypocrites! Yesha‘yahu was right when he prophesied about you,"},{"num":10,"verse":"Then he called the crowd to him and said, “Listen and understand this! "},{"num":11,"verse":"What makes a person unclean is not what goes into his mouth; rather, what comes out of his mouth, that is what makes him unclean!”"},{"num":12,"verse":"The talmidim came to him and said, “Do you know that the P’rushim were offended by what you said?” "},{"num":13,"verse":"He replied, “Every plant that my Father in heaven has not planted will be pulled up by the roots. "},{"num":14,"verse":"Let them be. They are blind guides. When a blind man guides another blind man, both will fall in a pit.”"},{"num":15,"verse":"Kefa said to him, “Explain the parable to us.” "},{"num":16,"verse":"So he said, “Don’t you understand even now? "},{"num":17,"verse":"Don’t you see that anything that enters the mouth goes into the stomach and passes out into the latrine? "},{"num":18,"verse":"But what comes out of your mouth is actually coming from your heart, and that is what makes a person unclean. "},{"num":19,"verse":"For out of the heart come forth wicked thoughts, murder, adultery and other kinds of sexual immorality, theft, lies, slanders. . . . "},{"num":20,"verse":"These are what really make a person unclean, but eating without doing n’tilat-yadayim does not make a person unclean.”"},{"num":21,"verse":"Yeshua left that place and went off to the region of Tzor and Tzidon. "},{"num":22,"verse":"A woman from Kena‘an who was living there came to him, pleading, “Sir, have pity on me. Son of David! My daughter is cruelly held under the power of demons!” "},{"num":23,"verse":"But Yeshua did not say a word to her. Then his talmidim came to him and urged him, “Send her away, because she is following us and keeps pestering us with her crying.” "},{"num":24,"verse":"He said, “I was sent only to the lost sheep of the house of Isra’el.” "},{"num":25,"verse":"But she came, fell at his feet and said, “Sir, help me!” "},{"num":26,"verse":"He answered, “It is not right to take the children’s food and toss it to their pet dogs.” "},{"num":27,"verse":"She said, “That is true, sir, but even the dogs eat the leftovers that fall from their master’s table.” "},{"num":28,"verse":"Then Yeshua answered her, “Lady, you are a person of great trust. Let your desire be granted.” And her daughter was healed at that very moment."},{"num":29,"verse":"Yeshua left there and went along the shore of Lake Kinneret. He climbed a hill and sat down; "},{"num":30,"verse":"and large crowds came to him, bringing with them the lame, the blind, the crippled, the mute and many others. They laid them at his feet, and he healed them. "},{"num":31,"verse":"The people were amazed as they saw mute people speaking, crippled people cured, lame people walking and blind people seeing; and they said a b’rakhah to the God of Isra’el."},{"num":32,"verse":"Yeshua called his talmidim to him and said, “I feel sorry for these people, because they have been with me three days, and now they have nothing to eat. I don’t want to send them away hungry, because they might collapse on the way home.” "},{"num":33,"verse":"The talmidim said to him, “Where will we find enough loaves of bread in this remote place to satisfy so big a crowd?” "},{"num":34,"verse":"Yeshua asked them, “How many loaves do you have?” They said, “Seven, and a few fish.” "},{"num":35,"verse":"After telling the crowd to sit down on the ground, "},{"num":36,"verse":"he took the seven loaves and the fish, made a b’rakhah, broke the loaves and gave them to the talmidim, who gave them to the people. "},{"num":37,"verse":"Everyone ate his fill, and they took seven large baskets full of the leftover pieces. "},{"num":38,"verse":"Those eating numbered four thousand men, plus women and children. "},{"num":39,"verse":"After sending the crowd away, he got in the boat and went off to the region of Magadan."}]