[{"header":"Jesus Breaks Religious Traditions"},{"num":15,"verse":"Then the Pharisees and religious scholars came from Jerusalem and asked Jesus this question: "},{"num":2,"verse":"“Why do your disciples ignore the traditions of our elders? For example, they don’t ceremonially wash their hands before they eat bread.”"},{"num":3,"verse":"Jesus answered, “And why do you ignore the commandment of God because of your traditions? "},{"num":4,"verse":"For didn’t God say, ‘Honor your father and mother,’ and, ‘Whoever abuses or insults his father or mother must be put to death?’"},{"num":5,"verse":"“But you teach that it’s permissible to say to your parents when they are in financial need, ‘Whatever gift you would have received from me I can keep for myself, since I dedicated it as an offering to God.’ "},{"num":6,"verse":"This doesn’t honor your father or mother. And you have elevated your tradition above the words of God. "},{"num":7,"verse":"Frauds and hypocrites! Isaiah described you perfectly when he said:"},{"num":10,"verse":"Then Jesus turned to the crowd and said, “Come, listen and open your heart to understand. "},{"num":11,"verse":"What truly contaminates a person is not what he puts into his mouth but what comes out of his mouth. That’s what makes people defiled.”"},{"num":12,"verse":"Then his disciples approached him and said, “Don’t you know that what you just said offended the Pharisees?”"},{"num":13,"verse":"Jesus replied, “Every plant that my heavenly Father didn’t plant is destined to be uprooted. "},{"num":14,"verse":"Stay away from them, for they’re nothing more than blind guides. Do you know what happens when a blind man pretends to guide another blind man? They both stumble into a ditch!”"},{"num":15,"verse":"Peter spoke up and said, “Will you explain to us what you mean by your parable?”"},{"num":16,"verse":"Jesus said, “Even after all that I’ve taught you, you still remain clueless? "},{"num":17,"verse":"Is it hard to understand that whatever you eat enters the stomach only to pass out into the sewer? "},{"num":18,"verse":"But what comes out of your mouth reveals the core of your heart. Words can pollute, not food. "},{"num":19,"verse":"You will find living within an impure heart evil ideas, murderous thoughts, adultery, sexual immorality, theft, lies, and slander. "},{"num":20,"verse":"That’s what pollutes a person. Eating with unwashed hands doesn’t defile anyone.”"},{"header":"A Lebanese Woman’s Faith"},{"num":21,"verse":"Then Jesus left and went north into the non-Jewish region of Lebanon. "},{"num":22,"verse":"He encountered there a Canaanite woman who shouted out to him, “Lord, Son of David, show mercy to me! My daughter is horribly afflicted by a demon that torments her.” "},{"num":23,"verse":"But Jesus never answered her. So his disciples said to him, “Why do you ignore this woman who is crying out to us?”"},{"num":24,"verse":"Jesus said, “I’ve only been sent to the lost sheep of Israel.” "},{"num":25,"verse":"But she came and bowed down before him and said, “Lord, help me!”"},{"num":26,"verse":"Jesus responded, “It’s not right for a man to take bread from his children and throw it out to the dogs.”"},{"num":27,"verse":"“You’re right, Lord,” she replied. “But even puppies get to eat the crumbs that fall from the prince’s table.”"},{"num":28,"verse":"Then Jesus answered her, “Dear woman, your faith is strong! What you desire will be done for you.” And at that very moment, her daughter was instantly set free from demonic torment."},{"header":"Jesus Heals Many Others"},{"num":29,"verse":"After leaving Lebanon, Jesus went to Lake Galilee and climbed a hill nearby and sat down. "},{"num":30,"verse":"Then huge crowds of people streamed up the hill, bringing with them the lame, blind, deformed, mute, and many others in need of healing. They laid them at Jesus’ feet and he healed them all."},{"num":31,"verse":"And the crowds marveled with amazement, astounded over the things they were witnessing with their own eyes! The lame were walking, the mute were speaking, the crippled were made well, and the blind could see. For three days everyone celebrated the miracles as they exalted and praised the God of Israel!"},{"header":"Jesus Feeds Thousands"},{"num":32,"verse":"Jesus called his disciples to himself and said, “I care deeply about all these people, for they’ve already been with me for three days without food. I don’t want to send them away fasting or else they may be overcome by weakness on their journey home.”"},{"num":33,"verse":"The disciples said to him, “Where in the world are we going to find enough food in this desolate place to feed this crowd?”"},{"num":34,"verse":"“How many barley loaves do you have?” Jesus asked."},{"num":35,"verse":"So he gave the order, “Have the people sit down on the grass.” "},{"num":36,"verse":"Then he took the seven loaves and the fish and gave thanks to God. He broke the bread and gave it to his disciples, who then distributed the food to the crowds. "},{"num":37,"verse":"When everyone was full and satisfied, they gathered up the leftovers. And from what was once seven loaves and a few fish, they filled seven baskets! "},{"num":38,"verse":"There were four thousand men who ate the food Jesus multiplied, and even more including the women and children!"},{"num":39,"verse":"After dismissing the crowd, Jesus got into the boat and crossed over to the region of Magdala."}]