[{"num":2,"verse":"“Then we turned and began traveling into the desert along the road to the Sea of Suf, as Adonai had said to me; and we skirted Mount Se‘ir for a long time. "},{"num":2,"verse":"(v) Finally Adonai said to me, "},{"num":3,"verse":"‘You have been going around this mountain long enough! Head north, "},{"num":4,"verse":"and give this order to the people: “You are to pass through the territory of your kinsmen the descendants of ‘Esav who live in Se‘ir. They will be afraid of you, so be very cautious, "},{"num":5,"verse":"and don’t get into disputes with them; for I am not going to give you any of their land, no, not even enough for one foot to stand on; inasmuch as I have given Mount Se‘ir to ‘Esav as his possession. "},{"num":6,"verse":"Pay them money for the food you eat, and pay them money for the water you drink. "},{"num":7,"verse":"For Adonai your God has blessed you in everything your hands have produced. He knows that you have been traveling through this vast desert; these forty years Adonai your God has been with you; and you have lacked nothing.’"},{"num":8,"verse":"“So we went on past our kinsmen the descendants of ‘Esav living in Se‘ir, left the road through the ‘Aravah from Eilat and ‘Etzyon-Gever, and turned to pass along the road through the desert of Mo’av. "},{"num":9,"verse":"Adonai said to me, ‘Don’t be hostile toward Mo’av or fight with them, because I will not give you any of their land to possess, since I have already given ‘Ar to the descendants of Lot as their territory.’” "},{"num":10,"verse":"(The Emim used to live there, a great and numerous people as tall as the ‘Anakim. "},{"num":11,"verse":"They are also considered Refa’im, as are the ‘Anakim, but the Mo’avim call them Emim. "},{"num":12,"verse":"In Se‘ir the Horim used to live, but the descendants of ‘Esav dispossessed and destroyed them, settling in their place. Isra’el did similarly in the land it came to possess, which Adonai gave to them.) "},{"num":13,"verse":"“‘Now get going, and cross Vadi Zered!’"},{"num":14,"verse":"The time between our leaving Kadesh-Barnea and our crossing Vadi Zered was thirty-eight years — until the whole generation of men capable of bearing arms had been eliminated from the camp, as Adonai had sworn they would be. "},{"num":15,"verse":"Moreover, Adonai’s hand was against them to root them out of the camp until the last of them was gone. "},{"num":16,"verse":"When all the men who were able to bear arms had died and were no longer part of the people, "},{"num":17,"verse":"Adonai said to me, "},{"num":18,"verse":"‘Today you are to cross the border of Mo’av at ‘Ar. "},{"num":19,"verse":"When you approach the descendants of ‘Amon, don’t bother them or fight with them, for I will not give you any of the territory of the people of ‘Amon to possess, since I have given it to the descendants of Lot as their territory.’”"},{"num":20,"verse":"(This too is considered a land of the Refa’im: Refa’im, whom the Emori call Zamzumim, used to live there. "},{"num":21,"verse":"They were a large, numerous people, as tall as the ‘Anakim; but Adonai destroyed them as the people of ‘Amon advanced and settled in their place — "},{"num":22,"verse":"just as he destroyed the Horim as descendants of ‘Esav advanced into Se‘ir and settled in their place, where they live to this day. "},{"num":23,"verse":"It was the same with the ‘Avim, who lived in villages as far away as ‘Azah — the Kaftorim, coming from Kaftor, destroyed them and settled in their place.)"},{"num":24,"verse":"“‘Get up, get moving, and cross the Arnon Valley! Here, I have put in your hands Sichon the Emori, king of Heshbon, and his land; commence the conquest, begin the battle! "},{"num":25,"verse":"Today I will start putting the fear and dread of you into all the peoples under heaven, so that the mere mention of your name will make them quake and tremble before you.’"},{"num":26,"verse":"“I sent envoys from the K’demot Desert to Sichon king of Heshbon with a peaceable message, "},{"num":27,"verse":"‘Let me pass through your land. I will keep to the road, turning neither right nor left. "},{"num":28,"verse":"You will sell me food to eat for money and give me water to drink for money. I only want to pass through. "},{"num":29,"verse":"Do as the people of ‘Esav living in Se‘ir and the Mo’avim living in ‘Ar did with me, until I cross the Yarden into the land Adonai our God is giving us.’"},{"num":30,"verse":"“But Sichon king of Heshbon would not let us pass through his territory, because Adonai your God had hardened his spirit and made him stubborn, so that he could hand him over to you, as is the case today. "},{"num":31,"verse":"(vi) Adonai said to me, ‘See, I have begun handing over Sichon and his territory before you; start taking possession of his land.’ "},{"num":32,"verse":"Then Sichon came out against us, he and all his people, to fight at Yahatz; "},{"num":33,"verse":"and Adonai our God handed him over to us, so that we defeated him, his sons and all his people. "},{"num":34,"verse":"At that time we captured all his cities and completely destroyed every city — men, women, little ones — we left none of them. "},{"num":35,"verse":"As booty for ourselves we took only the cattle, along with the spoil from the cities we had captured. "},{"num":36,"verse":"From ‘Aro‘er, on the edge of the Arnon Valley, and from the city in the valley, all the way to Gil‘ad, there was not one city too well fortified for us to capture — Adonai our God gave all of them to us. "},{"num":37,"verse":"The only land you didn’t approach was that of the descendants of ‘Amon — the region around the Yabok River, the cities in the hills and wherever else Adonai our God forbade us to go."}]