[{"header":"Israel Wanders in the Desert"},{"num":2,"verse":"Then we turned ·around [face], and we traveled on the ·desert [wilderness] road toward the ·Red [or Reed] Sea [Ex. 10:19], as the Lord had told me to do. We traveled through the mountains of ·Edom [Seir; 1:44] for many days."},{"num":2,"verse":"Then the Lord said to me, "},{"num":3,"verse":"“You have traveled through these mountains long enough. Turn north "},{"num":4,"verse":"and give the people this command: ‘You will soon go through the land that belongs to your ·relatives [brothers], the ·descendants [sons] of Esau who live in ·Edom [Seir; 1:44]. They will be afraid of you, but be very careful. "},{"num":5,"verse":"Do not go to war against them. I will not give you any of their land—not even a foot of it, because I have given the mountains of ·Edom [Seir; 1:44] to Esau as his own. "},{"num":6,"verse":"You must pay them in silver for any food you eat or water you drink.’”"},{"num":7,"verse":"The Lord your God has blessed everything you have done; he has protected you while you traveled through this ·great desert [vast wilderness]. The Lord your God has been with you for the past forty years, and you have had everything you needed."},{"num":8,"verse":"So we passed by our ·relatives [brothers], the ·descendants [sons] of Esau who lived in ·Edom [Seir; 1:44]. We turned off the ·Jordan Valley [Arabah] road that comes from the towns of Elath and Ezion Geber and traveled along the ·desert [wilderness] road to Moab [Num. 20:14–21]."},{"header":"The Land of Ar"},{"num":9,"verse":"Then the Lord said to me, “Don’t ·bother [harrass] the people of Moab. Don’t go to war against them, because I will not give you any of their land as your own; I have given Ar to the ·descendants [sons] of Lot as their own.” "},{"num":10,"verse":"(The Emites, who lived in ·Ar [it] before, were strong people, and there were many of them. They were very tall, like the Anakites. "},{"num":11,"verse":"The Emites were thought to be ·Rephaites [or Rephaim; 3:11, 13; Gen. 14:5], like the Anakites, but the Moabite people called them Emites. "},{"num":12,"verse":"The Horites also lived in ·Edom [Seir; 1:44] before, but the ·descendants [sons] of Esau forced them out and destroyed them, taking their place as Israel did in the land the Lord gave them as their own.)"},{"num":13,"verse":"And the Lord said to me, “Now get up and cross the Zered ·Valley [Wadi].” So we crossed the ·valley [wadi]. "},{"num":14,"verse":"It had been thirty-eight years from the time we left Kadesh Barnea until we crossed the Zered ·Valley [Wadi]. By then, all the fighting men ·from that time [of that generation] had died, as the Lord had ·promised [sworn] would happen [Num. 14:20–23]. "},{"num":15,"verse":"The [hand of the] Lord ·continued to work [was] against them to remove them from the camp until they were all dead."},{"num":16,"verse":"When the last of those fighting men had died, "},{"num":17,"verse":"the Lord said to me, "},{"num":18,"verse":"“Today you will pass by Ar, on the border of Moab. "},{"num":19,"verse":"When you come near the ·people [sons; descendants] of Ammon, don’t ·bother [harrass] them or go to war against them, because I will not give you any of their land as your own. I have given it to the ·descendants [sons] of Lot for their own.”"},{"num":20,"verse":"(That land was also thought to be a land of the ·Rephaites [or Rephaim; 2:11], because those people used to live there, but the Ammonites called them Zamzummites. "},{"num":21,"verse":"They were strong people, and there were many of them; they were very tall, like the Anakites. The Lord destroyed the Zamzummites, and the Ammonites forced them out of the land and took their place. "},{"num":22,"verse":"The Lord did the same thing for the ·descendants [sons] of Esau, who lived in ·Edom [Seir; 1:44], when he destroyed the Horites. ·The Edomites [They] forced them out of the land and took their place, and they live there to this day. "},{"num":23,"verse":"The ·Cretan people [Caphtorim; better known as Philistines] came from ·Crete [Caphtor] and destroyed the Avvites, who lived in towns all the way to Gaza; the ·Cretans [Caphtorim] destroyed them and took their place.)"},{"header":"Fighting the Amorites"},{"num":24,"verse":"The Lord said, “Get up and cross the Arnon ·Ravine [Wadi]. See, I am ·giving you the power to defeat [putting in your hand] Sihon the Amorite, king of Heshbon, and I am giving you his land [Num. 21:21–32]. So fight against him and begin taking his land. "},{"num":25,"verse":"Today I will begin to make all the people ·in the world [under heaven] afraid of you. When they hear reports about you, they will shake with fear, and they will be terrified of you.”"},{"num":26,"verse":"I sent messengers from the ·desert [wilderness] of Kedemoth to Sihon king of Heshbon. ·They offered him […with words/messages of] peace, saying, "},{"num":27,"verse":"“If you let us pass through your country, · we will stay on the road and [I will] not turn right or left. "},{"num":28,"verse":"We will pay you in silver for any food we eat or water we drink. We only want to walk through your country. "},{"num":29,"verse":"The ·descendants [sons] of Esau in ·Edom [Seir; 1:44] let us go through their land, and so did the Moabites in Ar. We want to cross the Jordan River into the land the Lord our God has given us.” "},{"num":30,"verse":"But Sihon king of Heshbon would not let us pass, because the Lord your God had ·made him stubborn [hardened his spirit and made his heart defiant]. The Lord wanted ·you to defeat Sihon, and now this has happened [to give him into your hand as it is on this day]."},{"num":31,"verse":"The Lord said to me, “See, I have begun to give Sihon and his country to you. Begin taking the land as your own.”"},{"num":32,"verse":"Then Sihon and all his army came out and fought us at Jahaz, "},{"num":33,"verse":"but the Lord our God gave Sihon to us. We ·defeated [struck] him, his sons, and all his army. "},{"num":34,"verse":"We captured all his cities at that time and ·completely destroyed them [devoted them to the Lord; 20:15–20; Josh. 6:17], as well as the men, women, and children. We left no one alive. "},{"num":35,"verse":"But we kept the cattle and ·valuable things [plunder] from the cities for ourselves. "},{"num":36,"verse":"We defeated Aroer on the edge of the Arnon ·Ravine [Wadi], and we defeated the town in the ·ravine [wadi], and even as far as Gilead. No ·town was too strong [or citadel was too high] for us; the Lord our God gave us all of them. "},{"num":37,"verse":"But you did not go near the land of the ·Ammonites [sons/descendants of Ammon], on the shores of the Jabbok ·River [Wadi], or the towns in the mountains, as the Lord our God had commanded."}]