[{"header":"Israel Passes through Edomite Territory"},{"num":2,"verse":"“We turned and set out for the desert on the road to the Reed Sea, just as the Lord had directed me. We traveled around Mount Seir for many days. "},{"num":2,"verse":"Then the Lord told me, "},{"num":3,"verse":"‘You’ve walked around this mountain long enough. Turn northward "},{"num":4,"verse":"and command this people, “You are about to pass through the territory of your relatives, the descendants of Esau who live around Seir. They will be afraid of you so be very careful. "},{"num":5,"verse":"Don’t fight them, because I won’t give you any part of their land, not even the size of a footprint. I have given Mount Seir to Esau as their property. "},{"num":6,"verse":"You may buy food to eat and water to drink from them, paying with cash.”’ "},{"num":7,"verse":"Indeed, the Lord your God blessed all the works of your hands. He knows about your travels through this vast desert. The Lord your God was with you these past 40 years, so that you didn’t lack anything. "},{"num":8,"verse":"So we bypassed our relatives, the descendants of Esau who live in Seir. We turned through the Arabah desert from Elath, and from Ezion-geber we traveled the desert road to Moab.”"},{"header":"Israel Passes through Moabite Territory"},{"num":9,"verse":"“Then the Lord told me, ‘Don’t harass Moab or provoke them to war, because I won’t give you any part of their land. I have given Ar to the descendants of Lot as their property. "},{"num":10,"verse":"(The Emites, a people as powerful, numerous, and tall as the Anakim, lived there before. "},{"num":11,"verse":"Like the Anakim, they were thought of as Rephaim, but the Moabites called them Emites. "},{"num":12,"verse":"The Horites used to live in Seir before the descendants of Esau dispossessed them, exterminated them, and settled there instead, just as Israel will do in the land of its possession, which the Lord gave them.) "},{"num":13,"verse":"Now get going and cross the Wadi Zered.’ And so we crossed the Wadi Zered. "},{"num":14,"verse":"Now from the time we left Kadesh-barnea until we crossed the Wadi Zered was 38 years. All of that generation, the soldiers in the camp, were destroyed just as the Lord swore they would be. "},{"num":15,"verse":"Indeed, the hand of the Lord was against them to root them out from the camp until they were utterly destroyed.”"},{"header":"Israel Passes through Ammonite Territory"},{"num":16,"verse":"“And so all the soldiers among the people died. "},{"num":17,"verse":"Then the Lord spoke to me, "},{"num":18,"verse":"‘Today, you are about to cross the border of Moab at Ar. "},{"num":19,"verse":"When you come to the Ammonites, don’t harass or provoke them to war, for I won’t give any part of Ammonite land to you, since I have given it to the descendants of Lot as their property."},{"num":20,"verse":"“‘(Indeed, it was considered Rephaim territory, since the Rephaim used to lived there. The Ammonites called them Zamzummites, "},{"num":21,"verse":"a great people, numerous, and tall as the Anakim. But the Lord destroyed the Rephaim, so that the Ammonites dispossessed them and settled there instead. "},{"num":22,"verse":"This is what he did for the descendants of Esau who live in Seir, when he destroyed the Horites before them. So they dispossessed them and settled there in their place, where they live to this day. "},{"num":23,"verse":"It was the same for the Avvites who lived in villages as far as Gaza. The Caphtorites, who came from Crete, destroyed them and settled there in their place.) "},{"num":24,"verse":"Get ready and set out for the Wadi Arnon. Look! I’ve given into your control Sihon the Amorite, king of Heshbon, along with his land. Prepare to take possession by provoking him to war. "},{"num":25,"verse":"Starting today I will begin to instill fear and terror of you on the part of every nation under heaven who hears reports about you. They’ll tremble in anguish before you.’”"},{"header":"Israel Defeats Sihon, King of Heshbon"},{"num":26,"verse":"“I sent messengers from the desert of Kedemoth to King Sihon of Heshbon with this message of peace: "},{"num":27,"verse":"‘Let me pass through your territory. I’ll stay on the main road. I won’t turn to the right or left. "},{"num":28,"verse":"Sell me food for cash, so I can eat and give me water for cash, so I can drink. Just let me pass through on foot, "},{"num":29,"verse":"as the descendants of Esau who live in Seir did for me, as did the Moabites who live in Ar. I’ll pass through, until I will have crossed the Jordan into the land that the Lord our God is about to give us.’ "},{"num":30,"verse":"But King Sihon of Heshbon did not allow us to pass through, because the Lord your God had hardened his spirit and made him arrogant, in order to deliver him into your control today."},{"num":31,"verse":"“Then the Lord told me, ‘See, I’ve begun to deliver Sihon and his territory over to you. Prepare to take possession of his land.’"},{"num":32,"verse":"“Sihon came out to meet us, including his entire army, at the battle of Jahaz. "},{"num":33,"verse":"The Lord our God delivered him to us, so we attacked him, his son, and his whole army. "},{"num":34,"verse":"We captured all his towns at that time. We utterly destroyed every town—the men, the women, and the children—leaving no survivors. "},{"num":35,"verse":"We only appropriated the livestock for our use, along with plunder from the cities that we captured. "},{"num":36,"verse":"From Aroer on the edge of Arnon Valley and from the town all the way to Gilead, there was no city that was too strong for us—the Lord our God delivered them all to us. "},{"num":37,"verse":"You did not encroach onto Ammonite land, the banks of the Wadi Jabbok, the towns in the hill country, and all the other places that were forbidden by the Lord our God.”"}]