[{"header":"The Desert Years"},{"num":2,"verse":"“Then we turned, and journeyed into the wilderness in the direction of the Red Sea, as the Lord told me; and for many days we went about Mount Se′ir. "},{"num":2,"verse":"Then the Lord said to me, "},{"num":3,"verse":"‘You have been going about this mountain country long enough; turn northward. "},{"num":4,"verse":"And command the people, You are about to pass through the territory of your brethren the sons of Esau, who live in Se′ir; and they will be afraid of you. So take good heed; "},{"num":5,"verse":"do not contend with them; for I will not give you any of their land, no, not so much as for the sole of the foot to tread on, because I have given Mount Se′ir to Esau as a possession. "},{"num":6,"verse":"You shall purchase food from them for money, that you may eat; and you shall also buy water of them for money, that you may drink. "},{"num":7,"verse":"For the Lord your God has blessed you in all the work of your hands; he knows your going through this great wilderness; these forty years the Lord your God has been with you; you have lacked nothing.’ "},{"num":8,"verse":"So we went on, away from our brethren the sons of Esau who live in Se′ir, away from the Arabah road from Elath and E′zion-ge′ber."},{"num":9,"verse":"And the Lord said to me, ‘Do not harass Moab or contend with them in battle, for I will not give you any of their land for a possession, because I have given Ar to the sons of Lot for a possession.’ "},{"num":10,"verse":"(The Emim formerly lived there, a people great and many, and tall as the Anakim; "},{"num":11,"verse":"like the Anakim they are also known as Reph′aim, but the Moabites call them Emim. "},{"num":12,"verse":"The Horites also lived in Se′ir formerly, but the sons of Esau dispossessed them, and destroyed them from before them, and settled in their stead; as Israel did to the land of their possession, which the Lord gave to them.) "},{"num":13,"verse":"‘Now rise up, and go over the brook Zered.’ So we went over the brook Zered. "},{"num":14,"verse":"And the time from our leaving Ka′desh-bar′nea until we crossed the brook Zered was thirty-eight years, until the entire generation, that is, the men of war, had perished from the camp, as the Lord had sworn to them. "},{"num":15,"verse":"For indeed the hand of the Lord was against them, to destroy them from the camp, until they had perished."},{"num":16,"verse":"“So when all the men of war had perished and were dead from among the people, "},{"num":17,"verse":"the Lord said to me, "},{"num":18,"verse":"‘This day you are to pass over the boundary of Moab at Ar; "},{"num":19,"verse":"and when you approach the frontier of the sons of Ammon, do not harass them or contend with them, for I will not give you any of the land of the sons of Ammon as a possession, because I have given it to the sons of Lot for a possession.’ "},{"num":20,"verse":"(That also is known as a land of Reph′aim; Reph′aim formerly lived there, but the Ammonites call them Zamzum′mim, "},{"num":21,"verse":"a people great and many, and tall as the Anakim; but the Lord destroyed them before them; and they dispossessed them, and settled in their stead; "},{"num":22,"verse":"as he did for the sons of Esau, who live in Se′ir, when he destroyed the Horites before them, and they dispossessed them, and settled in their stead even to this day. "},{"num":23,"verse":"As for the Avvim, who lived in villages as far as Gaza, the Caph′torim, who came from Caphtor, destroyed them and settled in their stead.) "},{"num":24,"verse":"‘Rise up, take your journey, and go over the valley of the Arnon; behold, I have given into your hand Sihon the Amorite, king of Heshbon, and his land; begin to take possession, and contend with him in battle. "},{"num":25,"verse":"This day I will begin to put the dread and fear of you upon the peoples that are under the whole heaven, who shall hear the report of you and shall tremble and be in anguish because of you.’"},{"header":"Defeat of King Sihon"},{"num":26,"verse":"“So I sent messengers from the wilderness of Ked′emoth to Sihon the king of Heshbon, with words of peace, saying, "},{"num":27,"verse":"‘Let me pass through your land; I will go only by the road, I will turn aside neither to the right nor to the left. "},{"num":28,"verse":"You shall sell me food for money, that I may eat, and give me water for money, that I may drink; only let me pass through on foot, "},{"num":29,"verse":"as the sons of Esau who live in Se′ir and the Moabites who live in Ar did for me, until I go over the Jordan into the land which the Lord our God gives to us.’ "},{"num":30,"verse":"But Sihon the king of Heshbon would not let us pass by him; for the Lord your God hardened his spirit and made his heart obstinate, that he might give him into your hand, as at this day. "},{"num":31,"verse":"And the Lord said to me, ‘Behold, I have begun to give Sihon and his land over to you; begin to take possession, that you may occupy his land.’ "},{"num":32,"verse":"Then Sihon came out against us, he and all his people, to battle at Jahaz. "},{"num":33,"verse":"And the Lord our God gave him over to us; and we defeated him and his sons and all his people. "},{"num":34,"verse":"And we captured all his cities at that time and utterly destroyed every city, men, women, and children; we left none remaining; "},{"num":35,"verse":"only the cattle we took as spoil for ourselves, with the booty of the cities which we captured. "},{"num":36,"verse":"From Aro′er, which is on the edge of the valley of the Arnon, and from the city that is in the valley, as far as Gilead, there was not a city too high for us; the Lord our God gave all into our hands. "},{"num":37,"verse":"Only to the land of the sons of Ammon you did not draw near, that is, to all the banks of the river Jabbok and the cities of the hill country, and wherever the Lord our God forbade us."}]