[{"num":2,"verse":"“Then we turned back across the wilderness toward the Red Sea, for so the Lord had instructed me. For many years we wandered around in the area of Mount Seir. "},{"num":2,"verse":"Then at last the Lord said, "},{"num":3,"verse":"‘You have stayed here long enough. Turn northward. "},{"num":4,"verse":"Inform the people that they will be passing through the country belonging to their brothers the Edomites, the descendants of Esau who live in Seir; the Edomites will be nervous, so be careful. "},{"num":5,"verse":"Don’t start a fight! For I have given them all the Mount Seir hill country as their permanent possession, and I will not give you even a tiny piece of their land. "},{"num":6,"verse":"Pay them for whatever food or water you use. "},{"num":7,"verse":"The Lord your God has watched over you and blessed you every step of the way for all these forty years as you have wandered around in this great wilderness; and you have lacked nothing in all that time.’"},{"num":8,"verse":"“So we passed through Edom where our brothers lived, crossing the Arabah Road that goes south to Elath and Ezion-geber, and traveling northward toward the wilderness of Moab."},{"num":9,"verse":"“Then the Lord warned us, ‘Don’t attack the Moabites either, for I will not give you any of their land; I have given it to the descendants of Lot.’"},{"num":10,"verse":"“(The Emim used to live in that area, a very large tribe, tall as the giants of Anakim; "},{"num":11,"verse":"both the Emim and the Anakim are often referred to as the Rephaim, but the Moabites call them Emim. "},{"num":12,"verse":"In earlier days the Horites lived in Seir, but they were driven out and displaced by the Edomites, the descendants of Esau, just as Israel would displace the peoples of Canaan, whose land had been assigned to Israel by the Lord.)"},{"num":13,"verse":"“‘Now cross Zered Brook,’ the Lord said; and we did."},{"num":14,"verse":"“So it took us thirty-eight years to finally get across Zered Brook from Kadesh! For the Lord had decreed that this could not happen until all the men, who thirty-eight years earlier were old enough to bear arms, had died. Yes, the hand of the Lord was against them until finally all were dead."},{"num":16,"verse":"“Then at last the Lord said to me, "},{"num":18,"verse":"‘Today Israel shall cross the borders of Moab at Ar, "},{"num":19,"verse":"into the land of the Ammonites. But do not attack them, for I will not give you any of their land. I have given it to the descendants of Lot.’"},{"num":20,"verse":"“(That area, too, used to be inhabited by the Rephaim, called ‘Zamzummim’ by the Ammonites. "},{"num":21,"verse":"They were a large and powerful tribe, as tall as the Anakim; but Jehovah destroyed them as the Ammonites came in, and the Ammonites lived there in their place. "},{"num":22,"verse":"The Lord had similarly helped the descendants of Esau at Mount Seir, for he destroyed the Horites who were living there before them. "},{"num":23,"verse":"Another similar situation occurred when the people of Caphtor invaded and destroyed the tribe of Avvim living in villages scattered across the countryside as far away as Gaza.)"},{"num":24,"verse":"“Then the Lord said, ‘Cross the Arnon River into the land of King Sihon the Amorite, king of Heshbon. War against him and begin to take possession of his land. "},{"num":25,"verse":"Beginning today I will make people throughout the whole earth tremble with fear because of you, and dread your arrival.’"},{"num":26,"verse":"“Then from the wilderness of Kedemoth I sent ambassadors to King Sihon of Heshbon with a proposal of peace. "},{"num":27,"verse":"‘Let us pass through your land,’ we said. ‘We will stay on the main road and won’t turn off into the fields on either side. "},{"num":28,"verse":"We will not steal food as we go, but will purchase every bite we eat and everything we drink; all we want is permission to pass through. "},{"num":29,"verse":"The Edomites at Seir allowed us to go through their country, and so did the Moabites, whose capital is at Ar. We are on our way across the Jordan into the land the Lord our God has given us.’"},{"num":30,"verse":"“But King Sihon refused because Jehovah your God made him obstinate, so that he could destroy Sihon by the hands of Israel, as has now been done."},{"num":31,"verse":"“Then the Lord said to me, ‘I have begun to give you the land of King Sihon; when you possess it, it shall belong to Israel forever.’"},{"num":32,"verse":"“King Sihon then declared war on us and mobilized his forces at Jahaz. "},{"num":33,"verse":"But the Lord our God crushed him, and we conquered all his cities and utterly destroyed everything, including the women and babies. We left nothing alive "},{"num":35,"verse":"except the cattle, which we took as our reward, along with the booty gained from ransacking the cities we had taken. We conquered everything from Aroer to Gilead—from the edge of the Arnon River Valley, and including all the cities in the valley. Not one city was too strong for us, for the Lord our God gave all of them to us. "},{"num":37,"verse":"However, we stayed away from the people of Ammon and from the Jabbok River and the hill country cities, the places Jehovah our God had forbidden us to enter."}]