[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "VI.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) In the year that king Uzziah died.—Probably before his death. Had it been after it, the first year of king Jotham would have been the more natural formula. The chapter gives us the narrative of the solemn call of Isaiah to the office of a prophet. It does not follow that it was written at that time, and we may even believe that, if the prophet were the editor of his own discourses, he may have designedly placed the narrative in this position that men might see what he himself saw, that all that was found in the preceding chapters was but the development of what he had then heard, and yet, at the same time, a representation of the evils which made the judgments he was commissioned to declare necessary. On the relation of the call to the prophet’s previous life, see Introduction.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "In the year that king Uzziah died.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Probably before his death. Had it been after it, the first year of king Jotham would have been the more natural formula. The chapter gives us the narrative of the solemn call of Isaiah to the office of a prophet. It does not follow that it was written at that time, and we may even believe that, if the prophet were the editor of his own discourses, he may have designedly placed the narrative in this position that men might see what he himself saw, that all that was found in the preceding chapters was but the development of what he had then heard, and yet, at the same time, a representation of the evils which made the judgments he was commissioned to declare necessary. On the relation of the call to the prophet’s previous life, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Introduction.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The date is obviously given as important, and we are led to connect it with the crisis in the prophet’s life of which it tells. He had lived through the last twenty years or so of Uzziah’s reign. There was the show of outward material prosperity. There was the reality of much inward corruption. The king who had profaned the holiness of the Temple had either just died or was dragging out the dregs of his leprous life in seclusion (2Chronicles 26:21). The question, What was to be the future of his people? must have been much in the prophet’s thoughts. The earthquake that had terrified Jerusalem had left on his mind a vague sense of impending judgment. It is significant that Isaiah’s first work as a writer was to write the history of Uzziah’s reign (2Chronicles 26:22). (See Introduction.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The date is obviously given as important, and we are led to connect it with the crisis in the prophet’s life of which it tells. He had lived through the last twenty years or so of Uzziah’s reign. There was the show of outward material prosperity. There was the reality of much inward corruption. The king who had profaned the holiness of the Temple had either just died or was dragging out the dregs of his leprous life in seclusion (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 26:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The question, What was to be the future of his people? must have been much in the prophet’s thoughts. The earthquake that had terrified Jerusalem had left on his mind a vague sense of impending judgment. It is significant that Isaiah’s first work as a writer was to write the history of Uzziah’s reign (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 26:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Introduction.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I saw also the Lord sitting upon a throne.—Isaiah had found himself in ‘the court of the Temple, probably in that of the priests. He had seen the incense-clouds rising from the censer of the priest, and had heard the hymns and hallelujahs of the Levites. Suddenly he passes, as St. Paul afterwards passed, under the influence of like surroundings (Acts 22:17), into a state of ecstatic trance, and as though the veil of the Temple was withdrawn, he saw the vision of the glory of the Lord, as Moses (Exodus 24:10) and Micaiah of old had seen it (1Kings 22:19), as in more recent times it had appeared to Amos (9:1). The King of kings was seated on His throne, and on the right hand and on the left were the angel-armies of the host of heaven, chanting their hymns of praise.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "I saw also the Lord sitting upon a throne.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Isaiah had found himself in ‘the court of the Temple, probably in that of the priests. He had seen the incense-clouds rising from the censer of the priest, and had heard the hymns and hallelujahs of the Levites. Suddenly he passes, as St. Paul afterwards passed, under the influence of like surroundings (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 22:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), into a state of ecstatic trance, and as though the veil of the Temple was withdrawn, he saw the vision of the glory of the Lord, as Moses (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 24:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and Micaiah of old had seen it (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Kings 22:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as in more recent times it had appeared to Amos (9:1). The King of kings was seated on His throne, and on the right hand and on the left were the angel-armies of the host of heaven, chanting their hymns of praise.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "His train filled the temple.—The word for “temple” is that which expresses its character as the palace of the great King. (Comp. Psalm 11:4; Psalm 29:9; Habakkuk 2:20.) The “train” answers to the skirts of the glory of the Lord, who clothes Himself with light as with a garment (Exodus 33:22-23). It is noticeable (1) that the versions (LXX., Targum, Vulg.) suppress the train, apparently as being too anthropomorphic, and (2) that to the mind of St. John this was a vision of the glory of the Christ (John 12:41).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "His train filled the temple.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The word for “temple” is that which expresses its character as the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "palace ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the great King. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 29:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The “train” answers to the skirts of the glory of the Lord, who clothes Himself with light as with a garment (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:22-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is noticeable (1) that the versions (LXX., Targum, Vulg.) suppress the train, apparently as being too anthropomorphic, and (2) that to the mind of St. John this was a vision of the glory of the Christ (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "VISION AND SERVICE",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE EMPTY THRONE FILLEDIsaiah 6:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE EMPTY THRONE FILLED",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Uzziah had reigned for fifty-two years, during the greater part of which he and his people had been brilliantly prosperous. Victorious in war, he was also successful in the arts of peaceful industry. The later years of his life were clouded, but on the whole the reign had been a time of great well-being. His son and successor was a young man of five-and-twenty; and when he came to the throne ominous war-clouds were gathering in the North, and threatening to drift to Judah. No wonder that the prophet, like other thoughtful patriots, was asking himself what was to come in these anxious days, when the helm was in new hands, which, perhaps, were not strong enough to hold it. Like a wise man, he took his thoughts into the sanctuary; and there he understood. As he brooded, this great vision was disclosed to his inward eye. ‘In the year that King Uzziah died’ is a great deal more than a date for chronological purposes. It tells us not only the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "why",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of the vision. The earthly king was laid in the grave; but the prophet saw that the true King of Israel was neither the dead Uzziah nor the young Jotham, but the Lord of hosts. And, seeing that, fears and forebodings and anxieties and the sense of loss, all vanished; and new strength came to Isaiah. He went into the temple laden with anxious thoughts; he came out of it with a springy step and a lightened heart, and the resolve ‘Here am I; send me.’ There are some lessons that seem to me of great importance for the conduct of our daily life which may be gathered from this remarkable vision, with the remarkable note of time that is appended to it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, before I pass on, let me remind you, in a word, of that apparently audacious commentary upon this great vision, which the Evangelist John gives us: ‘These things said Esaias, when he had beheld ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " glory and spake of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ Then the Christ is the manifest Jehovah; is the King of Glory. Then the vision which was but a transitory revelation is the revelation of an eternal reality, and ‘the vision splendid’ does not ‘fade but brightens, into the light of common day’; when instead of being flashed only on the inward eye of a prophet, it is made flesh and walks amongst us, and lives our life, and dies our death. Our eyes have seen the King in as true a reality, and in better fashion, than ever Isaiah did amid the sanctities of the Temple. And the eyes that have seen only the near foreground, the cultivated valleys, and the homes of men, are raised, and lo! the long line of glittering peaks, calm, silent, pure. Who will look at the valleys when the Himalayas stand out, and the veil is drawn aside?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Let me say a word or two about the ministration of loss and sorrow in preparing for the vision. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Let me say a word or two about the ministration of loss and sorrow in preparing for the vision.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It was when ‘King Uzziah died’ that the prophet ‘saw the Lord sitting upon the throne.’ If the Throne of Israel had not been empty, he would not have seen the throned God in the heavens. And so it is with all our losses, with all our sorrows, with all our disappointments, with all our pains; they have a mission to reveal to us the throned God. The possession of the things that are taken away from us, the joys which our sorrows smite into dust, have the same mission, and the highest purpose of every good, of every blessing, of every possession, of every gladness, of all love-the highest mission is to lead us to Him. But, just as men will frost a window, so that the light may come in but the sight cannot go out, so by our own fault and misuse of the good things which are meant to lead us up to, and to show us, God, we frost and darken the window so that we cannot see what it is meant to show us. And then a mighty and merciful hand shivers the painted glass into fragments, because it has been dimming ‘the white radiance of Eternity.’ And though the casement may look gaunt, and the edges of the broken glass may cut and wound, yet the view is unimpeded. When the gifts that we have misused are withdrawn, we can see the heaven that they too often hide from us. When the leaves drop there is a wider prospect. When the great tree is fallen there is opened a view of the blue above. When the night falls the stars sparkle. When other props are struck away we can lean our whole weight upon God. When Uzziah dies the King becomes visible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Is that what our sorrows, our pains, losses, disappointments do for us? Well for those to whom loss is gain, because it puts them in possession of the enduring riches! Well for those to whom the passing of all that can pass is a means of revealing Him who ‘is the same yesterday, and to-day, and for ever’! The message to us of all these our pains and griefs is ‘Come up hither.’ In them all our Father is saying to us, ‘Seek ye My face.’ Well for those who answer, ‘Thy face, Lord, will I seek. Hide not Thy face far from me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us take care that we do not waste our griefs and sorrows. They absorb us sometimes with vain regrets. They jaundice and embitter us sometimes with rebellious thoughts. They often break the springs of activity and of interest in others, and of sympathy with others. But their true intention is to draw back the thin curtain, and to show us ‘the things that are,’ the realities of the throned God, the skirts that fill the Temple, the hovering seraphim, and the coal from the altar that purges.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Let me suggest how our text shows us the compensation that is given for all losses. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Let me suggest how our text shows us the compensation that is given for all losses.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As I have pointed out already, the thought conveyed to the prophet by this vision was not only the general one, of God’s sovereign rule, but the special one of His rule over and for, and His protection of, the orphan kingdom which had lost its king. The vision took the special shape that the moment required. It was because the earthly king was dead that the living, heavenly King was revealed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So there is just suggested by it this general thought, that the consciousness of God’s presence and work for us takes in each heart the precise shape that its momentary necessities and circumstances require. That infinite fulness is of such a nature as that it will assume any form for which the weakness and the need of the dependent creature call. Like the one force which scientists now are beginning to think underlies all the various manifestations of energy in nature, whether they be named light, heat, motion, electricity, chemical action, or gravitation, the one same vision of the throned God, manifest in Jesus Christ, is protean. Here it flames as light, there burns as heat, there flashes as electricity; here as gravitation holds the atoms together, there as chemical energy separated and decomposes them; here results in motion, there in rest; but is the one force. And so the one God will become everything and anything that every man, and each man, requires. He shapes himself according to our need. The water of life does not disdain to take the form imposed upon it by the vessel into which it is poured. The Jews used to say that the manna in the wilderness tasted to each man as each man desired. And the God, who comes to us all, comes to us each in the shape that we need; just as He came to Isaiah in the manifestation of His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "kingly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " power, because the throne of Judah was vacated.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So when our hearts are sore with loss, the New Testament Manifestation of the King, even Jesus Christ, comes to us and says, ‘The same is my mother and sister and brother,’ and His sweet love compensates for the love that can die, and that has died. When losses come to us He draws near, as durable riches and righteousness. In all our pains He is our anodyne, and in all our griefs He brings the comfort; He is all in all, and each withdrawn gift is compensated, or will be compensated, to each in Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, dear friends, let us learn God’s purpose in emptying hearts and chairs and homes. He empties them that He may fill them with Himself. He takes us, if I might so say, into the darkness, as travellers to the south are to-day passing through Alpine tunnels, in order that He may bring us out into the land where ‘God Himself is sun and moon,’ and where there are ampler ether and brighter constellations than in these lands where we dwell. He means that, when Uzziah dies, our hearts shall see the King. And for all mourners, for all tortured hearts, for all from whom stays have been stricken and resources withdrawn, the old word is true: ‘Lord shew us the Father, and it sufficeth us.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me recall to you what I have already insisted on more than once, that the perfecting of this vision is in the historical fact of the Incarnate Son. Jesus Christ shows us God. Jesus Christ is the King of Glory. If we will go to Him, and fix our eyes and hearts on Him, then losses may come, and we shall be none the poorer; death may unclasp our hands from dear hands, but He will close a dearer one round the hand that is groping for a stay; and nothing can betaken away but He will more than fill the gap it leaves by His own sweet presence. If our eyes behold the King, if we are like John the Seer in his rocky Patmos, and see the Christ in His glory and royalty, then He will lay His hands on us and say, ‘Fear not! Weep not; I am the First and the Last,’ and forebodings, and fears, and sense of loss will all be changed into trustfulness and patient submission. ‘Seeing Him, who is invisible,’ we shall be able to endure and to toil, until the time when the vision of earth is perfected by the beholding of heaven. Blessed are they who with purged eyes see, and with yielding hearts obey, the heavenly vision, and turn to the King and offer themselves for any service He may require, saying, ‘Here am I; send me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 6:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the year that King Uzziah died, I saw the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— “As this vision,” says Bishop Lowth, “seems to contain a solemn designation of Isaiah to the prophetical office, it is by most interpreters thought to be the first in order of his prophecies. But this perhaps may not be so: for Isaiah is said, in the general title of his prophecies, to have prophesied in the time of Uzziah, whose acts, first and last, he wrote, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 26:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and the phrase, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the year when Uzziah died, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "probably means, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after the death of Uzziah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the same phrase, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) means, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after the death of Ahaz. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not that Isaiah’s prophecies are placed in exact order of time: chapters 2., 3., 4., 5. seem, by internal marks, to be antecedent to chapter 1.; they suit the time of Uzziah, or the former part of Jotham’s reign: whereas, chapter 1. can hardly be earlier than the last years of Jotham: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This might be a new designation of the whole course of God’s dispensations in regard to his people, and the fates of the nation; which are even now still depending, and will not be fully accomplished till the final restoration of Israel.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I saw the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In a vision or ecstasy. The place of this vision is supposed to be the temple, from which the particular scenery of it is taken. The Divine Majesty is represented as seated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon a throne, high and lifted up ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Probably above the ark in the most holy place, where the glory appeared above the cherubim, surrounded by his attendant ministers. “The veil, separating the most holy place from the holy, or the outermost part of the temple, is supposed to be taken away, for the prophet, to whom the whole is exhibited, is manifestly placed by the altar of burnt-offering, at the entrance of the temple, (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 43:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) which was filled with the train of the robe, the spreading and overflowing of the divine glory. The Lord upon the throne, according to St. John, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) was Christ, and the vision related to his future kingdom; when the veil of separation was to be removed, and the whole earth was to be filled with the glory of God, revealed to all mankind. It respects, indeed, primarily the prophet’s own time, and the obduration of the Jews of that age, and their punishment by the Babylonish captivity; but extends, in its full latitude, to the age of the Messiah, and the blindness of the Jews to the gospel; the desolation of their country by the Romans, and their being rejected by God; that, nevertheless, a holy seed, a remnant, should be preserved, and that the nation should sprout out and flourish again from the old stock. — Bishop Lowth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-8 In this figurative vision, the temple is thrown open to view, even to the most holy place. The prophet, standing outside the temple, sees the Divine Presence seated on the mercy-seat, raised over the ark of the covenant, between the cherubim and seraphim, and the Divine glory filled the whole temple. See God upon his throne. This vision is explained, Joh 12:41, that Isaiah now saw Christ's glory, and spake of Him, which is a full proof that our Saviour is God. In Christ Jesus, God is seated on a throne of grace; and through him the way into the holiest is laid open. See God's temple, his church on earth, filled with his glory. His train, the skirts of his robes, filled the temple, the whole world, for it is all God's temple. And yet he dwells in every contrite heart. See the blessed attendants by whom his government is served. Above the throne stood the holy angels, called seraphim, which means burners; they burn in love to God, and zeal for his glory against sin. The seraphim showing their faces veiled, declares that they are ready to yield obedience to all God's commands, though they do not understand the secret reasons of his counsels, government, or promises. All vain-glory, ambition, ignorance, and pride, would be done away by one view of Christ in his glory. This awful vision of the Divine Majesty overwhelmed the prophet with a sense of his own vileness. We are undone if there is not a Mediator between us and this holy God. A glimpse of heavenly glory is enough to convince us that all our righteousnesses are as filthy rags. Nor is there a man that would dare to speak to the Lord, if he saw the justice, holiness, and majesty of God, without discerning his glorious mercy and grace in Jesus Christ. The live coal may denote the assurance given to the prophet, of pardon, and acceptance in his work, through the atonement of Christ. Nothing is powerful to cleanse and comfort the soul, but what is taken from Christ's satisfaction and intercession. The taking away sin is necessary to our speaking with confidence and comfort, either to God in prayer, or from God in preaching; and those shall have their sin taken away who complain of it as a burden, and see themselves in danger of being undone by it. It is great comfort to those whom God sends, that they go for God, and may therefore speak in his name, assured that he will bear them out.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the year - This naturally denotes a period after the death of Uzziah, though in the same year. The mention of the time was evidently made when the prophecy was composed, and it is to be presumed that the death of Uzziah had occurred at the time when the prophet saw this vision. If so, it is clear that this was not the first of his prophecies, for he saw his visions 'in the days of Uzziah;' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Chaldee, however, reads this: 'in the year when Uzziah was smitten with the leprosy;' and most of the Jewish commentators so understand it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 26:19-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The rabbis say that the meaning is, that he then became \"civilly\" dead, by ceasing to exercise his functions as a king, and that he was cut off as a leprous man from all connection with the people, and from all authority; see the Introduction, Section 3. This is, doubtless, true; but still, the more natural signification is, that this occurred in the year in which he actually died.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I saw - That is, he saw in a \"vision;\" see the Introduction, Section 7. (4). A similar vision is described by Micaiah; 1 Kings 22:19; see also Amos 7:1; Amos 8:1; Amos 9:1; Daniel 7:13, ...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I saw - That is, he saw in a \"vision;\" see the Introduction, Section 7. (4). A similar vision is described by Micaiah; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 9:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ...",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord - In the original here the word is not יהוה yehovâh but אדני  'ădonāy; see the notes at Isaiah 1:24. Here it is applied to Yahweh; see also Psalm 114:7, where it is also so applied; and see Isaiah 8:7, and Job 28:28, where Yahweh calls himself \"Adonai.\" The word does not itself denote essential divinity; but it is often applied to God. In some MSS., however, of Kennicott and DeRossi, the word Yahweh is found. We may make two remarks here.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord - In the original here the word is not יהוה yehovâh but אדני  'ădonāy; see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here it is applied to Yahweh; see also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 114:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is also so applied; and see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 28:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where Yahweh calls himself \"Adonai.\" The word does not itself denote essential divinity; but it is often applied to God. In some MSS., however, of Kennicott and DeRossi, the word Yahweh is found. We may make two remarks here.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That Isaiah evidently meant to say that it was Yahweh who appeared to him. He is expressly so called in Isaiah 6:5-8, Isaiah 6:11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) That Isaiah evidently meant to say that it was Yahweh who appeared to him. He is expressly so called in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:5-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) It is equally clear, from the New Testament, that Isaiah saw the messiah. John quotes the words in this chapter, Isaiah 6:10, as applicable to Jesus Christ, and then adds John 12:41, 'these things said Esaias when he saw his glory, and spake of him.'",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) It is equally clear, from the New Testament, that Isaiah saw the messiah. John quotes the words in this chapter, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as applicable to Jesus Christ, and then adds ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 'these things said Esaias when he saw his glory, and spake of him.'",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "An inspired man has thus settled this as referring to the Messiah, and thus had established the propriety of applying to him the name Yahweh, that is, has affirmed that the Lord Jesus is divine. Jerome says, that this vision was designed to represent the doctrine of the Trinity. In John 1:18, it is said, 'No man hath seen God at any time; the only begotten Son, who is in the bosom of the Father, he hath declared him.' In Exodus 33:20, God says, 'Thou canst not see my face, for there shall no man see me and live;' see also 1 Timothy 6:16. These passages may be reconciled with what is here said by Isaiah, in the following manner:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "An inspired man has thus settled this as referring to the Messiah, and thus had established the propriety of applying to him the name Yahweh, that is, has affirmed that the Lord Jesus is divine. Jerome says, that this vision was designed to represent the doctrine of the Trinity. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is said, 'No man hath seen God at any time; the only begotten Son, who is in the bosom of the Father, he hath declared him.' In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", God says, 'Thou canst not see my face, for there shall no man see me and live;' see also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 6:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". These passages may be reconciled with what is here said by Isaiah, in the following manner:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Isaiah does not say that he saw the Divine Essence; and all that his words fairly imply, is, that he saw a manifestation, or vision of Yahweh - some striking symbolic representation of him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) It was the manifestation of Yahweh in the person of the Messiah, of the 'only begotten Son who hath revealed or declared him,' that he saw Such manifestations of God have been made often, and all that the declaration of Isaiah implies, of necessity, is, that he had a vision of God incarnate seated in glory, from whom he now received a new commission to go out and proclaim the truth to that wicked and rebellious generation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sitting upon a throne - God is thus often represented as a king, sitting on a throne; 1 Kings 22:19; Ezekiel 43:7; Jeremiah 17:12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Sitting upon a throne - God is thus often represented as a king, sitting on a throne; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 43:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 17:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "High and lifted up - That is, the \"throne;\" an indication of state and majesty. \"And his train.\" The word \"train\" שׁוּליו  shûlāyv, properly signifies the skirt of a garment, or a robe; Exodus 28:33-34. Here it is evidently designed as a representation of a large, flowing robe, that filled all the most holy part of the temple. The Orientals regarded such large robes as indicative of grandeur and state. The Messiah was seen seated on a throne as a king; clothed in a large, loose, flowing robe, in the manner of oriental monarchs, and surrounded by his ministers. The design of this magnificent vision was not only to impress the prophet with a sense of the holiness of God, but also to give additional weight to his commission, as having been derived immediately from the divine majesty; compare Isaiah 6:9-10. It is remarkable that Isaiah attempts no representation of Yahweh himself. He mentions his robes; the throne; the seraphim; but mentions no form or appearance of God himself. In this there is great sublimity. There is enough mentioned to fill the mind with awe; there is enough concealed to impress as deeply with a sense of the divine majesty. It is remarkable, also, that it is not the \"usual\" appearance of God in the temple to which he refers. That was the \"Shekinah,\" or visible symbol of God. That was on the mercy-seat, this was on a throne; that was a cloud, of this no form is mentioned; over that the cherubim stretched forth their wings, over this stood the seraphim; that had no clothing, this was clad in a full flowing robe.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "High and lifted up - That is, the \"throne;\" an indication of state and majesty. \"And his train.\" The word \"train\" שׁוּליו  shûlāyv, properly signifies the skirt of a garment, or a robe; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:33-34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here it is evidently designed as a representation of a large, flowing robe, that filled all the most holy part of the temple. The Orientals regarded such large robes as indicative of grandeur and state. The Messiah was seen seated on a throne as a king; clothed in a large, loose, flowing robe, in the manner of oriental monarchs, and surrounded by his ministers. The design of this magnificent vision was not only to impress the prophet with a sense of the holiness of God, but also to give additional weight to his commission, as having been derived immediately from the divine majesty; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is remarkable that Isaiah attempts no representation of Yahweh himself. He mentions his robes; the throne; the seraphim; but mentions no form or appearance of God himself. In this there is great sublimity. There is enough mentioned to fill the mind with awe; there is enough concealed to impress as deeply with a sense of the divine majesty. It is remarkable, also, that it is not the \"usual\" appearance of God in the temple to which he refers. That was the \"Shekinah,\" or visible symbol of God. That was on the mercy-seat, this was on a throne; that was a cloud, of this no form is mentioned; over that the cherubim stretched forth their wings, over this stood the seraphim; that had no clothing, this was clad in a full flowing robe.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Filled the temple - Probably, the most holy place only is intended. The large, full, magnificent robe seemed to fill up the entire holy of holies. Some have supposed that this vision was represented as appearing in the \"heavens.\" But the expression here evidently implies, that it was seen in the \"temple\" at Jerusalem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Filled the temple - Probably, the most holy place only is intended. The large, full, magnificent robe seemed to fill up the entire holy of holies. Some have supposed that this vision was represented as appearing in the \"heavens.\" But the expression here evidently implies, that it was seen in the \"temple\" at Jerusalem. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 6",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isa 6:1-13. Vision of Jehovah in His Temple.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isaiah is outside, near the altar in front of the temple. The doors are supposed to open, and the veil hiding the Holy of Holies to be withdrawn, unfolding to his view a vision of God represented as an Eastern monarch, attended by seraphim as His ministers of state (1Ki 22:19), and with a robe and flowing train (a badge of dignity in the East), which filled the temple. This assertion that he had seen God was, according to tradition (not sanctioned by Isa 1:1; see [692]Introduction), the pretext for sawing him asunder in Manasseh's reign (Heb 11:37). Visions often occur in the other prophets: in Isaiah there is only this one, and it is marked by characteristic clearness and simplicity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. In … year … Uzziah died—Either literal death, or civil when he ceased as a leper to exercise his functions as king [Chaldee], (2Ch 26:19-21). 754 B.C. [Calmet] 758 (Common Chronology). This is not the first beginning of Isaiah's prophecies, but his inauguration to a higher degree of the prophetic office: Isa 6:9, &c., implies the tone of one who had already experience of the people's obstinacy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lord—here Adonai, Jehovah in Isa 6:5; Jesus Christ is meant as speaking in Isa 6:10, according to Joh 12:41. Isaiah could only have \"seen\" the Son, not the divine essence (Joh 1:18). The words in Isa 6:10 are attributed by Paul (Ac 28:25, 26) to the Holy Ghost. Thus the Trinity in unity is implied; as also by the thrice \"Holy\" (Isa 6:3). Isaiah mentions the robes, temple, and seraphim, but not the form of God Himself. Whatever it was, it was different from the usual Shekinah: that was on the mercy seat, this on a throne; that a cloud and fire, of this no form is specified: over that were the cherubim, over this the seraphim; that had no clothing, this had a flowing robe and train.The glory of the Lord, Isaiah 6:1-4. Isaiah is terrified, Isaiah 6:5; is confirmed for his message, Isaiah 6:6-8. The people’s obstinacy unto desolation, Isaiah 6:9-12. A remnant shall be saved, Isaiah 6:13.  I saw in a vision or ecstasy. The Lord; either, 1. God the Son, who frequently appeared to the patriarchs and prophets, and that sometimes in the form of a man. Or rather, 2. The Divine Majesty as he subsisteth in three persons, as may be gathered both from the plural number us, used of this Lord, Isaiah 6:8, and comparing other scriptures; for God the Father is described as sitting upon a throne, Daniel 7:9,13, and elsewhere; and the glory of God here manifested is said to be Christ’s glory, John 12:41, and the words of the Lord here following are said to be spoken by the Holy Ghost, Acts 28:25. Sitting upon a throne, in the posture of a judge, to hear causes, and give sentence. Lifted up towards the roof of the temple. His train;  or, as the word properly signifies, and is here rendered by divers, the skirts or borders of him, or of it, to wit, his royal and judicial robe; for he is represented as a judge. Filled the temple;  his glorious robes reached down to the bottom of the temple, and were spread abroad in the temple, which was an evidence of a more than ordinary majesty. The temple may be here taken either, 1. Largely, and so it includes the courts as well as the house, as that word is oft used; or, 2. Strictly, for the house itself, or for that part of the temple in which this vision was exhibited, which may seem to have been the porch, for that was much higher than the other parts. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lord—here Adonai, Jehovah in Isa 6:5; Jesus Christ is meant as speaking in Isa 6:10, according to Joh 12:41. Isaiah could only have \"seen\" the Son, not the divine essence (Joh 1:18). The words in Isa 6:10 are attributed by Paul (Ac 28:25, 26) to the Holy Ghost. Thus the Trinity in unity is implied; as also by the thrice \"Holy\" (Isa 6:3). Isaiah mentions the robes, temple, and seraphim, but not the form of God Himself. Whatever it was, it was different from the usual Shekinah: that was on the mercy seat, this on a throne; that a cloud and fire, of this no form is specified: over that were the cherubim, over this the seraphim; that had no clothing, this had a flowing robe and train.The glory of the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 6:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Isaiah is terrified, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 6:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; is confirmed for his message, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 6:6-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The people’s obstinacy unto desolation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 6:9-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A remnant shall be saved, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "I saw",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in a vision or ecstasy. The Lord; either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. God the Son, who frequently appeared to the patriarchs and prophets, and that sometimes in the form of a man. Or rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. The Divine Majesty as he subsisteth in three persons, as may be gathered both from the plural number us, used of this Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 6:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and comparing other scriptures; for God the Father is described as sitting upon a throne, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Daniel 7:9,13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and elsewhere; and the glory of God here manifested is said to be Christ’s glory, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "John 12:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the words of the Lord here following are said to be spoken by the Holy Ghost, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Acts 28:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Sitting upon a throne, in the posture of a judge, to hear causes, and give sentence. Lifted up towards the roof of the temple. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "His train; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or, as the word properly signifies, and is here rendered by divers, the skirts or borders of him, or of it, to wit, his royal and judicial robe; for he is represented as a judge. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Filled the temple; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " his glorious robes reached down to the bottom of the temple, and were spread abroad in the temple, which was an evidence of a more than ordinary majesty. The temple may be here taken either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. Largely, and so it includes the courts as well as the house, as that word is oft used; or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. Strictly, for the house itself, or for that part of the temple in which this vision was exhibited, which may seem to have been the porch, for that was much higher than the other parts. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the year that King Uzziah died,.... Which was the fifty second year of his reign, and in the year 3246 from the creation of the world; and, according to Jerom (l), was the year in which Romulus, the founder of the Roman empire, was born: some understand this not of his proper death, but of his being stricken with leprosy, upon his attempt to burn incense in the temple; upon which he was shut up in a separate house, which was a kind of a civil death: so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"in the year in which King Uzziah was smitten;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that is, with leprosy; and so Jarchi and others interpret it, from the ancient writers; but the first sense is the best. Some, as Aben Ezra, would have this to be the beginning of the prophecy of Isaiah, because of the mission of the prophet in it; but others rightly observe, that this mission respects not the prophecy in general, but the particular reproof the prophet was sent to give to the Jews herein mentioned. The title of this chapter, in the Arabic version, is remarkable; according to which, this chapter contains the vision which Isaiah, the son of Amos, saw three years, or, as others affirm, thirty years, after prophecy was taken from him. He had prophesied about ten years before this, in the reign of Uzziah; and only this vision was in the reign of Jotham; the next prophecy was delivered out in the reign of Ahaz, Isaiah 7:1 and others in the time of Hezekiah; and the date of this vision is only mentioned, to observe the order of the visions, agreeably to Isaiah 1:1 and moreover it may be observed from hence, that kings must die as well as others; but the King of kings ever lives, he is the living God, and the everlasting King, as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that is, with leprosy; and so Jarchi and others interpret it, from the ancient writers; but the first sense is the best. Some, as Aben Ezra, would have this to be the beginning of the prophecy of Isaiah, because of the mission of the prophet in it; but others rightly observe, that this mission respects not the prophecy in general, but the particular reproof the prophet was sent to give to the Jews herein mentioned. The title of this chapter, in the Arabic version, is remarkable; according to which, this chapter contains the vision which Isaiah, the son of Amos, saw three years, or, as others affirm, thirty years, after prophecy was taken from him. He had prophesied about ten years before this, in the reign of Uzziah; and only this vision was in the reign of Jotham; the next prophecy was delivered out in the reign of Ahaz, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and others in the time of Hezekiah; and the date of this vision is only mentioned, to observe the order of the visions, agreeably to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and moreover it may be observed from hence, that kings must die as well as others; but the King of kings ever lives, he is the living God, and the everlasting King, as follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I saw also the Lord sitting upon a throne, high and lifted up; not God essentially considered, whose essence is not to be seen; but personally, Father, Son, and Spirit, for all the three Persons appear in this vision, Isaiah 6:3 particularly Christ, as, is clear from John 12:41 who is the \"Adonai\", or Lord; he is Lord of all, of all men, even of the greatest among them, and of all the angels in heaven, and of the church of God, by his Father's gift, by his own purchase, in right of marriage, and through the conquest of his grace. This sight was not corporeal, but with the eyes of the understanding, in the vision of prophecy; and to have a sight of Christ as the Lord, and especially as our Lord, is very delightful and comfortable; for though he is a sovereign Lord, he is no tyrannical one, is very powerful to protect and defend, and has all fulness for supply; and particularly as \"sitting upon a throne\" as a king, for he having done his work as a priest, sits down on his throne as a king; and a lovely sight it is to see him enthroned at the right hand of the Majesty on high; and therefore is said to be \"high and lifted up\"; for this is to be understood not of his throne, as if that was high and lifted up in the highest heavens, as the Targum paraphrases it; but of himself, who is high and exalted above all creatures, as Aben Ezra observes; and this sense the accents determine for: the vision refers to the exaltation of Christ, after his humiliation here on earth; and to behold him crowned with glory and honour is very delightful, since he is exalted as our head and representative in our nature, and acts for us in this his exalted state; and we may be assured of being exalted also. It follows, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I saw also the Lord sitting upon a throne, high and lifted up; not God essentially considered, whose essence is not to be seen; but personally, Father, Son, and Spirit, for all the three Persons appear in this vision, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " particularly Christ, as, is clear from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " who is the \"Adonai\", or Lord; he is Lord of all, of all men, even of the greatest among them, and of all the angels in heaven, and of the church of God, by his Father's gift, by his own purchase, in right of marriage, and through the conquest of his grace. This sight was not corporeal, but with the eyes of the understanding, in the vision of prophecy; and to have a sight of Christ as the Lord, and especially as our Lord, is very delightful and comfortable; for though he is a sovereign Lord, he is no tyrannical one, is very powerful to protect and defend, and has all fulness for supply; and particularly as \"sitting upon a throne\" as a king, for he having done his work as a priest, sits down on his throne as a king; and a lovely sight it is to see him enthroned at the right hand of the Majesty on high; and therefore is said to be \"high and lifted up\"; for this is to be understood not of his throne, as if that was high and lifted up in the highest heavens, as the Targum paraphrases it; but of himself, who is high and exalted above all creatures, as Aben Ezra observes; and this sense the accents determine for: the vision refers to the exaltation of Christ, after his humiliation here on earth; and to behold him crowned with glory and honour is very delightful, since he is exalted as our head and representative in our nature, and acts for us in this his exalted state; and we may be assured of being exalted also. It follows, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and his train filled the temple; either the material temple visionally seen, where his feet were, and his throne in heaven, as Jarchi interprets it; or heaven, as Kimchi, which is the Lord's holy temple, where his throne is, Psalm 11:4 or rather the human nature of Christ, the temple where the fulness of the Godhead dwells bodily, and which the train of divine perfections fill; though it may be best of all to understand it of the church, the temple of the living God; and \"his train\" may denote the effects of Christ's kingly and priestly offices, with which the Church was filled upon his exaltation; as the gifts and graces of his Spirit in an extraordinary manner on the day of Pentecost, and since in a more ordinary way; whereby men have been made ministers of the New Testament, and churches filled with them, and these made useful in filling the churches with members. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and his train filled the temple; either the material temple visionally seen, where his feet were, and his throne in heaven, as Jarchi interprets it; or heaven, as Kimchi, which is the Lord's holy temple, where his throne is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or rather the human nature of Christ, the temple where the fulness of the Godhead dwells bodily, and which the train of divine perfections fill; though it may be best of all to understand it of the church, the temple of the living God; and \"his train\" may denote the effects of Christ's kingly and priestly offices, with which the Church was filled upon his exaltation; as the gifts and graces of his Spirit in an extraordinary manner on the day of Pentecost, and since in a more ordinary way; whereby men have been made ministers of the New Testament, and churches filled with them, and these made useful in filling the churches with members. The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and the temple was filled with the splendour of his glory;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the \"train\" is the skirts, borders, or lower parts of the garments, in allusion to those of a king, or rather of the high priest, a type of Christ. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Epist. Damaso, tom. 3. fol. 37. K. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) Epist. Damaso, tom. 3. fol. 37. K. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "In the year that king Uzziah died {a} I saw also the Lord sitting upon a {b} throne, high and lifted up, and his {c} train filled the temple.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the year that king Uzziah died ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I saw also the Lord sitting upon a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " throne, high and lifted up, and his ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " train filled the temple.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) God does not show himself to man in his majesty but according as man's capacity to comprehend him, that is, by visible signs as John the Baptist saw the Holy Spirit in the form of a dove.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) As a judge ready to give sentence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Of his garment, or of his throne.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the year that king Uzziah died",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. about 740 b.c.; see Chronological Note, pp. lxxv f. Whether the event happened before or after the king’s death cannot be determined. It lends an additional interest to the vision if we adopt the latter view, and regard this as the divine answer to the anxious foreboding thoughts which naturally arose in a susceptible mind at the death of a strong and successful ruler. The earthly king has passed away, and now Isaiah sees the true King in His glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I saw also the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Many codices read here Jehovah, but the name in the received text is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Adonai",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the Sovereign",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The word “also” answers to nothing in the original. The words ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "high and lofty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " apply to the throne, not to Jehovah Himself, as in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his train filled the temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The skirts of His vesture fill the whole space, and on these alone, not on the person of Jehovah, Isaiah allows his eyes to rest.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jehovah appears to the prophet in human form, and as a King, seated on a throne, surrounded by ministering servants who sing His praise (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.). The scene is the Temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 6:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), where Isaiah probably was when the vision occurred. There is no occasion to suppose that a “heavenly palace” is meant. What the prophet sees is the spiritual reality of which the Temple was a symbol, Jehovah’s presence as King in the midst of His people. Cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - THE VISION OF GOD SEEN BY ISAIAH. It is thought by some that this vision, and its sequel, constitute the original call of Isaiah to the prophetical office, and in order of time precede all the other contents of the book. But the position of the \"vision\" in the book is strongly against this view. Prophets who relate their original call naturally place it in the forefront of their narrative (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is quite possible, as Bishop Lowth says, that this was \"a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "new",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " designation, to introduce more solemnly a general declaration of the whole course of God's dispensations in regard to his people, and the fates of the nations.\" The vision itself may profitably be compared with Ezekiel's first vision, which it much resembles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:4-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the year that King Uzziah died.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The year  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 759",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", probably. We cannot determine from the phrase used whether the vision was seen before or after Uzziah's death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I saw also",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "then it was that I saw",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Lord. Not \"Jehovah,\" as in vers. 3 and 5, but \"Adonay,\" for greater reverence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Sitting upon a throne, high and lifted up.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The imagery is, of course, taken from the practice of earthly kings. Elaborate thrones were affected by the great monarchs of Egypt and Assyria (Lepsius, 'Deutmaler,' pt. 3. pls. 2, 76, 100, 121; Layard, 'Nineveh and Babylon,' p. 150). Solomon's throne was perhaps even grander than any of these (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:18-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was placed at the summit of \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "six",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " steps,\" so that its occupant was \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "high",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and lifted up\" above all his courtiers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His train.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not his train of attendants, but \"the skirts of his robe.\" Flowing robes were commonly worn by great monarchs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Filled the temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the palace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The same word is used in Hebrew for both. Dr. Kay supposes the prophet to be \"in vision gazing on the actual temple - to see its veils drawn aside, and instead of the Shechinah enthroned on the cherubim, to behold the King of glory, enthroned on high, the fringes of his royal robe filling the temple, so that no human priest could minister there.\" But, as Mr. Cheyne observes, \"palace is more in harmony with the picture than temple.\" It is the heavenly palace of the King of kings into which the prophet's gaze is allowed to penetrate. Isaiah 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The time of the occurrence here described, viz., \"the year that king Uzziah (Uzı̄yahu) died,\" was of importance to the prophet. The statement itself, in the naked form in which it is here introduced, is much more emphatic than if it commenced with \"it came to pass\" (vay'hi; cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 24:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was the year of Uzziah's death, not the first year of Jotham's reign; that is to say, Uzziah was still reigning, although his death was near at hand. If this is the sense in which the words are to be understood, then, even if the chapter before us contains an account of Isaiah's first call, the heading to chapter 1, which dates the ministry of the prophet from the time of Uzziah, is quite correct, inasmuch as, although his public ministry under Uzziah was very short, this is properly to be included, not only on account of its own importance, but as inaugurating a new ear (lit. \"an epoch-making beginning\"). But is it not stated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 26:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that Isaiah wrote a historical work embracing the whole of Uzziah's reign? Unquestionably; but it by no means follows from this, that he commenced his ministry long before the death of Uzziah. If Isaiah received his call in the year that Uzziah died, this historical work contained a retrospective view of the life and times of Uzziah, the close of which coincided with the call of the prophetic author, which made a deep incision into the history of Israel. Uzziah reigned fifty-two years (809-758 b.c.). This lengthened period was just the same to the kingdom of Judah as the shorter age of Solomon to that of all Israel, viz., a time of vigorous and prosperous peace, in which the nation was completely overwhelmed with manifestations of divine love. But the riches of divine goodness had no more influence upon it, than the troubles through which it had passed before. And now the eventful change took place in the relation between Israel and Jehovah, of which Isaiah was chosen to be the instrument before and above all other prophets. The year in which all this occurred was the year of Uzziah's death. It was in this year that Israel as a people was given up to hardness of heart, and as a kingdom and country to devastation and annihilation by the imperial power of the world. How significant a fact, as Jerome observes in connection with this passage, that the year of Uzziah's death should be the year in which Romulus was born; and that it was only a short time after the death of Uzziah (viz., 754 b.c. according to Varro's chronology) that Rome itself was founded! The national glory of Israel died out with king Uzziah, and has never revived to this day.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In that year, says the prophet, \"I saw the Lord of all sitting upon a high and exalted throne, and His borders filling the temple.\" Isaiah saw, and that not when asleep and dreaming; but God gave him, when awake, an insight into the invisible world, by opening an inner sense for the supersensuous, whilst the action of the outer senses was suspended, and by condensing the supersensuous into a sensuous form, on account of the composite nature of man and the limits of his present state. This was the mode of revelation peculiar to an ecstatic vision (ἐν ἐκστἀσει, Eng. ver. \"in a trance,\" or ἐν πνεὐματι, \"in the spirit\"). Isaiah is here carried up into heaven; for although in other instances it was undoubtedly the earthly temple which was presented to a prophet's view in an ecstatic vision (Amos 9:1; Ezekiel 8:3; Ezekiel 10:4-5; cf., Acts 22:17), yet here, as the description which follows clearly proves, the \"high and exalted throne\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In that year, says the prophet, \"I saw the Lord of all sitting upon a high and exalted throne, and His borders filling the temple.\" Isaiah saw, and that not when asleep and dreaming; but God gave him, when awake, an insight into the invisible world, by opening an inner sense for the supersensuous, whilst the action of the outer senses was suspended, and by condensing the supersensuous into a sensuous form, on account of the composite nature of man and the limits of his present state. This was the mode of revelation peculiar to an ecstatic vision (ἐν ἐκστἀσει, Eng. ver. \"in a trance,\" or ἐν πνεὐματι, \"in the spirit\"). Isaiah is here carried up into heaven; for although in other instances it was undoubtedly the earthly temple which was presented to a prophet's view in an ecstatic vision (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 9:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 10:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 22:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), yet here, as the description which follows clearly proves, the \"high and exalted throne\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It is to this, and not to ‛Adonai, as the Targum and apparently the accents imply, that the words \"high and exalted\" refer.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "is the heavenly antitype of the earthly throne which was formed by the ark of the covenant; and the \"temple\" (hēcâl: lit., a spacious hall, the name given to the temple as the palace of God the King) is the temple in heaven, as in Psalm 11:4; Psalm 18:7; Psalm 29:9, and many other passages. There the prophet sees the Sovereign Ruler, or, as we prefer to render the noun, which is formed from âdan  equals  dūn, \"the Lord of all\" (All-herrn, sovereign or absolute Lord), seated upon the throne, and in human form (Ezekiel 1:26), as is proved by the robe with a train, whose flowing ends or borders (fimibrae: shūilm, as in Exodus 28:33-34) filled the hall. The Sept., Targum, Vulgate, etc., have dropped the figure of the robe and train, as too anthropomorphic. But John, in his Gospel, is bold enough to say that it was Jesus whose glory Isaiah saw (John 12:41). And truly so, for the incarnation of God is the truth embodied in all the scriptural anthropomorphisms, and the name of Jesus is the manifested mystery of the name Jehovah. The heavenly temple is that super-terrestrial place, which Jehovah transforms into heaven and a temple, by manifesting Himself there to angels and saints. But whilst He manifests His glory there, He is obliged also to veil it, because created beings are unable to bear it. But that which veils His glory is no less splendid, than that portion of it which is revealed. And this was the truth embodied for Isaiah in the long robe and train. He saw the Lord, and what more he saw was the all-filling robe of the indescribable One. As far as the eye of the seer could look at first, the ground was covered by this splendid robe. There was consequently no room for any one to stand. And the vision of the seraphim is in accordance with this.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "is the heavenly antitype of the earthly throne which was formed by the ark of the covenant; and the \"temple\" (hēcâl: lit., a spacious hall, the name given to the temple as the palace of God the King) is the temple in heaven, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 29:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and many other passages. There the prophet sees the Sovereign Ruler, or, as we prefer to render the noun, which is formed from âdan  equals  dūn, \"the Lord of all\" (All-herrn, sovereign or absolute Lord), seated upon the throne, and in human form (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as is proved by the robe with a train, whose flowing ends or borders (fimibrae: shūilm, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:33-34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") filled the hall. The Sept., Targum, Vulgate, etc., have dropped the figure of the robe and train, as too anthropomorphic. But John, in his Gospel, is bold enough to say that it was Jesus whose glory Isaiah saw (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). And truly so, for the incarnation of God is the truth embodied in all the scriptural anthropomorphisms, and the name of Jesus is the manifested mystery of the name Jehovah. The heavenly temple is that super-terrestrial place, which Jehovah transforms into heaven and a temple, by manifesting Himself there to angels and saints. But whilst He manifests His glory there, He is obliged also to veil it, because created beings are unable to bear it. But that which veils His glory is no less splendid, than that portion of it which is revealed. And this was the truth embodied for Isaiah in the long robe and train. He saw the Lord, and what more he saw was the all-filling robe of the indescribable One. As far as the eye of the seer could look at first, the ground was covered by this splendid robe. There was consequently no room for any one to stand. And the vision of the seraphim is in accordance with this.  ",
            "children": []
          }
        ]
      }
    ]
  }
]