[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And one cried unto another.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—So in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which, as describing a thunderstorm, favours the suggestion that the lightnings were thought of as the symbols of the fiery seraphim, we read, “in his temple doth every one ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "say, Glory.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The threefold repetition, familiar as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Trisagion ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the Church’s worship, and reproduced in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (where “Lord God Almighty” appears as the equivalent of Jehovah Sabaoth), may represent either the mode of utterance, first antiphonal, and then in full chorus, or the Hebrew idiom of the emphasis of a three-fold iteration, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Viewed from the standpoint of a later revelation, devout thinkers have naturally seen in it an allusive reference to the glory of Jehovah as seen alike in the past, the present, and the future, which seems the leading idea in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or even a faint foreshadowing of the Trinity of Persons in the Unity of the Godhead. Historically we cannot separate it from the name of the Holy One of Israel, which with “the Lord of hosts” was afterwards so prominent in Isaiah’s teaching.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "VISION AND SERVICEIsaiah 6:1 - Isaiah 6:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "VISION AND SERVICE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " WE may deal with this text as falling into three parts: the vision, its effect on the prophet, and his commission.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The Vision.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-’In the year that King Uzziah died’ is more than a date for chronological accuracy. It tells not only when, but why, the vision was given. The throne of David was empty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God never empties places in our homes and hearts, or in the nation or the Church, without being ready to fill them. He sometimes empties them that He may fill them. Sorrow and loss are meant to prepare us for the vision of God, and their effect should be to purge the inward eye, that it may see Him. When the leaves drop from the forest trees we can see the blue sky which their dense abundance hid. Well for us if the passing of all that can pass drives us to Him who cannot pass, if the unchanging God stands out more clear, more near, more dear, because of change.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As to the substance of this vision, we need not discuss whether, if we had been there, we should have seen anything. It was doubtless related to Isaiah’s thoughts, for God does not send visions which have no point of contact in the recipient. However communicated, it was a divine communication, and a temporary unveiling of an eternal reality. The form was transient, but Isaiah then saw for a moment ‘the things which are’ and always are.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The essential point of the vision is the revelation of Jehovah as king of Judah. That relation guaranteed defence and demanded obedience. It was a sure basis of hope, but also a stringent motive to loyalty, and it had its side of terror as well as of joyfulness. ‘You only have I known of all the families of the earth: therefore I will punish you for all your iniquities.’ The place of vision is the heavenly sanctuary of which the temple was a prophecy. Eminently significant and characteristic of the whole genius of the Old Testament is the absence of any description of the divine appearance. The prophet saw things ‘which it is not lawful for a man to utter,’ and his silence is not only reverent, but more eloquent than any attempt to put the Ineffable into words. Even in this act of manifestation God was veiled, and ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was the hiding of His power.’ The train of His robe can be spoken of, but not the form which it concealed even in revealing it. Nature is the robe of God. It hides while it discloses, and discloses while it hides.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The hovering seraphim were in the attitude of service. They are probably represented as fiery forms, but are spoken of nowhere else in Scripture. The significance of their attitude has been well given by Jewish commentators, who say, ‘with two he covered his face that he might not see, and with two he covered his body that he might not be seen’ and we may add, ‘with two he stood ready for service, by flight whithersoever the King would send.’ Such awe-stricken reverence, such humble hiding of self, such alacrity for swift obedience, such flaming ardours of love and devotion, should be ours. Their song celebrated the holiness and the glory of Jehovah of hosts. We must ever remember that the root-meaning of ‘holiness’ is separation, and that the popular meaning of moral purity is secondary and derivative. What is rapturously sung in the threefold invocation of the seraphs is the infinite exaltation of Jehovah above all creatural conditions, limitations, and, we may add, conceptions. That separation, of course, includes purity, as may be seen from the immediate effect of the vision on the prophet, but the conception is much wider than that. Very beautifully does the second line of the song re-knit the connection between Jehovah and this world, so far beneath Him, which the burst of praise of His holiness seems to sever. The high heaven is a bending arch; its inaccessible heights ray down sunshine and drop down rain, and, as in the physical world, every plant grows by Heaven’s gift, so in the world of humanity all wisdom, goodness, and joy are from the Father of lights. God’s ‘glory’ is the flashing lustre of His manifested holiness, which fills the earth as the train of the robe filled the temple. The vibrations of that mighty hymn shook the ‘foundations of the threshold’ {Rev. Ver.} with its thunderous harmonies. ‘The house was filled with smoke’ which, since it was an effect of the seraph’s praise, is best explained as referring to the fragrant smoke of incense which, as we know, symbolised ‘the prayers of saints.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The effect of the vision on the prophet.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-The vision kindled as with a flash Isaiah’s consciousness of sin. He expressed it in regard to his words rather than his works, partly because in one aspect speech is even more accurately than act a cast, as it were, of character, and partly because he could not but feel the difference between the mighty music that burst from these pure and burning lips and the words that flowed from and soiled his own. Not only the consciousness of sin, but the dread of personal evil consequences from the vision of the holy God, oppressed his heart. We see ourselves when we see God. Once flash on a heart the thought of God’s holiness, and, like an electric searchlight, it discloses flaws which pass unnoticed in dimmer light. The easy-going Christianity, which is the apology for religion with so many of us, has no deep sense of sin, because it has no clear vision of God. ‘I have heard of Thee by the hearing of the ear; but now mine eye seeth Thee: wherefore I abhor myself, and repent in dust and ashes.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The next stage in Isaiah’s experience is that sin recognised and confessed is burned away. Cleansing rather than forgiveness is here emphasised. The latter is, of course, included, but the main point is the removal of impurity. It is mediated by one of the seraphim, who is the messenger of God, which is just a symbolical way of saying that God makes penitents ‘partakers of His holiness,’ and that nothing less than a divine communication will make cleansing possible. It is effected by a live coal. Fire is purifying, and the New Testament has taught us that the true cleansing fire is that of the Holy Spirit. But that live coal was taken from the altar. The atoning sacrifice has been offered there, and our cleansing depends on the efficacy of that sacrifice being applied to us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The third stage in the prophet’s experience is the readiness for service which springs up in his purged heart. God seeks for volunteers. There are no pressed men in His army. The previous experiences made Isaiah quick to hear God’s call, and willing to respond to it by personal consecration. Take the motive-power of redemption from sin out of Christianity, and you break its mainspring, so that the clock will only tick when it is shaken. It is the Christ who died for our sins to whom men say, ‘Command what Thou wilt, and I obey.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The prophet’s commission.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-He was not sent on his work with any illusions as to its success, but, on the contrary, he had a clear premonition that its effect would be to deepen the spiritual deafness and blindness of the nation. We must remember that in Scripture the certain effect of divine acts is uniformly regarded as a divine design. Israel was so sunk in spiritual deadness that the issue of the prophet’s work would only be to immerse the mass of ‘this people’ farther in it. To some more susceptible souls his message would be a true divine voice, rousing them like a trumpet, and that effect was what God desired; but to the greater number it would deepen their torpor and increase their condemnation. If men love darkness rather than light, the coming of the light works only judgment.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaiah recoils from the dreary prospect, and feels that this dreadful hardening cannot be God’s ultimate purpose for the nation. So he humbly and wistfully asks how long it is to last. The answer is twofold, heavy with a weight of apparently utter ruin in its first part, but disclosing a faint, far-off gleam of hope on its second. Complete destruction, and the casting of Israel out from the land, are to come. But as, though a goodly tree is felled, a stump remains which has vital force {or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "substance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} in it, so, even in the utmost apparent desperateness of Israel’s state, there will be in it ‘the holy seed,’ the ‘remnant,’ the true Israel, from which again the life shall spring, and stem and branches and waving foliage once more grow up.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 6:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And one cried unto another ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Divided into two choirs, they sung responsively one to the other; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and said, Holy, holy, holy is the Lord of hosts ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— “God’s holiness,” says Lowth, “or the superlative purity of his nature, implies in it all the rest of his attributes, especially his justice and mercy, which are dispensed by the most exact rules of rectitude. The Christian Church has always thought the doctrine of the Trinity to be implied in this threefold repetition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as it is also intimated in several other passages of the Old Testament, particularly in that form commanded to be used in blessing the people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 6:24-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 48:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of this book;” where see the notes. Thus Jerome observes the design of their hymn was “to show that there is a Trinity in the one Godhead; and to testify, that, not the Jewish temple, as formerly, (for that was to be forsaken of God,) but the whole earth was full of his glory:” namely, of the effects and demonstrations of his glorious holiness, as well as of his power, wisdom, and goodness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-8 In this figurative vision, the temple is thrown open to view, even to the most holy place. The prophet, standing outside the temple, sees the Divine Presence seated on the mercy-seat, raised over the ark of the covenant, between the cherubim and seraphim, and the Divine glory filled the whole temple. See God upon his throne. This vision is explained, Joh 12:41, that Isaiah now saw Christ's glory, and spake of Him, which is a full proof that our Saviour is God. In Christ Jesus, God is seated on a throne of grace; and through him the way into the holiest is laid open. See God's temple, his church on earth, filled with his glory. His train, the skirts of his robes, filled the temple, the whole world, for it is all God's temple. And yet he dwells in every contrite heart. See the blessed attendants by whom his government is served. Above the throne stood the holy angels, called seraphim, which means burners; they burn in love to God, and zeal for his glory against sin. The seraphim showing their faces veiled, declares that they are ready to yield obedience to all God's commands, though they do not understand the secret reasons of his counsels, government, or promises. All vain-glory, ambition, ignorance, and pride, would be done away by one view of Christ in his glory. This awful vision of the Divine Majesty overwhelmed the prophet with a sense of his own vileness. We are undone if there is not a Mediator between us and this holy God. A glimpse of heavenly glory is enough to convince us that all our righteousnesses are as filthy rags. Nor is there a man that would dare to speak to the Lord, if he saw the justice, holiness, and majesty of God, without discerning his glorious mercy and grace in Jesus Christ. The live coal may denote the assurance given to the prophet, of pardon, and acceptance in his work, through the atonement of Christ. Nothing is powerful to cleanse and comfort the soul, but what is taken from Christ's satisfaction and intercession. The taking away sin is necessary to our speaking with confidence and comfort, either to God in prayer, or from God in preaching; and those shall have their sin taken away who complain of it as a burden, and see themselves in danger of being undone by it. It is great comfort to those whom God sends, that they go for God, and may therefore speak in his name, assured that he will bear them out.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And one cried to another - Hebrew 'This cried to this.' That is, they cried to each other in alternate responses. One cried 'holy;' the second repeated it; then the third; and then they probably united in the grand chorus, 'Full is all the earth of his glory.' This was an ancient mode of singing or recitative among the Hebrews; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Miriam is represented as going before in the dance with a timbrel, and the other females as following her, and \"answering,\" or responding to her, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 136:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; compare Lowth, \"on the Sacred Poetry of the Hebrews,\" Lect. xix.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Holy, holy, holy - The \"repetition\" of a name, or of an expression, three times, was quite common among the Jews. Thus, in Jeremiah 7:4, the Jews are represented by the prophet as saying, 'the temple of the Lord, the temple of the Lord, the temple of the Lord, are these. Thus, Jeremiah 22:29 : 'O earth, earth, earth, hear the word of the Lord;' Ezekiel 21:27 : 'I will overturn, overturn, overturn;' see also 1 Samuel 18:23 : 'O my son Absalom! my son, my son;' see also the repetition of the form of benediction among the Jews, Numbers 6:24-26 :",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Holy, holy, holy - The \"repetition\" of a name, or of an expression, three times, was quite common among the Jews. Thus, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Jews are represented by the prophet as saying, 'the temple of the Lord, the temple of the Lord, the temple of the Lord, are these. Thus, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 22:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'O earth, earth, earth, hear the word of the Lord;' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'I will overturn, overturn, overturn;' see also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'O my son Absalom! my son, my son;' see also the repetition of the form of benediction among the Jews, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 6:24-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Jehovah bless thee and keep thee;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jehovah make his face to shine upon thee,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And be gracious unto thee;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jehovah lift up his countenance upon thee,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And give thee peace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In like manner, the number \"seven\" is used by the Hebrews to denote a great, indefinite number; then a full or complete number; and then perfectness, completion. Thus, in Revelation 1:4; Revelation 3:1; Revelation 4:5, the phrase, 'the seven spirits of God,' occurs as applicable to the Holy Spirit, denoting his fullness, completeness, perfection. The Hebrews usually expressed the superlative degree by the repetition of a word. Thus, Genesis 14:10 : 'The vale of Siddim, pits, pits of of clay,' that is, was full of pits; see Nordheimer's \"Heb. Gram.\" Section 822-824. The form was used, therefore, among the Jews, to denote \"emphasis;\" and the expression means in itself no more than 'thrice holy;' that is, supremely holy. Most commentators, however, have supposed that there is here a reference to the doctrine of the Trinity. It is not probable that the Jews so understood it; but applying to the expressions the fuller revelations of the New Testament, it cannot be doubted that the words will express that. Assuming that that doctrine is true, it cannot be doubted, think, that the seraphs laid the foundation of their praise in that doctrine. That there was a distinct reference to the second person of the Trinity, is clear from what John says, John 12:41. No \"argument\" can be drawn directly from this in favor of the doctrine of the Trinity, for the repetition of such phrases thrice in other places, is merely \"emphatic,\" denoting the superlative degree. But when the doctrine is \"proved\" from other places, it may be presumed that the heavenly beings were apprized of it, and that the foundation of their ascriptions of praise was laid in that. The Chaldee has rendered this, 'Holy in the highest heavens, the house of his majesty; holy upon the earth, the work of his power; holy forever, and ever, and ever, is the Lord of hosts.' The whole expression is a most sublime ascription of praise to the living God, and should teach us in what manner to approach him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In like manner, the number \"seven\" is used by the Hebrews to denote a great, indefinite number; then a full or complete number; and then perfectness, completion. Thus, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the phrase, 'the seven spirits of God,' occurs as applicable to the Holy Spirit, denoting his fullness, completeness, perfection. The Hebrews usually expressed the superlative degree by the repetition of a word. Thus, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'The vale of Siddim, pits, pits of of clay,' that is, was full of pits; see Nordheimer's \"Heb. Gram.\" Section 822-824. The form was used, therefore, among the Jews, to denote \"emphasis;\" and the expression means in itself no more than 'thrice holy;' that is, supremely holy. Most commentators, however, have supposed that there is here a reference to the doctrine of the Trinity. It is not probable that the Jews so understood it; but applying to the expressions the fuller revelations of the New Testament, it cannot be doubted that the words will express that. Assuming that that doctrine is true, it cannot be doubted, think, that the seraphs laid the foundation of their praise in that doctrine. That there was a distinct reference to the second person of the Trinity, is clear from what John says, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". No \"argument\" can be drawn directly from this in favor of the doctrine of the Trinity, for the repetition of such phrases thrice in other places, is merely \"emphatic,\" denoting the superlative degree. But when the doctrine is \"proved\" from other places, it may be presumed that the heavenly beings were apprized of it, and that the foundation of their ascriptions of praise was laid in that. The Chaldee has rendered this, 'Holy in the highest heavens, the house of his majesty; holy upon the earth, the work of his power; holy forever, and ever, and ever, is the Lord of hosts.' The whole expression is a most sublime ascription of praise to the living God, and should teach us in what manner to approach him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord of hosts - see the note at Isaiah 1:9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord of hosts - see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The whole earth - Margin, 'The earth is the fulness of his glory.' All things which he has made on the earth express his glory. His wisdom and goodness, his power and holiness, are seen every where. The whole earth, with all its mountains, seas, streams, trees, animals, and people, lay the foundation of his praise. In accordance with this, the Psalmist, in a most beautiful composition, calls upon all things to praise him; see Psalm 148:1-14.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The whole earth - Margin, 'The earth is the fulness of his glory.' All things which he has made on the earth express his glory. His wisdom and goodness, his power and holiness, are seen every where. The whole earth, with all its mountains, seas, streams, trees, animals, and people, lay the foundation of his praise. In accordance with this, the Psalmist, in a most beautiful composition, calls upon all things to praise him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 148:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Praise the Lord from the earth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ye dragons, and all deeps:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Fire and hail; snow and vapors;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Stormy wind fulfilling his word:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. (Re 4:8). The Trinity is implied (on \"Lord,\" see on [693]Isa 6:1). God's holiness is the keynote of Isaiah's whole prophecies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whole earth—the Hebrew more emphatically, the fulness of the whole earth is His glory (Ps 24:1; 72:19).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "One cried unto another; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " singing in consort the praises of their Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Holy, holy, holy:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is repeated thrice, either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. To intimate the Trinity of persons united in the Divine essence; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. That he was most eminently and unquestionably holy in his present work of judgment, and in all his ways; such repetitions being very frequent in Scripture, for the greater assurance of the thing, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 7:4 Ezekiel 21:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The whole earth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only Canaan, to which the Jews did vainly and arrogantly confine the presence of God, but all the world; which seems to have a respect to the conversion of the Gentiles, which did accompany the plenary and last execution of this judgment here threatened against the Jewish nation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 6:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as is evident by comparing this with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 13:14,15 Ac 28:26,27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",15 Ac 28:26,27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and other places of the New Testament. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Full of his glory; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the effects and demonstrations of his glorious holiness, as well as of his power, and wisdom, and goodness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And one cried unto another,.... This denotes the publicness of their ministry, and their harmony and unity in it; they answered to one another, and agreed in what they said; their preaching was not yea and nay, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, holy, holy, holy is the Lord of hosts; this expresses the subject matter of the Gospel ministry, respecting the holiness of God; all the doctrines of the Gospel are pure and holy, and have a tendency to promote holiness of heart and life, and are agreeable to the holiness of God, and in them the holiness of God in each of the divine Persons is declared; particularly the Gospel ministry affirms that there is one God, who is the Lord of hosts, of armies above and below, of angels and men; that there are three Persons in the Godhead, Father, Son, and Spirit; and that each of these three are glorious in holiness; there is the Holy Father, and the Holy Son, and the Holy Ghost, and the holiness of them is displayed in each of the doctrines of grace: the holiness of the Father appears in the choice of persons to eternal life, through sanctification of the Spirit; in the covenant of grace, which provides for the holiness of covenant ones; and in the justification of his people through Christ, and redemption by him, whereby the honour of his justice and holiness is secured: the holiness of the Son appears in his incarnation and life; in redemption from sin by him, and in satisfying for it, and justifying from it: and the holiness of the Spirit is seen in the doctrines of regeneration and sanctification, ascribed unto him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The whole earth is full of his glory; as it was when Christ dwelt in it, wrought his miracles, and manifested forth his glory, and when his Gospel was preached everywhere by his apostles; and as it will be, more especially in the latter day, when it will be filled with the knowledge of the Lord; when the kingdoms of this world will become his, and his kingdom will be everywhere, even from sea to sea, and from the rivers to the ends of the earth; and this is what Gospel ministers declare will be: or \"the fulness of the whole earth is his glory\" (m); the earth is his, and all that is in it, and all declare his glory; see Revelation 4:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The whole earth is full of his glory; as it was when Christ dwelt in it, wrought his miracles, and manifested forth his glory, and when his Gospel was preached everywhere by his apostles; and as it will be, more especially in the latter day, when it will be filled with the knowledge of the Lord; when the kingdoms of this world will become his, and his kingdom will be everywhere, even from sea to sea, and from the rivers to the ends of the earth; and this is what Gospel ministers declare will be: or \"the fulness of the whole earth is his glory\" (m); the earth is his, and all that is in it, and all declare his glory; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m)    \"plenitudo totius terrae gloria ejus\", Montanus; \"quicquid replet terram est gloria ejus\", Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m)    \"plenitudo totius terrae gloria ejus\", Montanus; \"quicquid replet terram est gloria ejus\", Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And one cried to another, and said, {h} Holy, holy, holy, is the LORD of hosts: the whole {i} earth is full of his glory.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And one cried to another, and said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Holy, holy, holy, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD of hosts: the whole ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " earth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " full of his glory.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) This often repetition signifies that the angels cannot satisfy themselves in praising God, to teach us that in all our lives we should give ourselves to the continual praise of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) His glory not only appears in the heavens but through all the world, and therefore all creatures are bound to praise him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And one cried unto another",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] (frequentat. impf.). Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Holy, holy, holy is Jehovah of Hosts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ":",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That which fills the whole earth is His glory",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word “holy,” thrice repeated as if it struck the chord to which the whole nature of these pure beings vibrated (the ancient church found here an allusion to the mystery of the Trinity) sums up the meaning of the vision in so far as it is a revelation of God. The general notion of holiness is too complex to be analysed here. The root idea appears to be that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "distance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "separation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As a predicate of deity it expresses first of all the awful contrast between the divine and the human, and then those positive attributes of God which constitute true divinity, and call for the religious emotions of awe, reverence and adoration. What Isaiah here receives, therefore, is a new and overpowering impression of the Supreme Godhead of Jehovah; the whole impact of the vision on his mind is concentrated in the word which he hears from the lips of the seraphim. Although the idea of holiness in the O.T. is never to be identified with that of moral purity, it is clear from Isaiah’s immediate sense of guilt that ethical perfection is included among the attributes which make up the holiness or Godhead of Jehovah (see Robertson Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prophets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 224 ff.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The second line of the Trisagion celebrates the “glory” of Jehovah, His manifestation of Himself in nature,—one of the leading thoughts of the second part of this book (ch. 40 ff.). The seraphim contemplate the universal diffusion of this “glory” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sub specie aeternitatis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as a present fact; elsewhere it is an ideal yet to be realised: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "One cried",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "kept crying",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"They rest not day and night, saying, Holy, holy, holy\"). But the prophet scarcely goes so far; he describes only his vision - they did not rest while the vision was vouchsafed him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Holy, holy, holy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Church on earth has taken pattern by the Church above; and the \"Trisagion\" is ever being repeated in one part of the earth or another without ceasing: \"Thou continuest holy, O thou Worship of Israel.\" There is no attribute so essential to God as this. It is for his holiness, more than for anything else, that his creatures worship him. The triple repetition has been understood in all ages of the Church as connected with the doctrine of the Trinity. Holy is he who has created us, and bidden us worship him in the beauty of holiness Holy is he who has redeemed us, and washed away our sins, and made us by profession holy! Holy is he who day by day sanctifies us, and makes us in very deed and truth, so far as we will permit him, holy! ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The whole earth is full of his glory",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Even in heaven the seraphic thoughts are turned to earth, and its relation to its Divine Creator is made the subject of angelic utterances (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The lesson which they gather from their contemplation, even under all the miserable circumstances of the time, is a cheering one: \"The whole earth is full of God's glory.\" Men, whether they will it or not, are working out God's purposes, advancing his designs, accomplishing the ends that he desires (see Homiletics on Isaiah 5:25-29). Isaiah 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And one cried to the other, and said, Holy, holy, holy is Jehovah of hosts: filling the whole earth is His glory.\" The meaning is not that they all lifted up their voice in concert at one and the same time (just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " el is not used in this sense, viz., as equivalent to C'neged), but that there was a continuous and unbroken antiphonal song. One set commenced, and the others responded, either repeating the \"Holy, holy, holy,\" or following with \"filling the whole earth is His glory.\" Isaiah heard this antiphonal or \"hypophonal\" song of the seraphim, not merely that he might know that the uninterrupted worship of God was their blessed employment, but because it was with this doxology as with the doxologies of the Apocalypse, it had a certain historical significance in common with the whole scene. God is in Himself the Holy One (kâdōsh), i.e., the separate One, beyond or above the world, true light, spotless purity, the perfect One. His glory (Câbod) is His manifested holiness, as Oetinger and Bengel express it, just as, on the other hand, His holiness is His veiled or hidden glory. The design of all the work of God is that His holiness should become universally manifest, or, what is the same thing, that His glory should become the fulness of the whole earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This design of the work of God stands before God as eternally present; and the seraphim also have it ever before them in its ultimate completion, as the theme of their song of praise. But Isaiah was a man living in the very midst of the history that was moving on towards this goal; and the cry of the seraphim, in the precise form in which it reached him, showed him to what it would eventually come on earth, whilst the heavenly shapes that were made visible to him helped him to understand the nature of that divine glory with which the earth was to be filled. The whole of the book of Isaiah contains traces of the impression made by this ecstatic vision. The favourite name of God in the mouth of the prophet viz., \"the Holy One of Israel\" (kedosh Yisrael), is the echo of this seraphic sanctus; and the fact that this name already occurs with such marked preference on the part of the prophet in the addresses contained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:2-4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", supports the view that Isaiah is here describing his own first call. All the prophecies of Isaiah carry this name of God as their stamp. It occurs twenty-nine times (including ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), viz., twelve times in chapters 1-39, and seventeen times in chapters 40-66. As Luzzatto has well observed, \"the prophet, as if with a presentiment that the authenticity of the second part of his book would be disputed, has stamped both parts with this name of God, 'the Holy One of Israel,' as if with his own seal.\" The only other passages in which the word occurs, are three times in the Psalms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 71:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and twice in Jeremiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that not without an allusion to Isaiah. It forms an essential part of Isaiah's distinctive prophetic signature. And here we are standing at the source from which it sprang. But did this thrice-holy refer to the triune God? Knobel contents himself with saying that the threefold repetition of the word \"holy\" serves to give it the greater emphasis. No doubt men are accustomed to say three times what they wish to say in an exhaustive and satisfying manner; for three is the number of expanded unity, of satisfied and satisfying development, of the key-note extended into the chord. But why is this? The Pythagoreans said that numbers were the first principle of all things; but the Scriptures, according to which God created the world in twice three days by ten mighty words, and completed it in seven days, teach us that God is the first principle of all numbers. The fact that three is the number of developed and yet self-contained unity, has its ultimate ground in the circumstance that it is the number of the trinitarian process; and consequently the trilogy (trisagion) of the seraphim (like that of the cherubim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whether Isaiah was aware of it or no, really pointed in the distinct consciousness of the spirits themselves to the truine God. ",
        "children": []
      }
    ]
  }
]