[{"num":27,"verse":"Have thou not glory of the morrow, that knowest not what thing the day coming shall bring forth. (Do not thou have glory over, or boast about, tomorrow, for thou knowest not what the coming day shall bring.)"},{"num":2,"verse":"Another man (Let another person), and not thy (own) mouth praise thee; a stranger, and not thy lips."},{"num":3,"verse":"A stone is heavy, and gravel is chargeous (and gravel is burdensome); but the ire of a fool is heavier than ever either."},{"num":4,"verse":"Ire hath no mercy, and strong vengeance breaking out hath no mercy; and who may suffer the fierceness of a spirit stirred? (and who can survive the fierceness of a stirred up, or a jealous, spirit?)"},{"num":5,"verse":"Better is open reproving, than a love hid. [Better is open amending, than hid love.] (Better be open rebukes, than hidden love.)"},{"num":6,"verse":"Better be the wounds of him that loveth, than the guileful kisses of him that hateth. (Better be the wounds of him who loveth, than the deceitful kisses of him who hateth.)"},{"num":7,"verse":"A man filled shall despise an honeycomb (A full person shall despise an honeycomb); but an hungry man shall take, yea, bitter thing for sweet."},{"num":8,"verse":"As a bird passing over from his nest, so is a man that forsaketh his place. (Like a bird passing over its own nest, is a man who is far from his own home.)"},{"num":9,"verse":"The heart delighteth in ointment, and diverse odours; and a soul is made sweet by the good counsels of a friend."},{"num":10,"verse":"Forsake thou not thy friend, and the friend of thy father; and enter thou not into the house of thy brother, in the day of thy torment. Better is a neighbour nigh, than a brother afar. (Desert thou not thy friend, or thy father’s friend; and enter thou not into the house of thy brother, on the day of thy torment. For a friend close-by is better, than thy own brother far away.)"},{"num":11,"verse":"My son, study thou about wisdom, and make thou glad mine heart; that thou mayest answer a word to a despiser (so that I can have an answer for any despiser, or for any mocker)."},{"num":12,"verse":"A fell man seeing evil was hid; little men of wit passing forth suffered harms. (A clever person, seeing evil approach, was hidden; but people of little wit, or of low intelligence, pass forth, or continue on, and suffer harm.)"},{"num":13,"verse":"Take thou away his cloth, that promised for a stranger; and take thou away a wed from him for an alien man. (Take thou away his cloak, who hath promised for a stranger; and take thou away a pledge from him for an unknown person.)"},{"num":14,"verse":"He that blesseth his neighbour with [a] great voice; and riseth by night, shall be like him that curseth (him). (He who blesseth his neighbour with a great voice, when he riseth at night, shall be likened to him who curseth him.)"},{"num":15,"verse":"Roofs dropping in the day of cold, and a woman full of chiding, be likened together. (Roofs dripping rain on a cold day, and a woman full of arguments, or of bickering, be quite similar.)"},{"num":16,"verse":"He that withholdeth her, (is) as if he holdeth (the) wind; and voideth the oil (out) of his right hand. (He who trieth to hold her, is like him who trieth to hold the wind; and like him who trieth to pick up oil with his fingers.)"},{"num":17,"verse":"Iron is whetted by iron; and a man whetteth the face of his friend. (Iron is sharpened by iron; and a man sharpeneth his friend’s mind.)"},{"num":18,"verse":"He that keepeth a fig tree (safe), shall eat the fruits thereof; and he that is a keeper of his lord, shall be glorified. (He who keepeth a fig tree safe, shall eat its fruits; and he who keepeth his lord safe, shall be honoured.)"},{"num":19,"verse":"As the cheers of men beholding (themselves) shine in waters; so the hearts of men be open to prudent men. (Like the faces of people beholding themselves shine in the water; so people’s hearts be open to prudent people.)"},{"num":20,"verse":"Hell and perdition shall not be filled; so and the eyes of men be not able to be (ful)filled. (Sheol, or the land of the dead, and perdition/Hell and perdition shall never be filled full; and the eyes, or the appetites, of people shall never be fulfilled, or satisfied.)"},{"num":21,"verse":"As silver is proved in a welling place, and gold is proved in a furnace; so a man is proved by the mouth of his praisers (so a person is proved, or assayed, by the words of his praisers)."},{"num":22,"verse":"Though thou poundedest a fool in a mortar, as with a pestle smiting above dried barley (like pounding dried barley with a pestle), his folly shall not be done away from him."},{"num":23,"verse":"Know thou diligently the cheer of thy beast; and behold thou thy flocks. (Diligently know the faces of thy beasts; and keep watch thou over thy flocks.)"},{"num":24,"verse":"For thou shalt not have power continually; but a crown shall be given to thee in generation and into generation. (For thou shalt not have wealth forever; nor shall a crown endure for generations and generations.)"},{"num":25,"verse":"Meadows be opened, and green herbs appeared; and hay is gathered from [the] hills (and the grass is gathered from the hills)."},{"num":26,"verse":"Lambs be to thy clothing; and kids be to the price of the field. (Lambs be for thy clothing; and goat-kids be worth the price of a field.)"},{"num":27,"verse":"The milk of goats suffice to thee for thy meats; into the necessary things of thine house, and to lifelode of thine handmaidens. (Goats’ milk suffice for thee for thy food; yea, for the necessities of thy house, and for the sustenance of thy handmaids, or of thy servantesses.)"}]