[{"num":25,"verse":"This message for all the people of Judah came from the Lord to Jeremiah during the fourth year of the reign of King Jehoiakim of Judah (son of Josiah). This was the year Nebuchadnezzar, king of Babylon, began his reign."},{"num":2,"verse":"For the past twenty-three years, Jeremiah said, from the thirteenth year of the reign of Josiah (son of Amon) king of Judah, until now, God has been sending me his messages. I have faithfully passed them on to you, but you haven’t listened. "},{"num":4,"verse":"Again and again down through the years, God has sent you his prophets, but you have refused to hear. "},{"num":5,"verse":"Each time the message was this: “Turn from the evil road you are traveling and from the evil things you are doing. Only then can you continue to live here in this land which the Lord gave to you and to your ancestors forever. "},{"num":6,"verse":"Don’t anger me by worshiping idols; but if you are true to me, then I’ll not harm you.” "},{"num":7,"verse":"But you won’t listen; you have gone ahead and made me furious with your idols. So you have brought upon yourselves all the evil that has come your way."},{"num":8,"verse":"And now the Lord God says: Because you have not listened to me, I will gather together all the armies of the north under Nebuchadnezzar, king of Babylon (I have appointed him as my deputy), and I will bring them all against this land and its people and against the other nations near you, and I will utterly destroy you and make you a byword of contempt forever. "},{"num":10,"verse":"I will take away your joy, your gladness, and your wedding feasts; your businesses shall fail, and all your homes shall lie in silent darkness. "},{"num":11,"verse":"This entire land shall become a desolate wasteland; all the world will be shocked at the disaster that befalls you. Israel and her neighboring lands shall serve the king of Babylon for seventy years."},{"num":12,"verse":"Then, after these years of slavery are ended, I will punish the king of Babylon* and his people for their sins; I will make the land of Chaldea an everlasting waste. "},{"num":13,"verse":"I will bring upon them all the terrors I have promised in this book—all the penalties announced by Jeremiah against the nations. "},{"num":14,"verse":"For many nations and great kings shall enslave the Chaldeans, just as they enslaved my people; I will punish them in proportion to their treatment of my people."},{"num":15,"verse":"For the Lord God said to me: “Take from my hand this wine cup filled to the brim with my fury, and make all the nations to whom I send you drink from it. "},{"num":16,"verse":"They shall drink from it and reel, crazed by the death blows I rain upon them.”"},{"num":17,"verse":"So I took the cup of fury from the Lord and made all the nations drink from it—every nation God had sent me to; "},{"num":18,"verse":"I went to Jerusalem and to the cities of Judah, and their kings and princes drank of the cup so that from that day until this they have been desolate, hated, and cursed, just as they are today. "},{"num":19,"verse":"I went to Egypt, and Pharaoh, his servants, the princes, and the people—they too drank from that terrible cup, along with all the foreign population living in his land. So did all the kings of the land of Uz and the kings of the Philistine cities: Ashkelon, Gaza, Ekron, and what remains of Ashdod, "},{"num":21,"verse":"and I visited the nations of Edom, Moab, and Ammon; "},{"num":22,"verse":"and all the kings of Tyre and Sidon, and the kings of the regions across the sea; "},{"num":23,"verse":"Dedan, Tema, and Buz, and the other heathen there; "},{"num":24,"verse":"and all the kings of Arabia and of the nomadic tribes of the desert; "},{"num":25,"verse":"and all the kings of Zimri, Elam, and Media; "},{"num":26,"verse":"and all the kings of the northern countries, far and near, one after the other; and all the kingdoms of the world. And finally, the king of Babylon himself drank from this cup of God’s wrath."},{"num":27,"verse":"Tell them, “The Lord of heaven’s armies, the God of Israel, says: Drink from this cup of my wrath until you are drunk and vomit and fall to rise no more, for I am sending terrible wars upon you.” "},{"num":28,"verse":"And if they refuse to accept the cup, tell them, “The Lord of heaven’s armies says you must drink it! You cannot escape! "},{"num":29,"verse":"I have begun to punish my own people, so should you go free? No, you shall not evade punishment. I will call for war against all the peoples of the earth.”"},{"num":30,"verse":"Therefore prophesy against them. Tell them the Lord will shout against his own from his holy temple in heaven and against all those living on the earth. He will shout as the harvesters do who tread the juice from the grapes. "},{"num":31,"verse":"That cry of judgment will reach the farthest ends of the earth, for the Lord has a case against all the nations—all mankind. He will slaughter all the wicked. "},{"num":32,"verse":"See, declares the Lord Almighty, the punishment shall go from nation to nation—a great whirlwind of wrath shall rise against the farthest corners of the earth. "},{"num":33,"verse":"On that day those the Lord has slain shall fill the earth from one end to the other. No one shall mourn for them nor gather up the bodies to bury them; they shall fertilize the earth."},{"num":34,"verse":"Weep and moan, O evil shepherds; let the leaders of mankind beat their heads upon the stones, for their time has come to be slaughtered and scattered; they shall fall like fragile women. "},{"num":35,"verse":"And you will find no place to hide, no way to escape."},{"num":36,"verse":"Listen to the frantic cries of the shepherds and to the leaders shouting in despair, for the Lord has spoiled their pastures. "},{"num":37,"verse":"People now living undisturbed will be cut down by the fierceness of the anger of the Lord. "},{"num":38,"verse":"He has left his lair like a lion seeking prey; their land has been laid waste by warring armies—because of the fierce anger of the Lord."}]