[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-8 Esther having had power with God, and prevailing, like Jacob, had power with men too. He that will lose his life for God, shall save it, or find it in a better life. The king encouraged her. Let us from this be encouraged to pray always to our God, and not to faint. Esther came to a proud, imperious man; but we come to the God of love and grace. She was not called, but we are; the Spirit says, Come, and the Bride says, Come. She had a law against her, we have a promise, many a promise, in favour of us; Ask, and it shall be given you. She had no friend to go with her, or to plead for her; on the contrary, he that was then the king's favourite, was her enemy; but we have an Advocate with the Father, in whom he is well pleased. Let us therefore come boldly to the throne of grace. God put it into Esther's heart to delay her petition a day longer; she knew not, but God did, what was to happen in that very night.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Over against the gate - This is the usual situation of the throne in the \"throne-room\" of an Oriental palace. The monarch, from his raised position, can see into the court through the doorway opposite to him, which is kept open. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. the king held out to Esther the golden sceptre that was in his hand—This golden scepter receives an interesting illustration from the sculptured monuments of Persia and Assyria. In the bas-reliefs of Persepolis, copied by Sir Robert Ker Porter, we see King Darius enthroned in the midst of his court, and walking abroad in equal state; in either case he carries in his right hand a slender rod or wand, about equal in length to his own height, ornamented with a small knob at the summit. In the Assyrian alabasters, those found at Nimroud as well as those from Khorsabad, \"the great king\" is furnished with the same appendage of royalty, a slender rod, but destitute of any knob or ornament. On the Khorsabad reliefs the rod is painted red, doubtless to represent gold; proving that \"the golden sceptre\" was a simple wand of that precious metal, commonly held in the right hand, with one end resting on the ground, and that whether the king was sitting or walking. \"The gold sceptre\" has received little alteration or modification since ancient times [Goss]. It was extended to Esther as a token not only that her intrusion was pardoned, but that her visit was welcome, and a favorable reception given to the suit she had come to prefer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "touched the top of the sceptre—This was the usual way of acknowledging the royal condescension, and at the same time expressing reverence and submission to the august majesty of the king.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The king held out the golden sceptre, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in testimony that he pardoned her presumption, and accepted her person, and was ready to grant her petition. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Esther touched the top of his sceptre, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in token of her thankful acceptance of the king’s great favour, and of her reverence and submission to his majesty, whereof that might possibly be a usual token, and it may be, at the king’s call and invitation to her to come near to him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it was so, when the king saw Esther the queen standing in the court, that she obtained favour in his sight,.... Which no doubt was of God, who has the hearts of kings in his hand, and turns them as he pleases; the king had not called her for thirty days past, or more, which showed coolness of affection to her, and now she transgressed a law by coming uncalled for, which might have provoked his wrath; and for a lesser matter than this was Vashti divorced; but yet his mind was inclined to her, and she appeared very amiable and pleasing to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the king held out to Esther the golden sceptre that was in his hand; as a token of his well pleasedness in her, and acceptance of her; and that no harm should come to her for transgressing the law: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so Esther drew near, and touched the top of the sceptre; as acknowledging his kindness, and her thankfulness for it, as well as subjection and obedience to him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so Esther drew near, and touched the top of the sceptre; as acknowledging his kindness, and her thankfulness for it, as well as subjection and obedience to him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it was so, when the king saw Esther the queen standing in the court, that she obtained favour in his sight: and the king {b} held out to Esther the golden sceptre that was in his hand. So Esther drew near, and touched the top of the sceptre.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And it was so, when the king saw Esther the queen standing in the court, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " she obtained favour in his sight: and the king ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " held out to Esther the golden sceptre that ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in his hand. So Esther drew near, and touched the top of the sceptre.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Which was a sign that her coming was agreeable to him, Es 4:11.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "held out to Esther the golden sceptre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "touched",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] So among the Greeks the suppliant laid hold of the person or the garments of the person to whom the appeal was directed. The Vulgate makes Esther kiss the sceptre (‘osculata est summitatem virgae eius’). For the Greek apocryphal Additions, presenting a detailed account of Esther’s preparations for the interview and of the interview itself, see chaps. 14, 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Esther...   touched the top of the sceptre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was, no doubt, the customary act by which the king's grace was, as it were, accepted and appropriated. It is analogous to that touch of the person or of the garments which secured the suppliant mercy among the Greeks. Esther 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the king saw Queen Esther standing in the court, she obtained favour in his eyes (see rem. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and he held out to her the golden sceptre that was in his hand; and Esther drew near and touched the top of the sceptre, probably kissed it, as the Vulgate renders the word.",
        "children": []
      }
    ]
  }
]