[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-8 Esther having had power with God, and prevailing, like Jacob, had power with men too. He that will lose his life for God, shall save it, or find it in a better life. The king encouraged her. Let us from this be encouraged to pray always to our God, and not to faint. Esther came to a proud, imperious man; but we come to the God of love and grace. She was not called, but we are; the Spirit says, Come, and the Bride says, Come. She had a law against her, we have a promise, many a promise, in favour of us; Ask, and it shall be given you. She had no friend to go with her, or to plead for her; on the contrary, he that was then the king's favourite, was her enemy; but we have an Advocate with the Father, in whom he is well pleased. Let us therefore come boldly to the throne of grace. God put it into Esther's heart to delay her petition a day longer; she knew not, but God did, what was to happen in that very night.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The banquet of wine - After the meats were removed, it was customary in Persia to continue the banquet for a considerable time with fruits and wine. During this part of the feast, the king renewed his offer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. let the king and Haman come this day unto the banquet that I have prepared for him—There was great address in this procedure of Esther's; for, by showing such high respect to the king's favorite, she would the better insinuate herself into the royal affections; and gain a more suitable opportunity of making known her request.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then answered Esther and said, my petition and my request is. What she should for the present make; the principal one she had to ask, for wise reasons, she still deferred. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then answered Esther, and said, My petition and my request is;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7, 8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Esther’s form of reply suggests that for the moment she meant to declare her grief, but suddenly breaks off for some reason which remains hidden from the reader. She virtually acknowledges, however, that she has a weighty petition to present, and promises that, if her two guests will repeat their visit under similar circumstances next day, she will postpone no longer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My petition and my request is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Esther still hesitates to prefer her real request. We are not likely to be able in the nineteenth century to understand all the motives that actuated her, or all the workings of her mind. Perhaps nothing kept her back but the natural fear of a repulse, and a desire to defer the evil day; perhaps she saw some real advantage in putting off the determination of the matter. At any rate, she again declined to declare herself, and merely gave her two guests a second invitation for the ensuing evening. She concludes, however, with a promise that she will ask no further respite. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will do to-morrow as the king hath said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will prefer my real request; I will ask the favour which was in my thoughts when I adventured myself in the inner court without having received an invitation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " CHAPTER 5:9-14 HAMAN, EXULTING AT THESE SIGNS OF ROYAL FAVOUR, IS THE MORE EXASPERATED AT MORDECAI'S CONTEMPT OF HIM. AT THE BIDDING OF HIS WIFE HE RESOLVES TO IMPALE MORDECAI, AND CAUSES A LOFTY CROSS TO BE ERECTED FOR THE PURPOSE (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 5:9-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The favour shown him by the king and queen in admitting him to the very close intimacy implied in their making him the sole companion of their private hours, produced in Haman a dangerous exaltation of spirit. He seemed to himself to have attained the pinnacle of a subject's greatness. Returning home in this frame of mind, and having to pass through the gate where Mordecai was on duty, he was more vexed than usual with that official's disrespect, which was more pointed and open than it had ever been before (ver. 9). However, he took no immediate notice of the porter's conduct (ver. 10), but proceeded to his own house, where he assembled his friends, and communicated to them, and at the same time to Zeresh his wife, the circumstances which had so greatly raised his spirits. The climax was that \"Esther the queen had let no man come in with the king unto the banquet that she had prepared but himself; nay, more, he was again invited on the morrow to banquet with her and the king\" (ver. 12). He added, however, Mordecai's insult remaining fresh in his recollection, that all his glory, all his honours, availed him nothing - were as nothing in his eyes - so long as he was condemned to see Mordecai the Jew every time that he passed though the palace gate, and to be treated by him with contempt and contumely (ver. 13). Upon this Zeresh made, and Haman's friends approved, a proposal that a lofty cross should be at once erected in the court of Haman's house, on which Mordecai should be impaled, with the king's consent, as soon as it was finished. Haman agreed to this, recovered his spirits, and gave orders for the cross to be made (ver. 14). Esther 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Esther answered: \"My petition and my request - if I have found favour in the sight of the king, and if it please the king to grant my petition and to do my request, let the king and Haman come to the banquet that I shall prepare for them, and to-morrow I will do as the king hath said,\" i.e., make known my request. Though the king had, in the midst of the gaiety, asked what was Esther's request, she did not esteem the time an appropriate one for expressing it. She begins: my petition and my request, - but then stops, and says only, if the king will do her the favour to come with Haman to a banquet again on the morrow, she will then bring forward her petition. Esther invited Haman with the king on both occasions, that, as Calovius remarks, eum apud regem praesentem accusaret decreti surrepti contra suos populares nomine, et in os omnes cavillandi vias ei praecluderet. ",
        "children": []
      }
    ]
  }
]