[{"header":"The Joys of Walking Out the Truth"},{"num":1,"verse":"The elder."},{"num":2,"verse":"Loved ones, I pray that all may go well with you and that you may be in good health, just as it is well with your soul. "},{"num":3,"verse":"For I was overjoyed when some brethren came and testified of the truth in you—how you are walking in truth. "},{"num":4,"verse":"I have no greater joy than this—to hear that my children are walking in the truth."},{"header":"Support Faithful Kingdom Truth Tellers"},{"num":5,"verse":"Loved ones, you are acting faithfully in whatever you do for the brethren and especially for strangers."},{"num":6,"verse":" They have testified to your love before Messiah’s community. You will do well to send them on their way in a manner worthy of God. "},{"num":7,"verse":"For on behalf of the Name they went out, accepting nothing from the pagans. "},{"num":8,"verse":"Therefore we ought to support such people, so we might become co-workers in the truth."},{"header":"The Lust for Power Condemned"},{"num":9,"verse":"I wrote something to Messiah’s community, but Diotrephes, who loves to be first among them, doesn’t welcome us. "},{"num":10,"verse":"So if I do come, I will call attention to what he is doing—slandering us with wicked words. Not even content with that, he refuses to welcome the brethren, and even forbids those who want to do so—throwing them out of the community!"},{"header":"Do Good Like God Does"},{"num":11,"verse":"Loved ones, do not imitate what is evil but what is good. The one who does good is of God; the one who does evil has not seen God."},{"header":"Virtue Is Honorable"},{"num":12,"verse":"Demetrius has a good testimony from everyone, even from the truth itself. We also vouch for him—and you know that our testimony is true."},{"header":"Fellowship Is Desirable"},{"num":13,"verse":"I have much to write you, but I don’t want to write to you with ink and pen. "},{"num":14,"verse":"But I hope to see you soon, and we will speak face to face."},{"num":15,"verse":"Shalom aleichem. The friends here send their greetings. Greet the friends there by name."}]