[{"num":10,"verse":"Adonai said to Moshe, "},{"num":2,"verse":"“Make two trumpets; make them of hammered silver. Use them for summoning the community and for sounding the call to break camp and move on. "},{"num":3,"verse":"When they are sounded, the entire community is to assemble before you at the entrance to the tent of meeting. "},{"num":4,"verse":"If only one is sounded, then just the leaders, the heads of the clans of Isra’el, are to assemble before you."},{"num":5,"verse":"“When you sound an alarm, the camps to the east will commence traveling. "},{"num":6,"verse":"When you sound a second alarm, the camps to the south will set out; they will sound alarms to announce when to travel. "},{"num":7,"verse":"However, when the community is to be assembled, you are to sound; but don’t sound an alarm. "},{"num":8,"verse":"It will be the sons of Aharon, the cohanim, who are to sound the trumpets; this will be a permanent regulation for you through all your generations."},{"num":9,"verse":"“When you go to war in your land against an adversary who is oppressing you, you are to sound an alarm with the trumpets; then you will be remembered before Adonai your God, and you will be saved from your enemies."},{"num":10,"verse":"“Also on your days of rejoicing, at your designated times and on Rosh-Hodesh, you are to sound the trumpets over your burnt offerings and over the sacrifices of your peace offerings; these will be your reminder before your God. I am Adonai your God.”"},{"num":11,"verse":"(v) On the twentieth day of the second month of the second year, the cloud was taken up from over the tabernacle of the testimony; "},{"num":12,"verse":"and the people of Isra’el moved out in stages from the Sinai Desert. The cloud stopped in the Pa’ran Desert."},{"num":13,"verse":"So they set out on their first journey, in keeping with Adonai’s order through Moshe. "},{"num":14,"verse":"In the lead was the banner of the camp of the descendants of Y’hudah, whose companies moved forward; over his company was Nachshon the son of ‘Amminadav. "},{"num":15,"verse":"Over the company of the tribe of the descendants of Yissakhar was N’tan’el the son of Tzu‘ar. "},{"num":16,"verse":"Over the company of the descendants of Z’vulun was Eli’av the son of Helon."},{"num":17,"verse":"Then the tabernacle was taken down; and the descendants of Gershon and the descendants of M’rari set out, carrying the tabernacle."},{"num":18,"verse":"Next, the banner of the camp of Re’uven moved forward by companies; over his company was Elitzur the son of Sh’de’ur. "},{"num":19,"verse":"Over the company of the tribe of the descendants of Shim‘on was Shlumi’el the son of Tzurishaddai. "},{"num":20,"verse":"Over the company of the descendants of Gad was Elyasaf the son of De‘u’el."},{"num":21,"verse":"Then the descendants of K’hat set out, carrying the sanctuary, so that [at the next camp] the tabernacle could be set up before they arrived."},{"num":22,"verse":"The banner of the camp of the descendants of Efrayim moved forward by companies; over his company was Elishama the son of ‘Ammihud. "},{"num":23,"verse":"Over the company of the tribe of the descendants of M’nasheh was Gamli’el the son of P’dahtzur. "},{"num":24,"verse":"Over the company of the descendants of Binyamin was Avidan the son of Gid‘oni."},{"num":25,"verse":"The banner of the camp of the descendants of Dan, forming the rearguard for all the camps, moved forward by companies; over his company was Achi‘ezer the son of ‘Ammishaddai. "},{"num":26,"verse":"Over the company of the tribe of the descendants of Asher was Pag‘i’el the son of ‘Okhran. "},{"num":27,"verse":"Over the company of the descendants of Naftali was Achira the son of ‘Enan."},{"num":28,"verse":"This is how the people of Isra’el traveled by companies; thus they moved forward."},{"num":29,"verse":"(S: vi) Moshe said to Hovav the son of Re‘u’el the Midyani, Moshe’s father-in-law, “We are traveling to the place about which Adonai said, ‘I will give it to you.’ Come with us, and we will treat you well, because Adonai has promised good things to Isra’el.” "},{"num":30,"verse":"But he replied, “I will not go; I would rather go back to my own country and my own kinsmen.” "},{"num":31,"verse":"Moshe continued, “Please don’t leave us, because you know that we have to camp in the desert, and you can serve as our eyes. "},{"num":32,"verse":"If you do go with us, then whatever good Adonai does for us, we will do the same for you.”"},{"num":33,"verse":"So they set out from Adonai’s mountain and traveled for three days. Ahead of them on this three-day journey went the ark of Adonai’s covenant, searching for a new place to stop. "},{"num":34,"verse":"The cloud of Adonai was over them during the day as they set out from the camp. "},{"num":35,"verse":"(A: vi) When the ark moved forward, Moshe said,"},{"num":36,"verse":"When it stopped, he said,"}]