[{"num":10,"verse":"2 The use of the silver trumpets. 11 The Israelites depart from Sinai. 14 The captains of the host are numbered. 30 Hobab refuseth to go with Moses his son-in-law."},{"num":1,"verse":"And the Lord spake unto Moses, saying,"},{"num":2,"verse":"Make thee two trumpets of silver: of an whole piece shalt thou make them, that thou mayest use them for the assembling of the Congregation, and for the departure of the camp."},{"num":3,"verse":"And when they shall blow with them, all the Congregation shall assemble to thee, before the door of the Tabernacle of the Congregation."},{"num":4,"verse":"But if they blow with one, then the Princes, or heads over the thousands of Israel shall come unto thee."},{"num":5,"verse":"But if ye blow an alarm, then the camp of them that pitch on the East part, shall go forward."},{"num":6,"verse":"If ye blow an alarm the second time, then the host of them that lie on the South side, shall march: for they shall blow an alarm when they remove."},{"num":7,"verse":"But in the assembling the Congregation, ye shall blow without an alarm."},{"num":8,"verse":"And the sons of Aaron the Priest shall blow the trumpets, and ye shall have them as a law forever in your generations."},{"num":9,"verse":"And when ye go to war in your land against the enemy that vexeth you, ye shall blow an alarm with the trumpets, and ye shall be remembered before the Lord your God, and shall be saved from your enemies."},{"num":10,"verse":"Also in the day of your gladness, and in your feast days, and in the beginning of your months, ye shall also blow the trumpets over your burnt sacrifices, and over your peace offerings, that they may be a remembrance for you before your God: I am the Lord your God."},{"num":11,"verse":"¶ And in the second year, in the second month, and in the twentieth day of the month, the cloud was taken up from the Tabernacle of the Testimony."},{"num":12,"verse":"And the children of Israel departed on their journeys out of the desert of Sinai, and the cloud rested in the wilderness of Paran."},{"num":13,"verse":"So they first took their journey at the commandment of the Lord by the hand of Moses."},{"num":14,"verse":"¶ In the first place went the standard of the host of the children of Judah according to their armies: and Nahshon the son of Amminadab was over his band."},{"num":15,"verse":"And over the band of the tribe of the children of Issachar was Nethanel the son of Zuar."},{"num":16,"verse":"And over the band of the tribe of the children of Zebulun was Eliab the son of Helon."},{"num":17,"verse":"When the Tabernacle was taken down, then the sons of Gershon and the sons of Merari went forward bearing the Tabernacle."},{"num":18,"verse":"¶ After, departed the standard of the host of Reuben, according to their armies, and over his band was Elizur the son of Shedeur."},{"num":19,"verse":"And over the band of the tribe of the children of Simeon was Shelumiel the son of Zurishaddai."},{"num":20,"verse":"And over the band of the tribe of the children of Gad was Eliasaph the son of Deuel."},{"num":21,"verse":"The Kohathites also went forward and bare the Sanctuary, and the former did set up the Tabernacle against they came."},{"num":22,"verse":"¶ Then the standard of the host of the children of Ephraim went forward according to their armies, and over his band was Elishama the son of Ammihud."},{"num":23,"verse":"And over the band of the tribe of the sons of Manasseh was Gamaliel the son of Pedahzur."},{"num":24,"verse":"And over the band of the tribe of the sons of Benjamin was Abidan the son of Gideoni."},{"num":25,"verse":"¶ Last, the standard of the host of the children of Dan marched, gathering all the hosts according to their armies: and over his band was Ahiezer the son of Ammishaddai."},{"num":26,"verse":"And over the band of the tribe of the children of Asher was Pagiel the son of Ocran."},{"num":27,"verse":"And over the band of the tribe of the children of Naphtali was Ahira the son of Enan."},{"num":28,"verse":"These were the removings of the children of Israel according to their armies, when they marched."},{"num":29,"verse":"After, Moses said unto Hobab the son of Reuel the Midianite, the father-in-law of Moses, We go into the place, of which the Lord said, I will give it you. Come thou with us, and we will do thee good: for the Lord hath promised good unto Israel."},{"num":30,"verse":"And he answered him, I will not go: but I will depart to mine own country, and to my kindred."},{"num":31,"verse":"Then he said, I pray thee, leave us not: for thou knowest our camping places in the wilderness: therefore thou mayest be our guide."},{"num":32,"verse":"And if thou go with us, what goodness the Lord shall show unto us, the same will we show unto thee."},{"num":33,"verse":"¶ So they departed from the mount of the Lord, three days’ journey: and the Ark of the covenant of the Lord went before them in the three days’ journey, to search out a resting place for them."},{"num":34,"verse":"And the cloud of the Lord was upon them by day, when they went out of the camp."},{"num":35,"verse":"And when the Ark went forward, Moses said, Rise up Lord, and let thine enemies be scattered, and let them that hate thee, flee before thee."},{"num":36,"verse":"And when it rested, he said, Return, O Lord, to the many thousands of Israel."}]