[{"header":"The Silver Trumpets"},{"num":10,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Make two trumpets of hammered silver. Use them to call the people together and to march out of camp. "},{"num":3,"verse":"When both trumpets are blown, the people should gather. They should gather before you at the entrance to the Meeting Tent. "},{"num":4,"verse":"If you blow only one trumpet, the leaders should meet before you. "},{"num":5,"verse":"When you blow the trumpets once, the tribes camping on the east should move. "},{"num":6,"verse":"When you blow them again, the tribes camping on the south should move. The sound will tell them to move. "},{"num":7,"verse":"When you want to gather the people, blow the trumpets. But don’t blow them the same way."},{"num":8,"verse":"“Aaron’s sons, the priests, should blow the trumpets. This is a law for you and your descendants from now on. "},{"num":9,"verse":"You might be fighting an enemy who attacks you in your own land. Blow the trumpets. The Lord your God will remember you. He will save you from your enemies. "},{"num":10,"verse":"Also blow your trumpets at happy times. Blow them during your feasts and at New Moon festivals. Blow them over your burnt offerings and fellowship offerings. They will help you remember your God. I am the Lord your God.”"},{"header":"The Israelites Move Camp"},{"num":11,"verse":"The cloud lifted from the Tent of the Agreement. This was on the twentieth day of the second month of the second year. "},{"num":12,"verse":"So the Israelites moved from the Desert of Sinai. They moved until the cloud stopped in the Desert of Paran. "},{"num":13,"verse":"This was their first time to move. They did it as the Lord had commanded Moses."},{"num":14,"verse":"The divisions from the camp of Judah moved first under their flag. Nahshon son of Amminadab was the commander. "},{"num":15,"verse":"Nethanel son of Zuar was over the division of the tribe of Issachar. "},{"num":16,"verse":"Eliab son of Helon was over the division of the tribe of Zebulun. "},{"num":17,"verse":"Then the Meeting Tent was taken down. The Gershonites and Merarites, who carried it, moved next."},{"num":18,"verse":"Then came the divisions from the camp of Reuben under their flag. Elizur son of Shedeur was the commander. "},{"num":19,"verse":"Shelumiel son of Zurishaddai was over the division of the tribe of Simeon. "},{"num":20,"verse":"Eliasaph son of Deuel was over the division of the tribe of Gad. "},{"num":21,"verse":"Then came the Kohathites. They carried the holy things. The Holy Tent was to be set up before they arrived."},{"num":22,"verse":"Next came the divisions from the camp of Ephraim under their flag. Elishama son of Ammihud was the commander. "},{"num":23,"verse":"Gamaliel son of Pedahzur was over the division of the tribe of Manasseh. "},{"num":24,"verse":"Abidan son of Gideoni was over the division of the tribe of Benjamin."},{"num":25,"verse":"The last ones were the rear guard for all the tribes. These were the divisions from the camp of Dan under their flag. Ahiezer son of Ammishaddai was the commander. "},{"num":26,"verse":"Pagiel son of Ocran was over the division of the tribe of Asher. "},{"num":27,"verse":"Ahira son of Enan was over the division of the tribe of Naphtali. "},{"num":28,"verse":"This was the order the Israelite divisions marched in when they moved."},{"num":29,"verse":"Hobab was the son of Reuel the Midianite. Reuel, who is also called Jethro, was Moses’ father-in-law. Moses said to Hobab, “We are moving to the land God promised to give us. Come with us. We will be good to you. The Lord has promised good things to Israel.”"},{"num":30,"verse":"But Hobab answered, “No, I will not go. I will go back to my own land where I was born.”"},{"num":31,"verse":"But Moses said, “Please don’t leave us. You know where we can camp in the desert. You can be our guide. "},{"num":32,"verse":"Come with us. We will share with you all the good things the Lord gives us.” "},{"num":33,"verse":"So they left the mountain of the Lord. The Ark of the Lord’s Covenant went in front of the people. For three days they looked for a place to camp. "},{"num":34,"verse":"The Lord’s cloud was over them during the day when they left their camp."},{"num":35,"verse":"When the Ark of the Covenant left the camp, Moses always said,"},{"num":36,"verse":"And when the Ark of the Covenant was set down, Moses always said,"}]