[{"num":15,"verse":"When God’s spirit came upon Azariah, Oded’s son,"},{"num":2,"verse":"he confronted Asa: “Listen to me, Asa and all Judah and Benjamin,” he said. “The Lord is with you as long as you are with him. If you seek him, he will be found by you; but if you abandon him, he will abandon you."},{"num":3,"verse":"For a long time Israel was without the true God, without a priest to teach them, and without the Instruction."},{"num":4,"verse":"But in their time of trouble they turned to the Lord, Israel’s God. They sought him and found him!"},{"num":5,"verse":"At that time, it wasn’t safe to travel because great turmoil affected all the inhabitants of the area."},{"num":6,"verse":"Nation was crushed by nation and city by city, as God troubled them with every kind of problem."},{"num":7,"verse":"But as for you, be brave and don’t lose heart, because your work will be rewarded!”"},{"header":"Asa’s reforms"},{"num":8,"verse":"As soon as Asa heard these words and the prophecy of Azariah, Oded’s son, he felt brave and removed the detestable idols from all of Judah and Benjamin, as well as from the cities he had captured in Ephraim’s highlands, and he repaired the Lord’s altar that stood before the Lord’s entrance hall."},{"num":9,"verse":"Then Asa gathered all Judah and Benjamin, along with those who were living among them as immigrants from Ephraim, Manasseh, and Simeon, because many people from Israel had joined up with him when they saw that the Lord his God was with him."},{"num":10,"verse":"They gathered in Jerusalem in the third month of the fifteenth year of Asa’s rule."},{"num":11,"verse":"On that day they sacrificed to the Lord part of the loot they had taken: seven hundred oxen and seven thousand sheep."},{"num":12,"verse":"They made a covenant to seek the Lord, the God of their ancestors, with all their heart and all their being."},{"num":13,"verse":"They agreed that anyone who refused to seek the Lord, Israel’s God, would be put to death, whether young or old, male or female."},{"num":14,"verse":"They swore this to the Lord with a loud voice, shouts of joy, and blasts from trumpets and horns."},{"num":15,"verse":"All Judah was delighted with the solemn pledge because they had sworn it with all their hearts. When they enthusiastically sought God, he was found by them, and the Lord gave them peace on every side."},{"num":16,"verse":"Asa the king even removed his grandmother Maacah from the position of queen mother because she had made an image of Asherah. Asa cut down her image, pulverized it, and burned it in the Kidron Valley."},{"num":17,"verse":"Although the shrines weren’t removed from Israel, Asa nevertheless remained committed with all his heart throughout his life."},{"num":18,"verse":"He brought into God’s temple the various silver and gold objects that he and his father had dedicated."},{"num":19,"verse":"There was no war until the thirty-fifth year of Asa’s rule."}]