[{"header":"Prophets Encourage Further Reforms"},{"num":15,"verse":"The Ruach Elohim came upon Azariah the son of Oded. "},{"num":2,"verse":"He went out to meet Asa, and said to him, “Listen to me Asa, all Judah and Benjamin. Adonai is with you as long as you are with Him. If you seek Him, He will be found by you. But if you forsake Him, He will spurn you. "},{"num":3,"verse":"For many days Israel was without the true God, without a teaching kohen and without Torah. "},{"num":4,"verse":"But in their distress they turned to Adonai, the God of Israel, and sought Him, and He was found by them. "},{"num":5,"verse":"In those times there was no shalom for anyone coming or going, for there were many conflicts among all the inhabitants of the lands. "},{"num":6,"verse":"Nation was crushed by nation and city by city, for God troubled them with every kind of distress. "},{"num":7,"verse":"But you, chazak! Do not let your hands be slack for there is reward for your labor.”"},{"num":8,"verse":"When Asa heard these words as well as the prophecy of the prophet Oded, he took courage and removed the abominations from all the land of Judah and Benjamin and from the towns that he had seized in the hill country of Ephraim. He also repaired Adonai’s altar that was in front of Adonai’s entryway. "},{"num":9,"verse":"He gathered all Judah and Benjamin, as well as those dwelling with them from Ephraim, Manasseh and Simeon—for many had defected to him from Israel when they saw that Adonai his God was with him. "},{"num":10,"verse":"So they assembled at Jerusalem in the third month of the fifteenth year of the reign of Asa. "},{"num":11,"verse":"On that day they sacrificed to Adonai 700 bulls and 7,000 sheep from the spoil that they had brought. "},{"num":12,"verse":"They entered into a covenant to seek Adonai, the God of their fathers, with all their heart and soul. "},{"num":13,"verse":"Whoever would not seek Adonai, God of Israel, would be put to death, whether small or great, man or woman. "},{"num":14,"verse":"They also made an oath to Adonai with a loud voice, with shouting, with trumpets and with shofarot. "},{"num":15,"verse":"All Judah rejoiced over the oath, for they had sworn with all their heart and sought Him with all their will and He was found by them. Then Adonai gave them rest all around. "},{"num":16,"verse":"He also deposed Maacah, the mother of King Asa, from being queen because she had made an abominable image for Asherah. Asa cut down her abominable image, crushed it and burned it in the Kidron Valley."},{"num":17,"verse":"Though the high places were not removed from Israel, still Asa’s heart was completely committed to Adonai all his days. "},{"num":18,"verse":"He brought into the House of God his father’s consecrated articles, as well as his consecrated articles of silver and gold, and utensils. "},{"num":19,"verse":"So there was no war until the thirty-fifth year of Asa’s reign."}]