[{"num":15,"verse":"The Spirit of the True God gave a prophecy to Azariah, the son of Oded, who relayed it to Asa and his people."},{"num":8,"verse":"Asa responded to the message of Azariah the son of Oded the prophet with that courage and strength. He removed the abominable idols from the Southern Kingdom of Judah and Benjamin and from the cities he had conquered from the Northern Kingdom in the hill country of Ephraim. Then he repaired the Eternal’s altar in front of the porch of His temple. "},{"num":9,"verse":"During the Festival of Weeks in the 3rd month of the 15th year of his reign, Asa assembled in Jerusalem all of Judah and Benjamin and those from the Northern territories of Ephraim, Manasseh, and Simeon who had moved to the Southern Kingdom when they realized the Eternal One, his True God, was with Asa. "},{"num":11,"verse":"That day, they sacrificed to the Eternal 700 oxen and 7,000 sheep from the wealth they gained during their war against Cush, "},{"num":12,"verse":"signifying their covenant agreeing to seek the Eternal One, True God of their ancestors, in everything they did. "},{"num":13,"verse":"They decided that anyone (man or woman, young or old, important or insignificant) who would not seek the Eternal One, the True God of Israel, should be executed in accordance with His command, "},{"num":14,"verse":"and they promised this to the Eternal with loud voices, shouting, trumpets, and horns. "},{"num":15,"verse":"All of the Southern Kingdom rejoiced at their decisions and their vow because they had acted on Azariah’s prophecy: they had promised to look for Him and only Him earnestly and entirely, and they knew He would let them find Him. In response to the promises, the Eternal gave peace in their lives and with their neighbors."},{"num":16,"verse":"Asa continued his reforms even after this. He also removed his own mother, Maacah, from her position as queen mother because she had continued in her idol worship, making a carved image of Asherah. Asa cut down the cultic statue, crushed it, and burned it beside the brook Kidron. "},{"num":17,"verse":"In spite of his work against idol worship, he did not remove the high places in the Northern Kingdom. Asa followed His ways throughout his reign, "},{"num":18,"verse":"and he returned the silver, gold, and utensils which he and his father had dedicated to the house of the True God. "},{"num":19,"verse":"Until the 35th year of his reign, the Southern Kingdom did not fight any wars."}]