[{"num":6,"verse":"Thus de as  coworkers synergeō with  him,  · kai we  urge parakaleō you hymeis not mē to  receive dechomai the ho grace charis of ho God theos in eis vain kenos. "},{"num":2,"verse":"For gar he  says legō, “ In  the  time kairos of  my  favor dektos I  heard epakouō you sy,  · kai in en the  day hēmera of  salvation sōtēria I  helped boētheō you sy.”  Behold idou,  now nyn is the  acceptable euprosdektos time kairos;  behold idou,  now nyn is the  day hēmera of  salvation sōtēria! "},{"num":3,"verse":"We  do didōmi not mēdeis put didōmi a  stumbling  block proskopē in en anyone’ s mēdeis way ,  so  that hina our ho ministry diakonia may  not mē be  faulted mōmaomai. "},{"num":4,"verse":"Rather alla,  as hōs servants diakonos of  God theos,  we  commend synistēmi ourselves heautou in en every pas way :  in en great polys endurance hypomonē,  in en times  of  affliction thlipsis,  hardship anankē, and  distress stenochōria; "},{"num":5,"verse":"in en beatings plēgē,  in en imprisonments phylakē,  in en riots akatastasia,  in en labors kopos,  in en times  of  sleeplessness agrypnia and  hunger nēsteia; "},{"num":6,"verse":"by en purity hagnotēs,  by en knowledge gnōsis,  by en patience makrothumia,  by en kindness chrēstotēs,  by en the  Holy hagios Spirit pneuma,  by en sincere anypokritos love agapē; "},{"num":7,"verse":"by en the  word logos of  truth alētheia,  by en the  power dynamis of  God theos;  with dia the ho weapons hoplon of ho righteousness dikaiosynē both  for  the ho right dexios hand  and kai for  the  left aristeros; "},{"num":8,"verse":"through dia glory doxa and kai dishonor atimia,  through dia slander dysphēmia and kai praise euphēmia;  as hōs deceivers planos,  and kai yet  true alēthēs men ; "},{"num":9,"verse":"as hōs unknown agnoeō,  and kai yet  well-known epiginōskō;  as hōs dying apothnēskō,  and kai yet — look idou!— we  continue  to  live zaō;  as hōs scourged paideuō,  and kai yet  not mē killed thanatoō; "},{"num":10,"verse":"as hōs sorrowing lypeō,  yet de always aei rejoicing chairō;  as hōs poor ptōchos,  yet de making  many polys rich ploutizō;  as hōs having echō nothing mēdeis,  and kai yet  possessing katechō everything pas. "},{"num":11,"verse":"We  have  opened anoigō · ho our hēmeis mouth stoma freely  to pros you hymeis,  Corinthians Korinthios;  · ho our hēmeis heart kardia has  been  opened  wide platynō. "},{"num":12,"verse":"We are  not ou withholding stenochōreō our hēmeis affection splanchnon from  you ,  but de you  are  withholding stenochōreō yours hymeis from  us.  · ho"},{"num":13,"verse":"· ho Now de as a  fair autos exchange antimisthia— I  speak legō as hōs to  children teknon— open  wide platynō your hymeis hearts to us  also kai. "},{"num":14,"verse":"Do  not mē be ginomai unevenly  yoked heterozygeō with  unbelievers apistos;  for gar what tis is there in  common metochē between  righteousness dikaiosynē and kai lawlessness anomia?  Or ē what tis fellowship koinōnia has  light phōs with pros darkness skotos? "},{"num":15,"verse":"What tis · de harmony symphōnēsis is there  between pros Christ Christos and  Belial Beliar?  Or ē what tis does a  believer pistos have in  common meris with meta an  unbeliever apistos? "},{"num":16,"verse":"What tis · de agreement synkatathesis can the  temple naos of  God theos have  with meta idols eidōlon?  For gar we hēmeis are eimi the  temple naos of  the  living zaō God theos;  just  as kathōs God theos said legō:  · ho “ I  will  dwell enoikeō in en their autos midst  and kai walk emperipateō among  them;  · kai I  will  be eimi their autos God theos and kai they autos will  be eimi my egō people laos.” "},{"num":17,"verse":"Therefore dio, “ come  out exerchomai from ek their autos midst mesos and kai be  separate aphorizō,”  says legō the  Lord kyrios,  and kai “ touch haptō no mē unclean akathartos thing ;  then  I kagō will  receive eisdechomai you hymeis, "},{"num":18,"verse":"and kai I  will  be eimi a  father patēr to  you hymeis,  and kai you hymeis will  be eimi sons hyios and kai daughters thugatēr to  me egō,”  says legō the  Lord kyrios Almighty pantokratōr. "}]