[{"num":6,"verse":"We as helpers therefore exhort you, do not receive the grace of God in vain. "},{"num":2,"verse":"For he says: I have heard you in a favoured time, and in the day of salvation I have succoured you. Behold, now is that well-favoured time; behold, now is that day of salvation. "},{"num":3,"verse":"Let us give no one occasion for evil, so that in our service no fault may be found, "},{"num":4,"verse":"but in all things let us behave ourselves as the ministers of God in much patience – in afflictions, in hardship, in anguish, "},{"num":5,"verse":"in stripes, in prison, in strife, in labour, in sleeplessness, in hunger; "},{"num":6,"verse":"in pureness, in knowledge, in longsuffering, in kindness, in the Holy Spirit, in love unfeigned, "},{"num":7,"verse":"in the words of truth; in the power of God, with the armour of righteousness on the right hand and on the left; "},{"num":8,"verse":"in honour and dishonour, in evil report and good report, as deceivers and yet true, "},{"num":9,"verse":"as unknown and yet known. As dying, and behold, we live yet; as chastened, and not killed; "},{"num":10,"verse":"as sorrowing, and yet always merry; as poor, and yet making many rich; as having nothing, and yet possessing all things."},{"num":11,"verse":"O ye Corinthians, we pursue you with many words. Our hearts yearn to you. "},{"num":12,"verse":"You are not shut out in us, but are shut away in your own selves. "},{"num":13,"verse":"I promise you like reward with me, as to my children. So set yourselves free, "},{"num":14,"verse":"and bear not a stranger’s yoke with the unbelievers. For what fellowship has righteousness with unrighteousness? What communion has light with darkness? "},{"num":15,"verse":"What concord has Christ with Belial? Or what part has he who believes with an infidel? "},{"num":16,"verse":"How does the temple of God agree with idols? And you are the temple of the living God, as God said: I will dwell among them and walk among them, and will be their God, and they shall be my people. "},{"num":17,"verse":"Therefore: Come out from among them, and separate yourselves (says the Lord), and touch no unclean thing, and I will receive you, "},{"num":18,"verse":"and will be a father to you, and you will be my sons and daughters, says the Lord Almighty."}]