[{"num":50,"verse":"Yosef fell on his father’s face, wept over him and kissed him. "},{"num":2,"verse":"Then Yosef ordered the physicians in his service to embalm his father. So the physicians embalmed Isra’el. "},{"num":3,"verse":"Forty days were spent at this, the normal amount of time for embalming. Then the Egyptians mourned for him seventy days."},{"num":4,"verse":"When the period of mourning was over, Yosef addressed to the household of Pharaoh: “I would like to ask a favor. Tell Pharaoh, "},{"num":5,"verse":"‘My father had me swear an oath. He said, “I am going to die. You are to bury me in my grave, which I dug for myself in the land of Kena‘an.” Therefore, I beg you, let me go up and bury my father; I will return.’” "},{"num":6,"verse":"Pharaoh responded, “Go up and bury your father, as he made you swear.”"},{"num":7,"verse":"So Yosef went up to bury his father. With him went all Pharaoh’s servants, the leaders of his household and the leaders of the land of Egypt, "},{"num":8,"verse":"along with the entire household of Yosef, his brothers and his father’s household; only their little ones, their flocks and their cattle did they leave in the land of Goshen. "},{"num":9,"verse":"Moreover, there went up with him both chariots and horsemen — it was a very large caravan."},{"num":10,"verse":"When they arrived at the threshing-floor in Atad, beyond the Yarden, they raised a loud and bitter lamentation, mourning for his father seven days. "},{"num":11,"verse":"When the local inhabitants, the Kena‘ani, saw the mourning on the floor of Atad they said, “How bitterly the Egyptians are mourning!” This is why the place was given the name Avel-Mitzrayim [mourning of Egypt], there beyond the Yarden."},{"num":12,"verse":"His sons did to him as he had ordered them to do — "},{"num":13,"verse":"they carried him into the land of Kena‘an and buried him in the cave in the field of Makhpelah, which Avraham had bought, along with the field, as a burial-place belonging to him, from ‘Efron the Hitti, by Mamre."},{"num":14,"verse":"Then, after burying his father, Yosef returned to Egypt, he, his brothers and all who had gone up with him to bury his father."},{"num":15,"verse":"Realizing that their father was dead, Yosef’s brothers said, “Yosef may hate us now and pay us back in full for all the suffering we caused him.” "},{"num":16,"verse":"So they sent a message to Yosef which said, “Your father gave this order before he died: "},{"num":17,"verse":"‘Say to Yosef, “I beg you now, please forgive your brothers’ crime and wickedness in doing you harm.”’ So now, we beg of you, forgive the crime of the servants of the God of your father.” Yosef wept when they spoke to him; "},{"num":18,"verse":"and his brothers too came, prostrated themselves before him and said, “Here, we are your slaves.” "},{"num":19,"verse":"But Yosef said to them, “Don’t be afraid! Am I in the place of God? "},{"num":20,"verse":"You meant to do me harm, but God meant it for good — so that it would come about as it is today, with many people’s lives being saved. "},{"num":21,"verse":"(vii) So don’t be afraid — I will provide for you and your little ones.” In this way he comforted them, speaking kindly to them."},{"num":22,"verse":"Yosef continued living in Egypt, he and his father’s household. Yosef lived 110 years. "},{"num":23,"verse":"(Maftir) Yosef lived to see Efrayim’s great-grandchildren, and the children of M’nasheh’s son Makhir were born on Yosef’s knees."},{"num":24,"verse":"Yosef said to his brothers, “I am dying. But God will surely remember you and bring you up out of this land to the land which he swore to Avraham, Yitz’chak and Ya‘akov.” "},{"num":25,"verse":"Then Yosef took an oath from the sons of Isra’el: “God will surely remember you, and you are to carry my bones up from here.” "},{"num":26,"verse":"So Yosef died at the age of 110, and they embalmed him and put him in a coffin in Egypt."}]