[{"header":"Lamentation for Jacob"},{"num":50,"verse":"Joseph fell upon his father’s face, wept over him and kissed him. "},{"num":2,"verse":"Then Joseph commanded his servants the physicians to embalm his father, so the physicians embalmed Israel. "},{"num":3,"verse":"They took 40 days for him, because that is how long embalming takes, and Egypt wept 70 days."},{"num":4,"verse":"When the days of formal weeping passed, Joseph spoke to Pharaoh’s house saying, “If I’ve found favor in your eyes, please say in Pharaoh’s ears, "},{"num":5,"verse":"“My father made me take an oath saying, ‘Behold, I am about to die. In my tomb—which I dug for myself in the land of Canaan—there you must bury me.’ So now, please allow me to go up and bury my father, and then return.”"},{"num":6,"verse":"Pharaoh said, “Go up and bury your father just as he made you swear on oath.”"},{"num":7,"verse":"So Joseph went up to bury his father. Also all of Pharaoh’s servants, the elders of his household and all the elders of the land of Egypt went up with him, "},{"num":8,"verse":"along with all of Joseph’s house, his brothers, and his father’s household. Only their children and their flocks and cattle were left in the land of Goshen. "},{"num":9,"verse":"Chariots and horsemen also went up with him—it was a very impressive company."},{"num":10,"verse":"When they came to the threshing floor of the bramble on the other side of the Jordan, they mourned there—a very great and solemn lamentation. He observed seven days of mourning for his father. "},{"num":11,"verse":"When the inhabitants of the land, the Canaanites, saw the mourning ritual at the threshing floor of the prickly bush, they said, “A solemn mourning ritual this is for the Egyptians.” That is why it is named Abel-Mizraim, which is on the other side of the Jordan."},{"num":12,"verse":"So Jacob’s sons did for him just as he commanded them. "},{"num":13,"verse":"His sons carried him to the land of Canaan and buried him in the cave of the field of Machpelah, the field that Abraham bought as a property for burial from Ephron the Hittite, next to Mamre."},{"num":14,"verse":"After burying his father, Joseph returned to Egypt, he and his brothers and all those who went up with him to bury his father."},{"header":"Joseph Comforts His Brothers"},{"num":15,"verse":"When Joseph’s brothers saw that their father had died, they said, “Maybe Joseph will be hostile towards us and pay us back in full for all the evil we showed him. "},{"num":16,"verse":"So they charged Joseph saying, “Before his death, your father gave a command, saying, "},{"num":17,"verse":"“Thus you must say to Joseph: ‘Please forgive, I beg you, the transgression of your brothers and their sin because they treated you wrongly.’ Therefore, please forgive the transgression of the servants of the God of your father.”"},{"num":18,"verse":"and his brothers also came and fell down before him and said, “Behold, we are your slaves!”"},{"num":19,"verse":"But Joseph said to them, “Don’t be afraid. For am I in the place of God? "},{"num":20,"verse":"Yes, you yourselves planned evil against me. God planned it for good, in order to bring about what it is this day—to preserve the lives of many people. "},{"num":21,"verse":"So now, don’t be afraid. I myself will provide food for you and your little ones.” So he reassured them, speaking kindly to them."},{"num":22,"verse":"Joseph remained in Egypt—he and his father’s household—and Joseph lived 110 years. "},{"num":23,"verse":"Joseph saw the third generation of Ephraim’s sons. Also the sons of Machir, Manasseh’s son, were born upon Joseph’s knees."},{"num":24,"verse":"Then Joseph said to his brothers, “I’m about to die. But God will surely take notice of you and will bring you up from this land to the land that He swore to Abraham, to Isaac, and to Jacob.” "},{"num":25,"verse":"Then Joseph made Israel’s sons swear an oath saying, “When God takes notice of you, you will bring my bones up from here.”"},{"num":26,"verse":"So Joseph died at 110 years old, and they embalmed him and he was placed in a coffin in Egypt."}]