[{"header":"Spiritual gifts"},{"num":12,"verse":"Brothers and sisters, I don’t want you to be ignorant about spiritual gifts."},{"num":2,"verse":"You know that when you were Gentiles you were often misled by false gods that can’t even speak."},{"num":3,"verse":"So I want to make it clear to you that no one says, “Jesus is cursed!” when speaking by God’s Spirit, and no one can say, “Jesus is Lord,” except by the Holy Spirit."},{"num":4,"verse":"There are different spiritual gifts but the same Spirit;"},{"num":5,"verse":"and there are different ministries and the same Lord;"},{"num":6,"verse":"and there are different activities but the same God who produces all of them in everyone."},{"num":7,"verse":"A demonstration of the Spirit is given to each person for the common good."},{"num":8,"verse":"A word of wisdom is given by the Spirit to one person, a word of knowledge to another according to the same Spirit,"},{"num":9,"verse":"faith to still another by the same Spirit, gifts of healing to another in the one Spirit,"},{"num":10,"verse":"performance of miracles to another, prophecy to another, the ability to tell spirits apart to another, different kinds of tongues to another, and the interpretation of the tongues to another."},{"num":11,"verse":"All these things are produced by the one and same Spirit who gives what he wants to each person."},{"num":12,"verse":"Christ is just like the human body—a body is a unit and has many parts; and all the parts of the body are one body, even though there are many."},{"num":13,"verse":"We were all baptized by one Spirit into one body, whether Jew or Greek, or slave or free, and we all were given one Spirit to drink."},{"num":14,"verse":"Certainly the body isn’t one part but many."},{"num":15,"verse":"If the foot says, “I’m not part of the body because I’m not a hand,” does that mean it’s not part of the body?"},{"num":16,"verse":"If the ear says, “I’m not part of the body because I’m not an eye,” does that mean it’s not part of the body?"},{"num":17,"verse":"If the whole body were an eye, what would happen to the hearing? And if the whole body were an ear, what would happen to the sense of smell?"},{"num":18,"verse":"But as it is, God has placed each one of the parts in the body just like he wanted."},{"num":19,"verse":"If all were one and the same body part, what would happen to the body?"},{"num":20,"verse":"But as it is, there are many parts but one body."},{"num":21,"verse":"So the eye can’t say to the hand, “I don’t need you,” or in turn, the head can’t say to the feet, “I don’t need you.”"},{"num":22,"verse":"Instead, the parts of the body that people think are the weakest are the most necessary."},{"num":23,"verse":"The parts of the body that we think are less honorable are the ones we honor the most. The private parts of our body that aren’t presentable are the ones that are given the most dignity."},{"num":24,"verse":"The parts of our body that are presentable don’t need this. But God has put the body together, giving greater honor to the part with less honor"},{"num":25,"verse":"so that there won’t be division in the body and so the parts might have mutual concern for each other."},{"num":26,"verse":"If one part suffers, all the parts suffer with it; if one part gets the glory, all the parts celebrate with it."},{"num":27,"verse":"You are the body of Christ and parts of each other."},{"num":28,"verse":"In the church, God has appointed first apostles, second prophets, third teachers, then miracles, then gifts of healing, the ability to help others, leadership skills, different kinds of tongues."},{"num":29,"verse":"All aren’t apostles, are they? All aren’t prophets, are they? All aren’t teachers, are they? All don’t perform miracles, do they?"},{"num":30,"verse":"All don’t have gifts of healing, do they? All don’t speak in different tongues, do they? All don’t interpret, do they?"},{"num":31,"verse":"Use your ambition to try to get the greater gifts. And I’m going to show you an even better way."}]