[{"header":"Instruction on Prayer"},{"num":2,"verse":"Most of all, I’m writing to encourage you to pray with gratitude to God. Pray for all men with all forms of prayers and requests as you intercede with intense passion. "},{"num":2,"verse":"And pray for every political leader and representative, so that we would be able to live tranquil, undisturbed lives, as we worship the awe-inspiring God with pure hearts. "},{"num":3,"verse":"It is pleasing to our Savior-God to pray for them. "},{"num":4,"verse":"He longs for everyone to embrace his life and return to the full knowledge of the truth."},{"num":5,"verse":"For God is one, and there is one Mediator between God and the sons of men—the true man, Jesus, the Anointed One. "},{"num":6,"verse":"He gave himself as ransom-payment for everyone. Now is the proper time for God to give the world this witness. "},{"num":7,"verse":"I have been divinely called as an apostle to preach this revelation, which is the truth. God has called me to be a trustworthy teacher to the nations."},{"num":8,"verse":"Therefore, I encourage the men to pray on every occasion with hands lifted to God in worship with clean hearts, free from frustration or strife."},{"header":"Conduct of Women"},{"num":9,"verse":"And that the women would also pray with clean hearts, dressed appropriately and adorned modestly and sensibly, not flaunting their wealth. "},{"num":10,"verse":"But they should be recognized instead by their beautiful deeds of kindness, suitable as one who worships God."},{"num":11,"verse":"Let the women who are new converts be willing to learn with all submission to their leaders and not speak out of turn. "},{"num":12,"verse":"I don’t advocate that the newly converted women be the teachers in the church, assuming authority over the men, but to live in peace. "},{"num":13,"verse":"For God formed Adam first, then Eve. "},{"num":14,"verse":"Adam did not mislead Eve, but Eve misled him and violated the command of God. "},{"num":15,"verse":"Yet salvation will come through a child born by a woman, and women will be saved by that “child” if they continue in faith with love, holiness, and self-control."}]