[{"header":"The Allotment of Judah"},{"num":15,"verse":"The allotment for the tribe of the descendants of Judah according to their families reached to the border of Edom, to the wilderness of Zin, to the far south. "},{"num":2,"verse":"Their southern border was from the end of the Salt Sea, from the bay facing southward; "},{"num":3,"verse":"it continues to the south to the ascent of Akrabbim, passes along to Zin, it goes up south of Kadesh Barnea, passes along Hezron, goes up to Addar, and makes a turn to Karka; "},{"num":4,"verse":"it passes on to Azmon, continues by the wadi of Egypt, and it ends at the sea. This will be your southern border. "},{"num":5,"verse":"The eastern border is the Salt Sea up to the mouth of the Jordan. The border on the northern side runs from the bay of the sea at the mouth of the Jordan; "},{"num":6,"verse":"the border goes up to Beth-hoglah and passes along north of Beth Arabah; and the border goes up the stone of Bohan son of Reuben; "},{"num":7,"verse":"and the border goes up to Debir from the valley of Achor, and to the north, turning to Gilgal, which is opposite the ascent of Adummim, which is south of the wadi; and the border passes on to the waters of En Shemesh, and it ends at En Rogel. "},{"num":8,"verse":"Then the border goes up by the Valley of Ben Hinnom to the slope of the Jebusites from the south (that is, Jerusalem); and the border goes up to the top of the mountain that lies opposite the valley of Hinnom to the west, which is at the end of the valley of Rephaim to the north; "},{"num":9,"verse":"then the border turns from the top of the mountain to the spring of the waters of Nephtoah, and continues from there to the cities of Mount Ephron; the border then turns to Baalah (that is, Kiriath Jearim); "},{"num":10,"verse":"and the border goes around from Baalah to the west, to Mount Seir, and passes on to the slope of Mount Jearim from the north (that is, Kesalon), and goes down to Beth Shemesh, and passes along by Timnah. "},{"num":11,"verse":"The border continues to the slope of Ekron to the north, then bends around to Shikkeron, it passes on to Mount Baalah and continues to Jabneel; and the border ends at the sea. "},{"num":12,"verse":"And the western border is to the Great Sea and its coast. This is the border surrounding the descendants of Judah according to their families."},{"num":13,"verse":"According to the commandment of Yahweh to Joshua, he gave to Caleb son of Jephunneh a plot of ground among the descendants of Judah, Kiriath Arba, which is Hebron (Arba was Anak’s father). "},{"num":14,"verse":"Caleb drove out from there three of Anak’s sons, Sheshai, Ahiman, and Talmai, the descendants of Anak. "},{"num":15,"verse":"And from there he went up against the inhabitants of Debir (the former name of Debir was Kiriath Sepher). "},{"num":16,"verse":"And Caleb said, “Whoever attacks Kiriath Sepher and captures it, I will give to him my daughter Acsah as a wife.” "},{"num":17,"verse":"Othniel son of Kenaz, the brother of Caleb, captured it, and he gave to him Acsah his daughter as a wife. "},{"num":18,"verse":"When she came to him she urged him to ask her father for a field. So she dismounted from the donkey, and Caleb said to her, “What do you want?” "},{"num":19,"verse":"And she said to him, “Give to me a gift; you have given me the land of the Negev, and you must give to me a spring of water.” And he gave to her the upper and lower spring."},{"header":"The Cities of Judah"},{"num":20,"verse":"This is the inheritance of the tribe of the descendants of Judah according to their families: "},{"num":21,"verse":"the cities belonging to the tribe of the descendants of Judah to the far south, to the border of Edom to the south, were Kabzeel, Eder, Jagur, "},{"num":22,"verse":"Kinah, Dimonah, Adadah, "},{"num":23,"verse":"Kedesh, Hazor, Ithnan, "},{"num":24,"verse":"Ziph, Telem, Bealoth, "},{"num":25,"verse":"Hazor Hadattah, Kerioth Hezron (that is, Hazor), "},{"num":26,"verse":"Amam, Shema, Moladah, "},{"num":27,"verse":"Hazar Gaddah, Heshmon, Beth Pelet, "},{"num":28,"verse":"Hazar Shual, Beersheba, Biziothiah, "},{"num":29,"verse":"Baalah, Iim, Ezem, "},{"num":30,"verse":"Eltolad, Kesil, Hormah, "},{"num":31,"verse":"Ziklag, Madmannah, Sansannah, "},{"num":32,"verse":"Lebaoth, Shilhim, Ain, and Rimmon; in all, twenty-nine cities and their villages."},{"num":33,"verse":"In the Shephelah: Eshtaol, Zorah, Ashnah, "},{"num":34,"verse":"Zanoah, En Gannim, Tappuah, Enam, "},{"num":35,"verse":"Jarmuth, Adullam, Socoh, Azekah, "},{"num":36,"verse":"Shaaraim, Adithaim, Gederah, and Gederothaim; fourteen cities and their villages."},{"num":37,"verse":"Zenan, Hadashah, Migdal Gad, "},{"num":38,"verse":"Dilean, Mizpah, Joktheel, "},{"num":39,"verse":"Lachish, Bozkath, Eglon, "},{"num":40,"verse":"Cabbon, Lahma, Kitlish, "},{"num":41,"verse":"Gederoth, Beth Dagon, Naamah, and Makkedah; sixteen cities and their villages."},{"num":42,"verse":"Libnah, Ether, Ashan, "},{"num":43,"verse":"Jephthah, Ashnah, Nezib, "},{"num":44,"verse":"Keilah, Aczib, and Mareshah; nine cities and their villages."},{"num":45,"verse":"Ekron, its towns and villages; "},{"num":46,"verse":"from Ekron to the sea, and all that were near Ashdod and their villages."},{"num":47,"verse":"Ashdod, its towns and villages; Gaza, its towns and villages, up to the wadi of Egypt and the Great Sea and its coast."},{"num":48,"verse":"And in the hill country: Shamir, Jattir, Socoh, "},{"num":49,"verse":"Dannah, Kiriath Sanna (that is, Debir), "},{"num":50,"verse":"Anab, Eshtemoh, Anim, "},{"num":51,"verse":"Goshen, Holon, and Giloh; eleven cities and their villages."},{"num":52,"verse":"Arab, Dumah, Eshan, "},{"num":53,"verse":"Janim, Beth-tappuah, Aphekah, "},{"num":54,"verse":"Humtah, Kiriath Arba (that is, Hebron), and Zior; nine cities and their villages."},{"num":55,"verse":"Moan, Carmel, Ziph, Juttah, "},{"num":56,"verse":"Jezreel, Jokdeam, Zanoah, "},{"num":57,"verse":"Kain, Gibeah, and Timnah; ten cities and their villages."},{"num":58,"verse":"Halhul, Beth Zur, Gedor, "},{"num":59,"verse":"Maarath, Beth Anoth, and Eltekon; six cities and their villages."},{"num":60,"verse":"Kiriath Baal (that is, Kiriath Jearim) and Rabbah; two cities and their villages."},{"num":61,"verse":"In the wilderness: Beth Arabah, Middin, Secacah, "},{"num":62,"verse":"Nibshan, the city of Salt, and En Gedi; six cities and their villages."},{"num":63,"verse":"But the descendants of Judah were unable to drive out the Jebusites, the inhabitants of Jerusalem, so the Jebusites live with the descendants of Judah in Jerusalem to this day."}]