[[],[{"type":"prose","content":"The land allotted to the tribe of Judah by its clans reached to the border of Edom, to the wilderness of Zin in the Negev far to the south. "}],[{"type":"prose","content":"Their southern border started at the southern tip of the Salt Sea, "}],[{"type":"prose","content":"extended south of the Scorpion Ascent, crossed to Zin, went up from the south to Kadesh Barnea, crossed to Hezron, went up to Addar, and turned toward Karka. "}],[{"type":"prose","content":"It then crossed to Azmon, extended to the Stream of Egypt, and ended at the Mediterranean Sea. This was their southern border."}],[{"type":"prose","content":"The eastern border was the Salt Sea to the mouth of the Jordan River.The northern border started north of the Salt Sea at the mouth of the Jordan, "}],[{"type":"prose","content":"went up to Beth Hoglah, crossed north of Beth Arabah, and went up to the Stone of Bohan son of Reuben. "}],[{"type":"prose","content":"It then went up to Debir from the Valley of Achor, turning northward to Gilgal (which is opposite the Pass of Adummim south of the valley), crossed to the waters of En Shemesh and extended to En Rogel. "}],[{"type":"prose","content":"It then went up the Valley of Ben Hinnom to the slope of the Jebusites on the south (that is, Jerusalem), going up to the top of the hill opposite the Valley of Ben Hinnom to the west, which is at the end of the Valley of the Rephaites to the north. "}],[{"type":"prose","content":"It then went from the top of the hill to the spring of the waters of Nephtoah, extended to the cities of Mount Ephron, and went to Baalah (that is, Kiriath Jearim). "}],[{"type":"prose","content":"It then turned from Baalah westward to Mount Seir, crossed to the slope of Mount Jearim on the north (that is Kesalon), descended to Beth Shemesh, and crossed to Timnah. "}],[{"type":"prose","content":"It then extended to the slope of Ekron to the north, went toward Shikkeron, crossed to Mount Baalah, extended to Jabneel, and ended at the sea."}],[{"type":"prose","content":"The western border was the Mediterranean Sea. These were the borders of the tribe of Judah and its clans."}],[{"type":"prose","content":"Caleb son of Jephunneh was assigned Kiriath Arba (that is Hebron) within the tribe of Judah, according to the ’s instructions to Joshua. (Arba was the father of Anak.) "}],[{"type":"prose","content":"Caleb drove out from there three Anakites—Sheshai, Ahiman, and Talmai, descendants of Anak. "}],[{"type":"prose","content":"From there he attacked the people of Debir. (Debir used to be called Kiriath Sepher.) "}],[{"type":"prose","content":"Caleb said, “To the man who attacks and captures Kiriath Sepher I will give my daughter Achsah as a wife.” "}],[{"type":"prose","content":"When Othniel son of Kenaz, Caleb’s brother, captured it, Caleb gave Achsah his daughter to him as a wife."}],[{"type":"prose","content":"One time Achsah came and charmed her father so that she could ask him for some land. When she got down from her donkey, Caleb said to her, “What would you like?” "}],[{"type":"prose","content":"She answered, “Please give me a special present. Since you have given me land in the Negev, now give me springs of water.” So he gave her both the upper and lower springs."}],[{"type":"prose","content":"This is the land assigned to the tribe of Judah by its clans: "}],[{"type":"prose","content":"These cities were located at the southern extremity of Judah’s tribal land near the border of Edom: Kabzeel, Eder, Jagur, "}],[{"type":"prose","content":"Kinah, Dimonah, Adadah, "}],[{"type":"prose","content":"Kedesh, Hazor, Ithnan, "}],[{"type":"prose","content":"Ziph, Telem, Bealoth, "}],[{"type":"prose","content":"Hazor Hadattah, Kerioth Hezron (that is, Hazor), "}],[{"type":"prose","content":"Amam, Shema, Moladah, "}],[{"type":"prose","content":"Hazar Gaddah, Heshbon, Beth Pelet, "}],[{"type":"prose","content":"Hazar Shual, Beer Sheba, Biziothiah, "}],[{"type":"prose","content":"Baalah, Iim, Ezem, "}],[{"type":"prose","content":"Eltolad, Kesil, Hormah, "}],[{"type":"prose","content":"Ziklag, Madmannah, Sansannah, "}],[{"type":"prose","content":"Lebaoth, Shilhim, Ain, and Rimmon—a total of twenty-nine cities and their towns."}],[{"type":"prose","content":"These cities were in the foothills: Eshtaol, Zorah, Ashnah, "}],[{"type":"prose","content":"Zanoah, En Gannim, Tappuah, Enam, "}],[{"type":"prose","content":"Jarmuth, Adullam, Socoh, Azekah, "}],[{"type":"prose","content":"Shaaraim, Adithaim, and Gederah (or Gederothaim)—a total of fourteen cities and their towns."}],[{"type":"prose","content":"Zenan, Hadashah, Migdal Gad, "}],[{"type":"prose","content":"Dilean, Mizpah, Joktheel, "}],[{"type":"prose","content":"Lachish, Bozkath, Eglon, "}],[{"type":"prose","content":"Cabbon, Lahmas, Kitlish, "}],[{"type":"prose","content":"Gederoth, Beth Dagon, Naamah, and Makkedah—a total of sixteen cities and their towns."}],[{"type":"prose","content":"Libnah, Ether, Ashan, "}],[{"type":"prose","content":"Iphtah, Ashnah, Nezib, "}],[{"type":"prose","content":"Keilah, Achzib, and Mareshah—a total of nine cities and their towns."}],[{"type":"prose","content":"Ekron and its surrounding towns and settlements; "}],[{"type":"prose","content":"from Ekron westward, all those in the vicinity of Ashdod and their towns; "}],[{"type":"prose","content":"Ashdod with its surrounding towns and settlements, and Gaza with its surrounding towns and settlements, as far as the Stream of Egypt and the border at the Mediterranean Sea."}],[{"type":"prose","content":"These cities were in the hill country: Shamir, Jattir, Socoh, "}],[{"type":"prose","content":"Dannah, Kiriath Sannah (that is, Debir), "}],[{"type":"prose","content":"Anab, Eshtemoh, Anim, "}],[{"type":"prose","content":"Goshen, Holon, and Giloh—a total of eleven cities and their towns."}],[{"type":"prose","content":"Arab, Dumah, Eshan, "}],[{"type":"prose","content":"Janim, Beth Tappuah, Aphekah, "}],[{"type":"prose","content":"Humtah, Kiriath Arba (that is, Hebron), and Zior—a total of nine cities and their towns."}],[{"type":"prose","content":"Maon, Carmel, Ziph, Juttah, "}],[{"type":"prose","content":"Jezreel, Jokdeam, Zanoah, "}],[{"type":"prose","content":"Kain, Gibeah, and Timnah—a total of ten cities and their towns."}],[{"type":"prose","content":"Halhul, Beth Zur, Gedor, "}],[{"type":"prose","content":"Maarath, Beth Anoth, and Eltekon—a total of six cities and their towns."}],[{"type":"prose","content":"Kiriath Baal (that is, Kiriath Jearim) and Rabbah—a total of two cities and their towns."}],[{"type":"prose","content":"These cities were in the wilderness: Beth Arabah, Middin, Secacah, "}],[{"type":"prose","content":"Nibshan, the City of Salt, and En Gedi—a total of six cities and their towns."}],[{"type":"prose","content":"The men of Judah were unable to conquer the Jebusites living in Jerusalem. The Jebusites live with the people of Judah in Jerusalem to this very day."}]]