[{"header":"The First Passover"},{"num":12,"verse":"The Lord spoke to Moses and Aaron in the land of Egypt: "},{"num":2,"verse":"“This month will be the beginning of months, the first month of the year for you. "},{"num":3,"verse":"Tell the whole community of Israel that on the tenth day of this month each man must get one lamb for the people in his house. "},{"num":4,"verse":"If there are not enough people in his house to eat a whole lamb, he must share it with his closest neighbor, considering the number of people. There must be enough lamb for everyone to eat. "},{"num":5,"verse":"The lamb must be a one-year-old male that has nothing wrong with it. This animal can be either a young sheep or a young goat. "},{"num":6,"verse":"Take care of the animals until the fourteenth day of the month. On that day all the people of the community of Israel will kill them in the evening before dark. "},{"num":7,"verse":"The people must take some of the blood and put it on the sides and tops of the doorframes of the houses where they eat the lambs. "},{"num":8,"verse":"On this night they must roast the lamb over a fire. They must eat it with bitter herbs and bread made without yeast. "},{"num":9,"verse":"Do not eat the lamb raw or boiled in water. Roast the whole lamb over a fire—with its head, legs, and inner organs. "},{"num":10,"verse":"You must not leave any of it until morning, but if any of it is left over until morning, you must burn it with fire."},{"num":11,"verse":"“This is the way you must eat it: You must be fully dressed as if you were going on a trip. You must have your sandals on and your walking stick in your hand. You must eat it in a hurry; this is the Lord’s Passover."},{"num":12,"verse":"“That night I will go through the land of Egypt and kill all the firstborn animals and people in the land of Egypt. I will also punish all the gods of Egypt. I am the Lord. "},{"num":13,"verse":"But the blood will be a sign on the houses where you are. When I see the blood, I will pass over you. Nothing terrible will hurt you when I punish the land of Egypt."},{"num":14,"verse":"“You are always to remember this day and celebrate it with a feast to the Lord. Your descendants are to honor the Lord with this feast from now on. "},{"num":15,"verse":"For this feast you must eat bread made without yeast for seven days. On the first day, you are to remove all the yeast from your houses. No one should eat any yeast for the full seven days of the feast, or that person will be cut off from Israel. "},{"num":16,"verse":"You are to have holy meetings on the first and last days of the feast. You must not do any work on these days; the only work you may do is to prepare your meals. "},{"num":17,"verse":"You must celebrate the Feast of Unleavened Bread, because on this very day I brought your divisions of people out of Egypt. So all of your descendants must celebrate this day. This is a law that will last from now on. "},{"num":18,"verse":"In the first month of the year you are to eat bread made without yeast, from the evening of the fourteenth day until the evening of the twenty-first day. "},{"num":19,"verse":"For seven days there must not be any yeast in your houses. Anybody who eats yeast during this time, either an Israelite or non-Israelite, must be cut off from the community of Israel. "},{"num":20,"verse":"During this feast you must not eat anything made with yeast. You must eat only bread made without yeast wherever you live.”"},{"num":21,"verse":"Then Moses called all the elders of Israel together and told them, “Get the animals for your families and kill the lamb for the Passover. "},{"num":22,"verse":"Take a branch of the hyssop plant, dip it into the bowl filled with blood, and then wipe the blood on the sides and tops of the doorframes. No one may leave that house until morning. "},{"num":23,"verse":"When the Lord goes through Egypt to kill the Egyptians, he will see the blood on the sides and tops of the doorframes, and he will pass over that house. He will not let the one who brings death come into your houses and kill you."},{"num":24,"verse":"“You must keep this command as a law for you and your descendants from now on. "},{"num":25,"verse":"Do this when you go to the land the Lord has promised to give you. "},{"num":26,"verse":"When your children ask you, ‘Why are we doing these things?’ "},{"num":27,"verse":"you will say, ‘This is the Passover sacrifice to honor the Lord. When we were in Egypt, the Lord passed over the houses of Israel, and when he killed the Egyptians, he saved our homes.’” Then the people bowed down and worshiped the Lord. "},{"num":28,"verse":"They did just as the Lord commanded Moses and Aaron."},{"num":29,"verse":"At midnight the Lord killed all the firstborn sons in the land of Egypt—from the firstborn of the king who sat on the throne to the firstborn of the prisoner in jail. Also, all the firstborn farm animals died. "},{"num":30,"verse":"The king, his officers, and all the Egyptians got up during the night because someone had died in every house. So there was a loud outcry everywhere in Egypt."},{"header":"Israel Leaves Egypt"},{"num":31,"verse":"During the night the king called for Moses and Aaron and said, “Get up and leave my people. You and your people may do as you have asked; go and worship the Lord. "},{"num":32,"verse":"Take all of your flocks and herds as you have asked, and go. And also bless me.” "},{"num":33,"verse":"The Egyptians also asked the Israelites to hurry and leave, saying, “If you don’t leave, we will all die!”"},{"num":34,"verse":"So the people took their dough before the yeast was added. They wrapped the bowls for making dough in clothing and carried them on their shoulders. "},{"num":35,"verse":"The Israelites did what Moses told them to do and asked their Egyptian neighbors for things made of silver and gold and for clothing. "},{"num":36,"verse":"The Lord caused the Egyptians to think well of them, and the Egyptians gave the people everything they asked for. So the Israelites took rich gifts from them."},{"num":37,"verse":"The Israelites traveled from Rameses to Succoth. There were about six hundred thousand men walking, not including the women and children. "},{"num":38,"verse":"Many other people who were not Israelites went with them, as well as a large number of sheep, goats, and cattle. "},{"num":39,"verse":"The Israelites used the dough they had brought out of Egypt to bake loaves of bread without yeast. The dough had no yeast in it, because they had been rushed out of Egypt and had no time to get food ready for their trip."},{"num":40,"verse":"The people of Israel had lived in Egypt for four hundred thirty years; "},{"num":41,"verse":"on the very day the four hundred thirty years ended, the Lord’s divisions of people left Egypt. "},{"num":42,"verse":"That night the Lord kept watch to bring them out of Egypt, and so on this same night the Israelites are to keep watch to honor the Lord from now on."},{"num":43,"verse":"The Lord told Moses and Aaron, “Here are the rules for Passover: No foreigner is to eat the Passover. "},{"num":44,"verse":"If someone buys a slave and circumcises him, the slave may eat the Passover. "},{"num":45,"verse":"But neither a person who lives for a short time in your country nor a hired worker may eat it."},{"num":46,"verse":"“The meal must be eaten inside a house; take none of the meat outside the house. Don’t break any of the bones. "},{"num":47,"verse":"The whole community of Israel must take part in this feast. "},{"num":48,"verse":"A foreigner who lives with you may share in the Lord’s Passover if all the males in his house become circumcised. Then, since he will be like a citizen of Israel, he may share in the meal. But a man who is not circumcised may not eat the Passover meal. "},{"num":49,"verse":"The same rules apply to an Israelite born in the country or to a foreigner living there.”"},{"num":50,"verse":"So all the Israelites did just as the Lord had commanded Moses and Aaron. "},{"num":51,"verse":"On that same day the Lord led the Israelites out of Egypt by their divisions."}]