[{"header":"I Have Told You In Advance So That You May Not Fall"},{"num":16,"verse":"“I have spoken these things to you in order that you may not be caused-to-fall. "},{"num":2,"verse":"They will make you put-out-of-the-synagogue ones. Indeed, an hour is coming for everyone having killed you to think that he is offering service to God. "},{"num":3,"verse":"And they will do these things because they did not know the Father nor Me. "},{"num":4,"verse":"But I have spoken these things to you so that when their hour comes, you may remember that I told you of them."},{"header":"It Is Better That I Go Away, For I Will Send You The Helper To Convict The World"},{"num":5,"verse":"But now I am going to the One having sent Me. And none of you is asking Me, ‘Where are You going?’, "},{"num":6,"verse":"but grief has filled your heart because I have spoken these things to you. "},{"num":7,"verse":"But I tell you the truth— it is better for you that I go away. For if I do not go away, the Helper will not come to you. But if I go, I will send Him to you. "},{"num":8,"verse":"And having come, that One will convict the world concerning sin, and concerning righteousness, and concerning judgment— "},{"num":9,"verse":"concerning sin, because they are not believing in Me; "},{"num":10,"verse":"and concerning righteousness, because I am going to the Father and you are no longer going to see Me; "},{"num":11,"verse":"and concerning judgment, because the ruler of this world has been judged."},{"header":"When The Helper Comes, He Will Guide You Into All Truth"},{"num":12,"verse":"“I still have many things to say to you, but you are not able to bear them now. "},{"num":13,"verse":"But when that One, the Spirit of truth, comes— He will guide you in all the truth. For He will not speak from Himself, but He will speak whatever He will hear. And He will declare to you the things coming. "},{"num":14,"verse":"That One will glorify Me, because He will take from what is Mine and declare it to you. "},{"num":15,"verse":"All that the Father has is Mine. For this reason I said that He takes from what is Mine and will declare it to you."},{"header":"A Little While Longer And I Will Be Gone. A Little While Longer And You Will See Me"},{"num":16,"verse":"“A little while and you are no-longer going to see Me. And again a little while, and you will see Me”. "},{"num":17,"verse":"Then some of His disciples said to one another, “What is this which He is saying to us— ‘A little while, and you are not going to see Me. And again a little while, and you will see Me’. And— ‘Because I am going to the Father’?” "},{"num":18,"verse":"Then they were saying, “What is this which He is saying— ‘A little while’? We do not know what He is speaking about."},{"header":"You Will Weep, Then You Will Rejoice When I See You Again"},{"num":19,"verse":"Jesus knew that they were wanting to question Him, and He said to them, “Are you seeking with one another concerning this, that I said, ‘A little while, and you are not going to see Me. And again a little while, and you will see Me’? "},{"num":20,"verse":"Truly, truly, I say to you that you will weep and lament, but the world will rejoice. You will be grieved, but your grief will become joy. "},{"num":21,"verse":"The woman has grief when she gives-birth, because her hour came. But when she bears the child, she no longer remembers the affliction because of the joy that a person was born into the world. "},{"num":22,"verse":"You then also now have grief— but I will see you again, and your heart will rejoice. And no one is going to take away your joy from you. "},{"num":23,"verse":"And in that day you will not question Me as to anything. Truly, truly, I say to you, if you ask the Father anything in My name, He will give it to you. "},{"num":24,"verse":"Until now you did not ask anything in My name. Be asking and you will receive, in order that your joy may be full."},{"header":"Then I Will Speak To You Plainly About The Father"},{"num":25,"verse":"“I have spoken these things to you in figures-of-speech. An hour is coming when I will no longer speak to you in figures-of-speech, but I will tell you about the Father with plainness. "},{"num":26,"verse":"In that day you will ask in My name. And I am not saying to you that I will request the Father on your behalf. "},{"num":27,"verse":"For the Father Himself loves you, because you have loved Me, and have believed that I came forth from God. "},{"num":28,"verse":"I came forth from the Father, and I have come into the world. Again, I am leaving the world and going to the Father”."},{"header":"But Soon You Will Be Scattered"},{"num":29,"verse":"His disciples say, “Look— now You are speaking with plainness, and You are speaking no figure-of-speech. "},{"num":30,"verse":"Now we know that You know all things, and You have no need that anyone question You. By this we believe that You came forth from God”. "},{"num":31,"verse":"Jesus responded to them, “Now you believe! "},{"num":32,"verse":"Behold, an hour is coming, and has come, for you to be scattered— each to his own things— and leave Me alone. And-yet I am not alone, because the Father is with Me."},{"header":"Take Courage, I Have Overcome The World"},{"num":33,"verse":"“I have spoken these things to you in order that you may have peace in Me. You have affliction in the world, but take-courage— I have overcome the world”."}]