[{"num":16,"verse":"¶ These things I have spoken unto you that ye should not be offended."},{"num":2,"verse":"They shall put you out of the synagogues, and the hour will even come when whosoever kills you will think that he does God service."},{"num":3,"verse":"And they will do these things unto you because they do not know the Father, nor me."},{"num":4,"verse":"But I have told you these things that when that hour shall come, ye may remember that I told you of them. And I did not say these things unto you at the beginning because I was with you."},{"num":5,"verse":"But now I go unto him that sent me, and none of you asks me, Where goest thou?"},{"num":6,"verse":"But because I have said these things unto you, sorrow has filled your heart."},{"num":7,"verse":"¶ Nevertheless I tell you the truth: It is expedient for you that I go away; for if I do not go away, the Comforter will not come unto you; but if I depart, I will send him unto you."},{"num":8,"verse":"And when he is come, he will reprove the world of sin and of righteousness and of judgment:"},{"num":9,"verse":"of sin, because they do not believe in me;"},{"num":10,"verse":"of righteousness, because I go to my Father, and ye see me no more;"},{"num":11,"verse":"of judgment, because the prince of this world is judged."},{"num":12,"verse":"I have yet many things to say unto you, but ye cannot bear them now."},{"num":13,"verse":"Howbeit when he, the Spirit of truth, is come, he will guide you into all truth, for he shall not speak of himself; but whatsoever he shall hear, that shall he speak, and he will cause you to know the things which are to come."},{"num":14,"verse":"He shall clarify me, for he shall take of that which is mine and shall cause you to know it."},{"num":15,"verse":"All that the Father has is mine; therefore I said that he shall take of that which is mine and shall cause you to know it."},{"num":16,"verse":"¶ A little while, and ye shall not see me; and again, a little while, and ye shall see me, because I go to the Father."},{"num":17,"verse":"Then some of his disciples said among themselves, What is this that he says unto us, A little while, and ye shall not see me; and again, a little while, and ye shall see me; and, Because I go to the Father?"},{"num":18,"verse":"They said therefore, What is this that he says, A little while? we cannot understand what he says."},{"num":19,"verse":"Now Jesus knew that they were desirous to ask him and said unto them, Do ye enquire among yourselves of what I said, A little while, and ye shall not see me; and again, a little while, and ye shall see me?"},{"num":20,"verse":"Verily, verily, I say unto you, That ye shall weep and lament, and the world shall rejoice; but even though ye shall be sorrowful, your sorrow shall be turned into joy."},{"num":21,"verse":"The woman, when she is in travail, has pain, because her hour is come; but as soon as she is delivered of the child, she remembers the anguish no more, for joy that a man is born into the world."},{"num":22,"verse":"And ye now therefore have sorrow; but I will see you again, and your heart shall rejoice, and no one shall take your joy from you."},{"num":23,"verse":"¶ And in that day ye shall ask me nothing. Verily, verily, I say unto you, Whatever ye shall ask the Father in my name, he will give you."},{"num":24,"verse":"Until now ye have asked nothing in my name; ask, and ye shall receive, that your joy may be fulfilled."},{"num":25,"verse":"I have spoken these things unto you in proverbs, but the hour comes when I shall no longer speak unto you in proverbs, but I shall show you plainly of the Father."},{"num":26,"verse":"In that day ye shall ask in my name, and I do not say unto you that I will ask the Father for you;"},{"num":27,"verse":"for the Father himself loves you because ye have loved me and have believed that I came out from God."},{"num":28,"verse":"¶ I came forth from the Father and am come into the world; again, I leave the world and go to the Father."},{"num":29,"verse":"His disciples said unto him, Behold, now thou speakest plainly and speakest no proverb."},{"num":30,"verse":"Now we understand that thou knowest all things and needest not that anyone should ask thee; by this we believe that thou didst come forth from God."},{"num":31,"verse":"Jesus answered them, Do ye now believe?"},{"num":32,"verse":"Behold, the hour comes and is now come, that ye shall be scattered, each one to his own, and shall leave me alone; and yet I am not alone, because the Father is with me."},{"num":33,"verse":"These things I have spoken unto you that in me ye might have peace. In the world ye shall have tribulation; but be of good cheer; I have overcome the world."}]