[{"header":"Chapter 13"},{"num":1,"verse":"The Ark Is Returned to Jerusalem. After David consulted with the captains of the thousands and the hundreds and with all of the leaders,"},{"num":2,"verse":"he spoke to the assembly of Israel, saying, “If you feel that this is good, for the Lord, our God, has willed it, then let us send messengers to the rest of our brethren throughout the land of Israel, including the priests and the Levites who are in their cities and pastures, so that they can come and join us."},{"num":3,"verse":"Let us bring the Ark of God to where we are, for they did not make inquiry at it during the reign of Saul.”"},{"num":4,"verse":"The whole assembly said that they would do this, for all of the people considered it to be the right thing to do."},{"num":5,"verse":"David assembled all of Israel, from the Shihor in Egypt up to Lebo-hamath, to bring the Ark of God from Kiriath-jearim."},{"num":6,"verse":"David and all of the Israelites with him went to Baalah of Judah, that is, Kiriath-jearim, to bring up from there the Ark of God, the Lord, who dwells between the cherubim where his name is proclaimed."},{"num":7,"verse":"They carried the Ark of the Lord on a new cart to the house of Abinadab. Uzzah and Ahio drove the cart."},{"num":8,"verse":"David and all of Israel played before the Lord with all their might, singing and playing on the harps, lyres, tambourines, cymbals, and trumpets."},{"num":9,"verse":"When they came to the threshing floor of Chidon, Uzzah reached out his hand to grab the Ark because the oxen had stumbled."},{"num":10,"verse":"The Lord’s anger blazed against Uzzah, and he struck him down because he had touched the Ark. He died there before the Lord."},{"num":11,"verse":"David was disturbed because of the Lord’s outburst against Uzzah, which is why that place is called Perez-uzzah up to the present day."},{"num":12,"verse":"David was afraid of the Lord that day, saying, “How shall I bring the Ark of God to myself?”"},{"num":13,"verse":"He did not take the Ark with him into the City of David. He had it carried into the house of Obed-edom the Gittite."},{"num":14,"verse":"The Ark of God remained with the family of Obed-edom, in his house, for three months. The Lord blessed the house of Obed-edom and all that he owned."}]