[{"num":13,"verse":"Forsooth David took counsel with [the] tribunes, and centurions, and all [the] princes (and all the leaders);"},{"num":2,"verse":"and he said to all the company of the sons of Israel, If it pleaseth you, and if the word that I speak goeth out from the Lord our God, send we to the remnant of our brethren to all the countries of Israel, and to [the] priests and deacons that dwell in the suburbs of cities, that they be gathered to us, (and he said to all the company of the Israelites, If it pleaseth you, and if the word that I speak goeth out from the Lord our God, then send we for the rest of our kinsmen in all the land of Israel, and for the priests and the Levites who live in the suburbs of the cities, that they be gathered to us,)"},{"num":3,"verse":"and that we bring again to us the ark of our God; for we sought not (at) it in the days of Saul. (and then we shall bring back the Ark of our God to us; for in the days of Saul we did not resort to it/we did not make use of it;)"},{"num":4,"verse":"And all the multitude answered, that it should be done so; for the word pleased all the people."},{"num":5,"verse":"Therefore David gathered together all Israel, from Shihor of Egypt till that thou enter into Hamath, that he should bring the ark of God from Kiriathjearim. (And so David gathered together all Israel, from Shihor of Egypt unto Hamath, to bring back the Ark of God from Kiriathjearim.)"},{"num":6,"verse":"And David went up, and all the men of Israel, to the hill of Kiriathjearim, which is in Judah, that he should bring from thence the ark of the Lord God sitting on cherubim, where his name was inwardly called (on). (And David went up, and all the men of Israel, to Baalah, that is, Kiriathjearim, which is in Judah, to bring back from there the Ark of the Lord God, which sat on cherubim, yea, the Ark which bare his name.)"},{"num":7,"verse":"And they putted the ark of the Lord God on a new wain from the house of Abinadab; and Uzza and his brethren drove the wain. (And they put the Ark of the Lord God on a new wagon at the house of Abinadab; and Uzza and Ahio drove the wagon.)"},{"num":8,"verse":"And David and all Israel played before the Lord, with all might, in songs, and in harps, and psalteries, and in tympans, and in cymbals, and trumps. (And David and all Israel played before the Lord with all their might, with songs, and harps, and lutes, and tympans, and cymbals, and trumpets.)"},{"num":9,"verse":"And when they had come to the cornfloor of Chidon (And when they had come to the threshing floor of Chidon), Uzza stretched forth his hand to sustain, or (to) stable, the ark; for the oxes waxing wild had bowed it [down] a little."},{"num":10,"verse":"Therefore the Lord was wroth against Uzza, and smote him (and struck him down), for he had touched the ark; and he was dead there before the Lord."},{"num":11,"verse":"And David was sorry, for the Lord had parted, or (had) slain, Uzza; and he called that place The Parting of Uzza, (as it is still called) unto this present day."},{"num":12,"verse":"And David dreaded the Lord in that time, and said, How may I bring into me the ark of the Lord? (And David feared the Lord at that time, and said, How can I bring the Ark of the Lord back home with me?)"},{"num":13,"verse":"And for this cause he brought not it to him, that is, into the city of David, but he turned it into the house of Obededom of Gath. (And for this reason he did not bring it back with him, that is, to the City of David, but he left it at the house of Obededom the Gittite.)"},{"num":14,"verse":"Therefore the ark of God dwelled in the house of Obededom of Gath three months; and the Lord blessed his house, and all things that he had. (And so the Ark of God stayed at the house of Obededom the Gittite for three months; and the Lord blessed his house, and all that he had.)"}]