[{"header":"Vengeance on Midian and Balaam"},{"num":31,"verse":"Adonai spoke to Moses saying, "},{"num":2,"verse":"“Take vengeance on the Midianites for Bnei-Yisrael. Afterward you will be gathered to your people.”"},{"num":3,"verse":"So Moses spoke to the people saying, “Mobilize some of your men for battle. They will go out against Midian to carry out Adonai’s vengeance on Midian. "},{"num":4,"verse":"Send into the battle 1,000 men from each of the tribes of Israel.”"},{"num":5,"verse":"So from the thousands of Israel 1,000 from each tribe were assigned, 12,000 in all. "},{"num":6,"verse":"Moses sent them into battle, 1,000 from each tribe, and with them Phinehas son of Eleazar the kohen, who took with him articles from the Sanctuary and trumpets for signaling. "},{"num":7,"verse":"They fought Midian just as Adonai had commanded Moses, and killed every male. "},{"num":8,"verse":"Among the slain they also killed the Midianite kings: Evi, Rekem, Zur, Hur and Reba, the five kings of Midian. They also killed Balaam son of Beor with the sword."},{"num":9,"verse":"Bnei-Yisrael also captured women and sons of Midian, along with all their herds and flocks, and plundered all their goods. "},{"num":10,"verse":"They burned with fire all the Midianite cities, settlements, as well as all their camps. "},{"num":11,"verse":"They seized all the plunder and all the spoil, both people and animals. "},{"num":12,"verse":"They brought the captives, plunder and spoils to Moses, Eleazar the kohen and to the assembly of Bnei-Yisrael at their camp on the plains of Moab, by the Jordan at Jericho."},{"num":13,"verse":"Moses, Eleazar the kohen, and all the princes of the community went to meet them outside the camp. "},{"num":14,"verse":"But Moses was angry with the officers of the army—the commanders of thousands, the commanders of hundreds, those returning from the campaign of the war. "},{"num":15,"verse":"Moses said to them, “You let all the women live? "},{"num":16,"verse":"Why, they are the ones—because of Balaam’s advice—who caused Bnei-Yisrael to be unfaithful to Adonai in the matter of Peor, so that the plague was on the community of Adonai! "},{"num":17,"verse":"So now, kill all the boys and kill every woman who has been intimate with a man. "},{"num":18,"verse":"But save for yourselves every girl who has not been intimate with a man."},{"num":19,"verse":"“Any of you who has killed anyone or touched the body of anyone who has been killed must stay outside the camp for seven days. You must purify yourselves, on the third and seventh days—you and your captives. "},{"num":20,"verse":"Also purify every item of clothing as well as every item made of leather or wood.”"},{"num":21,"verse":"Eleazar said to the men of the army who had gone to war, “This is the regulation of the Torah Adonai gave to Moses: "},{"num":22,"verse":"The gold, silver, bronze, iron, tin, lead, "},{"num":23,"verse":"and anything able to pass through fire is to be put through the fire and will then be clean. It is also to be purified with the water of cleansing. Anything that cannot stand the fire is to be put through the water. "},{"num":24,"verse":"You are to wash your clothes also on the seventh day. You will then be clean and may then come into the camp.”"},{"num":25,"verse":"Adonai said to Moses saying, "},{"num":26,"verse":"“Count the total spoil from the captive people and animals—you, Eleazar the kohen and the princes of the fathers of the community. "},{"num":27,"verse":"You are to divide the spoil between those fighting in the war, taking part in the battle, and the rest of the community. "},{"num":28,"verse":"You are also to set apart from the men of war going into battle tribute to Adonai, one item from every 500, whether persons, cattle, donkeys or flock. "},{"num":29,"verse":"From their half share, take and give it to Eleazar the kohen as Adonai’s part. "},{"num":30,"verse":"From the half of Bnei-Yisrael, you are to take one in 50, whether persons, cattle, donkeys, flock, or any other animals, and give them to the Levites, those charged with the care of Adonai’s Tabernacle.”"},{"num":31,"verse":"So Moses and Eleazar the kohen did just as Adonai commanded Moses. "},{"num":32,"verse":"The remaining plunder taken by the people of the army was 675,000 sheep, "},{"num":33,"verse":"72,000 cattle, "},{"num":34,"verse":"61,000 donkeys, "},{"num":35,"verse":"and from the human spoil were 32,000 women who had never been intimate with a man."},{"num":36,"verse":"The half share of those going into battle was 337,500 sheep, "},{"num":37,"verse":"of which Adonai’s tribute was 675, "},{"num":38,"verse":"36,000 cattle, of which Adonai’s tribute was 72, "},{"num":39,"verse":"30,500 donkeys, of which Adonai’s tribute was 61, "},{"num":40,"verse":"16,000 persons, of which the tribute to Adonai was 32."},{"num":41,"verse":"Moses gave the tribute, Adonai’s part, to Eleazar the kohen just as Adonai had commanded Moses. "},{"num":42,"verse":"From the half belonging to Bnei-Yisrael, which Moses had set apart from that of the fighting men, "},{"num":43,"verse":"half belonging to the community was: 337,500 of the sheep, "},{"num":44,"verse":"36,000 cattle, "},{"num":45,"verse":"30,500 donkeys, "},{"num":46,"verse":"16,000 persons. "},{"num":47,"verse":"From this half, Moses took one out of very 50 persons and animals, as Adonai had commanded him, and gave them to the Levites, those charged with the care of the Tabernacle of Adonai, just as Adonai had commanded Moses."},{"num":48,"verse":"Then the officers over the units of the army, the commanders over thousands and hundreds, came to Moses. "},{"num":49,"verse":"They said to him, “Your servants have counted the heads of the men of war under our command, and not one is missing. "},{"num":50,"verse":"So we have brought as an offering to Adonai the gold items each of us acquired—armlets, bracelets, signet rings, earrings and necklaces to atone for ourselves before Adonai.”"},{"num":51,"verse":"Moses and Eleazar the kohen received the gold from them, all the crafted items. "},{"num":52,"verse":"All of the gold presented as a gift to Adonai came to 16,750 shekels from the commanders of thousands and hundreds. "},{"num":53,"verse":"Each of the men of the army had taken plunder for himself. "},{"num":54,"verse":"Moses and Eleazar the kohen received the gold from the commanders of thousands and of hundreds and brought it into the Tent of Meeting as a memorial for Bnei-Yisrael before Adonai."}]