[{"header":"God Deals Justly with Individuals"},{"num":18,"verse":"The word of the Lord came to me again, saying, "},{"num":2,"verse":"“What do you mean by using this proverb concerning the land of Israel,"},{"num":3,"verse":"As I live,” says the Lord God, “you are certainly not going to use this proverb [as an excuse] in Israel anymore. "},{"num":4,"verse":"Behold (pay close attention), all souls are Mine; the soul of the father as well as the soul of the son is Mine. The soul who sins will die."},{"num":5,"verse":"“But if a man is righteous (keeps the law) and practices justice and righteousness, "},{"num":6,"verse":"and does not eat [at the pagan shrines] on the mountains or raise his eyes to the idols of the house of Israel, or defile his neighbor’s wife or approach a woman during her [monthly] time of impurity— "},{"num":7,"verse":"if a man does not oppress anyone, but restores to the debtor his pledge, does not commit robbery, but gives his bread to the hungry and covers the naked with clothing, "},{"num":8,"verse":"if he does not charge interest or take a percentage of increase [on what he lends in compassion], if he keeps his hand from sin and executes true justice between man and man, "},{"num":9,"verse":"if he walks in My statutes and [keeps] My ordinances so as to act with integrity; [then] he is [truly] righteous and shall certainly live,” says the Lord God."},{"num":10,"verse":"“If he is the father of a violent son who sheds blood, and who does any of these things to a brother "},{"num":11,"verse":"(though the father did not do any of these things), that is, the son even eats [the food set before idols] at the mountain shrines, and defiles his neighbor’s wife, "},{"num":12,"verse":"oppresses the poor and needy, commits robbery, does not restore [to the debtor] his pledge, but raises his eyes to the idols, and commits repulsive acts, "},{"num":13,"verse":"and charges interest and takes [a percentage of] increase on what he has loaned; will he then live? He will not live! He has done all these disgusting things, he shall surely be put to death; his blood will be on his own head."},{"num":14,"verse":"“Now behold, if this [wicked] man has a son who has observed all the sins which his father committed, and considers [thoughtfully what he has observed] and does not do like his father: "},{"num":15,"verse":"He does not eat [food set before idols] at the mountain shrines or raise his eyes to the idols of the house of Israel, or defile his neighbor’s wife, "},{"num":16,"verse":"or oppress anyone, or take anything in pledge, or commit robbery, but he gives his bread to the hungry and covers the naked with clothing, "},{"num":17,"verse":"he keeps his hand from [oppressing] the poor, does not receive interest or increase [from the needy], but executes My ordinances and walks in My statutes; he shall not die for the sin (guilt) of his father; he shall certainly live. "},{"num":18,"verse":"As for his father, because he practiced extortion, robbed his brother, and did that which is not good among his people, behold, he shall die for his sin."},{"num":19,"verse":"“Yet do you say, ‘Why should the son not bear the punishment for the father’s sin?’ When the son has practiced justice and righteousness and has kept all My statutes and has done them, he shall certainly live. "},{"num":20,"verse":"The person who sins [is the one that] will die. The son will not bear the punishment for the sin of the father, nor will the father bear the punishment for the sin of the son; the righteousness of the righteous shall be on himself, and the wickedness of the wicked shall be on himself."},{"num":21,"verse":"“But if the wicked man turns [away] from all his sins which he has committed and keeps all My statutes and practices justice and righteousness, he shall certainly live; he shall not die. "},{"num":22,"verse":"All of his transgressions which he has committed will not be remembered against him; because of his righteousness which he has practiced [for his moral and spiritual integrity in every area and relationship], he will live. "},{"num":23,"verse":"Do I take any pleasure in the death of the wicked,” says the Lord God, “rather than that he should turn [away] from his [malevolent] acts and live?"},{"num":24,"verse":"“But when the righteous man turns away from his righteousness and commits sin and acts in accordance with all the repulsive things that the wicked man does, will he live? All of his righteous deeds which he has done will not be remembered because of the treachery that he has committed and for his sin which he has committed; for them he shall die. "},{"num":25,"verse":"Yet you say, ‘The way of the Lord is not right.’ Hear now, O house of Israel! Is My way not right? Is it not your ways that are not right? "},{"num":26,"verse":"When a righteous man turns away from his righteousness, and commits sin and dies because of it, it is for his sin which he has committed that he dies. "},{"num":27,"verse":"Again, when a wicked man turns away from his wickedness which he has committed and practices justice and righteousness, he will save his life. "},{"num":28,"verse":"Because he considered and turned away from all the transgressions which he had committed, he shall certainly live; he shall not die. "},{"num":29,"verse":"Yet the house of Israel says, ‘The way of the Lord is not right!’ O house of Israel, are My ways not right? Is it not your ways that are not right?"},{"num":30,"verse":"“Therefore I will judge you, O house of Israel, each one in accordance with his conduct,” says the Lord God. “Repent (change your way of thinking) and turn away from all your transgressions, so that sin may not become a stumbling block to you. "},{"num":31,"verse":"Cast away from you all your transgressions which you have committed [against Me], and make yourselves a new heart and a new spirit! For why should you die, O house of Israel? "},{"num":32,"verse":"For I have no pleasure in the death of anyone who dies,” says the Lord God. “Therefore, repent and live!”"}]