[{"header":"Those Who Sin Will Die"},{"num":18,"verse":"The Lord said:"},{"num":2,"verse":"Ezekiel, I hear the people of Israel using the old saying,"},{"num":3,"verse":"Now tell them that I am the Lord God, and as surely as I live, that saying will no longer be used in Israel. "},{"num":4,"verse":"The lives of all people belong to me—parents as well as children. Only those who sin will be put to death."},{"num":5,"verse":"Suppose there is a truly good man who always does what is fair and right. "},{"num":6,"verse":"He refuses to eat meat sacrificed to foreign gods at local shrines or to worship Israel’s idols. He doesn’t have sex with someone else’s wife or with a woman having her monthly period. "},{"num":7,"verse":"He never cheats or robs anyone and always returns anything taken as security for a loan; he gives food and clothes to the poor "},{"num":8,"verse":"and doesn’t charge interest when lending money. He refuses to do anything evil; he is fair to everyone "},{"num":9,"verse":"and faithfully obeys my laws and teachings. This man is good, and I promise he will live."},{"num":10,"verse":"But suppose this good man has an evil son who is violent and commits sins "},{"num":11,"verse":"his father never did. He eats meat at local shrines, has sex with someone else’s wife, "},{"num":12,"verse":"cheats the poor, and robs people. He keeps what is given to him as security for a loan. He worships idols, does disgusting things, "},{"num":13,"verse":"and charges high interest when lending money. An evil man like that will certainly not live. He is the one who has done these horrible sins, so it’s his own fault that he will be put to death."},{"num":14,"verse":"But suppose this evil man has a son who sees his father do these things and refuses to act like him. "},{"num":15,"verse":"He doesn’t eat meat at local shrines or worship Israel’s idols, and he doesn’t have sex with someone else’s wife. "},{"num":16,"verse":"He never cheats or robs anyone and doesn’t even demand security for a loan. He gives food and clothes to the poor "},{"num":17,"verse":"and refuses to do anything evil or to charge interest. And he obeys all my laws and teachings. Such a man will live. His own father sinned, but this good man will not be put to death for the sins of his father. "},{"num":18,"verse":"It is his father who will die for cheating and robbing and doing evil."},{"num":19,"verse":"You may wonder why a son isn’t punished for the sins of his father. It is because the son does what is right and obeys my laws. "},{"num":20,"verse":"Only those who sin will be put to death. Children won’t suffer for the sins of their parents, and parents won’t suffer for the sins of their children. Good people will be rewarded for what they do, and evil people will be punished for what they do."},{"num":21,"verse":"Suppose wicked people stop sinning and start obeying my laws and doing right. They won’t be put to death. "},{"num":22,"verse":"All their sins will be forgiven, and they will live because they did right. "},{"num":23,"verse":"I, the Lord God, don’t like to see wicked people die. I enjoy seeing them turn from their sins and live."},{"num":24,"verse":"But when good people start sinning and doing disgusting things, will they live? No! All their good deeds will be forgotten, and they will be put to death because of their sins."},{"num":25,"verse":"You people of Israel accuse me of being unfair! But listen—I’m not unfair; you are! "},{"num":26,"verse":"If good people start doing evil, they must be put to death, because they have sinned. "},{"num":27,"verse":"And if wicked people start doing right, they will save themselves from punishment. "},{"num":28,"verse":"They will think about what they’ve done and stop sinning, and so they won’t be put to death. "},{"num":29,"verse":"But you still say that I am unfair. You are the ones who have done wrong and are unfair!"},{"num":30,"verse":"I will judge each of you for what you’ve done. So stop sinning, or else you will certainly be punished. "},{"num":31,"verse":"Give up your evil ways and start thinking pure thoughts. And be faithful to me! Do you really want to be put to death for your sins? "},{"num":32,"verse":"I, the Lord God, don’t want to see that happen to anyone. So stop sinning and live!"}]