[{"header":"True Justice"},{"num":18,"verse":"The word of the Lord came to me. He said,"},{"num":2,"verse":"“Why do you people say this proverb:"},{"num":3,"verse":"But the Lord God says, “By my life, I swear that people in Israel will not think this proverb is true anymore!"},{"num":4,"verse":"I will treat everyone, child and parent, just the same. The one who sins is the one who will die!"},{"num":5,"verse":"“A person who is good will live! He is fair and does what is right."},{"num":6,"verse":"He doesn’t go to the mountains to share food offered to idols. He doesn’t pray to those filthy idols in Israel. He doesn’t commit adultery with his neighbor’s wife or with a woman during her period."},{"num":7,"verse":"He doesn’t take advantage of others. If someone borrows money from him, he might take something of value before he gives the money. But when that person pays him back, he returns what he took. He gives food to the hungry and clothes to people who need them."},{"num":8,"verse":"If someone wants to borrow money from him, he lends the money and doesn’t charge interest on the loan. He refuses to be crooked. He is always fair with everyone. People can trust him."},{"num":9,"verse":"He obeys my laws and studies my rules so that he can learn to be fair and dependable. He is good, so he will live.” This is what the Lord God said."},{"num":10,"verse":"“But someone like that might have a son who does not do any of these good things. The son steals things and kills people."},{"num":11,"verse":"He does things his father never did. He goes to the mountains and eats foods offered to false gods. He commits the sin of adultery with his neighbor’s wife."},{"num":12,"verse":"He mistreats poor, helpless people. He takes advantage of them. When a debt is paid, he does not give back what he took from them. He prays to filthy idols and does other terrible things."},{"num":13,"verse":"He lends money to people who need it, but he forces them to pay interest on the loan. The evil son will not be allowed to live. He will be put to death because he did such terrible things, and he will be responsible for his own death."},{"num":14,"verse":"“Now, that evil son might also have a son. But this son sees the bad things his father did, and he refuses to live as his father did. He treats people fairly."},{"num":15,"verse":"He does not go to the mountains and eat foods offered to false gods. He does not pray to filthy idols in Israel. He does not commit the sin of adultery with his neighbor’s wife."},{"num":16,"verse":"He does not take advantage of people. If someone borrows money from him, the good son takes something of value and then gives the other person the money. When that person pays him back, the good son gives back what he took. The good son gives food to hungry people, and he gives clothes to those who need them."},{"num":17,"verse":"He helps the poor. If people want to borrow money, the good son lends them the money, and he does not charge interest on the loan. He obeys my laws and follows them. He will not be put to death for his father’s sins. The good son will live."},{"num":18,"verse":"The father hurts people and steals things. He never does anything good for my people! He will die because of his own sins."},{"num":19,"verse":"“You might ask, ‘Why will the son not be punished for his father’s sins?’ The reason is that the son was fair and did good things. He very carefully obeyed my laws, so he will live."},{"num":20,"verse":"The one who sins is the one who will be put to death. A son will not be punished for his father’s sins, and a father will not be punished for his son’s sins. A good man’s goodness belongs to him alone, and a bad man’s evil belongs to him alone."},{"num":21,"verse":"“Now, if evil people change their lives, they will live and not die. They might stop doing all the bad things they did and begin to carefully obey all my laws. They might become fair and good."},{"num":22,"verse":"God will not remember all the bad things they did. He will remember only their goodness, so they will live!”"},{"num":23,"verse":"The Lord God says, “I don’t want evil people to die. I want them to change their lives so that they can live!"},{"num":24,"verse":"“Now, maybe good people might stop being good. They might change their lives and begin to do all the terrible things that evil people have done in the past. (The evil people changed, so they can live.) So if those good people change and become bad, God will not remember all the good things they did. He will remember that they turned against him and began to sin. So they will die because of their sin."},{"num":25,"verse":"“You people might say, ‘The Lord isn’t fair!’ But listen, family of Israel. I am fair. You are the ones who are not fair!"},{"num":26,"verse":"If good people change and become evil, they must die for the bad things they do."},{"num":27,"verse":"And if evil people change and become good and fair, they will save their lives. They will live!"},{"num":28,"verse":"They saw how wicked they were and came back to me. They stopped doing the evil things they did in the past. So they will live! They will not die!”"},{"num":29,"verse":"The people of Israel said, “That’s not fair! The Lord isn’t fair!”"},{"num":30,"verse":"Why? Because, family of Israel, I will judge each of you only for what you do!” This is what the Lord God said. “So come back to me! Stop committing those crimes and do away with those things that cause you to sin!"},{"num":31,"verse":"Throw away all the terrible idols with which you committed your crimes! Change your heart and spirit. People of Israel, why should you do things that will cost you your life?"},{"num":32,"verse":"I don’t want to kill you! Please come back and live!” This is what the Lord God said."}]