[{"header":"God Deals Justly with Individuals"},{"num":18,"verse":"Then the word of the Lord came to me, saying,"},{"num":2,"verse":"“What do you people mean by using this proverb about the land of Israel, saying,"},{"num":3,"verse":"As I live,” declares the Lord God, “you certainly are not going to use this proverb in Israel anymore."},{"num":4,"verse":"Behold, all souls are Mine; the soul of the father as well as the soul of the son is Mine. The soul who sins will die."},{"num":5,"verse":"“But if a man is righteous and practices justice and righteousness,"},{"num":6,"verse":"if he does not eat at the mountain shrines or raise his eyes to the idols of the house of Israel, or defile his neighbor’s wife or approach a woman during her menstrual period—"},{"num":7,"verse":"and if a man does not oppress anyone, but restores to the debtor his pledge, does not commit robbery, but gives his bread to the hungry and covers the naked with clothing,"},{"num":8,"verse":"and if he does not lend money at interest or take interest, if he keeps his hand from injustice and executes true justice between one person and another,"},{"num":9,"verse":"if he walks in My statutes and keeps My ordinances so as to deal faithfully—he is righteous and will certainly live,” declares the Lord God."},{"num":10,"verse":"“However, he may father a violent son who sheds blood, and does any one of these things to a brother"},{"num":11,"verse":"(though he himself did not do any of these things), that is, he even eats at the mountain shrines, and defiles his neighbor’s wife,"},{"num":12,"verse":"oppresses the poor and needy, commits robbery, does not restore a pledge, but raises his eyes to the idols and commits abomination,"},{"num":13,"verse":"lends money at interest and takes interest; will he live? He will not live! He has committed all these abominations, he shall certainly be put to death; his blood will be on himself."},{"num":14,"verse":"“Now behold, he has fathered a son who saw all his father’s sins which he committed, but he has seen them and does not do likewise."},{"num":15,"verse":"He does not eat at the mountain shrines or raise his eyes to the idols of the house of Israel; he has not defiled his neighbor’s wife,"},{"num":16,"verse":"nor oppressed anyone, nor retained a pledge, nor committed robbery; instead, he gives his bread to the hungry and covers the naked with clothing,"},{"num":17,"verse":"he keeps his hand from the poor, does not take any kind of interest on loans, but executes My ordinances, and walks in My statutes; he will not die for his father’s guilt, he will certainly live."},{"num":18,"verse":"As for his father, because he practiced extortion, robbed his brother, and did what was not good among his people, behold, he will die for his guilt."},{"num":19,"verse":"“Yet you say, ‘Why should the son not suffer the punishment for the father’s guilt?’ When the son has practiced justice and righteousness and has kept all My statutes and done them, he shall certainly live."},{"num":20,"verse":"The person who sins will die. A son will not suffer the punishment for the father’s guilt, nor will a father suffer the punishment for the son’s guilt; the righteousness of the righteous will be upon himself, and the wickedness of the wicked will be upon himself."},{"num":21,"verse":"“But if the wicked person turns from all his sins which he has committed and keeps all My statutes and practices justice and righteousness, he shall certainly live; he shall not die."},{"num":22,"verse":"All his offenses which he has committed will not be remembered against him; because of his righteousness which he has practiced, he will live."},{"num":23,"verse":"Do I take any pleasure in the death of the wicked,” declares the Lord God, “rather than that he would turn from his ways and live?"},{"num":24,"verse":"“But when a righteous person turns away from his righteousness, commits injustice and does according to all the abominations that the wicked person does, will he live? All his righteous deeds which he has done will not be remembered for his treachery which he has committed and his sin which he has committed; for them he will die."},{"num":25,"verse":"Yet you say, ‘The way of the Lord is not right.’ Hear now, house of Israel! Is My way not right? Is it not your ways that are not right?"},{"num":26,"verse":"When a righteous person turns away from his righteousness, commits injustice and dies because of it, for his injustice which he has committed he dies."},{"num":27,"verse":"But when a wicked person turns away from his wickedness which he has committed and practices justice and righteousness, he will save his life."},{"num":28,"verse":"Since he understood and turned away from all his offenses which he had committed, he shall certainly live; he shall not die."},{"num":29,"verse":"But the house of Israel says, ‘The way of the Lord is not right.’ Are My ways not right, house of Israel? Is it not your ways that are not right?"},{"num":30,"verse":"“Therefore I will judge you, house of Israel, each according to his conduct,” declares the Lord God. “Repent and turn away from all your offenses, so that wrongdoing does not become a stumbling block to you."},{"num":31,"verse":"Hurl away from you all your offenses which you have committed and make yourselves a new heart and a new spirit! For why should you die, house of Israel?"},{"num":32,"verse":"For I take no pleasure in the death of anyone who dies,” declares the Lord God. “Therefore, repent and live!”"}]