[{"num":13,"verse":"and I saw a beast come up out of the sea, with ten horns and seven heads. On its horns were ten royal crowns and on its heads blasphemous names. "},{"num":2,"verse":"The beast which I saw was like a leopard, but with feet like those of a bear and a mouth like the mouth of a lion. To it the dragon gave its power, its throne and great authority. "},{"num":3,"verse":"One of the heads of the beast appeared to have received a fatal wound, but its fatal wound was healed, and the whole earth followed after the beast in amazement. "},{"num":4,"verse":"They worshipped the dragon, because he had given his authority to the beast; and they worshipped the beast, saying,"},{"num":5,"verse":"It was given a mouth speaking arrogant blasphemies; and it was given authority to act for forty-two months. "},{"num":6,"verse":"So it opened its mouth in blasphemies against God to insult his name and his Sh’khinah, and those living in heaven; "},{"num":7,"verse":"it was allowed to make war on God’s holy people and to defeat them; and it was given authority over every tribe, people, language and nation. "},{"num":8,"verse":"Everyone living on earth will worship it except those whose names are written in the Book of Life belonging to the Lamb slaughtered before the world was founded. "},{"num":9,"verse":"Those who have ears, let them hear!"},{"num":11,"verse":"Then I saw another beast coming up out of the earth. It had two horns like those of a lamb, but it spoke like a dragon. "},{"num":12,"verse":"It exercises all the authority of the first beast in its presence; and it makes the earth and its inhabitants worship the first beast, the one whose fatal wound had been healed. "},{"num":13,"verse":"It performs great miracles, even causing fire to come down from heaven onto the earth as people watch. "},{"num":14,"verse":"It deceives the people living on earth by the miracles it is allowed to perform in the presence of the beast, and it tells them to make an image honoring the beast that was struck by the sword but came alive again. "},{"num":15,"verse":"It was allowed to put breath into the image of the beast, so that the image of the beast could even speak; and it was allowed to cause anyone who would not worship the image of the beast to be put to death. "},{"num":16,"verse":"Also it forces everyone — great and small, rich and poor, free and slave — to receive a mark on his right hand or on his forehead "},{"num":17,"verse":"preventing anyone from buying or selling unless he has the mark, that is, the name of the beast or the number of its name. "},{"num":18,"verse":"This is where wisdom is needed; those who understand should count the number of the beast, for it is the number of a person, and its number is 666."}]