[{"num":13,"verse":"And then the Dragon NACHASH took his stand on the seashore sand of the yam (sea). And I saw out of the yam (sea) a Chayyah (Beast, Anti-Moshiach) coming up, having eser (ten) karnayim (horns) and shiva (seven) heads and on the horns of it asarah (ten) diadems and on the heads of it there were names of Chillul Hashem gidufim (blasphemies). [DANIEL 7:1-6;11:36]"},{"num":2,"verse":"And the Chayyah which I saw was like a namer and the feet of it as a dov and the mouth of it as the mouth of an aryeh and the Dragon NACHASH gave to the Chayyah its ko’ach and its Kes and its great samchut (authority)."},{"num":3,"verse":"And one of its roshim (heads) seemed to have received a mortal wound and to have been slain, and the wound causing its mavet was healed, and kol ha’aretz marveled, following after the Chayyah."},{"num":4,"verse":"And they worshiped the Dragon NACHASH, because he gave his memshalah (governing authority) to the Chayyah, and they worshiped the Chayyah, saying, “Who is like the Chayyah?” and “Who is able to make war with it?”"},{"num":5,"verse":"And a PEH (mouth, DANIEL 7:8, 20) was given to the Chayyah saying haughty words and Chillul Hashem gidufim (blasphemies), and was given to it ko’ach to act for shnayim and arba’im (two and forty) chodashim (months) [DANIEL 7:8, 11, 20, 25; 11:36]"},{"num":6,"verse":"And it opened the PEH (mouth, DANIEL 7:8,20) of it in Chillul Hashem gidufim (blasphemies) against Hashem to blaspheme ha-Shem (the Name) of him and his Mishkan, that is, the ones tabernacling in Shomayim."},{"num":7,"verse":"And was given to it to make milchamah (war) with the Kadoshim and to overcome the Kadoshim, and was given to it samchut (authority) over every shevet (tribe) and am (people) and lashon (language) and goy (nation). [DANIEL 7:21]"},{"num":8,"verse":"And all the ones dwelling on ha’aretz (the earth) will worship the Chayyah (Beast, Anti-Moshiach), all the ones whose name has not been written in the Sefer HaChayyim of the SEH (Lamb, SHEMOT 12:3; YESHAYAH 53:7, Moshiach) having been slain from lifnei hivvased tevel (before the foundation of the world)."},{"num":9,"verse":"If anyone has an ear let him hear."},{"num":10,"verse":"If anyone is to go LA’SHVEE (into captivity), into LA’SHVEE (captivity) he goes. If anyone is to be killed by a cherev (sword), he by a cherev (sword) is to be killed. Here is the savlanut (patient endurance) and the emunah (faith) of the Kadoshim. [YIRMEYAH 15:2; 43:11]"},{"num":11,"verse":"And I saw another Chayyah (Beast, the Navi Sheker, the False Prophet) coming up out of ha’aretz (the earth), and it had shtey karnayim (two horns) like a SEH, and it was speaking like a Dragon NACHASH."},{"num":12,"verse":"And all the samchut (authority) of the Chayyah harishonah (the first Beast, the Anti-Moshiach) it exercises on [the Anti-Moshiach’s] behalf, and it causes ha’aretz (the earth) and the ones dwelling on it to worship the Chayyah harishonah (the first Beast) whose wound of death was healed."},{"num":13,"verse":"And it (the Navi Sheker, the False Prophet) does otot gedolim (great signs), even making eish (fire) come down out of Shomayim to ha’aretz (the earth) before Bnei Adam. [MELACHIM ALEF 18:38; MELACHIM BAIS 1:10]"},{"num":14,"verse":"And it leads kol ha’aretz (all the earth) into hona’ah (deception) because of the otot (signs) which were given to it to perform before the Chayyah (Beast), telling the ones dwelling on ha’aretz (the earth) to make an Atzav (idol, image, PESEL, graven image, SHMUEL ALEF 31:9; YESHAYAH 21:9) to the Chayyah (Anti-Moshiach) who has the wound of the cherev (sword) and yet came alive again."},{"num":15,"verse":"And it was given to it to give breath to the Atzav (idol, image, PESEL, graven image YESHAYAH 21:9) of the Chayyah (Anti-Moshiach) that the Atzav (idol, image) of the Chayyah might even speak and might cause that as many as would not worship the Atzav (idol, image) of the Chayyah (Beast, Anti-Moshiach) to be killed and to die al kiddush ha-Shem. [DANIEL 3:3, 6]"},{"num":16,"verse":"And it causes all, the Ketanim (small) and the Gedolim (great), both the oishir (rich) and aniyim (poor), the bnei Chorin (freedmen) and avadim (slaves), that to them should be given a tav [mark] on the yad yamin (right hand) and on the metsakh (forehead) of them, [YECHEZKEL 9:4]"},{"num":17,"verse":"And that no one should be able to buy or to sell except the one having the tav [mark], the name of the Chayyah (Beast, Anti-Moshiach) or the number of its name."},{"num":18,"verse":"Here is chochmah: the one having binah, let him do the gematria and get the mispar (number) of the Chayyah (Anti-Moshiach), for it is the mispar (number) of a man, and the mispar of it is SHESH ME’OT V’SHISHIM VASHESH (666)."}]