[{"header":"The animal from the sea"},{"num":1,"verse":"Then, as I stood on the sand of the sea-shore, there rose out of the sea before my eyes an animal with seven heads and ten horns. There were diadems upon its horns and blasphemous names upon its heads. The animal which I saw had the appearance of a leopard, though it had the feet of a bear and a mouth like the mouth of a lion. Then the dragon gave it his own power and throne and great authority. One of its heads appeared to have been wounded to death but the mortal wound had healed."},{"num":4,"verse":"The whole earth followed the animal with wonder, and they worshipped the dragon because he had given authority to the animal. Then they worshipped the animal, too, saying, “Who is like the animal? Who could make war against it?”"},{"num":5,"verse":"It was allowed to speak monstrous blasphemies and to exert its authority for forty-two months."},{"num":6,"verse":"So it poured out blasphemies against God, blaspheming his name and his dwelling place and those who live in Heaven. Moreover, it was permitted to make war upon the saints and to conquer them; the authority given to it extended over every tribe and people and language and nation. All the inhabitants of the earth will worship it—all those whose names have not been written in the book of life which belongs to the Lamb slain from the foundation of the world."},{"header":"Parenthetical: a word to the reader"},{"num":9,"verse":"Let the listener hear this: If any man is destined for captivity he will go into captivity. If any man kills with the sword he must himself be killed with the sword. Amid all this stands the endurance and faith of the saints."},{"header":"The animal from the earth"},{"num":11,"verse":"Then I saw another animal rising out of the earth, and it had two horns like a lamb but it spoke in the voice of a dragon. It uses the full authority of the first animal in its presence. It compels the earth and all its inhabitants to worship the first animal—the one with the mortal wound which had healed."},{"num":13,"verse":"It performs great signs: before men’s eyes it makes fire fall down from heaven to earth. It deceives the inhabitants of the earth by the signs which it is allowed to perform in the presence of the animal, and it tells them to make a statue in honour of the animal which received the sword-thrust and yet survived. Further, it was allowed to give the breath of life to the statue of the animal so that the statue could speak and condemn to death all those who do not worship its statue."},{"num":16,"verse":"Then it compels all, small and great, rich and poor, free men and slaves, to receive a mark on their right hands or on their foreheads. The purpose of this is that no one should be able to buy or sell unless he bears the mark of the name of the animal or the number of its name. Understanding is needed here: let every thinking man calculate the number of the animal. It is the number of a man, and its number is six hundred and sixty-six."}]