[[],[{"type":"header","content":"Jesus Our High Priest"},{"type":"prose","content":"Therefore, holy brothers , partakers of a heavenly calling, consider the Apostle and High Priest of our confession: Jesus;"}],[{"type":"prose","content":"He was faithful to Him who appointed Him, as Moses also was in all His house."}],[{"type":"prose","content":"For He has been counted worthy of more glory than Moses, by just so much as the builder of the house has more honor than the house."}],[{"type":"prose","content":"For every house is built by someone, but the builder of all things is God."}],[{"type":"prose","content":"Now Moses was faithful in all God’s house as a servant, for a testimony of those things which were to be spoken ;"}],[{"type":"prose","content":"but Christ  as a Son over His house—whose house we are, if we hold firmly to our confidence and the boast of our hope."}],[{"type":"prose","content":"Therefore, just as the Holy Spirit says,"},{"type":"poetry","content":"“,"},{"type":"poetry","content":""}],[{"type":"poetry","content":" ,"},{"type":"poetry","content":","},{"type":"poetry","content":""}],[{"type":"poetry","content":" ,"},{"type":"poetry","content":" ."},{"type":"poetry","content":""}],[{"type":"poetry","content":","},{"type":"poetry","content":", ‘,"},{"type":"poetry","content":"’;"},{"type":"poetry","content":""}],[{"type":"poetry","content":","},{"type":"poetry","content":"‘.’”"},{"type":"header","content":"The Danger of Unbelief"}],[{"type":"prose","content":"Take care, brothers , that there will not be in any one of you an evil, unbelieving heart that falls away from the living God."}],[{"type":"prose","content":"But encourage one another every day, as long as it is  called “today,” so that none of you will be hardened by the deceitfulness of sin."}],[{"type":"prose","content":"For we have become partakers of Christ if we keep the beginning of our commitment firm until the end,"}],[{"type":"prose","content":"while it is said,"},{"type":"poetry","content":"“,"},{"type":"poetry","content":" .”"}],[{"type":"prose","content":"For who provoked  when they had heard? Indeed, did not all those who came out of Egypt  by Moses?"}],[{"type":"prose","content":"And with whom was He angry for forty years? Was it not with those who sinned, whose dead bodies fell in the wilderness?"}],[{"type":"prose","content":"And to whom did He swear that they would not enter His rest, but to those who were disobedient?"}],[{"type":"prose","content":"And  we see that they were not able to enter because of unbelief."}]]