[{"num":2,"verse":"And Jesus having returned to Capernaum, after some days it was rumored about that He was in the house [probably Peter’s]."},{"num":2,"verse":"And so many people gathered together there that there was no longer room [for them], not even around the door; and He was discussing the Word."},{"num":3,"verse":"Then they came, bringing a paralytic to Him, who had been picked up and was being carried by four men."},{"num":4,"verse":"And when they could not get him to a place in front of Jesus because of the throng, they dug through the roof above Him; and when they had scooped out an opening, they let down the [thickly padded] quilt or mat upon which the paralyzed man lay."},{"num":5,"verse":"And when Jesus saw their faith [their confidence in God through Him], He said to the paralyzed man, Son, your sins are forgiven [you] and put away [that is, the penalty is remitted, the sense of guilt removed, and you are made upright and in right standing with God]."},{"num":6,"verse":"Now some of the scribes were sitting there, holding a dialogue with themselves as they questioned in their hearts,"},{"num":7,"verse":"Why does this Man talk like this? He is blaspheming! Who can forgive sins [remove guilt, remit the penalty, and bestow righteousness instead] except God alone?"},{"num":8,"verse":"And at once Jesus, becoming fully aware in His spirit that they thus debated within themselves, said to them, Why do you argue (debate, reason) about all this in your hearts?"},{"num":9,"verse":"Which is easier: to say to the paralyzed man, Your sins are forgiven and put away, or to say, Rise, take up your sleeping pad or mat, and start walking about [and keep on walking]?"},{"num":10,"verse":"But that you may know positively and beyond a doubt that the Son of Man has right and authority and power on earth to forgive sins—He said to the paralyzed man,"},{"num":11,"verse":"I say to you, arise, pick up and carry your sleeping pad or mat, and be going on home."},{"num":12,"verse":"And he arose at once and picked up the sleeping pad or mat and went out before them all, so that they were all amazed and  recognized and praised and thanked God, saying, We have never seen anything like this before!"},{"num":13,"verse":"[Jesus] went out again along the seashore; and all the multitude kept gathering about Him, and He kept teaching them."},{"num":14,"verse":"And as He was passing by, He saw Levi (Matthew) son of Alphaeus sitting at the tax office, and He said to him, Follow Me! [Be joined to Me as a disciple, side with My party!] And he arose and joined Him as His disciple and sided with His party and accompanied Him."},{"num":15,"verse":"And as Jesus, together with His disciples, sat at table in his [Levi’s] house, many tax collectors and persons [definitely stained] with sin were dining with Him, for there were many who walked the same road (followed) with Him."},{"num":16,"verse":"And the scribes [belonging to the party] of the Pharisees, when they saw that He was eating with [those definitely known to be especially wicked] sinners and tax collectors, said to His disciples, Why does He eat and drink with tax collectors and [notorious] sinners?"},{"num":17,"verse":"And when Jesus heard it, He said to them, Those who are strong and well have no need of a physician, but those who are weak and sick; I came not to call the righteous ones to repentance, but sinners (the erring ones and all those not free from sin)."},{"num":18,"verse":"Now John’s disciples and the Pharisees were observing a fast; and [some people] came and asked Jesus, Why are John’s disciples and the disciples of the Pharisees fasting, but Your disciples are not doing so?"},{"num":19,"verse":"Jesus answered them, Can the wedding guests fast (abstain from food and drink) while the bridegroom is with them? As long as they have the bridegroom with them, they cannot fast."},{"num":20,"verse":"But the days will come when the bridegroom will be taken away from them, and they will fast in that day."},{"num":21,"verse":"No one sews a patch of unshrunken (new) goods on an old garment; if he does, the patch tears away from it, the new from the old, and the rent (tear) becomes bigger and worse [than it was before]."},{"num":22,"verse":"And no one puts new wine into old wineskins; if he does, the wine will burst the skins, and the wine is lost and the bottles destroyed; but new wine is to be put in new (fresh) wineskins."},{"num":23,"verse":"One Sabbath He was going along beside the fields of standing grain, and as they made their way, His disciples began to pick off the grains."},{"num":24,"verse":"And the Pharisees said to Him, Look! Why are they doing what is not permitted or lawful on the Sabbath?"},{"num":25,"verse":"And He said to them, Have you never [even] read what David did when he was in need and was hungry, he and those who were accompanying him?—"},{"num":26,"verse":"How he went into the house of God when Abiathar was the high priest, and ate the sacred loaves set forth [before God], which it is not permitted or lawful for any but the priests to eat, and [how he] also gave [them] to those who were with him?"},{"num":27,"verse":"And Jesus said to them, The Sabbath was made on account and for the sake of man, not man for the Sabbath;"},{"num":28,"verse":"So the Son of Man is Lord even of the Sabbath."}]