[{"num":2,"verse":"After a while, Yeshua returned to K’far-Nachum. The word spread that he was back, "},{"num":2,"verse":"and so many people gathered around the house that there was no longer any room, not even in front of the door. While he was preaching the message to them, "},{"num":3,"verse":"four men came to him carrying a paralyzed man. "},{"num":4,"verse":"They could not get near Yeshua because of the crowd, so they stripped the roof over the place where he was, made an opening, and lowered the stretcher with the paralytic lying on it. "},{"num":5,"verse":"Seeing their trust, Yeshua said to the paralyzed man, “Son, your sins are forgiven.” "},{"num":6,"verse":"Some Torah-teachers sitting there thought to themselves, "},{"num":7,"verse":"“How can this fellow say such a thing? He is blaspheming! Who can forgive sins except God?” "},{"num":8,"verse":"But immediately Yeshua, perceiving in his spirit what they were thinking, said to them, “Why are you thinking these things? "},{"num":9,"verse":"Which is easier to say to the paralyzed man? ‘Your sins are forgiven’? or ‘Get up, pick up your stretcher and walk’? "},{"num":10,"verse":"But look! I will prove to you that the Son of Man has authority on earth to forgive sins.” He then said to the paralytic, "},{"num":11,"verse":"“I say to you: get up, pick up your stretcher and go home!” "},{"num":12,"verse":"In front of everyone the man got up, picked up his stretcher at once and left. They were all utterly amazed and praised God, saying, “We have never seen anything like this!”"},{"num":13,"verse":"Yeshua went out again by the lake. All the crowd came to him, and he began teaching them. "},{"num":14,"verse":"As he passed on from there, he saw Levi Ben-Halfai sitting in his tax-collection booth and said to him, “Follow me!” And he got up and followed him."},{"num":15,"verse":"As Yeshua was in Levi’s house eating, many tax-collectors and sinners were sitting with Yeshua and his talmidim, for there were many of them among his followers. "},{"num":16,"verse":"When the Torah-teachers and the P’rushim saw that he was eating with sinners and tax-collectors, they said to his talmidim, “Why does he eat with tax-collectors and sinners?” "},{"num":17,"verse":"But, hearing the question, Yeshua answered them, “The ones who need a doctor aren’t the healthy but the sick. I didn’t come to call the ‘righteous’ but sinners!”"},{"num":18,"verse":"Also Yochanan’s talmidim and the P’rushim were fasting; and they came and asked Yeshua, “Why is it that Yochanan’s talmidim and the talmidim of the P’rushim fast, but your talmidim don’t fast?” "},{"num":19,"verse":"Yeshua answered them, “Can wedding guests fast while the bridegroom is still with them? As long as they have the bridegroom with them, fasting is out of the question. "},{"num":20,"verse":"But the time will come when the bridegroom is taken away from them; and when that day comes, they will fast. "},{"num":21,"verse":"No one sews a piece of unshrunk cloth on an old coat; if he does, the new patch tears away from the old cloth and leaves a worse hole. "},{"num":22,"verse":"And no one puts new wine in old wineskins; if he does, the wine will burst the skins, and both the wine and the skins will be ruined. Rather, new wine is for freshly prepared wineskins.”"},{"num":23,"verse":"One Shabbat Yeshua was passing through some wheat fields; and as they went along, his talmidim began picking heads of grain. "},{"num":24,"verse":"The P’rushim said to him, “Look! Why are they violating Shabbat?” "},{"num":25,"verse":"He said to them, “Haven’t you ever read what David did when he and those with him were hungry and needed food? "},{"num":26,"verse":"He entered the House of God when Evyatar was cohen gadol and ate the Bread of the Presence,” — which is forbidden for anyone to eat but the cohanim — “and even gave some to his companions.” "},{"num":27,"verse":"Then he said to them, “Shabbat was made for mankind, not mankind for Shabbat; "},{"num":28,"verse":"So the Son of Man is Lord even of Shabbat.”"}]