[{"header":"Jesus Heals a Paralytic To Prove He Has Authority To Forgive Sins"},{"num":2,"verse":"And having entered again into Capernaum after some days, it was heard that He was at home. "},{"num":2,"verse":"And many were gathered together, so that the house was no longer having-room, not even the places at the door. And He was speaking the word to them. "},{"num":3,"verse":"And they come bringing to Him a paralytic being picked-up by four men. "},{"num":4,"verse":"And not being able to bring him to Him because of the crowd, they unroofed the roof where He was. And having dug out an opening, they lower the cot on-which the paralytic was lying-down. "},{"num":5,"verse":"And Jesus, having seen their faith, says to the paralytic, “Child, your sins are forgiven”. "},{"num":6,"verse":"Now some of the scribes were sitting there and reasoning in their hearts, "},{"num":7,"verse":"“Why is this One speaking in this manner? He is blaspheming. Who is able to forgive sins except One— God?” "},{"num":8,"verse":"And immediately Jesus, having known in His spirit that they were reasoning in this manner within themselves, says to them “Why are you reasoning these things in your hearts? "},{"num":9,"verse":"Which is easier— to say to the paralytic ‘Your sins are forgiven’, or to say ‘Arise, and pick-up your cot and walk’? "},{"num":10,"verse":"But in order that you may know that the Son of Man has authority to forgive sins on earth”— He says to the paralytic, "},{"num":11,"verse":"“I say to you, arise, pick up your cot and go to your house”. "},{"num":12,"verse":"And he arose, and immediately having picked-up the cot, went out in front of everyone, so that everyone was astonished and glorifying God, saying that “We never saw anything like this”."},{"header":"Jesus Calls Levi The Tax Collector And Eats With His Friends: I Came For Sinners"},{"num":13,"verse":"And He went out again beside the sea. And all the multitude was coming to Him. And He was teaching them. "},{"num":14,"verse":"And while passing on He saw Levi, the son of Alphaeus, sitting at the tax-office. And He says to him “Be following Me!” And having stood-up, he followed Him. "},{"num":15,"verse":"And it comes about that He was reclining [to eat] in his house. And many tax-collectors and sinners were reclining-back-with Jesus and His disciples. For there were many, and they were following Him. "},{"num":16,"verse":"And the scribes of the Pharisees, having seen that He was eating with the sinners and tax collectors, were saying to His disciples “Why is it that He is eating with the tax collectors and sinners?” "},{"num":17,"verse":"And having heard, Jesus says to them that “The ones being strong have no need of a physician, but the ones being ill. I did not come to call righteous ones, but sinners”."},{"header":"Why Do Your Disciples Not Fast? The Bridegroom Is Here. New Wine Needs New Wineskins"},{"num":18,"verse":"And the disciples of John and the Pharisees were fasting. And they come and say to Him, “For what reason are the disciples of John and the disciples of the Pharisees fasting, but Your disciples are not fasting?” "},{"num":19,"verse":"And Jesus said to them, “The sons of the wedding-hall cannot be fasting while the bridegroom is with them, can they? As long a time as they have the bridegroom with them, they cannot be fasting. "},{"num":20,"verse":"But days will come when the bridegroom is taken-away from them, and then they will fast in that day. "},{"num":21,"verse":"No one sews a patch of unshrunk cloth on an old garment. Otherwise the fullness [of the patch] takes from it— the new from the old— and a worse tear takes place. "},{"num":22,"verse":"And no one puts new wine into old wineskins. Otherwise the wine will burst the wineskins, and the wine is lost, and the wineskins. But one puts new wine into fresh wineskins”."},{"header":"The Disciples Pluck Grain On The Sabbath. I Am Lord of The Sabbath"},{"num":23,"verse":"And it came about that He was passing through the grainfields on the Sabbath, and His disciples began to make their way while plucking the heads [of grain]. "},{"num":24,"verse":"And the Pharisees were saying to Him, “Look! Why are they doing on the Sabbath what is not lawful?” "},{"num":25,"verse":"And He says to them, “Did you never read [in 1 Sam 21:1-6] what David did when he had a need and was hungry, he and the ones with him— "},{"num":26,"verse":"how he entered into the house of God in the time of Abiathar the high-priest and ate the Bread of Presentation which is not lawful for anyone to eat but the priests, and he gave it also to the ones being with him?” "},{"num":27,"verse":"And He was saying to them, “The Sabbath was made for the sake of mankind, and not mankind for the sake of the Sabbath. "},{"num":28,"verse":"So then, the Son of Man is Lord even of the Sabbath”."}]