[{"header":"Chapter 2"},{"num":1,"verse":"The Healing of a Paralytic. When Jesus returned to Capernaum after some days, it became known that he was at home. "},{"num":2,"verse":"Many gathered together so that there was no longer room for them, not even around the door, and he preached the word to them. "},{"num":3,"verse":"They came bringing to him a paralytic carried by four men. "},{"num":4,"verse":"Unable to get near Jesus because of the crowd, they opened up the roof above him. After they had broken through, they let down the mat on which the paralytic was lying. "},{"num":5,"verse":"When Jesus saw their faith, he said to the paralytic, “Child, your sins are forgiven.” "},{"num":6,"verse":"Now some of the scribes were sitting there asking themselves, "},{"num":7,"verse":"“Why does this man speak that way? He is blaspheming. Who but God alone can forgive sins?” "},{"num":8,"verse":"Jesus immediately knew in his mind what they were thinking to themselves, so he said, “Why are you thinking such things in your hearts? "},{"num":9,"verse":"Which is easier, to say to the paralytic, ‘Your sins are forgiven,’ or to say, ‘Rise, pick up your mat and walk’? "},{"num":10,"verse":"But that you may know that the Son of Man has authority to forgive sins on earth”— "},{"num":11,"verse":"he said to the paralytic, “I say to you, rise, pick up your mat, and go home.” "},{"num":12,"verse":"He rose, picked up his mat at once, and went away in the sight of everyone. They were all astounded and glorified God, saying, “We have never seen anything like this.”"},{"num":13,"verse":"The Call of Levi. Once again he went out along the sea. All the crowd came to him and he taught them. "},{"num":14,"verse":"As he passed by, he saw Levi, son of Alphaeus, sitting at the customs post. He said to him, “Follow me.” And he got up and followed him. "},{"num":15,"verse":"While he was at table in his house, many tax collectors and sinners sat with Jesus and his disciples; for there were many who followed him. "},{"num":16,"verse":"Some scribes who were Pharisees saw that he was eating with sinners and tax collectors and said to his disciples, “Why does he eat with tax collectors and sinners?” "},{"num":17,"verse":"Jesus heard this and said to them [that], “Those who are well do not need a physician, but the sick do. I did not come to call the righteous but sinners.”"},{"num":18,"verse":"The disciples of John and of the Pharisees were accustomed to fast. People came to him and objected, “Why do the disciples of John and the disciples of the Pharisees fast, but your disciples do not fast?” "},{"num":19,"verse":"Jesus answered them, “Can the wedding guests fast while the bridegroom is with them? As long as they have the bridegroom with them they cannot fast. "},{"num":20,"verse":"But the days will come when the bridegroom is taken away from them, and then they will fast on that day. "},{"num":21,"verse":"No one sews a piece of unshrunken cloth on an old cloak. If he does, its fullness pulls away, the new from the old, and the tear gets worse. "},{"num":22,"verse":"Likewise, no one pours new wine into old wineskins. Otherwise, the wine will burst the skins, and both the wine and the skins are ruined. Rather, new wine is poured into fresh wineskins.”"},{"num":23,"verse":"As he was passing through a field of grain on the sabbath, his disciples began to make a path while picking the heads of grain. "},{"num":24,"verse":"At this the Pharisees said to him, “Look, why are they doing what is unlawful on the sabbath?” "},{"num":25,"verse":"He said to them, “Have you never read what David did when he was in need and he and his companions were hungry? "},{"num":26,"verse":"How he went into the house of God when Abiathar was high priest and ate the bread of offering that only the priests could lawfully eat, and shared it with his companions?” "},{"num":27,"verse":"Then he said to them, “The sabbath was made for man, not man for the sabbath. "},{"num":28,"verse":"That is why the Son of Man is lord even of the sabbath.”"}]