[{"header":"The Paralyzed Man Healed"},{"num":2,"verse":"When Jesus came back to Capernaum a few days later, it was heard that He was at home."},{"num":2,"verse":"And many were gathered together, so that there was no longer space, not even near the door; and He was speaking the word to them."},{"num":3,"verse":"And some people *came, bringing to Him a man who was paralyzed, carried by four men."},{"num":4,"verse":"And when they were unable to get to Him because of the crowd, they removed the roof above Him; and after digging an opening, they let down the pallet on which the paralyzed man was lying."},{"num":5,"verse":"And Jesus, seeing their faith, *said to the paralyzed man, “Son, your sins are forgiven.”"},{"num":6,"verse":"But some of the scribes were sitting there and thinking it over in their hearts,"},{"num":7,"verse":"“Why does this man speak that way? He is blaspheming! Who can forgive sins except God alone?”"},{"num":8,"verse":"Immediately Jesus, aware in His spirit that they were thinking that way within themselves, *said to them, “Why are you thinking about these things in your hearts?"},{"num":12,"verse":"And he got up and immediately picked up the pallet and went out in the sight of everyone, so that they were all amazed and were glorifying God, saying, “We have never seen anything like this!”"},{"num":13,"verse":"And He went out again by the seashore; and all the people were coming to Him, and He was teaching them."},{"header":"Levi (Matthew) Called"},{"num":14,"verse":"As He passed by, He saw Levi the son of Alphaeus sitting in the tax office, and He *said to him, “Follow Me!” And he got up and followed Him."},{"num":15,"verse":"And it *happened that He was reclining at the table in his house, and many tax collectors and sinners were dining with Jesus and His disciples; for there were many of them, and they were following Him."},{"num":16,"verse":"When the scribes of the Pharisees saw that He was eating with the sinners and tax collectors, they said to His disciples, “Why is He eating with tax collectors and sinners?”"},{"num":17,"verse":"And hearing this, Jesus *said to them, “It is not those who are healthy who need a physician, but those who are sick; I did not come to call the righteous, but sinners.”"},{"num":18,"verse":"John’s disciples and the Pharisees were fasting; and they *came and *said to Him, “Why do John’s disciples and the disciples of the Pharisees fast, but Your disciples do not fast?”"},{"num":19,"verse":"And Jesus said to them, “While the groom is with them, the attendants of the groom cannot fast, can they? As long as they have the groom with them, they cannot fast."},{"header":"Question of the Sabbath"},{"num":23,"verse":"And it happened that He was passing through the grainfields on the Sabbath, and His disciples began to make their way along while picking the heads of grain."},{"num":24,"verse":"The Pharisees were saying to Him, “Look, why are they doing what is not lawful on the Sabbath?”"},{"num":25,"verse":"And He *said to them, “Have you never read what David did when he was in need and he and his companions became hungry;"},{"num":27,"verse":"Jesus said to them, “The Sabbath was made for man, and not man for the Sabbath."}]