[[],[{"type":"header","content":"Jesus Forgives and Heals a Paralytic(A)"},{"type":"prose","content":"And again He entered Capernaum after  days, and it was heard that He was in the house. "}],[{"type":"prose","content":"Immediately many gathered together, so that there was no longer room to receive  not even near the door. And He preached the word to them. "}],[{"type":"prose","content":"Then they came to Him, bringing a paralytic who was carried by four  "}],[{"type":"prose","content":"And when they could not come near Him because of the crowd, they uncovered the roof where He was. So when they had broken through, they let down the bed on which the paralytic was lying."}],[{"type":"prose","content":"When Jesus saw their faith, He said to the paralytic, "}],[{"type":"prose","content":"And some of the scribes were sitting there and reasoning in their hearts, "}],[{"type":"prose","content":"“Why does this  speak blasphemies like this? Who can forgive sins but God alone?”"}],[{"type":"prose","content":"But immediately, when Jesus perceived in His spirit that they reasoned thus within themselves, He said to them,  "}],[{"type":"prose","content":" "}],[{"type":"prose","content":" —He said to the paralytic, "}],[{"type":"prose","content":" "}],[{"type":"prose","content":"Immediately he arose, took up the bed, and went out in the presence of them all, so that all were amazed and glorified God, saying, “We never saw  like this!”"},{"type":"header","content":"Matthew the Tax Collector(G)"}],[{"type":"prose","content":"Then He went out again by the sea; and all the multitude came to Him, and He taught them. "}],[{"type":"prose","content":"As He passed by, He saw Levi the  of Alphaeus sitting at the tax office. And He said to him,  So he arose and followed Him."}],[{"type":"prose","content":"Now it happened, as He was dining in  house, that many tax collectors and sinners also sat together with Jesus and His disciples; for there were many, and they followed Him. "}],[{"type":"prose","content":"And when the scribes and Pharisees saw Him eating with the tax collectors and sinners, they said to His disciples, “How  that He eats and drinks with tax collectors and sinners?”"}],[{"type":"prose","content":"When Jesus heard  He said to them,  "},{"type":"header","content":"Jesus Is Questioned About Fasting(N)"}],[{"type":"prose","content":"The disciples of John and of the Pharisees were fasting. Then they came and said to Him, “Why do the disciples of John and of the Pharisees fast, but Your disciples do not fast?”"}],[{"type":"prose","content":"And Jesus said to them,   "}],[{"type":"prose","content":"  "}],[{"type":"prose","content":" "}],[{"type":"header","content":"Jesus Is Lord of the Sabbath(Q)"}],[{"type":"prose","content":"Now it happened that He went through the grainfields on the Sabbath; and as they went His disciples began to pluck the heads of grain. "}],[{"type":"prose","content":"And the Pharisees said to Him, “Look, why do they do what is not lawful on the Sabbath?”"}],[{"type":"prose","content":"But He said to them,   "}],[{"type":"prose","content":" "}],[{"type":"prose","content":"And He said to them,   "}],[{"type":"prose","content":" "}]]