[[],[{"type":"header","content":"Jesus Heals a Paralyzed Man"},{"type":"prose","content":"When Jesus returned to Capernaum several days later, the news spread quickly that he was back home."}],[{"type":"prose","content":"Soon the house where he was staying was so packed with visitors that there was no more room, even outside the door. While he was preaching God’s word to them,"}],[{"type":"prose","content":"four men arrived carrying a paralyzed man on a mat."}],[{"type":"prose","content":"They couldn’t bring him to Jesus because of the crowd, so they dug a hole through the roof above his head. Then they lowered the man on his mat, right down in front of Jesus."}],[{"type":"prose","content":"Seeing their faith, Jesus said to the paralyzed man, "}],[{"type":"prose","content":"But some of the teachers of religious law who were sitting there thought to themselves,"}],[{"type":"prose","content":"“What is he saying? This is blasphemy! Only God can forgive sins!”"}],[{"type":"prose","content":"Jesus knew immediately what they were thinking, so he asked them, "}],[],[{"type":"prose","content":" Then Jesus turned to the paralyzed man and said,"}],[],[{"type":"prose","content":"And the man jumped up, grabbed his mat, and walked out through the stunned onlookers. They were all amazed and praised God, exclaiming, “We’ve never seen anything like this before!”"},{"type":"header","content":"Jesus Calls Levi (Matthew)"}],[{"type":"prose","content":"Then Jesus went out to the lakeshore again and taught the crowds that were coming to him."}],[{"type":"prose","content":"As he walked along, he saw Levi son of Alphaeus sitting at his tax collector’s booth.  Jesus said to him. So Levi got up and followed him."}],[{"type":"prose","content":"Later, Levi invited Jesus and his disciples to his home as dinner guests, along with many tax collectors and other disreputable sinners. (There were many people of this kind among Jesus’ followers.)"}],[{"type":"prose","content":"But when the teachers of religious law who were Pharisees saw him eating with tax collectors and other sinners, they asked his disciples, “Why does he eat with such scum?”"}],[{"type":"prose","content":"When Jesus heard this, he told them, "},{"type":"header","content":"A Discussion about Fasting"}],[{"type":"prose","content":"Once when John’s disciples and the Pharisees were fasting, some people came to Jesus and asked, “Why don’t your disciples fast like John’s disciples and the Pharisees do?”"}],[{"type":"prose","content":"Jesus replied, "}],[],[],[{"type":"header","content":"A Discussion about the Sabbath"}],[{"type":"prose","content":"One Sabbath day as Jesus was walking through some grainfields, his disciples began breaking off heads of grain to eat."}],[{"type":"prose","content":"But the Pharisees said to Jesus, “Look, why are they breaking the law by harvesting grain on the Sabbath?”"}],[{"type":"prose","content":"Jesus said to them, "}],[],[{"type":"prose","content":"Then Jesus said to them, "}],[]]