[{"header":"Jesus Heals a Paralyzed Man"},{"num":2,"verse":"Several days later, Jesus returned to Capernaum, and the news quickly spread that he was back in town. "},{"num":2,"verse":"Soon there were so many people crowded inside the house to hear him that there was no more room, even outside the door."},{"num":3,"verse":"four men arrived, carrying a paralyzed man. "},{"num":4,"verse":"But when they realized that they couldn’t even get near him because of the crowd, they went up on top of the house and tore away the roof above Jesus’ head. And when they had broken through, they lowered the paralyzed man on a stretcher right down in front of him! "},{"num":5,"verse":"When Jesus saw the extent of their faith, he said to the paralyzed man, “My son, your sins are now forgiven.”"},{"num":6,"verse":"This offended some of the religious scholars who were present, and they reasoned among themselves, "},{"num":7,"verse":"“Who does he think he is to speak this way? This is blasphemy for sure! Only God himself can forgive sins!”"},{"num":8,"verse":"Jesus supernaturally perceived their thoughts and said to them, “Why are you being so skeptical? "},{"num":9,"verse":"Which is easier, to say to this paralyzed man, ‘Your sins are now forgiven,’ or, ‘Stand up and walk!’? "},{"num":10,"verse":"But to convince you that the Son of Man has been given authority to forgive sins, "},{"num":11,"verse":"I say to this man, ‘Stand up, pick up your stretcher, and walk home.’ ” "},{"num":12,"verse":"Immediately the man was healed and sprang to his feet in front of everyone and left for home."},{"header":"Jesus Calls Levi (Matthew) to Follow Him"},{"num":13,"verse":"Jesus went out to walk near Lake Galilee, and a massive crowd gathered, so he taught them. "},{"num":14,"verse":"As he walked along, he found Levi, the son of Alphaeus, sitting at a tax booth, collecting taxes. He approached him and said, “Come follow me.” Immediately he got up from his booth and began to follow Jesus."},{"num":15,"verse":"Later, Jesus and his disciples went to have a meal with Levi. Among the guests in Levi’s home were many tax collectors and notable sinners sharing a meal with Jesus, for there were many kinds of people who followed him. "},{"num":16,"verse":"But when the religious scholars and the Pharisees found out that Jesus was keeping company and dining with sinners and tax collectors, they were indignant. So they approached Jesus’ disciples and said to them, “Why is it that someone like Jesus defiles himself by eating with sinners and tax collectors?”"},{"num":17,"verse":"But when Jesus overheard their complaint, he said to them, “Who goes to the doctor for a cure? Those who are well or those who are sick? I have not come to call the ‘righteous,’ but those who are sinners and bring them to repentance.”"},{"header":"Jesus Questioned about Fasting"},{"num":18,"verse":"One time, the disciples of John the Baptizer and the Pharisees were fasting. So they came to Jesus and asked, “Why is it that John’s disciples and disciples of the Pharisees are fasting but your disciples are not?”"},{"num":19,"verse":"Jesus answered, “How can the sons of the bridal chamber fast when the bridegroom is next to them? As long as the bridegroom is with them they won’t, "},{"num":20,"verse":"but the days of fasting will come when the Bridegroom is taken from them."},{"num":21,"verse":"“And who would mend worn-out clothing with new fabric? When the new cloth shrinks, it will rip, making the tear worse than before. "},{"num":22,"verse":"And who would pour new wine into an old wineskin? Eventually the wine will ferment and make the wineskin burst, losing everything—the wine will be spilled and the wineskin ruined. Instead, new wine is always poured into new wineskins.”"},{"header":"Jesus, Lord of the Sabbath"},{"num":23,"verse":"One Sabbath, Jesus and his disciples were walking through a field of wheat. The disciples were hungry, so they plucked off some heads of grain to eat. "},{"num":24,"verse":"But when some of the Pharisees saw what was happening, they said to him, “Look! Your disciples shouldn’t be harvesting grain on the Sabbath!”"},{"num":25,"verse":"Jesus responded, “Haven’t you ever read what King David and his men did when they were hungry? "},{"num":26,"verse":"They entered the house of God when Abiathar was high priest and ate the sacred bread of God’s presence. They violated the law by eating bread that only the priests were allowed to eat. But there is one here who is even greater than the temple.”"},{"num":27,"verse":"Then he said to them, “The Sabbath was made for the sake of people, and not people for the Sabbath. "},{"num":28,"verse":"For this reason the Son of Man exercises his lordship over the Sabbath.”"}]