[{"num":12,"verse":"These are the statutes and the ordinances that you are to be conscientious about keeping in the land that the Lord, the God of your fathers, has given to you to possess all the days that you live in the land:"},{"num":2,"verse":"Completely destroy all the places where the nations that you are driving out serve their gods, whether on the high mountains or on the hills or under every beautiful green tree. "},{"num":3,"verse":"Tear down their altars! Smash their sacred memorial stones! Burn their Asherah poles with fire, and cut down the carved images of their gods! In this way you will destroy their names from those places."},{"num":4,"verse":"Do not serve the Lord your God in the way that they worship, "},{"num":5,"verse":"but seek out and go to the site that the Lord your God will choose from within all your tribes to place his name and his dwelling place. "},{"num":6,"verse":"There you are to bring your burnt offerings and your sacrifices, your tithes and the elevated offerings from your hands, your offerings to fulfill a vow, your voluntary offerings, and the firstborn of your herd and your flock. "},{"num":7,"verse":"Eat there in the presence of the Lord your God, and rejoice in everything you do, you and your household, because the Lord your God has blessed you."},{"num":8,"verse":"Do not in any way do what we are doing here today, that is, each person doing whatever is right in his own eyes, "},{"num":9,"verse":"because you have not yet come to your place of rest, the inheritance that the Lord your God is giving to you."},{"num":10,"verse":"But you will cross over the Jordan and settle in the land that the Lord your God is giving you as an inheritance, and he will give you rest from all your enemies all around you, so that you will live in safety. "},{"num":11,"verse":"Then go to the place that the Lord your God chooses as the place to establish his name. There you are to bring everything that I am commanding you: your burnt offerings and your sacrifices, your tithes, the offerings from your hands, and all the best voluntary offerings that you vow to the Lord."},{"num":12,"verse":"You will rejoice before the Lord your God, you and your sons and your daughters, and your male servants and your female servants, and the Levites who live within the gates of your cities, because they do not have an allotted inheritance among you."},{"num":13,"verse":"Be careful that you do not offer up your burnt offering in just any place that you see fit, "},{"num":14,"verse":"but only in the place that the Lord will choose in one of your tribes. That is where you are to offer up your burnt offerings and where you are to do everything that I am commanding you."},{"num":15,"verse":"But in any town you may butcher and eat meat to your heart’s content, as the Lord your God has blessed you. The unclean and the clean person alike may eat it as they would a gazelle or a deer, "},{"num":16,"verse":"but you must never eat the blood. Pour it on the ground like water."},{"num":17,"verse":"You are not to eat the tithe from your grain, your new wine, or your fresh oil in your towns. The same applies to the firstborn of your herd and your flock, or anything you vow, or your voluntary offerings, or your special elevated offerings. "},{"num":18,"verse":"Eat those things before the Lord your God in the place that the Lord your God will choose—you and your sons and your daughters, your male servants and your female servants, and the Levites within your cities. Rejoice before the Lord your God in everything that you are doing."},{"num":19,"verse":"Be careful that you do not neglect the Levites as long as you live on your land."},{"num":20,"verse":"When the Lord your God expands your territory as he promised you, and you say, “I would like to eat meat,” because you are hungry for meat, then you may eat it to your heart’s content. "},{"num":21,"verse":"If the place that the Lord your God will choose to establish his name is too far away for you, then you may slaughter animals from your herd and flock which the Lord has given you, just as I commanded you, and you may eat within your cities as you desire. "},{"num":22,"verse":"Yes, just as gazelle and deer are eaten, you may eat it. The unclean and the clean person alike may eat it. "},{"num":23,"verse":"Only be very sure not to eat the blood, because the blood is the life, and you must not eat the life together with the flesh. "},{"num":24,"verse":"Do not eat it. Pour it out on the ground like water. "},{"num":25,"verse":"Do not eat it, so that it may go well for you and for your children after you when you do what is right in the eyes of the Lord."},{"num":26,"verse":"But as for the holy things that you have and your voluntary offerings, gather them up and take them to the place that the Lord will choose. "},{"num":27,"verse":"Offer your burnt offerings, both the flesh and the blood, on the altar of the Lord your God. The blood of the sacrifice is to be poured out on the altar of the Lord your God, but the meat you may eat."},{"num":28,"verse":"Be careful that you obey all these words that I am commanding you so that it may go well for you and for your children after you in the distant future when you do what is good and right in the eyes of the Lord your God."},{"num":29,"verse":"When the Lord your God cuts off the nations where you are going and drives them out before you, and when you take possession of their land and settle in it, "},{"num":30,"verse":"be careful that you are not snared after they have been destroyed before you. Do not inquire about their gods and ask, “How did these people serve their gods? I also want to do the same thing.”"},{"num":31,"verse":"Do not serve the Lord your God in the way that they worship, because they do for their gods every detestable thing that the Lord hates. They even burn their sons and daughters in fire for their gods."},{"num":32,"verse":"Be careful to do everything that I am commanding you. Do not add to it, and do not subtract from it."}]