[{"header":"Salutation"},{"num":1,"verse":"Jude, a servant of Jesus Christ and brother of James,"},{"num":2,"verse":"May mercy, peace, and love be multiplied to you."},{"header":"Occasion of the Letter"},{"num":3,"verse":"Beloved, being very eager to write to you of our common salvation, I found it necessary to write appealing to you to contend for the faith which was once for all delivered to the saints. "},{"num":4,"verse":"For admission has been secretly gained by some who long ago were designated for this condemnation, ungodly persons who pervert the grace of our God into licentiousness and deny our only Master and Lord, Jesus Christ."},{"header":"Judgment on False Teachers"},{"num":5,"verse":"Now I desire to remind you, though you were once for all fully informed, that he who saved a people out of the land of Egypt, afterward destroyed those who did not believe. "},{"num":6,"verse":"And the angels that did not keep their own position but left their proper dwelling have been kept by him in eternal chains in the nether gloom until the judgment of the great day; "},{"num":7,"verse":"just as Sodom and Gomor′rah and the surrounding cities, which likewise acted immorally and indulged in unnatural lust, serve as an example by undergoing a punishment of eternal fire."},{"num":8,"verse":"Yet in like manner these men in their dreamings defile the flesh, reject authority, and revile the glorious ones. "},{"num":9,"verse":"But when the archangel Michael, contending with the devil, disputed about the body of Moses, he did not presume to pronounce a reviling judgment upon him, but said, “The Lord rebuke you.” "},{"num":10,"verse":"But these men revile whatever they do not understand, and by those things that they know by instinct as irrational animals do, they are destroyed. "},{"num":11,"verse":"Woe to them! For they walk in the way of Cain, and abandon themselves for the sake of gain to Balaam’s error, and perish in Korah’s rebellion. "},{"num":12,"verse":"These are blemishes on your love feasts, as they boldly carouse together, looking after themselves; waterless clouds, carried along by winds; fruitless trees in late autumn, twice dead, uprooted; "},{"num":13,"verse":"wild waves of the sea, casting up the foam of their own shame; wandering stars for whom the nether gloom of darkness has been reserved for ever."},{"num":14,"verse":"It was of these also that Enoch in the seventh generation from Adam prophesied, saying, “Behold, the Lord came with his holy myriads, "},{"num":15,"verse":"to execute judgment on all, and to convict all the ungodly of all their deeds of ungodliness which they have committed in such an ungodly way, and of all the harsh things which ungodly sinners have spoken against him.” "},{"num":16,"verse":"These are grumblers, malcontents, following their own passions, loud-mouthed boasters, flattering people to gain advantage."},{"header":"Warnings and Exhortations"},{"num":17,"verse":"But you must remember, beloved, the predictions of the apostles of our Lord Jesus Christ; "},{"num":18,"verse":"they said to you, “In the last time there will be scoffers, following their own ungodly passions.” "},{"num":19,"verse":"It is these who set up divisions, worldly people, devoid of the Spirit. "},{"num":20,"verse":"But you, beloved, build yourselves up on your most holy faith; pray in the Holy Spirit; "},{"num":21,"verse":"keep yourselves in the love of God; wait for the mercy of our Lord Jesus Christ unto eternal life. "},{"num":22,"verse":"And convince some, who doubt; "},{"num":23,"verse":"save some, by snatching them out of the fire; on some have mercy with fear, hating even the garment spotted by the flesh."},{"header":"Benediction"},{"num":24,"verse":"Now to him who is able to keep you from falling and to present you without blemish before the presence of his glory with rejoicing, "},{"num":25,"verse":"to the only God, our Savior through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and for ever. Amen."}]