[{"header":"Offerings for Accidental Sins"},{"num":4,"verse":"The Lord spoke to Moses and said,"},{"num":2,"verse":"“Tell the Israelites this: A person might sin without meaning to and do something that the Lord commanded should not be done. For example:"},{"num":3,"verse":"“If the anointed priest makes a mistake that leaves the people guilty for their sin, he must offer a young bull to the Lord as a sin offering. The bull must have nothing wrong with it."},{"num":4,"verse":"The anointed priest must bring the bull to the entrance of the Meeting Tent in front of the Lord. He must put his hand on the bull’s head and kill the bull in front of the Lord."},{"num":5,"verse":"Then the anointed priest must get some of the blood from the bull and take it into the Meeting Tent."},{"num":6,"verse":"He must put his finger in the blood and sprinkle the blood seven times before the Lord in front of the curtain of the Most Holy Place."},{"num":7,"verse":"The priest must put some of the blood on the corners of the incense altar. (This altar is in the Meeting Tent, in front of the Lord.) He must pour out the rest of the bull’s blood at the base of the altar of burnt offering. (This altar is at the entrance of the Meeting Tent.)"},{"num":8,"verse":"Then the priest must take all the fat from the bull of the sin offering. He must take the fat that is on and around the inner parts."},{"num":9,"verse":"He must take the two kidneys and the fat covering them near the lower back muscle. He must also take the fat part of the liver. He must remove it with the kidneys."},{"num":10,"verse":"The priest must lift up these things and burn them on the altar for burnt offerings, just as he does for the fellowship offering."},{"num":11,"verse":"But the priest must carry out the bull’s skin, inner parts and body waste, and all the meat, including the head and legs. He must carry those parts outside the camp to the special place where the ashes are poured out. He must put those parts on the wood and burn them there on the ash pile."},{"num":13,"verse":"“The whole nation of Israel might sin without knowing it. They might break one of the commands of the Lord and become guilty of doing something he said must not be done."},{"num":14,"verse":"When they learn about that sin, the community of Israel must offer a young bull as a sin offering for the whole nation. They must bring the bull to the Meeting Tent."},{"num":15,"verse":"The elders of the people must put their hands on the bull’s head in front of the Lord. Then they must kill the bull in front of the Lord."},{"num":16,"verse":"The anointed priest must get some of the bull’s blood and take it into the Meeting Tent."},{"num":17,"verse":"He must put his finger in the blood and sprinkle it seven times in front of the curtain before the Lord."},{"num":18,"verse":"He must put some of the blood on the corners of the altar. (This altar is inside the Meeting Tent, in front of the Lord.) He must then pour out all the blood at the base of the altar of burnt offering. (This altar is at the entrance of the Meeting Tent.)"},{"num":19,"verse":"Then he must take all the fat from the animal and bring it to the altar."},{"num":20,"verse":"He must offer these parts, just as he offered the bull of the sin offering. In this way the priest will make the people pure, and God will forgive them."},{"num":21,"verse":"The priest must carry this bull outside the camp and burn it, just as he burned the other bull. This is the sin offering for the whole community."},{"num":22,"verse":"“A ruler might sin without meaning to and break one of the commands of the Lord. He might do something that his God said must not be done."},{"num":23,"verse":"If he learns about his sin, he must bring a male goat that has nothing wrong with it as his offering."},{"num":24,"verse":"The ruler must put his hand on the goat’s head and kill the goat at the place where they kill the burnt offering before the Lord. The goat is a sin offering."},{"num":25,"verse":"The priest will take some of the blood of the sin offering on his finger and put it on the corners of the altar of burnt offering. He will pour out the rest of the blood at the base of the altar."},{"num":26,"verse":"The priest will burn all the goat’s fat on the altar, just as he does for the fellowship offerings. In this way the priest will make the ruler pure, and God will forgive him."},{"num":27,"verse":"“Finally, one of you common people might sin without meaning to. You might break one of the commands of the Lord and become guilty of doing something he said must not be done."},{"num":28,"verse":"If you learn about that sin, you must bring a female goat that has nothing wrong with it as your sin offering."},{"num":29,"verse":"You must put your hand on the animal’s head and kill it at the place for the burnt offering."},{"num":30,"verse":"Then the priest will take some of the goat’s blood on his finger and put it on the corners of the altar of burnt offering. He will pour out the rest of its blood at the base of the altar."},{"num":31,"verse":"The priest will then remove all of its fat, just as he does for the fellowship offerings. Then he will bring it to the altar as a sweet smell to the Lord. The priest will do this to make you pure, and God will forgive you."},{"num":32,"verse":"“If you bring a lamb as your sin offering, then you must bring a female lamb that has nothing wrong with it."},{"num":33,"verse":"You must put your hand on the animal’s head and kill it as a sin offering in the place where people kill the burnt offering."},{"num":34,"verse":"The priest will take some of the blood from the sin offering on his finger and put it on the corners of the altar of burnt offering. He will pour out the rest of the lamb’s blood at the base of the altar."},{"num":35,"verse":"He will then remove all the lamb’s fat, just as he does for the fellowship offerings. Then he will bring it to the altar as a gift to the Lord. The priest will do this to make you pure, and God will forgive you."}]