[{"header":"Manasseh’s Land West of the Jordan River"},{"num":1,"verse":"Manasseh was Joseph’s oldest son, and Machir was Manasseh’s oldest son. Machir had a son named Gilead, and some of his descendants had already received the regions of Gilead and Bashan because they were good warriors. The other clans of the Manasseh tribe descended from Gilead’s sons Abiezer, Helek, Asriel, Shechem, Hepher, and Shemida. The following is a description of the land they received."},{"num":7,"verse":"The land of the Manasseh tribe went from its northern border with the Asher tribe south to Michmethath, which is to the east of Shechem. The southern border started there, but curved even farther south to include the people who lived around Tappuah Spring. "},{"num":8,"verse":"The town of Tappuah was on Manasseh’s border with Ephraim. Although the land around Tappuah belonged to Manasseh, the town itself belonged to Ephraim."},{"num":9,"verse":"Then the border went west to the Kanah Gorge and ran along the northern edge of the gorge to the Mediterranean Sea. The land south of the gorge belonged to Ephraim. And even though there were a few towns that belonged to Ephraim north of the gorge, the land north of the gorge belonged to Manasseh."},{"num":11,"verse":"Manasseh was supposed to have the following towns with their surrounding villages inside the borders of Issachar’s and Asher’s tribal lands:"},{"num":12,"verse":"But the people of Manasseh could not capture these towns, so the Canaanites kept on living in them. "},{"num":13,"verse":"When the Israelites grew stronger, they made the Canaanites in these towns work as their slaves, though they never did force them to leave."},{"header":"Joseph’s Descendants Ask for More Land"},{"num":14,"verse":"One day the Joseph tribes came to Joshua and asked, “Why didn’t you give us more land? The Lord has always been kind to us, and we have too many people for this small region.”"},{"num":15,"verse":"Joshua replied, “If you have so many people that you don’t have enough room in the hill country of Ephraim, then go into the forest that belonged to the Perizzites and the Rephaim. Clear out the trees and make more room for yourselves there.”"},{"num":16,"verse":"“Even if we do that,” they answered, “there still won’t be enough land for us in the hill country. And we can’t move down into Jezreel Valley, because the Canaanites who live in Beth-Shan and in other parts of the valley have iron chariots.”"},{"num":17,"verse":"“Your tribes do have a lot of people,” Joshua admitted. “I’ll give you more land. Your tribes are powerful, "},{"num":18,"verse":"so you can have the rest of the hill country, but it’s a forest, and you’ll have to cut down the trees and clear the land. You can also have Jezreel Valley. Even though the Canaanites there are strong and have iron chariots, you can force them to leave the valley.”"}]