[{"num":17,"verse":"Then land was given to the tribe of Manasseh. Manasseh was Joseph’s first son. Manasseh’s first son was Makir, the father of Gilead. Makir was a great soldier, so the areas of Gilead and Bashan were given to his family."},{"num":2,"verse":"Land was also given to the other families in the tribe of Manasseh. These families were Abiezer, Helek, Asriel, Shechem, Hepher, and Shemida. All these men were the other sons of Manasseh, the son of Joseph. The families of these men got their share of the land."},{"num":3,"verse":"Zelophehad was the son of Hepher. Hepher was the son of Gilead. Gilead was the son of Makir, and Makir was the son of Manasseh. Zelophehad did not have any sons, but he had five daughters. The daughters were named Mahlah, Noah, Hoglah, Milcah, and Tirzah."},{"num":4,"verse":"The daughters went to Eleazar the priest, Joshua son of Nun, and all the leaders. The daughters said, “The Lord told Moses to give us land the same as our male relatives.” So Eleazar obeyed the Lord and gave the daughters some land, just like their uncles."},{"num":5,"verse":"So the tribe of Manasseh had ten areas of land west of the Jordan River and two more areas of land, Gilead and Bashan, on the other side of the Jordan River."},{"num":6,"verse":"So these women from the tribe of Manasseh got land the same as the men. The land of Gilead was given to the rest of the families of Manasseh."},{"num":7,"verse":"The lands of Manasseh were in the area between Asher and Micmethath. This is near Shechem. The border went south to the En Tappuah area."},{"num":8,"verse":"The land around Tappuah belonged to Manasseh, but the town itself did not. The town of Tappuah was at the border of Manasseh’s land, and it belonged to the people of Ephraim."},{"num":9,"verse":"The border of Manasseh continued south to Kanah Ravine. This area belonged to the tribe of Manasseh, but the cities belonged to the people of Ephraim. Manasseh’s border was on the north side of the river and it continued west to the Mediterranean Sea."},{"num":10,"verse":"The land to the south belonged to Ephraim. And the land to the north belonged to Manasseh. The Mediterranean Sea was the western border. The border touched Asher’s land in the north and Issachar’s land in the east."},{"num":11,"verse":"The people of Manasseh had towns in the area of Issachar and Asher. Beth Shean, Ibleam, and the small towns around them also belonged to them. The people of Manasseh also lived in Dor, Endor, Taanach, Megiddo, and the small towns around these cities. They also lived in the three towns of Naphoth."},{"num":12,"verse":"The people of Manasseh were not able to defeat those cities. So the Canaanites continued to live there."},{"num":13,"verse":"But the Israelites grew strong. When this happened, they forced the Canaanites to work for them. But they did not force them to leave that land."},{"num":14,"verse":"The tribe of Joseph spoke to Joshua and said, “You gave us only one area of land, but we are many people. Why did you give us only one part of all the land that the Lord gave his people?”"},{"num":15,"verse":"Joshua answered them, “If you have too many people, go up to the wooded area in the hill country and clear that land for a place to live. That land now belongs to the Perizzites and the Rephaites. But if the hill country of Ephraim is too small for you, go take that land.”"},{"num":16,"verse":"The people of Joseph said, “It is true that the hill country of Ephraim is not large enough for us. But the Canaanites living there have powerful weapons—they have iron chariots! And they control Jezreel Valley, Beth Shean, and all the small towns in that area.”"},{"num":17,"verse":"Then Joshua said to the people of Joseph, the tribes of Ephraim and Manasseh, “You have many people and you are very strong, so you should get more than one share of the land."},{"num":18,"verse":"You will take these mountains. It is a forest, but you can cut down the trees and make it a good place to live. You can take it from the Canaanites and force them to leave. You can defeat them, even if they are strong and have iron chariots.”"}]