[[],[{"type":"header","content":"The Sealing of the 144,000"},{"type":"prose","content":"After this I saw four angels standing at the four corners of the earth, holding back the four winds of the earth so no wind could blow on the earth, on the sea, or on any tree. "}],[{"type":"prose","content":"Then I saw another angel ascending from the east, who had the seal of the living God. He shouted out with a loud voice to the four angels who had been given permission to damage the earth and the sea: "}],[{"type":"prose","content":"“Do not damage the earth or the sea or the trees until we have put a seal on the foreheads of the servants of our God.” "}],[{"type":"prose","content":"Now I heard the number of those who were marked with the seal, 144,000, sealed from all the tribes of the people of Israel:"}],[{"type":"prose","content":"After these things I looked, and here was an enormous crowd that no one could count, made up of persons from every nation, tribe, people, and language, standing before the throne and before the Lamb dressed in long white robes, and with palm branches in their hands. "}],[{"type":"prose","content":"They were shouting out in a loud voice,"}],[{"type":"prose","content":"And all the angels stood there in a circle around the throne and around the elders and the four living creatures, and they threw themselves down with their faces to the ground before the throne and worshiped God, "}],[{"type":"prose","content":"saying,"}],[{"type":"prose","content":"Then one of the elders asked me, “These dressed in long white robes—who are they and where have they come from?” "}],[{"type":"prose","content":"So I said to him, “My lord, you know the answer.” Then he said to me, “These are the ones who have come out of the great tribulation. They have washed their robes and made them white in the blood of the Lamb! "}],[{"type":"prose","content":"For this reason they are before the throne of God, and they serve him day and night in his temple, and the one seated on the throne will shelter them. "}],[{"type":"prose","content":", "}],[{"type":"prose","content":"because the Lamb in the middle of the throne will shepherd them and lead them to springs of living water,  .”"}]]