[{"num":7,"verse":"After this I saw arba’ah malachim (angels) taking their stand on the arbah pinot ha’aretz (the four corners of the earth), holding the four winds of ha’aretz (the earth) so that wind should not blow on ha’aretz (the earth) nor on the yam (sea) nor on any etz (tree). [YESHAYAH 11:12; YIRMEYAH 49:36; YECHEZKEL 37:9; DANIEL 7:2; ZECHARYAH 6:5]"},{"num":2,"verse":"And I saw another malach (angel) coming up from the rising of the shemesh (sun), having a chotam (seal) of the Elohim Chayyim (Living G-d), and he cried with a kol gadol (loud voice) to the four malachim (angels). These were the malachim to whom it was given to harm ha’aretz (the earth) and hayam (the sea),"},{"num":3,"verse":"Saying, Do not harm ha’aretz (the earth) nor hayam (the sea) nor haetzim (the trees), until we have marked with the chotam (seal) the avadim (servants) of Eloheinu upon their metsakhim (foreheads). [YECHEZKEL 9:4]"},{"num":4,"verse":"And I heard the mispar (number) of the ones having been sealed, 144,000, having been marked with the chotam (seal) from kol shivtei Bnei Yisroel (every tribe of the Sons of Israel),"},{"num":5,"verse":"Of the shevet of Yehudah, 12,000 having been sealed; of the shevet of Re’uven, 12,000, of the shevet of Gad, 12,000,"},{"num":6,"verse":"Of the shevet of Asher, 12,000, of the shevet of Naphtali, 12,000, of the shevet of M’nasheh, 12,000,"},{"num":7,"verse":"Of the shevet of Shim’on, 12,000, of the shevet of Levi, 12,000, of the shevet of Yissass’khar, 12,000,"},{"num":8,"verse":"Of the shevet of Z’vulun, 12,000, of the shevet of Yosef, 12,000, of the shevet of Binyamin, 12,000."},{"num":9,"verse":"After these things I looked, and, hinei, a great multitude, which to number no one was being able, out of every nation and from shevatim (tribes) and haumim (the peoples) and lashonot (tongues), standing before the Kes (Throne) and before the SEH (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach), each clothed with a kittel and lulavim in their hands."},{"num":10,"verse":"And they cried with a kol gadol (loud voice), saying, Yeshu’at Eloheinu is of Hashem, our G-d, the One sitting on the Kes (Throne), and of the SEH (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach)."},{"num":11,"verse":"And all the malachim stood around the Kes (Throne) and the Zekenim (Elders, SHEMOT 12:21) and the Arbah Chayyot and they fell before the Kes (Throne) on their faces and they worshiped Hashem, saying, [TEHILLIM 3:8]"},{"num":12,"verse":"Omein, the bracha (blessing) and the kavod (glory) and the chochmah (wisdom) and the hodayah (thanksgiving) and the hod (honor) and the oz (power) and the gevurah (strength) be to Hashem Eloheinu l’Olelamei Olamim. Omein."},{"num":13,"verse":"And one of the Zekenim (Elders, SHEMOT 12:21) answered, saying to me, These ones, each wearing a kittel, who are they and from where did they come?"},{"num":14,"verse":"And I said to him, Adoni, you have da’as. And he said to me, These are the ones coming out of HaTzarah HaGedolah (The Great Tribulation, Mt. 24:29) and each washed his kittel and whitened it in the dahm of the SEH (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach)."},{"num":15,"verse":"Therefore, they are before the Kes (Throne) of Hashem and serve Him yomam valailah in His Beis Hamikdash, and the One sitting on the Kes (Throne) will pitch the tent of His Mishkan over them. [YESHAYAH 4:5]"},{"num":16,"verse":"They will hunger no more nor thirst nor shall the shemesh (sun) strike them nor any scorching heat, [YESHAYAH 49:10]"},{"num":17,"verse":"Because the SEH, (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach) at the center of the Kes (Throne), will shepherd them and will lead them to the Makor Mayim Chayyim [\"Fountain, source of Living Waters,\" YIRMEYAH 2:13], and Hashem will wipe away every tear from their eynayim. [YESHAYAH 25:8; 35:10; 51:11; 65:19]"}]