[{"header":"Judgment stayed for the sealing of God’s people"},{"num":1,"verse":"Later I saw four angels standing at the four corners of the earth holding in check the four winds of the earth that none should blow upon the earth or upon the sea or upon any tree. Then I saw another angel ascending out of the east, holding the seal of the living God. He cried out in a loud voice to the four angels who had the power to harm the earth and the sea: “Do no harm to the earth, nor to the sea, nor to the trees until we have sealed the servants of our God upon their foreheads.”"},{"num":4,"verse":"I heard the number of those who were thus sealed and it was 144,000, from every tribe of the sons of Israel. Twelve thousand were sealed from the tribe of Judah; twelve thousand from the tribe of Reuben; twelve thousand from the tribe of Gad; twelve thousand from the tribe of Asher; twelve thousand from the tribe of Naphtali; twelve thousand from the tribe of Manasseh; twelve thousand from the tribe of Simeon; twelve thousand from the tribe of Levi; twelve thousand from the tribe of Issachar; twelve thousand from the tribe of Zebulun; twelve thousand from the tribe of Joseph; and twelve thousand from the tribe of Benjamin."},{"header":"The countless host of the redeemed"},{"num":9,"verse":"When this was done I looked again, and before my eyes appeared a vast crowd beyond man’s power to number. They came from every nation and tribe and people and language, and they stood before the throne of the Lamb, dressed in white robes with palm-branches in their hands. With a great voice they shouted these words: “Salvation belongs to our God who sits upon the throne and to the Lamb!”"},{"num":11,"verse":"Then all the angels stood encircling the throne, the elders and the four living creatures, and prostrated themselves with heads bowed before the throne and worshipped God, saying, “Amen! Blessing and glory and wisdom and thanksgiving and honour and power and strength be given to our God for timeless ages!”"},{"header":"The countless host explained"},{"num":13,"verse":"Then one of the elders addressed me and asked, “These who are dressed in white robe—who are they, and where do they come from?!"},{"num":14,"verse":"“You know, my Lord,” I answered him."},{"num":14,"verse":"Then he told me, “These are those who have come through the great oppression: they have washed their robes and made them white in the blood of the Lamb. That is why they now have their place before the throne of God, and serve him day and night in his temple. He who sits upon the throne will be their shelter. They will never again know hunger or thirst. The sun shall never beat upon them, neither shall there be any scorching heat, for the Lamb who is in the centre of the throne will be their shepherd and will lead them to springs of living water. And God will wipe away every tear from their eyes.”"}]