[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 6:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Come, let us return, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Bishop Horsley considers the prophet as speaking here in his own person, to the end of the 3d verse, and taking occasion, from the intimation of pardon to the penitent, given in the conclusion of the preceding chapter, to address his countrymen in words of mild, pathetic persuasion, and to exhort them to return to the worship and service of God. But many other commentators rather think these are to be considered as the words of the repenting and returning Jews and Israelites in their exile, who, it is said, in the last clause of the foregoing chapter, would in their affliction seek God, which they are here represented as encouraging one another to do, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Not only the LXX., but, according to Houbigant, the Arabic, Syriac, and Chaldee, supply the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "before this verse. Whether they did this as interpreters, which, says Archbishop Newcome, is my opinion, or whether they read in their copy of the Hebrew text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "לאמר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saying,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is uncertain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let us return unto the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He it is who hath brought us into this estate under which we groan; and he is able, if he think fit, to deliver us from it in a short time: nothing is difficult to him. Full of mercy as he is, he will not permit us to continue long in captivity and oppression, wherein we are buried like the dead in the tomb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath torn, and he will heal us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The same God that punisheth us can only remove his judgments, and show us mercy. The expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath torn, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "relates to what was said ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-3 Those who have gone from God by consent, and in a body, drawing one another to sin, should, by consent and in a body, return to him, which will be for his glory, and their good. It will be of great use for support under afflictions, and to encourage our repentance, to keep up good thoughts of God, and of his purposes and designs concerning us. Deliverance out of trouble should be to them as life from the dead. God will revive them: the assurance of this should engage them to return to him. But this seems to have a further reference to the resurrection of Jesus Christ. Let us admire the wisdom and goodness of God, that when the prophet foretold the deliverance of the church out of her troubles, he should point out our salvation by Christ; and now these words are fulfilled in the resurrection of Christ, it confirms our faith, that this is He that should come and we are to look for no other. Here is a precious blessing promised; this is life eternal, to know God. The returns of the favour of God are secured to us as firmly as the return of the morning after a dark night. He shall come to us as the latter and former rain unto the earth, which refreshes it, and makes it fruitful. The grace of God in Christ is both the latter and the former rain; and by it the good work of our fruit-bearing is begun and carried on. And as the Redeemer was raised from the grave, so will He revive the hearts and hopes of all that trust in him. The feeblest glimpse of hope in his word, is a sure earnest of increasing light and comfort, which shall be attended with purifying, comforting grace that makes fruitful.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Come and let us return unto the Lord - These words depend closely on the foregoing. They are words put into their mouth by God Himself, with which or with the like, they should exhort one another to return to God. Before, when God smote them, they had gone to Assyria; now they should turn to Him, owning, not only that He who \"tore\" has the power and the will to \"heal\" them, but that He tore, \"in order to\" heal them; He smote them, \"in order to\" bind them up. This closeness of connection is expressed in the last words; literally, \"smite He and He will bind us up.\" \"He smiteth the putrefaction of the misdeed; He healeth the pain of the wound. Physicians do this; they cut; they smite; they heal; they arm themselves in order to strike; they carry steel, and come to cure.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They are not content to return singly or to be saved alone. Each encourageth another to repentance, as before to evil. The dry bones, scattered on the face of the earth, reunite. There is a general movement among those \"who sat in darkness and the shadow of death,\" to return together to Him, who is the source of life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They are not content to return singly or to be saved alone. Each encourageth another to repentance, as before to evil. The dry bones, scattered on the face of the earth, reunite. There is a general movement among those \"who sat in darkness and the shadow of death,\" to return together to Him, who is the source of life. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 6",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ho 6:1-11. The Israelites' Exhortation to One Another to Seek the Lord.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "At Ho 6:4 a new discourse, complaining of them, begins; for Ho 6:1-3 evidently belong to Ho 5:15, and form the happy termination of Israel's punishment: primarily, the return from Babylon; ultimately, the return from their present long dispersion. Ho 6:8 perhaps refers to the murder of Pekahiah; the discourse cannot be later than Pekah's reign, for it was under it that Gilead was carried into captivity (2Ki 15:29).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. let us return—in order that God who has \"returned to His place\" may return to us (Ho 5:15).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "torn, and … heal—(De 32:39; Jer 30:17). They ascribe their punishment not to fortune, or man, but to God, and acknowledge that none (not the Assyrian, as they once vainly thought, Ho 5:13) but God can heal their wound. They are at the same time persuaded of the mercy of God, which persuasion is the starting-point of true repentance, and without which men would not seek, but hate and flee from God. Though our wound be severe, it is not past hope of recovery; there is room for grace, and a hope of pardon. He hath smitten us, but not so badly that He cannot heal us (Ps 130:4).An exhortation to repentance, Hosea 6:1-3. A complaint against Israel and Judah for persisting still in their wickedness, Hosea 6:4-11.  The former chapter ended with a declaration of God’s resolution to bring his own chosen ones, true Israelites, by deep distresses to repentance, and to seek him whom they had forsaken; this chapter begins with a declaration of the success of this project. The prophet therefore brings them in exhorting and calling upon one another, and encouraging each other; the phrase you have Isaiah 2:3 Micah 4:2, &c. Let us return unto the Lord;  let us be wiser at last, idols have not profited us, they have been our sin, and our fall; we forsook the fountain of living water when we did forsake the Lord. Let us now, with repenting hearts, leave idols, and return to the Lord; let us cast them off, and betake ourselves to the worship, obedience, love, and fear of the Lord, the only true and eternal God. For he hath torn;  we now see his hand in all we suffer, and as it is his we own it very just: we, like froward rebels, sought our help from his enemies, and he, as he threatened, hath met us, like a lion, and hath torn us: his voice in the judgment, like the roaring of a lion, hath awakened us; and our bleeding wounds have told us, that God hath done all this against us, and all this because we were departed from him. And he will heal us;  for, beside his mercy inclining him, we know it was his design by this course to recover us to himself; and we are assured he hath withdrawn his hand. left us in perplexities, but till we would seek, till we would be willing to be healed: he will be our Physician, and by his lenitives will ease and cure us, now his severer course hath abated our phrensy. The Assyrian king could not, but Israel’s God and King can and will heal. He hath smitten;  the same thing in a different simile, God hath wounded. And he will bind us up,  as a skillful and tender chirurgeon binds up with plasters, and swathes to heal. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "torn, and … heal—(De 32:39; Jer 30:17). They ascribe their punishment not to fortune, or man, but to God, and acknowledge that none (not the Assyrian, as they once vainly thought, Ho 5:13) but God can heal their wound. They are at the same time persuaded of the mercy of God, which persuasion is the starting-point of true repentance, and without which men would not seek, but hate and flee from God. Though our wound be severe, it is not past hope of recovery; there is room for grace, and a hope of pardon. He hath smitten us, but not so badly that He cannot heal us (Ps 130:4).An exhortation to repentance, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 6:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A complaint against Israel and Judah for persisting still in their wickedness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 6:4-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The former chapter ended with a declaration of God’s resolution to bring his own chosen ones, true Israelites, by deep distresses to repentance, and to seek him whom they had forsaken; this chapter begins with a declaration of the success of this project. The prophet therefore brings them in exhorting and calling upon one another, and encouraging each other; the phrase you have ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 2:3 Micah 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Let us return unto the Lord; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " let us be wiser at last, idols have not profited us, they have been our sin, and our fall; we forsook the fountain of living water when we did forsake the Lord. Let us now, with repenting hearts, leave idols, and return to the Lord; let us cast them off, and betake ourselves to the worship, obedience, love, and fear of the Lord, the only true and eternal God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "For he hath torn; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we now see his hand in all we suffer, and as it is his we own it very just: we, like froward rebels, sought our help from his enemies, and he, as he threatened, hath met us, like a lion, and hath torn us: his voice in the judgment, like the roaring of a lion, hath awakened us; and our bleeding wounds have told us, that God hath done all this against us, and all this because we were departed from him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And he will heal us; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for, beside his mercy inclining him, we know it was his design by this course to recover us to himself; and we are assured he hath withdrawn his hand. left us in perplexities, but till we would seek, till we would be willing to be healed: he will be our Physician, and by his lenitives will ease and cure us, now his severer course hath abated our phrensy. The Assyrian king could not, but Israel’s God and King can and will heal. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "He hath smitten; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the same thing in a different simile, God hath wounded. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And he will bind us up, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as a skillful and tender chirurgeon binds up with plasters, and swathes to heal. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Come, and let us return unto the Lord,.... The Septuagint and Arabic versions connect these words with the last clause of the preceding chapter, adding the word, \"saying\"; and so the Targum and Syriac version, \"they shall say\"; and very rightly as to the sense; for they are the words of those persons under the afflicting hand of God; and, being brought thereby to a sense of their sins, acknowledge them, and seek to the Lord for pardon, and encourage one another so to do; as Israel and Judah will in the latter day, when the veil shall be taken off their minds, the hardness of their heart removed, and they shall be converted, and turn to the Lord, and seek him together, weeping as they go; having both faith in Christ, and repentance towards God, by which they will return unto him; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so all sinners sensible of their departure from God by sin, and of the evil and danger of it, repent of it, and loath it, confess and acknowledge it, depart from it, and forsake it; and return to the Lord, having some view and apprehension of him as a God, gracious and merciful in Christ; imploring the forgiveness of their sins, with some degree of faith and confidence in him; and not having only love to their own souls, and the welfare of them, but also to the souls of others, exhort and encourage them to join with them in the same acts of faith, repentance, and obedience. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"let us return to the worship of the Lord;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from which they have sadly departed. The arguments or reasons follow, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for he hath torn, and he will heal us; he hath smitten, and he will bind us up; the same hand that has torn will heal and that has smitten will bind up, and none else can; and therefore there is a necessity of returning to him for healing and a cure, Deuteronomy 32:39; and his tearing is in order to heal, and his smiting in order to bind up; and, as sure as he has done the one, he will do the other, and therefore there is great encouragement to apply to him; all which the Jews will be sensible of in the last day; and then the Lord, who is now tearing them in his wrath, and smiting them in his sore displeasure, both in their civil and church state, dispersing them among the nations, and has been so doing for many hundred years, will \"bind up the breach of his people, and heal the stroke of their wound\", Isaiah 30:26; and so the Lord deals with all his people, who are truly and really converted by him; he rends their heart, tears the caul of it; pricks and cuts them to the heart; smites them with the hammer of his word; wounds their consciences with a sense of sin; lets in the law into them, which works wrath, whereby they become broken and contrite; and all this in order to their turning to him that smites them, and be healed, and in love to their souls, though for the present grievous to bear: and then the great Physician heals them by his stripes and wounds; by the application of his blood; by means of his word, the Gospel of peace and pardon; by a look to him, and a touch of him by faith; by discoveries of his love, and particularly his pardoning grace and mercy, which as oil and wine he pours into the wounds made by sin, and binds them up; and which he heals universally, both with respect to persons and diseases, for which he is applied unto, and infallibly, thoroughly, and perfectly, and all freely. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for he hath torn, and he will heal us; he hath smitten, and he will bind us up; the same hand that has torn will heal and that has smitten will bind up, and none else can; and therefore there is a necessity of returning to him for healing and a cure, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and his tearing is in order to heal, and his smiting in order to bind up; and, as sure as he has done the one, he will do the other, and therefore there is great encouragement to apply to him; all which the Jews will be sensible of in the last day; and then the Lord, who is now tearing them in his wrath, and smiting them in his sore displeasure, both in their civil and church state, dispersing them among the nations, and has been so doing for many hundred years, will \"bind up the breach of his people, and heal the stroke of their wound\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so the Lord deals with all his people, who are truly and really converted by him; he rends their heart, tears the caul of it; pricks and cuts them to the heart; smites them with the hammer of his word; wounds their consciences with a sense of sin; lets in the law into them, which works wrath, whereby they become broken and contrite; and all this in order to their turning to him that smites them, and be healed, and in love to their souls, though for the present grievous to bear: and then the great Physician heals them by his stripes and wounds; by the application of his blood; by means of his word, the Gospel of peace and pardon; by a look to him, and a touch of him by faith; by discoveries of his love, and particularly his pardoning grace and mercy, which as oil and wine he pours into the wounds made by sin, and binds them up; and which he heals universally, both with respect to persons and diseases, for which he is applied unto, and infallibly, thoroughly, and perfectly, and all freely. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Come, and let {a} us return unto the LORD: for he hath torn, and he will heal us; he hath smitten, and he will bind us up.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Come, and let ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " us return unto the LORD: for he hath torn, and he will heal us; he hath smitten, and he will bind us up.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) He shows the people that they ought to turn to the Lord, so that he might stop his plagues.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he will heal us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] At any rate the Israelites have found out the true physician (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Assyria ‘could not heal them’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet enters into the feelings of the only too quickly repentant Israelites, and imagines them encouraging each other to return to Jehovah. These three verses are closely connected with the end of the preceding chapter; comp. ‘let us return’, ‘he hath torn’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 6:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), and ‘his going forth’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 6:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), with ‘I will go and return’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and ‘I, even I, will tear’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is parenthetical. Comp. the similar profession of the Israelites in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - These three verses have, by the division into chapters, been violently and improperly torn from the preceding chapter, to which they naturally belong. Their connection with the foregoing sentiments is indicated by the ancient versions  - Chaldee and Septuagint, the LXX., for example, inserting ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "λέγοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as if the reading had been ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לֵאסֹר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": This ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " represents the Israelites exhorting one another in that good time which the prophet encourages them to expect. But ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it may be regarded as the prophet's own exhortation to the exiles; their affliction urging them to seek the Lord, and their encouragement consisting in the knowledge of his ability and willingness to heal the wounds which his own hand had inflicted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath torn, and he will heal us.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The presence of the pronoun imparts emphasis to the statement, so that it is rather, he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "it is that hath torn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the preterit of this verse, compared with the future in ver. 14 of the foregoing chapter, implies that the destruction there predicted has become an accomplished fact. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath smitten, and he will bind us up.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The language is figurative, and borrowed from medical science. Jehovah, not Jareb nor any sovereign of Assyria, is the physician. Long before he had assured his people Israel of this, saying, \"I am the Lord that healeth thee\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and again, \"I kill, and I make alive; I wound, and I heal\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Aben Ezra, commenting on ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "yachbeshena",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", alludes to the ancient mode of surgical practice, probably as indicated m ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": A wound needs to be pressed out and bound up, and afterwards softened with oil.\" Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To this threat the prophet appends in the concluding strophe, both the command to return to the Lord, and the promise that the Lord will raise His smitten nation up again, and quicken them anew with His grace. The separation of these three verses from the preceding one, by the division of the chapters, is at variance with the close connection in the actual contents, which is so perfectly obvious in the allusion made in the words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Come, and let us return,\" to those of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"I will go, and return,\" and in טרף וירפּאנוּ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the similar words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Come, and let us return to Jehovah: for He has torn in pieces, and will heal us; He has smitten, and will bind us up. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He will quicken us after two days; on the third He will raise us up, that we may live before Him.\" The majority of commentators, following the example of the Chald. and Septuagint, in which לאמר, λέγοντες, is interpolated before לכוּ, have taken the first three verses as an appeal to return to the Lord, addressed by the Israelites in exile to one another. But it would be more simple, and more in harmony with the general style of Hosea, which is characterized by rapid transitions, to take the words as a call addressed by the prophet in the name of the exile. The promise in v. 3 especially is far more suitable to a summons of this kind, than to an appeal addressed by the people to one another. As the endurance of punishment impels to seek the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so the motive to return to the Lord is founded upon the knowledge of the fact that the Lord can, and will, heal the wounds which He inflicts. The preterite târaph, as compared with the future 'etrōph in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", presupposes that the punishment has already begun. The following יך is also a preterite with the Vav consec. omitted. The Assyrian cannot heal (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but the Lord, who manifested Himself as Israel's physician in the time of Moses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and promised His people healing in the future also (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), surely can. The allusion in the word ירפּאנוּ to this passage of Deuteronomy, is placed beyond all doubt by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words, \"He revives after two days,\" etc., are merely a special application of the general declaration, \"I kill, and make alive\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to the particular case in hand. What the Lord there promises to all His people, He will also fulfil upon the ten tribes of Israel. By the definition \"after two days,\" and \"on the third day,\" the speedy and certain revival of Israel is set before them. Two and three days are very short periods of time; and the linking together of two numbers following one upon the other, expresses the certainty of what is to take place within this space of time, just as in the so-called numerical sayings in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 30:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which the last and greater number expresses the highest or utmost that is generally met with. הקים, to raise the dead (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 88:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"That we may live before Him:\" i.e., under His sheltering protection and grace (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The earlier Jewish and Christian expositors have taken the numbers, \"after two days, and on the third day,\" chronologically. The Rabbins consequently suppose the prophecy to refer either to the three captivities, the Egyptian, the Babylonian, and the Roman, which has not ended yet; or to the three periods of the temple of Solomon, of that of Zerubbabel, and of the one to be erected by the Messiah. Many of the fathers, on the other hand, and many of the early Lutheran commentators, have found in them a prediction of the death of Christ and His resurrection on the third day. Compare, for example, Calovii Bibl. illustr. ad h. l., where this allusion is defended by a long series of undeniably weak arguments, and where a fierce attack is made, not only upon Calvin, who understood these words as \"referring to the liberation of Israel from captivity, and the restoration of the church after two days, i.e., in a very short time;\" but also upon Grotius, who found, in addition to the immediate historical allusion to the Israelites, whom God would soon liberate from their death-like misery after their conversion, a foretype, in consequence of a special divine indication, of the time \"within which Christ would recover His life, and the church its hope.\" But any direct allusion in the hope here uttered to the death and resurrection of Christ, is proved to be untenable by the simple words and their context. The words primarily hold out nothing more than the quickening of Israel out of its death-like state of rejection from the face of God, and that in a very short period after its conversion to the Lord. This restoration to life cannot indeed be understood as referring to the return of the exiles to their earthly fatherland; or, at all events, it cannot be restricted to this. It does not occur till after the conversion of Israel to the Lord its God, on the ground of faith in the redemption effected through the atoning death of Christ, and His resurrection from the grave; so that the words of the prophet may be applied to this great fact in the history of salvation, but without its being either directly or indirectly predicted. Even the resurrection of the dead is not predicted, but simply the spiritual and moral restoration of Israel to life, which no doubt has for its necessary complement the reawakening of the physically dead. And, in this sense, our passage may be reckoned among the prophetic utterances which contain the germ of the hope of a life after death, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:19-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in the vision of Ezekiel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:1-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That it did not refer to this in its primary sense, and so far as its historical fulfilment was concerned, is evident from the following verse. Hosea 6:3. \"Let us therefore know, hunt after the knowledge of Jehovah. His rising is fixed like the morning dawn, that He may come to us like the rain, and moisten the earth like the latter rain.\" ונדעה נר corresponds to לכוּ ונשׁוּבה in Hosea 6:1. The object to נדעה is also את־יהוה, and נדעה is merely strengthened by the addition of נרדּפה לדּעת. The knowledge of Jehovah, which they would hunt after, i.e., strive zealously to obtain, is a practical knowledge, consisting in the fulfilment of the divine commandments, and in growth in the love of God with all the heart. This knowledge produces fruit. The Lord will rise upon Israel like the morning dawn, and come down upon it like fertilizing rain. מוצאו, His (i.e., Jehovah's) rising, is to be explained from the figure of the dawn (for יצא applied to the rising of the sun, see Genesis 19:23 and Psalm 19:7). The dawn is mentioned instead of the sun, as the herald of the dawning day of salvation (compare Isaiah 58:8 and Isaiah 60:2). This salvation which dawns when the Lord appears, is represented in the last clause as a shower of rain that fertilizes the land. יורה is hardly a kal participle, but rather the imperfect hiphil in the sense of sprinkling. In Deuteronomy 11:14 (cf. Deuteronomy 28:12 and Leviticus 26:4-5), the rain, or the early and latter rain, is mentioned among the blessings which the Lord will bestow upon His people, when they serve Him with all the heart and soul. This promise the Lord will so fulfil in the case of His newly quickened nation, that He Himself will refresh it like a fertilizing rain. This will take place through the Messiah, as Psalm 72:6 and 2 Samuel 23:4 clearly show. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That it did not refer to this in its primary sense, and so far as its historical fulfilment was concerned, is evident from the following verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Let us therefore know, hunt after the knowledge of Jehovah. His rising is fixed like the morning dawn, that He may come to us like the rain, and moisten the earth like the latter rain.\" ונדעה נר corresponds to לכוּ ונשׁוּבה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The object to נדעה is also את־יהוה, and נדעה is merely strengthened by the addition of נרדּפה לדּעת. The knowledge of Jehovah, which they would hunt after, i.e., strive zealously to obtain, is a practical knowledge, consisting in the fulfilment of the divine commandments, and in growth in the love of God with all the heart. This knowledge produces fruit. The Lord will rise upon Israel like the morning dawn, and come down upon it like fertilizing rain. מוצאו, His (i.e., Jehovah's) rising, is to be explained from the figure of the dawn (for יצא applied to the rising of the sun, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The dawn is mentioned instead of the sun, as the herald of the dawning day of salvation (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 58:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This salvation which dawns when the Lord appears, is represented in the last clause as a shower of rain that fertilizes the land. יורה is hardly a kal participle, but rather the imperfect hiphil in the sense of sprinkling. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 11:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the rain, or the early and latter rain, is mentioned among the blessings which the Lord will bestow upon His people, when they serve Him with all the heart and soul. This promise the Lord will so fulfil in the case of His newly quickened nation, that He Himself will refresh it like a fertilizing rain. This will take place through the Messiah, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clearly show. ",
            "children": []
          }
        ]
      }
    ]
  }
]