[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) The haste of the seeming penitents for the fulfilment of their hope. They expect the rapid restoration of the national prosperity, prompted by the abundance of the Divine love, and His response to the first touch of penitence (signified in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "After two days.—A phrase sometimes used for the second day, i.e., to-morrow.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "After two days.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—A phrase sometimes used for the second day, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to-morrow.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the third day—i.e., after a short time. This and the above expression are not identical in the designation of time. Some Christian interpreters (Jerome, Luther, Pusey) consider the passage has sole reference to the resurrection of Christ. But with Calvin, Henderson, Schmoller, &c., we consider this to be contradicted by the form of the expression. To bring in the resurrection of Christ with no authority from the New Testament is far-fetched over-refinement, and breaks the consistency of the passage.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "In the third day—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", after a short time. This and the above expression are not identical in the designation of time. Some Christian interpreters (Jerome, Luther, Pusey) consider the passage has sole reference to the resurrection of Christ. But with Calvin, Henderson, Schmoller, &c., we consider this to be contradicted by the form of the expression. To bring in the resurrection of Christ with no authority from the New Testament is far-fetched over-refinement, and breaks the consistency of the passage.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2, 3) Render, So that we shall live in his presence, and shall know and strive after the knowledge of Jehovah, whose coming forth is sure, like the dawn (another play on 6:15, “I will return to my place, &c.”), so that he may come as the plentiful (dashing) rain for us, as the latter rain (needed for the ripening corn) which watereth the earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2, 3) Render, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "So that we shall live in his presence, and shall know and strive after the knowledge of Jehovah, whose coming forth is sure, like the dawn",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (another play on 6:15, “I will return to my place, &c.”), ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "so that he may come as the plentiful",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (dashing) ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "rain for us, as the latter rain",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (needed for the ripening corn) ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "which watereth the earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 6:2. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "After two days he will revive us — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A deliverance from miseries or calamities, from which men had despaired of a recovery, is often represented as restoring them to life after death: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 30:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 71:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; particularly the restoration of the Jewish nation is often described, as if it were a resurrection from the dead: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Two, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "three, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in Scripture, denote a small number. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Two ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are put for a few, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "One ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for a few, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Two ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "three ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for a few, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Accordingly, here the expression signifies a short space of time. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:32-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The primary and obvious sense, therefore, of this verse, taking it in reference to the others, is, that they expected God would, in a short time after they should repent and turn to him, free them from their captivity, which might be looked upon as a state of death; and would return again to them, and exhibit the signs of his presence among them, his chosen people: so that, being converted and restored, they should live in his sight, and should attain to that true knowledge of God which they had not possessed before. Added to this, Bishop Horsley thinks these days denote three distinct periods of the Jewish people. His view of the subject he explains as follows: “The first day is the captivity of the ten tribes by the Assyrians, and of the other two under the Babylonians, considered as one judgment upon the nation; beginning with the captivity of the ten, and completed in that of the two. The second day is the whole period of the present condition of the Jews, beginning with the dispersion of the nation by the Romans. The third day is the period yet to come, beginning with their restoration, to the second advent. R. Tanchum, as he is quoted by Dr. Pocock, was not far, I think, from the true meaning of the place. ‘The prophet,’ he says, ‘points out two things — and these are, the first captivity, and a second. After which shall follow a third, [time,] redemption: after which shall be no depression or servitude.’ And this I take to be the sense of the prophecy, in immediate application to the Jews. Nevertheless, whoever is well acquainted with the allegorical style of prophecy, when he recollects that our Lord’s sufferings and death” were endured for our sakes, “and that he, rising on the third day, raised us to the hope of life and immortality, will easily perceive no very obscure, though but an oblique, allusion to our Lord’s resurrection on the third day; since every believer may speak of our Lord’s death and resurrection, as a common death and resurrection of all mankind.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-3 Those who have gone from God by consent, and in a body, drawing one another to sin, should, by consent and in a body, return to him, which will be for his glory, and their good. It will be of great use for support under afflictions, and to encourage our repentance, to keep up good thoughts of God, and of his purposes and designs concerning us. Deliverance out of trouble should be to them as life from the dead. God will revive them: the assurance of this should engage them to return to him. But this seems to have a further reference to the resurrection of Jesus Christ. Let us admire the wisdom and goodness of God, that when the prophet foretold the deliverance of the church out of her troubles, he should point out our salvation by Christ; and now these words are fulfilled in the resurrection of Christ, it confirms our faith, that this is He that should come and we are to look for no other. Here is a precious blessing promised; this is life eternal, to know God. The returns of the favour of God are secured to us as firmly as the return of the morning after a dark night. He shall come to us as the latter and former rain unto the earth, which refreshes it, and makes it fruitful. The grace of God in Christ is both the latter and the former rain; and by it the good work of our fruit-bearing is begun and carried on. And as the Redeemer was raised from the grave, so will He revive the hearts and hopes of all that trust in him. The feeblest glimpse of hope in his word, is a sure earnest of increasing light and comfort, which shall be attended with purifying, comforting grace that makes fruitful.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After two days will He revive us (or quicken us, give us life,) in the third day He will raise us up - The Resurrection of Christ, and our resurrection in Him and in His Resurrection, could not be more plainly foretold. The prophet expressly mentions \"two days,\" after which life should be given, and a \"third day, on\" which the resurrection should take place. What else can this be than the two days in which the Body of Christ lay in the tomb, and the third day, on which He rose again, as \"the Resurrection and the life\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the first fruits of them that slept\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the source and earnest and pledge of our resurrection and of life eternal? The Apostle, in speaking of our resurrection in Christ, uses these self-same words of the prophet; \"God, who is rich in mercy, for His great love wherewith He loved us - hath quickened us together with Christ, and hath raised us up and made us to sit together in heavenly places in Christ Jesus\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:4-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Apostle, like the prophet, speaks of that which took place in Christ our Head, as having already taken place in us, His members. : \"If we unhesitatingly believe in our heart,\" says a father, \"what we profess with our mouth, we were crucified in Christ, \"we\" died, \"we\" were buried, \"we\" also were raised again on that very third day. Whence the Apostle saith, \"If ye rose again with Christ, seek those things which are above, where Christ sitteth at the right hand of God\" Colossians 3:1. \"As Christ died for us, so He also rose for us. \"Our old man was nailed to the wood, in the flesh of our Head, and the new man was formed in that same Head, rising glorious from the tomb.\" What Christ, our Head, did, He did, not for Himself, but for His redeemed, that the benefits of His Life, Death, Resurrection, Ascension, might redound to all. life did it for them; they partook of what He did.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Apostle, like the prophet, speaks of that which took place in Christ our Head, as having already taken place in us, His members. : \"If we unhesitatingly believe in our heart,\" says a father, \"what we profess with our mouth, we were crucified in Christ, \"we\" died, \"we\" were buried, \"we\" also were raised again on that very third day. Whence the Apostle saith, \"If ye rose again with Christ, seek those things which are above, where Christ sitteth at the right hand of God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"As Christ died for us, so He also rose for us. \"Our old man was nailed to the wood, in the flesh of our Head, and the new man was formed in that same Head, rising glorious from the tomb.\" What Christ, our Head, did, He did, not for Himself, but for His redeemed, that the benefits of His Life, Death, Resurrection, Ascension, might redound to all. life did it for them; they partook of what He did.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In no other way, could our participation of Christ be foretold. It was not the prophet's object here, nor was it so direct a comfort to Israel, to speak of Christ's Resurrection in itself. He took a nearer way to their hearts. He told them, \"all we who turn to the Lord, putting our whole trust in Him, and committing ourselves wholly to Him, to be healed of our wounds and to have our griefs bound up, shall receive life from Him, shall be raised up by Him.\" They could not understand \"then,\" how He would do this. The \"after two days\" and, \"in the third day,\" remained a mystery, to be explained by the event. But the promise itself was not the less distinct, nor the less full of hope, nor did it less fulfill all cravings for life eternal and the sight of God, because they did not understand, \"how shall these things be.\" Faith is unconcerned about the \"how.\" Faith believes what God says, because He says it, and leaves Him to fulfill it, \"how\" He wills and knows. The words of the promise which faith had to believe, were plain. The life of which the prophet spoke, could only be life from death, whether of the body or the soul or both. For God is said to \"give life,\" only in contrast with such death. Whence the Jews too have ever looked and do look, that this should be fulfilled in the Christ, though they know not that it has been fulfilled in Him. They too explain it ; \"He will quicken us in the days of consolation which shall come; in the day of the quickening of the dead; he will raise us up, and we shall live before Him.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In shadow, the prophecy was never fulfilled to Israel at all. The ten tribes were never restored; they never, as a whole, received any favor from God, after He gave them up to captivity. And unto the two tribes, (of whom, apart from the ten, no mention is made here) what a mere shadow was the restoration from Babylon, that it should be spoken of as the gift of life or of resurrection, whereby we should live before Him! The strictest explanation is the truest. The \"two days\" and \"the third day\" have nothing in history to correspond with them, except that in which they were fulfilled, when Christ, \"rising on the third day from the grave, raised with Him the whole human race\" .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And we shall live in His sight - Literally, \"before His Face.\" In the face, we see the will, and mind, the love, the pleasure or displeasure of a human being whom we love. In the holy or loving face of man, there may be read fresh depths of devotion or of love. The face is turned away in sorrowful displeasure; it is turned full upon the face it loves. Hence, it is so very expressive an image of the relation of the soul to God, and the Psalmists so often pray, \"Lord lift up the light of Thy countenance upon us; make Thy Face to shine upon Thy servant; God bless us, and cause His Face to shine upon us; cast me not away from Thy presence or Face; look Thou upon me and be merciful unto me; look upon the Face of thine anointed; how long wilt Thou hide Thy Face from me? hide not Thy Face from Thy servant\" (Psalm 4:6; Psalm 31:16 (from Numbers 6:25); Psalm 67:1; Psalm 80:7; Psalm 119:135; Psalm 51:11; Psalm 119:132; Psalm 84:9; Psalm 13:1; Psalm 69:17, etc.); or they profess, \"Thy Face, Lord, will I seek\" (Psalm 27:8; see Psalm 24:6; Psalm 105:4); or they declare that the bliss of eternity is in \"the Face of God\" Psalm 11:7; Psalm 16:11; Psalm 17:15.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And we shall live in His sight - Literally, \"before His Face.\" In the face, we see the will, and mind, the love, the pleasure or displeasure of a human being whom we love. In the holy or loving face of man, there may be read fresh depths of devotion or of love. The face is turned away in sorrowful displeasure; it is turned full upon the face it loves. Hence, it is so very expressive an image of the relation of the soul to God, and the Psalmists so often pray, \"Lord lift up the light of Thy countenance upon us; make Thy Face to shine upon Thy servant; God bless us, and cause His Face to shine upon us; cast me not away from Thy presence or Face; look Thou upon me and be merciful unto me; look upon the Face of thine anointed; how long wilt Thou hide Thy Face from me? hide not Thy Face from Thy servant\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 6:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 67:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 80:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:135",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:132",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 13:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 69:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.); or they profess, \"Thy Face, Lord, will I seek\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 105:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); or they declare that the bliss of eternity is in \"the Face of God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "God had just said, that He would withdraw His presence, until they should \"seek\" His \"Face;\" now He says, they should \"live before His Face.\" To Abraham He had said, \"Walk before Me\" Genesis 17:1, literally, \"before My Face, and be thou perfect.\" Bliss from the Creator, and duty from the creature, answer to one another. We \"live in His sight,\" in the way of duty, when we refer ourselves and our whole being, our courses of action, our thoughts, our love, to Him, remembering that we are ever in His presence, and ever seeking to please Him. \"We live in His sight,\" in the bliss of His presence, when we enjoy the sense of His favor, and know that His Eye rests on us in love, that He cares for us, guides us, guards us; and have some sweetness in contemplating Him. Much more fully shall we live in His sight, when, in Him, we shall be partakers of His Eternal Life and Bliss, and shall behold Him \"face to face,\" and \"see Him as He is,\" and the sight of Him shall be our bliss, \"and in His light we shall see light\" Psalm 36:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God had just said, that He would withdraw His presence, until they should \"seek\" His \"Face;\" now He says, they should \"live before His Face.\" To Abraham He had said, \"Walk before Me\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", literally, \"before My Face, and be thou perfect.\" Bliss from the Creator, and duty from the creature, answer to one another. We \"live in His sight,\" in the way of duty, when we refer ourselves and our whole being, our courses of action, our thoughts, our love, to Him, remembering that we are ever in His presence, and ever seeking to please Him. \"We live in His sight,\" in the bliss of His presence, when we enjoy the sense of His favor, and know that His Eye rests on us in love, that He cares for us, guides us, guards us; and have some sweetness in contemplating Him. Much more fully shall we live in His sight, when, in Him, we shall be partakers of His Eternal Life and Bliss, and shall behold Him \"face to face,\" and \"see Him as He is,\" and the sight of Him shall be our bliss, \"and in His light we shall see light\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 36:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. Primarily, in type, Israel's national revival, in a short period (\"two or three\" being used to denote a few days, Isa 17:6; Lu 13:32, 33); antitypically the language is so framed as to refer in its full accuracy only to Messiah, the ideal Israel (Isa 49:3; compare Mt 2:15, with Ho 11:1), raised on the third day (Joh 2:19; 1Co 15:4; compare Isa 53:10). \"He shall prolong His days.\" Compare the similar use of Israel's political resurrection as the type of the general resurrection of which \"Christ is the first-fruits\" (Isa 26:19; Eze 37:1-14; Da 12:2).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "live in his sight—enjoy His favour and the light of His countenance shining on us, as of old; in contrast to Ho 5:6, 15, \"Withdrawn Himself from them.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " In this verse it is most certain we are to regard both the literal and historical sense, and distinguish it from the mystical and accommodated sense; in this latter, these words foretell the death, and resurrection, and future glory of Christ and Christians, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 15:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so are generally interpreted and applied by expositors. As to the letter, his history, it is in brief thus: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "After two days; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after some short time of sufferings for our sins, or rather when our sufferings have brought us to repentance and return to God, our God will soon after show us his grace and favour, and revive our dead state. It is not needful we inquire how long time this two days intends, it is a certain time for an uncertain, two days for a short time. God doth not delay long when we return to him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 31:18,19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 31:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 14:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 14:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He will revive us:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though we were as dead men, buried in our miseries, and neither deserved from God, nor could hope from any other hand, a resurrection, and recovery to a better state; yet our merciful God will quicken us again. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezra 9:8,9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 9:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", expresseth their return out of captivity in those words that might well paraphrase our prophet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the third day he will raise us up:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mercy recovers by degrees, and therefore a third day is added, in which this people shall be raised up, increased, established, and confirmed. Possibly the prophet may allude to the third day, which is said to be a critical day to the wounded, who conceive hopes when better on that day; or possibly it may refer to the third decree by Darius made to Nehemiah for building Jerusalem, and the two days may refer to the times of Cyrus reviving the Jews, first, by his decree of liberty, and command to build the temple. The second day or time that of Darius Hystaspes to Zerubbabel and Joshua, for building the temple, in which work his bounty revived the hopes of the Jews; however poor and unable, yet the temple should be built, and the worship of God restored. This was a great reviving, but their settlement was upon the third decree, which was given out by Darius Longimanus to Nehemiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Nehemiah 2:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 2:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "We shall live; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " flourish in peace, wealth, and joy; in pure worship of God, in righteousness among ourselves, in safety from enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In his sight; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the eye of our God being upon us for good, and we filled with the fruits of his favour, inheriting his promises here till we fully possess them in the light of glory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After two days will he revive us: in the third day he will raise us up,.... The Jews, in their present state, are as dead men, both in a civil and spiritual sense, and their conversion and restoration will be as life from the dead; they are like persons buried, and, when they are restored, they will be raised out of their graves, both of sin and misery; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the time of which is here fixed, after two days, and on the third; which Jarchi interprets of the two temples that have been destroyed, and of the third temple to be built, which the Jews expect, but in vain, and when they hope for good times: Kimchi explains it of their three captivities, in Egypt, Babylon, and the present one, and so Ben Melech, from which they hope to be raised, and live comfortably; which sense is much better than the former: and with it may be compared Vitringa's (s) notion of the text, that the first day was between Israel's coming out of Egypt and the Babylonish captivity; the second day between that and the times of Antiochus, which was the third night; then the third day followed, which is the times of the Messiah: but the Targum comes nearer the truth, which paraphrases the words thus, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"he will quicken us in the days of consolation which are to come, and in the day of the resurrection of the dead he will raise us up;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "where by days of consolation are meant the days of the Messiah, with which the Jews generally connect the resurrection of the dead; and if we understand them of the last days of the Messiah, it is not much amiss; for the words respect the quickening and raising up of the Jews in the latter day, the times of Christ's spiritual coming and reign: and these two and three days may be expressive of a long and short time, as interpreters differently explain them; of a long time, as the third day is a long time for a man to lie dead, when there can be little or no hope of his reviving, Luke 24:21; or of a short time, for which two or three days is a common phrase; and both true in this case: it is a long time Israel and Judah have been in captivity, and there may seem little hope of their restoration; but it will be a short time with the Lord, with whom a thousand years are as one day, and one day as a thousand years: and this I take to be the sense of the words, that after the second Millennium, or the Lord's two days, and at the beginning of the third, will be the time of their conversion and restoration, reckoning from the last destruction of them by the Romans; for not till then were Israel and Judah wholly in a state of death: many of Israel were mixed among those of Judah before the Babylonish captivity, and many returned with them from it; but, when destroyed by the Romans, there was an end of their civil and church state; which will both be revived on a better foundation at this period of time: but if this conjecture is not agreeable (for I only propose it as such), the sense may be taken thus, that in a short time after the repentance of Israel, and their conversion to the Lord, they will be brought into a very comfortable and happy state and condition, both with respect to things temporal and spiritual; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "where by days of consolation are meant the days of the Messiah, with which the Jews generally connect the resurrection of the dead; and if we understand them of the last days of the Messiah, it is not much amiss; for the words respect the quickening and raising up of the Jews in the latter day, the times of Christ's spiritual coming and reign: and these two and three days may be expressive of a long and short time, as interpreters differently explain them; of a long time, as the third day is a long time for a man to lie dead, when there can be little or no hope of his reviving, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or of a short time, for which two or three days is a common phrase; and both true in this case: it is a long time Israel and Judah have been in captivity, and there may seem little hope of their restoration; but it will be a short time with the Lord, with whom a thousand years are as one day, and one day as a thousand years: and this I take to be the sense of the words, that after the second Millennium, or the Lord's two days, and at the beginning of the third, will be the time of their conversion and restoration, reckoning from the last destruction of them by the Romans; for not till then were Israel and Judah wholly in a state of death: many of Israel were mixed among those of Judah before the Babylonish captivity, and many returned with them from it; but, when destroyed by the Romans, there was an end of their civil and church state; which will both be revived on a better foundation at this period of time: but if this conjecture is not agreeable (for I only propose it as such), the sense may be taken thus, that in a short time after the repentance of Israel, and their conversion to the Lord, they will be brought into a very comfortable and happy state and condition, both with respect to things temporal and spiritual; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and we shall live in his sight; comfortably, in a civil sense, in their own land, and in the possession of all their privileges and liberties; and in a spiritual sense, by faith on Jesus Christ, whom they shall now embrace, and in the enjoyment of the Gospel and Gospel ordinances; and the prophet represents the penitents and faithful among them as believing and hoping for these things. This may be applied to the case of sensible sinners, who, as they are in their natural state dead in sin, and dead in law, so they see themselves to be such when awakened; and yet entertain a secret hope that sooner or later they shall be revived and refreshed, and raised up to a more comfortable state, and live in the presence of God, and the enjoyment of his favour. The ancient fathers generally understood these words of Christ, who was buried on the sixth day, lay in the grave the whole seventh day, and after these two days, on the third, rose again from the dead; and to this passage the apostle is thought to have respect, 1 Corinthians 15:3; and also of the resurrection of his people in and with him, and by virtue of his: and true it is that Christ rose from the dead on the third day, and all his redeemed ones were quickened and raised up together with him as their head and representative, Ephesians 2:5; and his in virtue of his being quickened that they are regenerated and quickened, and made alive, in a spiritual sense; he is the author of their spiritual life, and their life itself; see 1 Peter 1:3; and not only in virtue of his resurrection is their spiritual resurrection from the death of sin to a life of grace, but even their corporeal resurrection at the last day; and as, in consequence of their spiritual resurrection, they live in the sight of God a life of grace and holiness by faith in Christ, and in a comfortable view and enjoyment of the divine favour; so they shall live eternally in the presence of God, where are fulness of joy, and pleasures for evermore: but the first sense is best, and most agreeable to the context and scope of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and we shall live in his sight; comfortably, in a civil sense, in their own land, and in the possession of all their privileges and liberties; and in a spiritual sense, by faith on Jesus Christ, whom they shall now embrace, and in the enjoyment of the Gospel and Gospel ordinances; and the prophet represents the penitents and faithful among them as believing and hoping for these things. This may be applied to the case of sensible sinners, who, as they are in their natural state dead in sin, and dead in law, so they see themselves to be such when awakened; and yet entertain a secret hope that sooner or later they shall be revived and refreshed, and raised up to a more comfortable state, and live in the presence of God, and the enjoyment of his favour. The ancient fathers generally understood these words of Christ, who was buried on the sixth day, lay in the grave the whole seventh day, and after these two days, on the third, rose again from the dead; and to this passage the apostle is thought to have respect, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and also of the resurrection of his people in and with him, and by virtue of his: and true it is that Christ rose from the dead on the third day, and all his redeemed ones were quickened and raised up together with him as their head and representative, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and his in virtue of his being quickened that they are regenerated and quickened, and made alive, in a spiritual sense; he is the author of their spiritual life, and their life itself; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and not only in virtue of his resurrection is their spiritual resurrection from the death of sin to a life of grace, but even their corporeal resurrection at the last day; and as, in consequence of their spiritual resurrection, they live in the sight of God a life of grace and holiness by faith in Christ, and in a comfortable view and enjoyment of the divine favour; so they shall live eternally in the presence of God, where are fulness of joy, and pleasures for evermore: but the first sense is best, and most agreeable to the context and scope of it. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) Comment. in Isaiah 8.20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s) Comment. in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".20. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "After two days will {b} he revive us: in the third day he will raise us up, and we shall live in his sight.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "After two days will ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he revive us: in the third day he will raise us up, and we shall live in his sight.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Though he correct us from time to time, yet his help will not be far off, if we return to him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This verse contains the germ of the striking allegory of the dry bones (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and reminds us also of the prediction of an Israelitish resurrection in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The idea is that, contrary to all human expectation Israel shall quickly emerge from the depths of trouble. What human skill could cure a dangerously wounded man in three days? Yet a wonder as great has happened to the sick man Israel. That the passage has primarily a contemporary reference, and contains a figurative description of a national revival, is admitted by Pococke, who however endeavours to combine with this view a very forced interpretation of pre-critical origin. He thinks the Jews ‘might say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after two days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., because by him whom God would so raise up deliverance should be wrought for them when their case was as desperate as of one that had been so long dead’; or, to put his view of the secondary meaning more clearly, the resurrection of the coming Christ was to the Israelites (though they knew it not) the justification of their hope of a national restoration. The view is ultimately traceable to the paraphrase in the Targum, ‘he will revive us in the days of consolation which are to come’, i.e. at the resurrection (see the Peshito of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which shows that ‘consolation’ and ‘resurrection’ are synonymous in Aramaic). Pusey and many old expositors even take the supposed reference to our Lord’s resurrection to be primary. But the context certainly does not favour any such reference, whether primary or secondary. Calvin, with his usual fine perception, remarks, ‘sensus ille videtur mihi nimium argutus.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "live in his sight",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit, ‘before him’, i.e., under his protection (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "After two days will he revive us: in the third day he will raise us up, and we shall live in his sight.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The expression of time here employed denotes a comparatively short period, and implies that Israel's revival would be speedily as well as certainly accomplished. Paucity is signified by the binary number in Old Testament language, just as we speak of two, or a couple, in the sense of fewness. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we find \"two\" used in this way: \"Behold, I am gathering two sticks;\" so in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"A man shall nourish a young cow and two sheep;\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a small number is spoken of as \"two or three;\" while a short period is similarly described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Behold, I east out devils, and I do cures today and tomorrow, and the third day I shall be perfected.\" The important idea of this verse connects itself with the terms corresponding to revival, resurrection, and restoration to the Divine favor and protection. The drooping, declining, dying state of Israel would be revived; their deathlike condition would undergo a resurrection process; their disfavor would give way to Divine complacency; and all this, though not immediately, yet in a comparatively short time. This appears to us the import of the prophecy. Similar figurative language, and with like significancy, is employed by Ezekiel (37.) in his vision of the valley and the resurrection of its dry bones; as also by Isaiah (26.), where the same or a similar thought is presented in briefer, but still more beautiful, language: \"Thy (lead men shall live, together with my dead body shall they arise. Awake and sing, ye that dwell in the dust: for thy dew is as the dew of herbs, and the earth shall cast out the dead.\" Calvin understands this verse as containing a source of consolation to Israel. \"When,\" he says, \"the Israelites, through their long obstinacy, had become nearly incurable, it was needful to lead them to repentance by slow punishments. They, therefore, said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "After two days God will revive us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and thus they confirmed themselves in the hope of salvation, though it did not immediately appear; though they long remained in darkness, and the exile was long which they had to endure, they yet did not cease to hope. 'Well, lot the two days pass, and the Lord will revive us.'\" To man in sorrow the time appears long; it is short in the sight of him with whom a thousand years are as one day. Kimchi's explanation is also, to a certain extent, satisfactory: \"The prophet says, 'our sickness lasts for two days, yet he will heal us of our sickness, till on the third day he will raise us up, and we shall live long before him,' as if he said, 'though our afflictions continue a long time.' The two days are a figaro, for 'in a short time he will bring us his salvation,' and 'on the third day' is figurative.\" He afterwards refers the \"two days\" to the captivities of his people  - that in Egypt and that in Babylon; while \"the third day\" denotes the third or present Roman captivity, \"out of which he will raise us up and we shall live before him? so that we shall never again go into captivity, but shall live continually before him, while we sin no mere.\" Rashi refers the words to the three temples - that of Solomon, that of Zerubbabel, and the temple that is to be built by Messiah. Some of the Fathers understand the three periods in the history of humanity - the first, under Adam, as the time of Law and captivity to sin; the second, under Christ, as the time of the gospel and of grace; and the third, with Christ, as the time of the general resurrection. Theodoret and most of the Fathers understood this verse to refer to the resurrection of Christ on the third day after three days' rest in the grave. Calvin, after giving what appeared to him \"the simple and genuine sense\" of the passage as applying primarily to the Jews, as we have already seen, adds, \"I do not deny but that God has exhibited a remarkable and memorable instance of what is here said in his only begotten Son. As often, then, as delay begets weariness in us, let us flee to Christ; for, as it has been said, his resurrection is a mirror of our life; for we see in that how God is wont to deal with his own people: the Father did not restore life to Christ as soon as he was taken down from the cross; he was deposited in the sepulcher, and he lay there till the third day. When God, then, intends that we should languish for a time, let us know that we are thus represented in Christ our Head, and hence let us gather materials of confidence. We have, then, in Christ an illustrious proof of this prophecy.\" The political resurrection of Israel may dimly shadow forth, by way of type, the resurrection of Messiah and the general resurrection of which he is the Firstfruits. Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To this threat the prophet appends in the concluding strophe, both the command to return to the Lord, and the promise that the Lord will raise His smitten nation up again, and quicken them anew with His grace. The separation of these three verses from the preceding one, by the division of the chapters, is at variance with the close connection in the actual contents, which is so perfectly obvious in the allusion made in the words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Come, and let us return,\" to those of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"I will go, and return,\" and in טרף וירפּאנוּ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the similar words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Come, and let us return to Jehovah: for He has torn in pieces, and will heal us; He has smitten, and will bind us up. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He will quicken us after two days; on the third He will raise us up, that we may live before Him.\" The majority of commentators, following the example of the Chald. and Septuagint, in which לאמר, λέγοντες, is interpolated before לכוּ, have taken the first three verses as an appeal to return to the Lord, addressed by the Israelites in exile to one another. But it would be more simple, and more in harmony with the general style of Hosea, which is characterized by rapid transitions, to take the words as a call addressed by the prophet in the name of the exile. The promise in v. 3 especially is far more suitable to a summons of this kind, than to an appeal addressed by the people to one another. As the endurance of punishment impels to seek the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so the motive to return to the Lord is founded upon the knowledge of the fact that the Lord can, and will, heal the wounds which He inflicts. The preterite târaph, as compared with the future 'etrōph in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", presupposes that the punishment has already begun. The following יך is also a preterite with the Vav consec. omitted. The Assyrian cannot heal (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but the Lord, who manifested Himself as Israel's physician in the time of Moses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and promised His people healing in the future also (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), surely can. The allusion in the word ירפּאנוּ to this passage of Deuteronomy, is placed beyond all doubt by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words, \"He revives after two days,\" etc., are merely a special application of the general declaration, \"I kill, and make alive\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to the particular case in hand. What the Lord there promises to all His people, He will also fulfil upon the ten tribes of Israel. By the definition \"after two days,\" and \"on the third day,\" the speedy and certain revival of Israel is set before them. Two and three days are very short periods of time; and the linking together of two numbers following one upon the other, expresses the certainty of what is to take place within this space of time, just as in the so-called numerical sayings in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 30:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which the last and greater number expresses the highest or utmost that is generally met with. הקים, to raise the dead (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 88:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"That we may live before Him:\" i.e., under His sheltering protection and grace (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The earlier Jewish and Christian expositors have taken the numbers, \"after two days, and on the third day,\" chronologically. The Rabbins consequently suppose the prophecy to refer either to the three captivities, the Egyptian, the Babylonian, and the Roman, which has not ended yet; or to the three periods of the temple of Solomon, of that of Zerubbabel, and of the one to be erected by the Messiah. Many of the fathers, on the other hand, and many of the early Lutheran commentators, have found in them a prediction of the death of Christ and His resurrection on the third day. Compare, for example, Calovii Bibl. illustr. ad h. l., where this allusion is defended by a long series of undeniably weak arguments, and where a fierce attack is made, not only upon Calvin, who understood these words as \"referring to the liberation of Israel from captivity, and the restoration of the church after two days, i.e., in a very short time;\" but also upon Grotius, who found, in addition to the immediate historical allusion to the Israelites, whom God would soon liberate from their death-like misery after their conversion, a foretype, in consequence of a special divine indication, of the time \"within which Christ would recover His life, and the church its hope.\" But any direct allusion in the hope here uttered to the death and resurrection of Christ, is proved to be untenable by the simple words and their context. The words primarily hold out nothing more than the quickening of Israel out of its death-like state of rejection from the face of God, and that in a very short period after its conversion to the Lord. This restoration to life cannot indeed be understood as referring to the return of the exiles to their earthly fatherland; or, at all events, it cannot be restricted to this. It does not occur till after the conversion of Israel to the Lord its God, on the ground of faith in the redemption effected through the atoning death of Christ, and His resurrection from the grave; so that the words of the prophet may be applied to this great fact in the history of salvation, but without its being either directly or indirectly predicted. Even the resurrection of the dead is not predicted, but simply the spiritual and moral restoration of Israel to life, which no doubt has for its necessary complement the reawakening of the physically dead. And, in this sense, our passage may be reckoned among the prophetic utterances which contain the germ of the hope of a life after death, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:19-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in the vision of Ezekiel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:1-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That it did not refer to this in its primary sense, and so far as its historical fulfilment was concerned, is evident from the following verse. Hosea 6:3. \"Let us therefore know, hunt after the knowledge of Jehovah. His rising is fixed like the morning dawn, that He may come to us like the rain, and moisten the earth like the latter rain.\" ונדעה נר corresponds to לכוּ ונשׁוּבה in Hosea 6:1. The object to נדעה is also את־יהוה, and נדעה is merely strengthened by the addition of נרדּפה לדּעת. The knowledge of Jehovah, which they would hunt after, i.e., strive zealously to obtain, is a practical knowledge, consisting in the fulfilment of the divine commandments, and in growth in the love of God with all the heart. This knowledge produces fruit. The Lord will rise upon Israel like the morning dawn, and come down upon it like fertilizing rain. מוצאו, His (i.e., Jehovah's) rising, is to be explained from the figure of the dawn (for יצא applied to the rising of the sun, see Genesis 19:23 and Psalm 19:7). The dawn is mentioned instead of the sun, as the herald of the dawning day of salvation (compare Isaiah 58:8 and Isaiah 60:2). This salvation which dawns when the Lord appears, is represented in the last clause as a shower of rain that fertilizes the land. יורה is hardly a kal participle, but rather the imperfect hiphil in the sense of sprinkling. In Deuteronomy 11:14 (cf. Deuteronomy 28:12 and Leviticus 26:4-5), the rain, or the early and latter rain, is mentioned among the blessings which the Lord will bestow upon His people, when they serve Him with all the heart and soul. This promise the Lord will so fulfil in the case of His newly quickened nation, that He Himself will refresh it like a fertilizing rain. This will take place through the Messiah, as Psalm 72:6 and 2 Samuel 23:4 clearly show. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That it did not refer to this in its primary sense, and so far as its historical fulfilment was concerned, is evident from the following verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Let us therefore know, hunt after the knowledge of Jehovah. His rising is fixed like the morning dawn, that He may come to us like the rain, and moisten the earth like the latter rain.\" ונדעה נר corresponds to לכוּ ונשׁוּבה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The object to נדעה is also את־יהוה, and נדעה is merely strengthened by the addition of נרדּפה לדּעת. The knowledge of Jehovah, which they would hunt after, i.e., strive zealously to obtain, is a practical knowledge, consisting in the fulfilment of the divine commandments, and in growth in the love of God with all the heart. This knowledge produces fruit. The Lord will rise upon Israel like the morning dawn, and come down upon it like fertilizing rain. מוצאו, His (i.e., Jehovah's) rising, is to be explained from the figure of the dawn (for יצא applied to the rising of the sun, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The dawn is mentioned instead of the sun, as the herald of the dawning day of salvation (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 58:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This salvation which dawns when the Lord appears, is represented in the last clause as a shower of rain that fertilizes the land. יורה is hardly a kal participle, but rather the imperfect hiphil in the sense of sprinkling. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 11:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the rain, or the early and latter rain, is mentioned among the blessings which the Lord will bestow upon His people, when they serve Him with all the heart and soul. This promise the Lord will so fulfil in the case of His newly quickened nation, that He Himself will refresh it like a fertilizing rain. This will take place through the Messiah, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clearly show. ",
            "children": []
          }
        ]
      }
    ]
  }
]