[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) Here ends the supposed language of the penitents. If it were genuine, and accompanied by a deep sense of sin, it would not be in vain. But the prophet utters the heartrending response and expostulation of Jehovah, who bewails the transitory nature of their repentance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Your goodness . . .—Better rendered, Your love (to me) is like the morning cloud (which promises rain, and does not give it; like the dew (or, “morning mist;” see Note, Hosea 14:5), which early goeth away, vanishing in the blaze of summer day—your tears leaving you parched and dried as before.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Your goodness",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " . . .—Better rendered, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Your love",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (to me) ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "is like the morning cloud",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (which promises rain, and does not give it; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "like the dew",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (or, “morning mist;” see Note, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "which early goeth away,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " vanishing in the blaze of summer day—your tears leaving you parched and dried as before.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 6:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Ephraim, what shall I do unto thee? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what shall I do for thee? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Here the Lord takes up the discourse again in his own person, and gives an answer to the prayer, or promises, of Judah and Israel: as if he had said, How can I give either of you, O Israel and Judah, any tokens of my favour, since there is no sincerity or stability to be found in you? Such is the essential beneficence of God, that he delights to bestow favours on all his creatures; and here, and elsewhere in the Scriptures, represents himself as it were concerned, whenever their conduct is such that it becomes inconsistent with his attributes, as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all-righteous governor of the universe, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to bestow his blessings upon them. Thus we find Christ lamenting over Jerusalem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 59:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " representing men’s iniquities as the sole cause of God’s hiding his face from them, and not hearing their prayers: see also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Your goodness is as a morning cloud, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Your goodness is of a short continuance, and gives way to every temptation, like as the cloud of the morning, and the dew, are dispersed at the first approach of the sun.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:4-11 Sometimes Israel and Judah seemed disposed to repent under their sufferings, but their goodness vanished like the empty morning cloud, and the early dew, and they were as vile as ever. Therefore the Lord sent awful messages by the prophets. The word of God will be the death either of the sin or of the sinner. God desired mercy rather than sacrifice, and that knowledge of him which produces holy fear and love. This exposes the folly of those who trust in outward observances, to make up for their want of love to God and man. As Adam broke the covenant of God in paradise, so Israel had broken his national covenant, notwithstanding all the favours they received. Judah also was ripe for Divine judgments. May the Lord put his fear into our hearts, and set up his kingdom within us, and never leave us to ourselves, nor suffer us to be overcome by temptation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Ephraim, what shall I do unto thee? - It is common with the prophets, first to set forth the fullness of the riches of God's mercies in Christ, and then to turn to their own generation, and upbraid them for the sins which withheld the mercies of God from \"them,\" and were hurrying them to their destruction. In like way Isaiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", having prophesied that the Gospel should go forth from Zion, turns to upbraid the avarice, idolatry, and pride, through which the judgment of God should come upon them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The promises of God were to those who should turn with true repentance, and seek Him early and earnestly. Whatever of good there was, either in Ephraim or Judah, was but a mere empty show, which held out hope, only to disappoint it. God, who \"willeth not that any should perish, but that all should come to repentance\" appeals to His whole people, \"What shall I do unto thee?\" He had shown them adundance of mercies; He had reproved them by His prophets; He had chastened them; and all in vain. As he says in Isaiah, \"What could have been done more to My vineyard, that I have not done in it?\" Isaiah 5. Here He asks them Himself, what He could do to convert and to save them, which He had not done. He would take them on their own terms, and whatever they would prescribe to His Almightiness and Wisdom, as means for their conversion, \"that\" He would use, so that they would but turn to Him. \"What means shall I use to save thee, who wilt not be saved?\" It has been a bold saying, to describe the \"love of Christ which passeth knowledge,\" \"Christ so loveth souls, that He would rather be crucified again, than allow anyone (as far as in Him lies) to be damned.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The promises of God were to those who should turn with true repentance, and seek Him early and earnestly. Whatever of good there was, either in Ephraim or Judah, was but a mere empty show, which held out hope, only to disappoint it. God, who \"willeth not that any should perish, but that all should come to repentance\" appeals to His whole people, \"What shall I do unto thee?\" He had shown them adundance of mercies; He had reproved them by His prophets; He had chastened them; and all in vain. As he says in Isaiah, \"What could have been done more to My vineyard, that I have not done in it?\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here He asks them Himself, what He could do to convert and to save them, which He had not done. He would take them on their own terms, and whatever they would prescribe to His Almightiness and Wisdom, as means for their conversion, \"that\" He would use, so that they would but turn to Him. \"What means shall I use to save thee, who wilt not be saved?\" It has been a bold saying, to describe the \"love of Christ which passeth knowledge,\" \"Christ so loveth souls, that He would rather be crucified again, than allow anyone (as far as in Him lies) to be damned.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For your goodness is as a morning cloud - \"Mercy\" or \"loving-kindness,\" (which the English margin suggests as the first meaning of the word) stands for all virtue and goodness toward God or man. For love to God or man is one indivisible virtue, issuing from one principle of grace. Whence it is said, \"love is the fulfilling of the law. He that loveth another hath fulfilled the law\" Romans 13:10, Romans 13:8. And, \"Beloved, let us love one another, for love is of God, and every one that loveth is born of God, and knoweth God\" 1 John 4:7. Of this their goodness, he says the character was, that it never lasted. The \"morning cloud\" is full of brilliancy with the rays of the rising sun, yet quickly disappears through the heat of that sun, which gave it its rich hues. The \"morning dew\" glitters in that same sun, yet vanishes almost as soon as it appears. Generated by the cold of the night, it appears with the dawn; yet appears, only to disappear. So it was with the whole Jewish people; so it ever is with the most hopeless class of sinners; ever beginning anew, ever relapsing; ever making a show of leaves, good feelings, good aspirations, but yielding no fruit. \"There was nothing of sound, sincere, real, lasting goodness in them;\" no reality, but all show; quickly assumed, quickly disused. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For your goodness is as a morning cloud - \"Mercy\" or \"loving-kindness,\" (which the English margin suggests as the first meaning of the word) stands for all virtue and goodness toward God or man. For love to God or man is one indivisible virtue, issuing from one principle of grace. Whence it is said, \"love is the fulfilling of the law. He that loveth another hath fulfilled the law\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 13:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 13:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And, \"Beloved, let us love one another, for love is of God, and every one that loveth is born of God, and knoweth God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Of this their goodness, he says the character was, that it never lasted. The \"morning cloud\" is full of brilliancy with the rays of the rising sun, yet quickly disappears through the heat of that sun, which gave it its rich hues. The \"morning dew\" glitters in that same sun, yet vanishes almost as soon as it appears. Generated by the cold of the night, it appears with the dawn; yet appears, only to disappear. So it was with the whole Jewish people; so it ever is with the most hopeless class of sinners; ever beginning anew, ever relapsing; ever making a show of leaves, good feelings, good aspirations, but yielding no fruit. \"There was nothing of sound, sincere, real, lasting goodness in them;\" no reality, but all show; quickly assumed, quickly disused. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. what shall I do unto thee—to bring thee back to piety. What more could be done that I have not done, both in mercies and chastenings (Isa 5:4)? At this verse a new discourse begins, resuming the threats (Ho 5:14). See [1120]opening remarks on this chapter.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "goodness—godliness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "morning cloud—soon dispersed by the sun (Ho 13:3). There is a tacit contrast here to the promise of God's grace to Israel hereafter, in Ho 6:3. His going forth is \"as the morning,\" shining more and more unto the perfect day; your goodness is \"as a morning cloud,\" soon vanishing. His coming to His people is \"as the (fertilizing) latter and former rains\"; your coming to Him \"as the early dew goeth away.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The Lord now enters a debate with both Israel (here called ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephraim)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the two tribes, with all that were his, people anciently; much after the manner of men, who having to do with froward and ungovernable children, or servants, whom they pity, and would not cast off, after much kindness and patience showed to them, and abused by them, at last seem at a stand what more to do, or appeal to by-standers whether more might be done, or demand of the untractable ones what they can desire more to be done. So ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 5:3-6 Micah 6:3,5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:3-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". What is it I may do becoming my holy, just, and wise procedures, with my reasonable creatures? What should I do more to save you from ruin, and salve my own honour, truth, add justice? Would you of the ten tribes, and you of the two tribes, have me cease to be God, and resign to your idols? or repeal my own laws, and subscribe to your idols’ rites? Or would you have Satan the wicked one, who hath seduced your kings, prophets, priests, and people, whom you worship in your idols, would you that he should still retain your love and service, and I maintain you in it? I would do, as appears by what I have done, any thing that may be done to reduce, reclaim, and reform you, who are as impudent adulteresses, that will not be sincere and faithful to their reconciled husband. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Your goodness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or your kindness, your love to me, my law, worship, and honour, your promises of love and loyalty, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "is as a morning cloud, and as the early dew; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " vanisheth without effect, it is deceitful; you are hypocrites, nothing but short and empty signs of goodness, piety, and amendment. Their hypocrisy and unconstancy, elegantly expressed in this double allusion, renders them uncapable of further gentleness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Ephraim, what shall I do unto thee? O Judah, what shall I do unto thee?.... Or, \"for thee\" (x)? The Lord having observed the effect and consequence of his going and returning to his place, of his leaving his people for a long time under afflictions and in distress; namely, their thorough conversion to him in the latter day, and the blessings attending it; returns to the then present times again, and to the state and condition in which Ephraim and Judah, the ten and two tribes, were; and speaks as one at a loss, and under difficulties, to know what to do with them and for them; how as it were to give them up to ruin and destruction; and yet, having tried all ways with them, and in vain, asks what further was to be done, or could be done, to bring them to a sense of their sins, to reform them, and cause them to return to him; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for your goodness is as a morning cloud, and as the early dew it goeth way; meaning not the goodness of God bestowed upon them, and the mercy he showed to them; but the goodness that appeared in them, and all the good things done by them, their repentance, reformation, holiness, and righteousness; these, which were only in show, did not last long, came to nothing, and disappeared; like a light cloud in the morning, which vanishes away when the sun rises; or like the dew that falls in the night, which is quickly dried up and gone, after the sun has been up a small time. Thus it was with Ephraim, or the ten tribes, in the time of Jehu; there was a show of zeal for religion, and a reformation from idolatry; but it did not go on, nor last long; and with the two tribes of Judah and Benjamin in the times of Hezekiah and Josiah, who did that which was right in the eyes of the Lord; but then the Jews, in the times of their successors, returned to their former evil ways. And so the best works, holiness and righteousness of men, can no more stand before the justice of God, and the strict examination of it, than a thin light morning cloud, or the small drops of dew, before the light, force, and heat of the sun; nor do formal and carnal professors continue in these things; they may run well for a while, and then drop their profession and religion, and turn from the holy commandment. And this being the case, what can they expect from the Lord? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) \"in tuum commodum\", Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x) \"in tuum commodum\", Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O Ephraim, what shall I do unto thee? O Judah, what shall I do unto thee? for {c} your goodness is as a morning cloud, and as the early dew it goeth away.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O Ephraim, what shall I do unto thee? O Judah, what shall I do unto thee? for ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " your goodness ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as a morning cloud, and as the early dew it goeth away.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) You seem to have a certain holiness and repentance, but it is very sudden, and as a morning cloud.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The answer of Jehovah, who cannot be satisfied with such a superficial repentance and such hasty resolutions of ‘knowing’ Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what shall I do unto thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘What other means can possibly be employed to move thee to a serious repentance?’ Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your goodness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "your piety.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "khésedh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is the same as that rendered in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 6:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘mercy’; and so St Jerome here (‘the mercy which I had been wont to shew’), and Keil (explaining, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘your kindness to those in need’). But the context requires another sense—‘your love to God’, and this is what A.V. means, though it expresses it weakly. The Peshito also renders ‘goodness’, and again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 6:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as a morning cloud, and as the early dew it goeth away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, … ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and as the night mist which early goeth away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so again ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The ‘cloud’ spoken of, then, is a cloud such as Isaiah speaks of as coming ‘in the heat of harvest’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); more precisely, it is one of those dense masses of night-vapour, which the westerly winds of summer bear from the Mediterranean Sea, and which more than supply the place of dew. After ‘making a fair show’ in the bright morning light, they are soon sucked up by the hot sun, and pass away (Neil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Palestine Explored",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 138). The cognate word in Arabic means a soft rain (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For your goodness is as a morning cloud, and as the early dew it goeth away.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A new section here commences. God, having tried various expedients and many ways to restore Israel to faithfulness, finds all those methods unavailing; and now he asks what further means of reclamation he can resort to; what further punishment he is to inflict. Thus in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Why should ye be stricken any more? ye will revolt more and more!\" or what additional privileges can be vouchsafed? Thus in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"What could have been done more to my vineyard, than I have not done in it?\" The reason is then assigned for such questioning; it was the brief duration of Israel's piety. It was evanescent as the early cloud which floats across a summer's sky and which the sun soon scatters for ever, or which pro-raises a refreshing shower, but which is exhaled by the sun's heat; it was transient as the dew which lies in pearly drops of beauty upon the grass, but which the foot of the passing traveler brushes away in a moment. The prophet had, in the opening verses, referred to real repentance; but now, turning to Israel, he reminds them of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "their",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " repentance by way of con-trust, showing them that it was neither of the consistency nor permanent character required. Proofs of their deficiency lay on the pages of their national history. Hezekiah had done \"that which was right in the sight of the Lord;\" but his son and successor, Manasseh, \"wrought much wickedness in the sight of the Lord, to provoke him to auger.\" Josiah, again, was eminent for piety, so that \"like unto him was there no king before him, that turned to the Lord with all his heart, and with all his soul, and with all his might;\" but his successors degenerated, for it is added, \"neither after him arose there any like him.\" The connection and meaning are well given by Kimchi: \"How shall I heal you, and how shall I bind you up, as your repentance is by no means perfect? For if the kings of Israel did that which was right in the sight of the Lord, so have they soon turned to do evil, like Jehu. And likewise the kings of Judah, who in the days of Josiah did that which was right in the eyes of the Lord, turned again to do evil in the days of his son and son's son.\" Thus he reproves them for the superficial and fleeting character of their goodness. The participles ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mashkim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "holek",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are either co-ordinated asynde-tously, thus: \"coming in the morning, going away;\" or the latter is subordinated to the former: \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the morning passing away.\" Kimchi takes the former word as a noun after the form of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "makbir",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equivalent to \"abundance\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 36:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the right rendering is, \"as the dew early going away.\" A somewhat different rendering is proposed by Wunsche, viz. \"Your goodness goeth away like a morning cloud, and like the dew in the morning;\" \"goodness\" being the subject, \"goeth away\" the predicate, \"like morning cloud and dew\" nearer definitions. Hosea 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prophet's address commences afresh, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", without any introduction, with the denunciation of the incurability of the Israelites. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:4-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " form the first strophe. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"What shall I do to thee, Ephraim? what shall I do to thee, Judah? for your love is like the morning cloud, and like the dew which quickly passes away.\" That this verse is not to be taken in connection with the preceding one, as it has been by Luther (\"how shall I do such good to thee?\") and by many of the earlier expositors, is evident from the substance of the verse itself. For ‛âsâh, in the sense of doing good, is neither possible in itself, nor reconcilable with the explanatory clause which follows. The chesed, which is like the morning cloud, cannot be the grace of God; for a morning cloud that quickly vanishes away, is, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a figurative representation of that which is evanescent and perishable. The verse does not contain an answer from Jehovah, \"who neither receives nor repels the penitent, because though they love God it is only with fickleness,\" as Hitzig supposes; but rather the thought, that God has already tried all kinds of punishment to bring the people back to fidelity to Himself, but all in vain (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), because the piety of Israel is as evanescent and transient as a morning cloud, which is dispersed by the rising sun. Judging from the chesed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", chasdekhem is to be understood as referring to good-will towards other men flowing out of love to God (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]