[{"num":22,"verse":"¶ A good reputation is rather to be chosen than great riches and good grace rather than silver and gold."},{"num":2,"verse":"¶ The rich and poor meet together; the LORD is the maker of them all."},{"num":3,"verse":"¶ A prudent man foresees the evil and hides himself, but the simple pass on and receive hurt."},{"num":4,"verse":"¶ Riches and honour and life are the remuneration of humility and of the fear of the LORD."},{"num":5,"verse":"¶ Thorns and snares are in the way of the perverse; he that keeps his soul shall be far from them."},{"num":6,"verse":"¶ Train up a child in the way he should go; even when he is old, he will not depart from it."},{"num":7,"verse":"¶ The rich rules over the poor, and the borrower is slave to the lender."},{"num":8,"verse":"¶ He that sows iniquity shall reap iniquity, and the rod of his anger shall fail."},{"num":9,"verse":"¶ He that has a merciful eye shall be blessed, for he gives of his bread to the destitute."},{"num":10,"verse":"¶ Cast out the scorner, and contention shall go out; strife and reproach shall cease."},{"num":11,"verse":"¶ He that loves pureness of heart, for the grace of his lips the king shall be his friend."},{"num":12,"verse":"¶ The eyes of the LORD preserve knowledge, and he overthrows the words of the transgressor."},{"num":13,"verse":"¶ The slothful man says, There is a lion without, I shall be slain in the streets."},{"num":14,"verse":"¶ The mouth of strange women is a deep pit; he that is abhorred of the LORD shall fall therein."},{"num":15,"verse":"¶ Foolishness is bound in the heart of a child, but the rod of correction shall drive it far from him."},{"num":16,"verse":"¶ He that oppresses the poor to increase his riches and who gives to the rich shall surely come to want."},{"num":17,"verse":"¶ Bow down thine ear and hear the words of the wise, and apply thine heart unto my wisdom."},{"num":18,"verse":"For it is a delightful thing if thou keep them within thee; they shall be ordered together in thy lips."},{"num":19,"verse":"That thy trust may be in the LORD, I have made known to thee this day, even to thee."},{"num":20,"verse":"Have I not written unto thee three times in counsels and knowledge,"},{"num":21,"verse":"that I might make thee know the certainty of the words of truth, that thou mightest answer the words of truth to those that send unto thee?"},{"num":22,"verse":"¶ Rob not the poor, because he is poor: neither destroy the destitute in judgment:"},{"num":23,"verse":"For the LORD will judge their cause and spoil the soul of those that spoiled them."},{"num":24,"verse":"¶ Do not meddle with an angry man, and with a furious man thou shalt not go:"},{"num":25,"verse":"Lest thou learn his ways and get a snare to thy soul."},{"num":26,"verse":"¶ Be not thou one of them that strike hands or of them that are sureties for debts."},{"num":27,"verse":"If thou hast nothing to pay, why should they take away thy bed from under thee?"},{"num":28,"verse":"¶ Remove not the ancient landmark, which thy fathers have set."},{"num":29,"verse":"¶ Seest thou a man diligent in his work? He shall stand before kings; he shall not stand before obscure men."}]