[{"num":22,"verse":"Better is a good name, than many riches; for good grace is above silver and gold (for a good reputation is more valuable than silver and gold)."},{"num":2,"verse":"A rich man and a poor man met themselves; the Lord is [the] worker of ever either. (A rich person and a poor person met together; the Lord is the Maker of both of them.)"},{"num":3,"verse":"A fell man seeth evil, and hideth himself; and an innocent man passed, and he was tormented by harm. (A clever person seeth evil coming, and hideth himself; but a gullible person passed forth, or kept going, and so he was tormented by harm.)"},{"num":4,"verse":"The end of temperance is the dread of the Lord; riches, and glory, and life. (The fruit of humility is the fear of the Lord/is reverence for the Lord; along with riches, and glory, and life.)"},{"num":5,"verse":"Armours and swords be in the way of a wayward man; but the keeper of his soul goeth away far from those. (Arms, or weapons, and swords be on the way of the wayward; but he who keepeth his life safe goeth far away from them.)"},{"num":6,"verse":"It is a proverb, A young waxing man after his way, and when he hath waxed eld, he shall not go away from it. (Here is a proverb: If a young person is brought up in the right way, when he hath grown older, he shall not go away from it.)"},{"num":7,"verse":"A rich man commandeth to poor men; and he that taketh borrowing, is servant of the lender."},{"num":8,"verse":"He that soweth wickedness shall reap evils; and the rod of his ire shall be ended."},{"num":9,"verse":"He that is ready to (give) mercy shall be blessed; for (out) of his loaves he gave (some) to a poor man."},{"num":10,"verse":"Cast thou out a scorner, and strife shall go out with him; and causes and despisings shall cease."},{"num":11,"verse":"He that loveth the cleanness of heart, shall have the king (for) a friend, for the grace of his lips (for the eloquence of his words)."},{"num":12,"verse":"The eyes of the Lord keep knowing; and the words of a wicked man be deceived. (The eyes of the Lord keep knowledge safe; but the words of the wicked be deceitful.)"},{"num":13,"verse":"A slow man shall say (A lazy person shall say), A lion is withoutforth; I shall be slain in the midst of the streets."},{"num":14,"verse":"The mouth of an alien woman is a deep ditch; he to whom the Lord is wroth shall fall into it. (The mouth of a woman whom thou hast been intimate with, but who is not thy wife, is a deep ditch; he to whom the Lord is angry with, shall fall into it.)"},{"num":15,"verse":"Folly is bound together in the heart of a child; and a rod of chastising shall drive it away. (Foolishness is bound up in a child’s heart, but the rod of discipline shall drive it away.)"},{"num":16,"verse":"He that falsely challengeth a poor man, to increase his own riches (He who oppresseth the poor, to increase his own riches), shall give to a richer man, and he shall be needy."},{"num":17,"verse":"My son, bow down thine ear, and hear thou the words of wise men; but set thou the heart to my teaching. (My son, bow down thy ear, and listen thou to the words of the wise; yea, set thou thy heart unto my teaching, or my instruction.)"},{"num":18,"verse":"That shall be fair to thee, when thou hast kept it in thine heart, and it shall flow again in thy lips. (It shall please thee when thou hast kept it in thy heart, and it shall flow freely from thy lips.)"},{"num":19,"verse":"That thy trust be in the Lord; wherefore and I have showed it to thee today. (So that thy trust be in the Lord; and so I have showed it to thee today.)"},{"num":20,"verse":"Lo! I have described it in three manners1, in thoughts and knowing,"},{"num":21,"verse":"(so) that I should show to thee the firmness and speeches of truth; to answer (out) of these things to them that sent (unto) thee."},{"num":22,"verse":"Do thou not violence to a poor man, for he is poor; neither defoul thou a needy man in the gate. (Do not thou do violence to a poor person, because he is poor; and do not take advantage of a needy person in court/at the city gates.)"},{"num":23,"verse":"For the Lord shall deem his cause, and he shall torment them that tormented his soul. (For the Lord shall judge his case, and he shall torment those who tormented him.)"},{"num":24,"verse":"Do not thou be (a) friend to a wrathful man, neither go thou with a wrathful man;"},{"num":25,"verse":"lest peradventure thou learn his ways, and take cause of stumbling to thy soul. (lest perhaps thou learn his ways, and bring a cause of stumbling unto thy soul.)"},{"num":26,"verse":"Do not thou be with them that fasten, or bind, their hands, and that proffer themselves to be borrows for debts; (Do not thou be with those who bind their hands, and who offer themselves as pledges for other people’s debts;)"},{"num":27,"verse":"for if he hath not whereof he shall restore, what of cause is, that thou (should) take away (the) covering from (off) thy bed? (for if thou hath not whereof to pay, then they shall even take away thy bed from under thee.)"},{"num":28,"verse":"Go thou not over the eld marks, (or the boundary stones,) which thy fathers have set."},{"num":29,"verse":"Thou hast seen a man smart in his work; he shall stand before kings, and he shall not be before unnoble men."}]