[{"header":"Is Death Fair?"},{"num":9,"verse":"I thought about all this very carefully. I saw that God controls what happens to the good and wise people and what they do. People don’t know if they will be loved or hated, and they don’t know what will happen in the future."},{"num":2,"verse":"But, there is one thing that happens to everyone—we all die! Death comes to good people and bad people. Death comes to those who are pure and to those who are not pure. Death comes to those who give sacrifices and to those who don’t give sacrifices. Good people will die just as sinners do. Those who make promises to God will die just as those who are afraid to make those promises."},{"num":3,"verse":"Of all the things that happen in this life, the worst thing is that all people end life the same way. But it is also very bad that people always think evil and foolish thoughts. And those thoughts lead to death."},{"num":4,"verse":"There is hope for those who are still alive—it does not matter who they are. But this saying is true:"},{"num":5,"verse":"The living know that they will die, but the dead don’t know anything. They have no more reward. People will soon forget them."},{"num":6,"verse":"After people are dead, their love, hate, and jealousy are all gone. And they will never again share in what happens on earth."},{"header":"Enjoy Life While You Can"},{"num":7,"verse":"So go and eat your food now and enjoy it. Drink your wine and be happy. It is all right with God if you do these things."},{"num":8,"verse":"Wear nice clothes and make yourself look good."},{"num":9,"verse":"Enjoy life with the wife you love. Enjoy every day of your short life. God has given you this short life on earth—and it is all you have. So enjoy the work you have to do in this life."},{"num":10,"verse":"Every time you find work to do, do it the best you can. In the grave there is no work. There is no thinking, no knowledge, and there is no wisdom. And we are all going to the place of death."},{"header":"Life Is Not Fair"},{"num":11,"verse":"I also saw other things in this life that were not fair. The fastest runner does not always win the race; the strongest soldier does not always win the battle; wise people don’t always get the food; smart people don’t always get the wealth; educated people don’t always get the praise they deserve. When the time comes, bad things can happen to anyone!"},{"num":12,"verse":"You never know when hard times will come. Like fish in a net or birds in a snare, people are often trapped by some disaster that suddenly falls on them."},{"header":"The Power of Wisdom"},{"num":13,"verse":"I also saw a person doing a wise thing in this life, and it seemed very important to me."},{"num":14,"verse":"There was a small town with a few people in it. A great king fought against that town and put his armies all around it."},{"num":15,"verse":"But there was a wise man in that town. He was poor, but he used his wisdom to save his town. After everything was finished, the people forgot about the poor man."},{"num":16,"verse":"But I still say that wisdom is better than strength. They forgot about the poor man’s wisdom, and the people stopped listening to what he said. But I still believe that wisdom is better."}]