[[],[],[{"type":"prose","content":"Well, I took all this in and thought it through, inside and out. Here’s what I understood: The good, the wise, and all that they do are in God’s hands—but, day by day, whether it’s love or hate they’re dealing with, they don’t know.Anything’s possible. It’s one fate for everybody—righteous and wicked, good people, bad people, the nice and the nasty, worshipers and non-worshipers, committed and uncommitted. I find this outrageous—the worst thing about living on this earth—that everyone’s lumped together in one fate. Is it any wonder that so many people are obsessed with evil? Is it any wonder that people go crazy right and left? Life leads to death. That’s it."}],[{"type":"header","content":"Seize Life!"},{"type":"prose","content":"Still, anyone selected out for life has hope, for, as they say, “A living dog is better than a dead lion.” The living at least know , even if it’s only that they’re going to die. But the dead know nothing and get nothing. They’re a minus that no one remembers. Their loves, their hates, yes, even their dreams, are long gone. There’s not a trace of them left in the affairs of this earth."}],[{"type":"poetry","content":"Seize life! Eat bread with gusto,"},{"type":"poetry","content":"Drink wine with a robust heart."},{"type":"poetry","content":"Oh yes—God takes pleasure in  pleasure!"},{"type":"poetry","content":"Dress festively every morning."},{"type":"poetry","content":"Don’t skimp on colors and scarves."},{"type":"poetry","content":"Relish life with the spouse you love"},{"type":"poetry","content":"Each and every day of your precarious life."},{"type":"poetry","content":"Each day is God’s gift. It’s all you get in exchange"},{"type":"poetry","content":"For the hard work of staying alive."},{"type":"poetry","content":"Make the most of each one!"},{"type":"poetry","content":"Whatever turns up, grab it and do it. And heartily!"},{"type":"poetry","content":"This is your last and only chance at it,"},{"type":"poetry","content":"For there’s neither work to do nor thoughts to think"},{"type":"poetry","content":"In the company of the dead, where you’re most certainly headed."},{"type":"prose","content":"* * *"}],[{"type":"prose","content":"I took another walk around the neighborhood and realized that on this earth as it is—"},{"type":"poetry","content":"The race is not always to the swift,"},{"type":"poetry","content":"Nor the battle to the strong,"},{"type":"poetry","content":"Nor satisfaction to the wise,"},{"type":"poetry","content":"Nor riches to the smart,"},{"type":"poetry","content":"Nor grace to the learned."},{"type":"poetry","content":"Sooner or later bad luck hits us all."}],[{"type":"header","content":"Wisdom Is Better than Muscle"},{"type":"prose","content":"One day as I was observing how wisdom fares on this earth, I saw something that made me sit up and take notice. There was a small town with only a few people in it. A strong king came and mounted an attack, building trenches and attack posts around it. There was a poor but wise man in that town whose wisdom saved the town, but he was promptly forgotten. (He was only a poor man, after all.)"}],[{"type":"prose","content":"All the same, I still say that wisdom is better than muscle, even though the wise poor man was treated with contempt and soon forgotten."}],[{"type":"poetry","content":"The quiet words of the wise are more effective"},{"type":"poetry","content":"Than the ranting of a king of fools."}]]