[{"num":15,"verse":"And the Lord said to me, Though Moses and Samuel stood before me, (yet) my soul is not to(ward) this people; cast thou them out from my face, and go they out."},{"num":2,"verse":"That if they say to thee, Whither shall we go out? (And if they say to thee, Where shall we go?) thou shalt say to them, The Lord saith these things, They that to death, to death, and they that to sword, to sword, and they that to hunger, to hunger, and they that to captivity, to captivity."},{"num":3,"verse":"I shall visit on them four species, saith the Lord; a sword to slaying, and dogs for to rend, and volatiles of the air, and beasts of the earth, to devour and to destroy. (I shall punish them four ways, saith the Lord; with a sword for killing, and dogs for tearing apart, and birds of the air, and beasts of the earth, for devouring and for destroying.)"},{"num":4,"verse":"And I shall give them into fervor to all (the) realms of (the) earth, for Manasseh, the son of Hezekiah, king of Judah, on all things which he did in Jerusalem (for all the things which he did in Jerusalem)."},{"num":5,"verse":"For why who shall have mercy on thee, Jerusalem, either who shall be sorry for thee, either who shall go to pray for thy peace?"},{"num":6,"verse":"Thou hast forsaken me, saith the Lord, thou hast gone aback; and I shall stretch forth mine hand on thee, and I shall slay thee; I travailed praying. (Thou hast deserted me, saith the Lord, thou hast gone away; and I shall stretch forth my hand against thee, and I shall kill thee; I am weary of restraining myself.)"},{"num":7,"verse":"And I shall scatter them with a winnowing instrument in the gates of [the] earth; I killed, and lost my people (I killed, and destroyed my people), and nevertheless they turned not again from their ways."},{"num":8,"verse":"The widows thereof be multiplied to me above the gravel of the sea; and I brought into them a destroyer in midday on the mother of a young man, I sent dread suddenly on [the] cities. (Its widows be multiplied by me, in number more than the sands of the sea; and I brought in upon them a destroyer at midday against the mothers of the young men, and I sent fear suddenly upon the cities.)"},{"num":9,"verse":"She was sick that childed seven, her soul failed; the sun went down to her, when day was yet. She was shamed, and was ashamed; and I shall give the residue thereof into sword in the sight of their enemies, saith the Lord. (She was sick who gave birth to seven, her life failed; her sun went down, while it was still daylight. She was shamed, and was ashamed; and I shall give all the rest who be alive unto the sword in the sight of their enemies, saith the Lord.)"},{"num":10,"verse":"My mother, woe to me; why engenderedest thou me a man of chiding, a man of discord in all the land? I lent not, neither any man lent to me; all men curse me(.),"},{"num":11,"verse":"the Lord saith. No man believe to me, if thy remnants be not into good, if I run not to thee in the time of torment, and in the time of tribulation and of anguish, against the enemy. (The Lord saith, No one believe me, if it be not well with thy remnant, and if I do not run against the enemy for thee, in the time of torment, and in the time of trouble and of anguish.)"},{"num":12,"verse":"Whether iron and metal shall be joined by peace to iron from the north? (Can iron be broken, especially the iron from the north, that is joined with bronze?)"},{"num":13,"verse":"And I shall give freely thy riches and thy treasures into ravishing, for all thy sins, and in all thine ends. (And I shall freely give thy riches and thy treasures for robbing, for all thy sins, and in all thy land.)"},{"num":14,"verse":"And I shall bring thine enemies from the land which thou knowest not; for (a) fire is kindled in my strong vengeance, and it shall burn on you."},{"num":15,"verse":"Lord, thou knowest, have thou mind on me, and visit me, and deliver me from them that pursue me; do not thou take me (away) in thy patience, know thou, that I suffered shame for thee. (Lord, thou knowest, remember thou me, and visit me, and rescue me, or save me, from those who pursue me; yea, in thy patience, do not thou take me away, that is, do not let me perish, and know thou, that I have suffered shame for thee.)"},{"num":16,"verse":"Thy words be found, and I ate those; and thy word was made to me into joy, and into gladness of mine heart; for thy name, Lord God of hosts, is called to help on me (for thy name, the Lord God of hosts, is called on to help me/for I am called by thy name, O Lord God of hosts)."},{"num":17,"verse":"I sat not in the council of players, and I had glory for the face of thine hand; I sat alone, for thou filledest me with bitterness. (I sat not in the company of scorners, or of mockers, and I took no glory with them/and I made not merry with them; because of thy hand, or in obedience to thee, I sat alone; for thou hast filled me with anger.)"},{"num":18,"verse":"Why is my sorrow made everlasting, and my wound despaired (to heal?), (why) forsook (it) to be cured? it is made to me, as a leasing of unfaithful waters (it is made to me like a lie, like summer waters that fail, or that dry up)."},{"num":19,"verse":"For this thing the Lord saith these things (to me), If thou turnest (back to me), (then) I shall turn (back to) thee, and thou shalt stand before my face (again); and if thou partest precious thing from vile thing, (then) thou shalt be as my mouth (again); and they shall be turned to thee, and thou shalt not be turned to them (and if thou separatest precious words from vile ones, then thou shalt be like my mouth again; and the people shall return to thee, and thou shalt not need to go to them)."},{"num":20,"verse":"And I shall give thee into a brazen wall and strong to this people (And I shall make thee like a strong bronze wall to this people), and they shall fight against thee, and they shall not have the victory; for I am with thee, to save thee, and to deliver thee, saith the Lord."},{"num":21,"verse":"And I shall deliver thee from the hand of the worst men, and I shall again-buy thee from the hand of strong men. (And I shall rescue, or shall save, thee from the hands, or the power, of the wicked, and I shall buy thee back from the hands, or the power, of the strong.)"}]