[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(29) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then he called for a light.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—More accurately, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘for lights.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As St. Luke does not use, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the word for “lamps,” it is probable that the lights were torches, and that the gaoler, with one in his hand, leapt into the darkness of the subterranean dungeon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 16:29-30. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 16:29-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then he, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The jailer, greatly terrified by the earthquake, and astonished at Paul’s discovering his purpose to kill himself; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "called for a light ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φωτα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lights, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "implying, it seems, that on this alarm several of his attendants came with torches, and were present at the inquiry which immediately followed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and sprang in ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— With a violent and impetuous motion, into the inner prison, and, in the presence of his domestics, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fell down trembling before Paul and Silas ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Begging them, doubtless, to forgive the injuries he had been obliged to do them; for he was now convinced that they were, what the possessed damsel called them, even ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the servants of the most high God, who showed to men the way of salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And then, in the most respectful manner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "brought them out ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— From the inner prison, in which they were confined; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and said, Sirs ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Κυριοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a style this in which he did not address them the day before; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what must I do to be saved? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— From the guilt I feel, and the vengeance I fear; probably referring to the testimony of the Pythoness, which had been so often and so publicly repeated. God, however, undoubtedly then set his sins in array before him, and convinced him, in the clearest and strongest manner, that the wrath of God abode upon him. Added to this, probably, “a vast multitude of ideas rushed into his mind at once. He saw by the earthquake the power and displeasure of God; and, together with this, the sweetness and joy of Paul and Silas in their bonds, their willing continuance in prison, when they might easily have escaped, and their generous solicitude for the life of one who had used them so ill, were all circumstances fit to strike powerfully on a mind so passionate as his seems to have been, and might all do their part toward convincing him that these men were indeed divine messengers, and that the divine displeasure was falling on the city, and particularly on himself, for persecuting them. Perhaps some kind and pious words, which Paul and Silas, who took all opportunities of doing good, might have uttered while he was fastening their feet in the stocks, might throw further light on his mind, when recollected amidst such extremity of danger; and, no doubt, the Spirit of God added conviction and energy to all.” — Doddridge.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:25-34 The consolations of God to his suffering servants are neither few nor small. How much more happy are true Christians than their prosperous enemies! As in the dark, so out of the depths, we may cry unto God. No place, no time is amiss for prayer, if the heart be lifted up to God. No trouble, however grievous, should hinder us from praise. Christianity proves itself to be of God, in that it obliges us to be just to our own lives. Paul cried aloud to make the jailer hear, and to make him heed, saying, Do thyself no harm. All the cautions of the word of God against sin, and all appearances of it, and approaches to it, have this tendency. Man, woman, do not ruin thyself; hurt not thyself, and then none else can hurt thee; do not sin, for nothing but that can hurt thee. Even as to the body, we are cautioned against the sins which do harm to that. Converting grace changes people's language of and to good people and good ministers. How serious the jailer's inquiry! His salvation becomes his great concern; that lies nearest his heart, which before was furthest from his thoughts. It is his own precious soul that he is concerned about. Those who are thoroughly convinced of sin, and truly concerned about their salvation, will give themselves up to Christ. Here is the sum of the whole gospel, the covenant of grace in a few words; Believe in the Lord Jesus Christ, and thou shalt be saved, and thy house. The Lord so blessed the word, that the jailer was at once softened and humbled. He treated them with kindness and compassion, and, professing faith in Christ, was baptized in that name, with his family. The Spirit of grace worked such a strong faith in them, as did away further doubt; and Paul and Silas knew by the Spirit, that a work of God was wrought in them. When sinners are thus converted, they will love and honour those whom they before despised and hated, and will seek to lessen the suffering they before desired to increase. When the fruits of faith begin to appear, terrors will be followed by confidence and joy in God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then he called for a light - Greek: lights, in the plural. Probably several torches were brought by his attendants.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And came trembling - Alarmed at the earthquake; amazed that the prisoners were still there; confounded at the calmness of Paul and Silas and overwhelmed at the proof of the presence of God. Compare Jeremiah 5:22, \"Fear ye not me, saith the Lord? will ye not tremble at my presence? etc.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And came trembling - Alarmed at the earthquake; amazed that the prisoners were still there; confounded at the calmness of Paul and Silas and overwhelmed at the proof of the presence of God. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Fear ye not me, saith the Lord? will ye not tremble at my presence? etc.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And fell down - This was an act of profound reverence. See the notes on Matthew 2:11. It is evident that he regarded them as the favorites of God, and was con strained to recognize them as religious teachers. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And fell down - This was an act of profound reverence. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is evident that he regarded them as the favorites of God, and was con strained to recognize them as religious teachers. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29, 30. Then he called for a light, and sprang in … and fell down before Paul and Silas, and brought them out and said—How graphic this rapid succession of minute details, evidently from the parties themselves, the prisoners and the jailer, who would talk over every feature of the scene once and again, in which the hand of the Lord had been so marvellously seen.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He called for a light, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or lights, which prisons are not usually without. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Came trembling:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what a sudden and great change can God make! he comes trembling to those feet which he had put into the stocks so lately. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Fell down before Paul and Silas; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by which he would give a civil respect unto them, it being an ordinary rite amongst the Eastern nations (as endless examples in Scripture witness) to pay their respects; and from them it spread itself into Greece: which respect Paul and Silas do not refuse, because it was barely civil, and did show the humility aud brokenness of the jailer’s heart. Yet Peter would not accept of the like from Cornelius, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 10:25,26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", because it was more than a bare civil respect which Cornelius would have given him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then he called for a light,.... Or \"lights\"; he ordered his servants to bring in some candles; the Syriac version renders it, \"he lighted a light for himself\"; and the Ethiopic version, \"he brought a light\": whilst he was under the influence of Satan, and going about a work of darkness, namely, to destroy himself, he was in no concern for a light; but when he was delivered from the temptation and snare, he calls for light: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and sprang in; leaped in at once, in all haste, into the inner prison: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and came trembling; not as before, because of the prisoners and their escape; nor merely or so much on account of the earthquake, though the terror of that might not be as yet over; but chiefly through the horror of his conscience, and the dreadful sense he had of himself as a sinner, and of his lost state and condition by nature; the law had entered into his conscience, and had worked wrath there; the Spirit of God had convinced him of his sin and misery, and there was a fearful looking for of fiery indignation in him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and fell down before Paul and Silas; not in a way of religious adoration, for they would never have admitted that; but in token of civil respect unto them, and of his great veneration for them, as was the manner of the eastern people; the Syriac version renders it, \"he fell down at their feet\", and so in Velesius's readings; at those feet, which he had before made fast in the stocks: a strange change and sudden alteration this! what is it that almighty power and efficacious grace cannot do? ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and fell down before Paul and Silas; not in a way of religious adoration, for they would never have admitted that; but in token of civil respect unto them, and of his great veneration for them, as was the manner of the eastern people; the Syriac version renders it, \"he fell down at their feet\", and so in Velesius's readings; at those feet, which he had before made fast in the stocks: a strange change and sudden alteration this! what is it that almighty power and efficacious grace cannot do? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then he called for a light, and sprang in, and came trembling, and fell down before Paul and Silas,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:29-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Φῶτα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lights",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lamps",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Xen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hell.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " v. 1. 8; Lucian. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Conviv.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 15; Plut. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ant.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 26), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "several",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in order to light up and strictly search everything.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔντρομος γενόμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προσέπ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] He now saw in Paul and Silas no longer criminals, but the favourites and confidants of the gods; the majesty which had been maltreated inspired him with terror and respectful submission.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἵνα σωθῶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in order that I may obtain salvation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He means the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σωτηρία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which Paul and Silas had announced; for what he had heard of them, that they made known ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁδὸν σωτηρίας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was now established in his conviction as truth. This lively conviction longs to have part in the salvation, and his sincere longing desires to fulfil that by which this participation is conditioned. Morus, Stolz, Rosenmüller render it: “in order that I may escape the punishment of the gods on account of your harsh treatment.” But, if Luke desired to have ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σωθῶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σωθήσῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") understood in different senses, he must have appended to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σωθῶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a more precise definition; for the meaning thus assigned to it suggests itself the less naturally, as the jailor, who had only acted as an instrument under higher direction (comp. Chrysost.), could not reasonably apprehend any vengeance of the gods.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φῶτα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “lights,” R.V., plural, and only in plural in later Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Ma 12:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of fires in a military encampment; “the prisoners’ chains were loosed, and worse chains were loosed from himself; he called for a light, but the true heat was lighted in his own heart” Chrys., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hom.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", xxxvi.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰσεπήδησε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 14:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκπ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., both verbs only in Luke in N.T. In LXX, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Sus., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", especially the latter, found also in classical Greek.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔντρομος γεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., see above.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προσέπεσε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": he may have known of the words of the maiden, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and recognised their truth in the earthquake, and in the calmness and demeanour of Paul; hence too his question.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then he called for a light",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Greek has “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lights",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” He would summon all the help he could, and wish to make his inspection as speedy as possible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and came trembling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and being terror-stricken",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He connected all that had occurred with the two prisoners Paul and Silas, and as they were not fled away, a change of feeling came over him, and he at once judged them to be more than other men. So his attitude becomes one of supplication and worship.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Φῶτα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lights",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Plural: that the whole prison might be lighted up.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he called for lights",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "then he called for a light",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "φῶτα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the accusative plural, though not a very common form; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "φῶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is often used in the sense of \"a lamp,\" or, as we say, \"a light\"); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "trembling for fear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "came trembling and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. Acts 16:29",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A light (φῶτα)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rev., more correctly, lights. Several lamps, in order to search everywhere.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sprang in",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on ran in, Acts 14:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ran in, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 14:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]