[{"header":"Dirge for Egypt"},{"num":30,"verse":"The word of the Lord came again to me, saying, "},{"num":2,"verse":"“Son of man, prophesy and say, ‘Thus says the Lord God,"},{"num":5,"verse":"Ethiopia (Cush), Put, Lud, all Arabia, Libya (Cub) and the people of the land of the covenant [the Jews who had taken refuge in Egypt] will fall with the Egyptians by the sword.”"},{"num":9,"verse":"On that day [swift] messengers will go from Me in ships to frighten the careless and unsuspecting Ethiopians, and there will be anguish and trembling in them as in the day of [judgment for] Egypt; for behold, it is coming!”"},{"num":10,"verse":"‘Thus says the Lord God,"},{"header":"Victory for Babylon"},{"num":20,"verse":"In the eleventh year [after King Jehoiachin was taken to Babylon], in the first month, on the seventh of the month, the word of the Lord came to me, saying, "},{"num":21,"verse":"“Son of man, I have broken the arm of Pharaoh king of Egypt; and behold, it has not been bound up to heal or wrapped with a bandage, so that it may be strong to hold and wield the sword. "},{"num":22,"verse":"Therefore thus says the Lord God, ‘Behold, I am against Pharaoh king of Egypt and will break his arms, both the strong one and the broken, and I will make the sword fall from his hand. "},{"num":23,"verse":"I will scatter the Egyptians among the nations and will disperse them throughout the lands. "},{"num":24,"verse":"I will strengthen the arms of the king of Babylon and put My sword in his hand; but I will break Pharaoh’s arms and he will groan before him (Nebuchadnezzar) with the groanings of a [mortally] wounded man. "},{"num":25,"verse":"But I will strengthen and hold up the arms of the king of Babylon and the arms of Pharaoh will fall down. Then the people [of Egypt] will know that I am the Lord, when I put My sword into the hand of the king of Babylon and he stretches it out against the land of Egypt. "},{"num":26,"verse":"When I scatter the Egyptians among the nations and disperse them through the lands, then they will know [without any doubt] that I am the Lord.’”"}]