[[],[{"type":"header","content":"A Lament for Egypt"},{"type":"prose","content":"The word of the LORD came to me:"}],[{"type":"prose","content":"“Son of man, prophesy, and say, Thus says the Lord GOD:"}],[{"type":"prose","content":"Cush, and Put, and Lud, and all Arabia, and Libya, and the people of the land that is in league, shall fall with them by the sword."}],[{"type":"prose","content":"“On that day messengers shall go out from me in ships to terrify the unsuspecting people of Cush, and anguish shall come upon them on the day of Egypt's doom; for, behold, it comes!"}],[{"type":"prose","content":"“Thus says the Lord GOD:"}],[{"type":"prose","content":"“Thus says the Lord GOD:"}],[{"type":"header","content":"Egypt Shall Fall to Babylon"},{"type":"prose","content":"In the eleventh year, in the first month, on the seventh day of the month, the word of the LORD came to me:"}],[{"type":"prose","content":"“Son of man, I have broken the arm of Pharaoh king of Egypt, and behold, it has not been bound up, to heal it by binding it with a bandage, so that it may become strong to wield the sword."}],[{"type":"prose","content":"Therefore thus says the Lord GOD: Behold, I am against Pharaoh king of Egypt and will break his arms, both the strong arm and the one that was broken, and I will make the sword fall from his hand."}],[{"type":"prose","content":"I will scatter the Egyptians among the nations and disperse them through the countries."}],[{"type":"prose","content":"And I will strengthen the arms of the king of Babylon and put my sword in his hand, but I will break the arms of Pharaoh, and he will groan before him like a man mortally wounded."}],[{"type":"prose","content":"I will strengthen the arms of the king of Babylon, but the arms of Pharaoh shall fall. Then they shall know that I am the LORD, when I put my sword into the hand of the king of Babylon and he stretches it out against the land of Egypt."}],[{"type":"prose","content":"And I will scatter the Egyptians among the nations and disperse them throughout the countries. Then they will know that I am the LORD.”"}]]