[{"header":"Israel Crosses the Jordan"},{"num":3,"verse":"Joshua got up early in the morning; then he and all the children of Israel set out from Shittim and came to the Jordan, and they spent the night there before they crossed [the river]. "},{"num":2,"verse":"And it happened at the end of three days that the officers went throughout the camp, "},{"num":3,"verse":"and they commanded the people, “When you see the ark of the covenant of the Lord your God being carried by the Levitical priests, then you shall set out from where you are and follow it. "},{"num":4,"verse":"However, there shall be a distance between you and it of about 2,000 cubits (3,000 ft.) by measurement. Do not come near it, so that you may [be able to see the ark and] know the way you are to go, for you have not passed this way before.”"},{"num":5,"verse":"Then Joshua said to the people, “Sanctify yourselves [for His purpose], for tomorrow the Lord will do wonders (miracles) among you.” "},{"num":6,"verse":"Joshua said to the priests, “Take up the ark of the covenant and cross over [the river] ahead of the people.” So they took up the ark of the covenant and went on ahead of the people."},{"num":7,"verse":"The Lord said to Joshua, “This day I will begin to magnify and exalt you in the sight of all Israel, so that they may know that just as I was with Moses, I will [also] be with you. "},{"num":8,"verse":"You shall command the priests who carry the ark of the covenant, saying, ‘When you come to the edge of the waters of the Jordan, you shall stand still in the Jordan.’” "},{"num":9,"verse":"Joshua said to the Israelites, “Come here, and listen to the words of the Lord your God.” "},{"num":10,"verse":"Joshua said, “By this you shall know that the living God is among you, and that He will, without fail, drive out from before you the Canaanite, the Hittite, the Hivite, the Perizzite, the Girgashite, the Amorite, and the Jebusite. "},{"num":11,"verse":"Behold, the ark of the covenant of the Lord of all the earth is crossing over ahead of you [leading the way] into the Jordan. "},{"num":12,"verse":"So now take for yourselves twelve men from the tribes of Israel, one man from each tribe. "},{"num":13,"verse":"When the soles of the feet of the priests who carry the ark of the Lord, the Lord of all the earth, [come to] rest in the waters of the Jordan, the waters of the Jordan flowing down from above will be cut off, and they will stand in one mass [of water].”"},{"num":14,"verse":"So when the people set out from their tents to cross over the Jordan with the priests who were carrying the ark of the covenant before the people, "},{"num":15,"verse":"and when those who were carrying the ark came up to the Jordan, and the feet of the priests carrying the ark were submerged at the edge of the water (for the Jordan overflows all of its banks throughout the time of harvest), "},{"num":16,"verse":"the waters which were flowing down from above stopped and rose up in one mass a great distance away at Adam, the city that is beside Zarethan. Those [waters] flowing downward toward the sea of the Arabah, the Salt Sea, were completely cut off. So the people crossed [the river] opposite Jericho. "},{"num":17,"verse":"And while all [the people of] Israel crossed over on dry ground, the priests who carried the ark of the covenant of the Lord stood firm on dry ground in the midst of the Jordan [riverbed], until all the nation had finished crossing over the Jordan."}]