[{"num":3,"verse":"Joshua got up early in the morning. He and all the people of Israel left Shittim and came to the Jordan. And they stayed there before they crossed. "},{"num":2,"verse":"After three days the leaders went among the tents. "},{"num":3,"verse":"They told the people, “When you see the special box of the agreement of the Lord your God with the religious leaders carrying it, leave your places and follow it. "},{"num":4,"verse":"Then you may know the way to go, for you have not passed this way before. But stay about 1,000 long steps away from it. Do not come near it.”"},{"num":5,"verse":"Then Joshua said to the people, “Make yourselves holy. For tomorrow the Lord will do powerful works among you.” "},{"num":6,"verse":"Joshua said to the religious leaders, “Take up the special box of the agreement and cross over in front of the people.” So they took up the special box of the agreement and went in front of the people."},{"num":7,"verse":"The Lord said to Joshua, “Today I will begin to give you honor in the eyes of all Israel. Then they may know that I will be with you just as I have been with Moses. "},{"num":8,"verse":"Tell the religious leaders who are carrying the special box of the agreement, ‘When you come to the water of the Jordan River, stand still in it.’” "},{"num":9,"verse":"Then Joshua said to the people of Israel, “Come here. Listen to the words of the Lord your God.” "},{"num":10,"verse":"And Joshua said, “You will know that the living God is among you because He will be sure to drive away from in front of you the Canaanite, the Hittite, the Hivite, the Perizzite, the Girgashite, the Amorite and the Jebusite. "},{"num":11,"verse":"See, the special box of the agreement of the Lord of All the earth is crossing over in front of you in the Jordan. "},{"num":12,"verse":"Now choose twelve men from the families of Israel, one man for each family. "},{"num":13,"verse":"The religious leaders who carry the special box of the agreement of the Lord of All the earth, will rest their feet in the water of the Jordan. Then the water of the Jordan will be cut off. The water flowing down from above will gather together in one place.”"},{"num":14,"verse":"So the people left their tents to cross the Jordan. The religious leaders carried the special box of the agreement in front of the people. "},{"num":15,"verse":"They carried it to the Jordan and put their feet in the water. (For the Jordan water floods during the time of gathering grain.) "},{"num":16,"verse":"Then the water flowing down from above stood and rose up in one place far away at Adam, the city beside Zarethan. The water flowing down toward the sea of the Arabah, the Salt Sea, was all cut off. So the people crossed beside Jericho. "},{"num":17,"verse":"The religious leaders who carried the special box of the agreement of the Lord stood on dry ground in the middle of the Jordan. And all Israel crossed on dry ground, until all the nation had crossed the Jordan."}]