[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then said he.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The meaning of this verse is obscure. Apparently the person who is speaking refers back to what he had said (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and from the question ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Knowest thou?” &c., we are to infer that Daniel was perfectly aware of the reasons which caused him to come, viz., “to make thee understand what shall befal thy people in the latter days.” But before he proceeds to make this revelation, he prepares Daniel’s mind for a portion of what is about to be revealed, by mentioning the spiritual powers which ruled over Greece. “I shall return to fight,” referring to the Providence which watched over Israel during the Persian sovereignty; “but while I am gone forth” (the word being used in a military sense, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") “the prince of Javan will come,” this word being also used in a hostile sense. The prophet is in this manner prepared for troublous times, which shall occur under the Macedonian supremacy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 10:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Knowest thou wherefore I come unto thee? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou knowest for what cause I am come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. “The angel, having strengthened the prophet, presumes that he also understood the general design of his errand. The Greek is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ει οιδας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Surely thou knowest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "according to a usual Hebrew idiom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And now will I return to fight with the prince of Persia — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "With the evil angel, who, under “the god of this world,” presides over Persia; or rather, with the present ruling prince of Persia, whether Cambyses or any other person then intrusted with the chief power, whose designs against the Jews this angel was employed in counteracting, and would continue to counteract, as also those of every future prince of that kingdom, till it should be overturned by the Greeks. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when I am gone forth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ואני יוצא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and I going forth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, to execute my commission; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when I am gone forth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "having executed it, and their monarchy is brought down for their unkindness to the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lo, the prince of Grecia shall come — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Macedonian empire, under Alexander the Great and his successors, shall be established in Asia; and though favourable to the Jews at first, as the Persian was, yet will afterward become vexatious to them. “Such is the state of the church militant; when it has got clear of one enemy, it has another to encounter; and such a hydra’s head is that of the old serpent; when one storm is blown over, it is not long before another rises.” — Henry.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:10-21 Whenever we enter into communion with God, it becomes us to have a due sense of the infinite distance between us and the holy God. How shall we, that are dust and ashes, speak to the Lord of glory? Nothing is more likely, nothing more effectual to revive the drooping spirits of the saints, than to be assured of God's love to them. From the very first day we begin to look toward God in a way of duty, he is ready to meet us in the way of mercy. Thus ready is God to hear prayer. When the angel had told the prophet of the things to come, he was to return, and oppose the decrees of the Persian kings against the Jews. The angels are employed as God's ministering servants, Heb 1:14. Though much was done against the Jews by the kings of Persia, God permitting it, much more mischief would have been done if God had not prevented it. He would now more fully show what were God's purposes, of which the prophecies form an outline; and we are concerned to study what is written in these Scriptures of truth, for they belong to our everlasting peace. While Satan and his angels, and evil counsellors, excite princes to mischief against the church, we may rejoice that Christ our Prince, and all his mighty angels, act against our enemies; but we ought not to expect many to favour us in this evil world. Yet the whole counsel of God shall be established; and let each one pray, Lord Jesus, be our righteousness now, and thou wilt be our everlasting confidence, through life, in death, at the day of judgment, and for evermore.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then said he, Knowest thou wherefore I come unto thee? - This was known by what the angel had said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He seems to have called his attention to it, and to have proposed the question, because Daniel had been so overcome by his fright that it might be doubtful whether he had understood him distinctly when he had told him the object of his coming. He therefore proposes the question here; and as the silence of Daniel seems to have been construed as a declaration that he did understand the purpose of the visit, he proceeds to unfold frilly the purport of his message.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And now will I return - That is, evidently, after he had made known to him the message which he came to deliver. He cannot mean that he would then leave Daniel, and return immediately to Persia, for he proceeds at length Daniel 11-12 to deliver his message to him, and to state what would occur in the world in future times.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And now will I return - That is, evidently, after he had made known to him the message which he came to deliver. He cannot mean that he would then leave Daniel, and return immediately to Persia, for he proceeds at length ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to deliver his message to him, and to state what would occur in the world in future times.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To fight with the prince of Persia - In Daniel 10:13, he says that he had had a contest with that \"prince,\" and that in consequence of that he had been delayed on his journey to Daniel. By the interposition of Michael, the affairs of Persia had been so arranged that the opposition to what was desired by Daniel had been in part removed - so far, at least, as to make it certain that Iris prayers would be answered. See the note at that verse. But still it would seem that the difficulty was not entirely overcome, and that it would be desirable for him to return, and to complete the arrangements which had been commenced. There were still causes in existence in Persia which might tend to frustrate all these plans unless they were counteracted, and his presence might still be necessary there to secure the safe return of the exiles to their own land, and the means required to rebuild the city and temple. The simple meaning of this is, that it would be necessary to exert a farther influence at the Persian court in order to bring about the object desired; and this fact is expressed in language derived from the belief that angelic beings, good and bad, have much to do in controlling the minds of men.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To fight with the prince of Persia - In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he says that he had had a contest with that \"prince,\" and that in consequence of that he had been delayed on his journey to Daniel. By the interposition of Michael, the affairs of Persia had been so arranged that the opposition to what was desired by Daniel had been in part removed - so far, at least, as to make it certain that Iris prayers would be answered. See the note at that verse. But still it would seem that the difficulty was not entirely overcome, and that it would be desirable for him to return, and to complete the arrangements which had been commenced. There were still causes in existence in Persia which might tend to frustrate all these plans unless they were counteracted, and his presence might still be necessary there to secure the safe return of the exiles to their own land, and the means required to rebuild the city and temple. The simple meaning of this is, that it would be necessary to exert a farther influence at the Persian court in order to bring about the object desired; and this fact is expressed in language derived from the belief that angelic beings, good and bad, have much to do in controlling the minds of men.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And when I am gone forth - literally, \"and I go forth.\" The meaning seems to be, that he would return to Persia, and would so direct affairs there that the welfare of the Jews would be promoted, and that protection would be extended to them. This, he says, he would continue as long as it was necessary, for when he should have gone forth, the king of Greece would come, and the affairs of Persia would be put on a new footing, but on such a footing as not to require his presence - for the government would be of itself favorable to the Jews. The sense is, that up to the time when this \"king of Grecia\" should come, there would be a state of things in the Persian court that would demand the presence of some being from heaven - exerting some constant influence to prevent an outbreak against the Jews, and to secure their peace and prosperity; but that when the \"king of Grecia\" should come, he would himself favor their cause, and render the presence of the angel unnecessary. No one can prove that this is not a correct representation, or that the favor shown to the Jews at the Persian court during all the time of the rebuilding of the city and the temple, was not to be traced to some presiding influence from above, or that that was not put forth in connection with the ministration of an angelic being. Indeed, it is in accordance with all the teachings of the Bible that the disposition of kings and princes to show favor to the people of God, like all else that is good in this world, is to be traced to an influence from above; and it is not contrary to any of the laws of analogy, or anything with which we are acquainted pertaining to the spiritual world, to suppose that angelic interposition may be employed in any case in bringing about what is good.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lo, the prince of Grecia shall come - Hebrew - יון  yâvân. There can be no doubt that Greece is intended. The word properly denotes Ionia (derived from this word), \"the name of which province,\" says Gesenius, \"as being adjacent to the East, and better known, was extended so as to comprehend the whole of Greece, as is expressly said by Greek writers themselves.\" - Lexicon By the \"prince of Greece\" here, there can be no doubt that there is reference to Alexander the Great, who conquered Persia. See Daniel 11:1-4. The meaning here is, that when he should come, and conquer Persia, the opposition which the Hebrews had encountered from that country would cease, and there would then be no need of the interposition of the angel at the Persian court. The matter of fact was, that the Hebrews were favored by Alexander the Great, and that whatever there was in the Persian or Chaldean power which they had had reason to dread was then brought to an end, for all those Eastern governments were absorbed in the empire of Alexander - the Macedonian monarchy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lo, the prince of Grecia shall come - Hebrew - יון  yâvân. There can be no doubt that Greece is intended. The word properly denotes Ionia (derived from this word), \"the name of which province,\" says Gesenius, \"as being adjacent to the East, and better known, was extended so as to comprehend the whole of Greece, as is expressly said by Greek writers themselves.\" - Lexicon By the \"prince of Greece\" here, there can be no doubt that there is reference to Alexander the Great, who conquered Persia. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning here is, that when he should come, and conquer Persia, the opposition which the Hebrews had encountered from that country would cease, and there would then be no need of the interposition of the angel at the Persian court. The matter of fact was, that the Hebrews were favored by Alexander the Great, and that whatever there was in the Persian or Chaldean power which they had had reason to dread was then brought to an end, for all those Eastern governments were absorbed in the empire of Alexander - the Macedonian monarchy. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. Knowest thou wherefore—The angel asks, after Daniel had recovered from his fright, whether he has understood what was revealed (Da 10:13). On Daniel, by his silence, intimating that he did understand, the angel declares he will return to renew the fight with the evil angel, the prince of Persia. This points to new difficulties to the Jews' restoration which would arise in the Persian court, but which would be counteracted by God, through the ministry of angels.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "prince of Grecia shall come—Alexander the Great, who conquered Persia, and favored the Jews [Calvin]. Rather, as the prince of Persia is an angel, representing the hostile world power, so the prince of Grecia is a fresh angelic adversary, representing Greece. When I am gone forth from conquering the Persian foe, a fresh one starts up, namely, the world power that succeeds Persia, Greece; Antiochus Epiphanes, and his antitype Antichrist, but him, too, with the help of Michael, Israel's champion, I shall overcome [Gejer].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Knowest thou wherefore I come unto thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. by what I have said already, and what I have further to tell thee upon thy prayers, which God hath accepted, and hath given me in charge to reveal to thee as followeth to the end. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To fight with the prince of Persia; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Cyrus, or Cambyses, who by his counsels and captains hinder the work of God; and to bring the prince of Greece upon him, viz. Alexander the Great, who utterly ruined the Persian monarchy, which is ushered with the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because it was a wonder that the prince of Greece with thirty thousand men should do it. Thus the Lord sets and disposeth the fates of empires, and changeth them as he lists; especially in his church’s quarrel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then said he, knowest thou wherefore I come unto thee?.... He had told him before, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that it was on account of his prayers, and to bring an answer to them; and particularly to inform him what would befall his people in the latter day; and now, lest, through the hurry of his spirits, he had not observed it, or had forgot it, he reminds him of it, to stir up his desire the more after the knowledge of particulars, which he was now about to relate unto him: and now will I return to fight with the prince of Persia; the evil spirit, in the court of Persia, he had been contesting with before, and had got the better of by the help of Michael; but since this good angel had been with Daniel, the evil one had been working upon the king and counsellors of Persia, and had wrought them up to an indifference unto, or carelessness about, the affairs of the people of the Jews, and to listen to their adversaries, whereby the building of the city and temple went on heavily and slowly; and so things were, through the evil influence of Satan, more or less, until the twentieth year of Artaxerxes Longimanus: and, indeed, Satan was continually soliciting mischief against the Jews, and stirring up enemies to them in the court of Persia, as long as that monarchy lasted, though he had not always the wished for success; the times of Esther and Mordecai are a proof of this: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and when I am gone forth, lo, the prince of Grecia shall come; meaning, when he was gone forth from the court of Persia, having done his business he was sent about; confounded the schemes and baffled the designs of the evil spirit, conquered him, and obliged him to give way, and cease from being troublesome any more, and obtained peace and rest for the Jews, and settled their affairs: the Persian monarchy being translated to the Grecians, the evil spirit began to work among them, to put them on doing mischief to the people of God; as in Alexander himself, who set out against them, but was pacified by the meeting of the high priest; and more especially in his successors; and above all in Antiochus, who was a violent persecutor of them; which this clause, as well as the following prophecy, has a respect unto. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and when I am gone forth, lo, the prince of Grecia shall come; meaning, when he was gone forth from the court of Persia, having done his business he was sent about; confounded the schemes and baffled the designs of the evil spirit, conquered him, and obliged him to give way, and cease from being troublesome any more, and obtained peace and rest for the Jews, and settled their affairs: the Persian monarchy being translated to the Grecians, the evil spirit began to work among them, to put them on doing mischief to the people of God; as in Alexander himself, who set out against them, but was pacified by the meeting of the high priest; and more especially in his successors; and above all in Antiochus, who was a violent persecutor of them; which this clause, as well as the following prophecy, has a respect unto. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then said he, Knowest thou wherefore I come unto thee? and now will I return to fight with the prince of Persia: and when I am gone forth, lo, the {p} prince of Grecia shall come.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then said he, Knowest thou wherefore I come unto thee? and now will I return to fight with the prince of Persia: and when I am gone forth, lo, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{p}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prince of Grecia shall come.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Meaning that he would not only himself bridle the rage of Cambyses, but also the other kings of Persia by Alexander the King of Macedonia.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Knowest thou",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] A rhetorical question, designed to recall to Daniel what had been said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 10:12; Daniel 10:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to indicate to him its importance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and now will I return",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] to carry on and complete the successes begun in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 10:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ‘Now’ must mean, as soon as possible, as soon as I have given thee this revelation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.): I cannot tarry here longer than is necessary, as I have still to contend in heaven against the enemies of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and when I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "go",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (viz. from the contest with the ‘prince’ of Persia), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lo, the prince of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Greece",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Javan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "will come in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As soon as the conflict with Persia is ended, one with Greece will begin: ‘go forth’ and ‘come in,’ as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It would be more in accordance with the usual sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "go forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in such a connexion as the present, to understand it of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "going forth to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the contest with the prince of Persia (cf. of going forth on a military expedition, with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to battle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " expressed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 21:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; without it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 9:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "end",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), 3, 6, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.); but unless the future is greatly foreshortened, or ‘go forth’ is understood not of proceeding to, but of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "continuing in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the conflict (so Keil), this interpretation agrees hardly with the history; for the empire of Alexander and his successors did not arise till two centuries after the time of Cyrus.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then said he, Knowest thou wherefore I come unto thee? and now will I return to fight with the Prince of Persia: and when I am gone forth, lo, the Prince of Grecia shall come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The versions here are in close agreement with the Massoretic text. Theodetion, since he begins the speech of the angel with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", may have read ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "הֵן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hayn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"if,\" instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "הֲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ha",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the sign of interrogation. The Peshitta has, \"to make war,\" instead of \"fight,\" indicating a beginning of hostilities, not a continuance of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Then said he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Knowest thou wherefore I come unto thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This question appears to be abruptly put, and to be put without awaiting an answer. Probably the meaning would be better brought out by rendering, somewhat colloquially, \"You know, don't you? After I have revealed the future to you, I must return.\" In considering this whole subject, we must beware of taking everything literally. We may not deduce, because of the statement here, that angels are under the limitations of time and space, or that there is actual warfare. We must regard the matter as, to a large extent, figurative. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And now will I return to fight with the Prince of Persia.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Every one who studies history in a philosophic spirit must see that the progress of the race, the evolution of that ultimate ideal state - the kingdom of heaven among men  - is accomplished by successive steps, and over each step a nationality presides. This nationality represents the special moment of spiritual force necessary to secure the new step the race is required to take. While in the lower plane of history the nations themselves do these things; in the higher sphere it is their angels who are the actors. A nation has in it much of the characteristics of a living organism, and the angel of the nation is the life of that organism. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "As",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a finite being, the angel of any nation of necessity is imperfect; his  knowledge of the Divine plan only limited. His instrument - the nation committed to his charge - is yet more imperfect. Let an imperfect being, however holy, have a piece of work to do, that work must assume, to him, an exaggerated importance; let him be associated as patron with sentient beings, and his affections must go forth to these beings in a special way. He will resist any attempt to limit in any way the function of that race which is specially his, and will be apt to interpret too widely this function, and be loth to recognize that its time is past, or this or that region is beyond its province. If we regard Gabriel as an angel - not of Egypt, as Hitzig, but of the kingdom of heaven, and by this the angel of prophecy (Ewald) - then he must exercise a watchful care over the actions of each nationality, and therefore of its angel, lest the ultimate purpose of God be in any way hindered. The angel of Persia might regard the national semi-independence allowed to the Jews as hindering the evolution of the idea exhibited by the Persian race. The Persian rule allowed races a good deal of licence if tribute were paid. It was required to specialize its treatment of the Jews; to convey them back from Babylon to Palestine; to protect them in Palestine; to assist them to set up a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "quasi-independence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All this was contrary to the negative character of the Persian rule, in contradiction to its spirit, and therefore opposed by its angel, who represented this spirit. Michael, the special angel of the Jews, naturally came to assist Gabriel. What a conflict between angelic spirits may mean, what may be the weapons of their warfare, we know not; we do know that, though not carnal, they are mighty. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And when I am gone forth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " To this phrase several meanings have been attached. Havernick, Maurer, and Ewald take it as meaning \"going forth to war.\" Ewald renders, \"I will return to contend against the Prince of Persia; so, while I am going forth, the Prince of Javan will come.\" In this connection it is very doubtful whether ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יָצָא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "yatza",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") can mean \"going forth to battle.\" Motion to the field of battle is indicated by \"return.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Yatza",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " simply means to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "go from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a given place; the purpose may be indicated by some other word. Another view is that of Hitzig, Hofmann, and Bertheau, \"to go out,\" not to, but from \"a conflict.\" This meaning is possible; it would certainly need some determinant to fix this meaning on it, but this may be supplied from the preceding clause. This view, though suiting admirably with the otherwise untenable supposition that the \"prince\" speaking with Daniel is the angel of Egypt, does not suit with the view that Gabriel, the \"prince\" talking with Daniel, is the angel of prophecy, and therefore of the ideal kingdom. Keil would take the first meaning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "yatza",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and would paraphrase thus, \"Now shall I return to resume and continue the war with the Prince of Persia; but while I thus go forth to war - while I continue the conflict, the prince of Javan shall come, and then there shall be a new conflict.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Yatza",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " never does mean \"to continue a conflict;\" it means to begin either a war, a battle, or a campaign. A great deal of the difficulty is due to maintaining that angels are under the time-relation of human beings. The matter is clearer if we take it as meaning simply that when Gabriel went out from the presence of Daniel, the \"Prince of Grecia\" would come. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Lo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the Prince of Grecia shall come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This does not refer to Alexander the Great, or the overthrow of the Persian Empire, still less to the Seleucids and their persecutions. Before his Babylonian reign, Cyrus encountered the Greeks, and roused their opposition. The angel, then, of the Greek nation began to stir up his people. Then came the Ionian revolt, and the successive invasions of Greece, which compelled the Persians to leave the \"holy people\" alone. The angelic Prince of Grecia appears first as an instrument of the angel of prophecy, to limit the power of Persia. When, after prolonged conflicts, the empire of Persia gives place to that of Greece, the conflict of the people of God must be renewed in a fiercer form. Daniel 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But before he communicated to Daniel what would befall his people in the \"latter days\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he gives to him yet further disclosures regarding the proceedings in the spirit-kingdom which determine the fate of nations, and contain for Israel, in the times of persecution awaiting them, the comforting certainty that they had in the Angel of the Lord and in the guardian angel Michael a strong protection against the enmities of the heathen world. Kliefoth supposes that the angel who speaks in v. 20 - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gives a brief resum of the contents of his previous statement (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But it is not so. These verses, 10:20-11:1, contain new disclosures not yet made known in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:12-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although resembling the contents of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of the coming of the prince of Javan (v. 20b), and the help which the angel-prince renders to Darius (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), nothing is said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; also what the Angel of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", says regarding the conflict with the prince of Persia is different from that which is said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he speaks of that which he has done before his coming to Daniel; in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of that which he will now do. To the question, \"Knowest thou wherefore I come unto thee?\" no answer follows; it has, however, an affirmative sense, and is only an animated mode of address to remind Daniel of that which is said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to impress it upon him as weighty and worthy of consideration. Then follows the new communication: \"and now will I return to fight with the prince of Persia,\" i.e., to carry forward and bring to an end the victory gained for thee before my arrival over the demon of Persia, the spirit of the Persian kingdom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The words which follow, 'וגו והנּה יוצא ואני (v. 20b, and when I am gone forth, lo, etc.), present some difficulty. The ואני in comparison with אשׁוּב (will I return) points to a contrast, and והנּה plainly indicates that which shall begin with the יוצא אני. By this, the union of the יוצא ואני with that which goes before and the adversative interpretation of והנּה (v. Leng.) is excluded. But יוצא is interpreted differently. Hvernick, Maurer, and others understand it of going forth to war; only we must not then think (with Maurer) of the war against the prince of Persia. \"For he will do that even now (in the third year of Cyrus), and at this time the coming of the prince of Grecia has no meaning\" (Hitzig). Hofmann and Hitzig understand, therefore, יוצא, in contrast to בּא, of a going forth from the conflict, as in 2 Kings 11:7 \"they shall go forth on the Sabbath\" is placed over against \"that enter in on the Sabbath\" in 2 Kings 11:5; but in an entirely different sense. Hitzig thus renders the clause: \"when I have done with the Persians, and am on the point of departing, then shall the king of Grecia rise up against me.\" יון must then be the Seleucidan kingdom, and the שׂר the guardian spirit of Egypt - suppositions which need no refutation, while the interpretation of the words themselves fails by the arbitrary interpolation \"against me\" after בּא. According to Hofmann, the angel says that \"he had to return and contend further with the prince of the people of Persia; and that when he has retired from this conflict, then shall the prince of the Grecian people come, compelling him to enter on a new war.\" This last clause Hofmann thus more fully illustrates: \"Into the conflict with the prince of the people of Persia, which the angel retires from, the prince of the Grecian people enters, and against him he resumes it after that the Persian kingdom has fallen, and is then also helped by Michael, the prince of the Jewish people, in this war against the prince of Grecia, as he had been in the war against the prince of Persia\" (Schriftbew. i. pp. 333, 334f.). But Hitzig and Kliefoth have, in opposition to this, referred to the incongruity which lies in the thought that the prince of Javan shall enter into the war of the angel against the Persians, and assume and carry it forward. The angel fights against the demon of Persia, not to destroy the Persians, but to influence the Persian king in favour of the people of God; on the contrary, the prince of Javan comes to destroy the Persian king. According to this, we cannot say that the prince of Javan enters into the place of the angel in the war. \"The Grecians and the Persians much rather stand,\" as Hitzig rightly remarks, \"on one side, and are adversaries of Michael and our שׂר,\" i.e., of the angel who spake to Daniel. Add to this, that although יצא, to go out, means also to go away, to go off, yet the meaning to go away from the conflict, to abandon it, is not confirmed: much rather יצא, sensu militari, always denotes only \"to go out, forth, into the conflict;\" cf. 1 Samuel 8:20; 1 Samuel 23:15; 1 Chronicles 20:1; Job 39:21, etc. We have to take the word in this signification here (with C. B. Michaelis, Klief., and Kran.), only we must not, with Kranichfeld, supply the clause, \"to another more extensive conflict,\" because this supplement is arbitrary, but rather, with Kliefoth, interpret the word generally as it stands of the going out of the angel to fight for the people of God, without excluding the war with the prince of Persia, or limiting it to this war. Thus the following will be the meaning of the passage: Now shall I return to resume and continue the war with the prince of Persia, to maintain the position gained (Daniel 10:13) beside the kings of Persia; but when (while) I thus go forth to war, i.e., while I carry on this conflict, lo, the prince of Javan shall come (הנּה with the partic. בּא of the future) - then shall there be a new conflict. This last thought is not, it is true, expressly uttered, but it appears from Daniel 10:21. The warring with the prince, i.e., the spirit of Persia hostile to Israel, refers to the oppositions which the Jews would encounter in the hindrances put in the way of their building the temple from the time of Cyrus to the time of Darius Hystaspes, and further under Xerxes and Artaxerxes till the rebuilding of the walls of Jerusalem by Nehemiah, as well as at a later time on the side of the Persian world-power, in the midst of all which difficulties the Angel of the Lord promises to guide the affairs of His people. יון שׂר is the spirit of the Macedonian world-kingdom, which would arise and show as great hostility as did the spirit of Persia against the people of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The words which follow, 'וגו והנּה יוצא ואני (v. 20b, and when I am gone forth, lo, etc.), present some difficulty. The ואני in comparison with אשׁוּב (will I return) points to a contrast, and והנּה plainly indicates that which shall begin with the יוצא אני. By this, the union of the יוצא ואני with that which goes before and the adversative interpretation of והנּה (v. Leng.) is excluded. But יוצא is interpreted differently. Hvernick, Maurer, and others understand it of going forth to war; only we must not then think (with Maurer) of the war against the prince of Persia. \"For he will do that even now (in the third year of Cyrus), and at this time the coming of the prince of Grecia has no meaning\" (Hitzig). Hofmann and Hitzig understand, therefore, יוצא, in contrast to בּא, of a going forth from the conflict, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"they shall go forth on the Sabbath\" is placed over against \"that enter in on the Sabbath\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but in an entirely different sense. Hitzig thus renders the clause: \"when I have done with the Persians, and am on the point of departing, then shall the king of Grecia rise up against me.\" יון must then be the Seleucidan kingdom, and the שׂר the guardian spirit of Egypt - suppositions which need no refutation, while the interpretation of the words themselves fails by the arbitrary interpolation \"against me\" after בּא. According to Hofmann, the angel says that \"he had to return and contend further with the prince of the people of Persia; and that when he has retired from this conflict, then shall the prince of the Grecian people come, compelling him to enter on a new war.\" This last clause Hofmann thus more fully illustrates: \"Into the conflict with the prince of the people of Persia, which the angel retires from, the prince of the Grecian people enters, and against him he resumes it after that the Persian kingdom has fallen, and is then also helped by Michael, the prince of the Jewish people, in this war against the prince of Grecia, as he had been in the war against the prince of Persia\" (Schriftbew. i. pp. 333, 334f.). But Hitzig and Kliefoth have, in opposition to this, referred to the incongruity which lies in the thought that the prince of Javan shall enter into the war of the angel against the Persians, and assume and carry it forward. The angel fights against the demon of Persia, not to destroy the Persians, but to influence the Persian king in favour of the people of God; on the contrary, the prince of Javan comes to destroy the Persian king. According to this, we cannot say that the prince of Javan enters into the place of the angel in the war. \"The Grecians and the Persians much rather stand,\" as Hitzig rightly remarks, \"on one side, and are adversaries of Michael and our שׂר,\" i.e., of the angel who spake to Daniel. Add to this, that although יצא, to go out, means also to go away, to go off, yet the meaning to go away from the conflict, to abandon it, is not confirmed: much rather יצא, sensu militari, always denotes only \"to go out, forth, into the conflict;\" cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 8:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 20:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. We have to take the word in this signification here (with C. B. Michaelis, Klief., and Kran.), only we must not, with Kranichfeld, supply the clause, \"to another more extensive conflict,\" because this supplement is arbitrary, but rather, with Kliefoth, interpret the word generally as it stands of the going out of the angel to fight for the people of God, without excluding the war with the prince of Persia, or limiting it to this war. Thus the following will be the meaning of the passage: Now shall I return to resume and continue the war with the prince of Persia, to maintain the position gained (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") beside the kings of Persia; but when (while) I thus go forth to war, i.e., while I carry on this conflict, lo, the prince of Javan shall come (הנּה with the partic. בּא of the future) - then shall there be a new conflict. This last thought is not, it is true, expressly uttered, but it appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The warring with the prince, i.e., the spirit of Persia hostile to Israel, refers to the oppositions which the Jews would encounter in the hindrances put in the way of their building the temple from the time of Cyrus to the time of Darius Hystaspes, and further under Xerxes and Artaxerxes till the rebuilding of the walls of Jerusalem by Nehemiah, as well as at a later time on the side of the Persian world-power, in the midst of all which difficulties the Angel of the Lord promises to guide the affairs of His people. יון שׂר is the spirit of the Macedonian world-kingdom, which would arise and show as great hostility as did the spirit of Persia against the people of God. ",
            "children": []
          }
        ]
      }
    ]
  }
]