[{"header":"Abram and Lot Separate"},{"num":13,"verse":"Abram went north out of Egypt to the southern part of Canaan with his wife and everything he owned, and Lot went with him. "},{"num":2,"verse":"Abram was a very rich man, with sheep, goats, and cattle, as well as silver and gold. "},{"num":3,"verse":"Then he left there and moved from place to place, going toward Bethel. He reached the place between Bethel and Ai where he had camped before "},{"num":4,"verse":"and had built an altar. There he worshiped the Lord."},{"num":5,"verse":"Lot also had sheep, goats, and cattle, as well as his own family and servants. "},{"num":6,"verse":"And so there was not enough pasture land for the two of them to stay together, because they had too many animals. "},{"num":7,"verse":"So quarrels broke out between the men who took care of Abram's animals and those who took care of Lot's animals. (At that time the Canaanites and the Perizzites were still living in the land.)"},{"num":8,"verse":"Then Abram said to Lot, “We are relatives, and your men and my men shouldn't be quarreling. "},{"num":9,"verse":"So let's separate. Choose any part of the land you want. You go one way, and I'll go the other.”"},{"num":10,"verse":"Lot looked around and saw that the whole Jordan Valley, all the way to Zoar, had plenty of water, like the Garden of the Lord or like the land of Egypt. (This was before the Lord had destroyed the cities of Sodom and Gomorrah.) "},{"num":11,"verse":"So Lot chose the whole Jordan Valley for himself and moved away toward the east. That is how the two men parted. "},{"num":12,"verse":"Abram stayed in the land of Canaan, and Lot settled among the cities in the valley and camped near Sodom, "},{"num":13,"verse":"whose people were wicked and sinned against the Lord."},{"header":"Abram Moves to Hebron"},{"num":14,"verse":"After Lot had left, the Lord said to Abram, “From where you are, look carefully in all directions. "},{"num":15,"verse":"I am going to give you and your descendants all the land that you see, and it will be yours forever. "},{"num":16,"verse":"I am going to give you so many descendants that no one will be able to count them all; it would be as easy to count all the specks of dust on earth! "},{"num":17,"verse":"Now, go and look over the whole land, because I am going to give it all to you.” "},{"num":18,"verse":"So Abram moved his camp and settled near the sacred trees of Mamre at Hebron, and there he built an altar to the Lord."}]