[{"header":"Abram and Lot Part Ways"},{"num":13,"verse":"Abram traveled from Egypt, along with his wife and everyone who belonged to his household—including Lot—to the Negev."},{"num":2,"verse":"Now Abram had become quite wealthy in livestock, silver, and gold. "},{"num":3,"verse":"He journeyed by stages from the Negev to Bethel, the place where his tent had formerly been, between Bethel and Ai, "},{"num":4,"verse":"where he had first built an altar. There Abram called on the name of the Lord."},{"num":5,"verse":"Lot, who was traveling with Abram, also had flocks of sheep, herds, and tents. "},{"num":6,"verse":"But the land could not support them living together, because they had so many livestock that they could not stay together. "},{"num":7,"verse":"There was strife between the herdsmen in charge of Abram’s livestock and the herdsmen in charge of Lot’s livestock. Also, at that time the Canaanites and the Perizzites were living in the land."},{"num":8,"verse":"So Abram told Lot, “Please, let’s not have strife between you and me, or between your herdsmen and my herdsmen, since we are relatives. "},{"num":9,"verse":"Isn’t the whole land available to you? Let’s separate: If you go to the left, then I will go to the right; if you go to the right, then I will go to the left.”"},{"num":10,"verse":"Lot looked around and noticed that the whole Jordan plain as far as Zoar was well-watered like the garden of the Lord or like the land of Egypt. (This was before the Lord destroyed Sodom and Gomorrah.) "},{"num":11,"verse":"So Lot chose for himself all the Jordan plain. Then Lot traveled eastward, and they separated from each other."},{"num":12,"verse":"So Abram lived in the land of Canaan, while Lot settled in the cities of the plain, setting up his tent in the vicinity of Sodom. "},{"num":13,"verse":"Now the men of Sodom were particularly evil and sinful in their defiance of the Lord."},{"num":14,"verse":"After Lot had separated from Abram, the Lord told Abram, “Look off to the north, south, east, and west from where you’re living, "},{"num":15,"verse":"because I’m going to give you and your descendants all of the land that you see—forever! "},{"num":16,"verse":"I’ll make your descendants as plentiful as the specks of dust of the earth, so that if one could count the specks of dust of the earth, then your descendants could also be counted. "},{"num":17,"verse":"Get up! Walk throughout the length and breadth of the land, because I’m going to give it to you.”"},{"num":18,"verse":"So Abram moved his tent and settled beside the oaks of Mamre that are by Hebron, where he built an altar to the Lord."}]