[{"header":"Chapter 13"},{"num":1,"verse":"Growth in Faith. From Egypt Abram traveled to the Negeb along with his wife and all his belongings. Lot was with him."},{"num":2,"verse":"Abram was very rich, having many animals, silver, and gold."},{"num":3,"verse":"He then gradually made his way from the Negeb to Bethel, up to the place where he had previously encamped between Bethel and Ai."},{"num":4,"verse":"This was the place where he had built an altar and called upon the name of the Lord."},{"num":5,"verse":"Lot, who traveled with Abram, also had many flocks and herds and tents."},{"num":6,"verse":"The area where they were was not rich enough for them to dwell together, for they had too many possessions for them to live in the same camp."},{"num":7,"verse":"Because of this a quarrel arose between the herdsmen of Abram and those of Lot. (At that time the Canaanites and the Perizzites lived in that land.)"},{"num":8,"verse":"Abram said to Lot, “Let us not have strife between you and me, between my herdsmen and yours, for we are relatives."},{"num":9,"verse":"Does not the entire land lie before you? You should separate from me. If you wish to go to the left, I will go to the right; if you wish to go to the right, I will go to the left.”"},{"num":10,"verse":"Lot looked around and saw that the Jordan Valley was fertile and there was water everywhere. (This was before the Lord destroyed Sodom and Gomorrah.) It was as beautiful as the garden of the Lord, like the land of Egypt, all the way down to Zoar."},{"num":11,"verse":"So Lot chose the Jordan Valley for himself, and he moved his tents to the east. Thus, they separated from each other."},{"num":12,"verse":"Abram dwelt in the land of Canaan and Lot dwelt in the cities of the valley and pitched his tents near Sodom."},{"num":13,"verse":"The inhabitants of Sodom were perverse and committed many sins against the Lord."},{"num":14,"verse":"The Lord spoke to Abram after Lot had separated from him saying, “Lift up your eyes from where you are and look around to the north and south, to the east and the west."},{"num":15,"verse":"Everything that you see I will give to you and your descendants forever."},{"num":16,"verse":"I will make your descendants like the dust of the earth. If one could count all of the dust of the earth, then that person would be able to count all your descendants."},{"num":17,"verse":"Rise and travel throughout the land, for I will give it to you.”"},{"num":18,"verse":"Abram moved his camp and dwelt near the Oak of Mamre at Hebron. He built an altar to the Lord there."}]