[{"num":1,"verse":"So they left Egypt and traveled north into the Negeb—Abram with his wife, and Lot, and all that they owned, for Abram was very rich in livestock, silver, and gold. "},{"num":3,"verse":"Then they continued northward toward Bethel where he had camped before, between Bethel and Ai—to the place where he had built the altar. And there he again worshiped the Lord."},{"num":5,"verse":"Lot too was very wealthy, with sheep and cattle and many servants. "},{"num":6,"verse":"But the land could not support both Abram and Lot with all their flocks and herds. There were too many animals for the available pasture. "},{"num":7,"verse":"So fights broke out between the herdsmen of Abram and Lot, despite the danger they all faced from the tribes of Canaanites and Perizzites present in the land. "},{"num":8,"verse":"Then Abram talked it over with Lot. “This fighting between our men has got to stop,” he said. “We can’t afford to let a rift develop between our clans. Close relatives such as we are must present a united front! "},{"num":9,"verse":"I’ll tell you what we’ll do. Take your choice of any section of the land you want, and we will separate. If you want that part over there to the east, then I’ll stay here in the western section. Or, if you want the west, then I’ll go over there to the east.”"},{"num":10,"verse":"Lot took a long look at the fertile plains of the Jordan River, well watered everywhere (this was before Jehovah destroyed Sodom and Gomorrah); the whole section was like the Garden of Eden, or like the beautiful countryside around Zoar in Egypt. "},{"num":11,"verse":"So that is what Lot chose—the Jordan Valley to the east of them. He went there with his flocks and servants, and thus he and Abram parted company. "},{"num":12,"verse":"For Abram stayed in the land of Canaan, while Lot lived among the cities of the plain, settling at a place near the city of Sodom. "},{"num":13,"verse":"The men of this area were unusually wicked, and sinned greatly against Jehovah."},{"num":14,"verse":"After Lot was gone, the Lord said to Abram, “Look as far as you can see in every direction, "},{"num":15,"verse":"for I am going to give it all to you and your descendants. "},{"num":16,"verse":"And I am going to give you so many descendants that, like dust, they can’t be counted! "},{"num":17,"verse":"Hike in all directions and explore the new possessions I am giving you.” "},{"num":18,"verse":"Then Abram moved his tent to the oaks of Mamre, near Hebron, and built an altar to Jehovah there."}]