[{"num":13,"verse":"Therefore Abram ascended from Egypt (And so Abram went up from Egypt), he, and his wife, and all things that he had; and Lot went with him, to the south coast."},{"num":2,"verse":"Forsooth he was full rich in possession(s) of silver, and of gold. (And now he was very rich with livestock, silver, and gold.)"},{"num":3,"verse":"And he turned again by the way in which he came from the south into Bethel, till to the place, in which before he had set a tabernacle (to the place where he had pitched his tent before), betwixt Bethel and Hai,"},{"num":4,"verse":"in the place of the altar which he made before, and inwardly called there the name of the Lord. (at the place where he had made the altar before, and had inwardly called on the Lord’s name.)"},{"num":5,"verse":"But also flocks of sheep, and droves of oxen, and tabernacles were to Lot, that was with Abram; (And Lot, who was with Abram, also had flocks of sheep, and herds of oxen, and tents;)"},{"num":6,"verse":"and the land might not take them, that they should dwell together, for the cattle of them was much, and they might not dwell in common. (and the land could not support both of them, for each of them had many livestock, and so they could not live there together.)"},{"num":7,"verse":"Wherefore also strife was made betwixt the keepers of [the] flocks of Abram and of Lot. Forsooth Canaanites and Perizzites (also) dwelled in that land in that time."},{"num":8,"verse":"Therefore Abram said to Lot, I beseech thee, that no strife be betwixt me and thee, and betwixt my shepherds and thy shepherds; for we be brethren (for we be kinsmen)."},{"num":9,"verse":"Lo! all the land is before thee, I beseech, depart thou from me; if thou go to the left side, I shall hold the right side; if thou choose the right side, I shall go to the left side."},{"num":10,"verse":"And so Lot raised [up] his eyes, and saw about all the country of Jordan, which was all-moisted, before that the Lord destroyed Sodom and Gomorrah, as (the) paradise of the Lord, and as Egypt, as men come into Zoar. (And so Lot raised up his eyes, and saw the Jordan Valley all about, and that it was well-watered, and that all the way to Zoar it was like the Garden of the Lord, that is, like the Garden of Eden, and like Egypt, for this was before the Lord destroyed Sodom and Gomorrah.)"},{"num":11,"verse":"And Lot chose to him the country about Jordan, and departed from the east; and they were parted each from his brother. (And Lot chose for himself all the Jordan Valley, and left for the east; and so they parted from each other, yea, each from his kinsman.)"},{"num":12,"verse":"(And) Abram dwelled in the land of Canaan; soothly Lot dwelled in [the] towns about Jordan, and abode in Sodom (and lived near Sodom)."},{"num":13,"verse":"Forsooth (the) men of Sodom were full wicked, and sinners greatly before the Lord (and greatly sinned against the Lord)."},{"num":14,"verse":"And the Lord said to Abram, after that Lot was parted from him (And after that Lot had left, the Lord said to Abram), Raise [up] thine eyes forthright, and see from the place in which thou art now, to the north and south, (and) to the east and west;"},{"num":15,"verse":"I shall give all the land which thou seest to thee, and to thy seed (and to thy descendants), till into without end."},{"num":16,"verse":"And I shall make thy seed as the dust of the earth; if any man may number the dust of the earth, also he shall be able to number thy seed (and only if anyone can count all the dust on the earth, then shall they be able to count all thy descendants)."},{"num":17,"verse":"Therefore rise thou, and pass through the land in his length and breadth, for I shall give it to thee. (And so rise thou up, and go through the land in its length and breadth, for I shall give it all to thee.)"},{"num":18,"verse":"Therefore Abram, moving his tabernacle, came and dwelled beside the valley of Mamre, which is in Hebron; and he builded there an altar to the Lord. (And so Abram, moving his tent, came and lived beside the terebinths of Mamre, which be at Hebron; and he built there an altar to the Lord.)"}]