[{"header":"Restoring the temple"},{"num":13,"verse":"On that day, when the scroll from Moses was being read to the people, they found written in it that no Ammonite or Moabite should ever enter God’s assembly."},{"num":2,"verse":"This is because they hadn’t met the Israelites with food and water but instead hired Balaam against them to curse them. Yet our God turned the curse into a blessing."},{"num":3,"verse":"When the people heard this law, they separated out from Israel all those of mixed descent."},{"num":4,"verse":"Now before this, however, Eliashib the priest, who was appointed to be in charge of the storerooms of our God’s house and who was related to Tobiah,"},{"num":5,"verse":"prepared a large room for Tobiah to use. This was the room where they had previously kept the grain offering, the incense, and the equipment, together with the tenth-part gifts of grain, wine, and oil. These items were for the Levites, singers, and gatekeepers as well as the portions for the priests."},{"num":6,"verse":"I wasn’t in Jerusalem while this was happening because I had gone to Babylon’s King Artaxerxes in the thirty-second year of the king. After some time, I asked the king’s permission"},{"num":7,"verse":"and returned to Jerusalem. That was when I saw the wrong that Eliashib had done on behalf of Tobiah by preparing him a room in the courtyards of God’s house."},{"num":8,"verse":"I was very angry and threw all of Tobiah’s household furniture out of the room."},{"num":9,"verse":"Then I gave orders that the rooms be purified, and I put back the temple equipment, along with the grain offering and the incense."},{"num":10,"verse":"I also found out that the Levites hadn’t been given their portions, so they and the singers who did the work had gone back to their fields."},{"num":11,"verse":"So I scolded the officials, asking, “Why is God’s house being neglected?” I gathered them together and set them in their stations."},{"num":12,"verse":"Then all Judah brought the tenth-part gifts of the grain, wine, and oil into the storehouses."},{"num":13,"verse":"I appointed the priest Shelemiah, the scribe Zadok, and Pedaiah of the Levites to be in charge over the storehouses. I also appointed Hanan, Zaccur’s son and Mattaniah’s grandson, as their assistant. These men were considered trustworthy, and their task was to hand out shares to their colleagues."},{"num":14,"verse":"Remember me, my God, concerning this. Don’t erase my good deeds that I have done for my God’s house and for its services."},{"header":"Keeping the Sabbath"},{"num":15,"verse":"In those days I saw people in Judah using the winepresses on the Sabbath. They were also collecting piles of grain and loading them on donkeys, as well as wine, grapes, figs, and every kind of load, and then bringing them to Jerusalem on the Sabbath. I warned them at that time against selling food."},{"num":16,"verse":"In addition, people from Tyre who lived in the city were bringing in fish and all kinds of merchandise and selling them to the people of Judah on the Sabbath. This happened in Jerusalem itself!"},{"num":17,"verse":"So I scolded the officials of Judah: “What is this evil thing that you are doing?” I asked. “You are making the Sabbath impure!"},{"num":18,"verse":"This is just what your ancestors did, and God brought all this evil upon us and upon this city. And now you are bringing more wrath upon Israel by making the Sabbath impure!”"},{"num":19,"verse":"So when it began to grow dark at the gates of Jerusalem before the Sabbath, I gave orders that the doors should be shut. I also ordered that they shouldn’t be reopened until after the Sabbath. To make sure that no load would come into the city on the Sabbath, I stationed some of my own men at the gates."},{"num":20,"verse":"Once or twice the traders and sellers of all kinds of merchandise spent the night outside Jerusalem."},{"num":21,"verse":"But I warned them: “Why are you spending the night by the wall? If you do that again, I will lay hands on you!” At that point, they stopped coming on the Sabbath."},{"num":22,"verse":"I also commanded the Levites to purify themselves and to come and guard the gates in order to keep the Sabbath day holy."},{"header":"Marrying foreign women"},{"num":23,"verse":"Also in those days I saw Jews who had married women of Ashdod, Ammon, and Moab."},{"num":24,"verse":"Half of their children spoke the language of Ashdod or the language of various peoples; they couldn’t speak the language of Judah."},{"num":25,"verse":"So I scolded them and cursed them, and beat some of them, and pulled out their hair. I also made them swear a solemn pledge in the name of God, saying, “You won’t give your daughters to their sons in marriage, or take their daughters in marriage for your sons or yourselves."},{"num":26,"verse":"Didn’t Israel’s King Solomon sin on account of such women? Among the many nations there was no king like him. He was well loved by his God, and God made him king over all Israel. Yet foreign wives led even him into sin!"},{"num":27,"verse":"Should we then listen to you and do all this great evil, acting unfaithfully toward our God by marrying foreign women?”"},{"num":28,"verse":"Now one of the sons of Joiada son of the high priest Eliashib was a son-in-law of Sanballat the Horonite. So I chased him away from me."},{"num":29,"verse":"Remember them, my God, because they have defiled the priesthood and the covenant of the priests and the Levites!"},{"num":30,"verse":"So I purified them of everything foreign and established the services of the priests and Levites with specific duties for each person."},{"num":31,"verse":"I also provided for the wood offering at appointed times as well as for the early produce."}]