[{"header":"Enemies of Israel Excluded(A)"},{"num":13,"verse":"Later that day the book of Moses was read aloud so the people could hear it, and a written command was discovered therein permanently prohibiting the Ammonites and Moabites from coming into the congregation of God "},{"num":2,"verse":"because they did not greet the Israelis with food and water, but instead hired Balaam to oppose them by cursing them, even though our God turned the curse into a blessing. "},{"num":3,"verse":"When they heard the Law, they separated all those of foreign descent from Israel."},{"header":"Tobiah Evicted from the Temple"},{"num":4,"verse":"Now prior to this, Eliashib the priest, who supervised the store rooms of the Temple of our God and who was related to Tobiah, "},{"num":5,"verse":"had prepared a great chamber for him, in the place where they used to place the grain offerings, incense, and vessels, along with the tithes of the grain, the new wine, and the oil that was mandated for the descendants of Levi, the singers, the gate keepers, and the priests’ offerings. "},{"num":6,"verse":"During all of this time, I was not in Jerusalem, because I had returned to the king in the thirty-second year of Artaxerxes, king of Babylon. After a while I obtained permission from the king "},{"num":7,"verse":"to return to Jerusalem. I learned of the evil thing that Eliashib had done for Tobiah in furnishing him with a room in the courts of the Temple of God. "},{"num":8,"verse":"I was greatly upset, so I threw out all of Tobiah’s property from the room. "},{"num":9,"verse":"I ordered them to purify the chambers, and then they brought back the vessels from the Temple of God, along with the grain offerings and incense."},{"header":"Neglecting Levitical Allotments"},{"num":10,"verse":"I also learned that the allotments for the descendants of Levi had not been distributed. As a result, the descendants of Levi and singers who were responsible for the service had each left to go back to their fields. "},{"num":11,"verse":"So I confronted the officials and asked, “Why is the Temple of God neglected?” Then I gathered them together and put them back in their places. "},{"num":12,"verse":"Then all of Judah brought the tithe of the grain, the new wine, and the oil into the storerooms. "},{"num":13,"verse":"I appointed over the storerooms: Shelemiah the priest, Zadok the scribe, and Pedaiah from the descendants of Levi; and next to them Zaccur’s son Hanan, the grandson of Mattaniah, because they had been considered faithful. Their duties were to distribute to their associates."},{"num":14,"verse":"Remember me, my God, concerning this, and do not erase my faithful deeds that I have undertaken for the Temple of my God, and for its services."},{"header":"Prohibiting Work on the Sabbath"},{"num":15,"verse":"At that time I saw in Judah some who were treading wine presses on the Sabbath, bringing in sacks of grain, loading them onto donkeys, along with wine, grapes, figs, and all kinds of loads. They brought them into Jerusalem on the Sabbath day. So I rebuked them on the day on which they were selling food. "},{"num":16,"verse":"Furthermore, Tyrians were living there who were importing fish and all kinds of merchandise, selling them to the people of Judah on the Sabbath, even in Jerusalem."},{"num":17,"verse":"I rebuked the officials of Judah, saying to them, “What’s this evil thing that you’re doing by profaning the Sabbath day? "},{"num":18,"verse":"Didn’t your ancestors do the same? And didn’t our God bring on us and on this city all of this trouble? Now you’re adding to the wrath against Israel by profaning the Sabbath!”"},{"num":19,"verse":"As the Sabbath approached and it began to get dark at the gates of Jerusalem, I gave word to shut the gates, charging that they should not be opened until after the Sabbath. I stationed some of my men at the gates to ensure that no loads would be brought in on the Sabbath day. "},{"num":20,"verse":"As a result, the merchants and sellers of all sorts of goods remained outside Jerusalem a couple of times. "},{"num":21,"verse":"I argued with them, “Why are you staying outside the wall? If you do this again, I’ll arrest you.” From that time on, they didn’t come anymore on the Sabbath. "},{"num":22,"verse":"Then I commanded the descendants of Levi to purify themselves and to come as gate keepers to sanctify the Sabbath day."},{"header":"Removing Foreign Spouses(B)"},{"num":23,"verse":"At that time I also noticed that Jews had married women from Ashdod, Ammon, and Moab. "},{"num":24,"verse":"Furthermore, their children spoke half of the time in the language of Ashdod, and could not speak in the language of Judah. Instead, they spoke in the languages of various peoples. "},{"num":25,"verse":"So I rebuked them, cursed them, struck some of their men, tore out their hair, and made them take this oath in the name of God: “You are not to give your daughters to their sons nor take their daughters for your sons or for yourselves. "},{"num":26,"verse":"Didn’t Solomon, king of Israel, sin by doing these things, even though among many nations there was no king like him who was loved by his God, and God made him king over all Israel? Even so, foreign women caused him to sin. "},{"num":27,"verse":"Should we listen to you and do all of this terrible evil by transgressing against our God to marry foreign wives?” "},{"num":28,"verse":"One of the sons of Eliashib the high priest’s son Joiada was a son-in-law to Sanballat the Horonite, so I drove him away from me."},{"num":29,"verse":"Remember them, my God, because they have defiled the priesthood and the covenant of the priesthood and the descendants of Levi."},{"num":30,"verse":"I purified them from everything foreign, arranged duties for the priests and the descendants of Levi, each to his task, "},{"num":31,"verse":"and I arranged at the appointed time for the supply of wood, and for the first fruits."}]