[{"header":"Paul Contrasts Himself with False Apostles"},{"num":11,"verse":"I want you to put up with a little foolishness from me. I’m sure that you will. "},{"num":2,"verse":"I’m as protective of you as God is. After all, you’re a virgin whom I promised in marriage to one man—Christ. "},{"num":3,"verse":"However, I’m afraid that as the snake deceived Eve by its tricks, so your minds may somehow be lured away from your sincere and pure devotion to Christ. "},{"num":4,"verse":"When someone comes to you telling about another Yeshua whom we didn’t tell you about, you’re willing to put up with it. When you receive a spirit that is different from the Spirit you received earlier, you’re also willing to put up with that. When someone tells you good news that is different from the Good News you already accepted, you’re willing to put up with that too."},{"num":5,"verse":"I don’t think I’m inferior in any way to your super-apostles. "},{"num":6,"verse":"Even though I’m not good with words, I know what I’m talking about. Timothy and I have made this clear to you in every possible way."},{"num":7,"verse":"Did I commit a sin when I humbled myself by telling you the Good News of God free of charge so that you could become important? "},{"num":8,"verse":"I robbed other churches by taking pay from them to serve you. "},{"num":9,"verse":"When I was with you and needed something, I didn’t bother any of you for help. My friends from the province of Macedonia supplied everything I needed. I kept myself from being a financial burden to you in any way, and I will continue to do that."},{"num":10,"verse":"As surely as I have Christ’s truth, my bragging will not be silenced anywhere in Greece. "},{"num":11,"verse":"Why? Because I don’t love you? God knows that I do love you. "},{"num":12,"verse":"But I’ll go on doing what I’m doing. This will take away the opportunity of those people who want to brag because they think they’re like us. "},{"num":13,"verse":"People who brag like this are false apostles. They are dishonest workers, since they disguise themselves as Christ’s apostles. "},{"num":14,"verse":"And no wonder, even Satan disguises himself as an angel of light. "},{"num":15,"verse":"So it’s not surprising if his servants also disguise themselves as servants who have God’s approval. In the end they will get what they deserve."},{"header":"More Reasons for Paul to Brag"},{"num":16,"verse":"Again I say that no one should think that I’m a fool. But if you do, then take me for a fool so that I can also brag a little. "},{"num":17,"verse":"What I say as I start bragging is foolishness. It’s not something I would say if I were speaking for the Lord. "},{"num":18,"verse":"Since it’s common for people to brag, I’ll do it too. "},{"num":19,"verse":"You’re wise, so you’ll gladly put up with fools. "},{"num":20,"verse":"When someone makes you slaves, consumes your wealth, seizes your property, orders you around, or slaps your faces, you put up with it. "},{"num":21,"verse":"I’m ashamed to admit it, but Timothy and I don’t have the strength to do those things to you."},{"num":22,"verse":"Are they Hebrews? So am I. Are they Israelites? So am I. Are they Abraham’s descendants? So am I. "},{"num":23,"verse":"Are they Christ’s servants? It’s insane to say it, but I’m a far better one. I’ve done much more work, been in prison many more times, been beaten more severely, and have faced death more often. "},{"num":24,"verse":"Five times the Jewish leaders had me beaten with 39 lashes; "},{"num":25,"verse":"three times Roman officials had me beaten with clubs. Once people tried to stone me to death; three times I was shipwrecked, and I drifted on the sea for a night and a day. "},{"num":26,"verse":"Because I’ve traveled a lot, I’ve faced dangers from raging rivers, from robbers, from my own people, and from other people. I’ve faced dangers in the city, in the open country, on the sea, and from believers who turned out to be false friends. "},{"num":27,"verse":"Because I’ve had to work so hard, I’ve often gone without sleep, been hungry and thirsty, and gone without food and without proper clothes during cold weather. "},{"num":28,"verse":"Besides these external matters, I have the daily pressure of my anxiety about all the churches. "},{"num":29,"verse":"When anyone is weak, I’m weak too. When anyone is caught in a trap, I’m also harmed."},{"num":30,"verse":"If I must brag, I will brag about the things that show how weak I am. "},{"num":31,"verse":"The God and Father of the Lord Yeshua, who is praised forever, knows that I’m not lying. "},{"num":32,"verse":"The governor under King Aretas put guards around the city of Damascus to catch me. "},{"num":33,"verse":"So I was let down in a basket through an opening in the wall and escaped from him."}]