[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold, a virgin shall conceive, and bear a son . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "behold, the young woman, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or perhaps the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bride, shall conceive. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The first noun has the definite article in the Hebrew, and the word, though commonly used of the unmarried, strictly speaking denotes rather one who has arrived at marriageable age. “Bride,” in the old English and German sense of the word as applied to one who is about to become a wife, or is still a young wife, will, perhaps, best express its relation to the two Hebrew words which respectively and distinctively are used for “virgin” and for “wife.” In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Authorised Version gives “damsels.” The mysterious prophecy which was thus delivered to Ahaz has been very differently interpreted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:10-16 Secret disaffection to God is often disguised with the colour of respect to him; and those who are resolved that they will not trust God, yet pretend they will not tempt him. The prophet reproved Ahaz and his court, for the little value they had for Divine revelation. Nothing is more grievous to God than distrust, but the unbelief of man shall not make the promise of God of no effect; the Lord himself shall give a sign. How great soever your distress and danger, of you the Messiah is to be born, and you cannot be destroyed while that blessing is in you. It shall be brought to pass in a glorious manner; and the strongest consolations in time of trouble are derived from Christ, our relation to him, our interest in him, our expectations of him and from him. He would grow up like other children, by the use of the diet of those countries; but he would, unlike other children, uniformly refuse the evil and choose the good. And although his birth would be by the power of the Holy Ghost, yet he should not be fed with angels' food. Then follows a sign of the speedy destruction of the princes, now a terror to Judah. Before this child, so it may be read; this child which I have now in my arms, (Shear-jashub, the prophet's own son, ver. 3,) shall be three or four years older, these enemies' forces shall be forsaken of both their kings. The prophecy is so solemn, the sign is so marked, as given by God himself after Ahaz rejected the offer, that it must have raised hopes far beyond what the present occasion suggested. And, if the prospect of the coming of the Divine Saviour was a never-failing support to the hopes of ancient believers, what cause have we to be thankful that the Word was made flesh! May we trust in and love Him, and copy his example.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore - Since you will not \"ask\" a pledge that the land shall be safe, Yahweh will furnish one unasked. A sign or proof is desirable in the case, and Yahweh will not withhold it because a proud and contemptuous monarch refuses to seek it. Perhaps there is no prophecy in the Old Testament on which more has been written, and which has produced more perplexity among commentators than this. And after all, it still remains, in many respects, very obscure. Its general original meaning is not difficult. It is, that in a short time - within the time when a young woman, then a virgin, should conceive and bring forth a child, and that child should grow old enough to distinguish between good and evils - the calamity which Ahaz feared would be entirely removed. The confederacy would be broken up, and the land forsaken by both those kings. The conception and birth of a child - which could be known only by him who knows \"all\" future events - would be the evidence of such a result. His appropriate \"name\" would be such as would be a \"sign,\" or an indication that God was the protector of the nation, or was still with them. In the examination of this difficult prophecy, my first object will be to give an explanation of the meaning of the \"words and phrases\" as they occur in the passage, and then to show, as far as I may be able, what was the design of the passage.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord himself - Hebrew, 'Adonai;' see this word explained in the the note at Isaiah 1:24. He will do it without being asked to do it; he will do it though it is rejected and despised; he will do it because it is important for the welfare of the nation, and for the confirmation of his religion, to furnish a demonstration to the people that he is the only true God. It is clearly implied here, that the sign should be such as Yahweh alone could give. It would be such as would be a demonstration that he presided over the interests of the people. If this refers to the birth of a child, then it means that this was an event which could be known only to God, and which could be accomplished only by his agency. If it refers to the miraculous conception and birth of the Messiah, then it means that that was an event which none but God could accomplish. The true meaning I shall endeavor to state in the notes, at the close of Isaiah 7:16.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord himself - Hebrew, 'Adonai;' see this word explained in the the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He will do it without being asked to do it; he will do it though it is rejected and despised; he will do it because it is important for the welfare of the nation, and for the confirmation of his religion, to furnish a demonstration to the people that he is the only true God. It is clearly implied here, that the sign should be such as Yahweh alone could give. It would be such as would be a demonstration that he presided over the interests of the people. If this refers to the birth of a child, then it means that this was an event which could be known only to God, and which could be accomplished only by his agency. If it refers to the miraculous conception and birth of the Messiah, then it means that that was an event which none but God could accomplish. The true meaning I shall endeavor to state in the notes, at the close of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall give you - Primarily to the house of David; the king and royal family of Judah. It was especially designed to assure the government that the kingdom would be safe. Doubtless, however, the word 'you' is designed to include the nation, or the people of the kingdom of Judah. It would be so public a sign, and so clear a demonstration, as to convince them that their city and land must be ultimately safe.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A sign - A pledge; a token; an evidence of the fulfillment of what is predicted. The word does not, of necessity, denote a miracle, though it is often so applied; see the notes at Isaiah 7:11. Here it means a proof, a demonstration, a certain indication that what he had said should be fulfilled. As that was to be such a demonstration as to show that he was \"able\" to deliver the land, the word \"here\" denotes that which was miraculous, or which could be effected \"only\" by Yahweh.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A sign - A pledge; a token; an evidence of the fulfillment of what is predicted. The word does not, of necessity, denote a miracle, though it is often so applied; see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here it means a proof, a demonstration, a certain indication that what he had said should be fulfilled. As that was to be such a demonstration as to show that he was \"able\" to deliver the land, the word \"here\" denotes that which was miraculous, or which could be effected \"only\" by Yahweh.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold - הנה  hinnêh. This interjection is a very common one in the Old Testament. It is used to arrest attention; to indicate the importance of what was about to be said. It serves to designate persons and things; places and actions. It is used in lively descriptions, and animated discourse; when anything unusual was said, or occurred; or any thing which especially demanded attention; Genesis 12:19; Genesis 16:16; Genesis 18:9; Genesis 1:29; Genesis 40:9; Psalm 134:1. It means here, that an event was to occur which demanded the attention of the unbelieving monarch, and the regard of the people - an event which would be a full demonstration of what the prophet had said, that God would protect and save the nation.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Behold - הנה  hinnêh. This interjection is a very common one in the Old Testament. It is used to arrest attention; to indicate the importance of what was about to be said. It serves to designate persons and things; places and actions. It is used in lively descriptions, and animated discourse; when anything unusual was said, or occurred; or any thing which especially demanded attention; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 16:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 40:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 134:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It means here, that an event was to occur which demanded the attention of the unbelieving monarch, and the regard of the people - an event which would be a full demonstration of what the prophet had said, that God would protect and save the nation.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A virgin - This word properly means a girl, maiden, virgin, a young woman who is unmarried, and who is of marriageable age. The word עלמה  ‛almâh, is derived from the verb עלם  ‛âlam, \"to conceal, to hide, to cover.\" The word עלם  ‛elem, from the same verb, is applied to a \"young man,\" in 1 Samuel 17:56; 1 Samuel 20:22. The word here translated a virgin, is applied to Rebekah Genesis 24:43, and to Miriam, the sister of Moses, Exodus 2:8. It occurs in only seven places in the Old Testament. Besides those already mentioned, it is found in Psalm 68:25; Sol 1:3; Sol 6:8; and Proverbs 30:19. In all these places, except, perhaps, in Proverbs, it is used in its obvious natural sense, to denote a young, unmarried female. In the Syriac, the word  alĕm, means to grow up, juvenis factus est; juvenescere fecited. Hence, the derivatives are applied to youth; to young men; to young women - to those who \"are growing up,\" and becoming youths.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A virgin - This word properly means a girl, maiden, virgin, a young woman who is unmarried, and who is of marriageable age. The word עלמה  ‛almâh, is derived from the verb עלם  ‛âlam, \"to conceal, to hide, to cover.\" The word עלם  ‛elem, from the same verb, is applied to a \"young man,\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:56",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 20:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word here translated a virgin, is applied to Rebekah ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and to Miriam, the sister of Moses, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It occurs in only seven places in the Old Testament. Besides those already mentioned, it is found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Sol 1:3; Sol 6:8; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 30:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In all these places, except, perhaps, in Proverbs, it is used in its obvious natural sense, to denote a young, unmarried female. In the Syriac, the word  alĕm, means to grow up, juvenis factus est; juvenescere fecited. Hence, the derivatives are applied to youth; to young men; to young women - to those who \"are growing up,\" and becoming youths.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The etymology of the word requires us to suppose that it means one who is growing up to a marriageable state, or to the age of puberty. The word maiden, or virgin, expresses the correct idea. Hengstenberg contends, that it means one \"in the unmarried state;\" Gesenius, that it means simply the being of marriageable age, the age of puberty. The Hebrews usually employed the word בתולה  bethûlâh, to denote a pure virgin (a word which the Syriac translation uses here); but the word here evidently denotes one who was \"then\" unmarried; and though its primary idea is that of one who is growing up, or in a marriageable state, yet the whole connection requires us to understand it of one who was \"not then married,\" and who was, therefore, regarded and designated as a virgin. The Vulgate renders it 'virgo.' The Septuagint, ἡ παρθένος  hē parthenos, \"a virgin\" - a word which they use as a translation of the Hebrew בתולה  bethûlâh in Exodus 22:16-17; Leviticus 21:3, Leviticus 21:14; Deuteronomy 22:19, Deuteronomy 22:23, Deuteronomy 22:28; Deuteronomy 32:25; Judges 19:24; Judges 21:12; and in thirty-three other places (see Trommius' Concordance); of נערה  na‛ărâh, a girl, in Genesis 24:14, Genesis 24:16, Genesis 24:55; Genesis 34:3 (twice); 1 Kings 1:2; and of עלמה  ‛almâh, only in Genesis 24:43; and in Isaiah 7:14.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The etymology of the word requires us to suppose that it means one who is growing up to a marriageable state, or to the age of puberty. The word maiden, or virgin, expresses the correct idea. Hengstenberg contends, that it means one \"in the unmarried state;\" Gesenius, that it means simply the being of marriageable age, the age of puberty. The Hebrews usually employed the word בתולה  bethûlâh, to denote a pure virgin (a word which the Syriac translation uses here); but the word here evidently denotes one who was \"then\" unmarried; and though its primary idea is that of one who is growing up, or in a marriageable state, yet the whole connection requires us to understand it of one who was \"not then married,\" and who was, therefore, regarded and designated as a virgin. The Vulgate renders it 'virgo.' The Septuagint, ἡ παρθένος  hē parthenos, \"a virgin\" - a word which they use as a translation of the Hebrew בתולה  bethûlâh in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 22:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 21:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 22:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 22:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 22:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 19:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 21:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in thirty-three other places (see Trommius' Concordance); of נערה  na‛ărâh, a girl, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:55",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (twice); ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and of עלמה  ‛almâh, only in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The word, in the view of the Septuagint translators, therefore conveyed the proper idea of a virgin. The Chaldee uses substantially the same word as the Hebrew. The idea of a \"virgin\" is, therefore, the most obvious and natural idea in the use of this word. It does not, however, imply that the person spoken of should be a virgin \"when the child\" should be born; or that she should ever after be a virgin. It means simply that one who was \"then\" a virgin, but who was of marriageable age, should conceive, and bear a son. Whether she was \"to be\" a virgin \"at the time\" when the child was born, or was to remain such afterward, are inquiries which cannot be determined by a philological examination of the word. It is evident also, that the word is not opposed to \"either\" of these ideas. \"Why\" the name which is thus given to an unmarried woman was derived from the verb to \"hide, to conceal,\" is not agreed among lexicographers. The more probable opinion is, that it was because to the time of marriage, the daughter was supposed to be hidden or concealed in the family of the parents; she was kept shut up, as it were, in the paternal dwelling. This idea is given by Jerome, who says, 'the name is given to a virgin because she is said to be hidden or secret; because she does not expose herself to the gaze of men, but is kept with great care under the custody of parents.' The sum of the inquiry here, into the meaning of the word translated \"virgin,\" is, that it does not differ from that word as used by us. The expression means no more than that one who was then a virgin should have a son, and that this should be a sign to Ahaz.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And shall call his name - It was usual for \"mothers\" to give names to their children; Genesis 4:1; Genesis 19:37; Genesis 29:32; Genesis 30:18. There is, therefore, no reason to suppose, as many of the older interpreters did, that the fact that it is said the mother should give the name, was a proof that the child should have no human father. Such arguments are unworthy of notice; and only show to what means people have resorted in defending the doctrines, and in interpreting the pages of the Bible. The phrase, 'she will name,' is, moreover, the same as 'they shall name,' or he shall be named. 'We are not, then, to suppose that the child should actually receive the name Immanuel as a proper name, since, according to the usage of the prophet, and especially of Isaiah, that is often ascribed to a person or thing as a name which belongs to him in an eminent degree as an attribute; see Isaiah 9:5; Isaiah 61:6; Isaiah 62:4.' - \"Hengstenberg.\" The idea is, that that would be a name that might be \"appropriately\" given to the child. Another name was also given to this child, expressing substantially the same thing, with a circumstantial difference; see the note at Isaiah 8:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shall call his name - It was usual for \"mothers\" to give names to their children; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 29:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 30:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There is, therefore, no reason to suppose, as many of the older interpreters did, that the fact that it is said the mother should give the name, was a proof that the child should have no human father. Such arguments are unworthy of notice; and only show to what means people have resorted in defending the doctrines, and in interpreting the pages of the Bible. The phrase, 'she will name,' is, moreover, the same as 'they shall name,' or he shall be named. 'We are not, then, to suppose that the child should actually receive the name Immanuel as a proper name, since, according to the usage of the prophet, and especially of Isaiah, that is often ascribed to a person or thing as a name which belongs to him in an eminent degree as an attribute; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".' - \"Hengstenberg.\" The idea is, that that would be a name that might be \"appropriately\" given to the child. Another name was also given to this child, expressing substantially the same thing, with a circumstantial difference; see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Immanuel - Hebrew 'God with us' - עמנואל  ‛immânû'êl - from אל  'ĕl, \"God,\" and עמנוּ  ‛ı̂mmânû, \"with us.\" The name is designed to denote that God would be with the nation as its protector, and the birth of this child would be a sign or pledge of it. The mere circumstance that this name is given, however, does not imply anything in regard to the nature or rank of the child, for nothing was more common among the Jews than to incorporate the name, or a part of the name, of the Deity with the names which they gave to their children. Thus, \"Isaiah\" denotes the salvation of Yahweh; \"Jeremiah,\" the exaltation or grandeur of Yahweh, each compounded of two words, in which the name Yahweh constitutes a part. Thus, also in \"Elijah,\" the two names of God are combined, and it means literally, \"God the Yahweh.\" Thus, also \"Eliab,\" God my faather; \"Eliada,\" knowledge of God; \"Eliakim,\" the resurrection of God; \"Elihu,\" he is my God; \"Elisha,\" salvation of God. In none of these instances is the fact, that the name of God is incorporated with the proper name of the individual, any argument in respect to his rank or character.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is true, that Matthew Mat 1:23 uses this name as properly expressing the rank of the Messiah; but all that can be demonstrated from the use of the name by Matthew is, that it properly designated the nature and rank of the Lord Jesus. It was a pledge, then, that God was with his people, and the name designated by the prophet had a complete fulfillment in its use as applied to the Messiah. Whether the Messiah be regarded as himself a pledge and demonstration of the presence and protection of God, or whether the name be regarded as descriptive of his nature and dignity, yet there was an \"appropriateness\" in applying it to him. It was fully expressive of the event of the incarnation. Jerome supposes that the name, Immanuel, denotes nothing more than divine aid and protection. Others have supposed, however, that the name must denote the assumption of our nature by God in the person of the Messiah, that is, that God became man. So Theodoret, Irenaeus, Tertullian, Lactantius, Chrysostom. Calvin, Rosenmuller, and others. The true interpretation is, that no argument to prove that can be derived from the use of the name; but when the fact of the incarnation has been demonstrated from other sources, the \"name is appropriately expressive of that event.\" So it seems to be used by Matthew.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It may be quite true, that no argument can be founded on the bare name, Immanuel; yet that name, \"in its connection here,\" may certainly be regarded as a designed prediction of the incarnation of Christ. Such a design our author allows in the prophecy generally. 'The prophet,' says he, 'designedly made use of language which would be appropriate to a future and most glorious event.' Why, then, does he speak of the most pregnant word in the prophecy as if Matthew had accidentally stumbled on it, and, finding it would appropriately express the nature of Christ, accomodated it for that purpose? Having originally rejected the Messianic reference, and been convinced only by a more careful examination of the passage, that he was in error, something of his old view seems still to cling to this otherwise admirable exposition. 'The name Immanuel,' says Professor Alexander, 'although it might be used to signify God's providential presence merely Psalm 46:8, 12; Psalm 89:25; Joshua 1:5; Jeremiah 1:8; Isaiah 43:2, has a latitude and pregnancy of meaning which can scarcely be fortuitous; and which, combined with all the rest, makes the conclusion almost unavoidable, that it was here intended to express a personal, as well as a providential presence ... When we read in the Gospel of Matthew, that Jesus Christ was actually born of a virgin, and that all the circumstances of his birth came to pass that this very prophecy might be fulfilled, it has less the appearance of an unexpected application, than of a conclusion rendered necessary by a series of antecedent facts and reasonings, the last link in a long chain of intimations more or less explicit (referring to such prophecies as Genesis 3:15; Micah 5:2).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It may be quite true, that no argument can be founded on the bare name, Immanuel; yet that name, \"in its connection here,\" may certainly be regarded as a designed prediction of the incarnation of Christ. Such a design our author allows in the prophecy generally. 'The prophet,' says he, 'designedly made use of language which would be appropriate to a future and most glorious event.' Why, then, does he speak of the most pregnant word in the prophecy as if Matthew had accidentally stumbled on it, and, finding it would appropriately express the nature of Christ, accomodated it for that purpose? Having originally rejected the Messianic reference, and been convinced only by a more careful examination of the passage, that he was in error, something of his old view seems still to cling to this otherwise admirable exposition. 'The name Immanuel,' says Professor Alexander, 'although it might be used to signify God's providential presence merely ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 12; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", has a latitude and pregnancy of meaning which can scarcely be fortuitous; and which, combined with all the rest, makes the conclusion almost unavoidable, that it was here intended to express a personal, as well as a providential presence ... When we read in the Gospel of Matthew, that Jesus Christ was actually born of a virgin, and that all the circumstances of his birth came to pass that this very prophecy might be fulfilled, it has less the appearance of an unexpected application, than of a conclusion rendered necessary by a series of antecedent facts and reasonings, the last link in a long chain of intimations more or less explicit (referring to such prophecies as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The same considerations seem to show that the prophecy is not merely accommodated, which is, moreover, clear fram the emphatic form of the citation τοῦτο ὅλον γέγονεν ἵνα πληρωθῇ  touto holon gegonen hina plēroothē, making it impossible to prove the existence of any quotation in the proper sense, if this be not one.' But, indeed, the author himself admits all this, though his language is less decided and consistent than could be wished on so important a subject. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The same considerations seem to show that the prophecy is not merely accommodated, which is, moreover, clear fram the emphatic form of the citation τοῦτο ὅλον γέγονεν ἵνα πληρωθῇ  touto holon gegonen hina plēroothē, making it impossible to prove the existence of any quotation in the proper sense, if this be not one.' But, indeed, the author himself admits all this, though his language is less decided and consistent than could be wished on so important a subject. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. himself—since thou wilt not ask a sign, nay, rejectest the offer of one.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "you—for the sake of the house of believing \"David\" (God remembering His everlasting covenant with David), not for unbelieving Ahaz' sake.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold—arresting attention to the extraordinary prophecy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "virgin—from a root, \"to lie hid,\" virgins being closely kept from men's gaze in their parents' custody in the East. The Hebrew, and the Septuagint here, and Greek (Mt 1:23), have the article, the virgin, some definite one known to the speaker and his hearers; primarily, the woman, then a virgin, about immediately to become the second wife, and bear a child, whose attainment of the age of discrimination (about three years) should be preceded by the deliverance of Judah from its two invaders; its fullest significancy is realized in \"the woman\" (Ge 3:15), whose seed should bruise the serpent's head and deliver captive man (Jer 31:22; Mic 5:3). Language is selected such as, while partially applicable to the immediate event, receives its fullest, most appropriate, and exhaustive accomplishment in Messianic events. The New Testament application of such prophecies is not a strained \"accommodation\"; rather the temporary fulfilment of an adaptation of the far-reaching prophecy to the present passing event, which foreshadows typically the great central end of prophecy, Jesus Christ (Re 19:10). Evidently the wording is such as to apply more fully to Jesus Christ than to the prophet's son; \"virgin\" applies, in its simplest sense, to the Virgin Mary, rather than to the prophetess who ceased to be a virgin when she \"conceived\"; \"Immanuel,\" God with us (Joh 1:14; Re 21:3), cannot in a strict sense apply to Isaiah's son, but only to Him who is presently called expressly (Isa 9:6), \"the Child, the Son, Wonderful (compare Isa 8:18), the mighty God.\" Local and temporary features (as in Isa 7:15, 16) are added in every type; otherwise it would be no type, but the thing itself. There are resemblances to the great Antitype sufficient to be recognized by those who seek them; dissimilarities enough to confound those who do not desire to discover them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "call—that is, \"she shall,\" or as Margin, \"thou, O Virgin, shalt call;\" mothers often named their children (Ge 4:1, 25; 19:37; 29:32). In Mt 1:23 the expression is strikingly changed into, \"They shall call\"; when the prophecy received its full accomplishment, no longer is the name Immanuel restricted to the prophetess' view of His character, as in its partial fulfilment in her son; all shall then call (that is, not literally), or regard Him as peculiarly and most fitly characterized by the descriptive name, \"Immanuel\" (1Ti 3:16; Col 2:9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "name—not mere appellation, which neither Isaiah's son nor Jesus Christ bore literally; but what describes His manifested attributes; His character (so Isa 9:6). The name in its proper destination was not arbitrary, but characteristic of the individual; sin destroyed the faculty of perceiving the internal being; hence the severance now between the name and the character; in the case of Jesus Christ and many in Scripture, the Holy Ghost has supplied this want [Olshausen].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because you despise me, and the sign which I now offer to you, God of his own free grace will send you a more honourable messenger, and give you a nobler sign, to try whether that will cure you of your infidelity. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nevertheless",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as this particle seems to be understood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 30:18 Jeremiah 16:14 30:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 30:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Although you deserve no sign nor favour, yet, for the comfort of those few believers which are among you, and to leave you without excuse, I shall mind you or another and a greater sign, which God hath promised, and will in his due time perform; which also is a pledge of the certain accomplishment of all God’s promises. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "surely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as this particle is sometimes used, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 4:15 Jeremiah 2:33 5:2 Zechariah 11:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 5:2 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 11:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A sign, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, of your deliverance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How was this birth of a virgin, which was not to come till many ages after, a sign of their deliverance from the present danger? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Because this was a clear demonstration of God’s infinite power, and goodness, and faithfulness, and consequently of the certain truth of all God’s promises from time to time, which can never fill so long as those attributes of God stand; and men’s faith is either strong or weak, as they believe them or doubt of them; of which see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 77:8 78:19,20 Ro 4:20,21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 78:19,20 Ro 4:20,21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And so this was a proper remedy for Ahaz’s disease, which was a secret suspicion that God either could not or would not deliver them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Because that promise, I say not only the actual giving, which was long after, but even the promise, of the Messiah, which had been made long since, and oft renewed, and was universally believed by all the people, was the foundation of all God’s mercies and promises unto them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Corinthians 1:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 1:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and a pledge of the accomplishment of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. Because this promised birth did suppose and require the preservation of that city, and nation, and tribe, in and of which the Messiah was to be born; and therefore there was no cause to fear that utter ruin which their enemies now threatened to bring upon them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. This is one, but not the only sign here given, as we shall see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 7:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " you who will not believe that God alone is able to deliver you from the united force of Syria and Israel, take notice, for your full satisfaction, that God is not only able to do this work, but to do far greater and harder things, which he hath promised, and therefore both can and will accomplish. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A virgin; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " strictly and properly so called. The Jews, that they may obscure this plain text, and weaken this proof of the truth of Christian religion, pretend that this Hebrew word signifies a young woman, and not a virgin. But this corrupt translation is easily confuted, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Because this word constantly signifies a virgin in all other places of Scripture where it is used, which are ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 24:43",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:43",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 7:16 Exodus 2:8 Psalm 68:25 Song of Solomon 1:3 6:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Song of Solomon 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 6:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; to which may be added ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 30:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 30:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The way of a man with a maid, or a virgin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": for though it be supposed that he did design and desire to corrupt her, and afterwards did so; yet she may well be called a virgin, partly because he found her a virgin, and partly because she seemed and pretended to others to be such, which made her more careful to use all possible arts to preserve her reputation, and so made the discovery of her impure conversation with the man more difficult, whereas the filthy practices of common harlots are easily and vulgarly known. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. From the scope of this place, which is to confirm their faith by a strange and prodigious sign, which surely could not be not a young woman should conceive a child, but that a virgin should conceive, &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Bear a Son; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or rather, bring forth, as it is rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 1:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and as this Hebrew word is used, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 16:11 17:19 Judges 13:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 17:19 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 13:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And shall call; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the virgin, last mentioned, shall call; which is added as a further evidence of her virginity, and that this Son had no human father, because the right of naming the child (which, being a sign of dominion, is primarily in the husband, and in the wife only by his consent or permission, as is evident from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 5:29 35:18 Luke 1:60,63",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 35:18 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:60",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",63",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and many other places of Scripture) is wholly appropriated to her. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Immanuel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which signifies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God with us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; God dwelling among us, in our nature, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 1:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", God and man meeting in one person, and being a Mediator between God and men. For the design of these words is not so much to relate the name by which Christ should commonly be called, as to describe his nature and office; as we read that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his name shall be called Wonderful, Counsellor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 9:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " said to be his (the Messiah’s) name ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whereby he shall be called, The Lord our Righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 23:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", although he be never called by these names in any other place of the Old or New Testament; but the meaning of these places is, He shall be wonderful, and our Counsellor, &c., and our Righteousness; for to be called is oft put for to be, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 1:26 4:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 4:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore the Lord himself shall give you a sign,.... Whether they would ask one or not; a sign both in heaven and earth, namely, the promised Messiah; who being the Lord from heaven, would take flesh of a virgin on earth; and who as man, being buried in the heart of the earth, would be raised from thence, and ascend up into heaven; and whose birth, though it was to be many years after, was a sign of present deliverance to Judah from the confederacy of the two kings of Syria and Israel; and of future safety, since it was not possible that this kingdom should cease to be one until the Messiah was come, who was to spring from Judah, and be of the house of David; wherefore by how much the longer off was his birth, by so much the longer was their safety. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold, a virgin shall conceive, and bear a son; this is not to be understood of Hezekiah, the son of Ahaz, by his wife, as some Jewish writers interpret it; which interpretation Jarchi refutes, by observing that Hezekiah was nine years old when his father began to reign, and this being, as he says, the fourth year of his reign, he must be at this time thirteen years of age; in like manner, Aben Ezra and Kimchi object to it; and besides, his mother could not be called a \"virgin\": and for the same reason it cannot be understood of any other son of his either by his wife, as Kimchi thinks, or by some young woman; moreover, no other son of his was ever lord of Judea, as this Immanuel is represented to be, in Isaiah 8:8 nor can it be interpreted of Isaiah's wife and son, as Aben Ezra and Jarchi think; since the prophet could never call her a \"virgin\", who had bore him children, one of which was now with him; nor indeed a \"young woman\", but rather \"the prophetess\", as in Isaiah 8:3 nor was any son of his king of Judah, as this appears to be, in the place before cited: but the Messiah is here meant, who was to be born of a pure virgin; as the word here used signifies in all places where it is mentioned, as Genesis 24:43 and even in Proverbs 30:19 which is the instance the Jews give of the word being used of a woman corrupted; since it does not appear that the maid and the adulterous woman are one and the same person; and if they were, she might, though vitiated, be called a maid or virgin, from her own profession of herself, or as she appeared to others who knew her not, or as she was antecedent to her defilement; which is no unusual thing in Scripture, see Deuteronomy 22:28 to which may be added, that not only the Evangelist Matthew renders the word by  \"a virgin\"; but the Septuagint interpreters, who were Jews, so rendered the word hundreds of years before him; and best agrees with the Hebrew word, which comes from the root  which signifies to \"hide\" or \"cover\"; virgins being covered and unknown to men; and in the eastern country were usually kept recluse, and were shut up from the public company and conversation of men: and now this was the sign that was to be given, and a miraculous one it was, that the Messiah should be born of a pure and incorrupt virgin; and therefore a \"behold\" is prefixed to it, as a note of admiration; and what else could be this sign or wonder? not surely that a young married woman, either Ahaz's or Isaiah's wife, should be with child, which is nothing surprising, and of which there are repeated instances every day; nor was it that the young woman was unfit for conception at the time of the prophecy, which was the fancy of some, as Jarchi reports, since no such intimation is given either in the text or context; nor did it lie in this, that it was a male child, and not a female, which was predicted, as R. Saadiah Gaon, in Aben Ezra, would have it; for the sign or wonder does not lie in the truth of the prophet's prediction, but in the greatness of the thing predicted; besides, the verification of this would not have given the prophet much credit, nor Ahaz and the house of David much comfort, since this might have been ascribed rather to a happy conjecture than to a spirit of prophecy; much less can the wonder be, that this child should eat butter and honey, as soon as it was born, as Aben Ezra and Kimchi suggest; since nothing is more natural to, and common with young children, than to take down any kind of liquids which are sweet and pleasant. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Behold, a virgin shall conceive, and bear a son; this is not to be understood of Hezekiah, the son of Ahaz, by his wife, as some Jewish writers interpret it; which interpretation Jarchi refutes, by observing that Hezekiah was nine years old when his father began to reign, and this being, as he says, the fourth year of his reign, he must be at this time thirteen years of age; in like manner, Aben Ezra and Kimchi object to it; and besides, his mother could not be called a \"virgin\": and for the same reason it cannot be understood of any other son of his either by his wife, as Kimchi thinks, or by some young woman; moreover, no other son of his was ever lord of Judea, as this Immanuel is represented to be, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " nor can it be interpreted of Isaiah's wife and son, as Aben Ezra and Jarchi think; since the prophet could never call her a \"virgin\", who had bore him children, one of which was now with him; nor indeed a \"young woman\", but rather \"the prophetess\", as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " nor was any son of his king of Judah, as this appears to be, in the place before cited: but the Messiah is here meant, who was to be born of a pure virgin; as the word here used signifies in all places where it is mentioned, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and even in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 30:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which is the instance the Jews give of the word being used of a woman corrupted; since it does not appear that the maid and the adulterous woman are one and the same person; and if they were, she might, though vitiated, be called a maid or virgin, from her own profession of herself, or as she appeared to others who knew her not, or as she was antecedent to her defilement; which is no unusual thing in Scripture, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 22:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to which may be added, that not only the Evangelist Matthew renders the word by  \"a virgin\"; but the Septuagint interpreters, who were Jews, so rendered the word hundreds of years before him; and best agrees with the Hebrew word, which comes from the root  which signifies to \"hide\" or \"cover\"; virgins being covered and unknown to men; and in the eastern country were usually kept recluse, and were shut up from the public company and conversation of men: and now this was the sign that was to be given, and a miraculous one it was, that the Messiah should be born of a pure and incorrupt virgin; and therefore a \"behold\" is prefixed to it, as a note of admiration; and what else could be this sign or wonder? not surely that a young married woman, either Ahaz's or Isaiah's wife, should be with child, which is nothing surprising, and of which there are repeated instances every day; nor was it that the young woman was unfit for conception at the time of the prophecy, which was the fancy of some, as Jarchi reports, since no such intimation is given either in the text or context; nor did it lie in this, that it was a male child, and not a female, which was predicted, as R. Saadiah Gaon, in Aben Ezra, would have it; for the sign or wonder does not lie in the truth of the prophet's prediction, but in the greatness of the thing predicted; besides, the verification of this would not have given the prophet much credit, nor Ahaz and the house of David much comfort, since this might have been ascribed rather to a happy conjecture than to a spirit of prophecy; much less can the wonder be, that this child should eat butter and honey, as soon as it was born, as Aben Ezra and Kimchi suggest; since nothing is more natural to, and common with young children, than to take down any kind of liquids which are sweet and pleasant. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And shall call his name Immanuel; which is, by interpretation, \"God with us\", Matthew 1:23 whence it appears that the Messiah is truly God, as well as truly man: the name is expressive of the union of the two natures, human and divine, in him; of his office as Mediator, who, being both God and man, is a middle person between both; of his converse with men on earth, and of his spiritual presence with his people. See John 1:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shall call his name Immanuel; which is, by interpretation, \"God with us\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " whence it appears that the Messiah is truly God, as well as truly man: the name is expressive of the union of the two natures, human and divine, in him; of his office as Mediator, who, being both God and man, is a middle person between both; of his converse with men on earth, and of his spiritual presence with his people. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore the Lord himself shall give you a sign; Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14–16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sign of Immanuel. See Additional Note at the end of this chapter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] because of this act of unbelief. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Adonai",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, a virgin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] (LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡ παρθένος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", other Greek versions ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "νεᾶνις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The Hebrew word (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") means strictly “a young woman of marriageable age.” Both etymology and usage (cf. esp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 30:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are adverse to the opinion, once prevalent among Christian interpreters and maintained by a few in recent times, that virginity is necessarily connoted (see Robertson Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prophets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revd. Ed. pp. 426 f.). To express that idea a different word (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "běthûlâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") must have been employed, although even it might not be wholly free from ambiguity (? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is, of course, not disputed that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh may",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be used of a virgin (as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but even if this usage were more uniform than it is, it would still be far from proving that virginity was an essential of the notion. It would appear, therefore, that the idea of a miraculous conception was not present to Isaiah’s mind at this time, since a prediction of such astounding import must surely have been clothed in unambiguous language. Nor does the def. art., which is used in the original, necessarily denote a particular individual. (Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 17:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and see Davidson, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Synt.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " § 21 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") So far as grammar and context go, the expression may mean any young woman, fit to become a mother, whether as yet married or unmarried.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall conceive, and bear a son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The same phrase in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the passage before us the verbs in the original are both participles, and might refer either to the present or the future. But it is doubtful if we can fairly apply one to the present and the other to the future, translating “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with child and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " bear.” Since the birth is certainly future, it seems natural to take the first verb in a future sense also.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and shall call",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] An archaic form, easily mistaken for 2nd pers. (so LXX. &c.). The mother names the child, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. An instructive parallel is the naming of the child Ichabod, born to Eli’s daughter-in-law on the dark day when the ark of God was taken and the glory departed from Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 4:19-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Immanuel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] “With us is God.” The battle-cry of Gustavus Adolphus in the Thirty Years War, “Gott mit uns,” was also Isaiah’s watchword for the coming crisis (cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and like other great thoughts of his ministry he as it were gives it personal and concrete actuality by conceiving it as embodied in the name of a child.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Additional Note on Chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably no single passage of the Old Testament has been so variously interpreted or has given rise to so much controversy as the prophecy contained in these verses. The difficulties arise mainly from the fact that while the terms of the prediction are so indefinite as to admit a wide range of possibilities, we have no record of its actual fulfilment in any contemporary event. The purpose of this note will be to indicate the chief lines along which a solution has been sought for, and to consider how far they satisfy the conditions of a reasonable historical exegesis. But before entering on this survey, it will be well to enquire what sort of fulfilment the context would lead us to expect, or in other words what kind of sign would serve the immediate objects of the prophet’s mission to Ahaz.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We are not entitled to assume as a matter of course that the sign here given will be in all respects such a sign as Ahaz might have asked at an earlier stage of the interview (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the first place it need not involve an objective miracle, although a miracle of the most stupendous order was originally put within the option of Ahaz. Any of the senses in which the word “sign” is used (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") in connexion with a prediction, would satisfy the requirements of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". But further there is a presumption that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "import",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the sign will have been changed by what has taken place in the interval. Isaiah’s first message to Ahaz is an unqualified assurance of deliverance from the designs of Rezin and Pekah, and the sign first offered would be a sign of that and that alone. The prospect of an Assyrian invasion was no doubt in the background of the prophet’s horizon, but his message to Ahaz is complete in itself and takes no account of that final catastrophe. It is manifest, however, that in Isaiah’s mind the whole aspect of affairs is altered by the king’s refusal. The Assyrian invasion is brought into immediate connexion with the attack of the allies, and a new forecast of the future is presented by the prophet in which three great events follow closely on one another: (1) the collapse of the project of the allied princes, (2) the total destruction of Syria and Ephraim by the Assyrians, and (3) the devastation of Judah by the same ruthless conquerors. And the most natural supposition is that the new sign will be an epitome of this new and darker outlook, that is to say it will be a pledge at once of the immediate deliverance and of the judgment that lies behind it. Indeed this view is so obviously implied by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:14-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " that we are shut up to it unless, with some critics, we remove ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " as an interpolation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now there are three features of the prediction in which the import of the sign may be looked for: (i) the birth of the child, (ii) his name, and (iii) his history. And of these three the last is certainly an essential element of the prophecy, as is shewn by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:15-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:15-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". With regard to the other two we can only say that it is antecedently improbable that either of them should be without some special significance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "(i) If the import of the sign be sought mainly in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "birth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the child it becomes almost necessary to assume that the terms of the prophecy point to something extraordinary and mysterious in the circumstances of the birth. This is the case with the traditional Christian interpretation, which finds in it a direct prediction of the miraculous conception of the Virgin Mother of our Lord. The chief support of this view has always been the authority of the Evangelist Matthew, who cites ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " in relating the birth of Jesus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:22-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But it must be observed that such a citation is not decisive as to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "original",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sense of the passage, any more than ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " determines the original sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The great difficulty of the interpretation is that such an event could by no means serve the purpose of a sign to Ahaz. It may be freely admitted, in view of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the expectation of a parthenogenesis is not too bold to be attributed to Isaiah in this moment of ecstatic inspiration. But if this be granted on the one hand it must be conceded on the other that he expected the miracle to be wrought in the immediate future; his language (“a virgin is about to conceive”) implies that the prediction is on the eve of fulfilment, and the assurance in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is nugatory if the promised sign was not to happen for more than 700 years. Moreover, such an idea would require to be unambiguously expressed, and we have seen that the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not connote virginity in the strict sense. Whatever element of truth, therefore, may underlie this exegesis, it can scarcely be held to afford an adequate solution of the problem presented by the oracle in its primary and historical application.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "(ii) Another class of explanations regards the event as a sign to Ahaz and nothing more, and of these we may examine first those which find the chief significance of the sign in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "naming",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the child. Perhaps the most persuasive presentation of this view is that given by Duhm. According to that expositor, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is any young mother who may give birth to a child in the hour of Judah’s deliverance from Syria and Ephraim. “God (is) with us” will be the spontaneous exclamation of child-bearing women in that time; and to such utterances at the moment of birth a certain oracular significance was attached, which caused them to be perpetuated in the name of the child. The child (or children) bearing the name Immanuel will grow up as a sign to Ahaz, first of the genuineness of Isaiah’s inspiration, who foretold the event, and second of the yet future judgment threatened on the same occasion and his own rejection by Jehovah. To this theory no exception can be taken on grammatical or historical grounds. It is undoubtedly rendered easier by the excision of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which Duhm advocates. If that verse be retained one feels that the sign is rather overloaded by a circumstance which is directly opposed to the meaning of the name. And apart from this there will perhaps remain an impression that justice has not been done to the emphasis with which the birth is announced. Why, on this view, should the mother be an ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "young",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " woman?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "(iii) A third view (not to be sharply distinguished from ii) lays stress not so much on the birth or the naming as on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "history",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the child, which becomes a sort of chronological thread on which political events are strung. The meaning is: before the birth of a certain child Judah will have experienced a great deliverance (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), before he has emerged from infancy, Syria and Ephraim will have disappeared (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") and at a later stage of his development the land of Judah will be reduced to a pastoral wilderness (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). An interesting parallel is found in the child Pollio in Vergil’s fourth Eclogue, and another from the life of Mohammed has been lately pointed out by Mr Bevan[33]. And as in these two cases a particular child is the subject of the sign, so here expositors have hazarded several guesses as to the identity of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". She has been supposed to be (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the wife of Isaiah, either the mother of Shearjashub, or a second wife (some identifying Immanuel with Maher-shalal-hash-baz, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a damsel in the harem of Ahaz (the mother of Hezekiah is excluded by the chronology), or (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a young woman among the bystanders, indicated by a gesture. None of these conjectures can be pronounced altogether happy. They are all alike discredited by a certain touch of vulgarity implied in the designation of some known individual as “the damsel.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[33] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jewish Quarterly Review",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Oct. 1893, pp. 220 ff. The incident is that of a Jew who was discoursing to an Arab tribe at Medina about the resurrection and the last judgment. “ ‘But,’ said they, ‘what is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sign",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (âyat, Hebr. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אוֹת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of this?’ ‘A prophet,’ he answered, ‘sent from that country yonder,’ pointing with his hand towards Mecca and Yemen. ‘But when,’ they asked, ‘do you think he will come?’ Then he looked at me and said, ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If this boy reaches the full term of life, he will see him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ And in fact before another day had passed God sent His Apostle to dwell among us, and we believed on him, &c.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "An ingenious modification of the last two theories recently propounded by an American writer[34], differs from all others in excluding the prospect of deliverance from the import of the sign, whose significance is found in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "contrast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " between the name of the child and his history. The name Immanuel embodies the religious optimism of the king and nation, their false trust in the protection of Jehovah; the hardships through which the child passes symbolise the providential course of events under which this delusive confidence must collapse. This interpretation, however, requires the excision of at least the latter part of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 7:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and also the rejection of ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as spurious.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[34] F. C. Porter, in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Journal of Biblical Literature",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vol. xiv. 1895, pp. 19–36.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "(iv) Another line of exegesis which has commended itself to a large number of modern expositors starts from the idea that here for the first time the figure of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "personal Messiah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is flashed on Isaiah’s mind. On this view the prophecy is invested with profound religious significance, which is not the case with the two last-mentioned theories. Face to face with the craven-hearted monarch who had betrayed his trust as guardian of the liberty and independence of Judah, the prophet receives this revelation of the true King, as one born to his people in the hour of danger, sharing their poverty and affliction in his youth and waiting the time when “the government shall be upon his shoulder” and the perfect kingdom of God shall be established (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The attention is concentrated on the mysterious personality of the child, that of the mother falls into the background. She may be some unknown daughter of the royal house, or a nameless maiden of lowly rank; the essential fact is that in the speedy advent of Immanuel, in his name, in his experience, men will recognise the God-given “sign” of the truth of the prophet’s words. This on the whole seems to be the theory which affords the most adequate solution of the complex difficulties of the passage. It satisfies tie claims of a truly historical interpretation, and at the same time it accounts, as none of the other modern theories do, for the impassioned fervour, the indefinable atmosphere of mystery and emotion with which the words are surrounded. It is no objection to it that the anticipation remained an unrealised ideal long after the opportunity for a sign to Ahaz had passed away; for a similar remark applies to the whole conception of a personal Messiah, whose appearance Isaiah certainly expected to synchronise with the Assyrian invasion. Not the least of its recommendations, indeed, is the fact that it brings this prophecy into line with the other great Messianic prophecies of ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; and if the last words of ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are rightly rendered “thy land, O Immanuel” (which however has been disputed, see on the verse below) a link would be supplied which would make the proof almost irresistible, since no ordinary child, born or unborn, could be naturally apostrophised as the owner of the land.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "(v) An ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "allegorical",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " interpretation of the prophecy has been advanced by a few scholars, the “virgin” being taken as a personification of the Davidic house, or of the religious community, and the child either as the Messiah, or as a figure of the new generation; or else the birth is explained as merely a general symbol of deliverance. But all this is purely fanciful.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A few words may be added in conclusion on the pre-Christian acceptation of the passage. From a very early time it seems to have been recognised that a certain mystery clung to the words, that their significance was not exhausted by the circumstances in which they were originally spoken, but that they had an eschatological reference, pointing forward to the birth of the Messiah, as the wonderful event on which all the hope of the future hung. The first trace of this tendency is found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “therefore will he (Jehovah) give them up until the time when a (certain) travailing woman hath brought forth, &c.” These words can hardly be explained otherwise than as a reference to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and if it were certain that they were written by a contemporary of Isaiah they would go far to determine the sense in which the earlier prophecy should be understood. Since, however, they belong to a part of the book of Micah whose age is disputed, they may possibly represent a secondary application of Isaiah’s prophecy rather than its primary intention. A further advance in the same direction appears to be indicated by the rendering of our passage in the LXX. It is almost incredible that the use of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παρθένος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in so important a connexion should be due to mere laxity on the part of the translator. More probably it expresses a belief current in Jewish circles that the Messiah was to be born of a virgin. A good deal of evidence has been adduced to shew that such an expectation actually prevailed amongst both Alexandrian and Palestinian Jews [35], and if it existed it could hardly fail to influence the exegesis of this prophecy. It was only when the prophecy was appealed to by the Christians in proof of the Messiahship of Jesus that the Jewish exegetes seem finally to have repudiated the Messianic interpretation. They refused to admit that the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘almâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " could properly be translated “virgin” and fell back on one or other of the theories mentioned under (iii). The Christian Fathers on the other hand resolutely upheld the correctness of the LXX., although the post-Christian Greek versions of Aquila, Theodotion and Symmachus agree in rendering the word by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "νεᾶνις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The patristic view maintained an all but unquestioned ascendancy within the Church till the dawn of historical criticism in the eighteenth century, when it began to be recognised that on the philological question the Jews were right.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[35] See Mr F. P. Badham’s letter in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Academy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of 8 June, 1895.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To show that your perversity cannot change God's designs, which will be accomplished, whether you hear or whether you forbear. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"the Lord himself, of his own free will, unasked.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will give you a sign",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Signs\" were of various kinds. They might be actual miracles performed to attest a Divine commission (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:3-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or judgments of God, significative of his power and justice (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or memorials of something in the past (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:9, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or pledges of something still future. Signs of this last-mentioned kind might be miracles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 6:36-40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:8-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or prophetic announcements (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 19:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These last would only have the effect of signs on those who witnessed their accomplishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Behold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"A forewarning of a great event\" (Cheyne). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A virgin shall conceive.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is  questioned whether the word translated \"virgin,\" viz. '",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "almah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", has necessarily that meaning; but it is admitted that the meaning is borne out by every other place in which the word occurs m the Old Testament (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 30:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The LXX., writing two centuries before the birth of Christ, translate by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "παρθένος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The rendering \"virgin\" has the support of the best modern Hebraists, as Lowth, Gesenins, Ewald, Delitzsch, Kay. It is observed with reason that unless '",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "almah is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " translated \"virgin,\" there is no announcement made worthy of the grand prelude: \"The Lord himself shall give you a sign - Behold!\" The Hebrew, however, has not \"a virgin,\" but \"the virgin\" (and so the Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἡ παρθένος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which points to some special virgin, pro-eminent above all others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And shall call",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; better than the marginal rendering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thou shalt call",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was regarded as the privilege of a mother to determine her child's name (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:32-35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:6-13, 18-21, 24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), although formally the father gave it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:62",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 83). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Immanuel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Translated for us by St. Matthew (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as \"God with us\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μεθ ἡμῶν ὁ Θεός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:8, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "pc_st_rem",
        "text": "Isaiah 7:15 Verse 15. - Butter and honey shall he eat. His fare shall be of the simplest kind (comp. ver. 22). That he may know; rather, till he shall know (Rosenmüller); i.e. till he come to years of discretion. (The rendering of the Revisers of 1885, \"when he knoweth,\" is less satisfactory.) - Note on the general purport of the Immanuel prophecy. Few prophecies have been the subject of so much controversy, or called forth such a variety of exegesis, as this prophecy of Immanuel. Rosenmüller gives a list of twenty-eight authors who have written dissertations upon it, and himself adds a twenty-ninth. Yet the subject is far from being exhausted. It is still asked: (1) Were the mother and son persons belonging to the time of Isaiah himself, and if so, what persons? Or, (2) Were they the Virgin Mary and her Son Jesus? Or, (3) Had the prophecy a double fulfillment, first in certain persons who lived in Isaiah's time, and secondly in Jesus and his mother? I. The first theory is that of the Jewish commentators. Originally, they suggested that the mother was Abi, the wife of Ahaz (2 Kings 18:2), and the son Hezekiah, who delivered Judah from the Assyrian power (see Justin, 'Dial. cum Tryphon.,' p. 262). But this was early disproved by showing that, according to the numbers of Kings (2 Kings 16:2; 2 Kings 18:2), Hezekiah was at least nine years old in the first year of Ahaz, before which this prophecy could not have been delivered (Isaiah 7:1). The second suggestion made identified the mother with Isaiah's wife, the \"prophetess\" of Isaiah 8:3, and made the son a child of his, called actually Immanuel, or else his son Maher-shalal-hash-baz (Isaiah 8:1) under a symbolical designation. But ha-'almah, \"the virgin,\" would be a very strange title for Isaiah to have given his wife, and the rank assigned to Immanuel in Isaiah 8:8 would not suit any son of Isaiah's. It remains to regard the 'almah as \"some young woman actually present,\" name, rank, and position unknown, and Immanuel as her son, also otherwise unknown (Cheyne). But the  grand exordium, \"The Lord himself shall give you a sign - Behold!\" and the rank of Immanuel (Isaiah 8:8), are alike against this. II. The purely Messianic theory is maintained by Rosenmüller and Dr. Kay, but without any consideration of its difficulties. The birth of Christ was an event more than seven hundred years distant. In what sense and to what persons could it be a \"sign\" of the coming deliverance of the land from Rezin and Pekah? And, upon the purely Messianic theory, what is the meaning of ver. 16? Syria and Samaria were, in fact, crushed within a few years of the delivery of the prophecy. Why is their desolation put off, apparently, till the coming of the Messiah, and even till he has reached a certain age? Mr. Cheyne meets these difficulties by the startling statement that Isaiah expected the advent of the Messiah to synchronize with the Assyrian invasion, and consequently thought that before Rezin and Pekah were crushed he would have reached the age of discernment. But he does not seem to see that in this case the sigma was altogether disappointing and illusory. Time is an essential element of a prophecy which turns upon the word \"before\" (ver. 16). If this faith of Isaiah's disciples was aroused and  their hopes raised by the announcement that Immanuel was just about to be born (Mr. Cheyne translates, \"A virgin is with child\"), what would be the revulsion of feeling when no Immanuel appeared? III. May not the true account of the matter be that suggested by Bishop Lowth  - that the prophecy had a double bearing and a double fulfillment? \"The obvious and literal meaning of the prophecy is this,\" he says: \"that within the time that a young woman, now a virgin, should conceive and bring forth a child, and that child should arrive at such an age as to distinguish between good and evil, that is, within a few years, the enemies of Judah should be destroyed.\" But the prophecy was so worded, he adds, as to have a further meaning, which wan even \"the original design and principal intention of the prophet,\" viz. the Messianic one. All the expressions of the prophecy do not suit both its intentions  - some are selected with reference to the first, others with reference to the second fulfillment - but all suit one or the other, and some suit both. The first child may have received the name Immanuel (comp. Ittiel) from a faithful Jewish mother, who believed that God was with his people, whatever dangers threatened, and may have reached years of discretion about the time that Samaria was carried away captive. The second child is the true \"Immanuel,\" \"God with us,\" the king of Isaiah 8:8; it is his mother who is pointed at in the expression, \"the virgin,\" and on his account is the grand preamble; through him the people of God, the true Israel, is delivered from its spiritual enemies, sin and Satan - two kings who continually threaten it.   Isaiah 7:14Keil and Delitzsch Biblical Commentary on the Old Testament\"Therefore the Lord, He will give you a sign: Behold, the virgin conceives, and bears a son, and calls his name Immanuel. Butter and honey will he eat, at the time that he knows to refuse the evil and choose the good.\" In its form the prophecy reminds one of Genesis 16:11, \"Behold, thou art with child, and wilt bear a son, and call his name Ishmael.\" Here, however, the words are not addressed to the person about to bear the child, although Matthew gives this interpretation to the prophecy;(Note: Jerome discusses this diversity in a very impartial and intelligent manner, in his ep. ad Pammachium de optimo genere interpretandi.)for קראת is not the second person, but the third, and is synonymous with קראה (according to Ges. 74. Anm. 1), another form which is also met with in Genesis 33:11; Leviticus 25:21; Deuteronomy 31:29, and Psalm 118:23.(Note: The pointing makes a distinction between קראת (she calls) and קראת, as Genesis 16:11 should be pointed (thou callest); and Olshausen (35, b) is wrong in pronouncing the latter a mistake.)Moreover, the condition of pregnancy, which is here designated by the participial adjective הרה (cf., 2 Samuel 11:5), was not an already existing one in this instance, but (as in all probability also in Judges 13:5, cf., Judges 13:4) something future, as well as the act of bearing, since hinnēh is always used by Isaiah to introduce a future occurrence. This use of hinneh in Isaiah is a sufficient answer to Gesenius, Knobel, and others, who understand hâ‛almâh as referring to the young wife of the prophet himself, who was at that very time with child. But it is altogether improbable that the wife of the prophet himself should be intended. For if it were to her that he referred, he could hardly have expressed himself in a more ambiguous and unintelligible manner; and we cannot see why he should not much rather have said אשׁתּי or הנּביאה, to say nothing of the fact that there is no further allusion made to any son of the prophet of that name, and that a sign of this kind founded upon the prophet's own family affairs would have been one of a very precarious nature. And the meaning and use of the word ‛almâh are also at variance with this. For whilst bethulâh (from bâtthal, related to bâdal, to separate, sejungere) signifies a maiden living in seclusion in her parents' house and still a long way from matrimony, ‛almâh (from ‛âlam, related to Châlam, and possibly also to אלם, to be strong, full of vigour, or arrived at the age of puberty) is applied to one fully mature, and approaching the time of her marriage.(Note: On the development of the meanings of ‛âlam and Châlam, see Ges. Thes., and my Psychol. p. 282 (see also the commentary on Job 39:4). According to Jerome, alma was Punic also. In Arabic and Aramaean the diminutive form guleime, ‛alleimtah, was the favourite one, but in Syriac ‛alı̄mto (the ripened).)The two terms could both be applied to persons who were betrothed, and even to such as were married (Joel 2:16; Proverbs 30:19 : see Hitzig on these passages). It is also admitted that the idea of spotless virginity was not necessarily connected with ‛almâh (as in Genesis 24:43, cf., Genesis 24:16), since there are passages - such, for example, as Sol 6:8 - where it can hardly be distinguished from the Arabic surrı̄je; and a person who had a very young-looking wife might be said to have an ‛almah for his wife. But it is inconceivable that in a well-considered style, and one of religious earnestness, a woman who had been long married, like the prophet's own wife, could be called hâ‛almâh without any reserve.(Note: A young and newly-married wife might be called Callâh (as in Homer νύμφη  equals  nubilis and nupta; Eng. bride); and even in Homer a married woman, if young, is sometimes called κουριδίη ἄλοχος, but neither κούρη nor νεῆνις.)On the other hand, the expression itself warrants the assumption that by hâ‛almâh the prophet meant one of the ‛alâmoth of the king's harem (Luzzatto); and if we consider that the birth of the child was to take place, as the prophet foresaw, in the immediate future, his thoughts might very well have been fixed upon Abijah (Abi) bath-Zechariah (2 Kings 18:2; 2 Chronicles 29:1), who became the mother of king Hezekiah, to whom apparently the virtues of the mother descended, in marked contrast with the vices of his father. This is certainly possible. At the same time, it is also certain that the child who was to be born was the Messiah, and not a new Israel (Hofmann, Schriftbeweis, ii. 1, 87, 88); that is to say, that he was no other than that \"wonderful\" heir of the throne of David, whose birth is hailed with joy in chapter 9, where even commentators like Knobel are obliged to admit that the Messiah is meant. It was the Messiah whom the prophet saw here as about to be born, then again in chapter 9 as actually born, and again in chapter 11 as reigning - an indivisible triad of consolatory images in three distinct states, interwoven with the three stages into which the future history of the nation unfolded itself in the prophet's view. If, therefore, his eye was directed towards the Abijah mentioned, he must have regarded her as the future mother of the Messiah, and her son as the future Messiah. Now it is no doubt true, that in the course of the sacred history Messianic expectations were often associated with individuals who did not answer to them, so that the Messianic prospect was moved further into the future; and it is not only possible, but even probable, and according to many indications an actual fact, that the believing portion of the nation did concentrate their Messianic wishes and hopes for a long time upon Hezekiah; but even if Isaiah's prophecy may have evoked such human conjectures and expectations, through the measure of time which it laid down, it would not be a prophecy at all, if it rested upon no better foundation than this, which would be the case if Isaiah had a particular maiden of his own day in his mind at the time. Are we to conclude, then, that the prophet did not refer to any one individual, but that the \"virgin\" was a personification of the house of David? This view, which Hofmann propounded, and Stier appropriated, and which Ebrard has revived, notwithstanding the fact that Hofmann relinquished it, does not help us over the difficulty; for we should expect in that case to find \"daughter of Zion,\" or something of the kind, since the term \"virgin\" is altogether unknown in a personification of this kind, and the house of David, as the prophet knew it, was by no means worthy of such an epithet. No other course is left, therefore, than to assume that whilst, on the one hand, the prophet meant by \"the virgin\" a maiden belonging to the house of David, which the Messianic character of the prophecy requires; on the other hand, he neither thought of any particular maiden, nor associated the promised conception with any human father, who could not have been any other than Ahaz. The reference is the same as in Micah 5:3 (\"she which travaileth,\" yōlēdah). The objection that hâ‛almâh (the virgin) cannot be a person belonging to the future, on account of the article (Hofmann, p. 86), does not affect the true explanation: it was the virgin whom the spirit of prophecy brought before the prophet's mind, and who, although he could not give her name, stood before him as singled out for an extraordinary end (compare the article in hanna‛ar in Numbers 11:27 etc.). With what exalted dignity this mother appeared to him to be invested, is evident from the fact that it is she who gives the name to her son, and that the name Immanuel. This name sounds full of promise. But if we look at the expression \"therefore,\" and the circumstance which occasioned it, the sign cannot have been intended as a pure or simple promise. We naturally expect, first, that it will be an extraordinary fact which the prophet foretells; and secondly, that it will be a fact with a threatening front. Now a humiliation of the house of David was indeed involved in the fact that the God of whom it would know nothing would nevertheless mould its future history, as the emphatic הוּא implies, He (αὐτός, the Lord Himself), by His own impulse and unfettered choice. Moreover, this moulding of the future could not possibly be such an one as was desired, but would of necessity be as full of threatening to the unbelieving house of David as it was full of promise to the believers in Israel. And the threatening character of the \"sign\" is not to be sought for exclusively in Isaiah 7:15, since both the expressions \"therefore\" (lâcēn) and \"behold\" (hinnēh) place the main point of the sign in Isaiah 7:14, whilst the introduction of Isaiah 7:15 without any external connection is a clear proof that what is stated in Isaiah 7:14 is the chief thing, and not the reverse. But the only thing in Isaiah 7:14 which indicated any threatening element in the sign in question, must have been the fact that it would not be by Ahaz, or by a son of Ahaz, or by the house of David generally, which at that time had hardened itself against God, that God would save His people, but that a nameless maiden of low rank, whom God had singled out and now showed to the prophet in the mirror of His counsel, would give birth to the divine deliverer of His people in the midst of the approaching tribulations, which was a sufficient intimation that He who was to be the pledge of Judah's continuance would not arrive without the present degenerate house of David, which had brought Judah to the brink of ruin, being altogether set aside. But the further question arises here, What constituted the extraordinary character of the fact here announced? It consisted in the fact, that, according to Isaiah 9:5, Immanuel Himself was to be a פּלא (wonder or wonderful). He would be God in corporeal self-manifestation, and therefore a \"wonder\" as being a superhuman person. We should not venture to assert this if it went beyond the line of Old Testament revelation, but the prophet asserts it himself in Isaiah 9:5 (cf., Isaiah 10:21): his words are as clear as possible; and we must not make them obscure, to favour any preconceived notions as to the development of history. The incarnation of Deity was unquestionably a secret that was not clearly unveiled in the Old Testament, but the veil was not so thick but that some rays could pass through. Such a ray, directed by the spirit of prophecy into the mind of the prophet, was the prediction of Immanuel. But if the Messiah was to be Immanuel in this sense, that He would Himself be El (God), as the prophet expressly affirms, His birth must also of necessity be a wonderful or miraculous one. The prophet does not affirm, indeed, that the \"‛almâh,\" who had as yet known no man, would give birth to Immanuel without this taking place, so that he could not be born of the house of David as well as into it, but be a gift of Heaven itself; but this \"‛almâh\" or virgin continued throughout an enigma in the Old Testament, stimulating \"inquiry\" (1 Peter 1:10-12), and waiting for the historical solution. Thus the sign in question was, on the one hand, a mystery glaring in the most threatening manner upon the house of David; and, on the other hand, a mystery smiling with which consolation upon the prophet and all believers, and couched in these enigmatical terms, in order that those who hardened themselves might not understand it, and that believers might increasingly long to comprehend its meaning. In Isaiah 7:15 the threatening element of Isaiah 7:14 becomes the predominant one. It would not be so, indeed, if \"butter (thickened milk) and honey\" were mentioned here as the ordinary food of the tenderest age of childhood (as Gesenius, Hengstenberg, and others suppose). But the reason afterwards assigned in Isaiah 7:16, Isaiah 7:17, teaches the very opposite. Thickened milk and honey, the food of the desert, would be the only provisions furnished by the land at the time in which the ripening youth of Immanuel would fall. חמאה (from המא, to be thick) is a kind of butter which is still prepared by nomads by shaking milk in skins. It may probably include the cream, as the Arabic semen signifies both, but not the curds or cheese, the name of which (at least the more accurate name) if gebı̄nâh. The object to ידע is expressed in Isaiah 7:15, Isaiah 7:16 by infinitive absolutes (compare the more usual mode of expression in Isaiah 8:4). The Lamed prefixed to the verb does not mean \"until\" (Ges. 131, 1), for Lamed is never used as so definite an indication of the terminus ad quem; the meaning is either \"towards the time when he understands\" (Amos 4:7, cf., Leviticus 24:12, \"to the end that\"), or about the time, at the time when he understands (Isaiah 10:3; Genesis 8:11; Job 24:14). This kind of food would coincide in time with his understanding, that is to say, would run parallel to it. Incapacity to distinguish between good and bad is characteristic of early childhood (Deuteronomy 1:39, etc.), and also of old age when it relapses into childish ways (2 Samuel 19:36). The commencement of the capacity to understand is equivalent to entering into the so-called years of discretion - the riper age of free and conscious self-determination. By the time that Immanuel reached this age, all the blessings of the land would have been so far reduced, that from a land full of luxuriant corn-fields and vineyards, it would have become a large wooded pasture-ground, supplying milk and honey, and nothing more. A thorough devastation of the land is therefore the reason for this limitation to the simplest, and, when compared with the fat of wheat and the cheering influence of wine, most meagre and miserable food. And this is the ground assigned in Isaiah 7:16, Isaiah 7:17. Two successive and closely connected events would occasion this universal desolation. LinksIsaiah 7:14 InterlinearIsaiah 7:14 Parallel TextsIsaiah 7:14 NIVIsaiah 7:14 NLTIsaiah 7:14 ESVIsaiah 7:14 NASBIsaiah 7:14 KJVIsaiah 7:14 Bible AppsIsaiah 7:14 ParallelIsaiah 7:14 Biblia ParalelaIsaiah 7:14 Chinese BibleIsaiah 7:14 French BibleIsaiah 7:14 German BibleBible Hub",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Isaiah 7:15 ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_sub_title",
            "text": "Verse 15.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "Butter and honey shall he eat",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His fare shall be of the simplest kind (comp. ver. 22). ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "That he may know",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "till he shall know",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Rosenmüller); ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " till he come to years of discretion. (The rendering of the Revisers of 1885, \"when he knoweth,\" is less satisfactory.)",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "- Note on the general purport of the Immanuel prophecy",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Few prophecies have been the subject of so much controversy, or called forth such a variety of exegesis, as this prophecy of Immanuel. Rosenmüller gives a list of twenty-eight authors who have written dissertations upon it, and himself adds a twenty-ninth. Yet the subject is far from being exhausted. It is still asked: ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "note_emph",
            "text": "(1)",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Were the mother and son persons belonging to the time of Isaiah himself, and if so, what persons? Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "note_emph",
            "text": "(2)",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Were they the Virgin Mary and her Son Jesus? Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "note_emph",
            "text": "(3)",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Had the prophecy a double fulfillment, first in certain persons who lived in Isaiah's time, and secondly in Jesus and his mother? ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_subheading",
            "text": "I.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The first theory is that of the Jewish commentators. Originally, they suggested that the mother was Abi, the wife of Ahaz (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the son Hezekiah, who delivered Judah from the Assyrian power (see Justin, 'Dial. cum Tryphon.,' p. 262). But this was early disproved by showing that, according to the numbers of Kings (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), Hezekiah was at least nine years old in the first year of Ahaz, before which this prophecy could not have been delivered (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The second suggestion made identified the mother with Isaiah's wife, the \"prophetess\" of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and made the son a child of his, called actually Immanuel, or else his son Maher-shalal-hash-baz (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") under a symbolical designation. But ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "ha-'almah",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"the virgin,\" would be a very strange title for Isaiah to have given his wife, and the rank assigned to Immanuel in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " would not suit any son of Isaiah's. It remains to regard the '",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "almah",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as \"some young woman actually present,\" name, rank, and position unknown, and Immanuel as her son, also otherwise unknown (Cheyne). But the  grand exordium, \"The Lord himself shall give you a sign - Behold!\" and the rank of Immanuel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), are alike against this. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_subheading",
            "text": "II.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The purely Messianic theory is maintained by Rosenmüller and Dr. Kay, but without any consideration of its difficulties. The birth of Christ was an event more than seven hundred years distant. In what sense and to what persons could it be a \"sign\" of the coming deliverance of the land from Rezin and Pekah? And, upon the purely Messianic theory, what is the meaning of ver. 16? Syria and Samaria were, in fact, crushed within a few years of the delivery of the prophecy. Why is their desolation put off, apparently, till the coming of the Messiah, and even till he has reached a certain age? Mr. Cheyne meets these difficulties by the startling statement that Isaiah expected the advent of the Messiah to synchronize with the Assyrian invasion, and consequently thought that before Rezin and Pekah were crushed he would have reached the age of discernment. But he does not seem to see that in this case the sigma was altogether disappointing and illusory. Time is an essential element of a prophecy which turns upon the word \"before\" (ver. 16). If this faith of Isaiah's disciples was aroused and  their hopes raised by the announcement that Immanuel was just about to be born (Mr. Cheyne translates, \"A virgin ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with child\"), what would be the revulsion of feeling when no Immanuel appeared? ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_subheading",
            "text": "III.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " May not the true account of the matter be that suggested by Bishop Lowth  - that the prophecy had a double bearing and a double fulfillment? \"The obvious and literal meaning of the prophecy is this,\" he says: \"that within the time that a young woman, now a virgin, should conceive and bring forth a child, and that child should arrive at such an age as to distinguish between good and evil, that is, within a few years, the enemies of Judah should be destroyed.\" But the prophecy was so worded, he adds, as to have a further meaning, which wan even \"the original design and ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "principal",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " intention of the prophet,\" viz. the Messianic one. All the expressions of the prophecy do not suit both its intentions  - some are selected with reference to the first, others with reference to the second fulfillment - but all suit one or the other, and some suit both. The first child may have received the name Immanuel (comp. Ittiel) from a faithful Jewish mother, who believed that God was with his people, whatever dangers threatened, and may have reached years of discretion about the time that Samaria was carried away captive. The second child is the true \"Immanuel,\" \"God with us,\" the king of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it is his mother who is pointed at in the expression, \"the virgin,\" and on his account is the grand preamble; through him the people of God, the true Israel, is delivered from its spiritual enemies, sin and Satan - two kings who continually threaten it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Isaiah 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Keil and Delitzsch Biblical Commentary on the Old Testament",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"Therefore the Lord, He will give you a sign: Behold, the virgin conceives, and bears a son, and calls his name Immanuel. Butter and honey will he eat, at the time that he knows to refuse the evil and choose the good.\" In its form the prophecy reminds one of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Behold, thou art with child, and wilt bear a son, and call his name Ishmael.\" Here, however, the words are not addressed to the person about to bear the child, although Matthew gives this interpretation to the prophecy;",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(Note: Jerome discusses this diversity in a very impartial and intelligent manner, in his ep. ad Pammachium de optimo genere interpretandi.)",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "for קראת is not the second person, but the third, and is synonymous with קראה (according to Ges. 74. Anm. 1), another form which is also met with in Genesis 33:11; Leviticus 25:21; Deuteronomy 31:29, and Psalm 118:23.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(Note: The pointing makes a distinction between קראת (she calls) and קראת, as Genesis 16:11 should be pointed (thou callest); and Olshausen (35, b) is wrong in pronouncing the latter a mistake.)",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Moreover, the condition of pregnancy, which is here designated by the participial adjective הרה (cf., 2 Samuel 11:5), was not an already existing one in this instance, but (as in all probability also in Judges 13:5, cf., Judges 13:4) something future, as well as the act of bearing, since hinnēh is always used by Isaiah to introduce a future occurrence. This use of hinneh in Isaiah is a sufficient answer to Gesenius, Knobel, and others, who understand hâ‛almâh as referring to the young wife of the prophet himself, who was at that very time with child. But it is altogether improbable that the wife of the prophet himself should be intended. For if it were to her that he referred, he could hardly have expressed himself in a more ambiguous and unintelligible manner; and we cannot see why he should not much rather have said אשׁתּי or הנּביאה, to say nothing of the fact that there is no further allusion made to any son of the prophet of that name, and that a sign of this kind founded upon the prophet's own family affairs would have been one of a very precarious nature. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "And the meaning and use of the word ‛almâh are also at variance with this. For whilst bethulâh (from bâtthal, related to bâdal, to separate, sejungere) signifies a maiden living in seclusion in her parents' house and still a long way from matrimony, ‛almâh (from ‛âlam, related to Châlam, and possibly also to אלם, to be strong, full of vigour, or arrived at the age of puberty) is applied to one fully mature, and approaching the time of her marriage.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(Note: On the development of the meanings of ‛âlam and Châlam, see Ges. Thes., and my Psychol. p. 282 (see also the commentary on Job 39:4). According to Jerome, alma was Punic also. In Arabic and Aramaean the diminutive form guleime, ‛alleimtah, was the favourite one, but in Syriac ‛alı̄mto (the ripened).)",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "The two terms could both be applied to persons who were betrothed, and even to such as were married (Joel 2:16; Proverbs 30:19 : see Hitzig on these passages). It is also admitted that the idea of spotless virginity was not necessarily connected with ‛almâh (as in Genesis 24:43, cf., Genesis 24:16), since there are passages - such, for example, as Sol 6:8 - where it can hardly be distinguished from the Arabic surrı̄je; and a person who had a very young-looking wife might be said to have an ‛almah for his wife. But it is inconceivable that in a well-considered style, and one of religious earnestness, a woman who had been long married, like the prophet's own wife, could be called hâ‛almâh without any reserve.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(Note: A young and newly-married wife might be called Callâh (as in Homer νύμφη  equals  nubilis and nupta; Eng. bride); and even in Homer a married woman, if young, is sometimes called κουριδίη ἄλοχος, but neither κούρη nor νεῆνις.)",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "On the other hand, the expression itself warrants the assumption that by hâ‛almâh the prophet meant one of the ‛alâmoth of the king's harem (Luzzatto); and if we consider that the birth of the child was to take place, as the prophet foresaw, in the immediate future, his thoughts might very well have been fixed upon Abijah (Abi) bath-Zechariah (2 Kings 18:2; 2 Chronicles 29:1), who became the mother of king Hezekiah, to whom apparently the virtues of the mother descended, in marked contrast with the vices of his father. This is certainly possible. At the same time, it is also certain that the child who was to be born was the Messiah, and not a new Israel (Hofmann, Schriftbeweis, ii. 1, 87, 88); that is to say, that he was no other than that \"wonderful\" heir of the throne of David, whose birth is hailed with joy in chapter 9, where even commentators like Knobel are obliged to admit that the Messiah is meant. It was the Messiah whom the prophet saw here as about to be born, then again in chapter 9 as actually born, and again in chapter 11 as reigning - an indivisible triad of consolatory images in three distinct states, interwoven with the three stages into which the future history of the nation unfolded itself in the prophet's view. If, therefore, his eye was directed towards the Abijah mentioned, he must have regarded her as the future mother of the Messiah, and her son as the future Messiah. Now it is no doubt true, that in the course of the sacred history Messianic expectations were often associated with individuals who did not answer to them, so that the Messianic prospect was moved further into the future; and it is not only possible, but even probable, and according to many indications an actual fact, that the believing portion of the nation did concentrate their Messianic wishes and hopes for a long time upon Hezekiah; but even if Isaiah's prophecy may have evoked such human conjectures and expectations, through the measure of time which it laid down, it would not be a prophecy at all, if it rested upon no better foundation than this, which would be the case if Isaiah had a particular maiden of his own day in his mind at the time. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Are we to conclude, then, that the prophet did not refer to any one individual, but that the \"virgin\" was a personification of the house of David? This view, which Hofmann propounded, and Stier appropriated, and which Ebrard has revived, notwithstanding the fact that Hofmann relinquished it, does not help us over the difficulty; for we should expect in that case to find \"daughter of Zion,\" or something of the kind, since the term \"virgin\" is altogether unknown in a personification of this kind, and the house of David, as the prophet knew it, was by no means worthy of such an epithet. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "No other course is left, therefore, than to assume that whilst, on the one hand, the prophet meant by \"the virgin\" a maiden belonging to the house of David, which the Messianic character of the prophecy requires; on the other hand, he neither thought of any particular maiden, nor associated the promised conception with any human father, who could not have been any other than Ahaz. The reference is the same as in Micah 5:3 (\"she which travaileth,\" yōlēdah). The objection that hâ‛almâh (the virgin) cannot be a person belonging to the future, on account of the article (Hofmann, p. 86), does not affect the true explanation: it was the virgin whom the spirit of prophecy brought before the prophet's mind, and who, although he could not give her name, stood before him as singled out for an extraordinary end (compare the article in hanna‛ar in Numbers 11:27 etc.). With what exalted dignity this mother appeared to him to be invested, is evident from the fact that it is she who gives the name to her son, and that the name Immanuel. This name sounds full of promise. But if we look at the expression \"therefore,\" and the circumstance which occasioned it, the sign cannot have been intended as a pure or simple promise. We naturally expect, first, that it will be an extraordinary fact which the prophet foretells; and secondly, that it will be a fact with a threatening front. Now a humiliation of the house of David was indeed involved in the fact that the God of whom it would know nothing would nevertheless mould its future history, as the emphatic הוּא implies, He (αὐτός, the Lord Himself), by His own impulse and unfettered choice. Moreover, this moulding of the future could not possibly be such an one as was desired, but would of necessity be as full of threatening to the unbelieving house of David as it was full of promise to the believers in Israel. And the threatening character of the \"sign\" is not to be sought for exclusively in Isaiah 7:15, since both the expressions \"therefore\" (lâcēn) and \"behold\" (hinnēh) place the main point of the sign in Isaiah 7:14, whilst the introduction of Isaiah 7:15 without any external connection is a clear proof that what is stated in Isaiah 7:14 is the chief thing, and not the reverse. But the only thing in Isaiah 7:14 which indicated any threatening element in the sign in question, must have been the fact that it would not be by Ahaz, or by a son of Ahaz, or by the house of David generally, which at that time had hardened itself against God, that God would save His people, but that a nameless maiden of low rank, whom God had singled out and now showed to the prophet in the mirror of His counsel, would give birth to the divine deliverer of His people in the midst of the approaching tribulations, which was a sufficient intimation that He who was to be the pledge of Judah's continuance would not arrive without the present degenerate house of David, which had brought Judah to the brink of ruin, being altogether set aside. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "But the further question arises here, What constituted the extraordinary character of the fact here announced? It consisted in the fact, that, according to Isaiah 9:5, Immanuel Himself was to be a פּלא (wonder or wonderful). He would be God in corporeal self-manifestation, and therefore a \"wonder\" as being a superhuman person. We should not venture to assert this if it went beyond the line of Old Testament revelation, but the prophet asserts it himself in Isaiah 9:5 (cf., Isaiah 10:21): his words are as clear as possible; and we must not make them obscure, to favour any preconceived notions as to the development of history. The incarnation of Deity was unquestionably a secret that was not clearly unveiled in the Old Testament, but the veil was not so thick but that some rays could pass through. Such a ray, directed by the spirit of prophecy into the mind of the prophet, was the prediction of Immanuel. But if the Messiah was to be Immanuel in this sense, that He would Himself be El (God), as the prophet expressly affirms, His birth must also of necessity be a wonderful or miraculous one. The prophet does not affirm, indeed, that the \"‛almâh,\" who had as yet known no man, would give birth to Immanuel without this taking place, so that he could not be born of the house of David as well as into it, but be a gift of Heaven itself; but this \"‛almâh\" or virgin continued throughout an enigma in the Old Testament, stimulating \"inquiry\" (1 Peter 1:10-12), and waiting for the historical solution. Thus the sign in question was, on the one hand, a mystery glaring in the most threatening manner upon the house of David; and, on the other hand, a mystery smiling with which consolation upon the prophet and all believers, and couched in these enigmatical terms, in order that those who hardened themselves might not understand it, and that believers might increasingly long to comprehend its meaning. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "In Isaiah 7:15 the threatening element of Isaiah 7:14 becomes the predominant one. It would not be so, indeed, if \"butter (thickened milk) and honey\" were mentioned here as the ordinary food of the tenderest age of childhood (as Gesenius, Hengstenberg, and others suppose). But the reason afterwards assigned in Isaiah 7:16, Isaiah 7:17, teaches the very opposite. Thickened milk and honey, the food of the desert, would be the only provisions furnished by the land at the time in which the ripening youth of Immanuel would fall. חמאה (from המא, to be thick) is a kind of butter which is still prepared by nomads by shaking milk in skins. It may probably include the cream, as the Arabic semen signifies both, but not the curds or cheese, the name of which (at least the more accurate name) if gebı̄nâh. The object to ידע is expressed in Isaiah 7:15, Isaiah 7:16 by infinitive absolutes (compare the more usual mode of expression in Isaiah 8:4). The Lamed prefixed to the verb does not mean \"until\" (Ges. 131, 1), for Lamed is never used as so definite an indication of the terminus ad quem; the meaning is either \"towards the time when he understands\" (Amos 4:7, cf., Leviticus 24:12, \"to the end that\"), or about the time, at the time when he understands (Isaiah 10:3; Genesis 8:11; Job 24:14). This kind of food would coincide in time with his understanding, that is to say, would run parallel to it. Incapacity to distinguish between good and bad is characteristic of early childhood (Deuteronomy 1:39, etc.), and also of old age when it relapses into childish ways (2 Samuel 19:36). The commencement of the capacity to understand is equivalent to entering into the so-called years of discretion - the riper age of free and conscious self-determination. By the time that Immanuel reached this age, all the blessings of the land would have been so far reduced, that from a land full of luxuriant corn-fields and vineyards, it would have become a large wooded pasture-ground, supplying milk and honey, and nothing more. A thorough devastation of the land is therefore the reason for this limitation to the simplest, and, when compared with the fat of wheat and the cheering influence of wine, most meagre and miserable food. And this is the ground assigned in Isaiah 7:16, Isaiah 7:17. Two successive and closely connected events would occasion this universal desolation. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Links",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 Interlinear",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 Parallel Texts",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 NIV",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 NLT",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 ESV",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 NASB",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 KJV",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 Bible Apps",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 Parallel",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 Biblia Paralela",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 Chinese Bible",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 French Bible",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14 German Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Bible Hub",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  }
]