[{"num":8,"verse":"and Sha’ul gave his approval to his murder."},{"num":2,"verse":"Some godly men buried Stephen and mourned him deeply. "},{"num":3,"verse":"But Sha’ul set out to destroy the Messianic Community — entering house after house, he dragged off both men and women and handed them over to be put in prison. "},{"num":4,"verse":"However, those who were scattered announced the Good News of the Word wherever they went."},{"num":5,"verse":"Now Philip went down to a city in Shomron and was proclaiming the Messiah to them; "},{"num":6,"verse":"and the crowds were paying close attention to what Philip said, as they heard and saw the miraculous signs he was doing. "},{"num":7,"verse":"For many people were having unclean spirits driven out of them, shrieking; also many paralytics and crippled persons were being healed; "},{"num":8,"verse":"so that there was great joy in that city."},{"num":9,"verse":"But there was a man named Shim‘on in the city who for some time had been practicing magic and astonishing the nation of Shomron, claiming to be somebody great. "},{"num":10,"verse":"Everyone gave heed to him, from the lowest to the highest, saying, “This man is the power of God called ‘The Great Power’.” "},{"num":11,"verse":"They followed him because for a considerable time he had amazed them with his magic."},{"num":12,"verse":"But when they came to believe Philip, as he announced the Good News concerning the Kingdom of God and the name of Yeshua the Messiah, they were immersed, both men and women. "},{"num":13,"verse":"Moreover, Shim‘on himself came to believe; and after being immersed, he attached himself closely to Philip; and he was amazed as he saw the miraculous signs and great works of power that kept taking place."},{"num":14,"verse":"When the emissaries in Yerushalayim heard that Shomron had received the Word of God, they sent them Kefa and Yochanan, "},{"num":15,"verse":"who came down and prayed for them, that they might receive the Ruach HaKodesh. "},{"num":16,"verse":"For until then he had not come upon any of them; they had only been immersed into the name of the Lord Yeshua. "},{"num":17,"verse":"Then, as Kefa and Yochanan placed their hands on them, they received the Ruach HaKodesh."},{"num":18,"verse":"Shim‘on saw that the Spirit was given when the emissaries placed their hands on them, and he offered them money. "},{"num":19,"verse":"“Give this power to me, too,” he said, “so that whoever I place my hands on will receive the Ruach HaKodesh.” "},{"num":20,"verse":"But Kefa said to him, “Your silver go to ruin — and you with it, for thinking the free gift of God can be bought! "},{"num":21,"verse":"You have no part at all in this matter; because in the eyes of God, your heart is crooked. "},{"num":22,"verse":"So repent of this wickedness of yours, and pray to the Lord. Perhaps you will yet be forgiven for holding such a thought in your heart. "},{"num":23,"verse":"For I see that you are extremely bitter and completely under the control of sin!” "},{"num":24,"verse":"Shim‘on answered, “Pray to the Lord for me, so that none of the things you have spoken about will happen to me.”"},{"num":25,"verse":"Then, after giving a thorough witness and speaking the Word of the Lord, Kefa and Yochanan started back to Yerushalayim, announcing the Good News to many villages in Shomron."},{"num":26,"verse":"An angel of Adonai said to Philip, “Get up, and go southward on the road that goes down from Yerushalayim to ‘Azah, the desert road.” "},{"num":27,"verse":"So he got up and went. On his way, he caught sight of an Ethiopian, a eunuch who was minister in charge of all the treasure of the Kandake, or queen, of Ethiopia. He had been to Yerushalayim to worship; "},{"num":28,"verse":"and now, as he was returning home, he was sitting in his chariot, reading the prophet Yesha‘yahu. "},{"num":29,"verse":"The Spirit said to Philip, “Go over to this chariot, and stay close to it.” "},{"num":30,"verse":"As Philip ran up, he heard the Ethiopian reading from Yesha‘yahu the prophet. “Do you understand what you’re reading?” he asked. "},{"num":31,"verse":"“How can I,” he said, “unless someone explains it to me?” And he invited Philip to climb up and sit with him."},{"num":32,"verse":"Now the portion of the Tanakh that he was reading was this:"},{"num":34,"verse":"The eunuch said to Philip, “Here’s my question to you — is the prophet talking about himself or someone else?” "},{"num":35,"verse":"Then Philip started to speak — beginning with that passage, he went on to tell him the Good News about Yeshua."},{"num":36,"verse":"As they were going down the road, they came to some water; and the eunuch said, “Look! Here’s some water! Is there any reason why I shouldn’t be immersed?” "},{"num":37,"verse":" "},{"num":38,"verse":"He ordered the chariot to stop; then both Philip and the eunuch went down into the water, and Philip immersed him. "},{"num":39,"verse":"When they came up out of the water, the Spirit of the Lord snatched Philip away. The eunuch saw no more of him, because he continued on his way — full of joy. "},{"num":40,"verse":"But Philip showed up at Ashdod and continued proclaiming the Good News as he went through all the towns until he came to Caesarea."}]