[{"num":3,"verse":"See what love the Father has lavished on us in letting us be called God’s children! For that is what we are. The reason the world does not know us is that it has not known him. "},{"num":2,"verse":"Dear friends, we are God’s children now; and it has not yet been made clear what we will become. We do know that when he appears, we will be like him; because we will see him as he really is."},{"num":3,"verse":"And everyone who has this hope in him continues purifying himself, since God is pure. "},{"num":4,"verse":"Everyone who keeps sinning is violating Torah — indeed, sin is violation of Torah. "},{"num":5,"verse":"You know that he appeared in order to take away sins, and that there is no sin in him. "},{"num":6,"verse":"So no one who remains united with him continues sinning; everyone who does continue sinning has neither seen him nor known him."},{"num":7,"verse":"Children, don’t let anyone deceive you — it is the person that keeps on doing what is right who is righteous, just as God is righteous. "},{"num":8,"verse":"The person who keeps on sinning is from the Adversary, because from the very beginning the Adversary has kept on sinning. It was for this very reason that the Son of God appeared, to destroy these doings of the Adversary. "},{"num":9,"verse":"No one who has God as his Father keeps on sinning, because the seed planted by God remains in him. That is, he cannot continue sinning, because he has God as his Father. "},{"num":10,"verse":"Here is how one can distinguish clearly between God’s children and those of the Adversary: everyone who does not continue doing what is right is not from God."},{"num":11,"verse":"For this is the message which you have heard from the beginning: that we should love each other "},{"num":12,"verse":"and not be like Kayin, who was from the Evil One and murdered his own brother. Why did he murder him? Because his own actions were evil, and his brother’s were righteous. "},{"num":13,"verse":"Don’t be amazed, brothers, if the world hates you. "},{"num":14,"verse":"We, for our part, know that we have passed from death to life because we keep loving the brothers. The person who fails to keep on loving is still under the power of death. "},{"num":15,"verse":"Everyone who hates his brother is a murderer, and you know that no murderer has eternal life in him."},{"num":16,"verse":"The way that we have come to know love is through his having laid down his life for us. And we ought to lay down our lives for the brothers! "},{"num":17,"verse":"If someone has worldly possessions and sees his brother in need, yet closes his heart against him, how can he be loving God? "},{"num":18,"verse":"Children, let us love not with words and talk, but with actions and in reality!"},{"num":19,"verse":"Here is how we will know that we are from the truth and will set our hearts at rest in his presence: "},{"num":20,"verse":"if our hearts know something against us, God is greater than our hearts, and he knows everything. "},{"num":21,"verse":"Dear friends, if our hearts know nothing against us, we have confidence in approaching God; "},{"num":22,"verse":"then, whatever we ask for, we receive from him; because we are obeying his commands and doing the things that please him."},{"num":23,"verse":"This is his command: that we are to trust in the person and power of his Son Yeshua the Messiah and to keep loving one another, just as he commanded us. "},{"num":24,"verse":"Those who obey his commands remain united with him and he with them."}]