[{"num":16,"verse":"“I have told you these things so that you won’t be caught by surprise. "},{"num":2,"verse":"They will ban you from the synagogue; in fact, the time will come when anyone who kills you will think he is serving God! "},{"num":3,"verse":"They will do these things because they have understood neither the Father nor me. "},{"num":4,"verse":"But I have told you this, so that when the time comes for it to happen, you will remember that I told you. I didn’t tell you this at first, because I was with you. "},{"num":5,"verse":"But now I am going to the One who sent me."},{"num":6,"verse":"Instead, because I have said these things to you, you are overcome with grief. "},{"num":7,"verse":"But I tell you the truth, it is to your advantage that I go away; for if I don’t go away, the comforting Counselor will not come to you. However, if I do go, I will send him to you."},{"num":8,"verse":"“When he comes, he will show that the world is wrong about sin, about righteousness and about judgment — "},{"num":9,"verse":"about sin, in that people don’t put their trust in me; "},{"num":10,"verse":"about righteousness, in that I am going to the Father and you will no longer see me; "},{"num":11,"verse":"about judgment, in that the ruler of this world has been judged."},{"num":12,"verse":"“I still have many things to tell you, but you can’t bear them now. "},{"num":13,"verse":"However, when the Spirit of Truth comes, he will guide you into all the truth; for he will not speak on his own initiative but will say only what he hears. He will also announce to you the events of the future. "},{"num":14,"verse":"He will glorify me, because he will receive from what is mine and announce it to you. "},{"num":15,"verse":"Everything the Father has is mine; this is why I said that he receives from what is mine and will announce it to you."},{"num":16,"verse":"“In a little while, you will see me no more; then, a little while later, you will see me.” "},{"num":17,"verse":"At this, some of the talmidim said to one another, “What is this that he’s telling us, ‘In a little while, you won’t see me; then, a little while later, you will see me’? and, ‘I am going to the Father’?” "},{"num":18,"verse":"They went on saying, “What is this ‘little while’? We don’t understand what he’s talking about.”"},{"num":19,"verse":"Yeshua knew that they wanted to ask him, so he said to them, “Are you asking each other what I meant by saying, ‘In a little while, you won’t see me; and then, a little while later, you will see me’? "},{"num":20,"verse":"Yes, it’s true. I tell you that you will sob and mourn, and the world will rejoice; you will grieve, but your grief will turn to joy. "},{"num":21,"verse":"When a woman is giving birth, she is in pain; because her time has come. But when the baby is born, she forgets her suffering out of joy that a child has come into the world. "},{"num":22,"verse":"So you do indeed feel grief now, but I am going to see you again. Then your hearts will be full of joy, and no one will take your joy away from you."},{"num":23,"verse":"“When that day comes, you won’t ask anything of me! Yes, indeed! I tell you that whatever you ask from the Father, he will give you in my name. "},{"num":24,"verse":"Till now you haven’t asked for anything in my name. Keep asking, and you will receive, so that your joy may be complete."},{"num":25,"verse":"“I have said these things to you with the help of illustrations; however, a time is coming when I will no longer speak indirectly but will talk about the Father in plain language. "},{"num":26,"verse":"When that day comes, you will ask in my name. I am not telling you that I will pray to the Father on your behalf, "},{"num":27,"verse":"for the Father himself loves you, because you have loved me and have believed that I came from God."},{"num":28,"verse":"“I came from the Father and have come into the world; again, I am leaving the world and returning to the Father.”"},{"num":29,"verse":"The talmidim said to him, “Look, you’re talking plainly right now, you’re not speaking indirectly at all. "},{"num":30,"verse":"Now we know that you know everything, and that you don’t need to have people put their questions into words. This makes us believe that you came from God.”"},{"num":31,"verse":"Yeshua answered, “Now you do believe. "},{"num":32,"verse":"But a time is coming — indeed it has come already — when you will be scattered, each one looking out for himself; and you will leave me all alone. Yet I am not alone; because the Father is with me."},{"num":33,"verse":"“I have said these things to you so that, united with me, you may have shalom. In the world, you have tsuris. But be brave! I have conquered the world!”"}]