[{"num":16,"verse":"“I have told you these things so that you won’t abandon your faith."},{"num":2,"verse":"For you will be expelled from the synagogues, and the time is coming when those who kill you will think they are doing a holy service for God."},{"num":3,"verse":"This is because they have never known the Father or me."},{"num":4,"verse":"Yes, I’m telling you these things now, so that when they happen, you will remember my warning. I didn’t tell you earlier because I was going to be with you for a while longer."},{"header":"The Work of the Holy Spirit"},{"num":5,"verse":"“But now I am going away to the one who sent me, and not one of you is asking where I am going."},{"num":6,"verse":"Instead, you grieve because of what I’ve told you."},{"num":7,"verse":"But in fact, it is best for you that I go away, because if I don’t, the Advocate won’t come. If I do go away, then I will send him to you."},{"num":8,"verse":"And when he comes, he will convict the world of its sin, and of God’s righteousness, and of the coming judgment."},{"num":9,"verse":"The world’s sin is that it refuses to believe in me."},{"num":10,"verse":"Righteousness is available because I go to the Father, and you will see me no more."},{"num":11,"verse":"Judgment will come because the ruler of this world has already been judged."},{"num":12,"verse":"“There is so much more I want to tell you, but you can’t bear it now."},{"num":13,"verse":"When the Spirit of truth comes, he will guide you into all truth. He will not speak on his own but will tell you what he has heard. He will tell you about the future."},{"num":14,"verse":"He will bring me glory by telling you whatever he receives from me."},{"num":15,"verse":"All that belongs to the Father is mine; this is why I said, ‘The Spirit will tell you whatever he receives from me.’"},{"header":"Sadness Will Be Turned to Joy"},{"num":16,"verse":"“In a little while you won’t see me anymore. But a little while after that, you will see me again.”"},{"num":17,"verse":"Some of the disciples asked each other, “What does he mean when he says, ‘In a little while you won’t see me, but then you will see me,’ and ‘I am going to the Father’?"},{"num":18,"verse":"And what does he mean by ‘a little while’? We don’t understand.”"},{"num":19,"verse":"Jesus realized they wanted to ask him about it, so he said, “Are you asking yourselves what I meant? I said in a little while you won’t see me, but a little while after that you will see me again."},{"num":20,"verse":"I tell you the truth, you will weep and mourn over what is going to happen to me, but the world will rejoice. You will grieve, but your grief will suddenly turn to wonderful joy."},{"num":21,"verse":"It will be like a woman suffering the pains of labor. When her child is born, her anguish gives way to joy because she has brought a new baby into the world."},{"num":22,"verse":"So you have sorrow now, but I will see you again; then you will rejoice, and no one can rob you of that joy."},{"num":23,"verse":"At that time you won’t need to ask me for anything. I tell you the truth, you will ask the Father directly, and he will grant your request because you use my name."},{"num":24,"verse":"You haven’t done this before. Ask, using my name, and you will receive, and you will have abundant joy."},{"num":25,"verse":"“I have spoken of these matters in figures of speech, but soon I will stop speaking figuratively and will tell you plainly all about the Father."},{"num":26,"verse":"Then you will ask in my name. I’m not saying I will ask the Father on your behalf,"},{"num":27,"verse":"for the Father himself loves you dearly because you love me and believe that I came from God."},{"num":28,"verse":"Yes, I came from the Father into the world, and now I will leave the world and return to the Father.”"},{"num":29,"verse":"Then his disciples said, “At last you are speaking plainly and not figuratively."},{"num":30,"verse":"Now we understand that you know everything, and there’s no need to question you. From this we believe that you came from God.”"},{"num":31,"verse":"Jesus asked, “Do you finally believe?"},{"num":32,"verse":"But the time is coming—indeed it’s here now—when you will be scattered, each one going his own way, leaving me alone. Yet I am not alone because the Father is with me."},{"num":33,"verse":"I have told you all this so that you may have peace in me. Here on earth you will have many trials and sorrows. But take heart, because I have overcome the world.”"}]