[{"num":26,"verse":"And Agrippa said to Rav Sha’ul, \"It is permitted for you to speak concerning yourself.\" Then Rav Sha’ul, having stretched out his hand, was making his hitstaddekut (defense), saying,"},{"num":2,"verse":"\"I have considered myself fortunate that it is before you, Agrippa HaMelech, that I am able to make my hitstaddekut today concerning everything of which I am accused by Yehudim."},{"num":3,"verse":"\"Most of all, you are a bukki (expert, meivin) in all the minhagim and issues of the Yehudim; therefore, I beg you to listen patiently to me."},{"num":4,"verse":"\"All the Yehudim have da’as of my Yiddishkeit from my earliest youth, a life spent from the beginning among my own people and in Yerushalayim."},{"num":5,"verse":"\"They have had da’as of this for a long time, if they are willing to bear edut, that according to the most machmir kat of our Orthodox Jewish faith my life has been lived out as a Parush."},{"num":6,"verse":"\"And now I stand here on trial on account of my tikvah in the havtacha made to Avoteinu,"},{"num":7,"verse":"\"A havtacha Sheneym Asar Shevateinu have tikvah to attain, as they with earnestness worship Hashem yomam valailah. It if for this tikvah, your Excellency, that I am accused by Yehudim!"},{"num":8,"verse":"\"Why is it considered incredible by any of you that Hashem makes the Mesim to stand up alive?"},{"num":9,"verse":"\"Indeed, I myself thought it necessary to do many opposing things against ha-Shem of Yehoshua from Natzeret."},{"num":10,"verse":"\"And this I also did in Yerushalayim; and armed with samchut received from the Rashei Hakohanim, many of the kadoshim I locked up in the beis hasohar; and I cast my vote keneged (against) them when they received the death penalty."},{"num":11,"verse":"\"And throughout all the shuls I often punished them, forcing them to commit Chillul Hashem gidduf (blasphemy), and since I was so enraged against them, I was bringing redifah on them even as far as foreign cities."},{"num":12,"verse":"\"This it was, that as I was traveling to Damascus with authorization and permission from the Rashei Hakohanim,"},{"num":13,"verse":"\"At noon on the derech, O Melech, I saw from Shomayim an ohr, more brilliant than the shemesh, shining around me and around the ones traveling with me."},{"num":14,"verse":"\"And we all fell down to the ground. Then I heard a kol saying to me in the language of the Hebrews, ‘Sha’ul, Sha’ul, why are you bringing redifah upon me? It is hard for you to kick keneged (against) the prod.’"},{"num":15,"verse":"\"And I said, ‘Who are you Adoni?’ And HaAdon said, ‘I am Yehoshua upon whom you are bringing redifah."},{"num":16,"verse":"‘But get up and stand on your feet. For this tachlis, then, I appeared to you, to give you s’michah as a mesharet, an eved, and an eidus (witness), both of what things you have seen and the things which I will reveal to you. [Ezek 2:1; Dan 10:11]"},{"num":17,"verse":"‘I will deliver you from your own people and from the Goyim to whom I am sending you, [YIRMEYAH 1:8,19]"},{"num":18,"verse":"‘To open their eyes, to turn them from choshech to ohr and from the samchut of Hasatan to Hashem, that they receive selichat avon and nachalah among the ones having been set apart in kedushah by emunah in me.' [YESHAYAH 35:5; TEHILLIM 18:28; YESHAYAH 42:7,16]"},{"num":19,"verse":"\"O Agrippa HaMelech, I was not disobedient to the chazon from Shomayim. [YESHAYAH 50:5]"},{"num":20,"verse":"\"But beginning with the ones in Damascus and also with those in Yerushalayim, and with all the region of Yehudah and with the Goyim, I was preaching they should make teshuva and turn to Hashem, doing ma’asim mitzvot worthy of teshuva. [YIRMEYAH 18:11; 35:15]"},{"num":21,"verse":"\"Because of these things, the unbelieving Yehudim seized me while I was in the Beis Hamikdash, and were trying to kill me."},{"num":22,"verse":"\"To this day I have obtained ezer (help) from Hashem, to stand and give solemn edut (testimony) before both ketanim and Gedolim, testifying about nothing beyond the Orthodox Jewish faith based on what the Nevi’im and Moshe Rabbenu said would happen:"},{"num":23,"verse":"\"That is, the yissurim (sufferings) of Rebbe, Melech HaMoshiach, and that by being rishon to stand up alive in the Techiyas HaMoshiach, he would proclaim ohr both to K’lal Yisroel and the Nations.\""},{"num":24,"verse":"And while he was saying these things in his hitstaddekut, Festus in a kol gadol shouts, \"Rav Sha’ul, all your yeshiva learning has made you meshuggah!\""},{"num":25,"verse":"But Rav Sha’ul says, \"I am not meshuggah, most excellent Festus; I am speaking dvarim of Emes and Ta’am (Reason)."},{"num":26,"verse":"\"For HaMelech has da’as of these matters, to whom also I am speaking freely, for I am sure that absolutely none of these things escape his notice, for this has not been done in a corner."},{"num":27,"verse":"\"Agrippa HaMelech, do you believe in the Nevi’im? I have da’as that you do believe.\""},{"num":28,"verse":"And Agrippa said to Rav Sha’ul, \"You think, do you, that as quick as that you can make me mekabel Rebbe, Melech HaMoshiach?\""},{"num":29,"verse":"But Rav Sha’ul said, \"I would daven that Hashem, quickly or not, might make not only you but all listening to me today as I am, apart from these sharsherot (chains).\""},{"num":30,"verse":"HaMelech and the Moshel and Bernice and the ones sitting with them got up."},{"num":31,"verse":"And having withdrawn, they were saying to one another, \"This man does nothing worthy of the death penalty or imprisonment.\""},{"num":32,"verse":"And Agrippa said to Festus, \"This man could have been released, if he had not appealed to Caesar.\""}]