[{"num":26,"verse":"Then Agrippa said to Paul, “You have our permission to speak for yourself.”"},{"header":"Paul repeats his story on a state occasion"},{"num":2,"verse":"So Paul, with that characteristic gesture of the hand, began his defence: “King Agrippa, in answering all the charges that the Jews have made against me, I must say how fortunate I consider myself to be in making my defence before you personally today. For I know that you are thoroughly familiar with all the customs and disputes that exist among the Jews. I therefore ask you to listen to me patiently."},{"num":4,"verse":"“The fact that I lived from my youth upwards among my own people in Jerusalem is well known to all Jews. They have known all the time, and could witness to the fact if they wished, that I lived as a Pharisee according to the strictest sect of our religion. Even today I stand here on trial because of a hope that I hold in a promise that God made to our forefather—a promise for which our twelve tribes served God zealously day and night, hoping to see it fulfilled. It is about this hope, your majesty, that I am being accused by the Jews! Why does it seem incredible to you all that God should raise the dead? I once thought it my duty to oppose with the utmost vigour the name of Jesus of Nazareth. Yes, that is what I did in Jerusalem, and I had many of God’s people imprisoned on the authority of the chief priests, and when they were on trial for their lives I gave my vote against them. Many and many a time in all the synagogues I had them punished and I used to try and force them to deny their Lord. I was mad with fury against them, and I hounded them to distant cities. Once, your majesty, on my way to Damascus on this business, armed with the full authority and commission of the chief priests, at midday I saw a light from Heaven, far brighter than the sun, blazing about me and my fellow-travellers. We all fell to the ground and I heard a voice saying to me in Hebrew, ‘Saul, Saul, why are you persecuting me? It is not for you to kick against your own conscience.’ ‘Who are you, Lord?’ I said. And the Lord said to me, ‘I am Jesus whom you are persecuting. Now get up and stand on your feet for I have shown myself to you for a reason—you are chosen to be my servant and a witness to what you have seen of me today, and of other visions of myself which I will give you. I will keep you safe from both your own people and from the Gentiles to whom I now send you. I send you to open their eyes, to turn them from darkness to light, from the power of Satan to God himself, so that they may know forgiveness of their sins and take their place with all those who are made holy by their faith in me.’"},{"num":19,"verse":"After that, King Agrippa, I could not disobey the heavenly vision. But both in Damascus and in Jerusalem, through the whole of Judea, and to the Gentiles, I preached that men should repent and turn to God and live lives to prove their change of heart. This is why the Jews seized me in the Temple and tried to kill me. To this day I have received help from God himself, and I stand here as a witness to high and low, adding nothing to what the prophets foretold should take place, that is, that Christ should suffer, that he should be first to rise from the dead, and so proclaim the message of light both to our people and to the Gentiles!”"},{"header":"Festus concludes that Paul’s enthusiasm is insanity"},{"num":24,"verse":"While he was thus defending himself Festus burst out, “You are raving, Paul! All your learning has driven you mad!”"},{"num":25,"verse":"But Paul replied, “I am not mad, your excellency. I speak nothing but sober truth. The king knows of these matters, and I can speak freely before him. I cannot believe that any of these matters has escaped his notice, for it has been no hole-and-corner business. King Agrippa, do you believe the prophets? But I know that you believe them.”"},{"num":28,"verse":"“Much more of this, Paul,” returned Agrippa, “and you will be making me a Christian!”"},{"num":29,"verse":"“Ah,” returned Paul, “whether it means ‘much more’ or ‘only a little’, I would to God that both you and all who can hear me this day might stand where I stand—but without these chains."},{"header":"The Roman officials consider Paul innocent"},{"num":30,"verse":"Then the king rose to his feet and so did the governor and Bernice and those sitting with them, and when they had retired from the assembly they discussed the matter among themselves and agreed, “This man is doing nothing to deserve either death or imprisonment.”"},{"num":32,"verse":"Agrippa remarked to Festus, “He might easily have been discharged if he had not appealed to Caesar.”"}]