[{"header":"Defense Before King Agrippa"},{"num":26,"verse":"Agrippa said to Paul, “It is permitted for you to speak for yourself.”"},{"num":2,"verse":"“Concerning all I am accused of by the Judean leaders, I consider myself fortunate, King Agrippa, that it is before you that I am about to make my defense today—"},{"num":3,"verse":"since you are especially knowledgeable about all Jewish customs and issues. Therefore I beg you to listen patiently to me."},{"num":4,"verse":"“Now all the Jewish people have known my manner of life ever since my youth, starting from the beginning in my own nation and also in Jerusalem. "},{"num":5,"verse":"They have known about me for a long time—if they were willing to testify—that according to the strictest sect of our religion, I lived as a Pharisee."},{"num":6,"verse":"“Yet now I stand here being judged for the hope in the promise made by God to our fathers. "},{"num":7,"verse":"It is the promise that our twelve tribes hope to attain, as they earnestly worship night and day. And for this hope I am accused by Jewish people, O King! "},{"num":8,"verse":"Why is it judged incredible by any of you that God raises the dead?"},{"num":9,"verse":"“In fact, I myself thought it was necessary to do many things in opposition to the name of Yeshua ha-Natzrati. "},{"num":10,"verse":"And that is what I did in Jerusalem. Not only did I lock up many of the kedoshim in prisons by the authority I received from the ruling kohanim, but I cast my vote against them when they were being condemned to death. "},{"num":11,"verse":"I tried to cause them to blaspheme by punishing them often in the synagogues. In furious rage against them, I persecuted them even in foreign cities."},{"num":12,"verse":"“While journeying to Damascus with the authority and commission of the ruling kohanim, "},{"num":13,"verse":"at midday, O King, I saw on the road a light from heaven, brighter than the sun, shining around me and those traveling with me. "},{"num":14,"verse":"When we had all fallen to the ground, I heard a voice saying to me in Aramaic, ‘Saul, Saul, why are you persecuting Me? It is hard for you to kick against goads!’"},{"num":15,"verse":"“Then I said, ‘Who are you, Lord?’"},{"num":16,"verse":"But get up, and stand on your feet. For I have appeared to you for this purpose—to appoint you as a servant and witness to the things you have seen as well as to the things I will yet reveal to you. "},{"num":17,"verse":"I will rescue you from your own people, and from the Gentiles to whom I am sending you, "},{"num":18,"verse":"to open their eyes—so they may turn from darkness to light and from the power of satan to God, that they may receive release from sins as well as a place among those who are made holy through trusting in Me.’"},{"num":19,"verse":"“Therefore, O King Agrippa, I was not disobedient to the heavenly vision. "},{"num":20,"verse":"Rather, I kept declaring—first to those in Damascus, and then Jerusalem and throughout all the region of Judea, and also the Gentiles—that they should repent and turn to God, performing deeds consistent with that repentance."},{"num":21,"verse":"“For this reason some Judeans seized me in the Temple and tried to put me to death. "},{"num":22,"verse":"Since I have had God’s help, to this day I have stood here testifying to both small and great. I am saying nothing but what the Prophets and Moses said was going to happen—"},{"num":23,"verse":"that the Messiah was to suffer and that, being first to rise from the dead, He would proclaim light both to our people and to the nations.”"},{"num":24,"verse":"As Paul was thus making his defense, Festus says with a loud voice, “You’re crazy, Paul! Your great learning is driving you insane!”"},{"num":25,"verse":"But Paul declares, “I am not insane, most noble Festus! Rather I am speaking the sober truth. "},{"num":26,"verse":"For the king knows about these things, and I speak freely to him, since I am convinced that none of these things escape his notice—for this was not done in a corner. "},{"num":27,"verse":"King Agrippa, do you believe the Prophets? I know that you do believe!”"},{"num":28,"verse":"Agrippa said to Paul, “In a short time you are trying to persuade me to be Messianic!”"},{"num":29,"verse":"And Paul said, “Whether short or long, I would pray to God that not only you, but also all who hear me today would be such as I am—except for these chains!”"},{"num":30,"verse":"Then the king stood up, as well as the governor, Bernice, and those sitting with them. "},{"num":31,"verse":"When they had gone away, they began talking among themselves, saying, “This man is doing nothing deserving of death or chains.”"},{"num":32,"verse":"Then Agrippa said to Festus, “This man could have been set free, if he had not appealed to Caesar.”"}]