[{"num":66,"verse":"The Lord saith these things, Heaven is my seat, and the earth is the stool of my feet. Which is this house, which ye shall build to me, and which is this place of my rest? (The Lord saith these things, Heaven is my throne, and the earth is my footstool. Where is this House, which ye shall build for me, yea, where is this place for my rest?/where is my resting place?)"},{"num":2,"verse":"Mine hand made all these things, and all these things be made, saith the Lord; but to whom shall I behold, no but to a poor man and contrite in spirit, and greatly dreading my words? (My hands made all these things, and all these things be made, saith the Lord; but to whom shall I look upon, no but one who is poor, and contrite in spirit, and who greatly feareth my words/and who hath great reverence for my words.)"},{"num":3,"verse":"He that offereth an ox, is as he that slayeth a man; he that slayeth a sheep, is as he that braineth a dog; he that offereth an offering, is as he that offereth swine’s blood; he that thinketh on incense, is as he that blesseth an idol (he who burneth incense, is like he who blesseth an idol); they choosed all these things in their ways, and their soul delighted in their abominations."},{"num":4,"verse":"Wherefore and I shall choose the scornings of them, and I shall bring to them those things which they dreaded; for I called, and none there was that answered; I spake, and they heard not; and they did evil before mine eyes, and choosed those things, which I would not. (And so I shall choose those who be mocked by them, and I shall bring to them those things which they feared; for I called, and there was no one who answered; I spoke, and they did not listen; and they did evil before my eyes, and chose those things, which I would not choose/which I did not desire.)"},{"num":5,"verse":"Hear ye the word of the Lord, which quake at his word; your brethren hating you, and casting (you) away for (you bear) my name, said, The Lord be glorified, and (then) we shall see (you) in your gladness; forsooth they shall be shamed. (Hear ye the word of the Lord, ye who shake at his word; your kinsmen who hate you, and who cast you away for the sake of my name, have said, Let the Lord be glorified, and then we shall see you rejoice, or be happy; so it shall be, but they shall be shamed.)"},{"num":6,"verse":"The voice of the people from the city, the voice from the temple, the voice of the Lord yielding a reward to his enemies. (Those cries of the people from the city, those cries from the Temple, be the sound of the Lord yielding a reward, or requiting, unto his enemies.)"},{"num":7,"verse":"Before that she travailed of child, she childed; before that the sorrow of her childbearing came, she childed a son. (Before that she could go into labour, she gave birth; before that the pain of her labour began, she gave birth to a son.)"},{"num":8,"verse":"Who heard ever such a thing, and who saw a thing like this? Whether the earth shall travail of child in one day, either a folk shall be childed together? For why Zion travailed of child, and childed her sons. (Whoever heard of such a thing, and whoever saw something like this? Shall a whole country be born after just one day’s labour, or shall an entire nation be born together? But Zion went into labour, and gave birth to her children all at once.)"},{"num":9,"verse":"Whether that I make others to bear child, (but) shall not bear child myself? saith the Lord. Whether I that give generation to other men, shall be barren? saith thy Lord God. (Shall I who let others give birth, not give birth myself? saith the Lord. Shall I who give children, or descendants, to others, be barren myself? saith the Lord thy God.)"},{"num":10,"verse":"Be ye glad with Jerusalem, and all ye that love that, make full out joy therein; all ye that mourn on that Jerusalem, make ye joy with it in joy; (Be ye happy with Jerusalem, and all ye who love that city, rejoice there; all ye who have mourned over Jerusalem, now make ye joy with it;)"},{"num":11,"verse":"that both ye suck, and be [ful]filled of the teats and comfort thereof (that ye may suck, and be fulfilled by the breasts that give comfort there), (and) that ye milk (out), and flow in delights, of all manner glory thereof."},{"num":12,"verse":"For why the Lord saith these things, Lo! I shall bow down on it, as a flood of peace, and as a flowing stream, the glory of heathen men, which ye shall suck; ye shall be borne at teats, and (when they shall take you) on (their) knees, they shall speak pleasantly to you. (For the Lord saith these things, Lo! I shall bring peace upon it, like a river, and the wealth of the heathen, like a flowing stream; and this ye shall suck when ye shall be carried at the breast, and when they shall take you upon their knees, and they shall speak pleasantly to you.)"},{"num":13,"verse":"As if a mother speaketh fair to any child (Like when a mother speaketh softly to her child), so I shall comfort you, and ye shall be comforted in Jerusalem."},{"num":14,"verse":"Ye shall see, and your heart shall have joy, and your bones shall burgeon as an herb. And the hand of the Lord shall be known in his servants, and he shall have indignation to his enemies. (Ye shall see, and your heart shall have joy, and your bones shall burgeon like the herbs. And the hand, or the power, of the Lord shall be known, or shall be seen, among his servants, and he shall have anger toward his enemies.)"},{"num":15,"verse":"For lo! the Lord shall come in fire, and as a whirlwind his chariots, to yield in indignation his strong vengeance, and his blaming in the flame of fire. (For lo! the Lord shall come in fire, and his chariots like a whirlwind, to yield his strong vengeance in anger, and his rebuke in the fiery flames.)"},{"num":16,"verse":"For why the Lord shall deem in fire, and in his sword to each flesh; and slain men of the Lord shall be multiplied, (For the Lord shall judge all flesh, or all the people, with fire, and with his sword; and many people shall be killed by the Lord,)"},{"num":17,"verse":"that were hallowed, and guessed them clean, in gardens after one gate within; that eat swine’s flesh, and abomination, and a mouse, they shall be wasted together, saith the Lord. (yea, they who were hallowed, and thought themselves to be clean, yet who go into gardens one gate within, that be dedicated to idols; and who eat swine’s flesh, and mice, and other abominations, they all shall be destroyed, saith the Lord.)"},{"num":18,"verse":"Forsooth I (shall) come to gather together the works of them, and the thoughts of them, with all folks and languages; and they shall come, and shall see my glory."},{"num":19,"verse":"And I shall set a sign in them, and I shall send of them that be saved to heathen men, into the sea, into Africa, and into Lydia, and to them that hold [an] arrow, into Italy, and (into) Greek land, to isles far (off), (and) to them that heard not of me, and saw not my glory. And they shall tell (of) my glory to heathen men, (And I shall give them a sign, and I shall spare some of them, and send them to the heathen, yea, to Tarshish, and to Africa, and to Lydia, and to them who hold an arrow/to Meshek, and to Rosh, and to Italy, and to Greece, and to the islands afar off, and to those who have not heard of me, and have not seen my glory. And they shall tell of my glory to the heathen,)"},{"num":20,"verse":"and they shall bring all your brethren (out) of all folks (as) a gift to the Lord, in horses, and [in] chariots, and in litters, and in mules, and in carts, to mine holy hill, Jerusalem, saith the Lord; as if the sons of Israel bring a gift in a clean vessel into the house of the Lord. (and they shall bring out all your kinsmen from all the nations as a gift to the Lord, on horses, and in chariots, and on litters, and on mules, and in carts, to my holy hill in Jerusalem, saith the Lord; like the Israelites bring a gift in a clean vessel into the House of the Lord.)"},{"num":21,"verse":"And I shall take of them into priests and deacons, saith the Lord. (And I shall make some of them to be priests and Levites, saith the Lord.)"},{"num":22,"verse":"For as new heavens and new earth, which I make to stand before me, saith the Lord, so your seed shall stand, and your name. (For as the new heavens and the new earth, which I shall make, shall stand before me, saith the Lord, so your children, or your descendants, and your name, shall also endure.)"},{"num":23,"verse":"And a month shall be of (a) month, and a sabbath of (a) sabbath; each man shall come for to worship before my face, saith the Lord (and everyone shall come to worship before me, saith the Lord)."},{"num":24,"verse":"And they shall go out, and shall see the carrions of men, that trespassed against me; the worm of them shall not die, and the fire of them shall not be quenched; and they shall be unto filling of sight to each man. (And they shall go out, and shall see the corpses of those, who trespassed against me; the worm of them shall not die, and the fire of them shall not be quenched; and they shall be loathed by all people.)"}]