[{"header":"Absalom Makes Secret Plans Against David"},{"num":15,"verse":"Some time later, Absalom got a chariot and horses for himself. He also got 50 men to run in front of him. "},{"num":2,"verse":"He would get up early. He would stand by the side of the road that led to the city gate. Sometimes a person would come with a case for the king to decide. Then Absalom would call out to him, “What town are you from?” He would answer, “I’m from one of the tribes of Israel.” "},{"num":3,"verse":"Absalom would say, “Look, your claims are based on the law. So you have every right to make them. But the king doesn’t have anyone here who can listen to your case.” "},{"num":4,"verse":"Absalom would continue, “I wish I were appointed judge in the land! Then anyone who has a case or a claim could come to me. I would make sure they are treated fairly.”"},{"num":5,"verse":"Sometimes people would approach Absalom and bow down to him. Then he would reach out his hand. He would take hold of them and kiss them. "},{"num":6,"verse":"Absalom did that to all the Israelites who came to the king with their cases or claims. That’s why the hearts of the people were turned toward him."},{"num":7,"verse":"After Absalom had lived in Jerusalem for four years, he went and spoke to the king. He said, “Let me go to Hebron. I want to keep a promise I made to the Lord. "},{"num":8,"verse":"When I was living at Geshur in Aram, I made a promise. I said, ‘If the Lord takes me back to Jerusalem, I’ll go to Hebron and worship him there.’ ”"},{"num":9,"verse":"The king said to him, “Go in peace.” So he went to Hebron."},{"num":10,"verse":"Then Absalom sent messengers secretly to all the tribes of Israel. They said, “Listen for the sound of trumpets. As soon as you hear them, say, ‘Absalom has become king in Hebron.’ ” "},{"num":11,"verse":"Absalom had taken 200 men from Jerusalem with him to Hebron. He had invited them to be his guests. They went without having any idea what was going to happen. "},{"num":12,"verse":"While Absalom was offering sacrifices, he sent for Ahithophel. Ahithophel was David’s adviser. He came to Absalom from Giloh, his hometown. The number of people who followed Absalom kept growing. So he became more and more able to carry out his plans against David."},{"header":"David Runs Away From Absalom"},{"num":13,"verse":"A messenger came and spoke to David. He told him, “The hearts of the Israelites are turned toward Absalom.”"},{"num":14,"verse":"Then David spoke to all his officials who were with him in Jerusalem. He said, “Come on! We have to leave right away! If we don’t, none of us will escape from Absalom. He’ll move quickly to catch up with us. He’ll destroy us. His men will kill everyone in the city with their swords.”"},{"num":15,"verse":"The king’s officials answered him, “You are our king and master. We’re ready to do anything you want.”"},{"num":16,"verse":"The king started out. Everyone in his whole family went with him. But he left ten concubines behind to take care of the palace. "},{"num":17,"verse":"So the king and all those with him left. They stopped at the edge of the city. "},{"num":18,"verse":"All of David’s officials marched past him. All the Kerethites and Pelethites marched along with them. And all of the 600 men who had come with him from Gath marched in front of him."},{"num":19,"verse":"The king spoke to Ittai. He was from Gath. The king said to him, “Why do you want to come along with us? Go back. Stay with King Absalom. You are an outsider. You left your own country. "},{"num":20,"verse":"You came to join me only a short time ago. So why should I make you wander around with us now? I don’t even know where I’m going. So go on back. Take your people with you. And may the Lord be kind and faithful to you.”"},{"num":21,"verse":"But Ittai replied to the king, “You are my king and master. I want to be where you are. It doesn’t matter whether I live or die. And that’s just as sure as the Lord and you are alive.”"},{"num":22,"verse":"David said to Ittai, “Go ahead then. Keep marching with my men.” So Ittai, the Gittite, kept marching. All his men and their families marched with him."},{"num":23,"verse":"All the people in the countryside wept out loud as David and all his followers passed by. The king went across the Kidron Valley. He and all the people with him moved on toward the desert."},{"num":24,"verse":"Zadok also went with them. Some of the Levites went with him. They were carrying the ark of the covenant of God. They set down the ark. Abiathar offered sacrifices until all the people had left the city."},{"num":25,"verse":"Then the king said to Zadok, “Take the ark of God back into the city. If the Lord is pleased with me, he’ll bring me back. He’ll let me see the ark again. He’ll also let me see Jerusalem again. That’s the place where he lives. "},{"num":26,"verse":"But suppose he says, ‘I am not pleased with you.’ Then I accept that. Let him do to me what he thinks is best.”"},{"num":27,"verse":"The king said again to Zadok the priest, “Do you understand? Go back to the city with my blessing. Take your son Ahimaaz with you. Also take Abiathar and his son Jonathan with you. "},{"num":28,"verse":"I’ll wait at the place in the desert where we can go across the Jordan River. I’ll wait there until you send word to let me know what’s happening.” "},{"num":29,"verse":"So Zadok and Abiathar took the ark of God back to Jerusalem. They stayed there."},{"num":30,"verse":"But David went on up the Mount of Olives. He was weeping as he went. His head was covered, and he was barefoot. All the people with him covered their heads too. And they were weeping as they went up. "},{"num":31,"verse":"David had been told, “Ahithophel, along with Absalom, is one of the people making secret plans against you.” So David prayed, “Lord, make Ahithophel’s advice look foolish.”"},{"num":32,"verse":"David arrived at the top of the Mount of Olives. That’s where people used to worship God. Hushai, the Arkite, was there to meet him. His robe was torn. There was dust on his head. "},{"num":33,"verse":"David said to him, “If you go with me, you will be too much trouble for me. "},{"num":34,"verse":"So return to the city. Say to Absalom, ‘Your Majesty, I’ll be your servant. In the past, I was your father’s servant. But now I’ll be your servant.’ If you do that, you can help me by making sure Ahithophel’s advice fails. "},{"num":35,"verse":"Zadok and Abiathar, the priests, will be there with you. Tell them everything you hear in the king’s palace. "},{"num":36,"verse":"They have their sons Ahimaaz and Jonathan there with them. Send them to tell me everything you hear.”"},{"num":37,"verse":"So David’s trusted friend Hushai went to Jerusalem. He arrived just as Absalom was entering the city."}]