[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 26:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 26:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have loved the habitation of thy house ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, thy sanctuary and worship, which is an evidence of my piety to thee, as I have given many proofs of my justice and integrity toward men. Nothing is more grievous to me than to be hindered from seeing and serving thee in thy house. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Where thy honour dwelleth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "כבידךְ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chebodeka, thy glory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "meaning either, 1st, The ark, so called ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:61",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, 2d, God’s glorious and gracious presence, or the manifestation of his glory, namely, of his glorious power, faithfulness, and goodness. Observe, reader, all that truly love God, truly love his ordinances; and they therefore love them, because in them God manifests his honour and glory, and they have an opportunity of honouring and glorifying him. And while their delighting to approach him, and having communion with him, is a constant source of pleasure to them, it is also a comfortable evidence of their integrity, and a comfortable earnest of their endless felicity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:9 David, in this psalm, appeals to God touching his integrity. - David here, by the Spirit of prophecy, speaks of himself as a type of Christ, of whom what he here says of his spotless innocence was fully and eminently true, and of Christ only, and to Him we may apply it. We are complete in him. The man that walks in his integrity, yet trusting wholly in the grace of God, is in a state of acceptance, according to the covenant of which Jesus was the Mediator, in virtue of his spotless obedience even unto death. This man desires to have his inmost soul searched and proved by the Lord. He is aware of the deceitfulness of his own heart; he desires to detect and mortify every sin; and he longs to be satisfied of his being a true believer, and to practise the holy commands of God. Great care to avoid bad company, is both a good evidence of our integrity, and a good means to keep us in it. Hypocrites and dissemblers may be found attending on God's ordinances; but it is a good sign of sincerity, if we attend upon them, as the psalmist here tells us he did, in the exercise of repentance and conscientious obedience. He feels his ground firm under him; and, as he delights in blessing the Lord with his congregations on earth, he trusts that shortly he shall join the great assembly in heaven, in singing praises to God and to the Lamb for evermore.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Lord, I have loved the habitation of thy house - I have loved to dwell in Thy house. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The psalmist often refers to his delight in the house of God - the place of public worship; his love to be there united with the people of God in the solemn services of religion. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the place where thine honour dwelleth - Margin, \"the tabernacle of thine honor.\" This might indeed refer to the tabernacle; and the idea might be that he loved the place where that rested in its wanderings. But the more correct meaning is, that he loved the place where the \"glory\" of God - the Shekinah - the symbol of His presence - rested; that is, the place where God was pleased to manifest Himself, and where He dwelt. Wherever that was, he found pleasure in being there; and that he did thus love the place where God manifested Himself, was to his own mind an evidence of true piety. It is always an evidence of piety, for there can be no true religion where the soul does not find pleasure in the worship of God. A person who does not delight in such a service here, is not prepared for heaven, where God eternally dwells. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the place where thine honour dwelleth - Margin, \"the tabernacle of thine honor.\" This might indeed refer to the tabernacle; and the idea might be that he loved the place where that rested in its wanderings. But the more correct meaning is, that he loved the place where the \"glory\" of God - the Shekinah - the symbol of His presence - rested; that is, the place where God was pleased to manifest Himself, and where He dwelt. Wherever that was, he found pleasure in being there; and that he did thus love the place where God manifested Himself, was to his own mind an evidence of true piety. It is always an evidence of piety, for there can be no true religion where the soul does not find pleasure in the worship of God. A person who does not delight in such a service here, is not prepared for heaven, where God eternally dwells. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. the habitation of thy house—where Thy house rests, as the tabernacle was not yet permanently fixed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "honour dwelleth—conveys an allusion to the Holy of Holies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The habitation of thy house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. thy sanctuary and worship; which is an evidence of my piety to thee, as I have given many proofs of my justice and integrity towards men. Nothing is more grievous to me than to be hindered from seeing and serving thee there. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thine honour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy glory",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. The ark so called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 4:22 Psalm 78:61",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:61",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Thy glorious and gracious presence, or the manifestation of thy glory, or of thy glorious power, and faithfulness, and goodness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Lord, I have loved the habitation of thy house,.... Meaning the tabernacle, for as yet the temple was not built; which was an habitation for the saints, where they chose to dwell, and reckoned it their happiness, and was the habitation of the Lord himself: the sanctuary was built for that purpose; and between the cherubim, over the mercy seat, he took up his residence; hence it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the place where thine honour dwelleth: or \"glory\" (a): when the tabernacle was set up, the glory of the Lord filled it, as it did the temple, when it was dedicated, Exodus 40:35. The psalmist expresses his love to this place, in opposition to the, congregation of evildoers, which he hated, Psalm 26:5; and to remove a calumny from him, that being among the Philistines, and at a distance from the house of God, his affections were alienated from it; whereas it was his greatest concern that he was debarred the privileges of it; see Psalm 42:1; besides, he had showed his great regard to it by his constant attendance before his exile, as he did after it, Psalm 42:3; and it was out of pure love to the worship of God, and with real pleasure and delight, that he did attend; and not through custom, and in mere form, Psalm 122:1. The Lord's house is loved by his people, because of his word and ordinances, which are ministered there, and because of his presence in it: or else what was typified by the tabernacle in here designed; either the tabernacle of Christ's human nature, called the true tabernacle, Hebrews 8:2; in which the fulness of the Godhead dwells; which the Son of God, the brightness of his Father's glory, inhabits; and in the redemption and salvation wrought out in it the glory of all the divine attributes is displayed; and Christ incarnate is the mercy seat from which God communes with his people, and is their way of access unto him, and whereby they have fellowship with him; and who is loved by the saints sincerely, above all creatures and things, and in the most ardent and affectionate manner: or heaven itself, of which the tabernacle was a figure, Hebrews 9:24; which is the habitation of the holiness and glory of God, and in which are many mansions or dwelling places for his people; and is the continuing city they seek, the heavenly and better country they are desirous of, and where their hearts and affections are; because there their God, their Saviour, and their treasure be; which sense seems to be confirmed by what follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the place where thine honour dwelleth: or \"glory\" (a): when the tabernacle was set up, the glory of the Lord filled it, as it did the temple, when it was dedicated, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 40:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The psalmist expresses his love to this place, in opposition to the, congregation of evildoers, which he hated, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 26:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and to remove a calumny from him, that being among the Philistines, and at a distance from the house of God, his affections were alienated from it; whereas it was his greatest concern that he was debarred the privileges of it; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; besides, he had showed his great regard to it by his constant attendance before his exile, as he did after it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it was out of pure love to the worship of God, and with real pleasure and delight, that he did attend; and not through custom, and in mere form, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 122:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Lord's house is loved by his people, because of his word and ordinances, which are ministered there, and because of his presence in it: or else what was typified by the tabernacle in here designed; either the tabernacle of Christ's human nature, called the true tabernacle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; in which the fulness of the Godhead dwells; which the Son of God, the brightness of his Father's glory, inhabits; and in the redemption and salvation wrought out in it the glory of all the divine attributes is displayed; and Christ incarnate is the mercy seat from which God communes with his people, and is their way of access unto him, and whereby they have fellowship with him; and who is loved by the saints sincerely, above all creatures and things, and in the most ardent and affectionate manner: or heaven itself, of which the tabernacle was a figure, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which is the habitation of the holiness and glory of God, and in which are many mansions or dwelling places for his people; and is the continuing city they seek, the heavenly and better country they are desirous of, and where their hearts and affections are; because there their God, their Saviour, and their treasure be; which sense seems to be confirmed by what follows. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) \"gloria tua\", Musculus, Piscator; \"tabernaculum gloriae tuae\", Junius & Tremellius, Cocceius, Gejerus; so Ainsworth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) \"gloria tua\", Musculus, Piscator; \"tabernaculum gloriae tuae\", Junius & Tremellius, Cocceius, Gejerus; so Ainsworth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "LORD, I have loved the habitation of thy house, and the place where thine honour dwelleth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Taking up the thought of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 26:7-8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 26:7-8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", he makes it the ground of his plea in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 26:9-10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 26:9-10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have loved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V., I love. It is the correlative of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I hate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 26:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 26:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the place where thine honour dwelleth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, with R.V., the place where thy glory dwelleth: lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the place of the tabernacle of thy glory",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mishkan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", means properly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dwelling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the sanctuary where Jehovah ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dwelt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " among His people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 25:8-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jehovah’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "glory",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is His manifested Presence, of which the Ark was the outward symbol. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 33:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 33:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 4:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:61",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "8–12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His love for God’s house is a further reason why he should not be involved in the fate of sinners.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Lord, I have loved the habitation of thy house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "home",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that thy house affords me.\" It has been my delight to  remain there, to pass long hours there, as it were to dwell there (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 63:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And the place where thine honour dwelleth; literally, the place ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of the tabernacling of thy glory",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - the place where thy glory - the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Shechinah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - is enshrined and abides. Psalm 26:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet supports his petition by declaring his motive to be his love for the sanctuary of God, from which he is now far removed, without any fault of his own. The coloured future ואסבבה, distinct from ואסבבה (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), can only mean, in this passage, et ambiam, and not et ambibam as it does in a different connection (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); it is the emotional continuation (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Sol 7:12; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently) of the plain and uncoloured expression ארחץ. He wishes to wash his hands in innocence (בּ of the state that is meant to be attested by the action), and compass (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the altar of Jahve. That which is elsewhere a symbolic act (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 27:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is in this instance only a rhetorical figure made use of to confess his consciousness of innocence; and it naturally assumes this form (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from the idea of the priest washing his hands preparatory to the service of the altar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) being associated with the idea of the altar. And, in general, the expression of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 26:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". takes a priestly form, without exceeding that which the ritual admits of, by virtue of the consciousness of being themselves priests which appertained even to the Israelitish laity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For סבב can be used even of half encompassing as it were like a semi-circle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), no matter whether it be in the immediate vicinity of, or at a prescribed distance from, the central point. לשׁמע is a syncopated and defectively written Hiph., for להשׁמיע, like לשׁמד, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 23:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of לשׁמע קול תּודה, \"to cause the voice of thanksgiving to be heard,\" since השׁמיע is used absolutely (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the object is conceived of as the instrument of the act (Ges. 138, 1, rem. 3), it is \"in order to strike in with the voice of thanksgiving.\" In the expression \"all Thy wondrous works\" is included the latest of these, to which the voice of thanksgiving especially refers, viz., the bringing of him home from the exile he had suffered from Absolom. Longing to be back again he longs most of all for the gorgeous services in the house of his God, which are performed around the altar of the outer court; for he loves the habitation of the house of God, the place, where His doxa, - revealed on earth, and in fact revealed in grace, - has taken up its abode. ma`own does not mean refuge, shelter (Hupfeld), - for although it may obtain this meaning from the context, it has nothing whatever to do with Arab. ‛ân, med. Waw, in the signification to help (whence ma‛ûn, ma‛ûne, ma‛âne, help, assistance, succour or support), - but place, dwelling, habitation, like the Arabic ma‛ân, which the Kamus explains by menzil, a place to settle down in, and explains etymologically by Arab. mḥll 'l-‛ı̂n, i.e., \"a spot on which the eye rests as an object of sight;\" for in the Arabic ma‛ân is traced back to Arab. ‛ân, med. Je, as is seen from the phrase hum minka bi-ma‛ânin, i.e., they are from thee on a point of sight ( equals  on a spot where thou canst see them from the spot on which thou standest). The signification place, sojourn, abode (Targ. מדור) is undoubted; the primary meaning of the root is, however, questionable. ",
        "children": []
      }
    ]
  }
]