[{"header":"Our Salvation Is Greater Than the Law"},{"num":2,"verse":"So we must be more careful to follow what we were taught. We must be careful so that we will not be pulled away from the true way."},{"num":2,"verse":"The teaching that God spoke through angels was shown to be true. And every time his people did something against that teaching, they were punished for what they did. They were punished when they did not obey that teaching."},{"num":3,"verse":"So surely we also will be punished if we don’t pay attention to the salvation we have that is so great. It was the Lord Jesus who first told people about it. And those who heard him proved to us that it is true."},{"num":4,"verse":"God also proved it by using miraculous signs, wonders, and all kinds of miracles. And he proved it by giving people various gifts through the Holy Spirit in just the way he wanted."},{"header":"Christ Became Like People to Save Them"},{"num":5,"verse":"God did not choose angels to be the rulers over the new world that was coming. That future world is the world we have been talking about."},{"num":6,"verse":"It is written some place in the Scriptures,"},{"num":9,"verse":"For a short time Jesus was made lower than the angels, but now we see him wearing a crown of glory and honor because he suffered and died. Because of God’s grace, Jesus died for everyone."},{"num":10,"verse":"God—the one who made all things and for whose glory all things exist—wanted many people to be his children and share his glory. So he did what he needed to do. He made perfect the one who leads those people to salvation. He made Jesus a perfect Savior through his suffering."},{"num":11,"verse":"Jesus, the one who makes people holy, and those who are made holy are from the same family. So he is not ashamed to call them his brothers and sisters."},{"num":12,"verse":"He says,"},{"num":13,"verse":"He also says,"},{"num":14,"verse":"These children are people with physical bodies. So Jesus himself became like them and had the same experiences they have. Jesus did this so that, by dying, he could destroy the one who has the power of death—the devil."},{"num":15,"verse":"Jesus became like these people and died so that he could free them. They were like slaves all their lives because of their fear of death."},{"num":16,"verse":"Clearly, it is not angels that Jesus helps. He helps the people who are from Abraham."},{"num":17,"verse":"For this reason, Jesus had to be made like us, his brothers and sisters, in every way. He became like people so that he could be their merciful and faithful high priest in service to God. Then he could bring forgiveness for the people’s sins."},{"num":18,"verse":"And now he can help those who are tempted. He is able to help because he himself suffered and was tempted."}]