[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XIII.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) There is a difference of opinion as to the construction and rendering of this verse. We adopt the interpretation, When Ephraim uttered terror, he rebelled in Israel; then he committed sin through Baal, and died. This points to the revolt of the Ten Tribes, and the consequent abandonment of the pure traditions of Jehovah worship for those of Baal. This idea and that of the previous verse (Hosea 12:14) may have been brought into prominence by the recent untoward antagonism aroused by the Syro-Ephraimitish war against Judah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) There is a difference of opinion as to the construction and rendering of this verse. We adopt the interpretation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "When Ephraim uttered terror, he rebelled in Israel; then he committed sin through Baal, and died.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " This points to the revolt of the Ten Tribes, and the consequent abandonment of the pure traditions of Jehovah worship for those of Baal. This idea and that of the previous verse (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") may have been brought into prominence by the recent untoward antagonism aroused by the Syro-Ephraimitish war against Judah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 13:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When Ephraim spake trembling, he exalted himself — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "While he behaved himself submissively and obediently, and humbled himself before God, he was reckoned among the principal tribes of Israel. Here Ephraim is spoken of as distinct from the other tribes: in other places of this prophecy he is put for the whole kingdom of the ten tribes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But when he offended in Baal, he died — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When he gave himself to idolatry, his strength immediately declined, and had manifest symptoms of ruin and destruction. Bishop Horsley’s version of the verse is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When Ephraim spake there was dread: he was exalted in Israel. But he offended in Baal and died — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“The former part of the verse describes the consequence and pre-eminence of Ephraim in his own country, and among the neighbouring nations; the latter part, his diminution and loss of consequence by his idolatry.” The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Baal ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is here taken in a general sense for all false gods or idolatrous ways of worship, so as to comprehend the worship of the golden calves, though they were designed for symbolical representations of the true God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-8 While Ephraim kept up a holy fear of God, and worshipped Him in that fear, so long he was very considerable. When Ephraim forsook God, and followed idolatry, he sunk. Let the men that sacrifice kiss the calves, in token of their adoration of them, affection for them, and obedience to them; but the Lord will not give his glory to another, and therefore all that worship images shall be confounded. No solid, lasting comfort, is to be expected any where but in God. God not only took care of the Israelites in the wilderness, he put them in possession of Canaan, a good land; but worldly prosperity, when it feeds men's pride, makes them forgetful of God. Therefore the Lord would meet them in just vengeance, as the most terrible beast that inhabited their forests. Abused goodness calls for greater severity.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Ephraim spake trembling - that is, probably \"there was 'trembling.'\" : \"Ephraim was once very awful, so as, while he spake, the rest of the tribes were ready to tremble.\" The prophet contrasts two conditions of Ephraim, of prosperity, and destruction. His prosperity he owed to the undeserved mercy of God, who blessed him for Joseph's sake; his destruction, to his own sin. There is no period recorded, \"when Ephraim spake trembling,\" i. e., in humility. Pride was his characteristic, almost as soon as he had a separate existence as a tribe (see the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Under Joshua, it could not be called out, for Ephraim gained honor, when Joshua, one of themselves, became the captain of the Lord's people. Under the Judges, their pride appeared. Yet God tried them, by giving them their hearts' desire. They longed to be exalted, and He satisfied them, if so be they would thus serve Him. They had the chief power, and were a \"terror\" to Judah. \"He exalted himself,\" (or perhaps \"he was exalted,) in Israel; but when he offended in Baal he died;\" literally, \"and he offended in Baal and died.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He abused the goodness of God; his sin followed as a consequence of God's goodness to him. God raised him, and he offended. The alliance with a king of Tyre and Sidon, which brought in the worship of Baal, was a part of the worldly policy of the kings of Israel (1 Kings 16:31, see Introduction). \"As if it had been a light thing for him to walk in the sins of Jeroboam the son of Nebat, he took to wife the daughter of Ethbaal, king of the Zidonians, and went and served Baal and worshiped him.\" The twenty-two years of Ahab's reign established the worship. The prophets of Baal became 450; the prophets of the kindred idolatry of Ashtoreth, or Astarte, became 400; Baal had his one central temple, large and magnificent 2 Kings 10:21-22, 2 Kings 10:25, a rival of that of God. The prophet Elijah thought the apostasy almost universal; God revealed to him that He had \"reserved\" to Himself \"seven thousand in Israel.\" Yet these were \"all the knees which had not bowed to Baal, and every mouth which had not kissed him\" 1 Kings 19:18.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He abused the goodness of God; his sin followed as a consequence of God's goodness to him. God raised him, and he offended. The alliance with a king of Tyre and Sidon, which brought in the worship of Baal, was a part of the worldly policy of the kings of Israel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 16:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", see Introduction). \"As if it had been a light thing for him to walk in the sins of Jeroboam the son of Nebat, he took to wife the daughter of Ethbaal, king of the Zidonians, and went and served Baal and worshiped him.\" The twenty-two years of Ahab's reign established the worship. The prophets of Baal became 450; the prophets of the kindred idolatry of Ashtoreth, or Astarte, became 400; Baal had his one central temple, large and magnificent ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 10:21-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 10:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", a rival of that of God. The prophet Elijah thought the apostasy almost universal; God revealed to him that He had \"reserved\" to Himself \"seven thousand in Israel.\" Yet these were \"all the knees which had not bowed to Baal, and every mouth which had not kissed him\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 19:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And died - Death is the penalty of sin. Ephraim \"died\" spiritually. For sin takes away the life of grace, and separates from God, the true life of the soul, the source of all life. He \"died more truly, than he who is dead and at rest.\" Of this death, our Lord says, \"Let the dead bury their dead\" Matthew 8:22; and Paul, \"She who liveth in pleasure is dead while she liveth\" 1 Timothy 5:6. He \"died\" also as a nation and kingdom, being sentenced by God to cease to be. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And died - Death is the penalty of sin. Ephraim \"died\" spiritually. For sin takes away the life of grace, and separates from God, the true life of the soul, the source of all life. He \"died more truly, than he who is dead and at rest.\" Of this death, our Lord says, \"Let the dead bury their dead\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 8:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Paul, \"She who liveth in pleasure is dead while she liveth\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He \"died\" also as a nation and kingdom, being sentenced by God to cease to be. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 13",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ho 13:1-16. Ephraim's Sinful Ingratitude to God, and Its Fatal Consequence; God's Promise at Last.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This chapter and the fourteenth chapter probably belong to the troubled times that followed Pekah's murder by Hoshea (compare Ho 13:11; 2Ki 15:30). The subject is the idolatry of Ephraim, notwithstanding God's past benefits, destined to be his ruin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. When Ephraim spake trembling—rather, \"When Ephraim (the tribe most powerful among the twelve in Israel's early history) spake (authoritatively) there was trembling\"; all reverentially feared him [Jerome], (compare Job 29:8, 9, 21).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "offended in Baal—that is, in respect to Baal, by worshipping him (1Ki 16:31), under Ahab; a more heinous offense than even the calves. Therefore it is at this climax of guilt that Ephraim \"died.\" Sin has, in the sight of God, within itself the germ of death, though that death may not visibly take effect till long after. Compare Ro 7:9, \"Sin revived, and I died.\" So Adam in the day of his sin was to die, though the sentence was not visibly executed till long after (Ge 2:17; 5:5). Israel is similarly represented as politically dead in Eze 37:1-28.Ephraim’s glory vanisheth by reason of idolatry, Hosea 13:1-3. God’s former care of his people: for their abuse of his benefits he will destroy them, Hosea 13:4-8. A promise of mercy and redemption from the grave, Hosea 13:9-14. The judgment of Samaria for rebellion, Hosea 13:15,16.  When; so soon as, or according as,  as the Hebrew phrase bears it, and implieth there was a time when according to the word of Ephraim there was deep impression on the hearers. Ephraim; Jeroboam son of Nebat, an Ephraimite, say some; but this is wide of truth, nor suits the text, which refers to their worshipping of Baal, and this came into use in Israel in Ahab’s time, 1 Kings 16:31; his wife Jezebel, daughter to Ethbaal king of the Zidonians, prevailed with him to take her country idol and add to Jeroboam’s calves. Ephraim here is either the tribe of Ephraim, which was of all the ten tribes most powerful, and when angry and discontented made the other tribes afraid; or rather the whole kingdom of Israel, called frequently in Hosea Ephraim. Spake;  when he consulted, commanded, threatened, or sent out his proclamation; it is a speaking like a king’s or kingdom’s speaking, which is backed with power sufficient to act as they speak; trembling;  the tribes and the neighbouring kingdoms apprehended danger, were put into a fear of the consequence too, all men felt a commotion within them. Such once was the authority, power, and glory of Ephraim. He exalted himself in Israel;  was magnified, advanced, and made glorious, the kingdom flourished in multitudes of people, in abundance of wealth, in the successes of their counsels, and in their credit abroad. In this flourishing state Ephraim, a principal tribe, and which first set up for the royal dignity and carried it, had-principal share, and is mid to exalt himself in or with Israel. But when,  so soon as he sinned, he offended in Baal,  by taking Baal to be their god added this idolatry to their former sins, he died;  undid himself, lost his power, glory, and bravery, as a dead man. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "offended in Baal—that is, in respect to Baal, by worshipping him (1Ki 16:31), under Ahab; a more heinous offense than even the calves. Therefore it is at this climax of guilt that Ephraim \"died.\" Sin has, in the sight of God, within itself the germ of death, though that death may not visibly take effect till long after. Compare Ro 7:9, \"Sin revived, and I died.\" So Adam in the day of his sin was to die, though the sentence was not visibly executed till long after (Ge 2:17; 5:5). Israel is similarly represented as politically dead in Eze 37:1-28.Ephraim’s glory vanisheth by reason of idolatry, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 13:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God’s former care of his people: for their abuse of his benefits he will destroy them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 13:4-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A promise of mercy and redemption from the grave, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 13:9-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The judgment of Samaria for rebellion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 13:15,16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "When; so soon as, or according as, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the Hebrew phrase bears it, and implieth there was a time when according to the word of Ephraim there was deep impression on the hearers. Ephraim; Jeroboam son of Nebat, an Ephraimite, say some; but this is wide of truth, nor suits the text, which refers to their worshipping of Baal, and this came into use in Israel in Ahab’s time, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Kings 16:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; his wife Jezebel, daughter to Ethbaal king of the Zidonians, prevailed with him to take her country idol and add to Jeroboam’s calves. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Ephraim",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " here is either the tribe of Ephraim, which was of all the ten tribes most powerful, and when angry and discontented made the other tribes afraid; or rather the whole kingdom of Israel, called frequently in Hosea Ephraim. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Spake; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " when he consulted, commanded, threatened, or sent out his proclamation; it is a speaking like a king’s or kingdom’s speaking, which is backed with power sufficient to act as they speak; ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "trembling; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the tribes and the neighbouring kingdoms apprehended danger, were put into a fear of the consequence too, all men felt a commotion within them. Such once was the authority, power, and glory of Ephraim. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "He exalted himself in Israel; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " was magnified, advanced, and made glorious, the kingdom flourished in multitudes of people, in abundance of wealth, in the successes of their counsels, and in their credit abroad. In this flourishing state Ephraim, a principal tribe, and which first set up for the royal dignity and carried it, had-principal share, and is mid to exalt himself in or with Israel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "But when, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " so soon as he sinned, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "he offended in Baal, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by taking Baal to be their god added this idolatry to their former sins, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "he died; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " undid himself, lost his power, glory, and bravery, as a dead man. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Ephraim spake trembling, he exalted himself in Israel,.... Or, with trembling, as Jarchi: so Jeroboam, who was of the tribe of Ephraim, spake before Solomon, a great king, as he observes. R. Moses the priest interprets it of Jeroboam; but it may be understood of the tribe in general, and especially of the heads of it, at anytime before it fell into idolatry; when they spake with submission and humility, they were attended to by the other tribes in all consultations and debates, and great deference was paid unto them; and they were find in great esteem, and highly honoured, agreeably to that common saving of our Lord, \"he that humbleth himself shall be exalted\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, \"when he spake there was trembling\" (q); either the neighbouring nations, when he threatened them with war: or among the other tribes of Israel, when he spake in counsel, and with authority, they rose up and heard him with great reverence and respect; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"when anyone of the house of Ephraim spake, trembling laid hold on the people; they became princes in Israel.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Some refer this to the times of Joshua, who was of that tribe, and whom the Israelites feared as they had feared Moses, Joshua 4:14; others to the times of Gideon and Jephthah, with whom the tribe of Ephraim expostulated, Judges 8:1; but others interpret it of Jeroboam's idolatry, of his setting up the worship of the calves, which he did upon his exalting himself, and setting himself up as king of the ten tribes; and, in some agreement with this, Schmidt understands, by \"trembling\", a terrible and horrible thing, idolatry, which he commanded and appointed; and which he \"bore\" or \"carried\", as the word (r) is interpreted by him, and may be; that is, his sin, and the punishment of it, which Jeroboam and his posterity did bear; and so it agrees with what follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Some refer this to the times of Joshua, who was of that tribe, and whom the Israelites feared as they had feared Moses, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; others to the times of Gideon and Jephthah, with whom the tribe of Ephraim expostulated, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but others interpret it of Jeroboam's idolatry, of his setting up the worship of the calves, which he did upon his exalting himself, and setting himself up as king of the ten tribes; and, in some agreement with this, Schmidt understands, by \"trembling\", a terrible and horrible thing, idolatry, which he commanded and appointed; and which he \"bore\" or \"carried\", as the word (r) is interpreted by him, and may be; that is, his sin, and the punishment of it, which Jeroboam and his posterity did bear; and so it agrees with what follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "but, or \"and\", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when he offended in Baal, he died; or when he sinned, and became guilty of more idolatry still, by worshipping Baal, as well as the calves, which was done in the times of Ahab, 1 Kings 16:31; when Ephraim or the kingdom or Israel fell into distresses and calamities, sunk in their grandeur and authority, declined in their wealth and riches, and were insulted by their enemies, particularly by Benhadad king of Syria, who sent to Ahab, and challenged his silver and gold, his wives and children, as his own, 1 Kings 20:3; and so they gradually decreased in credit and reputation, in power and authority, in wealth and substance, and at last were delivered to the sword of the enemy, and to captivity, which was their civil death. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "when he offended in Baal, he died; or when he sinned, and became guilty of more idolatry still, by worshipping Baal, as well as the calves, which was done in the times of Ahab, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 16:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; when Ephraim or the kingdom or Israel fell into distresses and calamities, sunk in their grandeur and authority, declined in their wealth and riches, and were insulted by their enemies, particularly by Benhadad king of Syria, who sent to Ahab, and challenged his silver and gold, his wives and children, as his own, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so they gradually decreased in credit and reputation, in power and authority, in wealth and substance, and at last were delivered to the sword of the enemy, and to captivity, which was their civil death. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) \"quum loqueretur--tremor erat\", Pagninus, Vatablus; \"terror erat\", Zanchius, Drusius. (r)  \"portavit ipse, sub. iniquitatem suam\", Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) \"quum loqueretur--tremor erat\", Pagninus, Vatablus; \"terror erat\", Zanchius, Drusius. (r)  \"portavit ipse, sub. iniquitatem suam\", Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When Ephraim spake {a} trembling, he {b} exalted himself in Israel; but when he offended in Baal, {c} he died.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When Ephraim spake ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " trembling, he ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " exalted himself in Israel; but when he offended in Baal, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he died.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) He shows the excellency and authority that this tribe had above all the rest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) He made a king of his tribe.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The Ephraimites are not far from destruction, and have lost their authority.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When Ephraim spake trembling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The Hebrew is difficult, and the soundness of the text is perhaps questionable. At any rate, the rendering will depend on one’s impression of the requirements of the context. To the present writer, no translation appears preferable to that of King James’s Bible, and he has a pleasure in finding himself in accord with this version, which must of necessity rarely be the case in obscure passages. The single objection to the rendering is that expressed by Mr Huxtable in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Speaker’s Commentary",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz. that it ‘would give to the tribe of Ephraim a character out of harmony alike with Hosea’s description of it in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and with the history.’ But the passage referred to requires to be explained differently, and as to the history of the tribe, we are not here concerned with the facts as viewed critically, but as they presented themselves to a preacher in search of edification. Hosea has once already pointed the people of Israel to the golden age of the past, when Israel as a whole was comparable to ‘grapes in the wilderness’ and ‘the firstripe in the fig tree’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see note); he conceives of Jehovah as kindly overlooking the human frailty of his child in consideration of Israel’s latent possibilities. ‘When Ephraim spake trembling’, &c., may therefore be expanded thus, ‘When the Ephraimites in trembling accents responded to the divine call (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), they rose to the exalted position which its prophetic ancestor foreshadowed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:22-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").’ The reference is partly to the leadership of the Ephraimite Joshua, partly to the prosperity which attended the tribe of Ephraim even when it no longer supplied a general, a judge, or a king to the entire nation. The other chief renderings are, ‘When Ephraim spake, [there was] terror’, &c., i.e., men listened to Ephraim with fear and trembling; and, ‘When Ephraim spake of revolt (?), [and] lifted itself up [as a rebel] in Israel’, continuing in the next clause, ‘it became guilty through Baal, and died.’ In the latter case, the reference is to the revolt of the Ten Tribes, and the public sanction then given to a retrograde religion. The advantage of this view is that it enables us to give precisely the same meaning to Ephraim in both parts of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 13:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; but as the text stands, the writer feels unable to accept it, as the sense of ‘revolt’ cannot be justified. It is very possible that the text is corrupt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but when he offended in Baal, he died",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, if the Authorized Version’s view of the meaning be retained, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "but he became guilty through the Baal, and died.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That is, in course of time, the Ten Tribes severed themselves definitely from the progressive teaching of the higher spiritual prophecy, and by so doing sealed their doom as a nation. The Baal-worship spoken of is not the form of religion against which Elijah thundered; that was introduced from Phœnicia, whereas a simpler but still idolatrous worship was offered by the northern Israelites to Jehovah under the name of ‘Baal’ (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Finding a multitude of Canaanitish sacred places dedicated each to its own ‘Baal’ or patron-deity, they forthwith identified this Baal with their own Jehovah, and so fell under the same condemnation as their heathen predecessors. They failed to go forward with Amos and Hosea, and so they could not but fall behind to a degenerate and lower type of religion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "died",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Ephraim was ‘dead while he lived’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Dante, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Inferno",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " XXXIII. 139–157). So ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘in the day that thou eatest thereof, thou shalt surely die.’ Till Adam ate of the forbidden fruit, there was the hope that, though not created immortal, he might yet be exempted from decay and death. So, till Ephraim deliberately corrupted his religion, there was always the possibility that God might recognize him as a permanent factor in the religious history of the world. Comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Israel signed his own death-warrant when he lapsed into Baal-worship. Foolish as it is to ‘kiss calves’, they persist in the practice. Therefore the nation can but drift away, like cloud, or chaff, or smoke. How little Jehovah deserves such treatment! But Israel’s destruction has already begun: they shall be torn piecemeal.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When Ephraim spake trembling, he exalted himself in Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This rendering of the Authorized Version ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is supported by the Syriac, which is: \"When Ephraim spake trembling, then he was, and was great in Israel.\" Rashi has a similar rendering of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "retheth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is an ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἅπαξ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "λεγόμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and causes the diversity of translation in this clause; but his exposition of the whole sentence is vague and unsatisfactory. Referring it to Jeroboam of the tribe of Ephraim, he explains as follows: \"When Jeroboam, zealous for God, spoke against Solomon hard words, and with terror, Solomon was a great king.\" Pococke's exposition is in harmony with the Authorized Version, and is the following: \"When Ephraim spake with fear and trembling (like his forefather Jacob, in his humble supplication to God), he exalted himself in Israel.\" But ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the rendering adopted by most moderns, is decidedly preferable, as agreeing better with the context, and much more in bar-runny with tribal characteristics of Ephraim, as intimated in this very book, and exhibited elsewhere. The translation we thus prefer is: \"When Ephraim spake, there was trembling; he, even he, exalted himself in Israel.\" Such was the fear inspired, and the deference paid to the authority of that powerful tribe. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "reheth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though not found elsewhere, has a cognate root in Aramaic, with the meaning here assigned to it; for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "רתת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to fear, shudder, tremble; there is also, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "רֶטֶט",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equivalent to \"fear,\" similar in both sense and sound. The Chaldee supports this rendering; its paraphrase is: \"When one of the house of Ephraim spake, trembling seized the peoples.\" Also Aben Ezra and Kimchi. The former's brief comment is: \"Before his speaking the peoples were afraid; and the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "רתת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has no analogue except in the Aramaic.\" Kimchi's explanation is, \"From the beginning, before Ephraim sinned, the fear of him was great over the peoples who surrounded him; for when he spake, fear and trembling were wont to seize him who heard him; and he was great and strong among the tribes of Israel, as it was said of him, ' And his seed shall be a multitude of nations.'\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The LXX. renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "reheth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "δικαιώματα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", thus:\" According to the word of Ephraim, be adopted ordinances for himself in Israel,\" that is, when Ephraim spoke, the rest of the Israelites assented to his ordinances and rights, reverencing his authority, so that the general sense differs little from the Chaldee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rosenmüller constructs and explains differently; his exposition runs somehow thus: \"When Ephraim spake, instituting that horrible worship of the calves, he himself bore the sin of that horrible dictum, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was guilty of, and bore its punishment.\" This explanation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נשא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is farfetched and unnatural. We have no hesitation in preferring \"lifted up,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his head, or exalted himself, for, though it is usually the Hithp. that is employed in this sense, examples also occur in which Qal is so used, for example ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Kimchi supplies ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "rosho",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We adhere, therefore, to the rendering and exposition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But when he offended in Baal, he died.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This was not merely the calf-worship which, for political reasons, Jeroboam instituted and his successors retained, but the worship of Baal for which, no doubt, the calf-worship had prepared the way, and which had been introduced by Ahab at the instigation of his Sidonian queen. And though the people were partially and temporarily reformed through the efforts of Elijah the prophet and by the royal authority of Jehu, son of Nimshi, the evil was not eradicated, but frequently broke out again. The exaltation of Ephraim was not so much his distinction among his brethren as the governmental predominance at which that tribe ever aimed. That elevation, however, was soon followed by religious declension, culminating in the idolatry of Baal, which soon sealed the doom of the northern kingdom, thenceforth given up to destruction. The sentence of death was pronounced, and the actual dying commenced with the introduction of idolatrous worship. Thus, correctly, Kimchi: \"He lifted up his head in Israel. And after he offended in Baal he died, as if he said, he was beaten before his enemies, as if he were dead, the power of his hand had departed.\" Hosea 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Because Israel would not desist from its idolatry, and entirely forgot the goodness of its God, He would destroy its might and glory (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Because it did not acknowledge the Lord as its help, its throne would be annihilated along with its capital; but this judgment would become to all that were penitent a regeneration to newness of life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"When Ephraim spake, there was terror; he exalted himself in Israel; then he offended through Baal, and died. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And now they continue to sin, and make themselves molten images out of their silver, idols according to their understanding: manufacture of artists is it all: they say of them, Sacrificers of men: let them kiss calves.\" In order to show how deeply Israel had fallen through its apostasy, the prophet points to the great distinction which the tribe of Ephraim formerly enjoyed among the tribes of Israel. The two clauses of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cannot be so connected together as that נשׂא should be taken as a continuation of the infinitive דּבּר. The emphatic הוּא is irreconcilable with this. We must rather take רתת (ἁπ. λεγ., in Aramaean  equals  רטט, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", terror, tremor) as the apodosis to kedabbēr 'Ephraim (when Ephraim spake), like שׂאת in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"As Ephraim spake there was terror,\" i.e., men listened with fear and trembling (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). נשׂא is used intransitively, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Ephraim, i.e., the tribe of Ephraim, \"exalted itself in Israel,\" - not \"it was distinguished among its brethren\" (Hitzig), but \"it raised itself to the government.\" The prophet has in his mind the attempts made by Ephraim to get the rule among the tribes, which led eventually to the secession of the ten tribes from the royal family of David, and the establishment of the kingdom of Israel by the side of that of Judah. When Ephraim had secured this, the object of its earnest endeavours, it offended through Baal; i.e., not only through the introduction of the worship of Baal in the time of Ahab (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 16:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), but even through the establishment of the worship of the calves under Jeroboam (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), through which Jehovah was turned into a Baal. ויּמת, used of the state or kingdom, is equivalent to \"was given up to destruction\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The dying commenced with the introduction of the unlawful worship (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). From this sin Ephraim (the people of the ten tribes) did not desist: they still continue to sin, and make themselves molten images, etc., contrary to the express prohibition in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These words are not merely to be understood as signifying, that they added other idolatrous images in Gilgal and Beersheba to the golden calves (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but they also involve their obstinate adherence to the idolatrous worship introduced by Jeroboam (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 17:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). בּתבוּדם from תּבוּנה, with the feminine termination dropped on account of the suffix (according to Ewald, 257, d; although in the note Ewald regards this formation as questionable, and doubts the correctness of the reading): \"according to their understanding,\" i.e., their proficiency in art.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The meaning of the second hemistich, which is very difficult, depends chiefly upon the view we take of זבחי אדם, viz., whether we render these words \"they who sacrifice men,\" as the lxx, the fathers, and many of the rabbins and Christian expositors have done; or \"the sacrificers of (among) men,\" as Kimchi, Bochart, Ewald, and others do, after the analogy of אביוני אדם in Isaiah 29:19. Apart from this, however, zōbhechē 'âdâm cannot possibly be taken as an independent sentence, such as \"they sacrifice men,\" or \"human sacrificers are they,\" unless with the lxx we change the participle זבחי arbitrarily into the perfect זבחוּ. As the words read, they must be connected with what follows or with what precedes. But if we connect them with what follows, we fail to obtain any suitable thought, whether we render it \"human sacrificers (those who sacrifice men) kiss calves,\" or \"the sacrificers among men kiss calves.\" The former is open to the objection that human sacrifices were not offered to the calves (i.e., to Jehovah, as worshipped under the symbol of a calf), but only to Moloch, and that the worshippers of Moloch did not kiss calves. The latter, \"men who offer sacrifice kiss calves,\" might indeed be understood in this sense, that the prophet intended thereby to denounce the great folly, that men should worship animals; but this does not suit the preceding words הם אמרים, and it is impossible to see in what sense they could be employed. There is no other course left, therefore, than to connect Zōbhechē 'âdâm with what precedes, though not in the way proposed by Ewald, viz., \"even to these do sacrificers of men say.\" This rendering is open to the following objections: (1) that הם after להם would have to be taken as an emphatic repetition of the pronoun, and we cannot find any satisfactory ground for this; and, (2) what is still more important, the fact that 'âmâr would be used absolutely, in the sense of \"they speak in prayer,\" which, even apart from the \"prayer,\" cannot be sustained by any other analogous example. These difficulties vanish if we take Zōbhechē 'âdâm as an explanatory apposition to hēm: \"of them (the ‛ătsabbı̄m) they say, viz., the sacrificers from among men (i.e., men who sacrifice), Let them worship calves.\" By the apposition zōbhechē 'âdâm, and the fact that the object ‛ăgâlı̄m is placed first, so that it stands in immediate contrast to 'âdâm, the absurdity of men kissing calves, i.e., worshipping them with kisses (see at 1 Kings 19:18), is painted as it were before the eye. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The meaning of the second hemistich, which is very difficult, depends chiefly upon the view we take of זבחי אדם, viz., whether we render these words \"they who sacrifice men,\" as the lxx, the fathers, and many of the rabbins and Christian expositors have done; or \"the sacrificers of (among) men,\" as Kimchi, Bochart, Ewald, and others do, after the analogy of אביוני אדם in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Apart from this, however, zōbhechē 'âdâm cannot possibly be taken as an independent sentence, such as \"they sacrifice men,\" or \"human sacrificers are they,\" unless with the lxx we change the participle זבחי arbitrarily into the perfect זבחוּ. As the words read, they must be connected with what follows or with what precedes. But if we connect them with what follows, we fail to obtain any suitable thought, whether we render it \"human sacrificers (those who sacrifice men) kiss calves,\" or \"the sacrificers among men kiss calves.\" The former is open to the objection that human sacrifices were not offered to the calves (i.e., to Jehovah, as worshipped under the symbol of a calf), but only to Moloch, and that the worshippers of Moloch did not kiss calves. The latter, \"men who offer sacrifice kiss calves,\" might indeed be understood in this sense, that the prophet intended thereby to denounce the great folly, that men should worship animals; but this does not suit the preceding words הם אמרים, and it is impossible to see in what sense they could be employed. There is no other course left, therefore, than to connect Zōbhechē 'âdâm with what precedes, though not in the way proposed by Ewald, viz., \"even to these do sacrificers of men say.\" This rendering is open to the following objections: (1) that הם after להם would have to be taken as an emphatic repetition of the pronoun, and we cannot find any satisfactory ground for this; and, (2) what is still more important, the fact that 'âmâr would be used absolutely, in the sense of \"they speak in prayer,\" which, even apart from the \"prayer,\" cannot be sustained by any other analogous example. These difficulties vanish if we take Zōbhechē 'âdâm as an explanatory apposition to hēm: \"of them (the ‛ătsabbı̄m) they say, viz., the sacrificers from among men (i.e., men who sacrifice), Let them worship calves.\" By the apposition zōbhechē 'âdâm, and the fact that the object ‛ăgâlı̄m is placed first, so that it stands in immediate contrast to 'âdâm, the absurdity of men kissing calves, i.e., worshipping them with kisses (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 19:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is painted as it were before the eye. ",
            "children": []
          }
        ]
      }
    ]
  }
]