[[],[{"type":"header","content":"War with Aram"},{"type":"prose","content":"Ben-hadad king of Aram (Syria) gathered all his army together; thirty-two kings were [allied] with him, with horses and chariots. And he went up and besieged Samaria [Israel’s capital], and fought against it. "}],[{"type":"prose","content":"Then he sent messengers to the city to Ahab king of Israel; and he said to him, “Thus says Ben-hadad: "}],[{"type":"prose","content":"‘Your silver and your gold are mine; your wives and your children, even the fairest, also are mine [as conditions of peace].’” "}],[{"type":"prose","content":"The king of Israel [conceded his defeat and] answered, “By your word, my lord, O king, I am yours, and all that I have.” "}],[{"type":"prose","content":"The messengers returned and said, “Thus says Ben-hadad: ‘I indeed sent  to you, saying, “You shall give me your silver, your gold, your wives, and your children,” "}],[{"type":"prose","content":"but about this time tomorrow I will send my servants to you, and they will search your house and the houses of your servants; and they will take with their hands (confiscate) whatever is desirable in your eyes and carry it away.’”"}],[{"type":"prose","content":"Then the king of Israel summoned all the elders of the land and said, “Please observe and see how this man is seeking our destruction. For he sent  to me for my wives, my children, my silver, and my gold, and I did not refuse him.” "}],[{"type":"prose","content":"All the elders and all the people said to him, “Do not listen or consent [to this additional demand].” "}],[{"type":"prose","content":"So he said to Ben-hadad’s messengers, “Tell my lord the king, ‘Every  you first sent to your servant I will do, but I cannot do this [additional] thing [as a condition of peace].’” And the messengers left; then they brought him word again. "}],[{"type":"prose","content":"Ben-hadad sent  to him and said, “May the gods do so to me, and more also, if there is enough dust left of Samaria for handfuls for all the [armed] people who follow me.” "}],[{"type":"prose","content":"The king of Israel answered, “Tell him, ‘A man who puts on [his armor to go to battle] should not boast like the man who takes it off [after the battle has been won].’” "}],[{"type":"prose","content":"When Ben-hadad heard this message, as he and the kings were drinking in the temporary shelters, he said to his servants, “Station .” So they stationed  against the city [of Samaria]."}],[{"type":"header","content":"Ahab Victorious"},{"type":"prose","content":"Then a prophet approached Ahab king of Israel and said, “Thus says the LORD: ‘Have you seen all this great army? Behold, I will hand them over to you, and you shall know [without any doubt] that I am the LORD.’” "}],[{"type":"prose","content":"Ahab said, “By whom?” And he said, “Thus says the LORD: ‘By the young men [the attendants or bodyguards] of the governors of the districts.’” Then Ahab said, “Who shall begin the battle?” And he answered, “You.” "}],[{"type":"prose","content":"Then Ahab assembled  counted the young men of the governors of the districts, and there were 232. After them he assembled  counted all the people, all the sons of Israel, 7,000."}],[{"type":"prose","content":"They went out at noon, while Ben-hadad was getting drunk in the temporary shelters, he and the thirty-two kings who were helping him. "}],[{"type":"prose","content":"The young men of the governors of the districts went out first; and Ben-hadad sent  out and they told him, saying, “Men have come out of Samaria.” "}],[{"type":"prose","content":"And he said, “Whether they have come out for peace or for war, take them alive.”"}],[{"type":"prose","content":"So these young men of the governors of the districts went out of the city, and the army followed them. "}],[{"type":"prose","content":"And each one killed his man; and the Arameans (Syrians) fled and Israel pursued them. Ben-hadad king of Aram escaped on a horse with horsemen. "}],[{"type":"prose","content":"The king of Israel went out and struck [the riders of] the horses and chariots, and killed the Arameans in a great slaughter."}],[{"type":"prose","content":"Then the prophet approached the king of Israel and said to him, “Go, strengthen yourself and observe and see what you have to do; for at the first of next year the king of Aram (Syria) will come up against you.”"}],[{"type":"prose","content":"Now the servants of the king of Aram said to him, “Israel’s god is a god of the hills; that is why they were stronger than we. But let us fight against them in the plain, and surely we will be stronger than they. "}],[{"type":"prose","content":"Do this: remove the [thirty-two allied] kings, each from his place, and put captains in their place, "}],[{"type":"prose","content":"and assemble an army like the army that you have lost , horse for horse and chariot for chariot. Then we will fight against them in the plain, and surely we shall be stronger than they.” And he listened to their words and did so."}],[{"type":"header","content":"Another Aramean War"},{"type":"prose","content":"At the first of the year [in spring], Ben-hadad assembled  counted the Arameans (Syrians) and went up to Aphek [east of the Sea of Galilee] to fight against Israel. "}],[{"type":"prose","content":"The sons of Israel were counted and given provisions, and they went to meet them. The Israelites camped before the enemy like two little flocks of goats [with everything against them, except God], and the Arameans filled the country. "}],[{"type":"prose","content":"A man of God approached and said to the king of Israel, “Thus says the LORD, ‘Because the Arameans have said, “The LORD is a god of the hills, but He is not a god of the valleys,” I will give this great army into your hand, and you shall know [by experience] that I am the LORD.’” "}],[{"type":"prose","content":"So they camped opposite each other for seven days. Then on the seventh day the battle began, and the sons of Israel killed 100,000 of the Aramean foot soldiers in a single day. "}],[{"type":"prose","content":"But the rest ran to the city of Aphek, and the [city] wall fell on 27,000 of the men who were left. Ben-hadad escaped and came into the city, going into an inner chamber [to hide]."}],[{"type":"prose","content":"But his servants said to him, “We have heard that the kings of the house (royal line) of Israel are merciful kings. Please let us put sackcloth around our loins and ropes on our necks [as symbols of submission], and go out to the king of Israel; perhaps he will spare your life.” "}],[{"type":"prose","content":"So they put sackcloth around their loins and ropes on their necks, and came to the king of Israel and said, “Your servant Ben-hadad says, ‘Please let me live.’” And Ahab asked, “Is he still alive? He is my brother.” "}],[{"type":"prose","content":"Now the men took it as a  omen, and quickly understanding his meaning said, “Yes, your brother Ben-hadad .” Then the king said, “Go, bring him.” Then Ben-hadad came out to him, and Ahab had him come up into the chariot. "}],[{"type":"prose","content":"Ben-hadad [tempting him] said to him, “I will restore the cities which my father took from your father; and you may set up bazaars (shops) of your own in Damascus, as my father did in Samaria.” Then, , “I will let you go with this covenant (treaty).” So he made a covenant with him and let him go."}],[{"type":"prose","content":"Now a certain man of the sons of the prophets said to another by the word of the LORD, “Please strike me.” But the man refused to strike him. "}],[{"type":"prose","content":"Then the prophet said to him, “Because you have not obeyed the voice of the LORD, behold, as soon as you leave me, a lion will kill you.” And as soon as he left him, a lion found him and killed him. "}],[{"type":"prose","content":"Then the prophet found another man and said, “Please strike me.” So the man struck him hard, wounding him. "}],[{"type":"prose","content":"So the prophet left and waited for King Ahab by the road, and disguised himself [as a wounded soldier] with a bandage over his eyes. "}],[{"type":"prose","content":"As the king passed by, the prophet called out to the king and said, “Your servant went out into the middle of the battle, and behold, a man turned aside and brought a man to me and said, ‘Guard this man; if for any reason he is missing, then your life shall be  for his life, or else you shall pay a talent of silver.’ "}],[{"type":"prose","content":"But while your servant was busy here and there, he [escaped and] was gone.” And the king of Israel said to him, “Such is your own judgment (verdict); you have determined it.” "}],[{"type":"prose","content":"Then the prophet quickly removed the bandage from his eyes, and [Ahab] the king of Israel recognized him as one of the prophets. "}],[{"type":"prose","content":"He said to the king, “Thus says the LORD: ‘Because you have released from your hand the man [Ben-hadad] whom I had devoted to destruction, your life shall be  for his life, and your people for his people.’” "}],[{"type":"prose","content":"So the king of Israel went to his house resentful and sullen, and came to Samaria."}]]