[{"header":"Ben-Hadad and Ahab Go to War"},{"num":20,"verse":"Now Ben-Hadad was king of Aram. He gathered together all his army. There were 32 kings with their horses and chariots. They went with him and surrounded Samaria and attacked it. "},{"num":2,"verse":"The king sent messengers into the city to Ahab king of Israel. "},{"num":3,"verse":"This was his message: “Ben-Hadad says, ‘You must give me your silver and gold and the best of your wives and children.’”"},{"num":4,"verse":"Ahab king of Israel answered, “My master and king, I agree to what you say. I and everything I have belongs to you.”"},{"num":5,"verse":"Then the messengers came to Ahab again. They said, “Ben-Hadad says, ‘I told you before that you must give me your silver and gold, your wives and your children. "},{"num":6,"verse":"About this time tomorrow I am going to send my men to you. They are to search everywhere in your palace. And they are to search the homes of the men who rule under you. My men will take anything they want.’”"},{"num":7,"verse":"So Ahab called a meeting of all the elders of his country. He said, “Ben-Hadad is looking for trouble. First he said I had to give him my wives, my children, my silver and my gold. I agreed to that.”"},{"num":8,"verse":"But the elders and all the people said, “Pay no attention to him. Don’t do what he says.”"},{"num":9,"verse":"So Ahab said to Ben-Hadad’s messengers, “Tell my master the king this: ‘I will do what you said at first. But I will not obey your second command.’” So King Ben-Hadad’s men carried the message back to him."},{"num":10,"verse":"Then Ben-Hadad sent another message to Ahab: “I will completely destroy Samaria. There won’t be even enough left for each of my men to get a handful of dust. May the gods punish me terribly if I don’t do this!”"},{"num":11,"verse":"Ahab answered, “Tell Ben-Hadad this: ‘The man who puts on his armor should not brag too soon. It’s the man who lives long enough to take it off who has the right to brag.’”"},{"num":12,"verse":"Now Ben-Hadad was drinking in his tent with the other rulers. The messengers came and gave him the message from Ahab. Ben-Hadad commanded his men to prepare to attack the city. So they moved into their places for the battle."},{"num":13,"verse":"At the same time a prophet came to Ahab, king of Israel. The prophet said, “Ahab, the Lord says to you, ‘Do you see that big army? I will let you defeat it today. Then you will know I am the Lord.’”"},{"num":14,"verse":"Ahab said, “Who will you use to defeat them?”"},{"num":15,"verse":"So Ahab gathered the young officers of the district governors. There were 232 of them. Then he called together the army of Israel. There were 7,000 of them."},{"num":16,"verse":"At noon Ben-Hadad and the 32 rulers helping him were getting drunk in their tents. At this time Ahab attacked them. "},{"num":17,"verse":"The young officers of the district governors attacked first."},{"num":18,"verse":"So Ben-Hadad said, “They may be coming to fight. Or they may be coming to ask for peace. In either case capture them alive.”"},{"num":19,"verse":"The young officers of the district governors led the attack. The army of Israel followed them. "},{"num":20,"verse":"Then each officer of Israel killed the man who came against him. So the men from Aram ran away as Israel chased them. But Ben-Hadad king of Aram escaped on a horse with some of his horsemen. "},{"num":21,"verse":"Ahab king of Israel led the army. He captured the Arameans’ horses and chariots. So King Ahab caused a great defeat of the Aramean army."},{"num":22,"verse":"Then the prophet went to Ahab king of Israel and said, “The king of Aram will attack you again next spring. So you should go home now and make your army stronger. Make plans to defend yourself.”"},{"num":23,"verse":"The officers of Ben-Hadad king of Aram said to him, “The gods of Israel are mountain gods. Since we fought in a mountain area, Israel won. So let’s fight them on the flat land. Then we will win. "},{"num":24,"verse":"This is what you should do. Don’t allow the 32 rulers to command the armies. Put commanders in their places. "},{"num":25,"verse":"Gather an army like the one that was destroyed. Gather as many horses and chariots as it had. We will fight the Israelites on flat land. Then we will win.” Ben-Hadad agreed with their advice and did what they said."},{"num":26,"verse":"The next spring Ben-Hadad gathered the people of Aram. He went to Aphek to fight against Israel."},{"num":27,"verse":"The Israelites also prepared for war. They marched out to meet the Arameans and camped opposite them. They looked like two small groups of goats. But the Arameans covered the area."},{"num":28,"verse":"A man of God came to the king of Israel with this message: “The Lord says, ‘The people of Aram say that I, the Lord, am a god of the mountains. They think I am not a god of the valleys. So I will allow you to defeat this big army. Then you will know I am the Lord.’”"},{"num":29,"verse":"The armies were camped across from each other for seven days. On the seventh day the battle began. The Israelites killed 100,000 Aramean soldiers in one day. "},{"num":30,"verse":"The rest of them ran away to the city of Aphek. There a city wall fell on 27,000 of them. Ben-Hadad also ran away to the city and hid in a room."},{"num":31,"verse":"His officers said to him, “We have heard that the kings of Israel are merciful. Let’s dress in rough cloth to show our sadness. And let’s wear ropes on our heads as a sign of surrender. Then let’s go to the king of Israel. Maybe he will let you live.”"},{"num":32,"verse":"So they dressed in rough cloth and wore ropes on their heads. Then they went to the king of Israel. They said, “Your servant Ben-Hadad says, ‘Please let me live.’”"},{"num":33,"verse":"Now Ben-Hadad’s men had wanted a sign from Ahab. They wanted to know he would not kill Ben-Hadad. So when Ahab called Ben-Hadad his brother, they quickly said, “Yes! Ben-Hadad is your brother.”"},{"num":34,"verse":"Ben-Hadad said to him, “Ahab, I will give you back the towns my father took from your father. And you may put shops in Damascus, as my father did in Samaria.”"},{"header":"A Prophet Speaks Against Ahab"},{"num":35,"verse":"One of the prophets told another prophet, “Hit me!” He told him to do this because the Lord had commanded it. But the other prophet refused. "},{"num":36,"verse":"So the first prophet said, “You did not obey the Lord’s command. So a lion will kill you as soon as you leave me.” When the second prophet left, a lion found him and killed him."},{"num":37,"verse":"The first prophet went to another man and said, “Hit me, please!” So the man hit him and hurt him. "},{"num":38,"verse":"Then the prophet wrapped his face in a cloth. This way no one could tell who he was. Then he went and waited by the road for the king. "},{"num":39,"verse":"As Ahab king of Israel passed by, the prophet called out to him. The prophet said, “I went to fight in the battle. One of our men brought an enemy soldier to me. Our man said, ‘Guard this man. If he runs away, you will have to give your life in his place. Or, you will have to pay a fine of 75 pounds of silver.’ "},{"num":40,"verse":"But I became busy doing other things. So the man ran away.”"},{"num":41,"verse":"Then the prophet quickly took the cloth from his face. When the king of Israel saw him, he knew he was one of the prophets. "},{"num":42,"verse":"Then the prophet said to the king, “This is what the Lord says: ‘You set free the man I said should die. So your life will be taken in his place. And the lives of your people will be taken in place of the lives of his people.’”"},{"num":43,"verse":"Then the king went back to his palace in Samaria. He was angry and upset."}]