[{"num":20,"verse":"King Ben-hadad of Syria now mobilized his army and, with thirty-two allied nations and their hordes of chariots and horses, besieged Samaria, the Israeli capital. "},{"num":2,"verse":"He sent this message into the city to King Ahab of Israel: “Your silver and gold are mine, as are your prettiest wives and the best of your children!”"},{"num":4,"verse":"“All right, my lord,” Ahab replied. “All that I have is yours!”"},{"num":5,"verse":"Soon Ben-hadad’s messengers returned again with another message: “You must not only give me your silver, gold, wives, and children, but about this time tomorrow I will send my men to search your palace and the homes of your people, and they will take away whatever they like!”"},{"num":7,"verse":"Then Ahab summoned his advisors. “Look what this man is doing,” he complained to them. “He is stirring up trouble despite the fact that I have already told him he could have my wives and children and silver and gold, just as he demanded.”"},{"num":8,"verse":"“Don’t give him anything more,” the elders advised."},{"num":9,"verse":"So he told the messengers from Ben-hadad, “Tell my lord the king, ‘I will give you everything you asked for the first time, but your men may not search the palace and the homes of the people.’” So the messengers returned to Ben-hadad."},{"num":10,"verse":"Then the Syrian king sent this message to Ahab: “May the gods do more to me than I am going to do to you if I don’t turn Samaria into handfuls of dust!”"},{"num":11,"verse":"The king of Israel retorted, “Don’t count your chickens before they hatch!”"},{"num":12,"verse":"This reply of Ahab’s reached Ben-hadad and the other kings as they were drinking in their tents."},{"num":13,"verse":"Then a prophet came to see King Ahab and gave him this message from the Lord: “Do you see all these enemy forces? I will deliver them all to you today. Then at last you will know that I am the Lord.”"},{"num":14,"verse":"Ahab asked, “How will he do it?”"},{"num":15,"verse":"So he mustered the troops from the provinces, 232 of them, then the rest of his army of 7,000 men. "},{"num":16,"verse":"About noontime, as Ben-hadad and the thirty-two allied kings were still drinking themselves drunk, the first of Ahab’s troops marched out of the city."},{"num":17,"verse":"As they approached, Ben-hadad’s scouts reported to him, “Some troops are coming!”"},{"num":18,"verse":"“Take them alive,” Ben-hadad commanded, “whether they have come for truce or for war.”"},{"num":19,"verse":"By now Ahab’s entire army had joined the attack. "},{"num":20,"verse":"Each one killed a Syrian soldier, and suddenly the entire Syrian army panicked and fled. The Israelis chased them, but King Ben-hadad and a few others escaped on horses. "},{"num":21,"verse":"However, the great bulk of the horses and chariots were captured, and most of the Syrian army was killed in a great slaughter."},{"num":22,"verse":"Then the prophet approached King Ahab and said, “Get ready for another attack by the king of Syria.”"},{"num":23,"verse":"For after their defeat, Ben-hadad’s officers said to him, “The Israeli God is a god of the hills; that is why they won. But we can beat them easily on the plains. "},{"num":24,"verse":"Only this time replace the kings with generals! "},{"num":25,"verse":"Recruit another army like the one you lost; give us the same number of horses, chariots, and men, and we will fight against them in the plains; there’s not a shadow of a doubt that we will beat them.” So King Ben-hadad did as they suggested. "},{"num":26,"verse":"The following year he called up the Syrian army and marched out against Israel again, this time at Aphek. "},{"num":27,"verse":"Israel then mustered its army, set up supply lines, and moved into the battle; but the Israeli army looked like two little flocks of baby goats in comparison to the vast Syrian forces that filled the countryside!"},{"num":28,"verse":"Then a prophet went to the king of Israel with this message from the Lord: “Because the Syrians have declared, ‘The Lord is a God of the hills and not of the plains,’ I will help you defeat this vast army, and you shall know that I am indeed the Lord.”"},{"num":29,"verse":"The two armies camped opposite each other for seven days, and on the seventh day the battle began. And the Israelis killed 100,000 Syrian infantrymen that first day. "},{"num":30,"verse":"The rest fled behind the walls of Aphek, but the wall fell on them and killed another 27,000. Ben-hadad fled into the city and hid in the inner room of one of the houses."},{"num":31,"verse":"“Sir,” his officers said to him, “we have heard that the kings of Israel are very merciful. Let us wear sackcloth and put ropes on our heads and go out to King Ahab to see if he will let you live.”"},{"num":32,"verse":"So they went to the king of Israel and begged, “Your servant Ben-hadad pleads, ‘Let me live!’”"},{"num":33,"verse":"The men were quick to grab this straw of hope and hurried to clinch the matter by exclaiming, “Yes, your brother Ben-hadad!”"},{"num":34,"verse":"Ben-hadad told him, “I will restore the cities my father took from your father, and you may establish trading posts in Damascus, as my father did in Samaria.”"},{"num":35,"verse":"Meanwhile, the Lord instructed one of the prophets to say to another man, “Strike me with your sword!” But the man refused."},{"num":36,"verse":"Then the prophet told him, “Because you have not obeyed the voice of the Lord, a lion shall kill you as soon as you leave me.” And sure enough, as he turned to go a lion attacked and killed him."},{"num":37,"verse":"Then the prophet turned to another man and said, “Strike me with your sword.” And he did, wounding him."},{"num":38,"verse":"The prophet waited for the king beside the road, having placed a bandage over his eyes to disguise himself."},{"num":39,"verse":"As the king passed by, the prophet called out to him, “Sir, I was in the battle, and a man brought me a prisoner and said, ‘Keep this man; if he gets away, you must die, or else pay me $2,000!’ "},{"num":40,"verse":"But while I was busy doing something else, the prisoner disappeared!”"},{"num":41,"verse":"Then the prophet yanked off the bandage from his eyes, and the king recognized him as one of the prophets. "},{"num":42,"verse":"Then the prophet told him, “The Lord says, ‘Because you have spared the man I said must die, now you must die in his place, and your people shall perish instead of his.’”"},{"num":43,"verse":"So the king of Israel went home to Samaria angry and sullen."}]