[{"header":"Elijah goes to heaven"},{"num":2,"verse":"Now the Lord was going to take Elijah up to heaven in a windstorm, and Elijah and Elisha were leaving Gilgal."},{"num":2,"verse":"Elijah said to Elisha, “Stay here, because the Lord has sent me to Bethel.”"},{"num":3,"verse":"The group of prophets from Bethel came out to Elisha. These prophets said to Elisha, “Do you know that the Lord is going to take your master away from you today?”"},{"num":4,"verse":"Elijah said, “Elisha, stay here, because the Lord has sent me to Jericho.”"},{"num":5,"verse":"The group of prophets from Jericho approached Elisha and said to him, “Do you know that the Lord is going to take your master away from you today?”"},{"num":6,"verse":"Elijah said to Elisha, “Stay here, because the Lord has sent me to the Jordan.”"},{"num":7,"verse":"Fifty members from the group of prophets also went along, but they stood at a distance. Both Elijah and Elisha stood beside the Jordan River."},{"num":8,"verse":"Elijah then took his coat, rolled it up, and hit the water. Then the water was divided in two! Both of them crossed over on dry ground."},{"num":9,"verse":"When they had crossed, Elijah said to Elisha, “What do you want me to do for you before I’m taken away from you?”"},{"num":10,"verse":"Elijah said, “You’ve made a difficult request. If you can see me when I’m taken from you, then it will be yours. If you don’t see me, it won’t happen.”"},{"num":11,"verse":"They were walking along, talking, when suddenly a fiery chariot and fiery horses appeared and separated the two of them. Then Elijah went to heaven in a windstorm."},{"num":12,"verse":"Elisha was watching, and he cried out, “Oh, my father, my father! Israel’s chariots and its riders!” When he could no longer see him, Elisha took hold of his clothes and ripped them in two."},{"header":"Elisha succeeds Elijah"},{"num":13,"verse":"Then Elisha picked up the coat that had fallen from Elijah. He went back and stood beside the banks of the Jordan River."},{"num":14,"verse":"He took the coat that had fallen from Elijah and hit the water. He said, “Where is the Lord, Elijah’s God?” And when he hit the water, it divided in two! Then Elisha crossed over."},{"num":15,"verse":"The group of prophets from Jericho saw him from a distance. They said, “Elijah’s spirit has settled on Elisha!” So they came out to meet him, bowing down before him."},{"num":16,"verse":"“Look,” they told him, “there are fifty strong men among us, your servants. Please let them go and search for your master. Perhaps the Lord’s spirit has picked him up and put him down on some mountain or in some valley.”"},{"num":17,"verse":"They insisted until he became embarrassed and said, “Okay, send them.” So they sent fifty men who searched for three days. But they couldn’t find Elijah."},{"num":18,"verse":"When these men returned to Elisha, who was staying in Jericho, he said to them, “Didn’t I tell you not to go?”"},{"num":19,"verse":"The citizens said to Elisha, “As you can see, sir, this city is in a good location, but the water is bad, and the land causes miscarriages.”"},{"num":20,"verse":"He said, “Bring me a new bowl, and put some salt in it.” They did so."},{"num":21,"verse":"Elisha then went out and threw salt into the spring. He said, “This is what the Lord has said: I have purified this water. It will no longer cause death and miscarriage.”"},{"num":22,"verse":"The water has stayed pure right up to this very day, in agreement with the word that Elisha spoke."},{"header":"Elisha and the bears"},{"num":23,"verse":"Elisha went up from there to Bethel. As he was going up the road, some young people came out of the city. They mocked him: “Get going, Baldy! Get going, Baldy!”"},{"num":24,"verse":"Turning around, Elisha looked at them and cursed them in the Lord’s name. Then two bears came out of the woods and mangled forty-two of the youths."},{"num":25,"verse":"From there Elisha went to Mount Carmel and then back to Samaria."}]