[{"num":2,"verse":"The time came for Adonai to take Eliyahu up into heaven in a whirlwind. Eliyahu and Elisha were on their way from Gilgal, "},{"num":2,"verse":"when Eliyahu said to Elisha, “Please wait here, because Adonai has sent me all the way to Beit-El.” But Elisha said, “As Adonai lives, and as you live, I will not leave you.” So they went down to Beit-El. "},{"num":3,"verse":"The guild prophets of Beit-El came out to Elisha and said to him, “Do you know that Adonai is taking your master away from you today?” “Yes, I know,” he answered; “say no more.”"},{"num":4,"verse":"Eliyahu said to him, “Elisha, please wait here, because Adonai has sent me to Yericho.” He replied, “As Adonai lives, and as you live, I will not leave you.” So they came to Yericho. "},{"num":5,"verse":"The guild prophets of Yericho approached Elisha and said to him, “Do you know that Adonai is taking your master away from you today?” “Yes, I know,” he answered; “say no more.”"},{"num":6,"verse":"Eliyahu said to him, “Please wait here, because Adonai has sent me to the Yarden.” He replied, “As Adonai lives, and as you live, I will not leave you.” So the two of them went on. "},{"num":7,"verse":"Fifty of the guild prophets went and stood watching them from a distance, while they stood by the Yarden. "},{"num":8,"verse":"Then Eliyahu took his cloak, rolled it up and struck the water with it; and the water divided itself to the left and to the right; so that they crossed on dry ground. "},{"num":9,"verse":"After they had crossed, Eliyahu said to Elisha, “Tell me what I can do for you before I am taken away from you.” Elisha said, “Please! Let a double share of your spirit be on me!” "},{"num":10,"verse":"He replied, “You have requested a hard thing. Nevertheless, if you see me when I am taken from you, you will get what you asked for; but if not, you won’t.”"},{"num":11,"verse":"Suddenly, as they were walking on and talking, there appeared a fiery chariot with horses of fire; and as it separated the two of them from each other, Eliyahu went up into heaven in a whirlwind. "},{"num":12,"verse":"Elisha saw it and cried out, “My father! My father! The chariots and horsemen of Isra’el!” Then he lost sight of him. Seizing his clothes, he tore them in half. "},{"num":13,"verse":"Then he picked up Eliyahu’s cloak, which had fallen off him. Standing on the bank of the Yarden, "},{"num":14,"verse":"he took the cloak that had fallen off Eliyahu, struck the water and said, “Where is Adonai, the God of Eliyahu?” But when he actually did strike the water, it divided itself to the left and to the right; then Elisha crossed over."},{"num":15,"verse":"When the guild prophets of Yericho saw him in the distance, they said, “The spirit of Eliyahu does rest on Elisha.” Advancing to meet him, they prostrated themselves on the ground before him "},{"num":16,"verse":"and said to him, “Here now, your servants include fifty strong men. Please let them go and look for your master, in the event that the Spirit of Adonai has taken him up and set him down on some mountain or in some valley.” He answered, “Don’t send them.” "},{"num":17,"verse":"But they kept pressing him until finally, embarrassed, he said to send them. So they sent fifty men. For three days they searched, but they didn’t find him. "},{"num":18,"verse":"On returning to him where he was waiting in Yericho, he said to them, “I told you not to go, didn’t I?”"},{"num":19,"verse":"The men of the city said to Elisha, “My lord can see that this is a pleasant city to live in; but the water is bad, so that the ground is causing miscarriages.” "},{"num":20,"verse":"“Bring me a new jug,” he said, “and put salt in it.” They brought it to him. "},{"num":21,"verse":"He went out to the source of the water, threw salt into it and said, “This is what Adonai says: ‘I have healed this water; it will no longer cause death or miscarrying.’” "},{"num":22,"verse":"The water was healed and has remained healed to this day, in keeping with Elisha’s spoken word."},{"num":23,"verse":"Elisha left to go up to Beit-El. As he was on his way up the road, some boys came out of the town and began making fun of him. “Go on up, baldy! Go on up, baldy!” "},{"num":24,"verse":"He looked behind him, saw them and put a curse on them in the name of Adonai; whereupon two female bears came out of the woods and mauled forty-two of the boys."},{"num":25,"verse":"He went on from there to Mount Karmel and then returned to Shomron."}]