[{"num":2,"verse":"1 Elijah divided the waters with his cloak. 11 He is taken up into heaven. 13 Elisha taketh his cloak and divideth Jordan. 20 The bitter and venomous waters are healed. 23 The children that mock Elisha, are rent in pieces with bears."},{"num":1,"verse":"And when the Lord would take up Elijah into heaven by a whirlwind, Elijah went with Elisha from Gilgal."},{"num":2,"verse":"Then Elijah said to Elisha, Tarry here, I pray thee: for the Lord hath sent me to Bethel. But Elisha said, As the Lord liveth, and as thy soul liveth, I will not leave thee. So they came down to Bethel."},{"num":3,"verse":"And the children of the Prophets that were at Bethel, came out to Elisha, and said unto him, Knowest thou that the Lord will take thy master from thine head this day? And he said, Yea, I know it: hold ye your peace."},{"num":4,"verse":"Again Elijah said unto him, Elisha, tarry here, I pray thee: for the Lord hath sent me to Jericho. But he said, As the Lord liveth, and as thy soul liveth, I will not leave thee. So they came to Jericho."},{"num":5,"verse":"And the children of the Prophets that were at Jericho, came to Elisha, and said unto him, Knowest thou, that the Lord will take thy master from thine head this day? And he said, Yea, I know it: hold ye your peace."},{"num":6,"verse":"Moreover Elijah said unto him, Tarry, I pray thee, here: for the Lord hath sent me to Jordan. But he said, As the Lord liveth, and as thy soul liveth, I will not leave thee. So they went both together."},{"num":7,"verse":"And fifty men of the sons of the Prophets went and stood on the other side a far off, and they two stood by Jordan."},{"num":8,"verse":"¶ Then Elijah took his cloak, and wrapped it together, and smote the waters, and they were divided hither and thither, and they twain went over on the dry land."},{"num":9,"verse":"Now when they were passed over, Elijah said unto Elisha, Ask what I shall do for thee before I be taken from thee. And Elisha said, I pray thee, let thy Spirit be double upon me."},{"num":10,"verse":"And he said, Thou hast asked an hard thing: yet if thou see me when I am taken from thee, thou shalt have it so: and if not, it shall not be."},{"num":11,"verse":"And as they went walking and talking, behold, there appeared a chariot of fire, and horses of fire, and did separate them twain. So Elijah went up by a whirlwind into heaven."},{"num":12,"verse":"And Elisha saw it, and he cried, My father, my father, the chariot of Israel, and the horsemen thereof: and he saw him no more: and he took his own clothes, and rent them in two pieces."},{"num":13,"verse":"¶ He took up also the cloak of Elijah, that fell from him, and returned, and stood by the bank of Jordan."},{"num":14,"verse":"After, he took the cloak of Elijah, that fell from him, and smote the waters, and said, Where is the Lord God of Elijah? And so he also, after he had stricken the waters, so that they were divided this way and that way, went over, even Elisha."},{"num":15,"verse":"And when the children of the Prophets, which were at Jericho, saw him on the other side, they said, The Spirit of Elijah doeth rest on Elisha: and they came to meet him, and fell to the ground before him,"},{"num":16,"verse":"And said unto him, Behold now, there be with thy servants fifty strong men: let them go, we pray thee, and seek thy master, if so be the Spirit of the Lord hath taken him up, and cast him upon some mountain, or into some valley. But he said, Ye shall not send."},{"num":17,"verse":"Yet they were instant upon him, till he was ashamed: wherefore he said, Send. So they sent fifty men, which sought three days, but found him not."},{"num":18,"verse":"Therefore they returned to him, (for he tarried at Jericho) and he said unto them, Did not I say unto you, Go not?"},{"num":19,"verse":"¶ And the men of the city said unto Elisha, Behold, we pray thee: the situation of this city is pleasant, as thou, my lord, seest, but the water is naught, and the ground barren."},{"num":20,"verse":"Then he said, Bring me a new cruse, and put salt therein. And they brought it to him."},{"num":21,"verse":"And he went unto the spring of the waters, and cast there the salt, and said, Thus saith the Lord, I have healed this water: death shall no more come thereof, neither barrenness to the ground. "},{"num":22,"verse":"So the waters were healed unto this day, according to the word of Elisha which he had spoken."},{"num":23,"verse":"¶ And he went up from thence unto Bethel. And as he was going up the way, little children came out of the city, and mocked him, and said unto him, Come up, thou bald head, come up, thou bald head."},{"num":24,"verse":"And he turned back, and looked on them, and cursed them in the name of the Lord. And two bears came out of the forest, and tore in pieces two and forty children of them."},{"num":25,"verse":"So he went from thence to mount Carmel, and from thence he returned to Samaria."}]