[{"header":"Elijah Is Taken Up to Heaven"},{"num":2,"verse":"When the Lord was about to take Elijah up to heaven by a wind-storm, Elijah and Elisha were on their way from Gilgal. "},{"num":2,"verse":"Elijah said to Elisha, “Stay here, I ask you. For the Lord has sent me as far as Bethel.” But Elisha said, “As the Lord lives and as you yourself live, I will not leave you.” So they went down to Bethel. "},{"num":3,"verse":"Then the sons of the men who spoke for God at Bethel came out to Elisha. They said to him, “Do you know that the Lord will take Elijah from you today?” And he said, “Yes, I know. Say no more.” "},{"num":4,"verse":"Elijah said to him, “Elisha, I ask you to stay here. For the Lord has sent me to Jericho.” But Elisha said, “As the Lord lives and as you yourself live, I will not leave you.” So they came to Jericho. "},{"num":5,"verse":"The sons of the men who spoke for God at Jericho came to Elisha. They said to him, “Do you know that the Lord will take Elijah from you today?” And he answered, “Yes, I know. Say no more.” "},{"num":6,"verse":"Then Elijah said to him, “I ask you to stay here. For the Lord has sent me to the Jordan.” And Elisha said, “As the Lord lives and as you yourself live, I will not leave you.” So the two of them went on."},{"num":7,"verse":"Now fifty sons of the men who tell what will happen in the future went and stood on the other side of the Jordan River a long way off from the two of them who were standing by the Jordan. "},{"num":8,"verse":"Then Elijah took his coat and rolled it up and hit the water. And the water divided to one side and to the other, so the two of them crossed the Jordan on dry ground. "},{"num":9,"verse":"When they had crossed, Elijah said to Elisha, “Ask what I should do for you before I am taken from you.” And Elisha said, “I ask you, let twice the share of your spirit be upon me.” "},{"num":10,"verse":"Elijah said, “You have asked a hard thing. But if you see me when I am taken from you, it will be given to you. But if not, it will not be so.” "},{"num":11,"verse":"As they went on and talked, a war-wagon of fire and horses of fire came between them. And Elijah went up by a wind-storm to heaven. "},{"num":12,"verse":"Elisha saw it and cried out, “My father, my father, the war-wagon of Israel and its horsemen!” And he saw Elijah no more. Then he took hold of his own clothes and tore them in two pieces. "},{"num":13,"verse":"He picked up Elijah’s coat that had fallen from him. And he returned and stood by the side of the Jordan. "},{"num":14,"verse":"He took Elijah’s coat that fell from him, and hit the water and said, “Where is the Lord, the God of Elijah?” When he hit the water, it was divided to one side and to the other, and Elisha crossed the Jordan."},{"num":15,"verse":"The sons of the men who tell what will happen in the future at Jericho saw him. And they said, “The spirit of Elijah rests on Elisha.” They came to meet him and bowed to the ground in front of him. "},{"num":16,"verse":"They said to him, “Now see, there are fifty strong men with your servants. Let them go and look for your teacher. It might be that the Spirit of the Lord has taken him up and put him down on some mountain or into some valley.” And Elisha said, “Do not send them.” "},{"num":17,"verse":"But they talked to him until he was ashamed, and he said, “Send them.” So they sent fifty men to look for Elijah. But after three days they did not find him. "},{"num":18,"verse":"They returned to Elisha while he was staying at Jericho. And he said to them, “Did I not tell you, ‘Do not go’?”"},{"header":"Powerful Works of Elisha"},{"num":19,"verse":"Then the men of the city said to Elisha, “See, it is pleasing to live in this city, as my lord sees. But the water is bad. And the land does not bring fruit.” "},{"num":20,"verse":"Elisha said, “Bring me a new jar, and put salt in it.” So they brought it to him. "},{"num":21,"verse":"Then he went out to the well of water and threw salt into it, and said, “This is what the Lord says, ‘I have made this water pure. It will not cause death or loss of fruit any more.’” "},{"num":22,"verse":"So the water has been pure to this day, just as Elisha said."},{"num":23,"verse":"Then he left there and went to Bethel. On the way, some young boys came out from the city and made fun of him. They said to him, “Go up, you man with no hair! Go up, you man with no hair!” "},{"num":24,"verse":"He looked behind him and saw them, and cursed them in the name of the Lord. Then two female bears came from among the trees and tore up forty-two of the boys. "},{"num":25,"verse":"Elisha went from there to Mount Carmel, then returned to Samaria."}]