[{"num":1,"verse":"Now the time came for the Lord to take Elijah to heaven—by means of a whirlwind! Elijah said to Elisha as they left Gilgal, “Stay here, for the Lord has told me to go to Bethel.”"},{"num":3,"verse":"There the young prophets of Bethel Seminary came out to meet them and asked Elisha, “Did you know that the Lord is going to take Elijah away from you today?”"},{"num":4,"verse":"Then Elijah said to Elisha, “Please stay here in Bethel, for the Lord has sent me to Jericho.”"},{"num":5,"verse":"Then the students at Jericho Seminary came to Elisha and asked him, “Do you know that the Lord is going to take away your master today?”"},{"num":6,"verse":"Then Elijah said to Elisha, “Please stay here, for the Lord has sent me to the Jordan River.”"},{"num":8,"verse":"Then Elijah folded his cloak together and struck the water with it; and the river divided and they went across on dry ground!"},{"num":9,"verse":"When they arrived on the other side Elijah said to Elisha, “What wish shall I grant you before I am taken away?”"},{"num":10,"verse":"“You have asked a hard thing,” Elijah replied. “If you see me when I am taken from you, then you will get your request. But if not, then you won’t.”"},{"num":11,"verse":"As they were walking along, talking, suddenly a chariot of fire, drawn by horses of fire, appeared and drove between them, separating them, and Elijah was carried by a whirlwind into heaven."},{"num":12,"verse":"Elisha saw it and cried out, “My father! My father! The chariot of Israel and the charioteers!”"},{"num":13,"verse":"Then he picked up Elijah’s cloak and returned to the bank of the Jordan River, and struck the water with it."},{"num":15,"verse":"When the young prophets of Jericho saw what had happened, they exclaimed, “The spirit of Elijah rests upon Elisha!” And they went to meet him and greeted him respectfully."},{"num":16,"verse":"“Sir,” they said, “just say the word and fifty of our best athletes will search the wilderness for your master; perhaps the Spirit of the Lord has left him on some mountain or in some ravine.”"},{"num":17,"verse":"But they kept urging until he was embarrassed and finally said, “All right, go ahead.” Then fifty men searched for three days, but didn’t find him."},{"num":18,"verse":"Elisha was still at Jericho when they returned. “Didn’t I tell you not to go?” he growled."},{"num":19,"verse":"Now a delegation of the city officials of Jericho visited Elisha. “We have a problem,” they told him. “This city is located in beautiful natural surroundings, as you can see; but the water is bad and causes our women to have miscarriages.”"},{"num":20,"verse":"“Well,” he said, “bring me a new bowl filled with salt.” So they brought it to him."},{"num":21,"verse":"Then he went out to the city well and threw the salt in and declared, “The Lord has healed these waters. They shall no longer cause death or miscarriage.”"},{"num":22,"verse":"And sure enough! The water was purified, just as Elisha had said."},{"num":23,"verse":"From Jericho he went to Bethel. As he was walking along the road, a gang of young men from the city began mocking and making fun of him because of his bald head. "},{"num":24,"verse":"He turned around and cursed them in the name of the Lord; and two female bears came out of the woods and tore forty-two of them. "},{"num":25,"verse":"Then he went to Mount Carmel and finally returned to Samaria."}]