[{"num":11,"verse":"When Jesus had finished His charge to His twelve disciples, He left there to teach and to preach in their [Galilean] cities."},{"num":2,"verse":"Now when John in prison heard about the activities of Christ, he sent a message by his disciples"},{"num":3,"verse":"And asked Him, Are You the One Who was to come, or should we keep on expecting a different one?"},{"num":4,"verse":"And Jesus replied to them, Go and report to John what you hear and see:"},{"num":5,"verse":"The blind receive their sight and the lame walk, lepers are cleansed (by healing) and the deaf hear, the dead are raised up and the poor have good news (the Gospel) preached to them."},{"num":6,"verse":"And blessed (happy, fortunate, and to be envied) is he who takes no offense at Me and finds no cause for stumbling in or through Me and is not hindered from seeing the Truth."},{"num":7,"verse":"Then as these men went their way, Jesus began to speak to the crowds about John: What did you go out in the wilderness (desert) to see? A reed swayed by the wind?"},{"num":8,"verse":"What did you go out to see then? A man clothed in soft garments? Behold, those who wear soft clothing are in the houses of kings."},{"num":9,"verse":"But what did you go out to see? A prophet? Yes, I tell you, and one [out of the common, more eminent, more remarkable, and] superior to a prophet."},{"num":10,"verse":"This is the one of whom it is written, Behold, I send My messenger ahead of You, who shall make ready Your way before You."},{"num":11,"verse":"Truly I tell you, among those born of women there has not risen anyone greater than John the Baptist; yet he who is least in the kingdom of heaven is greater than he."},{"num":12,"verse":"And from the days of John the Baptist until the present time, the kingdom of heaven has endured violent assault, and violent men seize it by force [as a precious prize—a share in the heavenly kingdom is sought with most ardent zeal and intense exertion]."},{"num":13,"verse":"For all the Prophets and the Law prophesied up until John."},{"num":14,"verse":"And if you are willing to receive and accept it, John himself is Elijah who was to come [before the kingdom]."},{"num":15,"verse":"He who has ears to hear, let him be listening and let him consider and perceive and comprehend by hearing."},{"num":16,"verse":"But to what shall I liken this generation? It is like little children sitting in the marketplaces who call to their playmates,"},{"num":17,"verse":"We piped to you [playing wedding], and you did not dance; we wailed dirges [playing funeral], and you did not mourn and beat your breasts and weep aloud."},{"num":18,"verse":"For John came neither eating nor drinking [with others], and they say, He has a demon!"},{"num":19,"verse":"The Son of Man came eating and drinking [with others], and they say, Behold, a glutton and a wine drinker, a friend of tax collectors and [especially wicked] sinners! Yet wisdom is justified and vindicated by what she does (her deeds) and by her children."},{"num":20,"verse":"Then He began to censure and reproach the cities in which most of His mighty works had been performed, because they did not repent [and their hearts were not changed]."},{"num":21,"verse":"Woe to you, Chorazin! Woe to you, Bethsaida! For if the mighty works done in you had been done in Tyre and Sidon, they would long ago have repented in sackcloth and ashes [and their hearts would have been changed]."},{"num":22,"verse":"I tell you [further], it shall be more endurable for Tyre and Sidon on the day of judgment than for you."},{"num":23,"verse":"And you, Capernaum, are you to be lifted up to heaven? You shall be brought down to Hades [the region of the dead]! For if the mighty works done in you had been done in Sodom, it would have continued until today."},{"num":24,"verse":"But I tell you, it shall be more endurable for the land of Sodom on the day of judgment than for you."},{"num":25,"verse":"At that time Jesus began to say, I thank You, Father, Lord of heaven and earth [and I acknowledge openly and joyfully to Your honor], that You have hidden these things from the wise and clever and learned, and revealed them to babies [to the childish, untaught, and unskilled]."},{"num":26,"verse":"Yes, Father, [I praise You that] such was Your gracious will and good pleasure."},{"num":27,"verse":"All things have been entrusted and delivered to Me by My Father; and no one fully knows and accurately understands the Son except the Father, and no one fully knows and accurately understands the Father except the Son and anyone to whom the Son deliberately wills to make Him known."},{"num":28,"verse":"Come to Me, all you who labor and are heavy-laden and overburdened, and I will cause you to rest. [I will ease and relieve and refresh your souls.]"},{"num":29,"verse":"Take My yoke upon you and learn of Me, for I am gentle (meek) and humble (lowly) in heart, and you will find rest (relief and ease and refreshment and recreation and blessed quiet) for your souls."},{"num":30,"verse":"For My yoke is wholesome (useful, good—not harsh, hard, sharp, or pressing, but comfortable, gracious, and pleasant), and My burden is light and easy to be borne."}]