[{"header":"After Commissioning The Twelve, Jesus Moves On To Teach In Other Cities"},{"num":11,"verse":"And it came about that when Jesus finished giving-directions to His twelve disciples, He passed-on from there that He might teach and proclaim in their cities."},{"header":"John The Baptist Asks, Are You The King? Jesus Points Him To His Works"},{"num":2,"verse":"Now John, having in prison heard-of the works of the Christ, having sent through his disciples, "},{"num":3,"verse":"said to Him, “Are You the One coming, or should we be looking-for a different one?” "},{"num":4,"verse":"And having responded, Jesus said to them, “Having gone, report to John the things which you are hearing and seeing— "},{"num":5,"verse":"blind ones are seeing-again and lame ones are walking. Lepers are being cleansed and deaf ones are hearing. And dead ones are being raised and poor ones are having-good-news-announced to them. "},{"num":6,"verse":"And blessed is whoever does not take-offense in Me”."},{"header":"Jesus Says John The Baptist Is The Fulfillment of The Prophecies of Malachi"},{"num":7,"verse":"And while these ones were proceeding, Jesus began to speak to the crowds about John— “What did you go out into the wilderness to look-at? A reed being shaken by the wind? "},{"num":8,"verse":"But what did you go out to see? A man having been dressed in soft garments? Behold— the ones wearing the soft garments are in the houses of kings! "},{"num":9,"verse":"But what did you go out to see? A prophet? Yes, I say to you, and more than a prophet. "},{"num":10,"verse":"This one is about whom it has been written [in Mal 3:1]: ‘Behold— I am sending-forth My messenger ahead of Your presence, who will make Your way ready in front of You’. "},{"num":11,"verse":"Truly I say to you, a greater one than John the Baptist has not arisen among ones born of women. But the least one in the kingdom of the heavens is greater than he. "},{"num":12,"verse":"But the kingdom of the heavens is being treated-violently from the days of John the Baptist until now, and violent ones are snatching it away. "},{"num":13,"verse":"For all the prophets and the Law prophesied until John. "},{"num":14,"verse":"And if you are willing to accept it, he himself is Elijah— the one going-to come. "},{"num":15,"verse":"Let the one having ears hear."},{"header":"But This Generation Rejects Both The One Preparing And The One Who Came"},{"num":16,"verse":"“But to what will I liken this generation? It is like children sitting in the marketplaces who, calling to the others, "},{"num":17,"verse":"say ‘We played the flute for you and you did not dance. We lamented and you did not beat-your-breast’. "},{"num":18,"verse":"For John came neither eating nor drinking, and they say ‘He has a demon’. "},{"num":19,"verse":"The Son of Man came eating and drinking, and they say ‘Behold— a man who is a glutton and drunkard, a friend of tax-collectors and sinners’. And wisdom was vindicated by her works”."},{"header":"Woe To You Cities Who Have Seen My Works And Not Repented"},{"num":20,"verse":"Then He began to reproach the cities in which most-of  His miracles took place, because they did not repent. "},{"num":21,"verse":"“Woe to you, Chorazin! Woe to you, Bethsaida! Because if the miracles having taken place in you had taken place in Tyre and Sidon, they would have repented long ago in sackcloth and ashes. "},{"num":22,"verse":"Nevertheless I say to you— it will be more tolerable for Tyre and Sidon on the day of judgment than for you. "},{"num":23,"verse":"And you, Capernaum, will you be exalted up to heaven? You will go-down as far as Hades. Because if the miracles having taken place in you had been done in Sodom, it would have remained until today. "},{"num":24,"verse":"Nevertheless I say to you that it will be more tolerable for the land of Sodom on the day of judgment than for you”."},{"header":"It Pleases God To Hide The Kingdom From The Wise And Reveal It To The Childlike"},{"num":25,"verse":"At that time, having responded, Jesus said, “I praise You, Father, Lord of heaven and earth, that You hid these things from wise ones and intelligent ones, and You revealed them to children. "},{"num":26,"verse":"Yes, Father, because in-this-manner it became well-pleasing in Your sight. "},{"num":27,"verse":"All things were handed-over to Me by My Father. And no one knows the Son except the Father. Nor does anyone know the Father except the Son, and anyone to whom the Son wills to reveal Him. "},{"num":28,"verse":"Come to Me, all the ones being weary and having been burdened, and I will give you rest. "},{"num":29,"verse":"Take My yoke upon you and learn from Me, because I am gentle and humble in heart, and you will find rest for your souls. "},{"num":30,"verse":"For My yoke is easy, and My burden is light”."}]