[{"num":11,"verse":"When Jesus had finished instructing his twelve disciples, he left there to teach and preach in their home towns."},{"header":"John the Baptist Sends Messengers to Jesus(A)"},{"num":2,"verse":"Now when John heard in prison about the activities of the Messiah, he sent a message by his disciples "},{"num":3,"verse":"and asked him, “Are you the Coming One, or should we wait for someone else?”"},{"num":4,"verse":"Jesus answered them, “Go and tell John what you hear and observe: "},{"num":5,"verse":"the blind see, the lame walk, lepers are cleansed, the deaf hear, the dead are raised, and the destitute hear the good news. "},{"num":6,"verse":"How blessed is anyone who is not offended by me!”"},{"num":7,"verse":"As they were leaving, Jesus began to speak to the crowds about John. “What did you go out into the wilderness to see? A reed shaken by the wind? "},{"num":8,"verse":"Really, what did you go out to see? A man dressed in fancy clothes? See, those who wear fancy clothes live in kings’ houses. "},{"num":9,"verse":"Really, what did you go out to see? A prophet? Yes, I tell you, and even more than a prophet! "},{"num":10,"verse":"This is the man about whom it is written,"},{"num":11,"verse":"I tell all of you with certainty, among those born of women no one has appeared who is greater than John the Baptist. Yet even the least important person in the kingdom from heaven is greater than he."},{"num":12,"verse":"“From the days of John the Baptist until the present, the kingdom from heaven has been forcefully advancing, and violent people have been attacking it, "},{"num":13,"verse":"because the Law and all the Prophets prophesied up to the time of John. "},{"num":14,"verse":"If you are willing to accept it, he is Elijah who is to come. "},{"num":15,"verse":"Let the person who has ears listen!"},{"num":16,"verse":"“To what can I compare the people living today? They’re like little children who sit in the marketplaces and shout to each other,"},{"num":18,"verse":"Because John didn’t come eating or drinking, yet people say, ‘He has a demon!’ "},{"num":19,"verse":"The Son of Man came eating and drinking, and they say, ‘Look, a glutton and a drunk, a friend of tax collectors and sinners!’"},{"header":"Jesus Denounces Unrepentant Cities(B)"},{"num":20,"verse":"Then Jesus began to denounce the cities in which most of his miracles had taken place, because they didn’t repent. "},{"num":21,"verse":"“How terrible it will be for you, Chorazin! How terrible it will be for you, Bethsaida! Because if the miracles that happened in you had taken place in Tyre and Sidon, they would have repented long ago in sackcloth and ashes. "},{"num":22,"verse":"Indeed I tell you, it will be more bearable for Tyre and Sidon on Judgment Day than for you!"},{"num":23,"verse":"“And you, Capernaum! You won’t be lifted up to heaven, will you? You’ll go down to Hell! Because if the miracles that happened in you had taken place in Sodom, it would have remained to this day. "},{"num":24,"verse":"Indeed I tell you, it will be more bearable for the land of Sodom on Judgment Day than for you!”"},{"header":"Jesus Praises the Father and Invites the Disciples to Come to Him(C)"},{"num":25,"verse":"At that time Jesus said, “I praise you, Father, Lord of heaven and earth, because you have hidden these things from wise and intelligent people and have revealed them to infants. "},{"num":26,"verse":"Yes, Father, because this is what was pleasing to you. "},{"num":27,"verse":"All things have been entrusted to me by my Father. No one fully knows the Son except the Father, and no one fully knows the Father except the Son and the person to whom the Son chooses to reveal him."},{"num":28,"verse":"“Come to me, all of you who are weary and loaded down with burdens, and I will give you rest. "},{"num":29,"verse":"Place my yoke on you and learn from me, because I am gentle and humble, and you will find rest for your souls, "},{"num":30,"verse":"because my yoke is pleasant, and my burden is light.”"}]