[{"header":"Jesus and John the Baptist"},{"num":11,"verse":"So when Jesus had finished giving instructions to the twelve disciples, he moved on from there to teach and preach in their towns."},{"num":2,"verse":"Meanwhile, John, who was in prison, heard about these messianic goings-on. He sent word through his followers."},{"num":3,"verse":"‘Are you the one who is coming?’ he asked. ‘Or should we be looking for someone else?’"},{"num":4,"verse":"‘Go and tell John’, replied Jesus, ‘what you’ve seen and heard. "},{"num":5,"verse":"Blind people are seeing! Lame people are walking! People with virulent skin diseases are being cleansed! Deaf people can hear again! The dead are being raised to life! And – the poor are hearing the good news! "},{"num":6,"verse":"And God bless you if you’re not upset by what I’m doing.’"},{"header":"The Identity of John the Baptist"},{"num":7,"verse":"As the messengers were going away, Jesus began to speak to the crowds about John."},{"num":8,"verse":"No? Well, then, what were you expecting to see? Someone dressed in silks and satins? If you want to see people like that you’d have to go to somebody’s royal palace. "},{"num":9,"verse":"All right, so what were you expecting to see? A prophet? Ah, now we’re getting there: yes indeed, and much more than a prophet! "},{"num":10,"verse":"This is the one the Bible was talking about when it says,"},{"num":11,"verse":"‘I’m telling you the truth: John the Baptist is the greatest mother’s son there ever was. But even the least significant person in heaven’s kingdom is greater than he is. "},{"num":12,"verse":"From the time of John the Baptist until now the kingdom of heaven has been forcing its way in – and the men of force are trying to grab it! "},{"num":13,"verse":"All the prophets and the law, you see, made their prophecies up to the time of John. "},{"num":14,"verse":"In fact, if you’ll believe it, he is Elijah, the one who was to come. "},{"num":15,"verse":"If you’ve got ears, then listen!’"},{"header":"Jesus Condemns the Cities"},{"num":16,"verse":"‘What picture shall I give you for this generation?’ asked Jesus. ‘It’s like a bunch of children sitting in the town square, and singing songs to each other. "},{"num":17,"verse":"This is how it goes:"},{"num":18,"verse":"‘What do I mean? When John appeared, he didn’t have any normal food or drink – and people said “What’s got into him, then? Some demon?” "},{"num":19,"verse":"Then along comes the son of man, eating and drinking normally, and people say, “Ooh, look at him – guzzling and boozing, hanging around with tax-collectors and other riff-raff.” But, you know, wisdom is as wisdom does – and wisdom will be vindicated!’"},{"num":20,"verse":"Then he began to berate the towns where he’d done most of his powerful deeds, because they hadn’t repented."},{"num":21,"verse":"‘A curse on you, Chorazin!’ he said. ‘A curse on you, Bethsaida! If Tyre and Sidon had seen the kind of powerful things you saw, they would have repented long ago with hairshirts and ashes. "},{"num":22,"verse":"But I can tell you this: on the day of judgment Tyre and Sidon will have a better time of it than you will. "},{"num":23,"verse":"And what about you, Capernaum? You think you’re going to be exalted to heaven, do you? No – you’ll be sent down to Hades! If the powerful works that happened in you had happened in Sodom, it would still be standing today. "},{"num":24,"verse":"But I can tell you this: on the day of judgment the land of Sodom will have a better time of it than you will!’"},{"header":"Jesus’ Invitation"},{"num":25,"verse":"At that time Jesus turned to God with this prayer: ‘I give you my praise, father, Lord of heaven and earth! You hid these things from the wise and intelligent and revealed them to children! "},{"num":26,"verse":"Yes, father, that’s the way you decided to do it! "},{"num":27,"verse":"My father gave me everything: nobody knows the son except the father, and nobody knows the father except the son – and anyone the son wants to reveal him to."},{"num":28,"verse":"‘Are you having a real struggle? Come to me! Are you carrying a big load on your back? Come to me – I’ll give you a rest! "},{"num":29,"verse":"Pick up my yoke and put it on; take lessons from me! My heart is gentle, not arrogant. You’ll find the rest you deeply need. "},{"num":30,"verse":"My yoke is easy to wear, my load is easy to bear.’"}]