[{"header":"Treat Everyone the Same"},{"num":2,"verse":"My brothers and sisters, you are believers in our glorious Lord Jesus Christ. So treat everyone the same. "},{"num":2,"verse":"Suppose a man comes into your meeting wearing a gold ring and fine clothes. And suppose a poor man in dirty old clothes also comes in. "},{"num":3,"verse":"Would you show special attention to the man wearing fine clothes? Would you say, “Here’s a good seat for you”? Would you say to the poor man, “You stand there”? Or “Sit on the floor by my feet”? "},{"num":4,"verse":"If you would, aren’t you treating some people better than others? Aren’t you like judges who have evil thoughts?"},{"num":5,"verse":"My dear brothers and sisters, listen to me. Hasn’t God chosen those who are poor in the world’s eyes to be rich in faith? Hasn’t he chosen them to receive the kingdom? Hasn’t he promised it to those who love him? "},{"num":6,"verse":"But you have disrespected poor people. Aren’t rich people taking advantage of you? Aren’t they dragging you into court? "},{"num":7,"verse":"Aren’t they speaking evil things against the worthy name of Jesus? Remember, you belong to him."},{"num":8,"verse":"The royal law is found in Scripture. It says, “Love your neighbor as you love yourself.” (Leviticus 19:18) If you really keep this law, you are doing what is right. "},{"num":9,"verse":"But you sin if you don’t treat everyone the same. The law judges you because you have broken it. "},{"num":10,"verse":"Suppose you keep the whole law but trip over just one part of it. Then you are guilty of breaking all of it. "},{"num":11,"verse":"God said, “Do not commit adultery.” (Exodus 20:14; Deuteronomy 5:18) He also said, “Do not commit murder.” (Exodus 20:13; Deuteronomy 5:17) Suppose you don’t commit adultery but do commit murder. Then you have broken the law."},{"num":12,"verse":"Speak and act like people who are going to be judged by the law that gives freedom. "},{"num":13,"verse":"Those who have not shown mercy will not receive mercy when they are judged. To show mercy is better than to judge."},{"header":"Show Your Faith by What You Do"},{"num":14,"verse":"Suppose a person claims to have faith but doesn’t act on their faith. My brothers and sisters, can this kind of faith save them? "},{"num":15,"verse":"Suppose a brother or a sister has no clothes or food. "},{"num":16,"verse":"Suppose one of you says to them, “Go. I hope everything turns out fine for you. Keep warm. Eat well.” And suppose you do nothing about what they really need. Then what good have you done? "},{"num":17,"verse":"It is the same with faith. If it doesn’t cause us to do something, it’s dead."},{"num":18,"verse":"But someone will say, “You have faith. I do good deeds.”"},{"num":19,"verse":"You believe there is one God. Good! Even the demons believe that. And they tremble!"},{"num":20,"verse":"You foolish person! Do you want proof that faith without good deeds is useless? "},{"num":21,"verse":"Our father Abraham offered his son Isaac on the altar. Wasn’t he considered to be right with God because of what he did? "},{"num":22,"verse":"So you see that what he believed and what he did were working together. What he did made his faith complete. "},{"num":23,"verse":"That is what Scripture means where it says, “Abraham believed God. God accepted Abraham because he believed. So his faith made him right with God.” (Genesis 15:6) And that’s not all. God called Abraham his friend. "},{"num":24,"verse":"So you see that a person is considered right with God by what they do. It doesn’t happen only because they believe."},{"num":25,"verse":"Didn’t God consider even Rahab the prostitute to be right with him? That’s because of what she did for the spies. She gave them a place to stay. Then she sent them off in a different direction. "},{"num":26,"verse":"A person’s body without their spirit is dead. In the same way, faith without good deeds is dead."}]