[[],[{"type":"header","content":"The Living Stone and a Chosen People"},{"type":"prose","content":"Rid yourselves, therefore, of all malice, and all guile, insincerity, envy, and all slander. "}],[{"type":"prose","content":"Like newborn infants, long for the pure, spiritual milk, so that by it you may grow into salvation— "}],[{"type":"prose","content":"if indeed you have tasted that the Lord is good."}],[{"type":"prose","content":"Come to him, a living stone, though rejected by mortals yet chosen and precious in God’s sight, and "}],[{"type":"prose","content":"like living stones, let yourselves be built into a spiritual house, to be a holy priesthood, to offer spiritual sacrifices acceptable to God through Jesus Christ. "}],[{"type":"prose","content":"For it stands in scripture:"},{"type":"poetry","content":"“See, I am laying in Zion a stone,"},{"type":"poetry","content":"and whoever believes in him will not be put to shame.”"}],[{"type":"prose","content":"To you then who believe, he is precious; but for those who do not believe,"},{"type":"poetry","content":"“The stone that the builders rejected"}],[{"type":"prose","content":"and"},{"type":"poetry","content":"“A stone that makes them stumble,"},{"type":"prose","content":"They stumble because they disobey the word, as they were destined to do."}],[{"type":"prose","content":"But you are a chosen race, a royal priesthood, a holy nation, God’s own people, in order that you may proclaim the mighty acts of him who called you out of darkness into his marvelous light."}],[{"type":"poetry","content":"Once you were not a people,"},{"type":"poetry","content":"once you had not received mercy,"}],[{"type":"header","content":"Live as Servants of God"},{"type":"prose","content":"Beloved, I urge you as aliens and exiles to abstain from the desires of the flesh that wage war against the soul. "}],[{"type":"prose","content":"Conduct yourselves honorably among the Gentiles, so that, though they malign you as evildoers, they may see your honorable deeds and glorify God when he comes to judge."}],[{"type":"prose","content":"For the Lord’s sake accept the authority of every human institution, whether of the emperor as supreme, "}],[{"type":"prose","content":"or of governors, as sent by him to punish those who do wrong and to praise those who do right. "}],[{"type":"prose","content":"For it is God’s will that by doing right you should silence the ignorance of the foolish. "}],[{"type":"prose","content":"As servants of God, live as free people, yet do not use your freedom as a pretext for evil. "}],[{"type":"prose","content":"Honor everyone. Love the family of believers. Fear God. Honor the emperor."}],[{"type":"header","content":"The Example of Christ’s Suffering"},{"type":"prose","content":"Slaves, accept the authority of your masters with all deference, not only those who are kind and gentle but also those who are harsh. "}],[{"type":"prose","content":"For it is a credit to you if, being aware of God, you endure pain while suffering unjustly. "}],[{"type":"prose","content":"If you endure when you are beaten for doing wrong, what credit is that? But if you endure when you do right and suffer for it, you have God’s approval. "}],[{"type":"prose","content":"For to this you have been called, because Christ also suffered for you, leaving you an example, so that you should follow in his steps."}],[{"type":"poetry","content":"“He committed no sin,"}],[{"type":"prose","content":"When he was abused, he did not return abuse; when he suffered, he did not threaten; but he entrusted himself to the one who judges justly. "}],[{"type":"prose","content":"He himself bore our sins in his body on the cross, so that, free from sins, we might live for righteousness; by his wounds you have been healed. "}],[{"type":"prose","content":"For you were going astray like sheep, but now you have returned to the shepherd and guardian of your souls."}]]