[{"header":"Duties of Priests and Levites"},{"num":18,"verse":"And the Lord said to Aaron: You and your sons and your father’s house with you will bear the iniquity of the sanctuary, and you and your sons with you will bear the iniquity of your priesthood. "},{"num":2,"verse":"Your brothers also of the tribe of Levi, the tribe of your father, bring with you, and let them be joined with you, and minister to you. But you and your sons with you will minister before the tent of witness. "},{"num":3,"verse":"They will perform duties for you and for the whole tent; but they will not come near the vessels of the sanctuary or the altar, so that neither they nor you die. "},{"num":4,"verse":"They will be joined to you and perform the duties of the tent of meeting, for all the service of the tent; no foreigner will come near you."},{"num":5,"verse":"You yourselves will perform the duties of the sanctuary and the duties of the altar, so that wrath may never come upon the children of Israel again. "},{"num":6,"verse":"I Myself have taken your brothers, the Levites, from among the children of Israel; they are given to you as a gift from the Lord to perform the service of the tent of meeting. "},{"num":7,"verse":"And you and your sons with you will attend to your priesthood for everything at the altar, and within the veil, and you will serve. I have given your priesthood to you as a gift service, and the foreigner that comes near will be put to death."},{"header":"Offerings for Priests and Levites"},{"num":8,"verse":"The Lord spoke to Aaron: I have certainly given you the charge of the offerings made to Me, all the hallowed gifts of the children of Israel. To you and to your sons have I given them as a portion, as an ordinance forever. "},{"num":9,"verse":"This will be yours of the most holy things, reserved from the fire: All of their offerings, all of their grain offerings and all of their sin offerings, and all of their guilt offerings, which they render to Me, will be most holy for you and for your sons. "},{"num":10,"verse":"In a most holy place shall you eat it; every male shall eat it. It shall be holy to you."},{"num":11,"verse":"This is yours: the offering of their gift, with all the wave offerings of the children of Israel. I have given them to you and to your sons and to your daughters with you, as an eternal statute. Everyone who is clean in your house will eat of it."},{"num":12,"verse":"All the best of the oil, and all the best of the wine, and of the wheat, the first fruits of what they will offer to the Lord, those have I given to you. "},{"num":13,"verse":"The first ripe fruit of all which is in their land, which they will bring to the Lord, will be yours. Everyone who is clean in your house will eat of it."},{"num":14,"verse":"Everything devoted in Israel will be yours. "},{"num":15,"verse":"Everything that opens the womb of all flesh, which they bring to the Lord, whether it is of men or animals, will be yours. However, you will surely redeem the firstborn of man, and the firstborn of unclean beasts you will redeem. "},{"num":16,"verse":"Their redemption price, reckoned from one month of age, is five shekels, after the shekel of the sanctuary, which is twenty gerahs."},{"num":17,"verse":"But the firstborn of a herd animal, or the firstborn of a sheep, or the firstborn of a goat, you will not redeem. They are holy. You will splash their blood on the altar and will burn their fat as a fire offering, as a pleasing aroma to the Lord. "},{"num":18,"verse":"Their flesh will be yours, as the wave breast and as the right shoulder are yours. "},{"num":19,"verse":"All the offerings of the holy things which the children of Israel offer to the Lord I have given to you, and to your sons and your daughters with you, as an eternal statute. It is a covenant of salt forever before the Lord, to you and to your seed with you."},{"num":20,"verse":"The Lord said to Aaron: You will not have an inheritance in their land, nor will you have any territory among them. I am your territory and your inheritance among the children of Israel."},{"header":"Tithes for Supporting the Levites"},{"num":21,"verse":"I have given the children of Levi all the tithes in Israel for an inheritance, for their service, which they serve, even the service of the tent of meeting. "},{"num":22,"verse":"Hereafter, the children of Israel shall not come near the tent of meeting, lest they bear sin and die. "},{"num":23,"verse":"But the Levites will do the service of the tent of meeting, and they will bear their iniquity. It will be an eternal statute throughout your generations, that among the children of Israel they have no inheritance. "},{"num":24,"verse":"But the tithes of the children of Israel, which they offer as an offering to the Lord, I have given to the Levites to inherit. Therefore I have said to them, among the children of Israel they will have no inheritance."},{"header":"The Tithe of the Levites"},{"num":25,"verse":"The Lord spoke to Moses, saying: "},{"num":26,"verse":"You will speak to the Levites, and say to them: When you take from the children of Israel the tithes that I have given you from them for your inheritance, then you will offer up an offering of it to the Lord, even one-tenth of the tithe. "},{"num":27,"verse":"And this offering will be counted to you, as though it was the grain of the threshing floor, and as the fullness of the winepress. "},{"num":28,"verse":"Thus you also will set apart an offering to the Lord from all the tithes which you receive from the children of Israel. Out of them you will give the offering of the Lord to Aaron the priest. "},{"num":29,"verse":"Out of all your gifts you shall present every offering due to the Lord, from all the best of them, the consecrated part of them."},{"num":30,"verse":"You will say to them: When you have offered the best from it, then it will be counted to the Levites as the increase of the threshing floor, and as the increase of the winepress. "},{"num":31,"verse":"You will eat it in every place, you and your households, because it is your reward for your service in the tent of meeting. "},{"num":32,"verse":"You will bear no sin because of it, when you have offered the best of it. The holy things of the children of Israel you will not pollute, and you will not die."}]