[[],[{"type":"header","content":"Responsibility of Priests and Levites"},{"type":"prose","content":"The  said to Aaron: You and your sons and your ancestral house with you shall bear responsibility for offenses connected with the sanctuary, while you and your sons alone shall bear responsibility for offenses connected with the priesthood. "}],[{"type":"prose","content":"So bring with you also your brothers of the tribe of Levi, your ancestral tribe, in order that they may be joined to you, and serve you while you and your sons with you are in front of the tent of the covenant. "}],[{"type":"prose","content":"They shall perform duties for you and for the whole tent. But they must not approach either the utensils of the sanctuary or the altar, otherwise both they and you will die. "}],[{"type":"prose","content":"They are attached to you in order to perform the duties of the tent of meeting, for all the service of the tent; no outsider shall approach you. "}],[{"type":"prose","content":"You yourselves shall perform the duties of the sanctuary and the duties of the altar, so that wrath may never again come upon the Israelites. "}],[{"type":"prose","content":"It is I who now take your brother Levites from among the Israelites; they are now yours as a gift, dedicated to the , to perform the service of the tent of meeting. "}],[{"type":"prose","content":"But you and your sons with you shall diligently perform your priestly duties in all that concerns the altar and the area behind the curtain. I give your priesthood as a gift; any outsider who approaches shall be put to death."},{"type":"header","content":"The Priests’ Portion"}],[{"type":"prose","content":"The  spoke to Aaron: I have given you charge of the offerings made to me, all the holy gifts of the Israelites; I have given them to you and your sons as a priestly portion due you in perpetuity. "}],[{"type":"prose","content":"This shall be yours from the most holy things, reserved from the fire: every offering of theirs that they render to me as a most holy thing, whether grain offering, sin offering, or guilt offering, shall belong to you and your sons. "}],[{"type":"prose","content":"As a most holy thing you shall eat it; every male may eat it; it shall be holy to you. "}],[{"type":"prose","content":"This also is yours: I have given to you, together with your sons and daughters, as a perpetual due, whatever is set aside from the gifts of all the elevation offerings of the Israelites; everyone who is clean in your house may eat them. "}],[{"type":"prose","content":"All the best of the oil and all the best of the wine and of the grain, the choice produce that they give to the , I have given to you. "}],[{"type":"prose","content":"The first fruits of all that is in their land, which they bring to the , shall be yours; everyone who is clean in your house may eat of it. "}],[{"type":"prose","content":"Every devoted thing in Israel shall be yours. "}],[{"type":"prose","content":"The first issue of the womb of all creatures, human and animal, which is offered to the , shall be yours; but the firstborn of human beings you shall redeem, and the firstborn of unclean animals you shall redeem. "}],[{"type":"prose","content":"Their redemption price, reckoned from one month of age, you shall fix at five shekels of silver, according to the shekel of the sanctuary (that is, twenty gerahs). "}],[{"type":"prose","content":"But the firstborn of a cow, or the firstborn of a sheep, or the firstborn of a goat, you shall not redeem; they are holy. You shall dash their blood on the altar, and shall turn their fat into smoke as an offering by fire for a pleasing odor to the ; "}],[{"type":"prose","content":"but their flesh shall be yours, just as the breast that is elevated and as the right thigh are yours. "}],[{"type":"prose","content":"All the holy offerings that the Israelites present to the  I have given to you, together with your sons and daughters, as a perpetual due; it is a covenant of salt forever before the  for you and your descendants as well. "}],[{"type":"prose","content":"Then the  said to Aaron: You shall have no allotment in their land, nor shall you have any share among them; I am your share and your possession among the Israelites."}],[{"type":"prose","content":"To the Levites I have given every tithe in Israel for a possession in return for the service that they perform, the service in the tent of meeting. "}],[{"type":"prose","content":"From now on the Israelites shall no longer approach the tent of meeting, or else they will incur guilt and die. "}],[{"type":"prose","content":"But the Levites shall perform the service of the tent of meeting, and they shall bear responsibility for their own offenses; it shall be a perpetual statute throughout your generations. But among the Israelites they shall have no allotment, "}],[{"type":"prose","content":"because I have given to the Levites as their portion the tithe of the Israelites, which they set apart as an offering to the . Therefore I have said of them that they shall have no allotment among the Israelites."}],[{"type":"prose","content":"Then the  spoke to Moses, saying: "}],[{"type":"prose","content":"You shall speak to the Levites, saying: When you receive from the Israelites the tithe that I have given you from them for your portion, you shall set apart an offering from it to the , a tithe of the tithe. "}],[{"type":"prose","content":"It shall be reckoned to you as your gift, the same as the grain of the threshing floor and the fullness of the wine press. "}],[{"type":"prose","content":"Thus you also shall set apart an offering to the  from all the tithes that you receive from the Israelites; and from them you shall give the ’s offering to the priest Aaron. "}],[{"type":"prose","content":"Out of all the gifts to you, you shall set apart every offering due to the ; the best of all of them is the part to be consecrated. "}],[{"type":"prose","content":"Say also to them: When you have set apart the best of it, then the rest shall be reckoned to the Levites as produce of the threshing floor, and as produce of the wine press. "}],[{"type":"prose","content":"You may eat it in any place, you and your households; for it is your payment for your service in the tent of meeting. "}],[{"type":"prose","content":"You shall incur no guilt by reason of it, when you have offered the best of it. But you shall not profane the holy gifts of the Israelites, on pain of death."}]]