[{"num":18,"verse":"And Hashem said unto Aharon, Thou and thy Banim and thy Bais Av with thee shall bear the avon (guilt) of the Mikdash; and thou and thy Banim with thee shall bear the avon of the kehunah of you [see Ya 3:1]."},{"num":2,"verse":"And thy brethren also of the tribe of Levi, the Shevet Avicha, bring thou with thee, that they may be joined unto thee, and minister unto thee; while thou and thy Banim with thee are before the Ohel HaEdut."},{"num":3,"verse":"And they shall stand your guard duty, and the duty of Kol HaOhel; only they shall not come near the Klei HaKodesh and the Mizbe’ach, that neither they, nor ye also, die."},{"num":4,"verse":"And they shall be joined unto thee, and stand guard duty of the Ohel Mo’ed, for kol Avodat HaOhel; and a zar shall not encroach unto you."},{"num":5,"verse":"And ye shall stand guard of HaKodesh, and stand guard of the Mizbe’ach; that there be no Ketzef (Wrath) any more upon the Bnei Yisroel."},{"num":6,"verse":"And I, hinei, I Myself have taken your brethren the Levi’im from among the Bnei Yisroel; to you they are given as a mattanah (gift) to Hashem, to do the Avodat Ohel Mo’ed [see Ep 4:11]."},{"num":7,"verse":"Therefore thou and thy Banim with thee shall be shomer over your Kehunah with everything of the Mizbe’ach, and within the Parochet; and ye shall do the Avodas service: I have given your Kehunah unto you as an Avodas Mattanah; and the zar (unauthorized one) that shall encroach shall be put to death."},{"num":8,"verse":"And Hashem spoke unto Aharon, Hinei, I also have given thee the charge of Mine terumot of kol Kadoshei Bnei Yisroel; unto thee have I given them by reason of the moshchah (kohen’s allotted portion), and to thy Banim, as a chok olam."},{"num":9,"verse":"This shall be thine of the kodesh hakodashim, reserved from the eish; every korban of theirs, every minchah of theirs, and every chattat of theirs, and every asham of theirs which they shall render unto Me, shall be kodesh kodashim for thee and for thy Banim."},{"num":10,"verse":"As the kodesh hakodashim shalt thou eat it; every zakhar shall eat it; it shall be kodesh unto thee."},{"num":11,"verse":"And this is thine; the terumah of their gift, with all the tenufot Bnei Yisroel; I have given them unto thee, and to thy banim and to thy banot with thee, by a chok olam; every one that is tahor in thy Bais shall eat of it."},{"num":12,"verse":"All the best of the oil, and all the best of the wine, and of the grain, the reshit (firstfruit) of them which they shall offer unto Hashem, them have I given thee."},{"num":13,"verse":"And whatsoever is Bikkurim in the land, which they shall bring unto Hashem, shall be thine; every one that is tahor in thine Bais shall eat of it."},{"num":14,"verse":"Every cherem in Yisroel shall be thine."},{"num":15,"verse":"Every thing that openeth the womb in all basar, which they bring unto Hashem, whether it be of adam or behemah, shall be thine; nevertheless the bechor haadam shalt thou surely redeem, and the bechor habehemah hateme’ah shalt thou redeem."},{"num":16,"verse":"And those that are to be redeemed from a month old shalt thou redeem, according to thine evaluation, for the five silver shekelim, according to the shekel HaKodesh, which is twenty gerah."},{"num":17,"verse":"But the bechor of a cow, or the bechor of a sheep, or the bechor of a goat, thou shalt not redeem; they are kodesh; thou shalt sprinkle their dahm upon the Mizbe’ach, and shalt burn their fat for an offering made by eish, for a re’ach nichoach unto Hashem."},{"num":18,"verse":"And the basar of them shall be thine, like the breast of the tenufah and like the right thigh are thine."},{"num":19,"verse":"All the terumot hakodashim, which the Bnei Yisroel offer unto Hashem, have I given thee, and thy banim and thy banot with thee, by a chok olam; it is a brit melach olam before Hashem unto thee and to thy zera with thee."},{"num":20,"verse":"And Hashem spoke unto Aharon, Thou shalt have no nachalah in their land, neither shalt thou have any chelek among them; I am thy chelek and thine nachalah among the Bnei Yisroel."},{"num":21,"verse":"And, hinei, I have given the Bnei Levi all the ma’aser (tithe) in Yisroel for a nachalah, for their Avodah which they serve, even the Avodat Ohel Mo’ed."},{"num":22,"verse":"Neither must the Bnei Yisroel henceforth come near the Ohel Mo’ed, lest they bear chet, and die."},{"num":23,"verse":"But the Levi’im shall perform the Avodat Ohel Mo’ed, lest they shall nasa (bear) their avon; it shall be a chukkat olam throughout your derot, that among the Bnei Yisroel they have no nachalah."},{"num":24,"verse":"But the ma’aser of the Bnei Yisroel, which they offer as a terumah unto Hashem, I have given to the Levi’im as a nachalah; therefore, I have said unto them, Among the Bnei Yisroel they shall have no nachalah."},{"num":25,"verse":"And Hashem spoke unto Moshe, saying,"},{"num":26,"verse":"Thus speak unto the Levi’im, and say unto them, When ye take of the Bnei Yisroel the ma’aser which I have given you from them for your nachalah, then ye shall raise up a terumah of it for Hashem, even a ma’aser of the ma’aser."},{"num":27,"verse":"And this your terumah shall be reckoned unto you, as though it were the grain of the threshing floor, and as the fulness of the winepress."},{"num":28,"verse":"Thus ye also shall offer a terumat Hashem of all your ma’aserot, which ye receive of the Bnei Yisroel; and ye shall give thereof terumat Hashem to Aharon HaKohen."},{"num":29,"verse":"Out of all your mattenot ye shall offer every terumat Hashem, of all the best thereof, even the set apart as kodesh part thereof out of it."},{"num":30,"verse":"Therefore, thou shalt say unto them, When ye have raised up the best thereof from it, then it shall be counted unto the Levi’im as the increase of the threshing floor, and as the increase of the winepress."},{"num":31,"verse":"And ye shall eat it in every place, ye and your Bais: for it is your sachar for your Avodah in the Ohel Mo’ed."},{"num":32,"verse":"And ye shall bear no chet by reason of it, when ye have raised up from it the best of it; neither shall ye desecrate the Kadshei Bnei Yisroel, lest ye die."}]