[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:10-18 Multitudes are ruined by believing that God will not be so strict as his word says he will; by this artifice Satan undid mankind. Sinners are not willing to own any thing to be God's word, that tends to part them from, or to disquiet them in, their sins. Mocking and misusing the Lord's messengers, filled the measure of their iniquity. God can bring trouble upon us from places and causes very remote. He has mercy in store for his people, therefore will set bounds to this desolating judgment. Let us not overlook the nevertheless, ver. 18. This is the Lord's covenant with Israel. He thereby proclaims his holiness, and his utter displeasure against sin while sparing the sinner, Ps 89:30-35.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Her walls - It is Possible that not the city walls, but those of a vineyard are meant. Judaea is God's vineyard ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and God permits the enemy to enter the vineyard to destroy her.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Battlements - tendrils. The tendrils and branches of Judah's vine are given up to ruin, but not the stock. See Isaiah 6:13 note. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Battlements - tendrils. The tendrils and branches of Judah's vine are given up to ruin, but not the stock. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. (Jer 3:20).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Whether ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be put here for the ten tribes, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the two, as often they are, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 2:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and sundry other places; or rather, whether Judah here be only explicative, and the word meant of the two tribes only, read thus, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "house of Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " even the house of Judah, is not much material. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Have dealt very treacherously; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " have apostatized and dealt perfidiously beyond measure, not only as to the grossness, but as to the universality of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the house of Israel and the house of Judah have dealt very treacherously against me,.... This is a reason why such orders are given to the army of the Chaldeans to ascend the walls of Jerusalem and destroy them; namely, the perfidy both of the ten tribes, signified by the house of Israel; so Abarbinel; and of the two tribes of Judah and Benjamin, signified by the house of Judah; which was very great, and attended with aggravated circumstances; instances of it follow. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"they have dealt very falsely with my word:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saith the Lord; for this was not the charge of the prophet against them, but of the Lord himself. This can only be understood of such of the ten tribes as remained in Judea, for the body of that people had been carried captive mary years ago; whose sins Judah imitated, and, being also the posterity of Israel, may be so called. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saith the Lord; for this was not the charge of the prophet against them, but of the Lord himself. This can only be understood of such of the ten tribes as remained in Judea, for the body of that people had been carried captive mary years ago; whose sins Judah imitated, and, being also the posterity of Israel, may be so called. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For the house of Israel and the house of Judah have dealt very treacherously against me, saith the LORD.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In spite of the feeling of security fostered by the false prophets, the Lord will make good His word, and cause the land and kingdom to be laid waste by a barbarous people. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Go ye up upon her walls, and destroy, but make not a full end: tear away her tendrils; for they are not Jahveh's. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For faithless to me is the house of Israel become and the house of Judah, saith Jahveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They deny Jahveh, and say, He is not; and evil shall not come upon us, and sword and famine we shall not see. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the prophets shall become wind, and he that speaketh is not in them: so may it happen unto them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore thus saith Jahveh the God of hosts: Because ye speak this word, behold, I make my words in thy mouth fire, and this people wood, and it shall devour them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Behold, I bring upon you a nation from far, house of Israel, saith Jahveh, a people that is strong, a people that is from of old, a people whose speech thou knowest not, and understandest not what it saith. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Its quiver is as an open grave, they are all mighty men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It shall eat up thy harvest and thy bread; they shall eat up thy sons and thy daughters; it shall eat up thy flocks and thy cattle, eat up thy vine and thy fig-tree; it shall break down thy fenced cities, wherein thou trustest, with the sword. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But yet in those days, saith Jahveh, I will not make a full end with you.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To give emphasis to the threat, that the Lord will avenge Himself on such a people, we have immediately following, in Jeremiah 5:10, the summons given to the enemy to subdue the land.עלוּ בשׁרותיה  is variously explained. The old translators took שׁרות to mean walls; but the second clause, tear away the tendrils, seems not to suit this well. And then this word occurs but once again, and with the meaning \"caravan,\" while walls are שׁוּרות in Job 24:11. But this reason is not strong enough to throw any doubt on the rendering: walls, supported as it is by the old versions. The form שׁרות from שׁוּר is contracted from a form שׁורים, constructed analogously to שׁורות. The second clause would be unsuitable to the first only in the case that walls were to mean exclusively town walls or fortifications. But this is not the case. Even if the suffix here referred to Jerusalem, mentioned in Jeremiah 5:1, which is very doubtful, still then the city would be looked on not in the light of a stronghold, but only as representative of the kingdom or of the theocracy. Probably, however, the suffix refers to the daughter of Zion as seat of the kingdom of God, and the idea of a vineyard was in the prophet's mind (cf. Jeremiah 2:21), under which figure Isaiah (Isaiah 5:1-7) set forth the kingdom of God founded on Mount Zion; so that under walls, the walls of the vineyard are to be thought of. Elsewhere, indeed, these are called גּדרות (also in Jeremiah 49:3), but only where the figure of a vineyard is further developed, or at least is brought more plainly and prominently forward. Here, again, where the enemy is summoned to go upon the walls, this figure is mixed up with that of a city; and so the word שׂרות, as indicating walls of any kind, seems most fitting. Graf has overthrown, as being unfounded, Hitz.'s assertion, that עלה signified only, to go up against a thing; and that accuracy and elegance required that the destruction should be of the walls, not of the vineyard itself. עלה c. בּ means also: to go up upon a thing, e.g., Psalm 24:3; Deuteronomy 5:5; and the verb שׁחתוּ stands quite absolutely, so that it cannot be restricted to the walls. \"And destruction can only take place when, by scaling the walls, entrance has been obtained into that which is to be destroyed, be it city or vineyard.\" We therefore adhere to the sig. walls, especially since the other translations attempted by Ew. and Hitz. are wholly without foundation. Hitz. will have us read שׂרותיה, and take this as plural of שׁורה; next he supposes a row of vines to be intended, but he obtains this sense only by arbitrarily appending the idea of vines. Ew. endeavours, from the Aram. and Arab., to vindicate for the word the meaning: clusters of blossom, and so to obtain for the whole the translation: push in amidst the blossom-spikes. A singular figure truly, which in no way harmonizes with עלוּ ב. \"Destroy\" is restricted by the following \"but make not,\" etc.; see on Jeremiah 4:27. On \"tear away her tendrils,\" cf. Isaiah 18:5. The spoilers are not to root up the vine itself, but to remove the tendrils, which do not belong to Jahveh. Spurious members of the nation are meant, those who have degenerated out of their kind.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To give emphasis to the threat, that the Lord will avenge Himself on such a people, we have immediately following, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the summons given to the enemy to subdue the land.עלוּ בשׁרותיה  is variously explained. The old translators took שׁרות to mean walls; but the second clause, tear away the tendrils, seems not to suit this well. And then this word occurs but once again, and with the meaning \"caravan,\" while walls are שׁוּרות in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But this reason is not strong enough to throw any doubt on the rendering: walls, supported as it is by the old versions. The form שׁרות from שׁוּר is contracted from a form שׁורים, constructed analogously to שׁורות. The second clause would be unsuitable to the first only in the case that walls were to mean exclusively town walls or fortifications. But this is not the case. Even if the suffix here referred to Jerusalem, mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is very doubtful, still then the city would be looked on not in the light of a stronghold, but only as representative of the kingdom or of the theocracy. Probably, however, the suffix refers to the daughter of Zion as seat of the kingdom of God, and the idea of a vineyard was in the prophet's mind (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), under which figure Isaiah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") set forth the kingdom of God founded on Mount Zion; so that under walls, the walls of the vineyard are to be thought of. Elsewhere, indeed, these are called גּדרות (also in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but only where the figure of a vineyard is further developed, or at least is brought more plainly and prominently forward. Here, again, where the enemy is summoned to go upon the walls, this figure is mixed up with that of a city; and so the word שׂרות, as indicating walls of any kind, seems most fitting. Graf has overthrown, as being unfounded, Hitz.'s assertion, that עלה signified only, to go up against a thing; and that accuracy and elegance required that the destruction should be of the walls, not of the vineyard itself. עלה c. בּ means also: to go up upon a thing, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the verb שׁחתוּ stands quite absolutely, so that it cannot be restricted to the walls. \"And destruction can only take place when, by scaling the walls, entrance has been obtained into that which is to be destroyed, be it city or vineyard.\" We therefore adhere to the sig. walls, especially since the other translations attempted by Ew. and Hitz. are wholly without foundation. Hitz. will have us read שׂרותיה, and take this as plural of שׁורה; next he supposes a row of vines to be intended, but he obtains this sense only by arbitrarily appending the idea of vines. Ew. endeavours, from the Aram. and Arab., to vindicate for the word the meaning: clusters of blossom, and so to obtain for the whole the translation: push in amidst the blossom-spikes. A singular figure truly, which in no way harmonizes with עלוּ ב. \"Destroy\" is restricted by the following \"but make not,\" etc.; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 4:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On \"tear away her tendrils,\" cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The spoilers are not to root up the vine itself, but to remove the tendrils, which do not belong to Jahveh. Spurious members of the nation are meant, those who have degenerated out of their kind.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The reasons of this command are given in Jeremiah 5:11., by a renewed exposure of the people's apostasy. The house of Israel and the house of Judah are become faithless. On this cf. Jeremiah 3:6. The mention of Israel along with Judah gives point to the threatening, since judgment has already been executed upon Israel. Judah has equalled Israel in faithlessness, and so a like fate will be its lot. Judah shows its faithlessness by denying the Lord, by saying לא הוּא. This Ew. translates: not so, after the οὐκ ἔστι ταῦτα of the lxx; but he is certainly wrong in this. Even though הוּא may be used in place of the neuter, yet it cannot be so used in this connection, after the preceding כּחשׁוּ ביהוה. Better to take it: He is not, as the fools speak in Psalm 14:1 : there is no God, i.e., go on in their lives as if God were not. \"Jahveh is not\" is therefore in other words: there exists not a God such as Jahveh is preached to us, who is to visit His people with sore punishments. This view is not open to the objection, quod pro lubitu supplent, which Ros. raises against the interpretation: non est is, qualem prophetae describunt. For we take הוּא not as is qualem, but as est sc. Jahveh; and we explain the meaning of Jahveh only in that reference in which He is disowned by these men, namely, as God who visits His people with punishments. In this character He was preached by the prophets. This appears from what is further said by these disowners of God: evil or mischief will not come on us. To a saying of this kind they could have been provoked only by threatenings of punishments. The prophets were not indeed the first to announce judgments; Moses in the law threatened transgressors with the sorest punishments. But the context, the threatening against the false prophets in Jeremiah 5:13, suggests that here we are to think of announcements by the prophets. Doubtless the false prophets assured the people: evil shall not come upon you, in opposition to the true prophets, who threatened the sinful race with the judgments of God. Such prophets are to become wind, sc. with their utterances. הדּבּר is not a noun: the word, but a verb, with the article instead of the relative pronoun, as in Joshua 1:24; 1 Chronicles 26:28, and often: He who speaks is not in them, i.e., in them there is none other speaker than themselves; the Spirit of God is not in them. אין, \"there is none,\" is stronger than לא, meaning: they speak out of their own hearts. The threat, so be it unto them, may be most simply referred to the first clause: they become wind. Let the emptiness of their prophecies fall on their own heads, so that they themselves may come to nought. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The reasons of this command are given in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., by a renewed exposure of the people's apostasy. The house of Israel and the house of Judah are become faithless. On this cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The mention of Israel along with Judah gives point to the threatening, since judgment has already been executed upon Israel. Judah has equalled Israel in faithlessness, and so a like fate will be its lot. Judah shows its faithlessness by denying the Lord, by saying לא הוּא. This Ew. translates: not so, after the οὐκ ἔστι ταῦτα of the lxx; but he is certainly wrong in this. Even though הוּא may be used in place of the neuter, yet it cannot be so used in this connection, after the preceding כּחשׁוּ ביהוה. Better to take it: He is not, as the fools speak in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : there is no God, i.e., go on in their lives as if God were not. \"Jahveh is not\" is therefore in other words: there exists not a God such as Jahveh is preached to us, who is to visit His people with sore punishments. This view is not open to the objection, quod pro lubitu supplent, which Ros. raises against the interpretation: non est is, qualem prophetae describunt. For we take הוּא not as is qualem, but as est sc. Jahveh; and we explain the meaning of Jahveh only in that reference in which He is disowned by these men, namely, as God who visits His people with punishments. In this character He was preached by the prophets. This appears from what is further said by these disowners of God: evil or mischief will not come on us. To a saying of this kind they could have been provoked only by threatenings of punishments. The prophets were not indeed the first to announce judgments; Moses in the law threatened transgressors with the sorest punishments. But the context, the threatening against the false prophets in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", suggests that here we are to think of announcements by the prophets. Doubtless the false prophets assured the people: evil shall not come upon you, in opposition to the true prophets, who threatened the sinful race with the judgments of God. Such prophets are to become wind, sc. with their utterances. הדּבּר is not a noun: the word, but a verb, with the article instead of the relative pronoun, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 26:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and often: He who speaks is not in them, i.e., in them there is none other speaker than themselves; the Spirit of God is not in them. אין, \"there is none,\" is stronger than לא, meaning: they speak out of their own hearts. The threat, so be it unto them, may be most simply referred to the first clause: they become wind. Let the emptiness of their prophecies fall on their own heads, so that they themselves may come to nought. ",
            "children": []
          }
        ]
      }
    ]
  }
]