[[],[{"type":"prose","content":"An Instruction of Asaph. Why, O God, hast Thou cast off for ever? Thine anger smoketh against the flock of Thy pasture."}],[{"type":"prose","content":"Remember Thy company. Thou didst purchase of old, Thou didst redeem the rod of Thy inheritance, This mount Zion -- Thou didst dwell in it."}],[{"type":"prose","content":"Lift up Thy steps to the perpetual desolations, Everything the enemy did wickedly in the sanctuary."}],[{"type":"prose","content":"Roared have thine adversaries, In the midst of Thy meeting-places, They have set their ensigns as ensigns."}],[{"type":"prose","content":"He is known as one bringing in on high Against a thicket of wood -- axes."}],[{"type":"prose","content":"And now, its carvings together With axe and hatchet they break down,"}],[{"type":"prose","content":"They have sent into fire Thy sanctuary, to the earth they polluted the tabernacle of Thy name,"}],[{"type":"prose","content":"They said in their hearts, `Let us oppress them together,' They did burn all the meeting-places of God in the land."}],[{"type":"prose","content":"Our ensigns we have not seen, There is no more a prophet, Nor with us is one knowing how long."}],[{"type":"prose","content":"Till when, O God, doth an adversary reproach? Doth an enemy despise thy name for ever?"}],[{"type":"prose","content":"Why dost Thou turn back Thy hand, Even Thy right hand? From the midst of Thy bosom remove [it]."}],[{"type":"prose","content":"And God [is] my king of old, Working salvation in the midst of the earth."}],[{"type":"prose","content":"Thou hast broken by Thy strength a sea-[monster], Thou hast shivered Heads of dragons by the waters,"}],[{"type":"prose","content":"Thou hast broken the heads of leviathan, Thou makest him food, For the people of the dry places."}],[{"type":"prose","content":"Thou hast cleaved a fountain and a stream, Thou hast dried up perennial flowings."}],[{"type":"prose","content":"Thine [is] the day, also Thine [is] the night, Thou hast prepared a light giver -- the sun."}],[{"type":"prose","content":"Thou hast set up all the borders of earth, Summer and winter Thou hast formed them."}],[{"type":"prose","content":"Remember this -- an enemy reproached Jehovah, And a foolish people have despised Thy name."}],[{"type":"prose","content":"Give not up to a company, The soul of Thy turtle-dove, The company of Thy poor ones forget not for ever."}],[{"type":"prose","content":"Look attentively to the covenant, For the dark places of earth, Have been full of habitations of violence."}],[{"type":"prose","content":"Let not the oppressed turn back ashamed, Let the poor and needy praise Thy name,"}],[{"type":"prose","content":"Arise, O God, plead Thy plea, Remember Thy reproach from a fool all the day."}],[{"type":"prose","content":"Forget not the voice of Thine adversaries, The noise of Thy withstanders is going up continually!"}]]