[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(40) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But as an hired servant.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The master is in all respects to treat him as one who disposes of his service for wages for a certain time, and will then be his own master again.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall serve thee unto the year of jubile.—Nor could he be kept beyond the year of jubile. This terminated the sale of his services just as it cancelled all the sales of landed property.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shall serve thee unto the year of jubile.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Nor could he be kept beyond the year of jubile. This terminated the sale of his services just as it cancelled all the sales of landed property.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:39-55 A native Israelite, if sold for debt, or for a crime, was to serve but six years, and to go out the seventh. If he sold himself, through poverty, both his work and his usage must be such as were fitting for a son of Abraham. Masters are required to give to their servants that which is just and equal, Col 4:1. At the year of jubilee the servant should go out free, he and his children, and should return to his own family. This typified redemption from the service of sin and Satan, by the grace of God in Christ, whose truth makes us free, Joh 8:32. We cannot ransom our fellow-sinners, but we may point out Christ to them; while by his grace our lives may adorn his gospel, express our love, show our gratitude, and glorify his holy name.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The law here appears harmoniously to supplement the earlier one in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was another check applied periodically to the tyranny of the rich. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 34:8-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39-46. if thy brother … be waxen poor, and be sold unto thee, thou shalt not compel him to serve as a bond-servant—An Israelite might be compelled, through misfortune, not only to mortgage his inheritance, but himself. In the event of his being reduced to this distress, he was to be treated not as a slave, but a hired servant whose engagement was temporary, and who might, through the friendly aid of a relative, be redeemed at any time before the Jubilee. The ransom money was determined on a most equitable principle. Taking account of the number of years from the proposal to redeem and the Jubilee, of the current wages of labor for that time, and multiplying the remaining years by that sum, the amount was to be paid to the master for his redemption. But if no such friendly interposition was made for a Hebrew slave, he continued in servitude till the year of Jubilee, when, as a matter of course, he regained his liberty, as well as his inheritance. Viewed in the various aspects in which it is presented in this chapter, the Jubilee was an admirable institution, and subservient in an eminent degree to uphold the interests of religion, social order, and freedom among the Israelites.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But as an hired servant,.... Who is hired by the day, or month, or year; and, when his time is up, receives his wages and goes where he pleases, and while a servant is not under such despotic power and government as a slave is: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and as a sojourner; an inmate, one that dwells in part of a man's house, or boards and lodges with him, and whom he treats in a kind and familiar manner, rather like one of his own family than otherwise: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall be with thee; as under the above characters, and used as such: this the Jews refer to food and drink, and other things, as they do, Deuteronomy 15:16; and say (q) that a master might not eat fine bread, and his servant bread of bran; nor drink old wine, and his servant new; nor sleep on soft pillows and bedding, and his servant on straw: hence, they say (r), he that gets himself an Hebrew servant is as if he got himself a master: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he shall be with thee; as under the above characters, and used as such: this the Jews refer to food and drink, and other things, as they do, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 15:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and say (q) that a master might not eat fine bread, and his servant bread of bran; nor drink old wine, and his servant new; nor sleep on soft pillows and bedding, and his servant on straw: hence, they say (r), he that gets himself an Hebrew servant is as if he got himself a master: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall serve thee unto the year of the jubilee; and no longer; for if the year of jubilee came before the six years were expired for which he sold himself, the jubilee set him free, as Jarchi observes; nay, if be sold himself for ten or twenty years, and that but one year before the jubilee, it set him free, as Maimonides says (s). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Maimon. in Misn. Kiddushin, c. 1. sect. 2.((r) Ibid. (s) Hilchot Abadim, c. 2. sect. 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) Maimon. in Misn. Kiddushin, c. 1. sect. 2.((r) Ibid. (s) Hilchot Abadim, c. 2. sect. 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But as an hired servant, and as a sojourner, he shall be with thee, and shall serve thee unto the year of jubilee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If he borrowed money, they were not to demand interest; or if food, they were not to demand any addition, any larger quantity, when it was returned (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from fear of God, who had redeemed Israel out of bondage, to give them the land of Canaan. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " וחי is an abbreviation of וחי, which only occurs here. - From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " onwards there follow the laws relating to the bondage of the Israelite, who had been obliged to sell himself from poverty. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:36-46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " relate to his service in bondage to an (other) Israelite. The man to whom he had sold himself as servant was not to have slave-labour performed by him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but to keep him as a day-labourer and sojourner, and let him serve with him till the year of jubilee. He was then to go out free with his children, and return to his family and the possession of his fathers (his patrimony). This regulation is a supplement to the laws relating to the rights of Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:2-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), though without a contradiction arising, as Knobel maintains, between the different rules laid down. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nothing at all is determined respecting the treatment of an Israelitish servant; it is simply stated that in the seventh year of his service he was to recover his liberty. This limit is not mentioned here, because the chapter before us simply treats of the influence of the year of jubilee upon the bondage of the Israelites. On this point it is decided, that the year of jubilee was to bring freedom even to the Israelite who had been brought into slavery by his poverty, - of course only to the man who was still in slavery when it commenced and had not served seven full years, provided, that is to say, that he had not renounced his claim to be set free at the end of his seven years' service, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We have no right to expect this exception to be expressly mentioned here, because it did not interfere with the idea of the year of jubilee. For whoever voluntarily renounced the claim to be set free, whether because the year of jubilee was still so far off that he did not expect to live to see it, or because he had found a better lot with his master than he could secure for himself in a state of freedom, had thereby made a voluntary renunciation of the liberty which the year of jubilee might have brought to him (see Oehler's art. in Herzog's Cycl., where the different views on this subject are given).",
        "children": []
      }
    ]
  }
]