[{"header":"Chapter 2"},{"num":1,"verse":"Ruth and Boaz. Naomi’s husband had a kinsman, a very wealthy man from the clan of Elimelech, whose name was Boaz."},{"num":2,"verse":"Ruth the Moabite said to Naomi, “Let me go now to the field and glean ears of corn after one in whose sight I might find favor.” So she said, “Go, my daughter.”"},{"num":3,"verse":"She left and went and gleaned in the field after the reapers. It happened that she arrived at a portion of the field that belonged to Boaz of the clan of Elimelech."},{"num":4,"verse":"Just then Boaz arrived from Bethlehem and he said to the reapers, “The Lord be with you.” They answered him, “The Lord bless you.”"},{"num":5,"verse":"Boaz asked his foreman of the harvesters, “Whose young woman is this?”"},{"num":6,"verse":"The foreman of the harvesters answered, “The young woman is a Moabite. She came back with Naomi from the land of Moab."},{"num":7,"verse":"She said, ‘Please let me glean and gather the sheaves after the harvesters.’ She arrived early this morning and has continued working continuously until now, except for a short rest in the shelter.”"},{"num":8,"verse":"So Boaz said to Ruth, “Listen to me, my daughter. Do not go and glean in any other field and do not go away from here. Stay here with my servant girls."},{"num":9,"verse":"Keep your eyes on the field that they are reaping, and follow after them. I have told the young men not to bother you. When you are thirsty, go to the water jars and drink from what the young men have drawn.”"},{"num":10,"verse":"She bowed down with her face to the ground and said, “Why have I, a foreigner, found favor in your sight that you should take notice of me?”"},{"num":11,"verse":"But Boaz answered her, “I have been informed of all that you have done for your mother-in-law since your husband died, how you left your father and your mother and the land of your birth and came to live with a people whom you had not previously known."},{"num":12,"verse":"May the Lord repay you for what you have done. May you be richly rewarded by the Lord, the God of Israel, under whose wings you have taken refuge.”"},{"num":13,"verse":"Then she said, “May I continue to find favor in your sight, my lord. You have comforted me and shown kindness to your servant, even though I am not really one of your servants.”"},{"num":14,"verse":"At mealtime Boaz said to her, “Come over here and have some bread and dip it into the sour wine.” She sat alongside the reapers. He served her so much roasted grain that she ate until she was full and there was still some left over."},{"num":15,"verse":"When she got up to glean, Boaz gave orders to his men: “Even if she gathers among the sheaves, do not reproach her."},{"num":16,"verse":"Let some fall out from the bundles and leave it there for her to glean, but do not chastise her.”"},{"num":17,"verse":"So she gleaned in the field until the evening. She threshed out what she had gleaned, and it amounted to an ephah of barley."},{"num":18,"verse":"She gathered it up and went back into the city. She showed her mother-in-law what she had gleaned, and she also brought out and gave her what she had saved after she was full."},{"num":19,"verse":"Her mother-in-law asked her, “Where did you glean today and where did you work? May he who took notice of you be blessed.” She told her mother-in-law with whom she had worked, “The name of the man with whom I worked today is Boaz.”"},{"num":20,"verse":"Naomi said to her daughter-in-law, “May he be blessed by the Lord who has not withdrawn his favor from the living nor the dead.” Then Naomi said to her, “The man is one of our relatives, one of our closest relations.”"},{"num":21,"verse":"Ruth the Moabite added, “He said to me, ‘You should stay close to my young men until they have finished my harvest.’ ”"},{"num":22,"verse":"So Naomi said to Ruth, her daughter-in-law, “It is good for you to go out with his servant girls, lest you be harmed in some other field.”"},{"num":23,"verse":"So Ruth stayed close to the servant girls of Boaz to glean until the barley and the wheat harvests were over, and she continued to live with her mother-in-law."}]