[{"header":"Ruth Meets Boaz"},{"num":2,"verse":"There was an in-law of the family of Naomi’s husband there whose name was Boaz. He was a very rich man of the family of Elimelech. "},{"num":2,"verse":"Ruth, the Moabite woman, said to Naomi, “Let me go to the field to gather grain behind someone who might show favor to me.” Naomi said to her, “Go, my daughter.” "},{"num":3,"verse":"So Ruth went and gathered in the field behind those who picked the grain. And she happened to come to the part of the field that belonged to Boaz, who was of the family of Elimelech. "},{"num":4,"verse":"Now Boaz was seen coming from Bethlehem. He said to the people gathering the grain, “May the Lord be with you.” And they said to him, “May the Lord bring good to you.” "},{"num":5,"verse":"Then Boaz said to his servant who was watching over those who gathered grain, “Whose young woman is this?” "},{"num":6,"verse":"The servant who watched over those who gathered grain said, “She is the young Moabite woman who returned with Naomi from the land of Moab. "},{"num":7,"verse":"She said, ‘Let me gather food behind the others who gather among the grain.’ So she came and has stayed from morning until now. She has rested in the house a short time.”"},{"num":8,"verse":"Then Boaz said to Ruth, “Be careful to listen, my daughter. Do not go to gather grain in another field. Do not leave this one. But stay here with my women who gather grain. "},{"num":9,"verse":"Keep your eyes upon the field where they gather grain. Go behind them. I have told the servants not to touch you. When you are thirsty, go to the water jars. Drink the water the servants have put there.” "},{"num":10,"verse":"Then she fell with her face to the ground and said to him, “Why have I found favor in your eyes? Why do you care about me? I am a stranger from another land.” "},{"num":11,"verse":"Boaz said to her, “I have heard about all you have done for your mother-in-law after the death of your husband. I have heard how you left your father and mother and the land of your birth to come to a people you did not know before. "},{"num":12,"verse":"May the Lord reward you for your work. May full pay be given to you from the Lord, the God of Israel. It is under His wings that you have come to be safe.” "},{"num":13,"verse":"Then Ruth said, “Sir, I have found favor in your eyes. For you have brought comfort and have been kind in speaking to your woman servant. And I am not like any of your other women servants.”"},{"num":14,"verse":"When it was time to eat, Boaz said to Ruth, “Come here. Eat of the bread and put sour wine on it.” So she sat beside the people who gathered the grain. And Boaz brought her grain made ready over a fire. She ate and was filled and had some left. "},{"num":15,"verse":"When she got up to gather grain, Boaz told his servants, “Let her gather even among the standing grain. Do not speak against her. "},{"num":16,"verse":"Pull some grain out of the grain that has been gathered together and leave it for her to gather. And do not speak sharp words to her.”"},{"num":17,"verse":"So Ruth gathered grain in the field until evening. Then she beat out what she had gathered. It was enough barley to fill a basket. "},{"num":18,"verse":"She picked it up and went into the city to show her mother-in-law what she had gathered. Ruth gave Naomi what she had left after she was filled. "},{"num":19,"verse":"Her mother-in-law said to her, “Where did you gather grain today? Where did you work? May good come to the man who showed you favor.” So Ruth told her mother-in-law, “The name of the man I worked with today is Boaz.” "},{"num":20,"verse":"Naomi said to her daughter-in-law, “May he receive good from the Lord, Who has not kept His kindness from the living and the dead.” Then Naomi said to her, “The man is near to us. He is of our family.” "},{"num":21,"verse":"Ruth, the Moabite woman, said, “He told me, ‘You should stay close to my servants until they have finished gathering all my grain.’” "},{"num":22,"verse":"Naomi said to her daughter-in-law Ruth, “It is good that you go out with his women servants, my daughter. Then no danger will come upon you in another field.” "},{"num":23,"verse":"So she stayed close to those who worked for Boaz until the end of the time of gathering grain. And she lived with her mother-in-law."}]