[{"header":"Craftsmen for the Tent"},{"num":31,"verse":"The Lord told Moses, "},{"num":2,"verse":"“Look, I’ve called Uri’s son Bezalel, grandson of Hur from Judah’s tribe "},{"num":3,"verse":"and I’ve filled him with the Spirit of God, with wisdom, understanding, knowledge, and all kinds of craftsmanship "},{"num":4,"verse":"to create plans for work in gold, silver, and bronze, "},{"num":5,"verse":"and for cutting stones to set them, for carving wood, and for doing all kinds of craftsmanship. "},{"num":6,"verse":"Along with him I’m appointing Ahisamach’s son Oholiab from the tribe of Dan, and I’ve given wisdom to all who are skilled so they can make everything that I’ve commanded you, "},{"num":7,"verse":"including the Tent of Meeting, the Ark of the Testimony, the Mercy Seat that is on it, all the furnishings of the tent— "},{"num":8,"verse":"the table and its furnishings, the lamp stand of pure gold, all its furnishings, the altar of incense, "},{"num":9,"verse":"the altar for burnt offerings, its furnishings, the basin, its base, "},{"num":10,"verse":"the woven garments, the holy garments of Aaron the priest, the garments of his sons as they serve as priests, "},{"num":11,"verse":"the anointing oil, and the fragrant incense for the Holy Place. They are to make them in accordance with everything that I commanded you.”"},{"num":12,"verse":"The Lord told Moses, "},{"num":13,"verse":"“You are to tell the Israelis: ‘You are to certainly observe my Sabbaths because it’s a sign between me and you from generation to generation, so you may know that I am the Lord who sanctifies you. "},{"num":14,"verse":"You are to observe the Sabbath, because it’s holy for you. Whoever profanes it is certainly to die; indeed, whoever does work on it is to be cut off from among his people. "},{"num":15,"verse":"Work may be done for six days, but the seventh day is a Sabbath of complete rest, holy to the Lord. Whoever does work on the Sabbath is certainly to die. "},{"num":16,"verse":"The Israelis are to keep the Sabbath to make the Sabbath observance a perpetual covenant from generation to generation. "},{"num":17,"verse":"It is a sign forever between me and the Israelis, because the Lord made the heavens and the earth in six days, but on the seventh day he rested and was refreshed.’”"},{"num":18,"verse":"When he finished speaking with Moses on Mount Sinai, he gave him the two Tablets of the Testimony, tablets of stone written by the finger of God."}]