[{"num":31,"verse":"And Hashem spoke unto Moshe, saying,"},{"num":2,"verse":"See, I have called by shem Bezalel ben Uri, ben Chur, of the tribe of Yehudah;"},{"num":3,"verse":"And I have filled him with the Ruach Elohim (see Ac 2:4), in chochmah, and in tevunah, and in da’as, and in kol melachah (all workmanship),"},{"num":4,"verse":"To devise machashavot (artistic designs), to work in zahav, and in kesef, and in nechoshet,"},{"num":5,"verse":"And in engraving gemstones, to set them, and in wood-carving, to work in kol melachah (all manner of workmanship)."},{"num":6,"verse":"And I, hinei, I have given with him Oholiav ben Achisamach, of the tribe of Dan; and in the hearts of all chacham lev I have put chochmah, that they may make all that I have commanded thee:"},{"num":7,"verse":"The Ohel Mo’ed, and the Aron HaEdut, and the Kapporet that is thereupon, and all the utensils of the Ohel,"},{"num":8,"verse":"And the Shulchan and its utensils, and the Menorah Hatehorah with all its utensils, and the Mizbe’ach HaKetoret,"},{"num":9,"verse":"And the Mizbe’ach HaOlah with all its utensils, and the Kiyor and its Stand,"},{"num":10,"verse":"And the Bigdei Haserad (Knit Garments), and the Bigdei HaKodesh for Aharon the kohen, and the garments of his banim, to minister in the kohen’s office,"},{"num":11,"verse":"And the Shemen Hamishchah, and Ketoret spices for HaKodesh; according to all that I have commanded thee shall they do."},{"num":12,"verse":"And Hashem spoke unto Moshe, saying,"},{"num":13,"verse":"Speak thou also unto the Bnei Yisroel, saying, Verily My Shabbatot ye shall be shomer over; for it is an ot (sign) between Me and you throughout your dorot; that ye may have da’as that I am Hashem Who doth set thee apart as kodesh."},{"num":14,"verse":"Ye shall be shomer Shabbos therefore; for it is kodesh unto you; every one that is chillul Shabbos (desecrates Shabbos) shall surely be put to death; for whosoever doeth any work therein, that nefesh shall be cut off from among his people."},{"num":15,"verse":"Sheshet yamim may work be done; but in the Yom HaShevi’i is Shabbos HaShabbaton, kodesh to Hashem; whosoever doeth any work in the Yom HaShabbos, he shall surely be put to death."},{"num":16,"verse":"Wherefore the Bnei Yisroel shall be shomer Shabbos, to observe Shabbos throughout their dorot, for a brit olam."},{"num":17,"verse":"It is an ot between Me and the Bnei Yisroel l’olam; for in sheshet yamim Hashem made Shomayim and HaAretz, and on Yom HaShevi’i He rested (shavat, ceased working), and was refreshed."},{"num":18,"verse":"And He gave unto Moshe, when He had made an end of speaking with him upon Mt. Sinai, two Luchot HaEdut (Tablets of the Testimony), Luchot Even (Tablets of Stone), written with the Etzba Elohim (Finger of G-d)."}]