[{"num":18,"verse":"Having said these things, Jesus went out with His disciples beyond (across) the winter torrent of the Kidron [in the ravine]. There was a garden there, which He and His disciples entered."},{"num":2,"verse":"And Judas, who was betraying Him and delivering Him up, also knew the place, because Jesus had often retired there with His disciples."},{"num":3,"verse":"So Judas, obtaining and taking charge of the band of soldiers and some guards (attendants) of the high priests and Pharisees, came there with lanterns and torches and weapons."},{"num":4,"verse":"Then Jesus, knowing all that was about to befall Him, went out to them and said, Whom are you seeking? [Whom do you want?]"},{"num":5,"verse":"They answered Him, Jesus the Nazarene. Jesus said to them, I am He. Judas, who was betraying Him, was also standing with them."},{"num":6,"verse":"When Jesus said to them, I am He, they went backwards (drew back, lurched backward) and fell to the ground."},{"num":7,"verse":"Then again He asked them, Whom are you seeking? And they said, Jesus the Nazarene."},{"num":8,"verse":"Jesus answered, I told you that I am He. So, if you want Me [if it is only I for Whom you are looking], let these men go their way."},{"num":9,"verse":"Thus what He had said was fulfilled and verified, Of those whom You have given Me, I have not lost even one."},{"num":10,"verse":"Then Simon Peter, who had a sword, drew it and struck the high priest’s servant and cut off his right ear. The servant’s name was Malchus."},{"num":11,"verse":"Therefore, Jesus said to Peter, Put the sword [back] into the sheath! The cup which My Father has given Me, shall I not drink it?"},{"num":12,"verse":"So the troops and their captain and the guards (attendants) of the Jews seized Jesus and bound Him,"},{"num":13,"verse":"And they brought Him first to Annas, for he was the father-in-law of Caiaphas, who was the high priest that year."},{"num":14,"verse":"It was Caiaphas who had counseled the Jews that it was expedient and for their welfare that one man should die for (instead of, in behalf of) the people."},{"num":15,"verse":"Now Simon Peter and another disciple were following Jesus. And that disciple was known to the high priest, and so he entered along with Jesus into the court of the palace of the high priest;"},{"num":16,"verse":"But Peter was standing outside at the door. So the other disciple, who was known to the high priest, went out and spoke to the maid who kept the door and brought Peter inside."},{"num":17,"verse":"Then the maid who was in charge at the door said to Peter, You are not also one of the disciples of this Man, are you? He said, I am not!"},{"num":18,"verse":"Now the servants and the guards (the attendants) had made a fire of coals, for it was cold, and they were standing and warming themselves. And Peter was with them, standing and warming himself."},{"num":19,"verse":"Then the high priest questioned Jesus about His disciples and about His teaching."},{"num":20,"verse":"Jesus answered him, I have spoken openly to the world. I have always taught in a synagogue and in the temple [area], where the Jews [habitually] congregate (assemble); and I have spoken nothing secretly."},{"num":21,"verse":"Why do you ask Me? Ask those who have heard [Me] what I said to them. See! They know what I said."},{"num":22,"verse":"But when He said this, one of the attendants who stood by struck Jesus, saying, Is that how You answer the high priest?"},{"num":23,"verse":"Jesus replied, If I have said anything wrong [if I have spoken abusively, if there was evil in what I said] tell what was wrong with it. But if I spoke rightly and properly, why do you strike Me?"},{"num":24,"verse":"Then Annas sent Him bound to Caiaphas the high priest."},{"num":25,"verse":"But Simon Peter [still] was standing and was warming himself. They said to him, You are not also one of His disciples, are you? He denied it and said, I am not!"},{"num":26,"verse":"One of the high priest’s servants, a relative of the man whose ear Peter cut off, said, Did I not see you in the garden with Him?"},{"num":27,"verse":"And again Peter denied it. And immediately a rooster crowed."},{"num":28,"verse":"Then they brought Jesus from Caiaphas into the Praetorium (judgment hall, governor’s palace). And it was early. They themselves did not enter the Praetorium, that they might not be defiled (become ceremonially unclean), but might be fit to eat the Passover [supper]."},{"num":29,"verse":"So Pilate went out to them and said, What accusation do you bring against this Man?"},{"num":30,"verse":"They retorted, If He were not an evildoer (criminal), we would not have handed Him over to you."},{"num":31,"verse":"Pilate said to them, Take Him yourselves and judge and sentence and punish Him according to your [own] law. The Jews answered, It is not lawful for us to put anyone to death."},{"num":32,"verse":"This was to fulfill the word which Jesus had spoken to show (indicate, predict) by what manner of death He was to die."},{"num":33,"verse":"So Pilate went back again into the judgment hall and called Jesus and asked Him, Are You the King of the Jews?"},{"num":34,"verse":"Jesus replied, Are you saying this of yourself [on your own initiative], or have others told you about Me?"},{"num":35,"verse":"Pilate answered, Am I a Jew? Your [own] people and nation and their chief priests have delivered You to me. What have You done?"},{"num":36,"verse":"Jesus answered, My kingdom (kingship, royal power) belongs not to this world. If My kingdom were of this world, My followers would have been fighting to keep Me from being handed over to the Jews. But as it is, My kingdom is not from here (this world); [it has no such origin or source]."},{"num":37,"verse":"Pilate said to Him, Then You are a King? Jesus answered, You say it! [You speak correctly!] For I am a King. [Certainly I am a King!] This is why I was born, and for this I have come into the world, to bear witness to the Truth. Everyone who is of the Truth [who is a friend of the Truth, who belongs to the Truth] hears and listens to My voice."},{"num":38,"verse":"Pilate said to Him, What is Truth? On saying this he went out to the Jews again and told them, I find no fault in Him."},{"num":39,"verse":"But it is your custom that I release one [prisoner] for you at the Passover. So shall I release for you the King of the Jews?"},{"num":40,"verse":"Then they all shouted back again, Not Him [not this Man], but Barabbas! Now Barabbas was a robber."}]