[{"header":"Jesus Is Arrested"},{"num":18,"verse":"When Jesus finished praying, he went with his followers across the Kidron Valley. On the other side there was a garden, and Jesus and his followers went into it."},{"num":2,"verse":"Judas knew where this place was, because Jesus met there often with his followers. Judas was the one who turned against Jesus. "},{"num":3,"verse":"So Judas came there with a group of soldiers and some guards from the leading priests and the Pharisees. They were carrying torches, lanterns, and weapons."},{"num":4,"verse":"Knowing everything that would happen to him, Jesus went out and asked, “Who is it you are looking for?”"},{"num":5,"verse":"They answered, “Jesus from Nazareth.”"},{"num":6,"verse":"When Jesus said, “I am he,” they moved back and fell to the ground."},{"num":7,"verse":"Jesus asked them again, “Who is it you are looking for?”"},{"num":9,"verse":"This happened so that the words Jesus said before would come true: “I have not lost any of the ones you gave me.”"},{"num":10,"verse":"Simon Peter, who had a sword, pulled it out and struck the servant of the high priest, cutting off his right ear. (The servant’s name was Malchus.) "},{"num":11,"verse":"Jesus said to Peter, “Put your sword back. Shouldn’t I drink the cup the Father gave me?”"},{"header":"Jesus Is Brought Before Annas"},{"num":12,"verse":"Then the soldiers with their commander and the guards arrested Jesus. They tied him "},{"num":13,"verse":"and led him first to Annas, the father-in-law of Caiaphas, the high priest that year. "},{"num":14,"verse":"Caiaphas was the one who told the Jews that it would be better if one man died for all the people."},{"header":"Peter Says He Doesn’t Know Jesus"},{"num":15,"verse":"Simon Peter and another one of Jesus’ followers went along after Jesus. This follower knew the high priest, so he went with Jesus into the high priest’s courtyard. "},{"num":16,"verse":"But Peter waited outside near the door. The follower who knew the high priest came back outside, spoke to the girl at the door, and brought Peter inside. "},{"num":17,"verse":"The girl at the door said to Peter, “Aren’t you also one of that man’s followers?”"},{"num":18,"verse":"It was cold, so the servants and guards had built a fire and were standing around it, warming themselves. Peter also was standing with them, warming himself."},{"header":"The High Priest Questions Jesus"},{"num":19,"verse":"The high priest asked Jesus questions about his followers and his teaching. "},{"num":20,"verse":"Jesus answered, “I have spoken openly to everyone. I have always taught in synagogues and in the Temple, where all the Jews come together. I never said anything in secret. "},{"num":22,"verse":"When Jesus said this, one of the guards standing there hit him. The guard said, “Is that the way you answer the high priest?”"},{"num":23,"verse":"Jesus answered him, “If I said something wrong, then show what it was. But if what I said is true, why do you hit me?”"},{"num":24,"verse":"Then Annas sent Jesus, who was still tied, to Caiaphas the high priest."},{"header":"Peter Says Again He Doesn’t Know Jesus"},{"num":25,"verse":"As Simon Peter was standing and warming himself, they said to him, “Aren’t you one of that man’s followers?”"},{"num":26,"verse":"One of the servants of the high priest was there. This servant was a relative of the man whose ear Peter had cut off. The servant said, “Didn’t I see you with him in the garden?”"},{"num":27,"verse":"Again Peter said it wasn’t true. At once a rooster crowed."},{"header":"Jesus Is Brought Before Pilate"},{"num":28,"verse":"Early in the morning they led Jesus from Caiaphas’s house to the Roman governor’s palace. They would not go inside the palace, because they did not want to make themselves unclean; they wanted to eat the Passover meal. "},{"num":29,"verse":"So Pilate went outside to them and asked, “What charges do you bring against this man?”"},{"num":30,"verse":"They answered, “If he were not a criminal, we wouldn’t have brought him to you.”"},{"num":31,"verse":"Pilate said to them, “Take him yourselves and judge him by your own law.”"},{"num":32,"verse":"(This happened so that what Jesus said about how he would die would come true.)"},{"num":33,"verse":"Then Pilate went back inside the palace and called Jesus to him and asked, “Are you the king of the Jews?”"},{"num":34,"verse":"Jesus said, “Is that your own question, or did others tell you about me?”"},{"num":35,"verse":"Pilate answered, “I am not one of you. It was your own people and their leading priests who handed you over to me. What have you done wrong?”"},{"num":36,"verse":"Jesus answered, “My kingdom does not belong to this world. If it belonged to this world, my servants would have fought to keep me from being given over to the Jewish leaders. But my kingdom is from another place.”"},{"num":37,"verse":"Pilate said, “So you are a king!”"},{"num":38,"verse":"Pilate said, “What is truth?” After he said this, he went out to the crowd again and said to them, “I find nothing against this man. "},{"num":39,"verse":"But it is your custom that I free one prisoner to you at Passover time. Do you want me to free the ‘king of the Jews’?”"},{"num":40,"verse":"They shouted back, “No, not him! Let Barabbas go free!” (Barabbas was a robber.)"}]