[{"header":"Betrayal and Arrest in Gethsemane(A)"},{"num":18,"verse":"When Jesus had spoken these words, He went out with His disciples over the Brook Kidron, where there was a garden, which He and His disciples entered. "},{"num":2,"verse":"And Judas, who betrayed Him, also knew the place; for Jesus often met there with His disciples. "},{"num":3,"verse":"Then Judas, having received a detachment of troops, and officers from the chief priests and Pharisees, came there with lanterns, torches, and weapons. "},{"num":4,"verse":"Jesus therefore, knowing all things that would come upon Him, went forward and said to them, “Whom are you seeking?”"},{"num":5,"verse":"They answered Him, “Jesus of Nazareth.”"},{"num":6,"verse":"Now when He said to them, “I am He,” they drew back and fell to the ground."},{"num":7,"verse":"Then He asked them again, “Whom are you seeking?”"},{"num":8,"verse":"Jesus answered, “I have told you that I am He. Therefore, if you seek Me, let these go their way,” "},{"num":9,"verse":"that the saying might be fulfilled which He spoke, “Of those whom You gave Me I have lost none.”"},{"num":10,"verse":"Then Simon Peter, having a sword, drew it and struck the high priest’s servant, and cut off his right ear. The servant’s name was Malchus."},{"num":11,"verse":"So Jesus said to Peter, “Put your sword into the sheath. Shall I not drink the cup which My Father has given Me?”"},{"header":"Before the High Priest"},{"num":12,"verse":"Then the detachment of troops and the captain and the officers of the Jews arrested Jesus and bound Him. "},{"num":13,"verse":"And they led Him away to Annas first, for he was the father-in-law of Caiaphas who was high priest that year. "},{"num":14,"verse":"Now it was Caiaphas who advised the Jews that it was expedient that one man should die for the people."},{"header":"Peter Denies Jesus(P)"},{"num":15,"verse":"And Simon Peter followed Jesus, and so did another disciple. Now that disciple was known to the high priest, and went with Jesus into the courtyard of the high priest. "},{"num":16,"verse":"But Peter stood at the door outside. Then the other disciple, who was known to the high priest, went out and spoke to her who kept the door, and brought Peter in. "},{"num":17,"verse":"Then the servant girl who kept the door said to Peter, “You are not also one of this Man’s disciples, are you?”"},{"num":18,"verse":"Now the servants and officers who had made a fire of coals stood there, for it was cold, and they warmed themselves. And Peter stood with them and warmed himself."},{"header":"Jesus Questioned by the High Priest"},{"num":19,"verse":"The high priest then asked Jesus about His disciples and His doctrine."},{"num":20,"verse":"Jesus answered him, “I spoke openly to the world. I always taught in synagogues and in the temple, where the Jews always meet, and in secret I have said nothing. "},{"num":21,"verse":"Why do you ask Me? Ask those who have heard Me what I said to them. Indeed they know what I said.”"},{"num":22,"verse":"And when He had said these things, one of the officers who stood by struck Jesus with the palm of his hand, saying, “Do You answer the high priest like that?”"},{"num":23,"verse":"Jesus answered him, “If I have spoken evil, bear witness of the evil; but if well, why do you strike Me?”"},{"num":24,"verse":"Then Annas sent Him bound to Caiaphas the high priest."},{"header":"Peter Denies Twice More"},{"num":25,"verse":"Now Simon Peter stood and warmed himself. Therefore they said to him, “You are not also one of His disciples, are you?”"},{"num":26,"verse":"One of the servants of the high priest, a relative of him whose ear Peter cut off, said, “Did I not see you in the garden with Him?” "},{"num":27,"verse":"Peter then denied again; and immediately a rooster crowed."},{"header":"In Pilate’s Court(AD)"},{"num":28,"verse":"Then they led Jesus from Caiaphas to the Praetorium, and it was early morning. But they themselves did not go into the Praetorium, lest they should be defiled, but that they might eat the Passover. "},{"num":29,"verse":"Pilate then went out to them and said, “What accusation do you bring against this Man?”"},{"num":30,"verse":"They answered and said to him, “If He were not an evildoer, we would not have delivered Him up to you.”"},{"num":31,"verse":"Then Pilate said to them, “You take Him and judge Him according to your law.”"},{"num":32,"verse":"that the saying of Jesus might be fulfilled which He spoke, signifying by what death He would die."},{"num":33,"verse":"Then Pilate entered the Praetorium again, called Jesus, and said to Him, “Are You the King of the Jews?”"},{"num":34,"verse":"Jesus answered him, “Are you speaking for yourself about this, or did others tell you this concerning Me?”"},{"num":35,"verse":"Pilate answered, “Am I a Jew? Your own nation and the chief priests have delivered You to me. What have You done?”"},{"num":36,"verse":"Jesus answered, “My kingdom is not of this world. If My kingdom were of this world, My servants would fight, so that I should not be delivered to the Jews; but now My kingdom is not from here.”"},{"num":37,"verse":"Pilate therefore said to Him, “Are You a king then?”"},{"num":38,"verse":"Pilate said to Him, “What is truth?” And when he had said this, he went out again to the Jews, and said to them, “I find no fault in Him at all."},{"header":"Taking the Place of Barabbas(AR)"},{"num":39,"verse":"“But you have a custom that I should release someone to you at the Passover. Do you therefore want me to release to you the King of the Jews?”"},{"num":40,"verse":"Then they all cried again, saying, “Not this Man, but Barabbas!” Now Barabbas was a robber."}]