[{"header":"Jesus Handed Over to Sinners (A)"},{"num":18,"verse":"When Jesus had said these things, He went with His followers across the small river Kidron. He and His followers went to a garden there. "},{"num":2,"verse":"Judas, who was handing Him over to the leaders, knew the place also. Jesus and His followers had met there many times. "},{"num":3,"verse":"Judas led some soldiers and some men who had been sent by the head religious leaders of the Jews and the proud religious law-keepers to the garden. They carried lamps and sticks that were burning and swords."},{"num":4,"verse":"Jesus knew what was going to happen to Him. He went out and asked them, “Who are you looking for?” "},{"num":5,"verse":"The soldiers answered Him, “Jesus of Nazareth.” Jesus said, “I am Jesus.” Judas, who was handing Him over, was with them also."},{"num":6,"verse":"When He said to them, “I am Jesus,” they stepped back and fell to the ground. "},{"num":7,"verse":"He asked them again, “Who are you looking for?” They said again, “Jesus of Nazareth.” "},{"num":8,"verse":"He said, “I have told you that I am Jesus. If you are looking for Me, let these men go their way.” "},{"num":9,"verse":"He said this so the words He spoke might happen, “I have not lost one of those You gave Me.”"},{"num":10,"verse":"Simon Peter had a sword. He took it and hit a servant who was owned by the head religious leader and cut off his right ear. The servant’s name was Malchus. "},{"num":11,"verse":"Then Jesus said to Peter, “Put your sword back where it belongs. Am I not to go through what My Father has given Me to go through?”"},{"header":"Jesus Stands in Front of Annas"},{"num":12,"verse":"Then the soldiers and their captain and the men sent by the Jewish religious leaders took Jesus and tied Him. "},{"num":13,"verse":"They took Him to Annas first. He was the father-in-law of Caiaphas. Caiaphas was the head religious leader that year. "},{"num":14,"verse":"Caiaphas had talked to the Jews. He told them it would be a good thing if one man should die for the people."},{"header":"Peter Lies about Jesus (B)"},{"num":15,"verse":"Simon Peter and another follower came behind Jesus. This other follower was known to the head religious leader. He went with Jesus to the head religious leader’s house. "},{"num":16,"verse":"Peter stood outside at the gate. The other follower, who was known by the head religious leader, went out and talked to the servant-girl who watched the gate. Then he took Peter inside. "},{"num":17,"verse":"The servant-girl who watched the door said to Peter, “Are you not a follower of this Man?” He said, “I am not!” "},{"num":18,"verse":"The servants who were owned by someone and the soldiers had made a fire because it was cold. They were getting warm by the fire. Peter was standing with them getting warm."},{"header":"Jesus Stands in Front of Caiaphas (C)"},{"num":19,"verse":"The head religious leader of the Jews asked Jesus about His followers. He asked Jesus about His teaching. "},{"num":20,"verse":"Jesus said, “I have spoken very plain words to the world. I have always taught in the Jewish place of worship and in the house of God. It is where the Jews go all the time. My words have not been said in secret. "},{"num":22,"verse":"Then one of the soldiers standing there hit Jesus with his hand. He said, “Is that how You talk to the head religious leaders?” "},{"num":23,"verse":"Jesus said, “If I said anything wrong, tell Me what was wrong. If I said what was right, why did you hit Me?” "},{"num":24,"verse":"Then Annas sent Jesus to Caiaphas, the head religious leader. Jesus was still tied up."},{"num":25,"verse":"Simon Peter was standing there and getting warm. They said to him, “Are you not one of His followers also?” He lied and said he did not know Jesus and answered, “I am not!” "},{"num":26,"verse":"A servant who was owned by the head religious leader was there. He was of the family of the man whose ear Peter cut off. The man said, “Did I not see you in the garden with Him?” "},{"num":27,"verse":"Again Peter lied and said he did not know Jesus. At once a rooster crowed."},{"header":"Jesus Stands in Front of Pilate (D)"},{"num":28,"verse":"They led Jesus from Caiaphas into the court room. It was early in the morning. They did not go inside because their Law said if they did they would become dirty with sin. Then they would not be able to eat the religious supper to remember how the Jews left Egypt. "},{"num":29,"verse":"So Pilate came out to them. He asked, “What have you to say against the Man?” "},{"num":30,"verse":"The Jews said, “If He had not done wrong, we would not have brought Him to you.”"},{"num":31,"verse":"Then Pilate said to them, “Take Him yourselves and give Him a trial by your Law.” The Jews said to him, “It is against our Law to put anyone to death.” "},{"num":32,"verse":"This happened as Jesus said it would happen. He had told what kind of death He would die."},{"num":33,"verse":"Then Pilate went back into the court room. He called for Jesus and said to Him, “Are You the King of the Jews?” "},{"num":34,"verse":"Jesus said, “Do you ask Me this yourself, or did others say this to you about Me?” "},{"num":35,"verse":"Pilate said, “Do you think I am a Jew? Your own people and religious leaders have handed You over to me. What have You done?” "},{"num":36,"verse":"Jesus said, “My holy nation does not belong to this world. If My holy nation were of this world, My helpers would fight so I would not be handed over to the Jews. My holy nation is not of this world.” "},{"num":37,"verse":"Pilate said to Him, “So You are a King?” Jesus said, “You are right when you say that I am a King. I was born for this reason. I came into the world for this reason. I came to speak about the truth. Everyone who is of the truth hears My voice.”"},{"header":"Jesus or Barabbas Is to Go Free (E)"},{"num":38,"verse":"Pilate said to Jesus, “What is truth?” After Pilate said this, he went out again to the Jews. He said, “I do not find Him guilty. "},{"num":39,"verse":"But every year a man who is in prison is allowed to go free at the special religious gathering to remember how the Jews left Egypt. Do you want the King of the Jews to go free?” "},{"num":40,"verse":"Then they spoke with loud voices, “Not this Man, but Barabbas!” Now Barabbas was a robber."}]