[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Zechariah 14:17-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:17-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whoso will not come up of all the families of the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If there be any remiss herein, and neglect to worship the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even upon them shall be no rain — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They shall be punished with want of rain, and of the blessings which plentiful and seasonable rains produce; their land shall be barren, and they shall suffer a famine. “There is a restriction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” says Newcome, “to such nations as warred against Jerusalem.” “But if, according to the opinion of many commentators, by going up to Jerusalem to worship, and to keep the feast of tabernacles, be only meant a conformity to the established worship of the one true God, or, which is the same thing, to the Christian religion, there can be no objection to understanding a strict universality of the nations. For it is repeatedly foretold, that a time would come, when ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all the ends of the world shall remember and turn unto the Lord, and all the families of the nations shall worship before him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” — Blayney. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And if the family of Egypt go not up, that have no rain — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Where, by the situation of the country, there is no rain; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there shall be the plague wherewith the Lord will smite the heathen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, although they be not visited in the same manner as the other nations, namely, with a want of rain, which of itself would be no punishment to that country; yet, as it follows in the next verse, they shall not be exempt from the same punishment with the other nations that sinned in like manner, namely, famine, “which would be the sure consequence if the rains did not fall in Ethiopia, so as to cause an overflowing of the Nile.” — Newcome. The reader will observe, respecting these predictions, that the prophet, “foretelling the blessings arising from the restoration of the Jews, and the conversion of the Gentiles to the Christian faith, draws his images from the old dispensation; and, as is usual throughout the prophetic writings, expresses the rewards and punishments of the new dispensation, under figures borrowed from the old.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:16-21 As it is impossible for all nations literally to come to Jerusalem once a year, to keep a feast, it is evident that a figurative meaning must here be applied. Gospel worship is represented by the keeping of the feast of tabernacles. Every day of a Christian's life is a day of the feast of tabernacles; every Lord's day especially is the great day of the feast; therefore every day let us worship the Lord of hosts, and keep every Lord's day with peculiar solemnity. It is just for God to withhold the blessings of grace from those who do not attend the means of grace. It is a sin that is its own punishment; those who forsake the duty, forfeit the privilege of communion with God. A time of complete peace and purity of the church will arrive. Men will carry on their common affairs, and their sacred services, upon the same holy principles of faith, love and obedience. Real holiness shall be more diffused, because there shall be a more plentiful pouring forth of the Spirit of holiness than ever before. There shall be holiness even in common things. Every action and every enjoyment of the believer, should be so regulated according to the will of God, that it may be directed to his glory. Our whole lives should be as one constant sacrifice, or act of devotion; no selfish motive should prevail in any of our actions. But how far is the Christian church from this state of purity! Other times, however, are at hand, and the Lord will reform and enlarge his church, as he has promised. Yet in heaven alone will perfect holiness and happiness be found.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whoso will not go up - Cyril: \"To those who 'go not up,'\" he threatens the same punishment as persecutors would endure. For enemies, and they who will not love, shall have the same lot. This is, I think, what Christ Himself said, 'Whoso is not with Me is against Me, and whoso gathereth not with Me scattereth' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 11:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon them there shall be no rain - Rain was the most essential of God's temporal gifts for the temporal well-being of His people. Moses marked out this, as his people were entering on the promised land, with recent memory of Egypt's independence of rain in Egypt itself, and that this gift depended on obedience. \"The land, whither thou goest in to possess it, is not as the land of Egypt, whence, ye came out, where thou sowedst thy seed and wateredst it with thy foot, as a garden of herbs\" Deuteronomy 11:10-11 : but a \"land of hills and valleys, it drinketh water of the rain of heaven; a land which the Lord thy God careth for; the eyes of the Lord are always upon it, from the beginning of the year even unto the end of the year. And it shall be, if ye shall hearken diligently unto My commandments - I will give you the rain of your land in its season, the first rain and the latter rain, that thou mayest gather in thy corn and thy wine and thine oil. And I will send grass in thy fields for thy cattle, that thou mayest eat and be full.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Upon them there shall be no rain - Rain was the most essential of God's temporal gifts for the temporal well-being of His people. Moses marked out this, as his people were entering on the promised land, with recent memory of Egypt's independence of rain in Egypt itself, and that this gift depended on obedience. \"The land, whither thou goest in to possess it, is not as the land of Egypt, whence, ye came out, where thou sowedst thy seed and wateredst it with thy foot, as a garden of herbs\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 11:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : but a \"land of hills and valleys, it drinketh water of the rain of heaven; a land which the Lord thy God careth for; the eyes of the Lord are always upon it, from the beginning of the year even unto the end of the year. And it shall be, if ye shall hearken diligently unto My commandments - I will give you the rain of your land in its season, the first rain and the latter rain, that thou mayest gather in thy corn and thy wine and thine oil. And I will send grass in thy fields for thy cattle, that thou mayest eat and be full.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But the threat on disobedience corresponded therewith. \"Take heed to yourselves,\" Moses continues, \"that your heart be not deceived, and ye turn aside and serve other gods - and the Lord's wrath be kindled against you, and He shut up the heaven, that there be no rain, and that the land yield not her fruit, and ye perish quickly from off the good land, which the Lord giveth you\" Deuteronomy 16-17; and, \"Thy heaven, that is over thee, shall be brass, and the earth, that is under thee, shall be iron; the Lord shall make the rain of thy land powder and dust\" Deuteronomy 28:23-24. Amos speaks of the withdrawal of rain as one of God's chastisements (Amos 4:7. See vol. i. p. 28): the distress in the time of Ahab is pictured in the history of the woman of Sarepta 1 Kings 17:9-16, and Ahab's directions to Obadiah 1 Kings Obadiah 18:5. But it is also the symbol of spiritual blessings; both are united by Hosea Hos 6:3 and Joel Joe 2:23. as Joel and Amos also speak of spiritual blessings exclusively under the figure of temporal abundance Joel 3:18; Amos 9:13. In Isaiah it is simply a symbol, \"Drop down, ye heavens, from above, and let the skies pour down righteousness; let the earth open, and let them bring forth salvation, and let righteousness spring up together\" (Isaiah 45:8. See also Isaiah 5:6, both together Isaiah 30:23) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But the threat on disobedience corresponded therewith. \"Take heed to yourselves,\" Moses continues, \"that your heart be not deceived, and ye turn aside and serve other gods - and the Lord's wrath be kindled against you, and He shut up the heaven, that there be no rain, and that the land yield not her fruit, and ye perish quickly from off the good land, which the Lord giveth you\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and, \"Thy heaven, that is over thee, shall be brass, and the earth, that is under thee, shall be iron; the Lord shall make the rain of thy land powder and dust\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:23-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Amos speaks of the withdrawal of rain as one of God's chastisements (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See vol. i. p. 28): the distress in the time of Ahab is pictured in the history of the woman of Sarepta ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 17:9-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Ahab's directions to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Kings ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But it is also the symbol of spiritual blessings; both are united by Hosea Hos 6:3 and Joel Joe 2:23. as Joel and Amos also speak of spiritual blessings exclusively under the figure of temporal abundance ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In Isaiah it is simply a symbol, \"Drop down, ye heavens, from above, and let the skies pour down righteousness; let the earth open, and let them bring forth salvation, and let righteousness spring up together\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", both together ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. no rain—including every calamity which usually follows in the East from want of rain, namely, scarcity of provisions, famine, pestilence, &c. Rain is the symbol also of God's favor (Ho 6:3). That there shall be unconverted men under the millennium appears from the outbreak of Gog and Magog at the end of it (Re 20:7-9); but they, like Satan their master, shall be restrained during the thousand years. Note, too, from this verse that the Gentiles shall come up to Jerusalem, rather than the Jews go as missionaries to the Gentiles (Isa 2:2; Mic 5:7). However, Isa 66:19 may imply the converse.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whoso will not come up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " if there be any more remiss than they ought herein, and neglect to worship the Lord, even upon them shall be no rain; they shall be punished with want of rain, and with want of the blessings which plentiful and seasonable rain produceth, their land shall be barren. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it shall be, that whosoever will not come up,.... This, though it follows upon the former account, must be understood of times preceding the spiritual reign of Christ; for the rain of the Gospel will be upon all the earth in the latter day glory; and all nations will then serve and worship the King, the Lord of hosts, even those that remain after the general destruction of the antichristian states; besides, express mention is hereafter made of Egypt, which designs Rome, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the whole manifestly refers to the time of the witnesses prophesying in sackcloth, who had power to shut the heaven, that it rain not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of all the families of the earth unto Jerusalem, to worship the King, the Lord of hosts: all of the antichristian party, that refuse to worship the Lord with his true church, according to his revealed will: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "even upon them shall be no rain; not literally, but spiritually; and is to be understood either of the love and favour of God, comparable to rain in its original, it being owing to the will of God, and not to the merits of men, and therefore is distinguishing and sovereign; in its objects, persons very undeserving; in the manner of its communication, it tarries not for the will and works of men, and comes in great abundance; and in its effects, it softens, cools, refreshes, and makes fruitful; and not to have this is to be hated of God: or of the blessings of divine grace; these are from above like rain, depend on the will of God, are free gifts, and given in abundance, and make fruitful; the contrary to these is cursing: or of the Gospel, which is of God and from heaven, falls according to divine direction, and softens, refreshes, and revives; and not to have this is the sorest of judgments, Amos 8:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "even upon them shall be no rain; not literally, but spiritually; and is to be understood either of the love and favour of God, comparable to rain in its original, it being owing to the will of God, and not to the merits of men, and therefore is distinguishing and sovereign; in its objects, persons very undeserving; in the manner of its communication, it tarries not for the will and works of men, and comes in great abundance; and in its effects, it softens, cools, refreshes, and makes fruitful; and not to have this is to be hated of God: or of the blessings of divine grace; these are from above like rain, depend on the will of God, are free gifts, and given in abundance, and make fruitful; the contrary to these is cursing: or of the Gospel, which is of God and from heaven, falls according to divine direction, and softens, refreshes, and revives; and not to have this is the sorest of judgments, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it shall be, that whoso will not come up of all the families of the earth unto Jerusalem to worship the King, the LORD of hosts, even upon them shall be no rain.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will not come up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goeth not up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R. V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no rain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Comp. 1 Kings 17; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 4:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 4:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “Pluviæ defectus omnem fere quæ inde oriri in illis terris solet comprehendit calamitatem, annonæ caritatem, seditiones, pestem.” Rosenm.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will not come up;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "goeth not up.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Those who neglected this yearly worship shall be punished according to the threat in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 11:16, 17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "No rain.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The failure of periodic rain in Eastern countries meant drought, famine, and widespread distress. In a spiritual sense, rain represents the grace and blessing of God; these are withholden from those who refuse to worship him and wilfully cut themselves off from the Church. The LXX. has, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Καὶ οῦτοι ἐκείνοις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "προστεθήσονται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"These shall be associated with those,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall be reckoned among those enemies whose punishment has been mentioned above. Zechariah 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Conversion of the heathen. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And it will come to pass, that every remnant of all the nations which came against Jerusalem will go up year by year to worship the King Jehovah of hosts, and to keep the feast of tabernacles. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it will come to pass, that whoever of the families of the earth does not go up to Jerusalem to worship the King Jehovah of hosts, upon them there will be no rain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And if the family of Egypt go not up, and come not, then also not upon them; there will be (upon them) the plague with which Jehovah will plague all nations which do not go up to keep the feast of tabernacles. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This will be the sin of Egypt, and the sin of all the nations, which do not go up to keep the feast of tabernacles.\" The heathen will not be all destroyed by the judgment; but a portion of them will be converted. This portion is called \"the whole remnant of those who marched against Jerusalem\" (בּוא על as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It will turn to the worship of the Lord. The construction in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is anacolouthic: כּל־הנּותר, with its further definition, is placed at the head absolutely, whilst the predicate is attached in the form of an apodosis with ועלוּ. The entrance of the heathen into the kingdom of God is depicted under the figure of the festal journeys to the sanctuary of Jehovah, which had to be repeated year by year. Of the feasts which they will keep there every year (on מדּי, see Delitzsch on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 66:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the feast of tabernacles is mentioned, not because it occurred in the autumn, and the autumn was the best time for travelling (Theod. Mops., Theodoret, Grot., Ros.), or because it was the greatest feast of rejoicing kept by the Jews, or for any other outward reason, but simply on account of its internal significance, which we must not seek for, however, as Koehler does, in its agrarian importance as a feast of thanksgiving for the termination of the harvest, and of the gathering in of the fruit; but rather in its historical allusion as a feast of thanksgiving for the gracious protection of Israel in its wanderings through the desert, and its introduction into the promised land with its abundance of glorious blessings, whereby it foreshadowed the blessedness to be enjoyed in the kingdom of God (see my bibl. Archologie, i. p. 414ff.). This feast will be kept by the heathen who have come to believe in the living God, to thank the Lord for His grace, that He has brought them out of the wanderings of this life into the blessedness of His kingdom of peace. With this view of the significance of the feast of tabernacles, it is also possible to harmonize the punishment threatened in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for neglecting to keep this feast, - namely, that the rain will not be (come) upon the families of the nations which absent themselves from this feast. For rain is an individualizing expression denoting the blessing of God generally, and is mentioned here with reference to the fact, that without rain the fruits of the land, on the enjoyment of which our happiness depends, will not flourish. The meaning of the threat is, therefore, that those families which do not come to worship the Lord, will be punished by Him with the withdrawal of the blessings of His grace. The Egyptians are mentioned again, by way of example, as those upon whom the punishment will fall. So far as the construction of this verse is concerned, ולע באה is added to strengthen תעלה and לא עליהם contains the apodosis to the conditional clause introduced with אם, to which יהיה הגּשׁם is easily supplied from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The positive clause which follows is then appended as an asyndeton: It (the fact that the rain does not come) will be the plague, etc. The prophet mentions Egypt especially, not because of the fact in natural history, that this land owes its fertility not to the rain, but to the overflowing of the Nile, - a notion which has given rise to the most forced interpretations; but as the nation which showed the greatest hostility to Jehovah and His people in the olden time, and for the purpose of showing that this nation was also to attain to a full participation in the blessings of salvation bestowed upon Israel (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 19:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this thought is rounded off by way of conclusion. זאת, this, namely the fact that no rain falls, will be the sin of Egypt, etc. חטּאת, the sin, including its consequences, or in its effects, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 32:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Moreover, we must not infer from the way in which this is carried out in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that at the time of the completion of the kingdom of God there will still be heathen, who will abstain from the worship of the true God; but the thought is simply this: there will then be no more room for heathenism within the sphere of the kingdom of God. To this there is appended the thought, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that everything unholy will then be removed from that kingdom. ",
        "children": []
      }
    ]
  }
]