[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:16-21 As it is impossible for all nations literally to come to Jerusalem once a year, to keep a feast, it is evident that a figurative meaning must here be applied. Gospel worship is represented by the keeping of the feast of tabernacles. Every day of a Christian's life is a day of the feast of tabernacles; every Lord's day especially is the great day of the feast; therefore every day let us worship the Lord of hosts, and keep every Lord's day with peculiar solemnity. It is just for God to withhold the blessings of grace from those who do not attend the means of grace. It is a sin that is its own punishment; those who forsake the duty, forfeit the privilege of communion with God. A time of complete peace and purity of the church will arrive. Men will carry on their common affairs, and their sacred services, upon the same holy principles of faith, love and obedience. Real holiness shall be more diffused, because there shall be a more plentiful pouring forth of the Spirit of holiness than ever before. There shall be holiness even in common things. Every action and every enjoyment of the believer, should be so regulated according to the will of God, that it may be directed to his glory. Our whole lives should be as one constant sacrifice, or act of devotion; no selfish motive should prevail in any of our actions. But how far is the Christian church from this state of purity! Other times, however, are at hand, and the Lord will reform and enlarge his church, as he has promised. Yet in heaven alone will perfect holiness and happiness be found.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And every pot in Jerusalem and in Judah shall be holiness to the Lord - Everything is to be advanced in holiness. All the common utensils everywhere in the people of God shall not only be holy, but \"holiness,\" and capable of the same use as the vessels of the temple.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And there shall be no more the Canaanite in the house of the Lord of hosts - The actual Canaanite had long since ceased to be; the Gibeonites, the last remnant of them, had been absorbed among the people of God. But \"all Israel\" were not \"of Israel.\" Isaiah had called its princes and people, \"rulers of Sodom, people of Gomorrah\" Isaiah 1:10. Ezekiel had said, \"Thus saith the Lord God unto Jerusalem; Thy birth and thy nativity is of the land of Canaan; thy father was an Amorite, and thy mother a Hittite\" Ezekiel 16:3. Hosea used at least the term of two-fold meaning, \"Canaan, in whose hands are the balances of deceit\" Hosea 12:7; and Zephaniah, \"All the people of Canaan are destroyed\" Zephaniah 1:11. After the time of the Canon, Daniel is introduced saying, \"O thou seed of Canaan and not of Judah\" . Ezekiel had spoken of ungodly priests, not only as uncircumcised in heart (according to the language of Deuteronomy Deu 10:16; Deuteronomy 30:6), but uncircumcised in flesh also, altogether alien from the people of God Ezekiel 44:7. The prophet then speaks, as Isaiah, \"It shall be called the way of holiness; the unclean shall not pass over it\" Isaiah 35:8, and Joel, \"then shall Jerusalem be holy, and there shall no strangers pass through her any more\" Joel 3:17 This shall have its full fulfillment in the time of the end. \"There shall in no wise enter into it anything that defileth, neither\" whatsoever \"worketh abomination or a lie;\" and, \"without\" are \"dogs and sorcerers and whoremongers and murderers and idolaters, and whatsoever loveth and maketh a lie\" Revelation 21:27; Revelation 22:15.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And there shall be no more the Canaanite in the house of the Lord of hosts - The actual Canaanite had long since ceased to be; the Gibeonites, the last remnant of them, had been absorbed among the people of God. But \"all Israel\" were not \"of Israel.\" Isaiah had called its princes and people, \"rulers of Sodom, people of Gomorrah\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Ezekiel had said, \"Thus saith the Lord God unto Jerusalem; Thy birth and thy nativity is of the land of Canaan; thy father was an Amorite, and thy mother a Hittite\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hosea used at least the term of two-fold meaning, \"Canaan, in whose hands are the balances of deceit\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Zephaniah, \"All the people of Canaan are destroyed\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". After the time of the Canon, Daniel is introduced saying, \"O thou seed of Canaan and not of Judah\" . Ezekiel had spoken of ungodly priests, not only as uncircumcised in heart (according to the language of Deuteronomy Deu 10:16; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but uncircumcised in flesh also, altogether alien from the people of God ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 44:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The prophet then speaks, as Isaiah, \"It shall be called the way of holiness; the unclean shall not pass over it\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Joel, \"then shall Jerusalem be holy, and there shall no strangers pass through her any more\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " This shall have its full fulfillment in the time of the end. \"There shall in no wise enter into it anything that defileth, neither\" whatsoever \"worketh abomination or a lie;\" and, \"without\" are \"dogs and sorcerers and whoremongers and murderers and idolaters, and whatsoever loveth and maketh a lie\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Cyril: \"Although born of the blood of Israel, those of old eagerly imitated the alien Canaanites. But after that the Only-Begotten Word of God came among us, and, having justified by faith sealed with the Holy Spirit, those who came to His grace, our mind hath been steadfast, unshaken, fixed in piety. Nor will anyone persuade those who are sanctified, to honor any other god save Him who is, by nature and in truth, God, whom we have known in Christ. For in Himself He hath shown us the Father, saying, \"He that hath seen Me hash seen the Father\" John 14:9. Wherefore \"in that\" day, that is, at that time, he says, \"there shall be no Canaanite,\" that is, alien and idolater, \"in the house of the Lord Almighty?\" Theodoret: \"But may the Almighty God bring the saying true at this time also, that no Canaanite should be seen among us, but that all should live according to the Gospellaws. and await that blessed hope and the appearance of our great God and Saviour Jesus Christ, with whom be glory to the Father with the Holy Spirit, now and ever and to endless ages. Amen.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Cyril: \"Although born of the blood of Israel, those of old eagerly imitated the alien Canaanites. But after that the Only-Begotten Word of God came among us, and, having justified by faith sealed with the Holy Spirit, those who came to His grace, our mind hath been steadfast, unshaken, fixed in piety. Nor will anyone persuade those who are sanctified, to honor any other god save Him who is, by nature and in truth, God, whom we have known in Christ. For in Himself He hath shown us the Father, saying, \"He that hath seen Me hash seen the Father\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 14:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Wherefore \"in that\" day, that is, at that time, he says, \"there shall be no Canaanite,\" that is, alien and idolater, \"in the house of the Lord Almighty?\" Theodoret: \"But may the Almighty God bring the saying true at this time also, that no Canaanite should be seen among us, but that all should live according to the Gospellaws. and await that blessed hope and the appearance of our great God and Saviour Jesus Christ, with whom be glory to the Father with the Holy Spirit, now and ever and to endless ages. Amen.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21. every pot—even in private houses, as in the temple, shall be deemed holy, so universal shall be the consecration of all things and persons to Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "take of them—as readily as they would take of the pots of the temple itself, whatever number they wanted for sacrifice.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "no … Canaanite—no unclean or ungodly person (Isa 35:8; 52:1; Joe 3:17). Compare as to the final state subsequent to the millennium, Re 21:27; 22:15. Maurer not so well translates \"merchant\" here, as in Pr 31:24. If a man would have the beginnings of heaven, it must be by absolute consecration of everything to God on earth. Let his life be a liturgy, a holy service of acted worship [Moore].   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Every pot; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the utensils of private houses shall be so dedicated to God’s service, that without scruple they shall on occasion be used, or might be used, in the worship of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In Jerusalem and in Judah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the types, but the gospel church is the antitype; in the times hereof every family shall be a temple in which God shall be worshipped, and their house-pots in the worship of God shall be in extraordinary cases used without scruples. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Holiness unto the Lord of hosts:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Zechariah 14:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All they that sacrifice:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in allusion to sacrifices, the prophet expresseth all religious affections, practice, and worship, which shall be as pleasing to God as were the sacrifices of his people offered up with Divine warrant and approbation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall come and take of them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " freely, without scruple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and seethe therein; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seethe that part of the sacrifice which pertaineth to the priests and to the offerer to feast on, in their house-pots. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There shall be no more the Canaanite in the house of the Lord of hosts; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " any of the accursed nation, or one who makes merchandise of religion. In a word, by allusion used here, we understand that time will come, when scrupulous adhering to ceremonies shall not be, as formerly it was, deemed so necessary, so material in the worship; but all shall know that the Lord hath greatest pleasure in upright, hearty, and sincere love and holiness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yea, every pot in Jerusalem and in Judah shall be holiness unto the Lord of hosts,.... Such will be the number of sacrifices and sacrificers, that the pots in the Lord's house will not be sufficient; wherefore every pot, in city or country, shall be sanctified and devoted to holy uses: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all they that sacrifice shall come and take of them, and seethe therein; this denotes, as before, the general holiness of the professors of religion in those times; and that there will be no difference in the vessels of the Lord's house, or any distinction of Jew and Gentile; but they will be all spiritual worshippers, and offer up the spiritual sacrifices of prayer and praise to the Lord: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in that day there shall be no more the Canaanite in the house of the Lord of hosts; the Targum paraphrases it, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"there shall be no more a merchant in the house of the sanctuary of the Lord;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in the temple, where were buyers and sellers of sheep, oxen, and doves, for sacrifice, such as our Lord drove out; but now there shall be no more of them, all legal sacrifices being at an end. The word here used does signify a merchant, and is so rendered in Hosea 12:7 and by some here (m); and the Jews (n) have a saying, that ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in the temple, where were buyers and sellers of sheep, oxen, and doves, for sacrifice, such as our Lord drove out; but now there shall be no more of them, all legal sacrifices being at an end. The word here used does signify a merchant, and is so rendered in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and by some here (m); and the Jews (n) have a saying, that ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"there are no Canaanites but merchants;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or the word always so signifies, referring to the above places, and having quoted Job 41:6 but it is to be applied to another sort of merchants; to false teachers, that make merchandise of the souls of men; to all merit mongers and Papists; and particularly to the great merchant of all, the pope of Rome, and to all inferior merchants under him, who sell pardons, indulgences, &c. and are called the merchants of the earth, Revelation 18:3 these are the Heathen that shall perish out of the land, and the sinners that shall be no more; antichrist shall no longer sit in the temple of God, showing himself to be God; nor will there be any, in the spiritual reign of Christ, that will buy Rome's merchandise any more. Moreover, a Canaanite may design an impure person, a hypocrite; and though there have been many such in the church of God in all ages, yet at this time there will be few or none, comparatively speaking; and in the personal reign of Christ there will be no wicked men at all: in the new heavens and new earth will dwell righteousness, or only righteous persons; all the wicked of the earth will be destroyed before this state takes place; only raised ones, the saints that partake of the first resurrection, will be there; they will be all holy and righteous persons; nothing shall enter into it that defiles or makes an abomination or a lie, only those that do the commandments of God; nor will there be any manner of sin or wickedness there: sin, like the Canaanites of old, continues in the saints as long as they are in the present state; and though it has not the dominion over them, yet is as grievous pricks and thorns unto them, and is left in them to prove them; but in this happy state there will be no more sin, no more this pricking brier and grieving thorn. That the word Canaanite is here to be taken in a figurative sense is certain; for, literally understood, there is no such person in the world now, nor has been for many hundreds of years, even an inhabitant of Canaan, or one so called. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or the word always so signifies, referring to the above places, and having quoted ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 41:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but it is to be applied to another sort of merchants; to false teachers, that make merchandise of the souls of men; to all merit mongers and Papists; and particularly to the great merchant of all, the pope of Rome, and to all inferior merchants under him, who sell pardons, indulgences, &c. and are called the merchants of the earth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " these are the Heathen that shall perish out of the land, and the sinners that shall be no more; antichrist shall no longer sit in the temple of God, showing himself to be God; nor will there be any, in the spiritual reign of Christ, that will buy Rome's merchandise any more. Moreover, a Canaanite may design an impure person, a hypocrite; and though there have been many such in the church of God in all ages, yet at this time there will be few or none, comparatively speaking; and in the personal reign of Christ there will be no wicked men at all: in the new heavens and new earth will dwell righteousness, or only righteous persons; all the wicked of the earth will be destroyed before this state takes place; only raised ones, the saints that partake of the first resurrection, will be there; they will be all holy and righteous persons; nothing shall enter into it that defiles or makes an abomination or a lie, only those that do the commandments of God; nor will there be any manner of sin or wickedness there: sin, like the Canaanites of old, continues in the saints as long as they are in the present state; and though it has not the dominion over them, yet is as grievous pricks and thorns unto them, and is left in them to prove them; but in this happy state there will be no more sin, no more this pricking brier and grieving thorn. That the word Canaanite is here to be taken in a figurative sense is certain; for, literally understood, there is no such person in the world now, nor has been for many hundreds of years, even an inhabitant of Canaan, or one so called. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) \"mercator\", V. L. Montanus, Vatablus, Grotius, Burkius. (n) T. Bab. Bava Bathra, fol. 75. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) \"mercator\", V. L. Montanus, Vatablus, Grotius, Burkius. (n) T. Bab. Bava Bathra, fol. 75. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Yea, every pot in Jerusalem and in Judah shall be holiness to the LORD of hosts: and all they that sacrifice shall come and take of them, and boil in them: and in that day there shall be no more the {t} Canaanite in the house of the LORD of hosts.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yea, every pot in Jerusalem and in Judah shall be holiness to the LORD of hosts: and all they that sacrifice shall come and take of them, and boil in them: and in that day there shall be no more the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{t}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Canaanite in the house of the LORD of hosts.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) But all will be pure and clean, and there will neither by hypocrites, nor any that will corrupt the true service of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "take of them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] All distinction between sacred and secular shall be at an end, because all shall now be alike holy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Canaanite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a Canaanite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R. V. Some would render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the merchant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a meaning which the word bears in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 41:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb., 40:30]; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 31:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and understand the prediction to be, that as any and every vessel that came to hand would serve his purpose, the sacrificer would no longer need to buy a special vessel, and therefore the traffickers in such wares (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") would cease to frequent the Temple courts. The whole scope of the passage, however, is in favour of the view that “the Canaanite” here means any unclean person, whether heathen who had not accepted the religion and consecrated himself to the service of Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 13:4-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:28-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or Jew who in heart and life was no better than a heathen (comp. “O thou seed of Chanaan and not of Juda,” Story of Susanna, ver. 56). The true scope of the prophecy is that city of which it is written, “There shall in no wise enter into it any thing that defileth, neither whatsoever worketh abomination or maketh a lie: but they which are written in the Lamb’s book of life,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἸΔΟΥ ΚΑΙΝΑ ΠΑΝΤΑ ΠΟΙΩ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The last announcement is amplified. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Every pot.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " All the vessels of the country shall be consecrated and used in Divine service. The Levitical distinction shall be abolished, and the Lord's service shall be perfect freedom. Every member of the Church, however humble his station or mean his acquirements, shall be a saint and fit for the Lord's use (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Canaanite;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mercator",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Vulgate). The word is used in the sense of \"trafficker,\" or \"merchant,\" in Job 40:30 (Job 41:6, Authorized Version); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 31:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If any vessel might now be used in God's service, worshippers would no longer be obliged to buy special bowls from those who sold in the temple courts (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But it is best in agreement with the context to take \"Canaanite\" to mean any unclean or profane person (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Thus Daniel, in the History of Susanna, ver. 56, addresses the wicked elder, \"Thou seed of Chanaan, and not of Jude;\" and Isaiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") calls the chiefs of Israel \"rulers of Sodom,\" and \"people of Gomorrah.\" Henceforward the \"people shall be all righteous\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There shall be one, holy, Catholic Church. Thus the vision of the golden candlestick (ch. 4.) is fulfilled; and that this should come to pass is the design of God's manifold providences and operations (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Zechariah 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"In that day there will stand upon the bells of the horses, Holy to Jehovah; and the pots in the house of Jehovah will be like the sacrificial bowls before the altar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And every pot in Jerusalem and Judah will be holy to Jehovah of hosts, and all who sacrifice will come and take of them, and boil therein; and there will be no Canaanite any more in the house of Jehovah of hosts in that day.\" The meaning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not exhausted by the explanation given by Michaelis, Ewald, and others, that even the horses will then be consecrated to the Lord. The words קדשׁ ליהוה were engraven upon the gold plate on the tiara of the high priest, in the characters used in engravings upon a seal (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If, then, these words are (i.e., are to stand) upon the bells of the horses, the meaning is, that the bells of the horses will resemble the head-dress of the high priest in holiness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It follows from this passage, that it was an Israelitish custom to hang bells upon the horses and mules as ornaments, and probably also for other purposes, as with us. This custom was a very common one in antiquity (see the proofs which have been so diligently collected in Dougtaei Analecta sacr. p. 296ff.).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This does not merely express the fact that the whole of the ceremonial law will be abolished, but also that the distinction between holy and profane will cease, inasmuch as even the most outward things, and things having no connection whatever with worship, will be as holy as those objects formerly were, which were dedicated to the service of Jehovah by a special consecration. In Zechariah 14:20 and Zechariah 14:21, the graduated distinction between the things which were more or less holy is brought prominently out. The pots in the sanctuary, which were used for boiling the sacrificial flesh, were regarded as much less holy than the sacrificial bowls in which the blood of the sacrificial animals was received, and out of which it was sprinkled or poured upon the altar. In the future these pots will be just as holy as the sacrificial bowls; and indeed not merely the boiling pots in the temple, but all the boiling pots in Jerusalem and Judah, which have hitherto been only clean and not holy, so that men will use them at pleasure for boiling the sacrificial flesh. In this priestly-levitical drapery the thought is expressed, that in the perfected kingdom of God not only will everything without exception be holy, but all will be equally holy. The distinction between holy and profane can only cease, however, when the sin and moral defilement which first evoked this distinction, and made it necessary that the things intended for the service of God should be set apart, and receive a special consecration, have been entirely removed and wiped away. To remove this distinction, to prepare the way for the cleansing away of sin, and to sanctify once more that which sin had desecrated, was the object of the sacred institutions appointed by God. To this end Israel was separated from the nations of the earth; and in order to train it up as a holy nation, and to secure the object described, a law was given to it, in which the distinction between holy and profane ran through all the relations of life. And this goal will be eventually reached by the people of God; and sin with all its consequences be cleansed away by the judgment. In the perfected kingdom of God there will be no more sinners, but only such as are righteous and holy. This is affirmed in the last clause: there will be no Canaanite any more in the house of Jehovah. The Canaanites are mentioned here, not as merchants, as in Zephaniah 1:11; Hosea 12:8 (as Jonathan, Aquila, and others suppose), but as a people laden with sin, and under the curse (Genesis 9:25; Leviticus 18:24.; Deuteronomy 7:2; Deuteronomy 9:4, etc.), which has been exterminated by the judgment. In this sense, as the expression לא עוד implies, the term Canaanite is used to denote the godless members of the covenant nation, who came to the temple with sacrifices, in outward self-righteousness. As עוד presupposes that there were Canaanites in the temple of Jehovah in the time of the prophet, the reference cannot be to actual Canaanites, because they were prohibited by the law from entering the temple, but only to Israelites, who were Canaanites in heart. Compare Isaiah 1:10, where the princes of Judah are called princes of Sodom (Ezekiel 16:3; Ezekiel 44:9). The \"house of Jehovah\" is the temple, as in the preceding verse, and not the church of Jehovah, as in Zechariah 9:8, although at the time of the completion of the kingdom of God the distinction between Jerusalem and the temple will have ceased, and the whole of the holy city, yea, the whole of the kingdom of God, will be transformed by the Lord into a holy of holies (see Revelation 21:22, Revelation 21:27).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This does not merely express the fact that the whole of the ceremonial law will be abolished, but also that the distinction between holy and profane will cease, inasmuch as even the most outward things, and things having no connection whatever with worship, will be as holy as those objects formerly were, which were dedicated to the service of Jehovah by a special consecration. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the graduated distinction between the things which were more or less holy is brought prominently out. The pots in the sanctuary, which were used for boiling the sacrificial flesh, were regarded as much less holy than the sacrificial bowls in which the blood of the sacrificial animals was received, and out of which it was sprinkled or poured upon the altar. In the future these pots will be just as holy as the sacrificial bowls; and indeed not merely the boiling pots in the temple, but all the boiling pots in Jerusalem and Judah, which have hitherto been only clean and not holy, so that men will use them at pleasure for boiling the sacrificial flesh. In this priestly-levitical drapery the thought is expressed, that in the perfected kingdom of God not only will everything without exception be holy, but all will be equally holy. The distinction between holy and profane can only cease, however, when the sin and moral defilement which first evoked this distinction, and made it necessary that the things intended for the service of God should be set apart, and receive a special consecration, have been entirely removed and wiped away. To remove this distinction, to prepare the way for the cleansing away of sin, and to sanctify once more that which sin had desecrated, was the object of the sacred institutions appointed by God. To this end Israel was separated from the nations of the earth; and in order to train it up as a holy nation, and to secure the object described, a law was given to it, in which the distinction between holy and profane ran through all the relations of life. And this goal will be eventually reached by the people of God; and sin with all its consequences be cleansed away by the judgment. In the perfected kingdom of God there will be no more sinners, but only such as are righteous and holy. This is affirmed in the last clause: there will be no Canaanite any more in the house of Jehovah. The Canaanites are mentioned here, not as merchants, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (as Jonathan, Aquila, and others suppose), but as a people laden with sin, and under the curse (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 18:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 7:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.), which has been exterminated by the judgment. In this sense, as the expression לא עוד implies, the term Canaanite is used to denote the godless members of the covenant nation, who came to the temple with sacrifices, in outward self-righteousness. As עוד presupposes that there were Canaanites in the temple of Jehovah in the time of the prophet, the reference cannot be to actual Canaanites, because they were prohibited by the law from entering the temple, but only to Israelites, who were Canaanites in heart. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the princes of Judah are called princes of Sodom (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 44:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The \"house of Jehovah\" is the temple, as in the preceding verse, and not the church of Jehovah, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 9:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", although at the time of the completion of the kingdom of God the distinction between Jerusalem and the temple will have ceased, and the whole of the holy city, yea, the whole of the kingdom of God, will be transformed by the Lord into a holy of holies (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus does our prophecy close with a prospect of the completion of the kingdom of God in glory. All believing commentators are agreed that the final fulfilment of Zechariah 14:20 and Zechariah 14:21 lies before us in Revelation 21:27 and Revelation 22:15, and that even Zechariah 12:1-14 neither refers to the Chaldaean catastrophe nor to the Maccabaean wars, but to the Messianic times, however they may differ from one another in relation to the historical events which the prophecy foretels. Hofmann and Koehler, as well as Ebrard and Kliefoth, start with the assumption, that the prophecy in ch. 12-14 strikes in where the preceding one in ch. 9-11 terminates; that is to say, that it commences with the time when Israel was given up to the power of the fourth empire, on account of its rejection of the good shepherd, who appeared in Christ. Now since Hofmann and Koehler understand by Israel only the chosen people of the old covenant, or the Jewish nation, and by Jerusalem the capital of this nation in Palestine, they find this prophecy in Zechariah 12:1-14, that when Jehovah shall eventually bring to pass the punishment of the bad shepherd, i.e., of the imperial power, with its hostility to God, it will assemble together again in its members the nations of the earth, to make war upon the material Jerusalem and Israel, which has returned again from its dispersion in all the world into the possession of the holy land (Palestine), and will besiege the holy city; but it will there be smitten by Jehovah, and lose its power over Israel. At that time will Jehovah also bring the previous hardening of Israel to an end, open its eyes to its sin against the Saviour it has put to death, and effect its conversion. But they differ in opinion as to ch. 14. According to Koehler, this chapter refers to a future which is still in the distance - to a siege and conquest of Jerusalem which are to take place after Israel's conversion, through which the immediate personal appearance of Jehovah will be brought to pass, and all the effects by which that appearance is necessarily accompanied. According to Hofmann (Schriftbeweis, ii. p. 610ff.), Zechariah 14:1. refers to the same occurrence as Zechariah 12:2., with this simple difference, that in Zechariah 12:1-14 the prophet states what that day, in which the whole of the world of nations attacks Jerusalem, will do with the people of God, and in ch. 14 to what extremity it will be brought. Ebrard and Kliefoth, on the other hand, understand by Israel, with its capital Jerusalem, and the house of David (in Zechariah 12:1-13:6), rebellious Judaism after the rejection of the Messiah; and by Judah with its princes, Christendom. Hence the prophecy in this section announces what calamities will happen to Israel according to the flesh - that has become rebellious through rejecting the Messiah - from the first coming of Christ onwards, until its ultimate conversion after the fulness of the Gentiles has come in.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus does our prophecy close with a prospect of the completion of the kingdom of God in glory. All believing commentators are agreed that the final fulfilment of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lies before us in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and that even ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " neither refers to the Chaldaean catastrophe nor to the Maccabaean wars, but to the Messianic times, however they may differ from one another in relation to the historical events which the prophecy foretels. Hofmann and Koehler, as well as Ebrard and Kliefoth, start with the assumption, that the prophecy in ch. 12-14 strikes in where the preceding one in ch. 9-11 terminates; that is to say, that it commences with the time when Israel was given up to the power of the fourth empire, on account of its rejection of the good shepherd, who appeared in Christ. Now since Hofmann and Koehler understand by Israel only the chosen people of the old covenant, or the Jewish nation, and by Jerusalem the capital of this nation in Palestine, they find this prophecy in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that when Jehovah shall eventually bring to pass the punishment of the bad shepherd, i.e., of the imperial power, with its hostility to God, it will assemble together again in its members the nations of the earth, to make war upon the material Jerusalem and Israel, which has returned again from its dispersion in all the world into the possession of the holy land (Palestine), and will besiege the holy city; but it will there be smitten by Jehovah, and lose its power over Israel. At that time will Jehovah also bring the previous hardening of Israel to an end, open its eyes to its sin against the Saviour it has put to death, and effect its conversion. But they differ in opinion as to ch. 14. According to Koehler, this chapter refers to a future which is still in the distance - to a siege and conquest of Jerusalem which are to take place after Israel's conversion, through which the immediate personal appearance of Jehovah will be brought to pass, and all the effects by which that appearance is necessarily accompanied. According to Hofmann (Schriftbeweis, ii. p. 610ff.), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". refers to the same occurrence as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., with this simple difference, that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the prophet states what that day, in which the whole of the world of nations attacks Jerusalem, will do with the people of God, and in ch. 14 to what extremity it will be brought. Ebrard and Kliefoth, on the other hand, understand by Israel, with its capital Jerusalem, and the house of David (in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-13:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), rebellious Judaism after the rejection of the Messiah; and by Judah with its princes, Christendom. Hence the prophecy in this section announces what calamities will happen to Israel according to the flesh - that has become rebellious through rejecting the Messiah - from the first coming of Christ onwards, until its ultimate conversion after the fulness of the Gentiles has come in.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Kliefoth accordingly finds the siege of Jerusalem, predicted in Zechariah 12:2, fulfilled in the siege of that city by Titus. The besieging nations then drank the reeling-cup; for the subjection of Judah was the last act in the victory of the Roman empire over the Macedonian. Rome was then at the summit of its imperial greatness; and from that time forth it became reeling and weak. This weakening was indeed prepared and effected through the Christina church; but it was just the siege of Jerusalem which transferred the centre of the Christian church from Jerusalem to the Roman empire. The fulfilment of Zechariah 12:3 is to be found in the Crusades, the Oriental question, the Haute Finance, and the Emancipation of the Jews. Jerusalem has thus become a burden-stone for all nations, etc.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Kliefoth accordingly finds the siege of Jerusalem, predicted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", fulfilled in the siege of that city by Titus. The besieging nations then drank the reeling-cup; for the subjection of Judah was the last act in the victory of the Roman empire over the Macedonian. Rome was then at the summit of its imperial greatness; and from that time forth it became reeling and weak. This weakening was indeed prepared and effected through the Christina church; but it was just the siege of Jerusalem which transferred the centre of the Christian church from Jerusalem to the Roman empire. The fulfilment of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is to be found in the Crusades, the Oriental question, the Haute Finance, and the Emancipation of the Jews. Jerusalem has thus become a burden-stone for all nations, etc.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The section Zechariah 13:7-9 (the smiting of the shepherd) does not refer to the crucifixion of Christ, because this did not lead to the consequences indicated in Zechariah 13:8, so far as the whole earth was concerned, but to the \"cutting off of the Messiah\" predicted in Daniel 9:26, the great apostasy which forms the beginning of the end, according to Luke 17:25; 2 Thessalonians 2:3; 1 Timothy 4:1, and 1 Timothy 4:2 Time. Zechariah 3:1, and through which Christ in His church is, according to the description in Revelation 13:17, so cut off from historical life, that it cannot be anything on earth. Lastly, ch. 14 treats of the end of the world and the general judgment.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The section ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 13:7-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (the smiting of the shepherd) does not refer to the crucifixion of Christ, because this did not lead to the consequences indicated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 13:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so far as the whole earth was concerned, but to the \"cutting off of the Messiah\" predicted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the great apostasy which forms the beginning of the end, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 17:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Time. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and through which Christ in His church is, according to the description in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so cut off from historical life, that it cannot be anything on earth. Lastly, ch. 14 treats of the end of the world and the general judgment.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Of these two views, we cannot look upon either as well founded. For, in the first place, the assumption common to the two, and with which they set out, is erroneous and untenable, - namely, that the prophecy in ch. 12ff. strikes in where the previous one in ch. 9-11 terminated, and therefore that ch. 12-14 is a direct continuation of ch. 9-11. This assumption is at variance not only with the relation in which the two prophecies stand to one another, as indicated by the correspondence in their headings, and as unfolded in Zechariah 12:1, Zechariah 12:2, but also with the essence of the prophecy, inasmuch as it is not a historical prediction of the future according to its successive development, but simply a spiritual intuition effected by inspiration, in which only the leading features of the form which the kingdom of God would hereafter assume are set forth, and that in figures drawn from the circumstances of the present and the past. Again, the two views can only be carried out by forcing the text. If the prophecy in Zechariah 12:1-14 started with the period when Israel came into power of the Roman empire after the rejection of the Messiah, it could not leap so abruptly to the last days, as Hofmann and Koehler assume, and commence with the description of a victorious conflict on the part of Israel against the nations of the world that were besieging Jerusalem, but would certainly first of all predict, if not the destruction of the Jewish nation by the Romans (which is merely indicated in ch. 11), at all events the gathering together of the Jews, who had been scattered by the Romans over all the world, into Palestine and Jerusalem, before an attack of the nations of the world upon Israel could possibly be spoken of. Moreover, even the difference between Hofmann and Koehler with regard to the relation between Zechariah 12:1-9 and Zechariah 14:1-5 shows that the transference of the whole to the last times cannot be reconciled with the words of these sections. The hypothesis of Koehler, that after the gathering together of Israel out of its dispersion, the nations of the world would make an attack upon Jerusalem in which they would be defeated, and that this conflict would for the first time bring Israel to the recognition of its guilt in putting Christ to death, is at variance with the whole of the prophecy and teaching of both the Old and New Testaments. For, according to these, Israel is not to be gathered together from its dispersion among the nations till it shall return with penitence to Jehovah, whom it has rejected. But Hofmann's statement as to the relation between the two sections is so brief and obscure, that it is more like a concealment than a clearing up of the difficulties which it contains. Lastly, when Hofmann correctly observes, that \"by the Israel of the heading in Zechariah 12:1 we can only understand the people of God, in contradistinction to the world of nations, which is estranged from God,\" this cannot apply to the unbelieving Jews, who have been given into the power of the last empire on account of their rejection of Christ, or Israel according to the flesh, for that Israel is rejected by God. The people of God exists, since the rejection of Christ, only in Christendom, which has been formed out of believing Jews and believing Gentiles, or the church of the New Testament, the stem and kernel of which were that portion of Israel which believingly accepted the Messiah when He appeared, and into whose bosom the believing Gentile peoples were received. Ebrard and Kliefoth are therefore perfectly right in their rejection of the Jewish chiliasm of Hofmann and Koehler; but when they understand by the Israel of the heading belonging to ch. 12-14, which we find in Zechariah 12:1-9, only the unbelieving carnal Israel, and by that in ch. 14 the believing Israel which has been converted to Christ, and also introduce into Zechariah 12:1-9 an antithesis between Israel and Judah, and then understand by Jerusalem and the house of David in Zechariah 12:1-14 the hardened Jews, and by Judah, Christendom; and, on the other hand, by Jerusalem and Judah in ch. 14 the Christendom formed of believing Jews and believing Gentiles, - we have already shown at Zechariah 12:10 that these distinctions are arbitrarily forced upon the text.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of these two views, we cannot look upon either as well founded. For, in the first place, the assumption common to the two, and with which they set out, is erroneous and untenable, - namely, that the prophecy in ch. 12ff. strikes in where the previous one in ch. 9-11 terminated, and therefore that ch. 12-14 is a direct continuation of ch. 9-11. This assumption is at variance not only with the relation in which the two prophecies stand to one another, as indicated by the correspondence in their headings, and as unfolded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but also with the essence of the prophecy, inasmuch as it is not a historical prediction of the future according to its successive development, but simply a spiritual intuition effected by inspiration, in which only the leading features of the form which the kingdom of God would hereafter assume are set forth, and that in figures drawn from the circumstances of the present and the past. Again, the two views can only be carried out by forcing the text. If the prophecy in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " started with the period when Israel came into power of the Roman empire after the rejection of the Messiah, it could not leap so abruptly to the last days, as Hofmann and Koehler assume, and commence with the description of a victorious conflict on the part of Israel against the nations of the world that were besieging Jerusalem, but would certainly first of all predict, if not the destruction of the Jewish nation by the Romans (which is merely indicated in ch. 11), at all events the gathering together of the Jews, who had been scattered by the Romans over all the world, into Palestine and Jerusalem, before an attack of the nations of the world upon Israel could possibly be spoken of. Moreover, even the difference between Hofmann and Koehler with regard to the relation between ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:1-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shows that the transference of the whole to the last times cannot be reconciled with the words of these sections. The hypothesis of Koehler, that after the gathering together of Israel out of its dispersion, the nations of the world would make an attack upon Jerusalem in which they would be defeated, and that this conflict would for the first time bring Israel to the recognition of its guilt in putting Christ to death, is at variance with the whole of the prophecy and teaching of both the Old and New Testaments. For, according to these, Israel is not to be gathered together from its dispersion among the nations till it shall return with penitence to Jehovah, whom it has rejected. But Hofmann's statement as to the relation between the two sections is so brief and obscure, that it is more like a concealment than a clearing up of the difficulties which it contains. Lastly, when Hofmann correctly observes, that \"by the Israel of the heading in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we can only understand the people of God, in contradistinction to the world of nations, which is estranged from God,\" this cannot apply to the unbelieving Jews, who have been given into the power of the last empire on account of their rejection of Christ, or Israel according to the flesh, for that Israel is rejected by God. The people of God exists, since the rejection of Christ, only in Christendom, which has been formed out of believing Jews and believing Gentiles, or the church of the New Testament, the stem and kernel of which were that portion of Israel which believingly accepted the Messiah when He appeared, and into whose bosom the believing Gentile peoples were received. Ebrard and Kliefoth are therefore perfectly right in their rejection of the Jewish chiliasm of Hofmann and Koehler; but when they understand by the Israel of the heading belonging to ch. 12-14, which we find in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", only the unbelieving carnal Israel, and by that in ch. 14 the believing Israel which has been converted to Christ, and also introduce into ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an antithesis between Israel and Judah, and then understand by Jerusalem and the house of David in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the hardened Jews, and by Judah, Christendom; and, on the other hand, by Jerusalem and Judah in ch. 14 the Christendom formed of believing Jews and believing Gentiles, - we have already shown at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that these distinctions are arbitrarily forced upon the text.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Our prophecy treats in both parts - Zechariah 12:1-13:6 and ch. 13:7-14:21 - of Israel, the people of God, and indeed the people of the new covenant, which has grown out of the Israel that believed in Christ, and believers of the heathen nations incorporated into it, and refers not merely to the church of the new covenant in the last times, when all the old Israel will be liberated by the grace of God from the hardening inflicted upon it, and will be received again into the kingdom of God, and form a central point thereof (Vitringa, C. B. Mich., etc.), but to the whole development of the church of Christ from its first beginning till its completion at the second coming of the Lord, as Hengstenberg has in the main discovered and observed. As the Israel of the heading (Zechariah 12:1) denotes the people of God in contradistinction to the peoples of the world, the inhabitants of Jerusalem with the house of David, and Judah with its princes, as the representatives of Israel, are typical epithets applied to the representatives and members of the new covenant people, viz., the Christian church; and Jerusalem and Judah, as the inheritance of Israel, are types of the seats and territories of Christendom. The development of the new covenant nation, however, in conflict with the heathen world, and through the help of the Lord and His Spirit, until its glorious completion, is predicted in our oracle, not according to its successive historical course, but in such a manner that the first half announces how the church of the Lord victoriously defeats the attacks of the heathen world through the miraculous help of the Lord, and how in consequence of this victory it is increased by the fact that the hardened Israel comes more and more to the acknowledgment of its sin and to belief in the Messiah, whom it has put to death, and is incorporated into the church; whilst the second half, on the other hand, announces how, in consequence of the slaying of the Messiah, there falls upon the covenant nation a judgment through which two-thirds are exterminated, and the remainder is tested and refined by the Lord, so that, although many do indeed fall and perish in the conflicts with the nations of the world, the remnant is preserved, and in the last conflict will be miraculously delivered through the coming of the Lord, who will come with His saints to complete His kingdom in glory by the destruction of the enemies of His kingdom, and by the transformation and renewal of the earth. As the believing penitential look at the pierced One (Zechariah 12:10) will not take place for the first time at the ultimate conversion of Israel at the end of the days, but began on the day of Golgotha, and continues through all the centuries of the Christian church, so did the siege of Jerusalem by all nations (Zechariah 12:1-9), i.e., the attack of the heathen nations upon the church of God, commence even in the days of the apostles (cf. Acts 4:25.), and continues through the whole history of the Christina church to the last great conflict which will immediately precede the return of our Lord to judgment. And again, just as the dispersion of the flock after the slaying of the shepherd commenced at the arrest and death of Christ, and the bringing back of the hand of the Lord upon the small ones at the resurrection of Christ, so have they both been repeated in every age of the Christian church, inasmuch as with every fresh and powerful exaltation of antichristian heathenism above the church of Christ, those who are weak in faith flee and are scattered; but as soon as the Lord shows Himself alive in His church again, they let Him gather them together once more. And this will continue, according to the word of the Lord in Matthew 24:10., till the end of the days, when Satan will go out to deceive the nations in the four quarters of the earth, and to gather together Gog and Magog to battle against the camp of the saints and the holy city; whereupon the Lord from heaven will destroy the enemy, and perfect His kingdom in the heavenly Jerusalem (Rev).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Our prophecy treats in both parts - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-13:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ch. 13:7-14:21 - of Israel, the people of God, and indeed the people of the new covenant, which has grown out of the Israel that believed in Christ, and believers of the heathen nations incorporated into it, and refers not merely to the church of the new covenant in the last times, when all the old Israel will be liberated by the grace of God from the hardening inflicted upon it, and will be received again into the kingdom of God, and form a central point thereof (Vitringa, C. B. Mich., etc.), but to the whole development of the church of Christ from its first beginning till its completion at the second coming of the Lord, as Hengstenberg has in the main discovered and observed. As the Israel of the heading (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") denotes the people of God in contradistinction to the peoples of the world, the inhabitants of Jerusalem with the house of David, and Judah with its princes, as the representatives of Israel, are typical epithets applied to the representatives and members of the new covenant people, viz., the Christian church; and Jerusalem and Judah, as the inheritance of Israel, are types of the seats and territories of Christendom. The development of the new covenant nation, however, in conflict with the heathen world, and through the help of the Lord and His Spirit, until its glorious completion, is predicted in our oracle, not according to its successive historical course, but in such a manner that the first half announces how the church of the Lord victoriously defeats the attacks of the heathen world through the miraculous help of the Lord, and how in consequence of this victory it is increased by the fact that the hardened Israel comes more and more to the acknowledgment of its sin and to belief in the Messiah, whom it has put to death, and is incorporated into the church; whilst the second half, on the other hand, announces how, in consequence of the slaying of the Messiah, there falls upon the covenant nation a judgment through which two-thirds are exterminated, and the remainder is tested and refined by the Lord, so that, although many do indeed fall and perish in the conflicts with the nations of the world, the remnant is preserved, and in the last conflict will be miraculously delivered through the coming of the Lord, who will come with His saints to complete His kingdom in glory by the destruction of the enemies of His kingdom, and by the transformation and renewal of the earth. As the believing penitential look at the pierced One (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") will not take place for the first time at the ultimate conversion of Israel at the end of the days, but began on the day of Golgotha, and continues through all the centuries of the Christian church, so did the siege of Jerusalem by all nations (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., the attack of the heathen nations upon the church of God, commence even in the days of the apostles (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 4:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), and continues through the whole history of the Christina church to the last great conflict which will immediately precede the return of our Lord to judgment. And again, just as the dispersion of the flock after the slaying of the shepherd commenced at the arrest and death of Christ, and the bringing back of the hand of the Lord upon the small ones at the resurrection of Christ, so have they both been repeated in every age of the Christian church, inasmuch as with every fresh and powerful exaltation of antichristian heathenism above the church of Christ, those who are weak in faith flee and are scattered; but as soon as the Lord shows Himself alive in His church again, they let Him gather them together once more. And this will continue, according to the word of the Lord in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., till the end of the days, when Satan will go out to deceive the nations in the four quarters of the earth, and to gather together Gog and Magog to battle against the camp of the saints and the holy city; whereupon the Lord from heaven will destroy the enemy, and perfect His kingdom in the heavenly Jerusalem (Rev).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "So far as the relation between Zechariah 12:2-9 and Zechariah 14:1-5 is concerned, it is evident from the text of both these passages that they do not treat of two different attacks upon the church of God by the imperial power, occurring at different times; but that, whilst Zechariah 12:1-14 depicts the constantly repeated attack in the light of its successful overthrow, ch. 14 describes the hostile attack according to its partial success and final issue in the destruction of the powers that are hostile to God. This issue takes place, no doubt, only at the end of the course of this world, with the return of Christ to the last judgment; but the fact that Jerusalem is conquered and plundered, and the half of its population led away into captivity, proves indisputably that the siege of Jerusalem predicted in ch. 14 must not be restricted to the last attack of Antichrist upon the church of the Lord, but that all the hostile attacks of the heathen world upon the city of God are embraced in the one picture of a siege of Jerusalem. In the attack made upon Jerusalem by Gog and Magog, the city is not conquered and plundered, either according to Ezekiel 38 and 39, or according to Revelation 20:7-9; but the enemy is destroyed by the immediate interposition of the Lord, without having got possession of the holy city. But to this ideal summary of the conflicts and victories of the nations of the world there is appended directly the picture of the final destruction of the ungodly power of the world, and the glorification of the kingdom of God; so that in Zechariah 14 (from vv. 6-21) there is predicted in Old Testament form the completion of the kingdom of God, which the Apostle John saw and described in Revelation in New Testament mode under the figure of the heavenly Jerusalem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So far as the relation between ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:2-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:1-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is concerned, it is evident from the text of both these passages that they do not treat of two different attacks upon the church of God by the imperial power, occurring at different times; but that, whilst ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " depicts the constantly repeated attack in the light of its successful overthrow, ch. 14 describes the hostile attack according to its partial success and final issue in the destruction of the powers that are hostile to God. This issue takes place, no doubt, only at the end of the course of this world, with the return of Christ to the last judgment; but the fact that Jerusalem is conquered and plundered, and the half of its population led away into captivity, proves indisputably that the siege of Jerusalem predicted in ch. 14 must not be restricted to the last attack of Antichrist upon the church of the Lord, but that all the hostile attacks of the heathen world upon the city of God are embraced in the one picture of a siege of Jerusalem. In the attack made upon Jerusalem by Gog and Magog, the city is not conquered and plundered, either according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and 39, or according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:7-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but the enemy is destroyed by the immediate interposition of the Lord, without having got possession of the holy city. But to this ideal summary of the conflicts and victories of the nations of the world there is appended directly the picture of the final destruction of the ungodly power of the world, and the glorification of the kingdom of God; so that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (from vv. 6-21) there is predicted in Old Testament form the completion of the kingdom of God, which the Apostle John saw and described in Revelation in New Testament mode under the figure of the heavenly Jerusalem. ",
            "children": []
          }
        ]
      }
    ]
  }
]