[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Binding his foal . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Having declared the spiritual prerogative of Judah, the patriarch now foretells that his land would be so rich in vineyards that the traveller would tie his ass to the vine, as the tree abundant everywhere.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Choice vine is, literally, the vine of Sorek, a kind much valued, as bearing a purple berry, small but luscious, and destitute of stones. The abundance of grapes is next hyperbolically described as so great that their juice would be used like water for the commonest purposes.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Choice vine",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is, literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the vine of Sorek, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "a kind much valued, as bearing a purple berry, small but luscious, and destitute of stones. The abundance of grapes is next hyperbolically described as so great that their juice would be used like water for the commonest purposes.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Blood of grapes especially refers to the juice of the red kinds, which were more valued in the East than white.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Blood of grapes",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " especially refers to the juice of the red kinds, which were more valued in the East than white.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 49:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Binding his foal unto the vine — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is here foretold that the tribe of Judah should inhabit a fruitful land, and especially that it should abound with milk and wine: that vines should be so common and so strong that they should tie their asses to them, and so fruitful that they should load their asses from them, wine being as plentiful as water, so that the men of that tribe should be very healthful and lively, their eyes brisk and sparkling, and their teeth white. In Christ there is plenty of all that which is nourishing and refreshing to the soul, and which maintains and cheers the divine life in it: in him we may have wine and milk, the riches of Judah’s tribe without money and without price, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49:8-12 Judah's name signifies praise. God was praised for him, chap. 29:35, praised by him, and praised in him; therefore his brethren shall praise him. Judah should be a strong and courageous tribe. Judah is compared, not to a lion raging and ranging, but to a lion enjoying the satisfaction of his power and success, without creating vexation to others; this is to be truly great. Judah should be the royal tribe, the tribe from which Messiah the Prince should come. Shiloh, that promised Seed in whom the earth should be blessed, that peaceable and prosperous One, or Saviour, he shall come of Judah. Thus dying Jacob at a great distance saw Christ's day, and it was his comfort and support on his death-bed. Till Christ's coming, Judah possessed authority, but after his crucifixion this was shortened, and according to what Christ foretold, Jerusalem was destroyed, and all the poor harassed remnant of Jews were confounded together. Much which is here said concerning Judah, is to be applied to our Lord Jesus. In him there is plenty of all which is nourishing and refreshing to the soul, and which maintains and cheers the Divine life in it. He is the true Vine; wine is the appointed symbol of his blood, which is drink indeed, as shed for sinners, and applied in faith; and all the blessings of his gospel are wine and milk, without money and without price, to which every thirsty soul is welcome. Isa 55:1.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The exuberant fertility of Judah's province is now depicted. We now behold him peacefully settled in the land of promise, and the striking objects of rural plenty and prosperity around him. The quiet ass on which he perambulates is tied to the vine, the juice of whose grapes is as copious as the water in which his robes are washed. The last sentence is capable of being rendered, \"Red are his eyes above wine, and white his teeth above milk.\" But a connection as well as a comparison seems to be implied in the original. Judea is justly described as abounding in the best of wine and milk. This fine picture of Judah's earthly abode is a fitting emblem of the better country where Shiloh reigns.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. until Shiloh come—Shiloh—this obscure word is variously interpreted to mean \"the sent\" (Joh 17:3), \"the seed\" (Isa 11:1), the \"peaceable or prosperous one\" (Eph 2:14)—that is, the Messiah (Isa 11:10; Ro 15:12); and when He should come, \"the tribe of Judah should no longer boast either an independent king or a judge of their own\" [Calvin]. The Jews have been for eighteen centuries without a ruler and without a judge since Shiloh came, and \"to Him the gathering of the people has been.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He signifies the plenty of vines in Judah’s portion, that they shall be planted every where, even in the commons and highways where men travel, and where upon occasion they use to tie the beasts on which they ride to any tree which is near them. Such shall be the plenty of it, that if it were convenient, men might use wine instead of water to wash their garments. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The blood of grapes; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so the wine is called also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 32:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 32:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " /APC 1Ma 6:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and by Pliny, Hesiod, and others. As oil is called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blood of the olive.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Binding his foal unto the vine, and his ass's colt unto the choice vine,.... Which may be understood either of the tribe of Judah, and signify that vines should grow in such plenty, and so large and strong, that a man might fasten his ass to one of them, and if it ate and destroyed it, it would give no great concern, since the country abounded with them; or they would be so full of clusters that a man might load an ass from one of them. Some parts of the tribe of Judah were famous for vines, especially Engedi; hence we read of the vineyards of Engedi, Sol 1:14 or else of Shiloh the Messiah, which some interpret literally of him, when the prophecy in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was fulfilled, as is recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but others better, figuratively, of Christ's causing the Gentiles, comparable to an ass's colt, for their impurity, ignorance of, and sluggishness in spiritual things, to cleave to him the true vine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the exercise of faith, hope, and love, or to join themselves to his church and people, sometimes compared to a vine or vineyard, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he washed his garments in wine, and his clothes in the blood of grapes: an hyperbolical expression, setting forth the great abundance of wine in this tribe, of which there was such plenty, that if they would, they might have used it instead of water to wash their clothes in, but not that they did do so, only might if they would; and may denote the great quantity of spiritual blessings flowing from the love of God, which come by Christ; and of his word and ordinances, which are comparable to wine and milk, and are a feast of fat things, of wine on the lees, well refined, Isaiah 26:6 and may be applied to Christ, to the garment of his human nature, which, through his sufferings and death, was like a vesture dipped in blood, and he became red in his apparel, Isaiah 63:1 or to his church and people, which cleave to him as a garment, and whose garments are washed and made white in the blood of the Lamb, Revelation 1:5 these words are interpreted of the Messiah in the Targums of Jonathan and Jerusalem, and are applied to him and his times in the Talmud (y), and in other Jewish writings (z): so wine is called the blood of the grape by the son of Sirach in the Apocrypha:\"The principal things for the whole use of man's life are water, fire, iron, and salt, flour of wheat, honey, milk, and the blood of the grape, and oil, and clothing.'' (Sirach 39:26)\"He stretched out his hand to the cup, and poured of the blood of the grape, he poured out at the foot of the altar a sweetsmelling savour unto the most high King of all.'' (Sirach 50:15) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he washed his garments in wine, and his clothes in the blood of grapes: an hyperbolical expression, setting forth the great abundance of wine in this tribe, of which there was such plenty, that if they would, they might have used it instead of water to wash their clothes in, but not that they did do so, only might if they would; and may denote the great quantity of spiritual blessings flowing from the love of God, which come by Christ; and of his word and ordinances, which are comparable to wine and milk, and are a feast of fat things, of wine on the lees, well refined, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and may be applied to Christ, to the garment of his human nature, which, through his sufferings and death, was like a vesture dipped in blood, and he became red in his apparel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 63:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or to his church and people, which cleave to him as a garment, and whose garments are washed and made white in the blood of the Lamb, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " these words are interpreted of the Messiah in the Targums of Jonathan and Jerusalem, and are applied to him and his times in the Talmud (y), and in other Jewish writings (z): so wine is called the blood of the grape by the son of Sirach in the Apocrypha:\"The principal things for the whole use of man's life are water, fire, iron, and salt, flour of wheat, honey, milk, and the blood of the grape, and oil, and clothing.'' (Sirach 39:26)\"He stretched out his hand to the cup, and poured of the blood of the grape, he poured out at the foot of the altar a sweetsmelling savour unto the most high King of all.'' (Sirach 50:15) ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) T. Bab. Berac. fol. 57. 1.((z) Zohar in Gen. fol. 127. 3. & 128. 2, 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) T. Bab. Berac. fol. 57. 1.((z) Zohar in Gen. fol. 127. 3. & 128. 2, 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Binding his foal unto the {k} vine, and his ass's colt unto the choice vine; he washed his garments in wine, and his clothes in the blood of grapes:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Binding his foal unto the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " vine, and his ass's colt unto the choice vine; he washed his garments in wine, and his clothes in the blood of grapes:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) A country most abundant with vines and pastures is promised to him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Binding … vine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Judah is represented as having so fruitful a soil that the vines grew richly by the wayside. The vine stem which would usually be protected from animals is used by Judah for fastening up the animal on which he rides.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The “ass” is the universal beast of burden in the East for all classes. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 16:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "washed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The same hyperbolical description is maintained in this and the following couplet. Grapes in the land of Judah are to be so plentiful that he will wash garments in their juice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 49:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jacob finishes his blessing on Judah by depicting the abundance of his possessions in the promised land. \"Binding his she-ass to the vine, and to the choice vine his ass's colt; he washes his garment in wine, and his cloak in the blood of the grape: dull are the eyes with wine, and white the teeth with milk.\" The participle אסרי has the old connecting vowel, i, before a word with a preposition (like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.); and בּני in the construct state, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The subject is not Shiloh, but Judah, to whom the whole blessing applies. The former would only be possible, if the fathers and Luther were right in regarding the whole as an allegorical description of Christ, or if Hoffmann's opinion were correct, that it would be quite unsuitable to describe Judah, the lion-like warrior and ruler, as binding his ass to a vine, coming so peacefully upon his ass, and remaining in his vineyard. But are lion-like courage and strength irreconcilable with a readiness for peace? Besides, the notion that riding upon an ass is an image of a peaceful disposition seems quite unwarranted; and the supposition that the ass is introduced as an animal of peace, in contrast with the war-horse, is founded upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and applied to the words of the patriarch in a most unhistorical manner. This contrast did not exist till a much later period, when the Israelites and Canaanites had introduced war-horses, and is not applicable at all to the age and circumstances of the patriarchs, since at that time the only animals there were to ride, beside camels, were asses and she-asses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and even in the time of the Judges, and down to David's time, riding upon asses was a distinction of nobility or superior rank (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 12:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 19:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Lastly, even in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Judah is not depicted as a lion eager for prey, or as loving war and engaged in constant strife, but, according to Hoffmann's own words, \"as having attained, even before the coming of Shiloh, to a rest acquired by victory over surrounding foes, and as seated in his place with the insignia of his dominion.\" Now, when Judah's conflicts are over, and he has come to rest, he also may bind his ass to the vine and enjoy in peaceful repose the abundance of his inheritance. Of wine and milk, the most valuable productions of his land, he will have such a superabundance, that, as Jacob hyperbolically expresses it, he may wash his clothes in the blood of the grape, and enjoy them so plentifully, that his eyes shall be inflamed with wine, and his teeth become white with milk.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Jam de situ regionis loquitur, quae sorte filiis Judae obtigit. Significat autem tantam illic fore vitium copiam, ut passim obviae prostent non secus atque alibi vepres vel infrugifera arbusta. Nam quum ad sepes ligari soleant asini, vites ad hunc contemptibilem usum aeputat. Eodem pertinet quae sequuntur hyperbolicae loquendi formae, quod Judas lavabit vestem suam in vino, et oculis eritrubicundus. Tantam enim vini abundantiam fore intelligit, ut promiscue ad lotiones, perinde ut aqua effundi queat sine magno dispendio; assiduo autem largioreque illius potu rubedinem contracturi sint oculi. Calvin.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The soil of Judah produced the best wine in Canaan, near Hebron and Engedi (Numbers 13:23-24; Sol 1:4; 2 Chronicles 26:10 cf. Joel 1:7.), and had excellent pasture land in the desert by Tekoah and Carmel, to the south of Hebron (1 Samuel 25:2; Amos 1:1; 2 Chronicles 26:10). סוּתה: contracted from סווּתה, from סוה to envelope, synonymous with מסוה a veil (Exodus 34:33). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The soil of Judah produced the best wine in Canaan, near Hebron and Engedi (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 13:23-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Sol 1:4; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), and had excellent pasture land in the desert by Tekoah and Carmel, to the south of Hebron (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). סוּתה: contracted from סווּתה, from סוה to envelope, synonymous with מסוה a veil (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]