[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His eyes shall be red with wine.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "red ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "occurs only here, and is rendered in the Versions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bright, sparkling, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and in the Vulg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beautiful. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They also give the word rendered in our Version ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a comparative force, which seems to be right: “His eyes shall be brighter than wine, and his teeth whiter than milk.” The words do not refer to Judah’s person, but describe the prosperity of his descendants, whose temporal welfare will show itself in their bright and healthy countenances.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew Henry's Concise Commentary49:8-12 Judah's name signifies praise. God was praised for him, chap. 29:35, praised by him, and praised in him; therefore his brethren shall praise him. Judah should be a strong and courageous tribe. Judah is compared, not to a lion raging and ranging, but to a lion enjoying the satisfaction of his power and success, without creating vexation to others; this is to be truly great. Judah should be the royal tribe, the tribe from which Messiah the Prince should come. Shiloh, that promised Seed in whom the earth should be blessed, that peaceable and prosperous One, or Saviour, he shall come of Judah. Thus dying Jacob at a great distance saw Christ's day, and it was his comfort and support on his death-bed. Till Christ's coming, Judah possessed authority, but after his crucifixion this was shortened, and according to what Christ foretold, Jerusalem was destroyed, and all the poor harassed remnant of Jews were confounded together. Much which is here said concerning Judah, is to be applied to our Lord Jesus. In him there is plenty of all which is nourishing and refreshing to the soul, and which maintains and cheers the Divine life in it. He is the true Vine; wine is the appointed symbol of his blood, which is drink indeed, as shed for sinners, and applied in faith; and all the blessings of his gospel are wine and milk, without money and without price, to which every thirsty soul is welcome. Isa 55:1.Barnes' Notes on the BibleThe exuberant fertility of Judah's province is now depicted. We now behold him peacefully settled in the land of promise, and the striking objects of rural plenty and prosperity around him. The quiet ass on which he perambulates is tied to the vine, the juice of whose grapes is as copious as the water in which his robes are washed. The last sentence is capable of being rendered, \"Red are his eyes above wine, and white his teeth above milk.\" But a connection as well as a comparison seems to be implied in the original. Judea is justly described as abounding in the best of wine and milk. This fine picture of Judah's earthly abode is a fitting emblem of the better country where Shiloh reigns.Jamieson-Fausset-Brown Bible Commentary10. until Shiloh come—Shiloh—this obscure word is variously interpreted to mean \"the sent\" (Joh 17:3), \"the seed\" (Isa 11:1), the \"peaceable or prosperous one\" (Eph 2:14)—that is, the Messiah (Isa 11:10; Ro 15:12); and when He should come, \"the tribe of Judah should no longer boast either an independent king or a judge of their own\" [Calvin]. The Jews have been for eighteen centuries without a ruler and without a judge since Shiloh came, and \"to Him the gathering of the people has been.\"Matthew Poole's Commentary Which shows not only the plenty of wine, but also the excellency and strength of it, which, though not drunk in great quantity, or to excess, will make the eyes red. See  Proverbs 23:29. Gill's Exposition of the Entire BibleHis eyes shall be red with wine,.... Signifying, not the intemperance of this tribe, and their immoderate use of wine, and the effect of it on them; but the goodness and generosity of their wine, that if drank plentifully of, and especially to excess, would have such an effect, see Proverbs 23:29 and, as applied to the Messiah, the antitype of Judah, and who was of this tribe, it may denote not so much the beauty of his eyes, as the Targums paraphrase it; as the joy and pleasure that sparkled in his eyes when he shed his blood on the cross, enduring that, and despising the shame of it, for the joy of the salvation of his people; or the clearness of his sight in beholding the actions of his enemies, and especially of the fierceness and fury of his wrath against them, whose eyes are said to be an flames of fire, Revelation 1:14. and his teeth white with milk; denoting the fruitfulness of his land, producing fine pastures, on which flocks and herds fed, and gave abundance of milk; and so Onkelos paraphrases the whole verse,\"his mountains shall be red with his vineyards, and his hills shall drop wine, and his valleys shall be white with corn and flocks of sheep;''and much the same are the Targums of Jonathan and Jerusalem: the mystical sense may respect Christ and his people, and be expressive of the purity of his nature, life, and doctrine, and of the holiness of his members, their faith and conversation; or the clauses may be rendered, redder than wine, whiter than milk; but though whiteness recommends teeth, yet not redness the eyes; wherefore some (a) by transposing the first letters of the word for \"red\", make it to signify black, as it does with the Arabs, and that colour of the eye is reckoned beautiful. (a) Danzius apud Stockium, p. 334. Geneva Study BibleHis eyes shall be red with wine, and his teeth white with milk.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "49:8-12 Judah's name signifies praise. God was praised for him, chap. 29:35, praised by him, and praised in him; therefore his brethren shall praise him. Judah should be a strong and courageous tribe. Judah is compared, not to a lion raging and ranging, but to a lion enjoying the satisfaction of his power and success, without creating vexation to others; this is to be truly great. Judah should be the royal tribe, the tribe from which Messiah the Prince should come. Shiloh, that promised Seed in whom the earth should be blessed, that peaceable and prosperous One, or Saviour, he shall come of Judah. Thus dying Jacob at a great distance saw Christ's day, and it was his comfort and support on his death-bed. Till Christ's coming, Judah possessed authority, but after his crucifixion this was shortened, and according to what Christ foretold, Jerusalem was destroyed, and all the poor harassed remnant of Jews were confounded together. Much which is here said concerning Judah, is to be applied to our Lord Jesus. In him there is plenty of all which is nourishing and refreshing to the soul, and which maintains and cheers the Divine life in it. He is the true Vine; wine is the appointed symbol of his blood, which is drink indeed, as shed for sinners, and applied in faith; and all the blessings of his gospel are wine and milk, without money and without price, to which every thirsty soul is welcome. Isa 55:1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The exuberant fertility of Judah's province is now depicted. We now behold him peacefully settled in the land of promise, and the striking objects of rural plenty and prosperity around him. The quiet ass on which he perambulates is tied to the vine, the juice of whose grapes is as copious as the water in which his robes are washed. The last sentence is capable of being rendered, \"Red are his eyes above wine, and white his teeth above milk.\" But a connection as well as a comparison seems to be implied in the original. Judea is justly described as abounding in the best of wine and milk. This fine picture of Judah's earthly abode is a fitting emblem of the better country where Shiloh reigns.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "10. until Shiloh come—Shiloh—this obscure word is variously interpreted to mean \"the sent\" (Joh 17:3), \"the seed\" (Isa 11:1), the \"peaceable or prosperous one\" (Eph 2:14)—that is, the Messiah (Isa 11:10; Ro 15:12); and when He should come, \"the tribe of Judah should no longer boast either an independent king or a judge of their own\" [Calvin]. The Jews have been for eighteen centuries without a ruler and without a judge since Shiloh came, and \"to Him the gathering of the people has been.\"",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Which shows not only the plenty of wine, but also the excellency and strength of it, which, though not drunk in great quantity, or to excess, will make the eyes red. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Proverbs 23:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "His eyes shall be red with wine,.... Signifying, not the intemperance of this tribe, and their immoderate use of wine, and the effect of it on them; but the goodness and generosity of their wine, that if drank plentifully of, and especially to excess, would have such an effect, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and, as applied to the Messiah, the antitype of Judah, and who was of this tribe, it may denote not so much the beauty of his eyes, as the Targums paraphrase it; as the joy and pleasure that sparkled in his eyes when he shed his blood on the cross, enduring that, and despising the shame of it, for the joy of the salvation of his people; or the clearness of his sight in beholding the actions of his enemies, and especially of the fierceness and fury of his wrath against them, whose eyes are said to be an flames of fire, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and his teeth white with milk; denoting the fruitfulness of his land, producing fine pastures, on which flocks and herds fed, and gave abundance of milk; and so Onkelos paraphrases the whole verse,\"his mountains shall be red with his vineyards, and his hills shall drop wine, and his valleys shall be white with corn and flocks of sheep;''and much the same are the Targums of Jonathan and Jerusalem: the mystical sense may respect Christ and his people, and be expressive of the purity of his nature, life, and doctrine, and of the holiness of his members, their faith and conversation; or the clauses may be rendered, redder than wine, whiter than milk; but though whiteness recommends teeth, yet not redness the eyes; wherefore some (a) by transposing the first letters of the word for \"red\", make it to signify black, as it does with the Arabs, and that colour of the eye is reckoned beautiful. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(a) Danzius apud Stockium, p. 334. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "His eyes shall be red with wine, and his teeth white with milk.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His eyes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It may be doubted whether our rendering “red” gives the right meaning. The passage is usually illustrated from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 23:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “who hath redness of eyes?” But, surely, the poet would hardly eulogize Judah by attributing to his eyes the redness of continuous drinking! It will be better to assume that the writer meant “sparkling.” The versions, LXX and Vulg., give another rendering, which is probably to be preferred, “his eyes are more sparkling than wine, and his teeth whiter than milk.” In this case, the verse will symbolically describe the beauty of his personal appearance, rather than the productiveness of his territory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 49:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jacob finishes his blessing on Judah by depicting the abundance of his possessions in the promised land. \"Binding his she-ass to the vine, and to the choice vine his ass's colt; he washes his garment in wine, and his cloak in the blood of the grape: dull are the eyes with wine, and white the teeth with milk.\" The participle אסרי has the old connecting vowel, i, before a word with a preposition (like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.); and בּני in the construct state, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The subject is not Shiloh, but Judah, to whom the whole blessing applies. The former would only be possible, if the fathers and Luther were right in regarding the whole as an allegorical description of Christ, or if Hoffmann's opinion were correct, that it would be quite unsuitable to describe Judah, the lion-like warrior and ruler, as binding his ass to a vine, coming so peacefully upon his ass, and remaining in his vineyard. But are lion-like courage and strength irreconcilable with a readiness for peace? Besides, the notion that riding upon an ass is an image of a peaceful disposition seems quite unwarranted; and the supposition that the ass is introduced as an animal of peace, in contrast with the war-horse, is founded upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and applied to the words of the patriarch in a most unhistorical manner. This contrast did not exist till a much later period, when the Israelites and Canaanites had introduced war-horses, and is not applicable at all to the age and circumstances of the patriarchs, since at that time the only animals there were to ride, beside camels, were asses and she-asses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and even in the time of the Judges, and down to David's time, riding upon asses was a distinction of nobility or superior rank (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 12:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 19:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Lastly, even in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Judah is not depicted as a lion eager for prey, or as loving war and engaged in constant strife, but, according to Hoffmann's own words, \"as having attained, even before the coming of Shiloh, to a rest acquired by victory over surrounding foes, and as seated in his place with the insignia of his dominion.\" Now, when Judah's conflicts are over, and he has come to rest, he also may bind his ass to the vine and enjoy in peaceful repose the abundance of his inheritance. Of wine and milk, the most valuable productions of his land, he will have such a superabundance, that, as Jacob hyperbolically expresses it, he may wash his clothes in the blood of the grape, and enjoy them so plentifully, that his eyes shall be inflamed with wine, and his teeth become white with milk.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Jam de situ regionis loquitur, quae sorte filiis Judae obtigit. Significat autem tantam illic fore vitium copiam, ut passim obviae prostent non secus atque alibi vepres vel infrugifera arbusta. Nam quum ad sepes ligari soleant asini, vites ad hunc contemptibilem usum aeputat. Eodem pertinet quae sequuntur hyperbolicae loquendi formae, quod Judas lavabit vestem suam in vino, et oculis eritrubicundus. Tantam enim vini abundantiam fore intelligit, ut promiscue ad lotiones, perinde ut aqua effundi queat sine magno dispendio; assiduo autem largioreque illius potu rubedinem contracturi sint oculi. Calvin.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The soil of Judah produced the best wine in Canaan, near Hebron and Engedi (Numbers 13:23-24; Sol 1:4; 2 Chronicles 26:10 cf. Joel 1:7.), and had excellent pasture land in the desert by Tekoah and Carmel, to the south of Hebron (1 Samuel 25:2; Amos 1:1; 2 Chronicles 26:10). סוּתה: contracted from סווּתה, from סוה to envelope, synonymous with מסוה a veil (Exodus 34:33). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The soil of Judah produced the best wine in Canaan, near Hebron and Engedi (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 13:23-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Sol 1:4; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), and had excellent pasture land in the desert by Tekoah and Carmel, to the south of Hebron (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). סוּתה: contracted from סווּתה, from סוה to envelope, synonymous with מסוה a veil (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]