[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His bow abode in strength.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The word for strength is highly poetical. It means that which goes on for ever, like the flowing streams or the eternal hills. In spite of all the machinations of his enemies, the bow of Joseph remained constant and enduring in its might.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Were made strong.—The Hebrew word is difficult, but more probably means, were pliant, supple, such as the arms of an archer ought to be.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Were made strong.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Hebrew word is difficult, but more probably means, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "were pliant, supple, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "such as the arms of an archer ought to be.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From thence is the shepherd, the stone of Israel.—The Jewish commentators understand “from thence” of Joseph, who had become the ruler and protector of Israel. But “from thence” answers in the parallelism to from the hands of. Fully it would be, from thence where dwells the Shepherd, &c, that is,—Joseph’s triumph came from God, who is the Shepherd (or Ruler) and the Rock of Israel.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "From thence is the shepherd, the stone of Israel.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Jewish commentators understand “from thence” of Joseph, who had become the ruler and protector of Israel. But “from thence” answers in the parallelism to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "from the hands of. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Fully it would be, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "from thence where dwells the Shepherd, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "&c, that is,—Joseph’s triumph came from God, who is the Shepherd (or Ruler) and the Rock of Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘THE HANDS OF THE MIGHTY GOD OF JACOB’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SHEPHERD, THE STONE OF ISRAELGenesis 49:24",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SHEPHERD, THE STONE OF ISRAEL",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A slight alteration in the rendering will probably bring out the meaning of these words more correctly. The last two clauses should perhaps not be read as a separate sentence. Striking out the supplement ‘is,’ and letting the previous sentence run on to the end of the verse, we get a series of names of God, in apposition with each other, as the sources of the strength promised to the arms of the hands of the warlike sons of Joseph. From the hands of the mighty God of Jacob-from thence, from the Shepherd, the stone of Israel-the power will come for conflict and for conquest. This exuberant heaping together of names of God is the mark of the flash of rapturous confidence which lit up the dying man’s thoughts when they turned to God. When he begins to think of Him he cannot stay his tongue. So many aspects of His character, so many remembrances of His deeds, come crowding into his mind; so familiar and so dear are they, that he must linger over the words, and strive by this triple repetition to express the manifold preciousness of Him whom no name, nor crowd of names, can rightly praise. So earthly love ever does with its earthly objects, inventing and reiterating epithets which are caresses. Such repetitions are not tautologies, for each utters some new aspect of the one subject, and comes from a new gush of heart’s love towards it. And something of the same rapture and unwearied recurrence to the Name that is above every name should mark the communion of devout souls with their heavenly Love. What a wonderful burst of such praise flowed out from David’s thankful heart, in his day of deliverance, like some strong current, with its sevenfold wave, each crested with the Name-’The Lord is my rock, and my fortress, and my deliverer; my God, my strength, in whom I will trust; my buckler, and the horn of my salvation, and my high tower.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Those three names which we find here are striking and beautiful in themselves; in their juxtaposition; in their use on Jacob’s lips. They seem to have been all coined by him, for, if we accept this song as a true prophecy uttered by him, we have here the earliest instance of their occurrence. They all have a history, and appear again expanded and deepened in the subsequent revelation. Let us look at them as they stand.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Mighty God of Jacob",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".-The meaning of such a name is clear enough. It is He who has shown Himself mighty and mine by His deeds for me all through my life. The dying man’s thoughts are busy with all that past from the day when he went forth from the tent of Isaac, and took of the stones of the field for his pillow when the sun went down. A perplexed history it had been, with many a bitter sorrow, and many a yet bitterer sin. Passionate grief and despairing murmurs he had felt and flung out, while it slowly unfolded itself. When the Pharaoh had asked, ‘How old art thou?’ he had answered in words which owe their sombreness partly to obsequious assumption of insignificance in such a presence, but have a strong tinge of genuine sadness in them too: ‘Few and evil have the days of the years of my life been.’ But lying dying there, with it all well behind him, he has become wiser; and now it all looks to him as one long showing forth of the might of his God, who had been with him all his life long, and had redeemed him from all evil. He has got far enough away to see the lie of the land, as he could not do while he was toiling along the road. The barren rocks and white snow glow with purple as the setting sun touches them. The struggles with Laban; the fear of Esau; the weary work of toilsome years; the sad day when Rachel died, and left to him the ‘son of her sorrow’; the heart sickness of the long years of Joseph’s loss-all have faded away, or been changed into thankful wonder at God’s guidance. The one thought which the dying man carries out of life with him is: God has shown Himself mighty, and He has shown Himself mine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For each of us, our own experience should be a revelation of God. The things about Him which we read in the Bible are never living and real to us till we have verified them in the facts of our own history. Many a word lies on the page, or in our memories, fully believed and utterly shadowy, until in some soul’s conflict we have had to grasp it, and found it true. Only so much of our creed as we have proved in life is really ours. If we will only open our eyes and reflect upon our history as it passes before us, we shall find every corner of it filled with the manifestations to our hearts and to our minds of a present God. But our folly, our stupidity, our impatience, our absorption with the mere outsides of things, our self-will, blind us to the Angel with the drawn sword who resists us, as well as to the Angel with the lily who would lead us. So we waste our days; are deaf to His voice speaking through all the clatter of tongues, and blind to His bright presence shining through all the dimness of earth; and, for far too many of us, we never can see God in the present, but only discern Him when He has passed by, like Moses from his cleft. Like this same Jacob, we have to say: ‘Surely God was in this place, and I knew it not.’ Hence we miss the educational worth of our lives, are tortured with needless cares, are beaten by the poorest adversaries, and grope amidst what seems to us a chaos of pathless perplexities, when we might be marching on assured and strong, with God for our guide, and the hands of the Mighty One of Jacob for our defence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Notice, too, how distinctly the thought comes out in this name-that the very vital centre of a man’s religion is his conviction that God is his. Jacob will not be content with thinking of God as the God of his fathers; he will not even be content with associating himself with them in the common possession; but he must feel the full force of the intensely personal bond that knits him to God, and God to him. Of course such a feeling does not ignore the blessed fellowship and family who also are held in this bond. The God of Jacob is to the patriarch also the God of Abraham, and of Isaac, and of Jacob. But that comes second, and this comes first. Each man for himself must put forth the hand of his own faith, and grasp that great hand for his own guide. ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Lord and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God’ is the true form of the confession. ‘He loved ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and gave Himself for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ is the shape in which the Gospel of Christ melts the soul. God is mine because His love individualises me, and I have a distinct place in His heart, His purposes, and His deeds. God is mine, because by my own individual act-the most personal which I can perform-I cast myself on Him, by my faith appropriate the common salvation, and open my being to the inflow of His power. God is mine, and I am His, in that wonderful mutual possession, with perpetual interchange of giving and receiving not only gifts but selves, which makes the very life of love, whether it be love on earth or love in heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Remember, too, the profound use which our Lord made of this name, wherein Jacob claims to possess God. Because Moses at the bush called God, the God of Abraham, and of Isaac, and of Jacob, they cannot have ceased to be. The personal relations, which subsist between God and the soul that clasps Him for its own, demand an immortal life for their adequate expression, and make it impossible that Death’s skeleton fingers should have power to untie such a bond. Anything is conceivable, rather than that the soul which can say ‘God is mine’ should perish. And that continued existence demands, too, a state of being which shall correspond to itself, in which its powers shall all be exercised, its desires fulfilled, its possibilities made facts. Therefore there must be the resurrection. ‘God is not ashamed to be called their God, for He hath prepared for them a city.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The dying patriarch left to his descendants the legacy of this great name, and often, in later times, it was used to quicken faith by the remembrance of the great deeds of God in the past. One instance may serve as a sample of the whole. ‘The Lord of Hosts is with us, the God of Jacob is our refuge.’ The first of these two names lays the foundation of our confidence in the thought of the boundless power of Him whom all the forces of the universe, personal and impersonal, angels and stars, in their marshalled order, obey and serve. The second bids later generations claim as theirs all that the old history reveals as having belonged to the ‘world’s grey fathers.’ They had no special prerogative of nearness or of possession. The arm that guided them is unwearied, and all the past is true still, and will for evermore be true for all who love God. So the venerable name is full of promise and of hope for us: ‘The God of Jacob is our refuge.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 2. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Shepherd",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".-How that name sums up the lessons that Jacob had learned from the work of himself and of his sons! ‘Thy servants are shepherds’ they said to Pharaoh; ‘both we, and also our sons.’ For fourteen long, weary years he had toiled at that task. ‘In the day the drought consumed me, and the frost by night; and my sleep departed from mine eyes,’ and his own sleepless vigilance and patient endurance seem to him to be but shadows of the loving care, the watchful protection, the strong defence, which ‘the God, who has been my Shepherd all my life long,’ had extended to him and his. Long before the shepherd king, who had been taken from the sheepcotes to rule over Israel, sang his immortal psalm, the same occupation had suggested the same thought to the shepherd patriarch. Happy they whose daily work may picture for them some aspect of God’s care-or rather, happy they whose eyes are open to see the dim likeness of God’s care which every man’s earthly relations, and some part of his work, most certainly present.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There can be no need to draw out at length the thoughts which that sweet and familiar emblem has conveyed to so many generations. Loving care, wise guidance, fitting food, are promised by it; and docile submission, close following at the Shepherd’s heels, patience, innocence, meekness, trust, are required. But I may put emphasis for a moment on the connection between the thought of ‘the mighty God of Jacob’ and that of ‘the Shepherd.’ The occupation, as we see it, does not call for a strong arm, or much courage, except now and then to wade through snowdrifts, and dig out the buried and half-dead creatures. But the shepherds whom Jacob knew, had to be hardy, bold fighters. There were marauders lurking ready to sweep away a weakly guarded flock. There were wild beasts in the gorges of the hills. There was danger in the sun by day on these burning plains, and in the night the wolves prowled round the flock. We remember how David’s earliest exploits were against the lion and the bear, and how he felt that even his duel with the Philistine bully was not more formidable than these had been. If we will read into our English notions of a shepherd this element of danger and of daring, we shall feel that these two clauses are not to be taken as giving the contrasted ideas of strength and gentleness, but the connected ones of strength, and therefore protection and security. We have the same connection in later echoes of this name. ‘Behold, the Lord God shall come with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strong",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hand; He shall feed His flock like a shepherd.’ And our Lord’s use of the figure brings into all but exclusive prominence the good shepherd’s conflict with the ravening wolves-a conflict in which he must not hesitate even ‘to lay down his life for the sheep.’ As long as the flock are here, amidst dangers and foes, and wild weather, the arm that guides must be an arm that can guard; and none less mighty than the Mighty One of Jacob can be the Shepherd of men. But a higher fulfilment yet awaits this venerable emblem, when in other pastures, where no lion nor any ravening beast shall come, the ‘Lamb, which is in the midst of the throne,’ and is Shepherd as well as Lamb, ‘shall feed them, and lead them by living fountains of waters.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 3. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Stone of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".-Here, again, we have a name, that after-ages have caught up and cherished, used for the first time. I suppose the Stone of Israel means much the same thing as the Rock. If so, that symbol, too, which is full of such large meanings, was coined by Jacob. It is, perhaps, not fanciful to suppose that it owes its origin to the scenery of Palestine. The wild cliffs of the eastern region where Peniel lay, or the savage fastnesses in the southern wilderness, a day’s march from Hebron, where he lived so long, came back to his memory amid the flat, clay land of Egypt; and their towering height, their immovable firmness, their cool shade, their safe shelter, spoke to him of the unalterable might and impregnable defence which he had found in God. So there is in this name the same devout, reflective laying-hold upon experience which we have observed in the preceding.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is also the same individualising grasp of God as his very own; for ‘Israel’ here is, of course, to be taken not as the name of the nation but as his own name, and the intention of the phrase is evidently to express what God had been to him personally.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The general idea of this symbol is perhaps firmness, solidity. And that general idea may be followed out in various details. God is a rock for a foundation. Build your lives, your thoughts, your efforts, your hopes there. The house founded on the rock will stand though wind and rain from above smite it, and floods from beneath beat on it like battering rams. God is a rock for a fortress. Flee to Him to hide, and your defence shall be the ‘munitions of rocks,’ which shall laugh to scorn all assault, and never be stormed by any foe. God is a rock for shade and refreshment. Come close to Him from out of the scorching heat, and you will find coolness and verdure and moisture in the clefts, when all outside that grateful shadow is parched and dry.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The word of the dying Jacob was caught up by the great law-giver in his dying song. ‘Ascribe ye greatness to our God. He is the Rock.’ It reappears in the last words of the shepherd king, whose grand prophetic picture of the true King is heralded by ‘The Book of Israel spake to me.’ It is heard once more from the lips of the greatest of the prophets in his glowing prophecy of the song of the final days: ‘Trust ye in the Lord for ever; for in the Lord Jehovah is the Rock of Ages,’ as well as in his solemn prophecy of the Stone which God would lay in Zion. We hear it again from the lips that cannot lie: ‘Did ye never read in the Scriptures, The Stone which the builders rejected, the same is become the headstone of the corner?’ And for the last time the venerable metaphor which has cheered so many ages appears in the words of that Apostle who was ‘surnamed Cephas, which is by interpretation a stone’: ‘To whom coming as unto a living Stone, yea also as living stones are built up.’ As on some rocky site in Palestine, where a hundred generations in succession have made their fortresses, one may see stones with the bevel that tells of early Jewish masonry, and above them Roman work, and higher still masonry of crusading times, and above it the building of to-day; so we, each age in our turn, build on this great rock foundation, dwell safe there for our little lives, and are laid to peaceful rest in a sepulchre in the rock. On Christ we may build. In Him we may dwell and rest secure. We may die in Jesus, and be gathered to our own people, who, having died, live in Him. And though so many generations have reared their dwellings on that great rock, there is ample room for us too to build. We have not to content ourselves with an uncertain foundation among the shifting rubbish of perished dwellings, but can get down to the firm virgin rock for ourselves. None that ever builded there have been confounded. We clasp hands with all who have gone before us. At one end of the long chain this dim figure of the dying Jacob, amid the strange vanished life of Egypt, stretches out his withered hands to God the Stone of Israel; at the other end, we lift up ours to Jesus, and cry:-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Rock of Ages! cleft for me,Let me hide myself in Thee.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Rock of Ages! cleft for me,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Let me hide myself in Thee.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The faith is one. One will be the answer and the reward. May it be yours and mine!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 49:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But his bow abode in strength — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His faith did not fail; he kept his ground, and came off conqueror. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "arms of his hands were made strong — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "other graces ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "did their part, his wisdom, courage, patience, which are better than weapons of war: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by the hands of the mighty God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who was therefore able to strengthen him; and the God of Jacob, a God in covenant with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From thence — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From this strange method of Providence, he became the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shepherd and stone — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The feeder and supporter of Israel, Jacob, and his family. Herein Joseph was a type of Christ; who was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shot at ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hated, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but borne up under his sufferings, and was afterward advanced to be the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shepherd ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stone: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and of the church in general; hell shoots its arrows against her, but heaven protects and strengthens her. But perhaps by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the shepherd and stone, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Joshua, a descendant of Joseph, by Ephraim, may be here primarily intended. He, as a good shepherd, brought into the pastures of Canaan that flock of the Lord which Moses had indeed led forth from Egypt, but which he had left in a barren wilderness. Thus by Joshua also was Christ typified, whose name he bears, who is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "foundation-",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "stone ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "laid in Zion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "good shepherd, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that leads his sheep into the heavenly Canaan, and gives them eternal life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49:22-27 The blessing of Joseph is very full. What Jacob says of him, is history as well as prophecy. Jacob reminds him of the difficulties and fiery darts of temptations he had formerly struggled through. His faith did not fail, but through his trials he bore all his burdens with firmness, and did not do anything unbecoming. All our strength for resisting temptations, and bearing afflictions, comes from God; his grace is sufficient. Joseph became the shepherd of Israel, to take care of his father and family; also the stone of Israel, their foundation and strong support. In this, as in many other things, Joseph was a remarkable type of the Good Shepherd, and tried Corner Stone of the whole church of God. Blessings are promised to Joseph's posterity, typical of the vast and everlasting blessings which come upon the spiritual seed of Christ. Jacob blessed all his sons, but especially Joseph, who was separated from his brethren. Not only separated in Egypt, but, possessing eminent dignity, and more devoted to God. Of Benjamin it is said, He shall ravin as a wolf. Jacob was guided in what he said by the Spirit of prophecy, and not by natural affection; else he would have spoken with more tenderness of his beloved son Benjamin. Concerning him he only foresees and foretells, that his posterity should be a warlike tribe, strong and daring, and that they should enrich themselves with the spoils of their enemies; that they should be active. Blessed Paul was of this tribe, Ro 11:1; Php 3:5; he, in the morning of his day, devoured the prey as a persecutor, but in the evening divided the spoils as a preacher; he shared the blessings of Judah's Lion, and assisted in his victories.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The memory then reverts to the past history of Joseph. A new figure is now called up. A champion is assailed by a host of archers. They vex him, shoot at him, and in every way act the part of an enemy. But his bow continues elastic, and his arms are enabled to bend it, because he receives strength from the God of his fathers, \"the Might of Jacob, the Shepherd, the Stone of Israel.\" Such is the rich and copious imagery that flows from the lips of Jacob. \"The Might,\" the exalted upholder; \"the Shepherd, the Stone,\" the fostering guardian as well as the solid foundation of his being. His great hands upheld Joseph against the brother and the stranger. \"From him.\" This seems the free rendering of the word requisite to bring the two members of the parallel into harmony.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ge 49:22-26. Joseph—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22. a fruitful bough, &c.—denotes the extraordinary increase of that tribe (compare Nu 1:33-35; Jos 17:17; De 33:17). The patriarch describes him as attacked by envy, revenge, temptation, ingratitude; yet still, by the grace of God, he triumphed over all opposition, so that he became the sustainer of Israel; and then he proceeds to shower blessings of every kind upon the head of this favorite son. The history of the tribes of Ephraim and Manasseh shows how fully these blessings were realized.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His bow, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " wherewith he opposed his enemies; which was no military bow, but that which he opposed to all their injuries, to wit, his own virtue, his innocence, his patience, his temperance, his faith and hope in God, whereby he resisted and vanquished all the temptations and difficulties which he met with, so that all his enemies could neither defile nor destroy him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The mighty God of Jacob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. my God; the noun for the pronoun, which is frequent. When men forsook and persecuted him, my God and his God stood by him. He showed that it was not Joseph’s wisdom or courage, but God’s gracious assistance, that made him conqueror. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From thence is the shepherd, the stone of Israel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. From that great deliverance vouchsafed by God to Joseph it is that Israel or Jacob hath a shepherd to feed him, a stone to lay his head upon, as once he did, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 28:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or a rock of refuge to fly to in his great distresses, or a foundation-stone, or corner-stone, or pillar, to sustain or preserve Jacob’s house. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From the hands of the mighty God of Jacob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " last mentioned. Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "father, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as it follows ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 49:25",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". So the sense is this, Though Joseph was a blessed instrument in this wonderful work, yet the God of Jacob was the chief author of it, by whose wise and merciful providence it was so ordered that Joseph should be first sold, and afterwards advanced, and all in order to this end, that his Israel, with whom he hath been pleased to make a gracious and everlasting covenant, should have a shepherd to feed him in the time of famine, and a stone or rock to support him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Here he explains and determines that doubtful expression ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from thence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by adding, even ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or rather ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as this particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " properly signifies, and was just now used) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the God of thy father, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. who hath chosen and loved thy father, and made a league with him, and blessed him with all manner of blessings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessings of heaven above, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the sweet and powerful influences of the heavenly bodies, and the dews and rains which fall from heaven, whereby the fruits of the earth are produced in great plenty. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 26:4 Deu 28:12 33:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 28:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 33:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessings of the deep, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. of that great sea of waters both about the earth, and in the earth, whence come those springs and rivers by which the earth is moistened and made fruitful. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 1:2 7:11 Deu 8:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 7:11 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 8:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessings of the breasts, and of the womb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whereby both men and beasts shall be greatly multiplied, and abundantly supplied with all necessaries. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But his bow abode in strength,.... For as his enemies were archers, and had bows and arrows, so had he, and repelled force by force; but then his bow and arrows were of a different sort, the virtues and graces that he was possessed of, as innocence and integrity, chastity, fortitude, wisdom, prudence and patience, faith, hope, and the like, which remained unmoved, and in their full exercise, notwithstanding the powerful attacks made upon them; and so his posterity were unmoved and unshaken, and stood firm and undaunted, notwithstanding the powerful enemies they had to deal with, until they were wholly subdued: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the arms of his hands were made strong by the hands of the mighty God of Jacob; so that he held his bow, and drew it with great strength against his enemies, as an archer being used to the bow, his nerves become strong, and he is not weakened by drawing it, nor weary of using it; but Joseph had not his strength of himself, but from the Lord, the mighty One, that had strengthened his father Jacob, and supported him under all his trouble: saints, like Joseph, have their strength, as well as their righteousness, in and from Christ; and when they are weak in themselves, they are strong in him, to exercise grace and perform duty: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from thence is the shepherd, the stone of Israel; from Jacob descended Joseph; or from the God of Jacob it was that Joseph through divine Providence was sent into Egypt to be as a shepherd, to feed his father's family, and as a stone to uphold and support it; in which he was a type of Christ, the great and good Shepherd of the flock, and the stone that is laid in Zion, on which the whole spiritual Israel of God is built; the foundation stone on which they are laid, and are safe, and the corner stone which knits them together. And some think that Christ is principally meant, who in his office capacity was from the mighty God of Jacob, a Shepherd of his providing and appointing, and a stone of his laying; and so Nachmahides says, the stone here made mention of is the same as in Psalm 118:22. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "from thence is the shepherd, the stone of Israel; from Jacob descended Joseph; or from the God of Jacob it was that Joseph through divine Providence was sent into Egypt to be as a shepherd, to feed his father's family, and as a stone to uphold and support it; in which he was a type of Christ, the great and good Shepherd of the flock, and the stone that is laid in Zion, on which the whole spiritual Israel of God is built; the foundation stone on which they are laid, and are safe, and the corner stone which knits them together. And some think that Christ is principally meant, who in his office capacity was from the mighty God of Jacob, a Shepherd of his providing and appointing, and a stone of his laying; and so Nachmahides says, the stone here made mention of is the same as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But his bow abode in strength, and the arms of his hands were made strong by the hands of the mighty God of Jacob; (from thence is the shepherd, the {s} stone of Israel:)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But his bow abode in strength, and the arms of his hands were made strong by the hands of the mighty ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "God",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of Jacob; (from thence ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the shepherd, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{s}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " stone of Israel:)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) That is God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his bow abode in strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “my bow is renewed in my hand.” Joseph was able by God’s help to resist. He overthrew his assailants. His strength was unshaken. LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ συνετρίβη μετὰ κράτους τὰ τόξα αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “and their bows with might were broken,” follows a variety of reading.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the arms of his hands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Probably meaning “the strength of his hands,” which held and drew the bow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were made strong",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, as R.V. marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "active",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The idea is nimbleness rather than strength.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "By the hands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] More lit. “from the hands.” The source of the deliverance of Joseph, rather than the instrumentality of it, is expressed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Mighty One of Jacob",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A Divine title, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "’âbîr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “the Strong One,” which appears elsewhere, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From thence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] No rendering gives an entirely satisfactory sense. The text is probably corrupt. (1) According to the R.V. text, the clause is a parenthesis; “from thence” means “from the Mighty One of Jacob.” “The shepherd,” and “the stone of Israel,” are appellations of Joseph. (2) According to the R.V. marg. “from thence from the shepherd,” the clause continues the thought of the previous words, and expands “by the hands of.” “The shepherd,” and “the stone of Israel,” are then Divine titles, in apposition to “the Mighty One of Jacob.” (3) “By the name of the shepherd.” This is a variety of the last ‘rendering, with the reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shêm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “name,” instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shâm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “there.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The rendering (1) seems to be improbable, since it applies to Joseph the titles of “shepherd” and “stone of Israel,” which certainly we should not expect to see applied to the son of Jacob. Between (2) and (3) it is difficult to make a selection, and the text cannot be relied on. But the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mis-shâm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= “from thence”) seems more prosaic and less impressive than ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mis-shêm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= “from the Name”); and on the whole (3) seems more probable. For the “Shepherd,” as a Divine title, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Prof. G. F. Moore conjectures “By the arms of the stone of Israel,” which would supply a parallel to “By the hands of the Mighty One of Jacob,” and would expand the thought of the previous clause (“the arms of his hands”). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Encycl. Bibl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". iii. 2977, n. 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the stone of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] If used as a Divine title, the “stone” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "’eben",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is here substituted for the more usual “rock” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ṣûr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 22:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is very possible that the allusion may be to the stone (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "’eben",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of Bethel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or even to the great stone of Shechem (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:26-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the sanctuary of the tribe and the burial-place of Joseph.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“The Name of the Shepherd of the Stone of Israel” is thus a possible, though a cumbrous title with a reference to the stone of Bethel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 49:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Archers provoke him, and shoot and hate him; but his bow abides in strength, and the arms of his hands remain pliant, from the hands of the Mighty One of Jacob, from thence, from the Shepherd, the Stone of Israel.\" From the simile of the fruit-tree Jacob passed to a warlike figure, and described the mighty and victorious unfolding of the tribe of Joseph in conflict with all its foes, describing with prophetic intuition the future as already come (vid., the perf. consec.). The words are not to be referred to the personal history of Joseph himself, to persecutions received by him from his brethren, or to his sufferings in Egypt; still less to any warlike deeds of his in Egypt (Diestel): they merely pointed to the conflicts awaiting his descendants, in which they would constantly overcome all hostile attacks. מרר: Piel, to embitter, provoke, lacessere. רבּוּ: perf. o from רבב to shoot. בּאיתן: \"in a strong, unyielding position\" (Del.). פּזז: to be active, flexible; only found here, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of a brisk movement, skipping or jumping. זרעי: the arms, \"without whose elasticity the hands could not hold or direct the arrow.\" The words which follow, \"from the hands of the Mighty One of Jacob,\" are not to be linked to what follows, in opposition to the Masoretic division of the verses; they rather form one sentence with what precedes: \"pliant remain the arms of his hands from the hands of God,\" i.e., through the hands of God supporting them. \"The Mighty One of Jacob,\" He who had proved Himself to be the Mighty One by the powerful defence afforded to Jacob; a title which is copied from this passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. \"From thence,\" an emphatic reference to Him, from whom all perfection comes - \"from the Shepherd (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Stone of Israel.\" God is called \"the Stone,\" and elsewhere \"the Rock\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), as the immoveable foundation upon which Israel might trust, might stand firm and impregnably secure.",
        "children": []
      }
    ]
  }
]