[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(26) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The blessings of thy father.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As the passage now stands, it means that the blessings which Jacob bestows upon Joseph are greater than those which he had himself received from his ancestors, Abraham and Isaac. This was scarcely the case, as the chief spiritual blessing was bestowed upon Judah, while for Joseph there was only earthly prosperity. For this reason most modern commentators adopt the reading of the Samaritan Pentateuch, supported by the Samaritan Targum and the LXX., “The blessings of thy father are mightier than the blessings of the ancient mountains, than the desire (or beauty) of the everlasting hills.” Not only is the parallelism of the poetry thus preserved, but the rendering is easy and natural, while the other translation is full of difficulties, especially as to the words, “my progenitors,” and “the utmost bound.” The sense thus given to them cannot be obtained by any ordinary philological process.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Him that was separate from his brethren.—This scarcely gives the force of the verb, which means, set apart, consecrated. Hence the Vulg. renders “Nazarite,” the Hebrew word being nezir. The Syriac and Samaritan Targum translate, “him that is the crown of his brethren;” and the LXX., “him who was the leader of his brethren.” Many see in this an allusion to the sovereignty over the ten tribes being finally attained to by Ephraim, but probably the meaning is that Joseph was the noblest and highest in rank among Jacob’s children.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Him that was separate from his brethren.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This scarcely gives the force of the verb, which means, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "set apart, consecrated. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Hence the Vulg. renders “Nazarite,” the Hebrew word being ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "nezir. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The Syriac and Samaritan Targum translate, “him that is the crown of his brethren;” and the LXX., “him who was the leader of his brethren.” Many see in this an allusion to the sovereignty over the ten tribes being finally attained to by Ephraim, but probably the meaning is that Joseph was the noblest and highest in rank among Jacob’s children.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49:22-27 The blessing of Joseph is very full. What Jacob says of him, is history as well as prophecy. Jacob reminds him of the difficulties and fiery darts of temptations he had formerly struggled through. His faith did not fail, but through his trials he bore all his burdens with firmness, and did not do anything unbecoming. All our strength for resisting temptations, and bearing afflictions, comes from God; his grace is sufficient. Joseph became the shepherd of Israel, to take care of his father and family; also the stone of Israel, their foundation and strong support. In this, as in many other things, Joseph was a remarkable type of the Good Shepherd, and tried Corner Stone of the whole church of God. Blessings are promised to Joseph's posterity, typical of the vast and everlasting blessings which come upon the spiritual seed of Christ. Jacob blessed all his sons, but especially Joseph, who was separated from his brethren. Not only separated in Egypt, but, possessing eminent dignity, and more devoted to God. Of Benjamin it is said, He shall ravin as a wolf. Jacob was guided in what he said by the Spirit of prophecy, and not by natural affection; else he would have spoken with more tenderness of his beloved son Benjamin. Concerning him he only foresees and foretells, that his posterity should be a warlike tribe, strong and daring, and that they should enrich themselves with the spoils of their enemies; that they should be active. Blessed Paul was of this tribe, Ro 11:1; Php 3:5; he, in the morning of his day, devoured the prey as a persecutor, but in the evening divided the spoils as a preacher; he shared the blessings of Judah's Lion, and assisted in his victories.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These two thoughts - the peaceful abundance of his old age, which he owed to Joseph, and the persecutions his beloved son had endured - stir the fountains of his affections until they overflow with blessings. \"From the God of thy father\" - the Eternal One who is the source of all blessing. \"And the Almighty,\" who is able to control all adverse influences. \"Blessings of heaven above\" - the air, the rain, and the sun. \"Blessings of the deep\" - the springs and streams, as well as the fertile soil. \"Blessings of the breasts and the womb\" - the children of the home and the young of the flocks and herds. \"Have prevailed.\" The benedictions of Jacob pronounced upon Joseph exceed those that came upon Jacob himself from his fathers. To Joseph is given a double portion, with a double measure of affection from a father's heart. \"Unto the bound of the perpetual hills.\" Like an overflowing flood they have risen to the very summits of the perpetual hills in the conceptions of the venerable patriarch. \"Of him who was distinguished from his brethren;\" not only by a long period of persecution and humiliation, but by a subsequent elevation to extraordinary dignity and pre-eminence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is to be noted that this benediction, when fairly interpreted, though it breathes all the fondness of a father's heart, yet contains no intimation that the supremacy or the priesthood were to belong to Joseph, or that the Messiah was to spring from him. At the same time Joseph was in many events of his history a remarkable type of the Messiah, and by intermarriage he, as well as many foreigners, was no doubt among the ancestors of the Messiah 2 Kings 8:18, 2 Kings 8:26.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is to be noted that this benediction, when fairly interpreted, though it breathes all the fondness of a father's heart, yet contains no intimation that the supremacy or the priesthood were to belong to Joseph, or that the Messiah was to spring from him. At the same time Joseph was in many events of his history a remarkable type of the Messiah, and by intermarriage he, as well as many foreigners, was no doubt among the ancestors of the Messiah ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 8:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 8:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ge 49:22-26. Joseph—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22. a fruitful bough, &c.—denotes the extraordinary increase of that tribe (compare Nu 1:33-35; Jos 17:17; De 33:17). The patriarch describes him as attacked by envy, revenge, temptation, ingratitude; yet still, by the grace of God, he triumphed over all opposition, so that he became the sustainer of Israel; and then he proceeds to shower blessings of every kind upon the head of this favorite son. The history of the tribes of Ephraim and Manasseh shows how fully these blessings were realized.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The blessings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which I ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thy father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " have conferred upon thee, are much more considerable than those which I received from my father Isaac, or from my grandfather Abraham This was true, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. In the extent of the blessings; Ishmael was excluded from Abraham’s blessing, and my brother excluded from Isaac’s blessing, but both Joseph’s children are comprehended in Jacob’s blessing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. In the distinctness and clearness of them; for that land of Canaan which was transmitted to Isaac and to Jacob only in the general, was now in some sort particularly distributed to Joseph, and to the rest of his brethren, as afterwards it was by Joshua. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. In the nearness of the accomplishment. Now there was a more likely prospect of the multiplication of their seed, than there was to Abraham or Isaac; and in not very many years after this they multiplied to astonishment, and drew nearer to the possession of the promised land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Unto the utmost bound of the everlasting hills:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these words seem to note the duration of Joseph’s blessing, that it should continue ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even to the bounds of the everlasting, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lasting, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ancient hills, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. as long as the most solid and stable mountains shall last, i.e. for ever. Perpetuity is described by the continuance of the mountains, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Isaiah 54:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 54:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or of the sun and moon, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 72:5,7,17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",7,17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or of the heavens and earth, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Matthew 5:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the foregoing words of this verse he commends these blessings from their excellency above all former blessings; and here he commends them from their durableness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall be; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let them be; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for this may be a prayer to God that these blessings may be constant and perpetual. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Him that was separate from his brethren; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so he was, when he was sold into Egypt, and abode there in the court when his brethren were in Goshen. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the crowned of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among his brethren, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. who though he was once scorned and trampled upon by his brethren, yet now is highly honoured and advanced above them. Others, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Nazarite of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among his brethren; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as he may be called either for his purity and sanctity, or for his eminency and dignity. But we must remember that the Nazarites were as yet unknown, being instituted long after this time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The blessings of thy father have prevailed above the blessings of my progenitors,.... Jacob's blessings were greater and more numerous, both those which he himself had, and bestowed upon his offspring, than those that Abraham and Isaac had, he having more children than they, and blessings for everyone of them; whereas they each of them had but two, and one of these two were excluded the blessing: and besides, though these blessings were the same in substance bestowed on his progenitors, and by them on him, yet these were more clearly and distinctly given out by him to his posterity, and were nearer their accomplishment: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "unto the utmost bounds of the everlasting hills, they shall be on the head of Joseph: that is, continue on him as long as the everlasting hills continue, particularly those of a spiritual kind, for they endure for ever. The word for \"bounds\" signifies \"desire\"; and Onkelos paraphrases the words,\"which the princes that were of old desired:''meaning either the angels who desire to look into heavenly things, or the patriarchs, who were desirous of the coming of the Messiah, and salvation by him; and so the Vulgate Latin version is, \"until the desire of the everlasting hills should come\"; that is, Christ, who is the desire of all nations, in whom all nations of the earth are to be blessed, and therefore desirable; blessings of all kinds are upon the head of the just, as they were on Joseph, Proverbs 10:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "unto the utmost bounds of the everlasting hills, they shall be on the head of Joseph: that is, continue on him as long as the everlasting hills continue, particularly those of a spiritual kind, for they endure for ever. The word for \"bounds\" signifies \"desire\"; and Onkelos paraphrases the words,\"which the princes that were of old desired:''meaning either the angels who desire to look into heavenly things, or the patriarchs, who were desirous of the coming of the Messiah, and salvation by him; and so the Vulgate Latin version is, \"until the desire of the everlasting hills should come\"; that is, Christ, who is the desire of all nations, in whom all nations of the earth are to be blessed, and therefore desirable; blessings of all kinds are upon the head of the just, as they were on Joseph, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 10:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and on the crown of the head of him that was separate from his brethren; who shunned company and conversation with him, and at length sold him into Egypt, where he was parted from them, and remained separate for many years; and when they came to dwell in the land of Egypt, they lived in Goshen, and he at Pharaoh's court, where he was distinguished with peculiar honours, and advanced above them. Of Christ his antitype, see Hebrews 7:26. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and on the crown of the head of him that was separate from his brethren; who shunned company and conversation with him, and at length sold him into Egypt, where he was parted from them, and remained separate for many years; and when they came to dwell in the land of Egypt, they lived in Goshen, and he at Pharaoh's court, where he was distinguished with peculiar honours, and advanced above them. Of Christ his antitype, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 7:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The blessings of thy father have {t} prevailed above the blessings of my progenitors unto the utmost bound of the everlasting hills: they shall be on the head of Joseph, and on the crown of the head of him that was {u} separate from his brethren.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The blessings of thy father have ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{t}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prevailed above the blessings of my progenitors unto the utmost bound of the everlasting hills: they shall be on the head of Joseph, and on the crown of the head of him that was ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{u}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " separate from his brethren.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) In as much as he was closer to the accomplishment of the promise and it had been more often confirmed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) Either in dignity, or when he was sold from his brethren.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The blessings of thy father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i. e. the blessings invoked by Jacob, thy father, when fulfilled in the greatness and influence of the people that shall spring from thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Have prevailed above",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. have ranked higher, are of greater excellence, than the material blessings of the fair country assigned to Joseph.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the blessings of my progenitors",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, as R.V. marg., according to some ancient authorities, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the blessings of the ancient mountains, the desire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "desirable things) of the everlasting hills",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The rendering of the R.V. text in this difficult passage depends upon a practically impossible translation, i.e. “my progenitors” (Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "patrum ejus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), where the Hebrew literally means “my conceivers.” It is better to follow the rendering in the marg., which requires a very slight change in the text. Instead of “my progenitors,” read “the mountains of”; and, instead of “unto,” read “eternity.” This has the support of LXX, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὀρέων μονίμων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and it is supported also by the parallelism of the clauses. “The everlasting hills,” in the next clause, will then balance “the ancient mountains” of this clause; as is the case in the blessing of Joseph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “and for the chief things of the ancient mountains, and for the precious things of the everlasting hills.” Cf. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Unto the utmost bound",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A doubtful rendering, required by the translation of the previous word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘ad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “unto.” According to the better reading, this word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘ad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", should be rendered “eternity.” Instead of “bound,” we should render “desire” (which is the ordinary translation of the Heb. word), in the sense of “the desirable things,” thus balancing the words “the blessings” in the previous clause.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They shall be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, “may they be,” a prayer, as in the very similar passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with which these two clauses should be compared; “let the blessing come upon the head of Joseph, and upon the crown of the head of him that was separate from his brethren.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on the head … crown",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Words implying a benediction, with the hand resting upon the head.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that was separate from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In Hebrew the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nazir",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is “one set apart,” or “consecrated,” by a vow, or otherwise, for high duties. Thus Samson was a “Nazirite,” separated to be the champion of his people’s liberties. Perhaps, but not probably, the mention of “the crown of the head” has an allusion to the Naziritic vow. Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nazaraei inter fratres suos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some connect ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nazir",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nezer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “a diadem,” and render by “prince”; so R.V. marg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that is prince among",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὧν ἡγήσατο ἀδελφῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), a possible allusion to the Ephraimite kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 49:26",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"From the God of thy father, may He help thee, and with the help of the Almighty, may He bless thee, (may there come) blessings of heaven from above, blessings of the deep, that lieth beneath, blessings of the breast and of the womb. The blessing of thy father surpass the blessings of my progenitors to the border of the everlasting hills, may they come upon the head of Joseph, and upon the crown of the illustrious among his brethren.\" From the form of a description the blessing passes in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into the form of a desire, in which the \"from\" of the previous clause is still retained. The words \"and may He help thee,\" \"may He bless thee,\" form parentheses, for \"who will help and bless thee.\" ואת is neither to be altered into ואל (and from God), as Ewald suggests, in accordance with the lxx, Sam., Syr., and Vulg., nor into מאת as Knobel proposes; and even the supplying of מן before את from the parallel clause (Ges. 154, 4) is scarcely allowable, since the repetition of מן before another preposition cannot be supported by any analogous case; but את may be understood here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the sense of helpful communion: \"and with,\" i.e., with (in) the fellowship of, \"the Almighty, may He bless thee, let there be (or come) blessings,\" etc. The verb תּחיין follows in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after the whole subject, which is formed of many parallel members. The blessings were to come from heaven above and from the earth beneath. From the God of Jacob and by the help of the Almighty should the rain and dew of heaven (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and fountains and brooks which spring from the great deep or the abyss of the earth, pour their fertilizing waters over Joseph's land, \"so that everything that had womb and breast should become pregnant, bring forth, and suckle.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"Thus is the whole composed in pictorial words. Whatever of man and cattle can be fruitful shall multiply and have enough. Childbearing, and the increase of cattle, and of the corn in the field, are not our affair, but the mercy and blessing of God.\" - Luther.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "הרים from הרה signifies parentes (Chald., Vulg.); and תּאוה signifies not desiderium from אוה, but boundary from תּאה, Numbers 34:7-8,  equals  תּוה,   1 Samuel 21:14; Ezekiel 9:4, to mark or bound off, as most of the Rabbins explain it. על גּבר to be strong above, i.e., to surpass. The blessings which the patriarch implored for Joseph were to surpass the blessings which his parents transmitted to him, to the boundary of the everlasting hills, i.e., surpass them as far as the primary mountains tower above the earth, or so that they should reach to the summits of the primeval mountains. There is no allusion to the lofty and magnificent mountain-ranges of Ephraim, Bashan, and Gilead, which fell to the house of Joseph, either here or in Deuteronomy 33:15. These blessings were to descend upon the head of Joseph, the נזיר among his brethren, i.e., \"the separated one,\" from נזר separavit. Joseph is so designated, both here and Deuteronomy 33:16, not on account of his virtue and the preservation of his chastity and piety in Egypt, but propter dignitatem, qua excellit, ab omnibus sit segregatus (Calv.), on account of the eminence to which he attained in Egypt. For this meaning see Lamentations 4:7; whereas no example can be found of the transference of the idea of Nasir to the sphere of morality. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "הרים from הרה signifies parentes (Chald., Vulg.); and תּאוה signifies not desiderium from אוה, but boundary from תּאה, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 34:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",  equals  תּוה,   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to mark or bound off, as most of the Rabbins explain it. על גּבר to be strong above, i.e., to surpass. The blessings which the patriarch implored for Joseph were to surpass the blessings which his parents transmitted to him, to the boundary of the everlasting hills, i.e., surpass them as far as the primary mountains tower above the earth, or so that they should reach to the summits of the primeval mountains. There is no allusion to the lofty and magnificent mountain-ranges of Ephraim, Bashan, and Gilead, which fell to the house of Joseph, either here or in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". These blessings were to descend upon the head of Joseph, the נזיר among his brethren, i.e., \"the separated one,\" from נזר separavit. Joseph is so designated, both here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not on account of his virtue and the preservation of his chastity and piety in Egypt, but propter dignitatem, qua excellit, ab omnibus sit segregatus (Calv.), on account of the eminence to which he attained in Egypt. For this meaning see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; whereas no example can be found of the transference of the idea of Nasir to the sphere of morality. ",
            "children": []
          }
        ]
      }
    ]
  }
]