[{"num":6,"verse":"Therefore let us go on and get past the elementary stage in the teachings and doctrine of Christ (the Messiah), advancing steadily toward the completeness and perfection that belong to spiritual maturity. Let us not again be laying the foundation of repentance and abandonment of dead works (dead formalism) and of the faith [by which you turned] to God,"},{"num":2,"verse":"With teachings about purifying, the laying on of hands, the resurrection from the dead, and eternal judgment and punishment. [These are all matters of which you should have been fully aware long, long ago.]"},{"num":3,"verse":"If indeed God permits, we will [now] proceed [to advanced teaching]."},{"num":4,"verse":"For it is impossible [to restore and bring again to repentance] those who have been once for all enlightened, who have consciously tasted the heavenly gift and have become sharers of the Holy Spirit,"},{"num":5,"verse":"And have felt how good the Word of God is and the mighty powers of the age and world to come,"},{"num":6,"verse":"If they then deviate from the faith and turn away from their allegiance—[it is impossible] to bring them back to repentance, for (because, while, as long as) they nail upon the cross the Son of God afresh [as far as they are concerned] and are holding [Him] up to contempt and shame and public disgrace."},{"num":7,"verse":"For the soil which has drunk the rain that repeatedly falls upon it and produces vegetation useful to those for whose benefit it is cultivated partakes of a blessing from God."},{"num":8,"verse":"But if [that same soil] persistently bears thorns and thistles, it is considered worthless and near to being cursed, whose end is to be burned."},{"num":9,"verse":"Even though we speak this way, yet in your case, beloved, we are now firmly convinced of better things that are near to salvation and accompany it."},{"num":10,"verse":"For God is not unrighteous to forget or overlook your labor and the love which you have shown for His name’s sake in ministering to the needs of the saints (His own consecrated people), as you still do."},{"num":11,"verse":"But we do [strongly and earnestly] desire for each of you to show the same diligence and sincerity [all the way through] in realizing and enjoying the full assurance and development of [your] hope until the end,"},{"num":12,"verse":"In order that you may not grow disinterested and become [spiritual] sluggards, but imitators, behaving as do those who through faith (by their leaning of the entire personality on God in Christ in absolute trust and confidence in His power, wisdom, and goodness) and by practice of patient endurance and waiting are [now] inheriting the promises."},{"num":13,"verse":"For when God made [His] promise to Abraham, He swore by Himself, since He had no one greater by whom to swear,"},{"num":14,"verse":"Saying, Blessing I certainly will bless you and multiplying I will multiply you."},{"num":15,"verse":"And so it was that he [Abraham], having waited long and endured patiently, realized and obtained [in the birth of Isaac as a pledge of what was to come] what God had promised him."},{"num":16,"verse":"Men indeed swear by a greater [than themselves], and with them in all disputes the oath taken for confirmation is final [ending strife]."},{"num":17,"verse":"Accordingly God also, in His desire to show more convincingly and beyond doubt to those who were to inherit the promise the unchangeableness of His purpose and plan, intervened (mediated) with an oath."},{"num":18,"verse":"This was so that, by two unchangeable things [His promise and His oath] in which it is impossible for God ever to prove false or deceive us, we who have fled [to Him] for refuge might have mighty indwelling strength and strong encouragement to grasp and hold fast the hope appointed for us and set before [us]."},{"num":19,"verse":"[Now] we have this [hope] as a sure and steadfast anchor of the soul [it cannot slip and it cannot break down under whoever steps out upon it—a hope] that reaches farther and enters into [the very certainty of the Presence] within the veil,"},{"num":20,"verse":"Where Jesus has entered in for us [in advance], a Forerunner having become a High Priest forever after the order (with the rank) of Melchizedek."}]