[{"header":"Can we not leave spiritual babyhood behind—and go on to maturity?"},{"num":1,"verse":"Let us leave behind the elementary teaching about Christ and go forward to adult understanding. Let us not lay over and over again the foundation truths—repentance from the deeds which led to death, believing in God, baptism and laying-on of hands, belief in the life to come and the final judgment. No, if God allows, let us go on."},{"header":"Going back to the foundations will not help those who have deliberately turned away from God"},{"num":4,"verse":"When you find men who have been enlightened, who have experienced salvation and received the Holy Spirit, who have known the wholesome nourishment of the Word of God and touched the spiritual resources of the eternal world and who then fall away, it proves impossible to make them repent as they did at first. For they are re-crucifying the Son of God in their own souls, and by their conduct exposing him to shame and contempt. Ground which absorbs the rain that is constantly falling upon it and produces plants which are useful to those who cultivate it, is ground which has the blessing of God. But ground which produces nothing but thorns and thistles is of no value and is bound sooner or later to be condemned—the only thing to do is to burn it clean."},{"header":"We want you to make God’s promise real through your faith, hope and patience"},{"num":9,"verse":"But although we give these words of warning we feel sure that you, whom we love, are capable of better things and will enjoy the full experience of salvation. God is not unfair: he will not lose sight of all that you have done nor of the loving labour which you have shown for his sake in looking after fellow-Christians (as you are still doing). It is our earnest wish that every one of you should show a similar keenness in fully grasping the hope that is within you. We do not want any of you to grow slack, but to follow the example of those who through sheer patient faith came to possess the promises."},{"num":13,"verse":"When God made his promise to Abraham he swore by himself, for there was no one greater by whom he could swear, and he said: ‘Surely blessing I will bless you, and multiplying I will multiply you’. And then Abraham, after patient endurance, found the promise true."},{"num":16,"verse":"Among men it is customary to swear by something greater than themselves. And if a statement is confirmed by an oath, that is the end of all quibbling. So in this matter, God, wishing to show beyond doubt that his plan was unchangeable, confirmed it with an oath. So that by two utterly immutable things, the word of God and the oath of God, who cannot lie, we who are refugees from this dying world might have a source of strength, and might grasp the hope that he holds out to us. This hope we hold as the utterly reliable anchor for our souls, fixed in the very certainty of God himself in Heaven, where Jesus has already entered on our behalf, having become, as we have seen, “High Priest for ever after the order of Melchizedek”."}]