[{"header":"Moving On to Deeper Truth"},{"num":6,"verse":"Now is the time for us to progress beyond the basic message of Christ and advance into perfection. The foundation has already been laid for us to build upon: turning away from our dead works to embrace faith in God, "},{"num":2,"verse":"teaching about different baptisms, impartation by the laying on of hands, resurrection of the dead, and eternal judgment. "},{"num":3,"verse":"So with God’s enablement we will move on to deeper truths."},{"header":"A Warning to Never Turn Away"},{"num":4,"verse":"It is impossible to restore an apostate. For once a person has come into God’s light, and tasted the gifts of the heavenly realm, and has received the Holy Spirit, "},{"num":5,"verse":"and feasted on the good Word of God, and has entered into the power of the age that is breaking in, "},{"num":6,"verse":"if he abandons his faith, there is no use even trying to lead him to repentance. By their sin of apostasy they re-crucify the Son of God, and have publicly repudiated him."},{"num":7,"verse":"For men’s hearts are just like the soil that drinks up the showers which often fall upon it. Some soil will yield crops as God’s blessing upon the field. "},{"num":8,"verse":"But if the field continues to produce only thorns and thistles a curse hangs over it and it will be burned."},{"num":9,"verse":"Even though we speak like this, beloved, we are fully convinced that there are more beautiful and excellent things, which flow from your salvation."},{"num":10,"verse":"For God, the Faithful One, is not unfair. How can he forget the beautiful work you have done for him? He remembers the love you demonstrate as you continually serve his beloved ones for the glory of his name. "},{"num":11,"verse":"But we long to see you passionately advance until the end and you find your hope fulfilled. "},{"num":12,"verse":"So don’t allow your hearts to grow dull or lose your enthusiasm, but follow the example of those who fully received what God has promised because of their strong faith and patient endurance."},{"header":"God’s Faithful Promise"},{"num":13,"verse":"Now when God made a promise to Abraham, since there was no one greater than himself, he swore an oath on his own integrity to keep the promise as sure as God exists! "},{"num":14,"verse":"So he said,"},{"num":15,"verse":"So Abraham waited patiently in faith and succeeded in seeing the promise fulfilled. "},{"num":16,"verse":"It is very common for people to swear an oath by something greater than themselves, for the oath will confirm their statements and end all dispute. "},{"num":17,"verse":"So in the same way, God wanted to end all doubt and confirm it even more forcefully to those who would inherit his promises. His purpose was unchangeable, so God added his vow to the promise. "},{"num":18,"verse":"So it is impossible for God to lie for we know that his promise and his vow will never change!"},{"num":19,"verse":"We have this certain hope like a strong, unbreakable anchor holding our souls to God himself. Our anchor of hope is fastened to the mercy seat in the heavenly realm beyond the sacred threshold, "},{"num":20,"verse":"and where Jesus, our forerunner, has gone in before us. He is now and forever our royal Priest like Melchizedek."}]