[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Learning and wisdom.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "These appear to be contrasted in this verse. The former refers to literature, and implies the knowledge of secular subjects; the latter implies philosophy and theology, and perhaps, also, an acquaintance with the meaning of portents. Abundant instances of the latter may be found in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Records of the Past",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see vol. v., p. 167).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 1:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As for these four children — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Hebrew is literally, As to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "these children, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or young men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "each of them four: to them God gave knowledge and skill in all learning and wisdom — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, in all sorts of learning and knowledge. They became particularly skilful in those parts of the Chaldean learning which were really useful, and which might recommend them to the favour of the kings both of Babylon and Persia, and qualify them for places of trust under them; as Moses’s education in the Egyptian learning fitted him to be a ruler of God’s people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Daniel had understanding in all visions and dreams ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Daniel excelled the others in the gift of prophecy, and in his extraordinary skill in interpreting all sorts of visions and dreams, namely, such as were sent of God, and foreshowed future events, under the cover of certain images and representations, which required an interpretation in order to the understanding of their true signification. But we must not suppose that Daniel attained this skill by any study or rules of art. It was God’s supernatural gift unto him, as was the same kind of knowledge which Joseph possessed and manifested when he interpreted the dreams of Pharaoh, and those of the chief butler and baker.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:17-21 Daniel and his fellows kept to their religion; and God rewarded them with eminence in learning. Pious young persons should endeavour to do better than their fellows in useful things; not for the praise of man, but for the honour of the gospel, and that they may be qualified for usefulness. And it is well for a country, and for the honour of a prince, when he is able to judge who are best fitted to serve him, and prefers them on that account. Let young men steadily attend to this chapter; and let all remember that God will honour those who honour him, but those who despise him shall be lightly esteemed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As for these four children - On the word \"children,\" see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God gave them knowledge and skill - See the notes at Daniel 1:9. There is no reason to suppose that in the \"knowledge and skill\" here referred to, it is meant to be implied that there was anything miraculous, or that there was any direct inspiration. Inspiration was evidently confined to Daniel, and pertained to what is spoken of under the head of \"visions and dreams.\" The fact that \"all\" this was to be attributed to God as his gift, is in accordance with the common method of speaking in the Scriptures; and it is also in accordance with \"fact,\" that \"all\" knowledge is to be traced to God. See Exodus 31:2-3. God formed the intellect; he preserves the exercise of reason; he furnishes us instructors; he gives us clearness of perception; he enables us to take advantage of bright thoughts and happy suggestions which occur in our own minds, as much as he sends rain, and dew, and sunshine on the fields of the farmer, and endows him with skill. Compare Isaiah 28:26, \"For his God doth instruct him.\" The knowledge and skill which we may acquire, therefore, should be as much attributed to God as the success of the farmer should. Compare Job 32:8, \"For there is a spirit in man, and the inspiration of the Almighty giveth them understanding.\" In the case before us, there is no reason to doubt that the natural powers of these young men had been diligently applied during the three years of their trial Daniel 1:5, and under the advantages of a strict course of temperance; and that the knowledge here spoken of was the result of such an application to their studies. On the meaning of the words \"knowledge\" and \"skill\" here, see the notes at Daniel 1:4.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God gave them knowledge and skill - See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There is no reason to suppose that in the \"knowledge and skill\" here referred to, it is meant to be implied that there was anything miraculous, or that there was any direct inspiration. Inspiration was evidently confined to Daniel, and pertained to what is spoken of under the head of \"visions and dreams.\" The fact that \"all\" this was to be attributed to God as his gift, is in accordance with the common method of speaking in the Scriptures; and it is also in accordance with \"fact,\" that \"all\" knowledge is to be traced to God. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God formed the intellect; he preserves the exercise of reason; he furnishes us instructors; he gives us clearness of perception; he enables us to take advantage of bright thoughts and happy suggestions which occur in our own minds, as much as he sends rain, and dew, and sunshine on the fields of the farmer, and endows him with skill. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"For his God doth instruct him.\" The knowledge and skill which we may acquire, therefore, should be as much attributed to God as the success of the farmer should. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 32:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"For there is a spirit in man, and the inspiration of the Almighty giveth them understanding.\" In the case before us, there is no reason to doubt that the natural powers of these young men had been diligently applied during the three years of their trial ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and under the advantages of a strict course of temperance; and that the knowledge here spoken of was the result of such an application to their studies. On the meaning of the words \"knowledge\" and \"skill\" here, see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In all learning and wisdom - See also the notes at Daniel 1:4.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In all learning and wisdom - See also the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And Daniel had understanding - Showing that in that respect there was a special endowment in his case; a kind of knowledge imparted which could be communicated only by special inspiration. The margin is, \"he made Daniel understand.\" The margin is in accordance with the Hebrew, but the sense is the same.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In all visions - On the word rendered \"visions\" - חזון  châzôn - see the notes at Isaiah 1:1, and the introduction to Isaiah, Section 7. (4). It is a term frequently employed in reference to prophecy, and designates the usual method by which future events were made known. The prophet was permitted to see those events \"as if\" they were made to pass before the eye, and to describe them \"as if\" they were objects of sight. Here the word seems to be used to denote all supernatural appearances; all that God permitted him to see that in any way shadowed forth the future. It would seem that men who were not inspired were permitted occasionally to behold such supernatural appearances, though they were not able to interpret them. Thus their attention would be particularly called to them, and they would be prepared to admit the truth of what the interpreter communicated to them. Compare Daniel 4; Daniel 5:5-6; Genesis 40:5; Genesis 41:1-7. Daniel was so endowed that he could interpret the meaning of these mysterious appearances, and thus convey important messages to men. The same endowment had been conferred on Joseph when in Egypt. See the passages referred to in Genesis.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In all visions - On the word rendered \"visions\" - חזון  châzôn - see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the introduction to Isaiah, Section 7. (4). It is a term frequently employed in reference to prophecy, and designates the usual method by which future events were made known. The prophet was permitted to see those events \"as if\" they were made to pass before the eye, and to describe them \"as if\" they were objects of sight. Here the word seems to be used to denote all supernatural appearances; all that God permitted him to see that in any way shadowed forth the future. It would seem that men who were not inspired were permitted occasionally to behold such supernatural appearances, though they were not able to interpret them. Thus their attention would be particularly called to them, and they would be prepared to admit the truth of what the interpreter communicated to them. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 40:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Daniel was so endowed that he could interpret the meaning of these mysterious appearances, and thus convey important messages to men. The same endowment had been conferred on Joseph when in Egypt. See the passages referred to in Genesis.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And dreams - One of the ways by which the will of God was anciently communicated to men. See Introduction to Isaiah, Section 7. (2), and the notes at Job 33:14-18. Daniel, like Joseph before him, was supernaturally endowed to explain these messages which God sent to men, or to unfold these preintimations of coming events. This was a kind of knowledge which the Chaldeans particularly sought, and on which they especially prided themselves; and it was important, in order to \"stain the pride of all human glory,\" and to make \"the wisdom of the wise\" in Babylon to be seen to be comparative \"folly,\" to endow one man from the land of the prophets in the most ample manner with this knowledge, as it was important to do the same thing at the court of Pharaoh by the superior endowments of Joseph Genesis 41:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And dreams - One of the ways by which the will of God was anciently communicated to men. See Introduction to Isaiah, Section 7. (2), and the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:14-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Daniel, like Joseph before him, was supernaturally endowed to explain these messages which God sent to men, or to unfold these preintimations of coming events. This was a kind of knowledge which the Chaldeans particularly sought, and on which they especially prided themselves; and it was important, in order to \"stain the pride of all human glory,\" and to make \"the wisdom of the wise\" in Babylon to be seen to be comparative \"folly,\" to endow one man from the land of the prophets in the most ample manner with this knowledge, as it was important to do the same thing at the court of Pharaoh by the superior endowments of Joseph ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. God gave them knowledge—(Ex 31:2, 3; 1Ki 3:12; Job 32:8; Jas 1:5, 17).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel had understanding in … dreams—God thus made one of the despised covenant-people eclipse the Chaldean sages in the very science on which they most prided themselves. So Joseph in the court of Pharaoh (Ge 40:5; 41:1-8). Daniel, in these praises of his own \"understanding,\" speaks not through vanity, but by the direction of God, as one transported out of himself. See my [1080]Introduction, \"Contents of the Book.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " We must own ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "knowledge, and skill, and wisdom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to come from God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jam 1:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jam 1:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". These are beams of light shining in us from the Father of lights, and a man can receive nothing of this unless it be given him from above, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 3:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Object.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " But was not this magic, and was not this learning forbidden as abomination to the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 18:9-14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 18:9-14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Chaldeans used lawful arts and sciences, and unlawful; these four young men, Daniel and his companions, used only those that were lawful; rejecting all that wisdom which is sensual, carnal, and devilish, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jam 3:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jam 3:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". In all visions and dreams; not in idle, vain, and lying, but in such as were sent of God, and predictions of things to come, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 12:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 12:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", such as the prophets had. Such was that of Nebuchadnezzar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As for these four children, God gave them knowledge and skill in all learning and wisdom,.... As they prospered in their bodies, they succeeded in their studies, and improved in their minds, and became great proficients in all kind of lawful and useful knowledge; not owing so much to their own sagacity and diligence, and the goodness and ability of their teachers, as to the blessing of God on their instructions and studies; for, as all natural, so all acquired parts are to be ascribed to God; and which these were favoured with by him in a very great manner, to answer some purposes of his. This is to be understood, not of magic art, vain philosophy, judicial astrology, to which the Chaldeans were addicted; but of learning and wisdom, laudable and useful, both in things natural and political; for these men, who scrupled eating and drinking what came from the king's table, would never indulge themselves in the study of vain, curious, and unlawful knowledge; much less would God have blessed the study of such things, and still less be said to give them knowledge and skill therein: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Daniel had understanding in all visions and dreams; besides knowledge and skill in all learning and wisdom, in languages and sciences, in common with the other young men; he had the honour of seeing very remarkable visions of future things, and of interpreting dreams; and this not by rules of art, such as the Oneirocritics use, but by the gift of God; of which many singular instances follow in this book. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Daniel had understanding in all visions and dreams; besides knowledge and skill in all learning and wisdom, in languages and sciences, in common with the other young men; he had the honour of seeing very remarkable visions of future things, and of interpreting dreams; and this not by rules of art, such as the Oneirocritics use, but by the gift of God; of which many singular instances follow in this book. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As for these four children, God gave them knowledge and skill in all learning {r} and wisdom: and Daniel had understanding in all {s} visions and dreams.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As for these four children, God gave them knowledge and skill in all learning ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{r}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and wisdom: and Daniel had understanding in all ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{s}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " visions and dreams.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) Meaning in the liberal sciences, and natural knowledge, and not in the magical areas which are forbidden; De 18:11.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) So that he alone was a Prophet, and none of the others: for by dreams and visions God appeared to his Prophets; Nu 12:6",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as for these four",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "youths",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God gave them knowledge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "science",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 1:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "intelligence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "intelligent, Daniel 1:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "intelligent, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "literature",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 1:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and wisdom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘Wisdom’ is used here, in a concrete sense, of an intelligently arranged body of principles, or, as we should now say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "science",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The term must be understood as representing the popular estimate of the subjects referred to: for the ‘wisdom’ of the Chaldaean priests, except in so far as it took cognizance of the actual facts of astronomy, was in reality nothing but a systematized superstition.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and Daniel had understanding in all visions and dreams",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or, ‘in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "every kind",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of vision and dreams.’ This was a point in which Daniel excelled the rest. The words are intended as introductory to the narrative following.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "17–19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At the end of the three years (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 1:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), Daniel and his three companions are brought before the king; and being found by him to be the most proficient of all whom he had directed to be educated, are promoted to a place among his personal attendants.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As for these four children, God gave them knewledge and skill in all learning and wisdom: and Daniel had understanding in all visions and dreams",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, as the words might be more accurately rendered, \"these lads, the four of them\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:8-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This indicates that somehow they were separated off into a quaternion. In Ezekiel, where a similar phrase cecum, the four cherubim form a quaternion in a very special way. As we have already seen, the Assyrians in a feast arranged the guests in messes of four. Those thus seated together would most likely be associated in some other way. In the case of these youths, who were permanent guests at the table of the King of Babylon, they would most likely be associated in their studies from the first. The Septuagint Version omits the numeral, but is pleonastic in a way that suggests a coalescing of different readings. The rendering is, \"And to the youths the Lord gave understanding and knowledge and wisdom in the art of learning (the grammatic art - grammar), and to Daniel he gave understanding of every kind (in every word), and in visions, and in dreams, and in every kind of wisdom.\" The omission of the word \"four,\" and the insertion of two words, \"understanding\" and \"knowledge,\" suggest that the one has somehow taken the place of the other; it may be that the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עָרְמָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was read instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ארבעת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Massoretic original of the phrase, \"skill in all learning,\" may be rendered literally, \"skill in every kind of books.\" This has a special meaning in regard to the Babylonian and Assyrian books, which were clay tablets incised when wet, and burnt into permanence. Rolls of parchment were, as we see from Jeremiah, the common material for books among the Jews. Among the Egyptians, papyrus largely took the place of parchment, so the knowledge \"of every kind of books\" meant \"every language.\" It is certain that three languages were to a certain extent in use in Babylon - Aramaic, the ordinary language of business and diplomacy; Assyrian, the court language, the language in which histories and dedications were written; Accadian, the old sacred tongue, in which all the formulae of worship and the forms of incantation had been originally written. From the fact that Rabshakeh could talk Hebrew when conversing with Eliakim and Shebna, it would seem that the accomplish-merit required from a diplomat implied the knowledge of the languages of the various nations subject to the Babylonian Empire or eonterminous with it. \"Knowledge and skill in all learning and wisdom\" would seem to mean the complete eurriculum fitted to make these youths able diplomatists and wise councillors. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And Daniel had understanding in all visions and dreams.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " All the nations of antiquity laid stress on  dreams as means by which the future was revealed to men; but in no nation was there so elaborate a system of interpretation as among the Babyhmians. Lenormant ('La Divination') gives a long account, with many passages translated from their books, of their mode of interpreting dreams. \"Visions\" may be regarded as appearances of the nature of the alleged second sight among the Scottish Highlanders. It may, however, refer to appearances which are regarded as omens of good or evil fortune. We see in all the elaborate distinctions of omens preserved to us in Lenormant only the folly of superstition; but we may not assume that Daniel and his friends did not believe in them. It has been objected that if Daniel and his friends were so scrupulous in regard to the dainties and. the wines of the Babylonian monarch, because these were connected with idol-worship, they ought logically to have refused to learn these superstitious formulae. But men are never completely logical; life is wider than logic, and hence there are always elements that are left out in our calculations. The possession even of Divine inspiration would not suffer men to annul the two millennia and a half that separate us from the days of Daniel. They - Daniel and his friends - did not see in this so-called science of oneiromancy mere superstition. Still less did they recognize it as having a necessary connection with the idolatries of Babylon. In the following chapter we see the theory Daniel himself had of the matter, namely, that God used dreams as means to make known the future to men. No one can say he was mistaken in this. When Luther described heaven to his child, he filled it with what would be most happy for the little boy; he takes the child at the stage at which he is, and tells him the truth, but in limitations suited to his knowledge. May we not reasonably argue that the great Father deals so with his children? When they are in the state of knowledge that makes them expect to have his will revealed to them in dreams and omens, then he will make known his will by dreams. Daniel knew all that Chaldean science could tell him, but he saw that it was limited, that behind all the canons of interpretation there was the Eternal Mind, the Great Thinker, whose thoughts are things. In other words, he did not recognize the so-called science of Babylon, its astrology, its incantations, its omens, its interpretations of dreams as false so much as limited. It has been placed by Jerome as a parallel, that Moses was learned in all the learning of the Egyptians. Jerome assumes \"they learned not that they might follow, but that they might judge and convict (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "convincant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").\" We do not see the need of any such supposition. In their own land they in all likelihood believed in the interpretation of dreams, not unlikely in omens too in some degree. When they came to Babylon they came among a people who halt reduced all this to a form that had a delusive appearance of scientific accuracy. They could not fail to believe in all these things. Long after the latest critical date of Daniel, the Jews believed in omens and dreams. Josephus tells us of his own skill in these matters, and is still more explicit in respect to the wisdom of the Essenes in regard to the future. Students of the Talmud will not require to be told of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "bath-qol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and other means by which a knowledge of the future was derived. We must, we fear, assume that Daniel was not so far ahead of his contemporaries as not to believe in the science of Babylon, and therefore to expect him to protest against it and refuge to acquire it is absurd in the last degree. This fact of these four Hebrew youths not objecting to heathen learning is n indirect proof of the early date of Daniel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "It",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this book had been written in the days of the Maccabees, then the learning of the Chaldeans would be a synonym for the learning of the Greeks. We know that, so far from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Hasideem -",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the party from whom, by hypothesis, \"Daniel\" emanated - looking favourably on Greek learning, they hated and abhorred it. We see in the Second Book of Maccabees (4:14) the feelings with which they regarded those who favoured Greek manners; how even the innocent game of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "discus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was full of horror for them, because it was Greek (1:14); and in the first book with what horror the pious looked on the erection of a gymnasium in Jerusalem. This hatred of everything Greek was very natural, and certainly was very much in evidence in their history. For business purposes they had to know the Greek language; but the learning, the philosophy, and literature of Greece would have been to those engaged in the Maccabean struggle abomination. Is it, then, to be imagined that a writer of the Maccabean period, describing an ancient hero from whose example his contemporaries were to draw encouragement and guidance, would represent him as zealously addicting himself to the pursuit of Gentile learning, and making such progress in it that he excelled all competitors? The attitude ascribed to him would have been more like that of the Rabbi Akiba, who declared that \"Greek learning could be studied in an hour that was neither day nor night;\" or like that other rabbi, who declared that \"the translation of the Scripture into Greek was a disaster to Judaism equal in horror to the  fall of Jerusalem.\" We hear a great deal of the historic imagination and the necessity of applying it to questions of Biblical criticism. Surely the minds must be strangely deficient in the power of imaginative reconstruction who cannot feel the thrill of abhorrence of everything foreign that must have filled the Jews during the Maccabean struggle. If the critics had only realized this, they would have seen how utterly impossible it is to conceive that a religious novel, written at that time, intended to nerve the Jews for fiercer resistance to their oppressors, should represent the hero complacently acquiring Gentile learning, and acting the submissive courtier in the tyrant's palace. Daniel 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The progress of the young men in the wisdom of the Chaldeans, and their appointment to the service of the king.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As God blessed the resolution of Daniel and his three friends that they would not defile themselves by the food, He also blessed the education which they received in the literature (ספר, Daniel 1:17 as Daniel 1:4) and wisdom of the Chaldeans, so that the whole four made remarkable progress therein. But besides this, Daniel obtained an insight into all kinds of visions and dreams, i.e., he attained great readiness in interpreting visions and dreams. This is recorded regarding him because of what follows in this book, and is but a simple statement of the fact, without any trace of vainglory. Instruction in the wisdom of the Chaldeans was, besides, for Daniel and his three friends a test of their faith, since the wisdom of the Chaldeans, from the nature of the case, was closely allied to the Chaldean idolatry and heathen superstition, which the learners of this wisdom might easily be led to adopt. But that Daniel and his friends learned only the Chaldean wisdom without adopting the heathen element which was mingled with it, is evidenced from the stedfastness in the faith with which at a later period, at the danger of their lives (cf. Daniel 3:6), they stood aloof from all participation in idolatry, and in regard to Daniel in particular, from the deep glance into the mysteries of the kingdom of God which lies before us in his prophecies, and bears witness of the clear separation between the sacred and the profane. But he needed to be deeply versed in the Chaldean wisdom, as formerly Moses was in the wisdom of Egypt (Acts 7:22), so as to be able to put to shame the wisdom of this world by the hidden wisdom of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As God blessed the resolution of Daniel and his three friends that they would not defile themselves by the food, He also blessed the education which they received in the literature (ספר, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and wisdom of the Chaldeans, so that the whole four made remarkable progress therein. But besides this, Daniel obtained an insight into all kinds of visions and dreams, i.e., he attained great readiness in interpreting visions and dreams. This is recorded regarding him because of what follows in this book, and is but a simple statement of the fact, without any trace of vainglory. Instruction in the wisdom of the Chaldeans was, besides, for Daniel and his three friends a test of their faith, since the wisdom of the Chaldeans, from the nature of the case, was closely allied to the Chaldean idolatry and heathen superstition, which the learners of this wisdom might easily be led to adopt. But that Daniel and his friends learned only the Chaldean wisdom without adopting the heathen element which was mingled with it, is evidenced from the stedfastness in the faith with which at a later period, at the danger of their lives (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), they stood aloof from all participation in idolatry, and in regard to Daniel in particular, from the deep glance into the mysteries of the kingdom of God which lies before us in his prophecies, and bears witness of the clear separation between the sacred and the profane. But he needed to be deeply versed in the Chaldean wisdom, as formerly Moses was in the wisdom of Egypt (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), so as to be able to put to shame the wisdom of this world by the hidden wisdom of God.",
            "children": []
          }
        ]
      }
    ]
  }
]