[{"num":16,"verse":"“Always remember to celebrate the Passover during the month of April, for that was when Jehovah your God brought you out of Egypt by night. "},{"num":2,"verse":"Your Passover sacrifice shall be either a lamb or an ox, sacrificed to the Lord your God at his sanctuary. "},{"num":3,"verse":"Eat the sacrifice with unleavened bread. Eat unleavened bread for seven days as a reminder of the bread you ate as you escaped from Egypt. This is to remind you that you left Egypt in such a hurry that there was no time for the bread to rise. Remember that day all the rest of your lives! "},{"num":4,"verse":"For seven days no trace of yeast shall be in your homes, and none of the Passover lamb shall be left until the next morning."},{"num":5,"verse":"“The Passover is not to be eaten in your homes. "},{"num":6,"verse":"It must be eaten at the place the Lord shall choose as his sanctuary. Sacrifice it there on the anniversary evening just as the sun goes down. "},{"num":7,"verse":"Roast the lamb and eat it, then start back to your homes the next morning. "},{"num":8,"verse":"For the following six days you shall eat no bread made with yeast. On the seventh day there shall be a quiet gathering of the people of each city before the Lord your God. Don’t do any work that day."},{"num":9,"verse":"“Seven weeks after the harvest begins, "},{"num":10,"verse":"there shall be another festival before the Lord your God called the Festival of Weeks. At that time bring to him a freewill offering proportionate in size to his blessing upon you as judged by the amount of your harvest. "},{"num":11,"verse":"It is a time to rejoice before the Lord with your family and household. And don’t forget to include the local Levites, foreigners, widows, and orphans. Invite them to accompany you to the celebration at the sanctuary. "},{"num":12,"verse":"Remember! You were a slave in Egypt, so be sure to carry out this command."},{"num":13,"verse":"“Another celebration, the Festival of Shelters, must be observed for seven days at the end of the harvest season, after the grain is threshed and the grapes have been pressed. "},{"num":14,"verse":"This will be a happy time of rejoicing together with your family and servants. And don’t forget to include the Levites, foreigners, orphans, and widows of your town."},{"num":15,"verse":"“This feast will be held at the sanctuary, which will be located at the place the Lord will designate. It is a time of deep thanksgiving to the Lord for blessing you with a good harvest and in so many other ways; it shall be a time of great joy."},{"num":16,"verse":"“Every man in Israel shall appear before the Lord your God three times a year at the sanctuary for these festivals:"},{"num":17,"verse":"Give as you are able, according as the Lord has blessed you."},{"num":18,"verse":"“Appoint judges and administrative officials for all the cities the Lord your God is giving you. They will administer justice in every part of the land. "},{"num":19,"verse":"Never twist justice to benefit a rich man, and never accept bribes. For bribes blind the eyes of the wisest and corrupt their decisions. "},{"num":20,"verse":"Justice must prevail."},{"num":21,"verse":"“Never, under any circumstances, are you to erect shameful images beside the altar of the Lord your God. "},{"num":22,"verse":"And never set up stone pillars to worship them, for the Lord hates them!"}]