[{"num":13,"verse":"14 Amnon David’s son defileth his sister Tamar.  20 Tamar is comforted by her brother Absalom.  29 Absalom therefore killeth Amnon."},{"num":1,"verse":"Now after this, so it was, that Absalom the son of David having a fair sister, whose name was Tamar, Amnon the son of David loved her."},{"num":2,"verse":"And Amnon was so sore vexed, that he fell sick for his sister Tamar: for she was a virgin, and it seemed hard to Amnon to do anything to her."},{"num":3,"verse":"But Amnon had a friend called Jonadab, the son of Shimeah David’s brother: and Jonadab was a very subtle man,"},{"num":4,"verse":"Who said unto him, Why art thou the king’s son, so lean from day to day? wilt thou not tell me? Then Amnon answered him, I love Tamar my brother Absalom’s sister."},{"num":5,"verse":"And Jonadab said unto him, Lie down on thy bed, and make thyself sick: and when thy father shall come to see thee, say unto him, I pray thee let my sister Tamar come, and give me meat, and let her dress meat in my sight, that I may see it, and eat it of her hand."},{"num":6,"verse":"¶ So Amnon lay down, and made himself sick: and when the king came to see him, Amnon said unto the king, I pray thee, let Tamar my sister come, and make me a couple of cakes in my sight, that I may receive meat at her hand."},{"num":7,"verse":"Then David sent home to Tamar, saying, Go now to thy brother Amnon’s house, and dress him meat."},{"num":8,"verse":"¶ So Tamar went to her brother Amnon’s house, and he lay down: and she took flour, and knead it, and made cakes in his sight, and did bake the cakes."},{"num":9,"verse":"And she took a pan, and poured them out before him, but he would not eat. Then Amnon said, Cause ye every man to go out from me: so every man went out from him."},{"num":10,"verse":"Then Amnon said unto Tamar, Bring the meat into the chamber, that I may eat of thine hand. And Tamar took the cakes which she had made, and brought them into the chamber to Amnon her brother."},{"num":11,"verse":"And when she had set them before him to eat, he took her, and said unto her, Come, lie with me, my sister."},{"num":12,"verse":"But she answered him, Nay, my brother, do not force me: for no such thing ought to be done in Israel: commit not this folly."},{"num":13,"verse":"And I, whither shall I cause my shame to go? and thou shalt be as one of the fools in Israel: now therefore, I pray thee speak to the king, for he will not deny me unto thee."},{"num":14,"verse":"Howbeit he would not hearken unto her voice, but being stronger than she, forced her, and lay with her."},{"num":15,"verse":"Then Amnon hated her exceedingly, so that the hatred wherewith he hated her, was greater than the love wherewith he had loved her: and Amnon said unto her, Up, get thee hence."},{"num":16,"verse":"And she answered him, There is no cause: this evil (to put me away) is greater than the other that thou didst unto me: but he would not hear her,"},{"num":17,"verse":"But called his servant that served him, and said, Put this woman now out from me, and lock the door after her."},{"num":18,"verse":"(And she had a garment of diverse colors upon her: for with such garments were the King’s daughters that were virgins, appareled) Then his servant brought her out, and locked the door after her."},{"num":19,"verse":"And Tamar put ashes on her head, and rent the garment of diverse colors which was on her, and laid her hand on her head, and went her way crying."},{"num":20,"verse":"And Absalom her brother said unto her, Hath Amnon thy brother been with thee? Now yet be still, my sister: he is thy brother: let not this thing grieve thine heart. So Tamar remained desolate in her brother Absalom’s house."},{"num":21,"verse":"¶ But when King David heard all these things, he was very wroth."},{"num":22,"verse":"And Absalom said unto his brother Amnon neither good nor bad: for Absalom hated Amnon, because he had forced his sister Tamar."},{"num":23,"verse":"¶ And after the time of two years, Absalom had sheepshearers in Baal Hazor, which is beside Ephraim, and Absalom called all the king’s sons."},{"num":24,"verse":"And Absalom came to the King, and said, Behold now, thy servant hath sheepshearers: I pray thee, that the king with his servants would go with thy servant."},{"num":25,"verse":"But the King answered Absalom, Nay my son, I pray thee, let us not go all, lest we be chargeable unto thee. Yet Absalom lay sore upon him: howbeit he would not go, but thanked him."},{"num":26,"verse":"Then said Absalom, But, I pray thee, shall not my brother Amnon go with us? And the king answered him, Why should he go with thee?"},{"num":27,"verse":"But Absalom was instant upon him, and he sent Amnon with him, and all the king’s children."},{"num":28,"verse":"¶ Now had Absalom commanded his servants, saying, Mark now when Amnon’s heart is merry with wine, and when I say unto you, Smite Amnon, kill him, fear not, for have not I commanded you? be bold therefore, and play the men."},{"num":29,"verse":"And the servants of Absalom did unto Amnon, as Absalom had commanded: and all the king’s sons arose, and every man got him up upon his mule, and fled."},{"num":30,"verse":"¶ And while they were in the way, tidings came to David, saying, Absalom hath slain all the King’s sons, and there is not one of them left."},{"num":31,"verse":"Then the king arose, and tore his garments, and lay on the ground, and all his servants stood by with their clothes rent."},{"num":32,"verse":"And Jonadab the son of Shimeah David’s brother answered and said, Let not my lord suppose that they have slain all the young men the King’s sons: for Amnon only is dead, because Absalom had reported so, since he forced his sister Tamar."},{"num":33,"verse":"Now therefore let not my lord the King take the thing so grievously; to think that all the King’s sons are dead: for Amnon only is dead."},{"num":34,"verse":"¶ Then Absalom fled: and the young man that kept the watch, lift up his eyes, and looked, and behold, there came much people by the way of the hill side behind him."},{"num":35,"verse":"And Jonadab said unto the king, Behold, the king’s sons come: as thy servant said, so it is."},{"num":36,"verse":"And as soon as he had left speaking, behold, the king’s sons came, and lift up their voices, and wept: and the king also and all his servants wept exceedingly sore."},{"num":37,"verse":"But Absalom fled away, and went to Talmai the son of Ammihud king of Geshur: and David mourned for his son every day."},{"num":38,"verse":"So Absalom fled, and went to Geshur, and was there three years."},{"num":39,"verse":"And king David desired to go forth unto Absalom, because he was pacified concerning Amnon, seeing he was dead."}]