[{"header":"The Gibeonite Trickery"},{"num":9,"verse":"All the kings west of the Jordan River heard about these things. These were the kings of the Hittites, Amorites, Canaanites, Perizzites, Hivites and Jebusites. They lived in the mountains and on the western mountain slopes. They also lived along the whole Mediterranean Sea coast. "},{"num":2,"verse":"All these kings gathered to fight Joshua and the Israelites."},{"num":3,"verse":"The people of Gibeon heard how Joshua had defeated Jericho and Ai. "},{"num":4,"verse":"So they decided to trick the Israelites. They gathered old leather wine bags that were cracked and mended. They put them on the backs of their donkeys. They also put old sacks on their donkeys. "},{"num":5,"verse":"The men put old sandals on their feet and wore old clothes. They took some dry, moldy bread. "},{"num":6,"verse":"Then they went to Joshua in the camp near Gilgal."},{"num":7,"verse":"The men of Israel said to these Hivites, “Maybe you live near us. How can we make a peace agreement with you?”"},{"num":8,"verse":"The Hivites said to Joshua, “We are your servants.”"},{"num":9,"verse":"The men answered, “We are your servants. We have come from a far country. We came because we heard of the fame of the Lord your God. We heard about what he has done. We heard about everything he did in Egypt. "},{"num":10,"verse":"We heard that he defeated the two kings of the Amorites. They were from the east side of the Jordan River: Sihon king of Heshbon and Og king of Bashan who was king in Ashtaroth. "},{"num":11,"verse":"So our elders and our people spoke to us. They said, ‘Take food for your journey. Go and meet the Israelites. Tell them, “We are your servants. Make a peace agreement with us.”’"},{"num":12,"verse":"“Look at our bread. When we left home it was warm and fresh. But now it is dry and moldy. "},{"num":13,"verse":"Look at our leather winebags. When we left home they were new and filled with wine. Now they are cracked and old. Look at our clothes and sandals. The long journey has almost destroyed them.”"},{"num":14,"verse":"The men of Israel tasted the bread. But they did not ask the Lord what to do. "},{"num":15,"verse":"So Joshua agreed to make peace with the Gibeonites. He agreed to let them live. The leaders of the Israelites made a promise to keep the agreement."},{"num":16,"verse":"Three days later the Israelites learned that the Gibeonites lived nearby. "},{"num":17,"verse":"So the Israelites went to where they lived. On the third day the Israelites came to their cities. The cities were Gibeon, Kephirah, Beeroth and Kiriath Jearim. "},{"num":18,"verse":"But the Israelites did not attack those cities. They had made a promise to them before the Lord, the God of Israel."},{"num":19,"verse":"But the leaders answered, “We have given our promise before the Lord, the God of Israel. We cannot attack them now. "},{"num":20,"verse":"This is what we must do. We must let them live. We cannot hurt them, or God’s anger will be against us. We would be breaking the promise we made to them. "},{"num":21,"verse":"So let them live. But they will cut wood and carry water for our people.” So the leaders kept their promise of peace to them."},{"num":22,"verse":"Joshua called for the Gibeonites. He said, “Why did you lie to us? Your land was near our camp. But you told us you were from a far country. "},{"num":23,"verse":"Now, you will be placed under a curse. You will be our slaves. You will have to cut wood and carry water for the people of the house of God.”"},{"num":24,"verse":"The Gibeonites answered Joshua, “We lied to you because we were afraid you would kill us. We heard that God commanded his servant Moses to give you all of this land. And God told you to kill all the people who lived in the land. That is why we did this. "},{"num":25,"verse":"Now you can decide what to do with us. You can do anything to us that you think is right.”"},{"num":26,"verse":"So Joshua saved their lives. He did not allow the Israelites to kill them. "},{"num":27,"verse":"But Joshua made the Gibeonites slaves to the Israelites. They cut wood and carried water for the Israelites. And they did it for the altar of the Lord—wherever he chose it to be. They are still doing this today."}]