[[],[{"type":"header","content":"Deception by the Gibeonites"},{"type":"prose","content":"Now it came about when all the kings who were beyond the Jordan, in the hill country, the lowland, and on all the coast of the Great Sea toward Lebanon, the Hittite and the Amorite, the Canaanite, the Perizzite, the Hivite, and the Jebusite, heard about it,"}],[{"type":"prose","content":"that they met together with one purpose, to fight with Joshua and with Israel."}],[{"type":"prose","content":"The inhabitants of Gibeon also heard what Joshua had done to Jericho and to Ai,"}],[{"type":"prose","content":"but they on their part acted craftily and went and took provisions for a journey, and took worn-out sacks on their donkeys, and wineskins  worn out, split open, and patched,"}],[{"type":"prose","content":"and worn-out and patched sandals on their feet, and worn-out clothes on themselves; and all the bread of their provision was dry  had become crumbled."}],[{"type":"prose","content":"And they went to Joshua at the camp at Gilgal and said to him and to the men of Israel, “We have come from a far country; now then, make a covenant with us.”"}],[{"type":"prose","content":"But the men of Israel said to the Hivites, “Perhaps you are living within our land; how then are we to make a covenant with you?”"}],[{"type":"prose","content":"So they said to Joshua, “We are your servants.” Then Joshua said to them, “Who are you and where do you come from?”"}],[{"type":"prose","content":"They said to him, “Your servants have come from a very distant country because of the fame of the  your God; for we have heard the report about Him and all that He did in Egypt,"}],[{"type":"prose","content":"and all that He did to the two kings of the Amorites who were beyond the Jordan, to Sihon king of Heshbon and to Og king of Bashan who was in Ashtaroth."}],[{"type":"prose","content":"So our elders and all the inhabitants of our country spoke to us, saying, ‘Take provisions in your hand for the journey, and go to meet them, and say to them, “We are your servants; now then, make a covenant with us.”’"}],[{"type":"prose","content":"This bread of ours  hot  we took it for our provisions from our houses on the day that we left to come to you; but now behold, it is dry and has become crumbled."}],[{"type":"prose","content":"And these wineskins which we filled were new, and behold, they are split open; and these clothes of ours and our sandals are worn out from the very long journey.”"}],[{"type":"prose","content":"So the men  took some of their provisions, and did not ask for the counsel of the ."}],[{"type":"prose","content":"And Joshua made peace with them and made a covenant with them, to let them live; and the leaders of the congregation swore  to them."}],[{"type":"prose","content":"However, it came about at the end of three days after they had made a covenant with them, that they heard that they were neighbors and that they were living within their land."}],[{"type":"prose","content":"Then the sons of Israel set out and came to their cities on the third day. Now their cities  Gibeon, Chephirah, Beeroth, and Kiriath-jearim."}],[{"type":"prose","content":"But the sons of Israel did not attack them because the leaders of the congregation had sworn to them by the , the God of Israel. And the whole congregation grumbled against the leaders."}],[{"type":"prose","content":"But all the leaders said to the whole congregation, “We have sworn to them by the , the God of Israel, and now we cannot touch them."}],[{"type":"prose","content":"This we will do to them, even let them live, so that wrath will not be on us because of the oath which we swore to them.”"}],[{"type":"prose","content":"So the leaders said to them, “Let them live.” And they became gatherers of firewood and labor to draw water for the whole congregation, just as the leaders had spoken to them."}],[{"type":"prose","content":"Then Joshua called for them and spoke to them, saying, “Why have you deceived us, saying, ‘We are very far from you,’ when you are living within our land?"}],[{"type":"prose","content":"Now therefore, you are cursed, and you will never cease to be slaves, both gatherers of firewood and labor to draw water for the house of my God.”"}],[{"type":"prose","content":"So they answered Joshua and said, “Since your servants were fully informed that the  your God had commanded His servant Moses to give you all the land, and to destroy all the inhabitants of the land before you, we feared greatly for our lives because of you, and did this thing."}],[{"type":"prose","content":"And now behold, we are in your hands; do to us as it seems good and right in your sight to do.”"}],[{"type":"prose","content":"This he did to them, and saved them from the hands of the sons of Israel, and they did not kill them."}],[{"type":"prose","content":"But on that day Joshua made them gatherers of firewood and labor to draw water for the congregation and for the altar of the , to this day, in the place which He would choose."}]]