[{"header":"The Gibeonite Trickery"},{"num":9,"verse":"All the kings west of the Jordan River heard about these things: the kings of the Hittites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites. They lived in the mountains and on the western hills and along the whole Mediterranean Sea coast. "},{"num":2,"verse":"So all these kings gathered to fight Joshua and the Israelites."},{"num":3,"verse":"When the people of Gibeon heard how Joshua had defeated Jericho and Ai, "},{"num":4,"verse":"they decided to trick the Israelites. They gathered old sacks and old leather wine bags that were cracked and mended, and they put them on the backs of their donkeys. "},{"num":5,"verse":"They put old sandals on their feet and wore old clothes, and they took some dry, moldy bread. "},{"num":6,"verse":"Then they went to Joshua in the camp near Gilgal."},{"num":7,"verse":"The Israelites said to these Hivites, “Maybe you live near us. How can we make a peace agreement with you?”"},{"num":8,"verse":"The Hivites said to Joshua, “We are your servants.”"},{"num":9,"verse":"The men answered, “We are your servants who have come from a far country, because we heard of the fame of the Lord your God. We heard about what he has done and everything he did in Egypt. "},{"num":10,"verse":"We heard that he defeated the two kings of the Amorites from the east side of the Jordan River—Sihon king of Heshbon and Og king of Bashan who ruled in Ashtaroth. "},{"num":11,"verse":"So our elders and our people said to us, ‘Take food for your journey and go and meet the Israelites. Tell them, “We are your servants. Make a peace agreement with us.”’"},{"num":12,"verse":"“Look at our bread. On the day we left home to come to you it was warm and fresh, but now it is dry and moldy. "},{"num":13,"verse":"Look at our leather wine bags. They were new and filled with wine, but now they are cracked and old. Our clothes and sandals are worn out from the long journey.”"},{"num":14,"verse":"The men of Israel tasted the bread, but they did not ask the Lord what to do. "},{"num":15,"verse":"So Joshua agreed to make peace with the Gibeonites and to let them live. And the leaders of the Israelites swore an oath to keep the agreement."},{"num":16,"verse":"Three days after they had made the agreement, the Israelites learned that the Gibeonites lived nearby. "},{"num":17,"verse":"So the Israelites went to where they lived and on the third day came to their cities: Gibeon, Kephirah, Beeroth, and Kiriath Jearim. "},{"num":18,"verse":"But the Israelites did not attack those cities, because they had made a promise to them before the Lord, the God of Israel."},{"num":19,"verse":"But the leaders answered, “We have given our promise before the Lord, the God of Israel, so we cannot attack them now. "},{"num":20,"verse":"This is what we must do. We must let them live. Otherwise, God’s anger will be against us for breaking the oath we swore to them. "},{"num":21,"verse":"So let them live, but they will cut wood and carry water for our people.” So the leaders kept their promise to them."},{"num":22,"verse":"Joshua called for the Gibeonites and asked, “Why did you lie to us? Your land was near our camp, but you told us you were from a far country. "},{"num":23,"verse":"Now, you will be placed under a curse to be our slaves. You will have to cut wood and carry water for the house of my God.”"},{"num":24,"verse":"The Gibeonites answered Joshua, “We lied to you because we were afraid you would kill us. We heard that the Lord your God commanded his servant Moses to give you all of this land and to kill all the people who lived in it. That is why we did this. "},{"num":25,"verse":"Now you can decide what to do with us, whatever you think is right.”"},{"num":26,"verse":"So Joshua saved their lives by not allowing the Israelites to kill them, "},{"num":27,"verse":"but he made the Gibeonites slaves. They cut wood and carried water for the Israelites, and they did it for the altar of the Lord—wherever he chose it to be. They are still doing this today."}]