[[],[{"type":"header","content":"The People Complain"},{"type":"prose","content":"Now the people became like those who complain  whine about their hardships, and the  heard it; and when the  heard it, His anger was kindled, and the fire of the  burned among them and devoured those in the outlying parts of the camp. "}],[{"type":"prose","content":"So the people cried out to Moses, and when Moses prayed to the , the fire died out. "}],[{"type":"prose","content":"He named that place Taberah (the place of burning), because the fire of the  burned among them."}],[{"type":"prose","content":"The rabble among them [who followed Israel from Egypt] had greedy desires [for familiar and delicious food], and the Israelites wept again and said, “Who will give us meat to eat? "}],[{"type":"prose","content":"We remember the fish we ate freely  without cost in Egypt, the cucumbers, melons, leeks, onions, and garlic. "}],[{"type":"prose","content":"But now our appetite is gone; there is nothing at all [in the way of food] to be seen but this manna.”"}],[{"type":"prose","content":"The manna was like coriander seed, and it looked like bdellium. "}],[{"type":"prose","content":"The people went about and gathered it, and ground it in mills or beat it in mortars, and boiled it in pots, and made cakes with it; and it tasted like cakes baked with fresh [olive] oil. "}],[{"type":"prose","content":"When the dew fell on the camp at night, the manna fell with it."},{"type":"header","content":"The Complaint of Moses"}],[{"type":"prose","content":"Now Moses heard the people weeping [in self-pity] throughout their families, every man at the doorway of his tent; and the anger of the  blazed hotly, and Moses regarded their behavior as evil. "}],[{"type":"prose","content":"So Moses said to the , “Why have You been so hard on Your servant? And why have I not found favor in Your sight, that You have placed the burden of all these people on me? "}],[{"type":"prose","content":"Was it I who conceived all these people? Was it I who brought them forth, that You should say to me, ‘Carry them in your arms as a nurse carries the nursing infant, to the land which You swore to their fathers’? "}],[{"type":"prose","content":"Where am I to get meat to give to all these people? For they weep before me and say, ‘Give us meat, so that we may eat.’ "}],[{"type":"prose","content":"I am not able to carry all these people alone, because the burden is too heavy for me. "}],[{"type":"prose","content":"So if this is the way You are going to deal with me, please kill me at once, if I have found favor in your sight, and do not let me see my wretchedness.”"},{"type":"header","content":"Seventy Elders to Assist"}],[{"type":"prose","content":"Accordingly, the  said to Moses, “Gather for Me seventy men from among the elders of Israel whom you know to be the elders of the people and their officers; bring them to the Tent of Meeting (tabernacle) and let them stand there with you. "}],[{"type":"prose","content":"Then I will come down and speak with you there, and I will take away some of the Spirit who is upon you, and will put  upon them; and they shall bear the burden of the people with you, so that you will not have to bear it all alone. "}],[{"type":"prose","content":"Say to the people, ‘Consecrate (separate as holy) yourselves for tomorrow, and you shall eat meat; for you have wept [in self-pity] in the ears of the , saying, “Who will give us meat to eat? For we were well-off in Egypt.” Therefore the  will give you meat, and you shall eat. "}],[{"type":"prose","content":"You shall eat, not one day, nor two days, nor five days, nor ten days, nor twenty days, "}],[{"type":"prose","content":"but a whole month—until it comes out of your nostrils and is disgusting to you—because you have rejected  despised the  who is among you, and have wept [in self-pity] before Him, saying, “Why did we come out of Egypt?”’” "}],[{"type":"prose","content":"But Moses said, “The people, among whom I am, are 600,000 [fighting men] on foot [besides all the women and children]; yet You have said, ‘I will give them meat, so that they may eat it for a whole month!’ "}],[{"type":"prose","content":"Should flocks and herds be slaughtered for them, to be sufficient for them? Or should all the fish of the sea be collected for them to be sufficient for them?” "}],[{"type":"prose","content":"The  said to Moses, “Is the  hand (ability, power) limited (short, inadequate)? You shall see now whether My word will come to pass for you or not.”"}],[{"type":"prose","content":"So Moses went out and spoke to the people the words of the , and he gathered seventy men from among the elders of the people and stationed them around the Tent (tabernacle). "}],[{"type":"prose","content":"Then the  came down in the cloud and spoke to him; and He took some of the Spirit who was upon Moses and put  upon the seventy elders. When the Spirit rested upon them, they prophesied [praising God and declaring His will], but they did not do it again."}],[{"type":"prose","content":"But two men had remained in the camp; one named Eldad and the other named Medad. The Spirit rested upon them now they were among those who had been registered, but had not gone out to the Tent, and they prophesied in the camp. "}],[{"type":"prose","content":"So a young man ran and told Moses and said, “Eldad and Medad are prophesying [extolling the praises of God and declaring His will] in the camp.” "}],[{"type":"prose","content":"Then Joshua the son of Nun, the attendant of Moses from his youth, said, “My lord Moses, stop them!” "}],[{"type":"prose","content":"But Moses said to him, “Are you jealous for my sake? Would that all the  people were prophets and that the  would put His Spirit upon them!” "}],[{"type":"prose","content":"Then Moses went back into the camp, he and the elders of Israel."},{"type":"header","content":"The Quail and the Plague"}],[{"type":"prose","content":"Now there went forth a wind from the  and it brought quails from the sea, and let  fall [so they flew low] beside the camp, about a day’s journey on this side and on the other side, all around the camp, about two cubits (three feet)  on the surface of the ground. "}],[{"type":"prose","content":"The people spent all that day and all night and all the next day and caught  gathered the quail the one who gathered least gathered ten homers and they spread them out for themselves around the camp [to cure them by drying]. "}],[{"type":"prose","content":"While the meat was still between their teeth, before it was chewed, the anger of the  was kindled against the people, and the  struck them with a very severe plague. "}],[{"type":"prose","content":"So that place was named Kibroth-hattaavah (the graves of greediness), because there they buried the people who had been greedy [for more than the manna that God provided them]. "}],[{"type":"prose","content":"From Kibroth-hattaavah the people set out for Hazeroth, and they remained at Hazeroth."}]]