[{"num":11,"verse":"1 The people murmureth, and is punished with fire. 4 The people lusteth after flesh. 6 They loathe Manna. 11 The weak faith of Moses. 16 The Lord divided the burden of Moses to seventy of the Ancients. 31 The Lord sendeth quails. 33 Their lust is punished."},{"num":1,"verse":"When the people became murmurers, it displeased the Lord: and the Lord heard it, therefore his wrath was kindled, and the fire of the Lord burnt among them, and consumed the utmost part of the host."},{"num":2,"verse":"Then the people cried unto Moses: and when Moses prayed unto the Lord, the fire was quenched."},{"num":3,"verse":"And he called the name of the place Taberah, because the fire of the Lord burnt among them."},{"num":4,"verse":"¶ And a number of people that was among them, fell a lusting, and turned away, and the children of Israel also wept, and said, Who shall give us flesh to eat?"},{"num":5,"verse":"We remember the fish which we did eat in Egypt for nought, the cucumbers, and the pepons, and the leeks, and the onions, and the garlic."},{"num":6,"verse":"But now our soul is dried away, we can see nothing but this Manna."},{"num":7,"verse":"(The Manna also was as coriander seed, and his color like the color of bdellium."},{"num":8,"verse":"The people went about and gathered, and ground it in mills, or beat it in mortars, and baked it in a cauldron, and made cakes of it, and the taste of it was like unto the taste of fresh oil."},{"num":9,"verse":"And when the dew fell down upon the host in night, the Manna fell with it.)"},{"num":10,"verse":"¶ Then Moses heard the people weep throughout their families, every man in the door of his tent, and the wrath of the Lord was grievously kindled: also Moses was grieved."},{"num":11,"verse":"And Moses said unto the Lord, Wherefore hast thou vexed thy servant? and why have I not found favor in thy sight, seeing thou hast put the charge of all this people upon me?"},{"num":12,"verse":"Have I conceived all this people? or have I begotten them, that thou shouldest say unto me, Carry them in thy bosom (as a nurse beareth the sucking child) unto the land, for the which thou swarest unto their fathers?"},{"num":13,"verse":"Where should I have flesh to give unto all this people? for they weep unto me, saying, Give us flesh that we may eat."},{"num":14,"verse":"I am not able to bear all this people alone, for it is too heavy for me."},{"num":15,"verse":"Therefore if thou deal thus with me, I pray thee, if I have found favor in thy sight, kill me, that I behold not my misery."},{"num":16,"verse":"¶ Then the Lord said unto Moses, Gather unto me seventy men of the Elders of Israel, whom thou knowest, that they are the Elders of the people, and governors over them, and bring them unto the Tabernacle of the Congregation, and let them stand there with thee."},{"num":17,"verse":"And I will come down, and talk with thee there, and take of the Spirit, which is upon thee, and put upon them, and they shall bear the burden of the people with thee: so thou shalt not bear it alone."},{"num":18,"verse":"Furthermore thou shalt say unto the people, Be sanctified against tomorrow, and ye shall eat flesh: for you have wept in the ears of the Lord, saying, Who shall give us flesh to eat? for we were better in Egypt: therefore the Lord will give you flesh, and ye shall eat."},{"num":19,"verse":"Ye shall not eat one day nor two days, nor five days, neither ten days, nor twenty days,"},{"num":20,"verse":"But a whole month, until it come out at your nostrils, and be loathsome unto you, because ye have contemned the Lord, which is among you, and have wept before him, saying, Why came we hither out of Egypt?"},{"num":21,"verse":"And Moses said, Six hundred thousand footmen are there of the people, among whom I am: and thou sayest, I will give them flesh, that they may eat a month long."},{"num":22,"verse":"Shall the sheep and the beeves be slain for them to find them? either shall all the fish of the Sea be gathered together for them to suffice them?"},{"num":23,"verse":"And the Lord said unto Moses, Is the Lord’s hand shortened? thou shalt see now whether my word shall come to pass unto thee, or no."},{"num":24,"verse":"¶ So Moses went out, and told the people the words of the Lord, and gathered seventy men of the Elders of the people, and set them round about the Tabernacle."},{"num":25,"verse":"Then the Lord came down in a cloud, and spake unto him, and took of the Spirit that was upon him, and put it upon the seventy Ancient men: and when the Spirit rested upon them, then they prophesied, and did not cease."},{"num":26,"verse":"But there remained two of the men in the host: the name of the one was Eldad, and the name of the other Medad, and the Spirit rested upon them, (for they were of them that were written, and went not out unto the Tabernacle) and they prophesied in the host."},{"num":27,"verse":"Then there ran a young man, and told Moses, and said, Eldad and Medad do prophesy in the host."},{"num":28,"verse":"And Joshua the son of Nun the servant of Moses one of his young men answered and said, My lord Moses, forbid them."},{"num":29,"verse":"But Moses said unto him, Enviest thou for my sake? yea, would God that all the Lord’s people were Prophets, and that the Lord would put his spirit upon them."},{"num":30,"verse":"And Moses returned into the host, he and the Elders of Israel."},{"num":31,"verse":"Then there went forth a wind from the Lord, and brought quails from the sea, and let them fall upon the camp, a day’s journey on this side, and a day’s journey on the other side, round about the host, and they were about two cubits above the earth."},{"num":32,"verse":"Then the people arose, all that day, and all the night, and all the next day, and gathered the quails: he that gathered the least, gathered ten Homers full, and they spread them abroad for their use round about the host."},{"num":33,"verse":"While the flesh was yet between their teeth, before it was chewed, even the wrath of the Lord was kindled against the people, and the Lord smote the people with an exceeding great plague."},{"num":34,"verse":"So the name of the place was called, Kibroth Hattaavah: for there they buried the people that fell a lusting."},{"num":35,"verse":"From Kibroth Hattaavah the people took their journey to Hazeroth, and abode at Hazeroth."}]