[[],[{"type":"header","content":"The People Complain"},{"type":"prose","content":"Now the people became like those who complain of adversity in the ears of the ; and the  heard  and His anger was kindled, and the fire of the  burned among them and consumed  at the outskirts of the camp."}],[{"type":"prose","content":"The people then cried out to Moses; and Moses prayed to the , and the fire died out."}],[{"type":"prose","content":"So that place was named Taberah, because the fire of the  burned among them."}],[{"type":"prose","content":"Now the rabble who were among them had greedy cravings; and the sons of Israel also wept again and said, “Who will give us meat to eat?"}],[{"type":"prose","content":"We remember the fish which we used to eat for free in Egypt, the cucumbers, the melons, the leeks, the onions, and the garlic;"}],[{"type":"prose","content":"but now our appetite is gone. There is nothing at all to look at except this manna!”"}],[{"type":"prose","content":"Now the manna was like coriander seed, and its appearance like that of bdellium."}],[{"type":"prose","content":"The people would roam about and gather  and grind  between two millstones, or pound  in the mortar, and boil  in the pot and make loaves with it; and its taste was like the taste of cake  oil."}],[{"type":"prose","content":"When the dew came down on the camp at night, the manna would come down with it."},{"type":"header","content":"The Complaint of Moses"}],[{"type":"prose","content":"Now Moses heard the people weeping throughout their families, each one at the entrance of his tent; and the anger of the  became very hot, and Moses was displeased."}],[{"type":"prose","content":"So Moses said to the , “Why have You been so hard on Your servant? And why have I not found favor in Your sight, that You have put the burden of all this people on me?"}],[{"type":"prose","content":"Was it I who conceived all this people? Or did I give birth to them, that You should say to me, ‘Carry them in your arms, as a nurse carries a nursing infant, to the land which You swore to their fathers’?"}],[{"type":"prose","content":"Where am I to get meat to give to all this people? For they weep before me, saying, ‘Give us meat so that we may eat!’"}],[{"type":"prose","content":"I am not able to carry all this people by myself, because it is too burdensome for me."}],[{"type":"prose","content":"So if You are going to deal with me this way, please kill me now, if I have found favor in Your sight, and do not let me see my misery.”"},{"type":"header","content":"Seventy Elders to Assist Moses"}],[{"type":"prose","content":"The  therefore said to Moses, “Gather for Me seventy men from the elders of Israel, whom you know to be the elders of the people and their officers, and bring them to the tent of meeting, and have them take their stand there with you."}],[{"type":"prose","content":"Then I will come down and speak with you there, and I will take away some of the Spirit who is upon you, and put  upon them; and they shall bear the burden of the people with you, so that you will not bear  by yourself."}],[{"type":"prose","content":"And you shall say to the people, ‘Consecrate yourselves for tomorrow, and you shall eat meat; for you have wept in the ears of the , saying, “Oh that someone would give us meat to eat! For we were well-off in Egypt.” Therefore the  will give you meat and you shall eat."}],[{"type":"prose","content":"You shall eat, not one day, nor two days, nor five days, nor ten days, nor twenty days,"}],[{"type":"prose","content":"but for a whole month, until it comes out of your nose and makes you nauseated; because you have rejected the  who is among you and have wept before Him, saying, “Why did we ever leave Egypt?”’”"}],[{"type":"prose","content":"But Moses said, “The people, among whom I am , are six hundred thousand on foot! Yet You have said, ‘I will give them meat, so that they may eat for a whole month.’"}],[{"type":"prose","content":"Are flocks and herds to be slaughtered for them, so that it will be sufficient for them? Or are all the fish of the sea to be caught for them, so that it will be sufficient for them?”"}],[{"type":"prose","content":"Then the  said to Moses, “Is the ’ power too little? Now you shall see whether My word will come true for you or not.”"}],[{"type":"prose","content":"So Moses went out and told the people the words of the . He also gathered seventy men of the elders of the people, and positioned them around the tent."}],[{"type":"prose","content":"Then the  came down in the cloud and spoke to him; and He took away some of the Spirit who was upon him and placed  upon the seventy elders. And when the Spirit rested upon them, they prophesied. Yet they did not do  again."}],[{"type":"prose","content":"But two men had remained in the camp; the name of the one was Eldad, and the name of the other, Medad. And the Spirit rested upon them (and they were among those who had been registered, but had not gone out to the tent), and they prophesied in the camp."}],[{"type":"prose","content":"So a young man ran and informed Moses, and said, “Eldad and Medad are prophesying in the camp.”"}],[{"type":"prose","content":"Then Joshua the son of Nun, the personal servant of Moses from his youth, responded and said, “My lord Moses, restrain them!”"}],[{"type":"prose","content":"But Moses said to him, “Are you jealous for my sake? If only all the ’ people were prophets, that the  would put His Spirit upon them!”"}],[{"type":"prose","content":"Then Moses returned to the camp,  he and the elders of Israel."},{"type":"header","content":"The Quail and the Plague"}],[{"type":"prose","content":"Now a wind burst forth from the  and it brought quail from the sea, and dropped  beside the camp, about a day’s journey on this  and a day’s journey on the other  all around the camp, and about two cubits  on the surface of the ground."}],[{"type":"prose","content":"And the people spent all that day, all night, and all the next day, and they gathered the quail (the one who gathered least gathered ten homers) and spread  out for themselves all around the camp."}],[{"type":"prose","content":"While the meat was still between their teeth, before it was chewed, the anger of the  was kindled against the people, and the  struck the people with a very severe plague."}],[{"type":"prose","content":"So that place was named Kibroth-hattaavah, because there they buried the people who had been greedy."}],[{"type":"prose","content":"From Kibroth-hattaavah the people set out for Hazeroth, and they remained at Hazeroth."}]]