[{"header":"The Lord Sends Fire Among the People"},{"num":11,"verse":"The people weren’t happy about the hard times they were having. The Lord heard what they were saying. It made him very angry. Then the Lord sent fire on them. It blazed out among the people. It burned up some of the outer edges of the camp. "},{"num":2,"verse":"The people cried out to Moses. Then he prayed to the Lord. And the fire died down. "},{"num":3,"verse":"So that place was named Taberah. That’s because fire from the Lord had blazed out among them there."},{"header":"The Lord Sends Quail for the People to Eat"},{"num":4,"verse":"Some people with them began to wish for other food. Again the Israelites began to cry out. They said, “We wish we had meat to eat. "},{"num":5,"verse":"We remember the fish we ate in Egypt. It didn’t cost us anything. We also remember the cucumbers, melons, leeks, onions and garlic. "},{"num":6,"verse":"But now we’ve lost all interest in eating. We never see anything but this manna!”"},{"num":7,"verse":"The manna was like coriander seeds. It looked like sap from a tree. "},{"num":8,"verse":"The people went around gathering it. Then they ground it up in a small mill they held in their hands. Or they crushed it in a stone bowl. They cooked it in a pot. Or they made loaves out of it. It tasted like something made with olive oil. "},{"num":9,"verse":"When the dew came down on the camp at night, the manna also came down."},{"num":10,"verse":"Moses heard people from every family crying at the entrances to their tents. The Lord became very angry. So Moses became upset. "},{"num":11,"verse":"He asked the Lord, “Why have you brought this trouble on me? Why aren’t you pleased with me? Why have you loaded me down with the troubles of all these people? "},{"num":12,"verse":"Am I like a mother to them? Are they my children? Why do you tell me to carry them in my arms? Do I have to carry them the way a nurse carries a baby? Do I have to carry them to the land you promised? You promised the land to their people of long ago. "},{"num":13,"verse":"Where can I get meat for all these people? They keep crying out to me. They say, ‘Give us meat to eat!’ "},{"num":14,"verse":"I can’t carry all these people by myself. The load is too heavy for me. "},{"num":15,"verse":"Is this how you are going to treat me? If you are pleased with me, just put me to death right now. Don’t let me live if I have to see myself destroyed anyway.”"},{"num":16,"verse":"The Lord said to Moses, “Bring me 70 of Israel’s elders. Bring men that you know are leaders and officials among the people. Have them come to the tent of meeting. I want them to stand there with you. "},{"num":17,"verse":"I will come down and speak with you there. I will take some of the power of the Spirit that is on you. And I will put it on them. They will share the responsibility of these people with you. Then you will not have to carry it alone."},{"num":18,"verse":"“Tell the people, ‘Set yourselves apart for tomorrow. At that time you will eat meat. The Lord heard you when you cried out. You said, “We wish we had meat to eat. We were better off in Egypt. Now the Lord will give you meat. And you will eat it. "},{"num":19,"verse":"You will not eat it for just one or two days. You will not eat it for just five, ten or 20 days. "},{"num":20,"verse":"Instead, you will eat it for a whole month. You will eat it until it comes out of your noses. You will eat it until you hate it. The Lord is among you. But you have turned your back on him. You have cried out while he was listening. You have said, “Why did we ever leave Egypt?” ’ ”"},{"num":21,"verse":"But Moses said to the Lord, “Here I am among 600,000 men on the march. And you say, ‘I will give them meat to eat for a whole month’! "},{"num":22,"verse":"Would they have enough if flocks and herds were killed for them? Would they have enough even if all the fish in the ocean were caught for them?”"},{"num":23,"verse":"The Lord answered Moses, “Am I not strong enough? Now you will see whether what I say will come true for you.”"},{"num":24,"verse":"So Moses went out. He told the people what the Lord had said. He gathered 70 of their elders together. He had them stand around the tent of meeting. "},{"num":25,"verse":"Then the Lord came down in the cloud. He spoke with Moses. He took some of the power of the Spirit that was on Moses. And he put it on the 70 elders. When the Spirit came on them, they prophesied. But they didn’t do it again."},{"num":26,"verse":"Two men had remained in the camp. Their names were Eldad and Medad. They were listed among the elders. But they didn’t go out to the tent of meeting. In spite of that, the Spirit came on them too. So they prophesied in the camp. "},{"num":27,"verse":"A young man ran up to Moses. He said, “Eldad and Medad are prophesying in the camp.”"},{"num":28,"verse":"Joshua spoke up. He was the son of Nun. Joshua had been Moses’ helper from the time he was young. He said, “Moses! Please stop them!”"},{"num":29,"verse":"But Moses replied, “Are you jealous for me? I wish that all the Lord’s people were prophets. And I wish that the Lord would put his Spirit on them.” "},{"num":30,"verse":"Then Moses and the elders of Israel returned to the camp."},{"num":31,"verse":"The Lord sent out a wind. It drove quail in from the Red Sea. It scattered them all around the camp. They were about three feet above the ground. They could be seen in every direction as far as a person could walk in a day. "},{"num":32,"verse":"The people went out all day and gathered quail. They gathered them all night and all the next day. No one gathered less than 60 bushels. Then they spread the quail out all around the camp. "},{"num":33,"verse":"But while the meat was still in their mouths, the Lord acted. Before the people could swallow it, he became very angry with them. He struck them with a terrible plague. "},{"num":34,"verse":"So the place was named Kibroth Hattaavah. That’s where the bodies of the people who had wished for other food were buried."},{"num":35,"verse":"From Kibroth Hattaavah the people traveled to Hazeroth. And they stayed there."}]