[{"header":"70 Elders to Share the Burden"},{"num":11,"verse":"The people were murmuring in the ears of Adonai about hardship, and when Adonai heard, His anger burned. The fire of Adonai blazed among them, ravaging the outskirts of the camp. "},{"num":2,"verse":"The people cried out to Moses, so Moses prayed to Adonai and the fire died out. "},{"num":3,"verse":"The name of that place was thus called Taberah because fire from Adonai had burned among them."},{"num":4,"verse":"The grumblers among them began to have cravings, so Bnei-Yisrael began to wail repeatedly, saying, “If we could just eat some meat! "},{"num":5,"verse":"We remember the fish that we used to eat in Egypt, for free—the cucumbers, the melons, the leeks, the onions, and the garlic! "},{"num":6,"verse":"But now we have no appetite. We never see anything but this manna.”"},{"num":7,"verse":"Now the manna was similar to coriander seed and had an appearance like gum resin. "},{"num":8,"verse":"The people went about, gathered it up, and ground it in a hand mill or crushed it in a mortar. They cooked it in a pot or made it into cakes. It had a taste like something made with olive oil. "},{"num":9,"verse":"When the dew descended on the camp at night, the manna descended with it."},{"num":10,"verse":"Moses heard the people wailing by their families, each man at the door to his tent. Adonai’s anger became very hot, and Moses was troubled."},{"num":11,"verse":"So Moses asked Adonai, “Why have You brought trouble on Your servant? Haven’t I found favor in Your eyes—that You laid the burden of all these people on me? "},{"num":12,"verse":"Did I conceive all these people, or did I give birth to them, that You should say to me, ‘Carry them in your bosom just as the nurse carries an infant’—to the land You promised to their fathers? "},{"num":13,"verse":"Where can I get meat for all these people? For they wail to me saying, ‘Give us meat to eat!’ "},{"num":14,"verse":"I am not able to carry all these people by myself! The load is too heavy for me! "},{"num":15,"verse":"If this is how You are treating me, kill me now! If I have found favor in Your eyes, kill me please—don’t let me see my own misery!”"},{"num":16,"verse":"Adonai said to Moses, “Bring me 70 of the elders of Israel whom you know to be elders of the people and their leaders. Take them to the Tent of Meeting, so they may stand with you there. "},{"num":17,"verse":"Then I will come down and speak with you there, and, I will take some of the Ruach that is on you and will place it on them. They will carry with you the burden of the people, so you will not be carrying it alone.”"},{"num":18,"verse":"“Now to the people say: Sanctify yourselves for tomorrow, because you will eat meat, for you wailed in Adonai’s ears saying, ‘If only we could eat meat! It was better for us in Egypt!’ Now Adonai will give you meat and you will eat! "},{"num":19,"verse":"You will eat—not for one day, or two days, or five days, or ten days, or twenty days, "},{"num":20,"verse":"but for an entire month—until it is coming out of your nostrils and it becomes loathsome to you! For you rejected Adonai who is among you, and you wailed to His face saying, ‘Why did we ever leave Egypt?”"},{"num":21,"verse":"Moses then said, “600,000 foot soldiers—the people I am in the middle of—yet You say, ‘I am going to give them meat to eat for an entire month?’ "},{"num":22,"verse":"If flocks and herds were slaughtered, would they have enough? Or if all the fish in the sea were caught, would they have enough?”"},{"num":23,"verse":"Adonai said to Moses, “Is Adonai’s arm too short? Now you will see whether My word will come true for you or not.”"},{"header":"Seventy Elders Prophesying"},{"num":24,"verse":"So Moses went out and told the people Adonai’s words. He gathered 70 of the elders of the people and had them stand around the Tent. "},{"num":25,"verse":"Adonai descended in the cloud and spoke with him. He took some of the Ruach that was on him and placed it on each of the 70 elders. It so happened that when the Ruach first rested on them, they prophesied—but never again."},{"num":26,"verse":"Two men, however, had remained in the camp. The name of one was Eldad and the name of the other was Medad. The Ruach rested on them. They were among those listed, but they had not gone out to the Tent. So they prophesied in the camp. "},{"num":27,"verse":"A young man ran and told Moses and said, “Eldad and Medad are prophesying in the camp!”"},{"num":28,"verse":"Joshua son of Nun, the assistant of Moses since his youth, cried out and said, “Moses, my lord, stop them!”"},{"num":29,"verse":"But Moses said to him, “Are you jealous on my behalf? If only Adonai would make all the people prophets! If only Adonai would put the Spirit on all of them!”"},{"num":30,"verse":"Then Moses and the elders of Israel returned to the camp."},{"header":"Quails From the Sea"},{"num":31,"verse":"Now a wind went out from Adonai and drove quails from the sea. He brought them into the camp to about a day’s journey in any direction, about two cubits above the ground all around the camp. "},{"num":32,"verse":"The people went out all that night and all the following day and collected quail. No one gathered less than ten omers. They spread them out all around the camp."},{"num":33,"verse":"Yet while the meat was between their teeth, before it was swallowed, Adonai’s anger burned against the people. So Adonai struck the people with a severe plague. "},{"num":34,"verse":"For that reason the name of that place was called Kibroth-hattaavah, because they buried the people who were craving."},{"num":35,"verse":"From Kibroth-hattaavah the people journeyed to Hazeroth and stayed in Hazeroth."}]