[{"num":24,"verse":"Again in the ninth year, in the tenth month, in the tenth day of the month, the Devar Hashem came unto me, saying [i.e., note Fast of Tevet],"},{"num":2,"verse":"Ben adam, write thee the shem of the day, even of this very day; Melech Bavel laid his siege against Yerushalayim this very day."},{"num":3,"verse":"And utter a mashal unto the bais hameri (the rebellious house), and say unto them, Thus saith Adonoi Hashem; Set on the siyr (cooking pot), set it on, and also pour mayim into it;"},{"num":4,"verse":"Gather the pieces of meat thereof into it, even every good piece, the thigh, and the shoulder; fill it with the choice atzmot (bones)."},{"num":5,"verse":"Take the choice of the tzon, and arrange also the atzmot at its bottom, and make it boil well, and let them cook the atzmot of it therein."},{"num":6,"verse":"Therefore thus saith Adonoi Hashem: Oy to the ir hadamim (bloody city), to the siyr (pot) whose scum is therein, and whose scum has not been removed from it! Remove it piece by piece; no goral has fallen on it."},{"num":7,"verse":"For her dahm is in the midst of her; she set it upon an exposed rock; she poured it not upon the ground, to cover it with aphar;"},{"num":8,"verse":"That it might cause chemah (fury) to come up to take vengeance; I have set her dahm upon the exposed rock, that it should not be covered."},{"num":9,"verse":"Therefore thus saith Adonoi Hashem: Oy to the ir hadamim (bloody city)! I will even make the pyre great."},{"num":10,"verse":"Heap on wood, kindle the eish, cook the basar, and spice it well, and let the atzmot be burned."},{"num":11,"verse":"Then set it empty upon the coals thereof, that the nechoshet of it may be hot, and may burn, and that the filthiness of it may be melted in it, that the scum of it may be consumed."},{"num":12,"verse":"All efforts are wearied, [scum] is not removed, and her great scum went not forth out of her; in the eish shall be her scum."},{"num":13,"verse":"In thy tum’a is zimmah; because I have made thee tahor, and thou wast not tahor, thou shalt not be made tahor from thy tum’a any more, until I have caused My chemah (fury, wrath) to subside upon thee."},{"num":14,"verse":"I Hashem have spoken it; it shall come to pass, and I will do it; I will not go back, neither will I spare, neither will I relent: according to thy drakhim, and according to thy doings, shall they judge thee, saith Adonoi Hashem."},{"num":15,"verse":"Also the Devar Hashem came unto me, saying,"},{"num":16,"verse":"Ben adam, hineni, I take away from thee the makhmad (darling delight) of thine eynayim with a magefah (stroke); yet neither shalt thou wail nor weep, neither shall thy dema’ot (tears) run down."},{"num":17,"verse":"Forbear to cry, make no evel (mourning) for the mesim (dead ones); bind the turban of thine rosh upon thee, and put thy sandals upon thy feet, and cover not thy safam (mustache), and eat not lechem anashim (bread of sorrow)."},{"num":18,"verse":"So I spoke unto HaAm (the people) in the boker (morning); and at erev (evening) my isha (wife) died; and I did in the boker (morning, i.e., the next morning after her death the previous evening) just as I was commanded."},{"num":19,"verse":"And haam (the people) said unto me, Wilt thou not tell us what these things are to us, that thou art so doing?"},{"num":20,"verse":"Then I answered them. The Devar Hashem came unto me, saying,"},{"num":21,"verse":"Speak unto Bais Yisroel, Thus saith Adonoi Hashem: Hineni, I will desecrate My Mikdash, the ga’on (pride) of your power, the makhmad of your [plural] eynayim, and the very passion of your nefesh; and your banim and your banot whom ye have left behind shall fall by the cherev."},{"num":22,"verse":"And ye shall do just as I have done: ye shall not cover your safam (mustache), nor eat lechem anashim."},{"num":23,"verse":"And your turbans shall be upon your heads, and your sandals upon your feet; ye shall not wail nor weep; but ye shall waste away for your avonot, and groan one toward another."},{"num":24,"verse":"Thus Yechezkel is unto you as a mofet [See Zech 3:8; Isa 8:18]; according to all that he hath done shall ye do; and when this cometh, ye shall know that I am Adonoi Hashem."},{"num":25,"verse":"Also, thou ben adam, shall it not be in the day when I take from them their ma’oz (stronghold), the joy of their tiferet (glory), the makhmad (desire) of their eynayim, and that on which their nefesh is uplifted—even their banim and their banot,"},{"num":26,"verse":"That he that escapeth in that day shall come unto thee, to cause thee to hear the news [of the fall of Jerusalem] with thine oznayim?"},{"num":27,"verse":"In that day shall thy mouth be opened to him which is escaped, and thou shalt speak, and be no more mute; and thou shalt be a mofet unto them; and they shall know that I am Hashem."}]