[{"header":"The Boiling Pot"},{"num":24,"verse":"In the ninth year, in the tenth month, on the tenth day of the month, the word of the Lord came to me: "},{"num":2,"verse":"“Son of man, write down the name of this day, this very day. The king of Babylon has laid siege to Jerusalem this very day. "},{"num":3,"verse":"And utter an allegory to the rebellious house and say to them, Thus says the Lord God:"},{"num":6,"verse":"“Therefore thus says the Lord God: Woe to the bloody city, to the pot whose rust is in it, and whose rust has not gone out of it! Take out of it piece after piece, without making any choice. "},{"num":7,"verse":"For the blood she has shed is still in the midst of her; she put it on the bare rock, she did not pour it upon the ground to cover it with dust. "},{"num":8,"verse":"To rouse my wrath, to take vengeance, I have set on the bare rock the blood she has shed, that it may not be covered. "},{"num":9,"verse":"Therefore thus says the Lord God: Woe to the bloody city! I also will make the pile great. "},{"num":10,"verse":"Heap on the logs, kindle the fire, boil well the flesh, and empty out the broth, and let the bones be burned up. "},{"num":11,"verse":"Then set it empty upon the coals, that it may become hot, and its copper may burn, that its filthiness may be melted in it, its rust consumed. "},{"num":12,"verse":"In vain I have wearied myself; its thick rust does not go out of it by fire. "},{"num":13,"verse":"Its rust is your filthy lewdness. Because I would have cleansed you and you were not cleansed from your filthiness, you shall not be cleansed any more till I have satisfied my fury upon you. "},{"num":14,"verse":"I the Lord have spoken; it shall come to pass, I will do it; I will not go back, I will not spare, I will not repent; according to your ways and your doings I will judge you, says the Lord God.”"},{"header":"Ezekiel’s Bereavement"},{"num":15,"verse":"Also the word of the Lord came to me: "},{"num":16,"verse":"“Son of man, behold, I am about to take the delight of your eyes away from you at a stroke; yet you shall not mourn or weep nor shall your tears run down. "},{"num":17,"verse":"Sigh, but not aloud; make no mourning for the dead. Bind on your turban, and put your shoes on your feet; do not cover your lips, nor eat the bread of mourners.” "},{"num":18,"verse":"So I spoke to the people in the morning, and at evening my wife died. And on the next morning I did as I was commanded."},{"num":19,"verse":"And the people said to me, “Will you not tell us what these things mean for us, that you are acting thus?” "},{"num":20,"verse":"Then I said to them, “The word of the Lord came to me: "},{"num":21,"verse":"‘Say to the house of Israel, Thus says the Lord God: Behold, I will profane my sanctuary, the pride of your power, the delight of your eyes, and the desire of your soul; and your sons and your daughters whom you left behind shall fall by the sword. "},{"num":22,"verse":"And you shall do as I have done; you shall not cover your lips, nor eat the bread of mourners. "},{"num":23,"verse":"Your turbans shall be on your heads and your shoes on your feet; you shall not mourn or weep, but you shall pine away in your iniquities and groan to one another. "},{"num":24,"verse":"Thus shall Ezekiel be to you a sign; according to all that he has done you shall do. When this comes, then you will know that I am the Lord God.’"},{"num":25,"verse":"“And you, son of man, on the day when I take from them their stronghold, their joy and glory, the delight of their eyes and their heart’s desire, and also their sons and daughters, "},{"num":26,"verse":"on that day a fugitive will come to you to report to you the news. "},{"num":27,"verse":"On that day your mouth will be opened to the fugitive, and you shall speak and be no longer dumb. So you will be a sign to them; and they will know that I am the Lord.”"}]