[{"header":"Parable of a Rusted Pot"},{"num":24,"verse":"The word of Adonai came to me in the tenth day of the tenth month of the ninth year saying: "},{"num":2,"verse":"“Son of man, record this date, this exact day—this very day the king of Babylon has laid siege to Jerusalem. "},{"num":3,"verse":"Utter a parable concerning the rebellious house. Say to them, thus says Adonai Elohim:"},{"header":"Ezekiel’s Wife Dies"},{"num":15,"verse":"The word of Adonai came to me saying: "},{"num":16,"verse":"“Son of man, behold, I am about to take away the desire of your eyes with a single blow. But do not lament, do not weep or allow any tears to flow. "},{"num":17,"verse":"Sigh silently, do not observe mourning for the dead, keep your turban fastened, and keep your sandals on your feet. Do not cover your upper lip or eat the bread of mourners.”"},{"num":18,"verse":"So I spoke to the people in the morning and my wife died in the evening. In the morning I did just as I was commanded. "},{"num":19,"verse":"The people said to me, “Won’t you tell us what these things you are doing mean to us?”"},{"num":20,"verse":"Then I said to them, “The word of Adonai came to me saying, "},{"num":21,"verse":"speak to the house of Israel, thus says Adonai Elohim: ‘Behold, I will profane My Sanctuary, the pride of your might, the desire of your eyes and the longing of your soul. Your sons and your daughters that you have left behind will fall by the sword. "},{"num":22,"verse":"You will do just as I have done: you will not cover your upper lips or eat the bread of mourners. "},{"num":23,"verse":"Your turbans will remain on your heads and your shoes on your feet—you will not lament or weep. But you will pine away in your iniquities and groan to each other. "},{"num":24,"verse":"Ezekiel will be a sign for you; just as he has done, you will do. When this comes, you will know that I am Adonai.’"},{"num":25,"verse":"“You, son of man, on the day when I take from them their stronghold, the joy of their glory, the desire of their eyes, the longing of their soul, as well as their sons and their daughters—"},{"num":26,"verse":"on that day a fugitive will come to you to tell you the news. "},{"num":27,"verse":"On that day your mouth will be opened to him who escaped. You will speak and no longer be mute. So you will be a sign for them, and they will know that I am Adonai.”"}]