[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Surely your turning of things upside down.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words are better taken as exclamatory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O your perversity! ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Isaiah was indignant at that habit of always taking things at their wrong end, and looking on them from the wrong side.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall be esteemed as the potter’s clay . . .—Better, Shall the potter be counted as the clay? The Authorised version is scarcely intelligible. Taken as a question, the words bring out the character of the perversity, the upside-downness, of which the prophet speaks. The men whom he condemns were inverting the relations of the Creator and the creature, the potter and the clay, acting practically as atheists, denying that there was a Divine order of which they formed a part.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shall be esteemed as the potter’s clay . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Shall the potter be counted as the clay? ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The Authorised version is scarcely intelligible. Taken as a question, the words bring out the character of the perversity, the upside-downness, of which the prophet speaks. The men whom he condemns were inverting the relations of the Creator and the creature, the potter and the clay, acting practically as atheists, denying that there was a Divine order of which they formed a part.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29:9-16 The security of sinners in sinful ways, is cause for lamentation and wonder. The learned men, through prejudice, said that the Divine prophecies were obscure; and the poor urged their want of learning. The Bible is a sealed book to every man, learned or unlearned, till he begins to study it with a simple heart and a teachable spirit, that he may thence learn the truth and the will of God. To worship God, is to approach him. And if the heart be full of his love and fear, out of the abundance of it the mouth will speak; but there are many whose religion is lip-labour only. When they pretend to be speaking to God, they are thinking of a thousand foolish things. They worship the God of Israel according to their own devices. Numbers are only formal in worship. And their religion is only to comply with custom, and to serve their own interest. But the wanderings of mind, and defects in devotion, which are the believer's burden, are very different from the withdrawing of the heart from God, so severely blamed. And those who make religion no more than a pretence, to serve a turn, deceive themselves. And as those that quarrel with God, so those that think to conceal themselves from him, in effect charge him with folly. But all their perverse conduct shall be entirely done away.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Surely your turning of things upside down - Your perversion of all things. They had no just views of truth. They deemed mere formality to be all that was required. They attempted to conceal their plans even from Yahweh; and everything in the opinions and practice of the nation had become perverted and erroneous. There has been much diversity in rendering this phrase. Luther renders it, 'O how perverse ye are.' Lowth renders it,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "'Perverse as ye are! shall the potter be esteemed as the clay?'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rosenmuller also accords with this interpretation, and renders it, 'O your perversity,' etc. The sense of the passage seems to be this: 'Your \"changing of things\" is just as absurd as it would be for the thing formed to say to him that formed it, why hast thou made me thus? It is as absurd for you to find fault with the government of God as it would be for the clay to complain of want of skill in the potter. You complain of God's laws, and worship Him according to the commandments of people. You complain of his requirements, and offer to him the service of the mouth and the lip, and witchold the heart. You suppose that God does not see you, and do your deeds in darkness. All this supposes that God is destitute of wisdom, and cannot see what is done, and it is just as absurd as it would be in the clay to complain that the potter who fashions it has no understanding.'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall be esteemed ... - The \"literal\" translation of this passage would be, 'Your perverseness is as if the potter should be esteemed as the clay;' that is, as if he was no more qualified to form anything than the clay itself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For shall the work ... - This passage is quoted by the apostle Paul Romans 9:20-21 to show the right which God has to do with his creatures as shall seem good in his sight, and the impropriety of complaining of his distinguishing mercy in choosing to life those whom he pleases. The sense of the passage is, that it would be absurd for that which is made to complain of the maker as having no intelligence, and no right to make it as he does. It would be absurd in the piece of pottery to complain of the potter as if he had no skill; and it is equally absurd in a man to complain of God, or to regard him as destitute of wisdom. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For shall the work ... - This passage is quoted by the apostle Paul ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:20-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to show the right which God has to do with his creatures as shall seem good in his sight, and the impropriety of complaining of his distinguishing mercy in choosing to life those whom he pleases. The sense of the passage is, that it would be absurd for that which is made to complain of the maker as having no intelligence, and no right to make it as he does. It would be absurd in the piece of pottery to complain of the potter as if he had no skill; and it is equally absurd in a man to complain of God, or to regard him as destitute of wisdom. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. Rather, \"Ah! your perverseness! just as if the potter should be esteemed as the clay!\" [Maurer]. Or, \"Ye invert (turn upside down) the order of things, putting yourselves instead of God,\" and vice versa, just as if the potter should be esteemed as the clay [Horsley], (Isa 45:9; 64:8).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Your turning of things upside down; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all your subtle devices, by which you turn yourselves into all shapes; and turn your thoughts hither and thither, and pervert the order which God hath appointed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall be esteemed as the potter’s clay; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is no more to me than the clay is to the potter, who can not only discern it thoroughly, but alter and dispose it as he seeth fit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall the work say of him that made it, He made me not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c.? and no less absurd and ridiculous is your conceit, that I, your Maker and supreme Governor, cannot discover and control all your artifices at my pleasure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Surely your turning of things upside down,.... Revolving things in their minds, throwing them into different shapes, forming various schemes, and inverting the order of things by their deep counsels, and seeking to hide things from the Lord: or, \"O the perverseness of you\" (z); in imagining and saying that no eye saw, nor anyone knew, what they did, not the Lord himself. So the Vulgate Latin version, \"this is your perverse thought\"; namely, what is before related. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"do you seek to pervert your works?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Our version joins it with what follows; though a stop should be made here, because of the accent: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall be esteemed as the potter's clay: their perverse counsels and designs shall be made of no more account with God, and be as easily turned about and brought to nought, as the clay can be formed, and shaped, and marred by the potter, at his pleasure: \"if\" or \"surely as the potter's clay shall it be esteemed\", as the words may be rendered; or it may refer to their persons, as well as their counsels. So the Septuagint version, \"shall ye not be reckoned as the potter's clay?\" ye shall. To which agrees the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"behold, as the clay in the hand of the potter, so are ye accounted before me;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who could do with them just as seemed good in his sight. De Dieu renders them, \"shall the potter be reckoned as the clay?\" Such was the stupidity and perverseness of the Jews, in endeavouring to hide their counsels from the Lord, and in fancying that he did not see and know them, that they thought God was like themselves; which is all one as if the potter was reckoned as the clay, for they were the clay, and God the potter. The Vulgate Latin version is, \"as if the clay could think against the potter\"; contrive schemes to counterwork him; which, to imagine, was not more stupid, than to think they could do anything against the Lord: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for shall the work say of him that made it, He made me not? to say that God does not know what is done by his creatures, is in effect to say that he did not make them; for he that made them must needs know their actions, and even the very thoughts of their hearts; as he that makes a watch knows all that is in it, and the motions of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or shall the thing framed say of him that framed it, He had no understanding? or judgment, did not know how to make it as it should be. So the Septuagint version, \"thou hast not made me wisely\"; or he did not understand the work itself, the make and fashion of it. So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"thou does not understand me.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This might as well be said, as for a creature to pretend that God does not know what and where he is, or what he is doing. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) So some in Gataker; \"subversio vestra\", Pagninus, Montanus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) So some in Gataker; \"subversio vestra\", Pagninus, Montanus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Surely your turning of things upside down shall be esteemed {o} as the potter's clay: for shall the work say of him that made it, He made me not? or shall the thing formed say of him that formed it, He had no understanding?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Surely your turning of things upside down shall be esteemed ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the potter's clay: for shall the work say of him that made it, He made me not? or shall the thing formed say of him that formed it, He had no understanding?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) For all your craft says the Lord, you are not able to escape my hands any more than the clay that is in the potter's hands has power to deliver itself.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Shall the creature attempt to outwit the Creator?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Surely your turning … clay",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Render as R.V. marg.: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "O your perversity! Shall the potter be counted as clay?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “Is there no difference between maker and thing made?” On the image of the clay and the potter, cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 64:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Surely your turning of things upside down shall be esteemed as the potter's clay",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, O ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for your perverseness! Shall the potter be reckoned as clay?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They were so perverse and wrong-headed that they inverted the relation in which they stood to God and God to them. God was to be passive, or merely give opportunities of action, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were to mould their own plans and carve out their own destinies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For shall the work say,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc.? rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for the work saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Taking their destinies into their own hands was equivalent to saying that they were their own masters, which they could not be if God made them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall the thing framed say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.? rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "yea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the thing formed hath said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To refuse to take counsel of God, and direct the national policy by the light of their own reason, was to tax God with having ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "no understanding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Isaiah 29:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Their hypocrisy, which was about to be so wonderfully punished according to the universal law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:26-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), manifested itself in their self-willed and secret behaviour, which would not inquire for Jehovah, nor suffer itself to be chastened by His word. \"Woe unto them that hide plans deep from Jehovah, and their doing occurs in a dark place, and they say, Who saw us then, and who knew about us? Oh for your perversity! It is to be regarded as potters' clay; that a work could say to its maker, He has not made me; and an image to its sculptor, He does not understand it!\" Just as Ahaz had carefully kept his appeal to Asshur for help secret from the prophet; so did they try, as far as possible, to hide from the prophet the plan for an alliance with Egypt. לסתּיר is a syncopated hiphil for להסתּיר, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 23:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". העמיק adds the adverbial notion, according to our mode of expression (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the opposite thought in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ges. 142). To hide from Jehovah is equivalent to hiding from the prophet of Jehovah, that they might not have to listen to reproof from the word of Jehovah. We may see from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " how suspiciously they watched the prophet in such circumstances as these. But Jehovah saw them in their secrecy, and the prophet saw through the whole in the light of Jehovah. הפכּכם is an exclamation, like תּפלצתּך in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They are perverse, or ('im) \"is it not so?\" They think they can dispense with Jehovah, and yet they are His creatures; they attribute cleverness to themselves, and practically disown Jehovah, as if the pot should say to the potter who has turned it, He does not understand it. ",
        "children": []
      }
    ]
  }
]