[{"num":15,"verse":"A soft answer turneth away fury; but a grievous word stirreth up anger."},{"num":2,"verse":"The tongue of the wise useth knowledge aright; but the mouth of the foolish poureth out folly."},{"num":3,"verse":"The eyes of Jehovah are in every place, beholding the evil and the good."},{"num":4,"verse":"Gentleness of tongue is a tree of life; but crookedness therein is a breaking of the spirit."},{"num":5,"verse":"A fool despiseth his father's instruction; but he that regardeth reproof becometh prudent."},{"num":6,"verse":"In the house of a righteous [man] is much treasure; but in the revenue of a wicked [man] is disturbance."},{"num":7,"verse":"The lips of the wise disperse knowledge, but not so the heart of the foolish."},{"num":8,"verse":"The sacrifice of the wicked is an abomination to Jehovah; but the prayer of the upright is his delight."},{"num":9,"verse":"The way of a wicked [man] is an abomination to Jehovah; but him that pursueth righteousness he loveth."},{"num":10,"verse":"Grievous correction is for him that forsaketh the path; he that hateth reproof shall die."},{"num":11,"verse":"Sheol and destruction are before Jehovah; how much more then the hearts of the children of men!"},{"num":12,"verse":"A scorner loveth not one that reproveth him; he will not go unto the wise."},{"num":13,"verse":"A joyful heart maketh a cheerful countenance; but by sorrow of heart the spirit is broken."},{"num":14,"verse":"The heart of an intelligent [man] seeketh knowledge; but the mouth of the foolish feedeth on folly."},{"num":15,"verse":"All the days of the afflicted are evil; but a cheerful heart is a continual feast."},{"num":16,"verse":"Better is little with the fear of Jehovah than great store and disquietude therewith."},{"num":17,"verse":"Better is a meal of herbs where love is, than a fatted ox and hatred therewith."},{"num":18,"verse":"A furious man stirreth up contention; but he that is slow to anger appeaseth strife."},{"num":19,"verse":"The way of the sluggard is as a hedge of thorns; but the path of the upright is made plain."},{"num":20,"verse":"A wise son maketh a glad father; but a foolish man despiseth his mother."},{"num":21,"verse":"Folly is joy to him that is void of sense; but a man of understanding regulateth his walk."},{"num":22,"verse":"Without counsel purposes are disappointed; but in the multitude of counsellors they are established."},{"num":23,"verse":"A man hath joy by the answer of his mouth; and a word in its season, how good is it!"},{"num":24,"verse":"The path of life is upwards for the wise, that he may depart from Sheol beneath."},{"num":25,"verse":"Jehovah plucketh up the house of the proud; but he establisheth the boundary of the widow."},{"num":26,"verse":"The thoughts of the evil [man] are an abomination to Jehovah; but pure words are pleasant."},{"num":27,"verse":"He that is greedy of gain troubleth his own house; but he that hateth gifts shall live."},{"num":28,"verse":"The heart of a righteous [man] studieth to answer; but the mouth of the wicked poureth out evil things."},{"num":29,"verse":"Jehovah is far from the wicked; but he heareth the prayer of the righteous."},{"num":30,"verse":"That which enlighteneth the eyes rejoiceth the heart; good tidings make the bones fat."},{"num":31,"verse":"The ear that heareth the reproof of life shall abide among the wise."},{"num":32,"verse":"He that refuseth instruction despiseth his own soul; but he that heareth reproof getteth sense."},{"num":33,"verse":"The fear of Jehovah is the discipline of wisdom, and before honour [goeth] humility."}]