[{"header":"The Apostles and the Jewish High Council"},{"num":4,"verse":"While Peter and John were speaking to the people, some Jewish leaders came up to them. There were some priests, the captain of the soldiers that guarded the Temple, and some Sadducees."},{"num":2,"verse":"They were upset because of what Peter and John were teaching the people. By telling people about Jesus, the apostles were teaching that people will rise from death."},{"num":3,"verse":"The Jewish leaders arrested Peter and John and put them in jail. It was already night, so they kept them in jail until the next day."},{"num":4,"verse":"But many of the people who heard the apostles believed what they said. There were now about 5000 men in the group of believers."},{"num":5,"verse":"The next day the Jewish rulers, the older Jewish leaders, and the teachers of the law met in Jerusalem."},{"num":6,"verse":"Annas the high priest, Caiaphas, John, and Alexander were there. Everyone from the high priest’s family was there."},{"num":7,"verse":"They made Peter and John stand before all the people. They asked them over and over, “How did you make this crippled man well? What power did you use? By whose authority did you do this?”"},{"num":8,"verse":"Then Peter was filled with the Holy Spirit and said to them, “Rulers of the people and you older leaders,"},{"num":9,"verse":"are you questioning us today about what we did to help this crippled man? Are you asking us what made him well?"},{"num":10,"verse":"We want all of you and all the people of Israel to know that this man was made well by the power of Jesus Christ from Nazareth. You nailed Jesus to a cross, but God raised him from death. This man was crippled, but he is now well. He is able to stand here before you because of the power of Jesus!"},{"num":11,"verse":"Jesus is"},{"num":12,"verse":"Jesus is the only one who can save people. His name is the only power in the world that has been given to save anyone. We must be saved through him!”"},{"num":13,"verse":"The Jewish leaders understood that Peter and John had no special training or education. But they also saw that they were not afraid to speak. So the leaders were amazed. They also realized that Peter and John had been with Jesus."},{"num":14,"verse":"They saw the crippled man standing there beside the apostles. They saw that he was healed, so they could say nothing against the apostles."},{"num":15,"verse":"The Jewish leaders told them to leave the council meeting. Then the leaders talked to each other about what they should do."},{"num":16,"verse":"They said, “What shall we do with these men? Everyone in Jerusalem knows about the miracle they did as a sign from God. It’s too obvious. We can’t say it didn’t happen."},{"num":17,"verse":"But we must make them afraid to talk to anyone again using that name. Then this problem will not spread among the people.”"},{"num":18,"verse":"So the Jewish leaders called Peter and John in again. They told the apostles not to say anything or to teach anything in the name of Jesus."},{"num":19,"verse":"But Peter and John answered them, “What do you think is right? What would God want? Should we obey you or God?"},{"num":20,"verse":"We cannot be quiet. We must tell people about what we have seen and heard.”"},{"num":21,"verse":"The Jewish leaders could not find a way to punish the apostles, because all the people were praising God for what had been done. This miracle was a sign from God. The man who was healed was more than 40 years old. So the Jewish leaders warned the apostles again and let them go free."},{"header":"Peter and John Return to the Believers"},{"num":23,"verse":"Peter and John left the meeting of Jewish leaders and went to their own group. They told the group everything that the leading priests and the older Jewish leaders had said to them."},{"num":24,"verse":"When the believers heard this, they all prayed to God with one purpose. They said, “Master, you are the one who made the sky, the earth, the sea, and everything in the world."},{"num":25,"verse":"Our ancestor David was your servant. With the help of the Holy Spirit he wrote these words:"},{"num":27,"verse":"That’s what actually happened when Herod, Pontius Pilate, the other nations, and the people of Israel all came together against Jesus here in Jerusalem. He is your holy Servant, the one you made to be the Messiah."},{"num":28,"verse":"These people who came together against Jesus made your plan happen. It was done because of your power and your will."},{"num":29,"verse":"And now, Lord, listen to what they are saying. They are trying to make us afraid. We are your servants. Help us to say what you want us to say without fear."},{"num":30,"verse":"Help us to be brave by showing us your power. Make sick people well. Cause miraculous signs and wonders to happen by the authority of Jesus, your holy servant.”"},{"num":31,"verse":"After the believers prayed, the place where they were meeting shook. They were all filled with the Holy Spirit, and they continued to speak God’s message without fear."},{"header":"The Believers Share"},{"num":32,"verse":"The whole group of believers was united in their thinking and in what they wanted. None of them said that the things they had were their own. Instead, they shared everything."},{"num":33,"verse":"With great power the apostles were making it known to everyone that the Lord Jesus was raised from death. And God blessed all the believers very much."},{"num":34,"verse":"None of them could say they needed anything. Everyone who owned fields or houses sold them. They brought the money they got"},{"num":35,"verse":"and gave it to the apostles. Then everyone was given whatever they needed."},{"num":36,"verse":"One of the believers was named Joseph. The apostles called him Barnabas, a name that means “one who encourages others.” He was a Levite born in Cyprus."},{"num":37,"verse":"Joseph sold a field he owned. He brought the money and gave it to the apostles."}]