[{"header":"Peter and John at the Council"},{"num":4,"verse":"While Peter and John were speaking to the people, a group of men came up to them. There were Jewish priests, the captain of the soldiers that guarded the Temple, and some Sadducees. "},{"num":2,"verse":"They were upset because the two apostles were teaching the people. Peter and John were preaching that people will rise from death through the power of Jesus. "},{"num":3,"verse":"The Jewish leaders grabbed Peter and John and put them in jail. It was already night, so they kept them in jail until the next day. "},{"num":4,"verse":"But many of those who heard Peter and John preach believed the things they said. There were now about 5,000 men in the group of believers."},{"num":5,"verse":"The next day the Jewish rulers, the Jewish elders, and the teachers of the law met in Jerusalem. "},{"num":6,"verse":"Annas the high priest, Caiaphas, John, and Alexander were there. Everyone from the high priest’s family was there. "},{"num":7,"verse":"They made Peter and John stand before them. The Jewish leaders asked them: “By what power or authority did you do this?”"},{"num":8,"verse":"Then Peter was filled with the Holy Spirit. He said to them, “Rulers of the people and you elders, "},{"num":9,"verse":"are you questioning us about a good thing that was done to a crippled man? Are you asking us who made him well? "},{"num":10,"verse":"We want all of you and all the Jewish people to know that this man was made well by the power of Jesus Christ from Nazareth! You nailed him to a cross, but God raised him from death. This man was crippled, but he is now well and able to stand here before you because of the power of Jesus! "},{"num":11,"verse":"Jesus is"},{"num":12,"verse":"Jesus is the only One who can save people. No one else in the world is able to save us.”"},{"num":13,"verse":"The Jewish leaders saw that Peter and John were not afraid to speak. They understood that these men had no special training or education. So they were amazed. Then they realized that Peter and John had been with Jesus. "},{"num":14,"verse":"They saw the crippled man standing there beside the two apostles. They saw that the man was healed. So they could say nothing against them. "},{"num":15,"verse":"The Jewish leaders told them to leave the meeting. Then the leaders talked to each other about what they should do. "},{"num":16,"verse":"They said, “What shall we do with these men? Everyone in Jerusalem knows that they have done a great miracle! We cannot say it is not true. "},{"num":17,"verse":"But we must warn them not to talk to people anymore using that name. Then this thing will not spread among the people.”"},{"num":18,"verse":"So they called Peter and John in again. They told them not to speak or to teach at all in the name of Jesus. "},{"num":19,"verse":"But Peter and John answered them, “What do you think is right? What would God want? Should we obey you or God? "},{"num":20,"verse":"We cannot keep quiet. We must speak about what we have seen and heard.” "},{"num":21,"verse":"The Jewish leaders could not find a way to punish them because all the people were praising God for what had been done. (This miracle was a proof from God. The man who was healed was more than 40 years old!) So the Jewish leaders warned the apostles again and let them go free."},{"header":"The Believers’ Prayer"},{"num":23,"verse":"Peter and John left the meeting of Jewish leaders and went to their own group. They told them everything that the leading priests and the Jewish elders had said to them. "},{"num":24,"verse":"When the believers heard this, they prayed to God with one purpose. They prayed, “Lord, you are the One who made the sky, the earth, the sea, and everything in the world. "},{"num":25,"verse":"Our father David was your servant. With the help of the Holy Spirit he said:"},{"num":27,"verse":"These things really happened when Herod, Pontius Pilate, the non-Jewish people, and the Jewish people all came together against Jesus here in Jerusalem. Jesus is your holy Servant. He is the One you made to be the Christ. "},{"num":28,"verse":"These people made your plan happen; it happened because of your power and your will. "},{"num":29,"verse":"And now, Lord, listen to what they are saying. They are trying to make us afraid! Lord, we are your servants. Help us to speak your word without fear. "},{"num":30,"verse":"Help us to be brave by showing us your power; make sick people well, give proofs, and make miracles happen by the power of Jesus, your holy servant.”"},{"num":31,"verse":"After they had prayed, the place where they were meeting was shaken. They were all filled with the Holy Spirit, and they spoke God’s word without fear."},{"header":"The Believers Share"},{"num":32,"verse":"The group of believers were joined in their hearts, and they had the same spirit. No person in the group said that the things he had were his own. Instead, they shared everything. "},{"num":33,"verse":"With great power the apostles were telling people that the Lord Jesus was truly raised from death. And God blessed all the believers very much. "},{"num":34,"verse":"They all received the things they needed. Everyone that owned fields or houses sold them. They brought the money "},{"num":35,"verse":"and gave it to the apostles. Then each person was given the things he needed."},{"num":36,"verse":"One of the believers was named Joseph. The apostles called him Barnabas. (This name means “one who encourages.”) He was a Levite, born in Cyprus. "},{"num":37,"verse":"Joseph owned a field. He sold it, brought the money, and gave it to the apostles."}]