[{"header":"Resurrection Plus the Name of Jesus Equals Trouble"},{"num":4,"verse":"As they were speaking to the people, along came the priests, the chief of the Temple police, and the Sadducees. "},{"num":2,"verse":"They were thoroughly annoyed that they were teaching the people and proclaiming that ‘the resurrection of the dead’ had begun to happen in Jesus. "},{"num":3,"verse":"They seized them and put them under guard until the next day, since it was already evening. "},{"num":4,"verse":"But a large number of the people who had heard the message believed it, and the number of men grew to five thousand."},{"num":5,"verse":"On the next day their rulers, the elders and the scribes gathered in Jerusalem, "},{"num":6,"verse":"along with Annas the high priest, Caiaphas, John, Alexander and all the members of the high-priestly family. "},{"num":7,"verse":"They stood them in the midst."},{"num":8,"verse":"Peter was filled with the holy spirit. ‘Rulers of the people and elders,’ he said, "},{"num":9,"verse":"‘if the question we’re being asked today is about a good deed done for a sick man, and whose power it was that rescued him, "},{"num":10,"verse":"let it be known to all of you, and to all the people of Israel, that this man stands before you fit and well because of the name of the Messiah, Jesus of Nazareth, whom you crucified, but whom God raised from the dead. "},{"num":11,"verse":"He is the stone which you builders rejected, but which has become the head cornerstone. "},{"num":12,"verse":"Rescue won’t come from anybody else! There is no other name given under heaven and among humans by which we must be rescued.’"},{"header":"The Clash of Loyalties"},{"num":13,"verse":"When they saw how boldly Peter and John were speaking, and realized that they were untrained, ordinary men, they were astonished, and they recognized them as people who had been with Jesus. "},{"num":14,"verse":"And when they saw the man who had been healed standing with them, they had nothing to say in reply. "},{"num":15,"verse":"They ordered them to be put out of the assembly while they conferred among themselves."},{"num":16,"verse":"‘What can we do to these men?’ they said. ‘This is a spectacular sign that has happened through them. All Jerusalem knows it, and we can’t deny it! "},{"num":17,"verse":"But we certainly don’t want it to spread any further among the people. So let’s threaten them with awful consequences if they speak any more in this name to anybody.’"},{"num":18,"verse":"So they called them in and gave them orders not to speak at all, or to teach, in the name of Jesus."},{"num":19,"verse":"But Peter and John gave them this reply."},{"num":20,"verse":"As far as we’re concerned, we can’t stop speaking about what we have seen and heard.’"},{"num":21,"verse":"Then they threatened them some more, and let them go. They couldn’t find any way to punish them because of the people, since everyone was glorifying God for what had happened. "},{"num":22,"verse":"After all, the man to whom this sign of healing had happened was over forty years old."},{"header":"Look upon Their Threats"},{"num":23,"verse":"When they had been released, they went back to their own people, and told them everything that the chief priests and the elders had said. "},{"num":24,"verse":"When they heard it, they all together lifted up their voices to God."},{"num":25,"verse":"And you said through the holy spirit, by the mouth of our ancestor David, your servant,"},{"num":27,"verse":"‘It’s true: Herod and Pontius Pilate, together with the nations and the peoples of Israel, gathered themselves together in this very city against your holy child Jesus, the one you anointed, "},{"num":28,"verse":"to do whatever your hand and your plan had foreordained to take place. "},{"num":29,"verse":"So now, Master, look on their threats; and grant that we, your servants, may speak your word with all boldness, "},{"num":30,"verse":"while you stretch out your hand for healing, so that signs and wonders may come about through the name of your holy child Jesus.’"},{"num":31,"verse":"When they had prayed, the place where they were gathered was shaken. They were all filled with the holy spirit, and they boldly spoke the word of God."},{"header":"Signs of the New Covenant"},{"num":32,"verse":"The company of those who believed had one heart and soul. Nobody said that they owned their property; instead, they had everything in common. "},{"num":33,"verse":"The apostles gave their testimony to the resurrection of the Lord Jesus with great power, and great grace was upon all of them. "},{"num":34,"verse":"For there was no needy person among them, since any who possessed lands or houses sold them, brought the money from the sale, "},{"num":35,"verse":"and placed it at the feet of the apostles, who then gave to each according to their need."},{"num":36,"verse":"Joseph, a Levite from Cyprus, to whom the apostles gave the surname ‘Barnabas’ (which means ‘son of encouragement’), "},{"num":37,"verse":"sold some land which belonged to him, brought the money, and laid it at the apostles’ feet."}]