[{"header":"Peter and John Arrested"},{"num":1,"verse":"The teaching and preaching of Peter and John angered the priests, the captain of the temple police, and representatives of the Jewish sect of the Sadducees. They were furious that the people were being taught that in Jesus there is a resurrection from the dead. So while Peter and John were still speaking, the Jewish authorities came to the temple courts to oppose them. "},{"num":3,"verse":"They had them arrested, and since it was already evening they kept them in custody until the next day. "},{"num":4,"verse":"Yet there were many in the crowd who believed the message, bringing the total number of men who believed to nearly five thousand!"},{"num":5,"verse":"The next day many Jewish leaders, religious scholars, and elders of the people convened a meeting in Jerusalem. "},{"num":6,"verse":"Annas the high priest was there with Caiaphas, John, Alexander, and others who were members of the high priest’s family. "},{"num":7,"verse":"They made Peter and John stand in front of the council as they questioned them, saying, “Tell us, by what power and authority have you done these things?”"},{"num":8,"verse":"Peter, filled with the Holy Spirit, answered, “Respected elders and leaders of the people, listen. "},{"num":9,"verse":"Are we being put on trial today for doing an act of kindness by healing a frail, crippled man? Well then, "},{"num":10,"verse":"you and everyone else in Israel should know that it is by the power of the name of Jesus that the crippled man stands here today completely healed! You crucified Jesus Christ of Nazareth, but God raised him from the dead. "},{"num":11,"verse":"This Jesus is ‘the stone that you, the builders, have rejected, and now he has become the cornerstone!’ "},{"num":12,"verse":"There is no one else who has the power to save us, for there is only one name to whom God has given authority by which we must experience salvation: the name of Jesus.”"},{"num":13,"verse":"The council members were astonished as they witnessed the bold courage of Peter and John, especially when they discovered that they were just ordinary men who had never had religious training. Then they began to understand the effect Jesus had on them simply by spending time with him. "},{"num":14,"verse":"Standing there with them was the healed man, and there was nothing further they could say."},{"num":15,"verse":"So they ordered them to leave the room while they discussed the matter. Among themselves, they said, "},{"num":16,"verse":"“What should we do with these men? Everyone in Jerusalem can clearly see that they’ve performed a notable sign and wonder—we can’t deny that. "},{"num":17,"verse":"But to keep this propaganda from spreading any further among the people, let’s threaten them severely and warn them to never speak to anyone in this name again.”"},{"num":18,"verse":"So they had them brought back in before the council, and they commanded them to never teach the people or speak again using the name of Jesus. "},{"num":19,"verse":"But Peter and John replied, “You can judge for yourselves—is it better to listen to you or to God? "},{"num":20,"verse":"It’s impossible for us to stop speaking about all the things we’ve seen and heard!”"},{"num":21,"verse":"Since the members of the council couldn’t come up with a crime they could punish them for, they threatened them once more and let them go. All the people praised God, thrilled over the miraculous healing of the crippled man. "},{"num":22,"verse":"And the man who received this miracle sign of healing was over forty years old."},{"header":"The Church Prays"},{"num":23,"verse":"As soon as they were released from custody, Peter and John went to the other believers and explained all that had happened with the high priest and the elders. "},{"num":24,"verse":"When the believers heard their report, they raised their voices in unity and prayed, “Lord Yahweh, you are the Lord of all! You created the universe—the earth, the sky, the sea, and everything that is in them. "},{"num":25,"verse":"And you spoke by the Holy Spirit through your servant David, our forefather, saying:"},{"num":27,"verse":"“In fact, Herod and Pontius Pilate, along with Jews and non-Jews, met together to take their stand against your holy servant, Jesus the Messiah. "},{"num":28,"verse":"They did to him all that your purpose and will had determined, according to the destiny you had marked out for him. "},{"num":29,"verse":"So now, Lord, listen to their threats to harm us. Empower us, as your servants, to speak the word of God freely and courageously. "},{"num":30,"verse":"Stretch out your hand of power through us to heal, and to move in signs and wonders by the name of your holy Son, Jesus!”"},{"num":31,"verse":"As they prayed the earth shook beneath them, causing the building they were in to tremble. Each one of them was filled with the Holy Spirit, and they proclaimed the word of God with unrestrained boldness."},{"num":32,"verse":"All the believers were one in mind and heart. Selfishness was not a part of their community, for they shared everything they had with one another. "},{"num":33,"verse":"The apostles gave powerful testimonies about the resurrection of the Lord Jesus, and great measures of grace rested upon them all. "},{"num":34,"verse":"Some who owned houses or land sold them and brought the proceeds before the apostles to distribute to those without. Not a single person among them was needy."},{"num":36,"verse":"For example, there was a Levite from Cyprus named Joseph, who sold his farmland and placed the proceeds at the feet of the apostles. They nicknamed him Barnabas (or “Encourager”)."}]