[{"header":"The Tribal Portions"},{"num":48,"verse":"“These are the names of the tribes: From the northern end beside the road of Hethlon to Lebo Hamath, as far as Hazar Enan (which is on the border of Damascus, toward the north beside Hamath), extending from the east side to the west, Dan will have one portion. "},{"num":2,"verse":"Next to the border of Dan, from the east side to the west side, Asher will have one portion. "},{"num":3,"verse":"Next to the border of Asher from the east side to the west side, Naphtali will have one portion. "},{"num":4,"verse":"Next to the border of Naphtali from the east side to the west side, Manasseh will have one portion. "},{"num":5,"verse":"Next to the border of Manasseh from the east side to the west side, Ephraim will have one portion. "},{"num":6,"verse":"Next to the border of Ephraim from the east side to the west side, Reuben will have one portion. "},{"num":7,"verse":"Next to the border of Reuben from the east side to the west side, Judah will have one portion."},{"num":8,"verse":"“Next to the border of Judah from the east side to the west side will be the allotment you must set apart. It is to be 8¼ miles wide, and the same length as one of the tribal portions, from the east side to the west side; the sanctuary will be in the middle of it. "},{"num":9,"verse":"The allotment you set apart to the Lord will be 8¼ miles in length and 3⅓ miles in width. "},{"num":10,"verse":"These will be the allotments for the holy portion: for the priests, toward the north 8¼ miles in length, toward the west 3⅓ miles in width, toward the east 3⅓ miles in width, and toward the south 8¼ miles in length; the sanctuary of the Lord will be in the middle. "},{"num":11,"verse":"This will be for the priests who are set apart from the descendants of Zadok who kept my charge and did not go astray when the people of Israel strayed off, as the Levites did. "},{"num":12,"verse":"It will be their portion from the allotment of the land, a Most Holy Place, next to the border of the Levites."},{"num":13,"verse":"“Alongside the border of the priests, the Levites will have an allotment 8¼ miles in length and 3⅓ miles in width. The whole length will be 8¼ miles and the width 3⅓ miles. "},{"num":14,"verse":"They must not sell or exchange any of it; they must not transfer this choice portion of land, for it is set apart to the Lord."},{"num":15,"verse":"“The remainder, 1⅔ miles in width and 8¼ miles in length, will be for common use by the city, for houses and for open space. The city will be in the middle of it; "},{"num":16,"verse":"these will be its measurements: The north side will be 1½ miles, the south side 1½ miles, the east side 1½ miles, and the west side 1½ miles. "},{"num":17,"verse":"The city will have open spaces: On the north there will be 437½ feet, on the south 437½ feet, on the east 437½ feet, and on the west 437½ feet. "},{"num":18,"verse":"The remainder of the length alongside the holy allotment will be 3⅓ miles to the east and 3⅓ miles toward the west, and it will be beside the holy allotment. Its produce will be for food for the workers of the city. "},{"num":19,"verse":"The workers of the city from all the tribes of Israel will cultivate it. "},{"num":20,"verse":"The whole allotment will be 8¼ miles square; you must set apart the holy allotment with the possession of the city."},{"num":21,"verse":"“The rest, on both sides of the holy allotment and the property of the city, will belong to the prince. Extending from the 8¼ miles of the holy allotment to the east border, and westward from the 8¼ miles to the west border, alongside the portions, it will belong to the prince. The holy allotment and the sanctuary of the temple will be in the middle of it. "},{"num":22,"verse":"The property of the Levites and of the city will be in the middle of that which belongs to the prince. The portion between the border of Judah and the border of Benjamin will be for the prince."},{"num":23,"verse":"“As for the rest of the tribes: From the east side to the west side, Benjamin will have one portion. "},{"num":24,"verse":"Next to the border of Benjamin, from the east side to the west side, Simeon will have one portion. "},{"num":25,"verse":"Next to the border of Simeon, from the east side to the west side, Issachar will have one portion. "},{"num":26,"verse":"Next to the border of Issachar, from the east side to the west side, Zebulun will have one portion. "},{"num":27,"verse":"Next to the border of Zebulun, from the east side to the west side, Gad will have one portion. "},{"num":28,"verse":"Next to the border of Gad, at the south side, the border will run from Tamar to the waters of Meribah Kadesh, to the Stream of Egypt, and on to the Great Sea. "},{"num":29,"verse":"This is the land that you will allot to the tribes of Israel, and these are their portions, declares the Sovereign Lord."},{"num":30,"verse":"“These are the exits of the city: On the north side, 1½ miles by measure, "},{"num":31,"verse":"the gates of the city will be named for the tribes of Israel. There will be three gates to the north: one gate for Reuben, one gate for Judah, and one gate for Levi. "},{"num":32,"verse":"On the east side, 1½ miles in length, there will be three gates: one gate for Joseph, one gate for Benjamin, and one gate for Dan. "},{"num":33,"verse":"On the south side, 1½ miles by measure, there will be three gates: one gate for Simeon, one gate for Issachar, and one gate for Zebulun. "},{"num":34,"verse":"On the west side, 1½ miles in length, there will be three gates: one gate for Gad, one gate for Asher, and one gate for Naphtali. "},{"num":35,"verse":"The circumference of the city will be 6 miles. The name of the city from that day forward will be: ‘The Lord Is There.’”"}]