[{"header":"The Land Will Be Divided Up"},{"num":48,"verse":"“Here are the tribes. They are listed by their names."},{"num":8,"verse":"“You must give one share as a special gift to me. It will border the territory of Judah from east to west. It will be eight miles wide. It will be as long as the border of each of the territories of the tribes. Its border will run from east to west. The temple will be in the center of that strip of land."},{"num":9,"verse":"“Give that special share of land to me. It will be eight miles long and three and a third miles wide. "},{"num":10,"verse":"It will be the sacred share of land for the priests. It will be eight miles long on the north side. It will be three and a third miles wide on the west side. It will be three and a third miles wide on the east side. And it will be eight miles long on the south side. My temple will be in the center of it. "},{"num":11,"verse":"This share of land will be for the priests who are set apart to me. They will come from the family line of Zadok. The members of that family served me faithfully. They did not go astray as the Levites and other Israelites did. "},{"num":12,"verse":"Their share of land will be a special gift to them. It will be part of the sacred share of the land. It will be very holy. Its border will run along the territory of the Levites."},{"num":13,"verse":"“The Levites will receive a share. It will be next to the territory of the priests. The Levites’ share will be eight miles long and three and a third miles wide. "},{"num":14,"verse":"They must not sell or trade any of it. It is the best part of the land. It must not be handed over to anyone else. It is set apart to me."},{"num":15,"verse":"“The area that remains is one and two-thirds miles wide. It is eight miles long. It will not be holy. The people in Jerusalem can build houses there. They can use some of it as grasslands. The city will be in the center of it. "},{"num":16,"verse":"Each of the four sides of the city will be one and a half miles long. "},{"num":17,"verse":"Each of the four sides of the city’s grasslands will be 440 feet long. "},{"num":18,"verse":"What remains of the area will be three and a third miles long on the east and west sides. Its border will run along the border of the sacred share. Its crops will supply food for the city workers. "},{"num":19,"verse":"They will farm the area. They will come from all the tribes of Israel. "},{"num":20,"verse":"The entire area will be a square. Each of its four sides will be eight miles long. Set the sacred share apart as a special gift to me. Do the same thing with the property of the city."},{"num":21,"verse":"“The area that remains on both sides will belong to the prince. So his land does not include the sacred share and the property of the city. The eastern part of his land will reach from the sacred share all the way to the eastern border. The western part will reach from the sacred share to the western border. The sacred share itself is eight miles long on its east and west sides. Both of those areas will be right next to the borders of the two tribes on the north and south sides. They will belong to the prince. The sacred share will be in the center of them. It will have the temple in it. "},{"num":22,"verse":"The property of the Levites will lie in the center of the prince’s share. So will the property of the city. The prince’s land will lie between the borders of the tribes of Judah and Benjamin."},{"num":23,"verse":"“Here is the land for the rest of the tribes."},{"num":29,"verse":"“This is the land you must divide among the tribes of Israel. And these will be the shares they will receive,” announces the Lord and King."},{"header":"The Gates of the New City"},{"num":30,"verse":"“Here is a list of the gates of the city."},{"num":35,"verse":"“The city will be six miles around."}]