[[],[{"type":"header","content":"Samson Carries Away Gaza’s Gates"},{"type":"prose","content":"One day Samson went to the Philistine town of Gaza and spent the night with a prostitute."}],[{"type":"prose","content":"Word soon spread that Samson was there, so the men of Gaza gathered together and waited all night at the town gates. They kept quiet during the night, saying to themselves, “When the light of morning comes, we will kill him.”"}],[{"type":"prose","content":"But Samson stayed in bed only until midnight. Then he got up, took hold of the doors of the town gate, including the two posts, and lifted them up, bar and all. He put them on his shoulders and carried them all the way to the top of the hill across from Hebron."},{"type":"header","content":"Samson and Delilah"}],[{"type":"prose","content":"Some time later Samson fell in love with a woman named Delilah, who lived in the valley of Sorek."}],[{"type":"prose","content":"The rulers of the Philistines went to her and said, “Entice Samson to tell you what makes him so strong and how he can be overpowered and tied up securely. Then each of us will give you 1,100 pieces of silver.”"}],[{"type":"prose","content":"So Delilah said to Samson, “Please tell me what makes you so strong and what it would take to tie you up securely.”"}],[{"type":"prose","content":"Samson replied, “If I were tied up with seven new bowstrings that have not yet been dried, I would become as weak as anyone else.”"}],[{"type":"prose","content":"So the Philistine rulers brought Delilah seven new bowstrings, and she tied Samson up with them."}],[{"type":"prose","content":"She had hidden some men in one of the inner rooms of her house, and she cried out, “Samson! The Philistines have come to capture you!” But Samson snapped the bowstrings as a piece of string snaps when it is burned by a fire. So the secret of his strength was not discovered."}],[{"type":"prose","content":"Afterward Delilah said to him, “You’ve been making fun of me and telling me lies! Now please tell me how you can be tied up securely.”"}],[{"type":"prose","content":"Samson replied, “If I were tied up with brand-new ropes that had never been used, I would become as weak as anyone else.”"}],[{"type":"prose","content":"So Delilah took new ropes and tied him up with them. The men were hiding in the inner room as before, and again Delilah cried out, “Samson! The Philistines have come to capture you!” But again Samson snapped the ropes from his arms as if they were thread."}],[{"type":"prose","content":"Then Delilah said, “You’ve been making fun of me and telling me lies! Now tell me how you can be tied up securely.”Samson replied, “If you were to weave the seven braids of my hair into the fabric on your loom and tighten it with the loom shuttle, I would become as weak as anyone else.”So while he slept, Delilah wove the seven braids of his hair into the fabric."}],[{"type":"prose","content":"Then she tightened it with the loom shuttle. Again she cried out, “Samson! The Philistines have come to capture you!” But Samson woke up, pulled back the loom shuttle, and yanked his hair away from the loom and the fabric."}],[{"type":"prose","content":"Then Delilah pouted, “How can you tell me, ‘I love you,’ when you don’t share your secrets with me? You’ve made fun of me three times now, and you still haven’t told me what makes you so strong!”"}],[{"type":"prose","content":"She tormented him with her nagging day after day until he was sick to death of it."}],[{"type":"prose","content":"Finally, Samson shared his secret with her. “My hair has never been cut,” he confessed, “for I was dedicated to God as a Nazirite from birth. If my head were shaved, my strength would leave me, and I would become as weak as anyone else.”"}],[{"type":"prose","content":"Delilah realized he had finally told her the truth, so she sent for the Philistine rulers. “Come back one more time,” she said, “for he has finally told me his secret.” So the Philistine rulers returned with the money in their hands."}],[{"type":"prose","content":"Delilah lulled Samson to sleep with his head in her lap, and then she called in a man to shave off the seven locks of his hair. In this way she began to bring him down, and his strength left him."}],[{"type":"prose","content":"Then she cried out, “Samson! The Philistines have come to capture you!”When he woke up, he thought, “I will do as before and shake myself free.” But he didn’t realize the  had left him."}],[{"type":"prose","content":"So the Philistines captured him and gouged out his eyes. They took him to Gaza, where he was bound with bronze chains and forced to grind grain in the prison."}],[{"type":"prose","content":"But before long, his hair began to grow back."},{"type":"header","content":"Samson’s Final Victory"}],[{"type":"prose","content":"The Philistine rulers held a great festival, offering sacrifices and praising their god, Dagon. They said, “Our god has given us victory over our enemy Samson!”"}],[{"type":"prose","content":"When the people saw him, they praised their god, saying, “Our god has delivered our enemy to us! The one who killed so many of us is now in our power!”"}],[{"type":"prose","content":"Half drunk by now, the people demanded, “Bring out Samson so he can amuse us!” So he was brought from the prison to amuse them, and they had him stand between the pillars supporting the roof."}],[{"type":"prose","content":"Samson said to the young servant who was leading him by the hand, “Place my hands against the pillars that hold up the temple. I want to rest against them.”"}],[{"type":"prose","content":"Now the temple was completely filled with people. All the Philistine rulers were there, and there were about 3,000 men and women on the roof who were watching as Samson amused them."}],[{"type":"prose","content":"Then Samson prayed to the , “Sovereign , remember me again. O God, please strengthen me just one more time. With one blow let me pay back the Philistines for the loss of my two eyes.”"}],[{"type":"prose","content":"Then Samson put his hands on the two center pillars that held up the temple. Pushing against them with both hands,"}],[{"type":"prose","content":"he prayed, “Let me die with the Philistines.” And the temple crashed down on the Philistine rulers and all the people. So he killed more people when he died than he had during his entire lifetime."}],[{"type":"prose","content":"Later his brothers and other relatives went down to get his body. They took him back home and buried him between Zorah and Eshtaol, where his father, Manoah, was buried. Samson had judged Israel for twenty years."}]]