[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-8 Whatever methods are used, it is vain to contend with God's judgments. The more we indulge in the pleasures of this life, the more we unfit ourselves for the troubles of this life. The Chaldean army shall break in upon the land of Judah, and in a little time devour all. The day is coming, when those careless and secure in sinful ways will be visited. It is folly to trifle when we have eternal salvation to work out, and the enemies of that salvation to fight against. But they were thus eager, not that they might fulfil God's counsels, but that they might fill their own treasures; yet God thereby served his own purposes. The corrupt heart of man, in its natural state, casts out evil thoughts, just as a fountain casts out her waters. It is always flowing, yet always full. The God of mercy is loth to depart even from a provoking people, and is earnest with them, that by repentance and reformation, they may prevent things from coming to extremity.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Up! and we will make the assault \"by night!\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And destroy \"her palaces.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The generals delay the assault until the next morning. The soldiers consider themselves aggrieved at this, and clamour for a night attack. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The generals delay the assault until the next morning. The soldiers consider themselves aggrieved at this, and clamour for a night attack. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4, 5. The invading soldiers encourage one another to the attack on Jerusalem.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Prepare—literally, \"Sanctify\" war, that is, Proclaim it formally with solemn rites; the invasion was solemnly ordered by God (compare Isa 13:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "at noon—the hottest part of the day when attacks were rarely made (Jer 15:8; 20:16). Even at this time they wished to attack, such is their eagerness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Woe unto us—The words of the invaders, mourning the approach of night which would suspend their hostile operations; still, even in spite of the darkness, at night they renew the attack (Jer 6:5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let us go by night, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this night",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They were set upon it, they would lose neither day nor night; which shows that they were extraordinarily stirred up by God in this expedition. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let us destroy her palaces:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this was the bait or motive that they propounded to themselves, viz. to have the spoil of all the stately palaces and rich houses of the nobles and great ones. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Arise, and let us go up by night,.... Since they could not take the city at noon, and by day, as they expected, they propose to attempt it by night; they would lose no time, but proceed on, day and night, until they had accomplished their end; this shows how much they were resolved upon it, and that nothing could discourage from it; and that they were sure of carrying their point: and therefore it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and let us destroy her palaces; the tower and strong hold of Zion, the temple of Jerusalem, the king's palace, the houses of the high priest, judges, counsellors, and other civil magistrates, as well as the cottages of the meaner sort of people; for the Vulgate Latin version renders it, \"her houses\"; which, notwithstanding her strong walls, were not secure from the enemy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and let us destroy her palaces; the tower and strong hold of Zion, the temple of Jerusalem, the king's palace, the houses of the high priest, judges, counsellors, and other civil magistrates, as well as the cottages of the meaner sort of people; for the Vulgate Latin version renders it, \"her houses\"; which, notwithstanding her strong walls, were not secure from the enemy. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Arise, and let us go by night, and let us destroy her palaces.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The impatience of the soldiers at the delay takes the form of a demand for a night assault. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "palaces",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] LXX here and often translate by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θεμέλια",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "foundations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though varying much elsewhere in the rendering of the word, and significantly avoiding “palaces.” See Article by Mr P. J. Heywood (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "J. Th. S.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " XIII. pp. 66 ff.), who suggests that the word denoted primarily the general outline or ground plan as formed by the ramification of streets and buildings, and that the main reference of the word is to the streets and lanes, rather than to higher erections. See his discussion of numerous passages. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he renders accordingly “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lanes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "quarters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").” In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though “palaces” is not an unsuitable sense for the context, LXX have ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄμφοδα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", apparently the houses with the streets round about them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Let us go; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "let us go up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"To go up\" is the technical term for the movements of armies, whether advancing (as here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or retreating (as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 34:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 37:5, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jeremiah 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The description passes from figure to reality, and the enemies appear before us as speaking, inciting one another to the combat, encouraging one another to storm the city. To sanctify a war, i.e., prepare themselves for the war by religious consecration, inasmuch as the war was undertaken under commission from God, and because the departure of the army, like the combat itself, was consecrated by sacrifice and other religious ceremonies; see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". עלה, to go up against a place as an enemy, not, go up upon, in which case the object, them (the city or walls), could not be omitted. It is plainly the storming or capture of the town that is meant by the going up; hence we may understand what follows: and we will destroy her palaces. We have a rousing call to go up at noon or in clear daylight, joined with \"woe to us,\" a cry of disappointment that they will not be able to gain their ends so soon, not indeed till night; in these we see the great eagerness with which they carry on the assault. יום פּנה, the day turns itself, declines towards its end; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 90:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The enemies act under a commission from God, who has imposed on them the labour of the siege, in order to punish Jerusalem for her sins. Jahveh is here most fittingly called the God of hosts; for as God of the world, obeyed by the armies of heaven, He commands the kings of the earth to chastise His people. Hew wood, i.e., fell trees for making the siege works, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 20:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", both for raising the attacking ramparts,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Agger ex terra lignisque attollitur contra murum, de quo tela jactantur. Veget. de re milit. iv. 15.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and for the entire apparatus necessary for storming the town. עצה is not a collective form from עץ, like דּגה from דּג; but the ה is a suffix in spite of the omission of the Mappik, which is given by but a few of the codd., eastern and western, for we know that Mappik is sometimes omitted, e.g., Numbers 15:28, Numbers 15:31; cf. Ew. 247, d. We are encouraged to take it so by Deuteronomy 20:19, where עצה are the trees in the vicinity of the town, of which only the fruit trees were to be spared in case of siege, while those which did not bear eatable fruit were to be made use of for the purposes of the siege. And thus we must here, too, read עצה, and refer the suffix to the next noun (Jerusalem). On \"pile up a rampart,\" cf. 2 Samuel 20:5; Ezekiel 4:2, etc. הפקד is used as passive of Kal, and impersonally. The connection with העיר is to be taken like חנה in Isaiah 29:1 : the city where it is punished, or perhaps like Psalm 59:6, the relative being supplied: that is punished. כּלּהּ is not to be joined, contrary to the accents, with הפקד (Ven., J. D. Mich.), a connection which, even if it were legitimate, would give but a feeble thought. It belongs to what follows, \"she is wholly oppression in her midst,\" i.e., on all sides in her there is oppression. This is expanded in Jeremiah 6:7. lxx and Jerome have taken הקיר from קרר, and translate: like as a cistern keeps its water cool (ψύχει, frigidam facit), so she keeps her wickedness cool. Hitz. has pronounced in favour of this interpretation, but changes \"keep cool\" into \"keep fresh,\" and understands the metaphor thus: they take good care that their wickedness does not stagnate or become impaired by disuse. But it would be a strange metaphor to put \"keep wickedness cool,\" for \"maintain it in strength and vigour.\" We therefore, along with Luth. and most commentators, prefer the rabbinical interpretation: as a well makes its water to gush out, etc.; for there is no sufficient force in the objection that מקור from קוּר, dig, is not a spring but a well, that הקיר has still less the force of making to gush forth, and that בּור wholly excludes the idea of causing to spring out. The first assertion is refuted by Jeremiah 2:13, מקור, fountain of living water; whence it is clear that the word does mean a well fed by a spring. It is true, indeed, that the word בּור, a later way of writing בּאר (cf. 1 Chronicles 11:17. 22 with 2 Samuel 23:15. 20), means usually, a pit, a cistern dug out; but this form is not substantially different from בּאר, well, puteus, which is used for בּור in Psalm 55:24 and Psalm 69:16. Accordingly, this latter form can undoubtedly stand with the force of בּאר, as has been admitted by the Masoretes when they substituted for it בּאר; cf. the Arab. bi'run. The noun מקור puts beyond doubt the legitimacy of giving to הקיר, from קוּר, to dig a well, the signification of making water to gush forth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and for the entire apparatus necessary for storming the town. עצה is not a collective form from עץ, like דּגה from דּג; but the ה is a suffix in spite of the omission of the Mappik, which is given by but a few of the codd., eastern and western, for we know that Mappik is sometimes omitted, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 15:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 15:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf. Ew. 247, d. We are encouraged to take it so by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 20:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where עצה are the trees in the vicinity of the town, of which only the fruit trees were to be spared in case of siege, while those which did not bear eatable fruit were to be made use of for the purposes of the siege. And thus we must here, too, read עצה, and refer the suffix to the next noun (Jerusalem). On \"pile up a rampart,\" cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 20:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. הפקד is used as passive of Kal, and impersonally. The connection with העיר is to be taken like חנה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : the city where it is punished, or perhaps like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the relative being supplied: that is punished. כּלּהּ is not to be joined, contrary to the accents, with הפקד (Ven., J. D. Mich.), a connection which, even if it were legitimate, would give but a feeble thought. It belongs to what follows, \"she is wholly oppression in her midst,\" i.e., on all sides in her there is oppression. This is expanded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". lxx and Jerome have taken הקיר from קרר, and translate: like as a cistern keeps its water cool (ψύχει, frigidam facit), so she keeps her wickedness cool. Hitz. has pronounced in favour of this interpretation, but changes \"keep cool\" into \"keep fresh,\" and understands the metaphor thus: they take good care that their wickedness does not stagnate or become impaired by disuse. But it would be a strange metaphor to put \"keep wickedness cool,\" for \"maintain it in strength and vigour.\" We therefore, along with Luth. and most commentators, prefer the rabbinical interpretation: as a well makes its water to gush out, etc.; for there is no sufficient force in the objection that מקור from קוּר, dig, is not a spring but a well, that הקיר has still less the force of making to gush forth, and that בּור wholly excludes the idea of causing to spring out. The first assertion is refuted by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", מקור, fountain of living water; whence it is clear that the word does mean a well fed by a spring. It is true, indeed, that the word בּור, a later way of writing בּאר (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". 22 with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". 20), means usually, a pit, a cistern dug out; but this form is not substantially different from בּאר, well, puteus, which is used for בּור in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 69:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Accordingly, this latter form can undoubtedly stand with the force of בּאר, as has been admitted by the Masoretes when they substituted for it בּאר; cf. the Arab. bi'run. The noun מקור puts beyond doubt the legitimacy of giving to הקיר, from קוּר, to dig a well, the signification of making water to gush forth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The form הקרה is indeed referable to קרר, but only shows, as is otherwise well known, that no very strict line of demarcation can be drawn between the forms of verbs 'עע and 'הקיר ;עו, again, is formed regularly from קוּר. Violence and spoiling; cf. Jeremiah 20:8, and Amos 3:10; Habakkuk 1:3. \"Before my face,\" before mine eyes, corresponds to \"is heard,\" as wounds and smitings are the consequences of violence. On that head, cf. Psalm 55:10-12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The form הקרה is indeed referable to קרר, but only shows, as is otherwise well known, that no very strict line of demarcation can be drawn between the forms of verbs 'עע and 'הקיר ;עו, again, is formed regularly from קוּר. Violence and spoiling; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 20:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Before my face,\" before mine eyes, corresponds to \"is heard,\" as wounds and smitings are the consequences of violence. On that head, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:10-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      }
    ]
  }
]