[[],[{"type":"prose","content":"The words of Jeremiah, the son of Hilkiah, one of the priests who were in Anathoth in the land of Benjamin,"}],[{"type":"prose","content":"to whom the word of the  came in the days of Josiah the son of Amon, king of Judah, in the thirteenth year of his reign."}],[{"type":"prose","content":"It came also in the days of Jehoiakim the son of Josiah, king of Judah, and until the end of the eleventh year of Zedekiah, the son of Josiah, king of Judah, until the captivity of Jerusalem in the fifth month."},{"type":"header","content":"The Call of Jeremiah"}],[{"type":"prose","content":"Now the word of the  came to me, saying,"}],[{"type":"prose","content":"Then I said, “Ah, Lord ! Behold, I do not know how to speak, for I am only a youth.”"}],[{"type":"prose","content":"But the  said to me,"}],[{"type":"prose","content":"Then the  put out his hand and touched my mouth. And the  said to me,"}],[{"type":"prose","content":"And the word of the  came to me, saying, “Jeremiah, what do you see?” And I said, “I see an almond branch.”"}],[{"type":"prose","content":"Then the  said to me, “You have seen well, for I am watching over my word to perform it.”"}],[{"type":"prose","content":"The word of the  came to me a second time, saying, “What do you see?” And I said, “I see a boiling pot, facing away from the north.”"}],[{"type":"prose","content":"Then the  said to me, “Out of the north disaster shall be let loose upon all the inhabitants of the land."}],[{"type":"prose","content":"For behold, I am calling all the tribes of the kingdoms of the north, declares the , and they shall come, and every one shall set his throne at the entrance of the gates of Jerusalem, against all its walls all around and against all the cities of Judah."}],[{"type":"prose","content":"And I will declare my judgments against them, for all their evil in forsaking me. They have made offerings to other gods and worshiped the works of their own hands."}],[{"type":"prose","content":"But you, dress yourself for work; arise, and say to them everything that I command you. Do not be dismayed by them, lest I dismay you before them."}],[{"type":"prose","content":"And I, behold, I make you this day a fortified city, an iron pillar, and bronze walls, against the whole land, against the kings of Judah, its officials, its priests, and the people of the land."}],[{"type":"prose","content":"They will fight against you, but they shall not prevail against you, for I am with you, declares the , to deliver you.”"}]]