[{"num":1,"verse":"The words of Jeremy, son of Hilkiah, of the priests that were in Anathoth, in the land of Benjamin. (The words of Jeremiah, the son of Hilkiah, one of the priests who were in Anathoth, in the land of Benjamin.)"},{"num":2,"verse":"For the word of the Lord was made to him in the days of Josiah, the son of Amon, king of Judah, in the thirteenth year of his realm. (For the word of the Lord was made to him in the days of Josiah, the son of Amon, the king of Judah, in the thirteenth year of his reign.)"},{"num":3,"verse":"And it was done in the days of Jehoiakim, the son of Josiah, the king of Judah, unto the ending of the eleventh year of Zedekiah, son of Josiah, king of Judah, till to the passing over, either (the taking into) captivity, of Jerusalem, in the fifth month. (And it was done in the days of Jehoiakim, the son of Josiah, the king of Judah, unto the end of the eleventh year of Zedekiah, the son of Josiah, the king of Judah, until the taking into captivity, or the exile, of the people of Jerusalem, in the fifth month.)"},{"num":4,"verse":"And the word of the Lord was made to me, and said,"},{"num":5,"verse":"Before that I formed thee in the womb, I knew thee; and before that thou wentest out of the womb, I hallowed thee; and I gave thee to be a prophet among folks. (Before that I formed thee in the womb, I knew thee; and before that thou wentest out of the womb, I consecrated, or dedicated, thee; and I gave thee to be a prophet among the nations.)"},{"num":6,"verse":"And I said, A! A! A! Lord God, lo! I cannot speak, for I am a child. (And I said, O! O! O! Lord God, lo! I cannot speak, for I am but a child.)"},{"num":7,"verse":"And the Lord said to me, Do not thou say, that I am a child; for thou shalt go to all things, to which I shall send thee, and thou shalt speak all things, whatever things I shall command to thee. (And the Lord said to me, Do not thou say, that I am but a child; for thou shalt go to whatever people I shall send thee, and thou shalt say whatever words I shall command thee.)"},{"num":8,"verse":"Dread thou not of the face of them; for I am with thee, to deliver thee, saith the Lord. (Fear thou not them; for I am with thee, to keep thee safe, saith the Lord./Do not thou fear them, for I am with thee, to protect thee, saith the Lord.)"},{"num":9,"verse":"And the Lord sent his hand, and touched my mouth; and the Lord said to me, Lo! I have given my words in thy mouth; (And the Lord put forth his hand, and touched my mouth; and the Lord said to me, Lo! I have put my words in thy mouth;)"},{"num":10,"verse":"lo! I have ordained thee today on folks, and on realms (lo! today I have ordained thee over nations, and over kingdoms), that thou draw up, and destroy, and lose, and scatter, and build, and plant."},{"num":11,"verse":"And the word of the Lord was made to me, and said, What seest thou, Jeremy? And I said, I see a rod wakening. (And the word of the Lord was made to me, and said, What seest thou, Jeremiah? And I said, I see a branch, or a shoot, of an almond tree.)"},{"num":12,"verse":"And the Lord said to me, Thou hast seen well, for I shall wake on my word, to do it. (And the Lord said to me, Thou hast seen well, for I am on watch, to carry out my word.)"},{"num":13,"verse":"And the word of the Lord was made the second time to me, and said, What seest thou? [And I said,] I see a pot boiling, and the face thereof from the face of the north (And I said, I see a boiling pot, and its face is towards the north)."},{"num":14,"verse":"And the Lord said to me, From the north shall be showed all evil on all the dwellers of the land. (And the Lord said to me, From the north shall come all evil for all the inhabitants of this land.)"},{"num":15,"verse":"For lo! I shall call together all the nations of [the] realms of the north, saith the Lord; and they shall come, and set each man his seat in the entering of the gates of Jerusalem, and on all the walls thereof in compass, and on all the cities of Judah. (For lo! I shall call together all the nations of the kingdoms of the north, saith the Lord; and they shall come, and each king shall set up his throne before the gates of Jerusalem, and against the walls all around it, and in all the cities of Judah.)"},{"num":16,"verse":"And I shall speak my dooms with them on all the malice of them, that forsook me, and made sacrifice to alien gods, and worshipped the work of their hands. (And I shall tell out my judgement of them, for all the malice of those who have deserted me, and made sacrifice to strange, or foreign, gods, and who worshipped the work of their own hands.)"},{"num":17,"verse":"Therefore gird [up] thou thy loins, and rise thou (up), and speak to them all things which I command to thee; dread thou not of the face of them, for I shall not make thee for to dread the cheer of them. (And so gird thou up thy loins, and rise thou up, and say to them all the things which I command thee; fear thou not to go before them, or else I shall truly make thee afraid when thou art before them.)"},{"num":18,"verse":"For I gave thee today into a strong city, and into an iron pillar, and into a brazen wall, on all the land, to the kings of Judah, and to the princes thereof, and to the priests thereof, and to all the people of the land. (For I have made thee this day like a strong city, and like an iron pillar, and like a bronze wall, to stand against all the land, yea, against the kings of Judah, and its princes, or its leaders, and its priests, and all the people of the land.)"},{"num":19,"verse":"And they shall fight against thee, and they shall not have the mastery; for I am with thee, saith the Lord, that I deliver thee. (And they shall fight against thee, but they shall not have the mastery; for I am with thee, saith the Lord, and I shall keep thee safe.)"}]