[[],[{"type":"header","content":"The Seven Lamps"},{"type":"prose","content":"Then the LORD spoke to Moses, saying, "}],[{"type":"prose","content":"“Speak to Aaron and say to him, ‘When you set up  light the lamps, the seven lamps will shine in front of the lampstand.’” "}],[{"type":"prose","content":"And Aaron did so; he set up the lamps at the front of the lampstand, just as the LORD had commanded Moses. "}],[{"type":"prose","content":"Now this was the workmanship of the lampstand: hammered work of gold; from its base to its flowers it was hammered work; according to the pattern which the LORD had shown Moses, so he made the lampstand."}],[{"type":"header","content":"Cleansing the Levites"},{"type":"prose","content":"Again the LORD spoke to Moses, saying, "}],[{"type":"prose","content":"“Take the Levites from among the sons of Israel and cleanse them. "}],[{"type":"prose","content":"This is what you shall do to them to [ceremonially] cleanse them: sprinkle the water of purification on them, and let them use a razor over their whole body and wash their clothes, and they will be clean. "}],[{"type":"prose","content":"Then let them take a young bull and its grain offering of fine flour mixed with oil, and you shall take another young bull as a sin offering. "}],[{"type":"prose","content":"You shall present the Levites before the Tent of Meeting (tabernacle), and you shall also assemble the whole congregation of the children of Israel, "}],[{"type":"prose","content":"and present the Levites before the LORD, and the Israelites shall lay their hands on the Levites. "}],[{"type":"prose","content":"Aaron shall present the Levites before the LORD as a wave offering from the Israelites, so that they may perform the service of the LORD. "}],[{"type":"prose","content":"Then the Levites shall lay their hands on the heads of the bulls, then you are to offer the one as a sin offering and the other as a burnt offering to the LORD, to make atonement for the Levites. "}],[{"type":"prose","content":"You shall have the Levites stand before Aaron and his sons and present them as a wave offering to the LORD."}],[{"type":"prose","content":"“Thus you shall separate the Levites from among the Israelites, and the Levites shall be Mine [in a very special sense]. "}],[{"type":"prose","content":"Then after that the Levites may go in to serve the Tent of Meeting (tabernacle), but you shall cleanse them [first] and present them as a wave offering; "}],[{"type":"prose","content":"for they are wholly given to Me from among the Israelites. I have taken them for Myself instead of all who are born first, the firstborn of all the Israelites. "}],[{"type":"prose","content":"For all the firstborn among the Israelites are Mine, among the men and among the animals; on the day that I struck down every firstborn in the land of Egypt, I sanctified  set the Israelites apart for Myself. "}],[{"type":"prose","content":"And I have taken the Levites instead of every firstborn among the Israelites. "}],[{"type":"prose","content":"I have given the Levites as a gift to Aaron and to his sons from among the Israelites, to perform the service of the Israelites at the Tent of Meeting (tabernacle) and to make atonement for them, so that there will be no plague among the Israelites if they should approach the sanctuary.”"}],[{"type":"prose","content":"Thus Moses and Aaron and all the congregation of the children of Israel did [these things] to the Levites; in accordance with all that the LORD had commanded Moses concerning the Levites, so the Israelites did to them. "}],[{"type":"prose","content":"The Levites, too, purified themselves from sin and they washed their clothes; and Aaron presented them as a wave offering before the LORD, and Aaron made atonement for them to cleanse them. "}],[{"type":"prose","content":"Then after that the Levites went in to perform their service in the Tent of Meeting before Aaron and his sons; just as the LORD had commanded Moses concerning the Levites, so they did to them."}],[{"type":"header","content":"Retirement"},{"type":"prose","content":"Now the LORD spoke to Moses, saying, "}],[{"type":"prose","content":"“This is what  to the Levites: from twenty-five years old and upward they shall enter to perform service in the work of the Tent of Meeting, "}],[{"type":"prose","content":"but at the age of fifty years, they shall retire from the service of the [tabernacle] work and serve no longer. "}],[{"type":"prose","content":"They may assist their brothers in the Tent of Meeting to keep an obligation, but they shall do no [heavy or difficult] work. Thus you shall deal with the Levites concerning their obligations.”"}]]