[{"header":"The Seven Lamps(A)"},{"num":8,"verse":"The Lord told Moses, "},{"num":2,"verse":"“Tell Aaron, ‘When you set up the lamps, the seven lamps will illuminate the area in front of the lamp stand.’” "},{"num":3,"verse":"So Aaron did so, setting up the lamps to illuminate the area in front of the lamp stand, just as the Lord had commanded Moses. "},{"num":4,"verse":"This was how the lamp stand was crafted from hammered gold: From its base to its flowers, it was made of hammered gold. Moses crafted the lamp stand just as the Lord had showed him."},{"header":"Purifying the Descendants of Levi"},{"num":5,"verse":"Then the Lord told Moses, "},{"num":6,"verse":"“Take the descendants of Levi from the Israelis and purify them. "},{"num":7,"verse":"This is what you are to do for them in order to purify them: Sprinkle purifying water over them, have them shave their skin, and then have them wash their garments, and they will be purified. "},{"num":8,"verse":"They are to take a young bull along with its meal offering made of flour mixed with oil. Then you are to take a second young bull as a sin offering. "},{"num":9,"verse":"Assemble the descendants of Levi in front of the appointed place of meeting, and assemble the whole congregation of Israel, too. "},{"num":10,"verse":"Bring the descendants of Levi into the Lord’s presence and have the Israelis lay their hands on the descendants of Levi."},{"num":11,"verse":"“Then Aaron is to present the descendants of Levi as a wave offering before the Lord from the Israelis, because they are to work in the service of the Lord. "},{"num":12,"verse":"The descendants of Levi are then to lay their hands on the head of the bulls, offering one for a sin offering and the other one for a burnt offering to the Lord to atone for the descendants of Levi. "},{"num":13,"verse":"You are to make the descendants of Levi stand in the presence of Aaron and his sons. Then you are to wave them as wave offerings to the Lord. "},{"num":14,"verse":"This is how you are to separate the descendants of Levi from among the Israelis. The descendants of Levi belong to me."},{"num":15,"verse":"“After this, the descendants of Levi are to come to serve at the appointed place of meeting, after you have purified them and presented them as wave offerings, "},{"num":16,"verse":"since they’ve been set apart for me from among the Israelis. I’ve taken them for myself instead of the first to open the womb—every firstborn of the Israelis, "},{"num":17,"verse":"since every firstborn of Israel belongs to me, from human beings to livestock. On the same day that I destroyed all the firstborn in the land of Egypt, I consecrated them to myself, "},{"num":18,"verse":"taking the descendants of Levi instead of every firstborn of the Israelis. "},{"num":19,"verse":"I’ve set the descendants of Levi apart from the Israelis so that Aaron and his sons would work in service at the appointed place of meeting, making atonement on behalf of the Israelis so that there won’t be a plague among the Israelis whenever they approach the sanctuary.”"},{"num":20,"verse":"So Moses and Aaron and the Israelis did this on behalf of the descendants of Levi. The Israelis did everything that the Lord commanded concerning the descendants of Levi. "},{"num":21,"verse":"The descendants of Levi therefore purified themselves, washed their clothes, and then Aaron presented them as wave offerings to the Lord. Aaron provided atonement for them to purify them. "},{"num":22,"verse":"After this, the descendants of Levi entered into their work of service at the appointed place, in the presence of Aaron and his sons. They did everything that the Lord commanded Moses concerning the descendants of Levi."},{"header":"Age Restrictions for the Descendants of Levi"},{"num":23,"verse":"Later, the Lord told Moses, "},{"num":24,"verse":"“Now regarding a descendant of Levi who is 25 years and above, he is to enter work in the service at the appointed place of meeting, "},{"num":25,"verse":"but starting at 50 years of age, he is to retire from service and is no longer to work. "},{"num":26,"verse":"He may minister to his brothers at the Tent of Meeting by keeping watch, but he is not to engage in service. This is how you are to act with respect to the obligations of the descendants of Levi.”"}]