[{"header":"Dedication of the Levites"},{"num":8,"verse":"Adonai spoke to Moses saying, "},{"num":2,"verse":"“Speak to Aaron and say to him: When you erect the lamps, the seven lamps are to illuminate the area in front of the menorah.” "},{"num":3,"verse":"Aaron did so. He erected the lamps facing forward so they illuminated the area in front of the menorah, just as Adonai had commanded Moses. "},{"num":4,"verse":"Now this is how the menorah was made: hammered gold from its base to its blossoms. Just as was the pattern that Adonai had shown to Moses, so he made the menorah."},{"num":5,"verse":"Again Adonai spoke to Moses saying, "},{"num":6,"verse":"“Take the Levites from among Bnei-Yisrael and ceremonially cleanse them. "},{"num":7,"verse":"This is what you must do to them to make them clean: Sprinkle the purifying water on them, then have them shave their whole bodies and wash their clothes, thus purifying themselves."},{"num":8,"verse":"“Then they are to take a young bull with its grain offering of fine flour mixed with oil, plus a second young bull for a sin offering. "},{"num":9,"verse":"Bring the Levites before the Tent of Meeting, and gather the whole community of Bnei-Yisrael. "},{"num":10,"verse":"Bring the Levites before Adonai, Bnei-Yisrael will lay their hands on the Levites, "},{"num":11,"verse":"and Aaron will present the Levites before Adonai as a wave offering from Bnei-Yisrael. Then they may go about the work of the service of Adonai."},{"num":12,"verse":"“The Levites are to lay their hands on the heads of the bulls. Use one for a sin offering and the other for a burnt offering to Adonai to make atonement for the Levites. "},{"num":13,"verse":"Have the Levites stand before Aaron and his sons and present them as a wave offering to Adonai. "},{"num":14,"verse":"In this way you are to set apart the Levites from Bnei-Yisrael to be Mine. "},{"num":15,"verse":"After you have purified them and presented them as a wave offering, the Levites will come to do their work at the Tent of Meeting. "},{"num":16,"verse":"For they are the ones from among Bnei-Yisrael given to Me in place of all the first from the wombs of Bnei-Yisrael. I have taken them for Myself."},{"num":17,"verse":"“For every firstborn among Bnei-Yisrael is Mine, whether human or animal. On the day I struck down the firstborn of the land of Egypt, I sanctified them for Myself."},{"num":18,"verse":" So I am taking the Levites in place of the firstborn of Bnei-Yisrael, "},{"num":19,"verse":"and I am giving the Levites as a gift to Aaron and his sons from among Bnei-Yisrael, to do the work on behalf of Bnei-Yisrael in the Tent of Meeting, and to make atonement for them—so that there would be no plague among them for coming too close to the Sanctuary.”"},{"num":20,"verse":"So Moses, Aaron and the entire community of Bnei-Yisrael did so with the Levites. All that Adonai had commanded Moses regarding the Levites, so Bnei-Yisrael did to them. "},{"num":21,"verse":"The Levites also purified themselves from sin and washed their clothes. Aaron presented them as a wave offering before Adonai, and, he made atonement for them to purify them. "},{"num":22,"verse":"After that, the Levites came to do their tasks before Aaron and his sons in the Tent of Meeting, just as Adonai had commanded Moses concerning the Levites."},{"num":23,"verse":"Adonai again spoke to Moses saying, "},{"num":24,"verse":"“This is for the Levites. Men 25 years old and upward are to present themselves for service to work in the Tent of Meeting. "},{"num":25,"verse":"But at the age of 50 he is to retire from his service and work no longer. "},{"num":26,"verse":"He may assist his brothers in the Tent of Meeting to do their duties, but he himself will no longer do the work. Thus, you are to assign to the Levites their responsibilities.”"}]