[{"header":"Dealing with False Prophets"},{"num":13,"verse":"“A prophet or a diviner of dreams may arise among you, give you an omen or a miracle "},{"num":2,"verse":"that takes place, and then he may tell you, ‘Let’s follow other gods (whom you have not known) and let’s serve them.’ Even though the sign or portent comes to pass, "},{"num":3,"verse":"you must not listen to the words of that prophet or that diviner of dreams. For the Lord your God is testing you, to make known whether or not you’ll continue to love the Lord your God with all your heart and soul. "},{"num":4,"verse":"You must follow the Lord your God, fear him, observe his commandments, listen to his voice, serve him, and cling to him. "},{"num":5,"verse":"That prophet or diviner of dreams must be executed, because he advocated rebellion against the Lord your God, who brought you from the land of Egypt and redeemed you from the house of slavery, and because he lured you from the way in which the Lord your God instructed you to live. Purge the evil from among you.”"},{"header":"Dealing with Idolaters"},{"num":6,"verse":"“Your own blood brother, your son, your daughter, your beloved wife, or your friend who is like your soul mate may entice you quietly. He may tell you, ‘Let’s go and serve other gods’ (whom neither you nor your ancestors have known "},{"num":7,"verse":"from the gods of the people that surround you—whether near or far from you—from one end of the earth to the other). "},{"num":8,"verse":"You are not to yield to him, listen to him, look with pity on him, show compassion to him, or even cover up for him. "},{"num":9,"verse":"Instead, you are surely to execute him. You must be the first to put him to death with your own hand, and then the hands of the whole community. "},{"num":10,"verse":"Stone him to death, because he sought to lure you from the Lord your God, who brought you from the land of Egypt, from the land of slavery. "},{"num":11,"verse":"Then all Israel will hear about it, be afraid, and won’t do this evil thing again among you."},{"num":12,"verse":"“You may hear in one of your towns that the Lord your God is giving you to inhabit "},{"num":13,"verse":"that worthless men have come from among you to entice those who live in the towns. They may say, ‘Let’s go and serve other gods that you haven’t known.’ "},{"num":14,"verse":"You must thoroughly investigate and inquire if it is true that this detestable thing exists among you. If it is so, "},{"num":15,"verse":"then put the inhabitants of the town to death by the sword. Devote everything in it to divine destruction—even its livestock—by the sword. "},{"num":16,"verse":"Gather whatever you’ve taken as spoils at the public square of the town, then burn the town, along with whatever you’ve taken, as an offering to the Lord your God. It will remain a permanent mound of ruins, never to be rebuilt again. "},{"num":17,"verse":"Moreover, you must never take any item from those condemned things, so the Lord may yet relent from his burning anger and extend compassion, have mercy, and cause you to increase in number—as he promised by an oath to your ancestors— "},{"num":18,"verse":"if you obey the voice of the Lord your God by observing all his commands that I’m commanding you today. Do what is right in the sight of the Lord your God.”"}]