[{"num":13,"verse":"¶ When there arises among you a prophet, or a dreamer of dreams, and gives thee a sign or a wonder,"},{"num":2,"verse":"and the sign or the wonder comes to pass, of which he spoke unto thee, saying, Let us go after other gods, which thou hast not known, and let us serve them,"},{"num":3,"verse":"thou shalt not hearken unto the words of that prophet or that dreamer of dreams; for the LORD your God proves you, to know whether ye love the LORD your God with all your heart and with all your soul."},{"num":4,"verse":"Ye shall walk after the LORD your God and fear him and keep his commandments and hear his voice, and ye shall serve him and cleave unto him."},{"num":5,"verse":"And that prophet, or that dreamer of dreams, shall be put to death because he has spoken rebellion against the LORD your God, who brought you out of the land of Egypt and ransomed you out of the house of slavery, to thrust thee out of the way which the LORD thy God commanded thee to walk in. So shalt thou put the evil away from the midst of thee."},{"num":6,"verse":"¶ If thy brother, the son of thy mother, or thy son or thy daughter or the wife of thy bosom or thy friend who is as thine own soul should entice thee secretly, saying, Let us go and serve other gods, which thou nor thy fathers have known,"},{"num":7,"verse":"namely, of the gods of the peoples who are round about you, near unto thee or far off from thee, from the one end of the earth even unto the other end of the earth,"},{"num":8,"verse":"thou shalt not consent with him nor hearken unto him; neither shall thine eye pity him; neither shalt thou have compassion; neither shalt thou conceal him,"},{"num":9,"verse":"but thou must kill him; thy hand shall be first upon him to put him to death and afterwards the hand of all the people."},{"num":10,"verse":"And thou must stone him with stones, and he shall die because he has sought to thrust thee away from the LORD thy God, who brought thee out of the land of Egypt from the house of slavery;"},{"num":11,"verse":"so that all Israel shall hear and fear and shall do no more any such wickedness as this is among you."},{"num":12,"verse":"¶ If thou shalt hear in one of thy cities, which the LORD thy God has given thee to dwell there, that it is said,"},{"num":13,"verse":"certain men, the sons of Belial, are gone out from among you and have incited the inhabitants of their city, saying, Let us go and serve other gods, which ye have not known,"},{"num":14,"verse":"then shalt thou enquire and search and ask diligently; and, behold, if it is the truth and the thing certain that such abomination is wrought among you,"},{"num":15,"verse":"thou shalt surely smite the inhabitants of that city with the edge of the sword, destroying it utterly with all that is therein and the beasts thereof, with the edge of the sword."},{"num":16,"verse":"And thou shalt gather all the spoil of it into the midst of its plaza and shalt burn the city with fire and all the spoil thereof, all of it, unto the LORD thy God; and it shall be a heap for ever; it shall never be built again."},{"num":17,"verse":"And none of the anathema shall cleave to thine hand that the LORD may turn from the fierceness of his anger and show thee mercy and have compassion upon thee and multiply thee, as he has sworn unto thy fathers,"},{"num":18,"verse":"when thou shalt hearken to the voice of the LORD thy God, keeping all his commandments which I command thee this day, to do that which is right in the eyes of the LORD thy God."}]