[{"header":"Abijah, King of Judah(A)"},{"num":13,"verse":"In the eighteenth year of King Jeroboam, Abijah became king of Judah. "},{"num":2,"verse":"He reigned for three years in Judah, and his mother’s name was Micaiah, the granddaughter of Uriel of Gibeah."},{"num":3,"verse":"Abijah set the battle in order with an army of valiant men of war, four hundred thousand choice men. Jeroboam also drew up battle lines against him with an army of eight hundred thousand men, mighty men of valor."},{"num":4,"verse":"Then Abijah went up to Mount Zemaraim that is in the hills of Ephraim, and he said, “Listen to me, Jeroboam and all Israel! "},{"num":5,"verse":"Do you all not know that the Lord God of Israel has perpetually given the kingdom of Israel to David, even to him and to his sons with a covenant of salt? "},{"num":6,"verse":"And Jeroboam the son of Nebat, the servant of Solomon son of David, stood up and rebelled against his lord Rehoboam. "},{"num":7,"verse":"Then vain, worthless men gathered together around him and defied Rehoboam son of Solomon. And Rehoboam was young and timid in heart and was not strong before them."},{"num":8,"verse":"“And now you think that you can withstand before the kingdom of the Lord by the hand of the sons of David. And you all are a great multitude, and with you are the golden calves that Jeroboam has made for you to be gods. "},{"num":9,"verse":"Have you all not driven out the priests of the Lord, even the Levites and sons of Aaron, and made for yourselves priests from the peoples of other lands? Whoever comes to be dedicated and has in his hand a young bull or seven rams becomes a priest to what is not a god."},{"num":10,"verse":"“But for us, the Lord is our God, and we have not abandoned Him. And our priests serve the Lord and are sons of Aaron, Levites with their service. "},{"num":11,"verse":"They sacrifice burnt offerings to the Lord every morning and evening and put out an incense of spices. They also set the showbread in place on the ritual table and set the golden lampstand with its lamps to burn every evening. For we keep the duty of the Lord our God, but you all have abandoned Him. "},{"num":12,"verse":"God is with us as a leader, and His priests with their battle trumpets to call for battle against you all. O sons of Israel, do not fight against the Lord the God of your fathers because you will not find success.”"},{"num":13,"verse":"So Jeroboam went around them with an ambush to come from behind them. Those from Israel were in front of Judah, while the ambush was behind them. "},{"num":14,"verse":"Then Judah turned and saw that the battle was both in front of and behind them. Then they cried out to the Lord, and the priests sounded their trumpets. "},{"num":15,"verse":"Then the men from Judah shouted out; and it happened when Judah shouted out, God struck down Jeroboam and all Israel before Abijah and Judah. "},{"num":16,"verse":"The men of Israel fled before Judah, and God gave them into their hand. "},{"num":17,"verse":"Abijah and his people struck them down with a great slaughter, and the slain from Israel who fell that day were five hundred thousand choice men. "},{"num":18,"verse":"So the sons of Israel were subdued at that time, and the people of Judah were strong for they depended on the Lord God of their fathers."},{"num":19,"verse":"And Abijah chased after Jeroboam and captured cities from him: Bethel, Jeshanah, and Ephron with their surrounding villages. "},{"num":20,"verse":"And Jeroboam did not again recover his strength in the days of Abijah, and the Lord struck down Jeroboam, and he died."},{"num":21,"verse":"So Abijah grew strong and took fourteen wives and had twenty-two sons and sixteen daughters."},{"num":22,"verse":"And the remainder of the acts of Abijah, both his ways and words, are written in the story of the prophet Iddo."}]