[[],[],[{"type":"header","content":"King Abijah"},{"type":"prose","content":"In the eighteenth year of the rule of King Jeroboam, Abijah took over the throne of Judah. He ruled in Jerusalem three years. His mother was Maacah daughter of Uriel of Gibeah."}],[{"type":"prose","content":"War broke out between Abijah and Jeroboam. Abijah started out with 400,000 of his best soldiers; Jeroboam countered with 800,000 of his best."}],[{"type":"prose","content":"Abijah took a prominent position on Mount Zemaraim in the hill country of Ephraim and gave this speech: “Listen, Jeroboam and all Israel! Don’t you realize that , the one and only God of Israel, established David and his sons as the permanent rulers of Israel, ratified by a ‘covenant of salt’—’s kingdom ruled by ’s king? And what happened? Jeroboam, the son of Solomon’s slave Nebat, rebelled against his master. All the riffraff joined his cause and were too much for Rehoboam, Solomon’s true heir. Rehoboam didn’t know his way around—besides he was a real wimp; he couldn’t stand up against them."}],[{"type":"prose","content":"“Taking advantage of that weakness, you are asserting yourself against the very rule of  that is delegated to David’s descendants—you think you are so big with your huge army backed up by the golden-calf idols that Jeroboam made for you as gods! But just look at what you’ve done—you threw out the priests of , the sons of Aaron, and the Levites, and made priests to suit yourselves, priests just like the pagans have. Anyone who shows up with enough money to pay for it can be a priest! A priest of No-God!"}],[{"type":"prose","content":"“But for the rest of us in Judah, we’re sticking with . We have not traded him in for the latest model—we’re keeping the tried-and-true priests of Aaron to lead us to  and the Levites to lead us in worship by sacrificing Whole-Burnt-Offerings and aromatic incense to  at the daily morning and evening prayers, setting out fresh holy bread on a clean table, and lighting the lamps on the golden Lampstand every night. We continue doing what  told us to in the way he told us to do it; but you have rid yourselves of him."}],[{"type":"prose","content":"“Can’t you see the obvious? God is on our side; he’s our leader. And his priests with trumpets are all ready to blow the signal to battle. O Israel—don’t fight against , the God of your ancestors. You will not win this battle.”"}],[{"type":"prose","content":"While Abijah was speaking, Jeroboam had sent men around to take them by surprise from the rear: Jeroboam in front of Judah and the ambush behind. When Judah looked back, they saw they were attacked front and back. They prayed desperately to , the priests blew their trumpets, and the soldiers of Judah shouted their battle cry. At the battle cry, God routed Jeroboam and all Israel before Abijah and Judah. The army of Israel scattered before Judah; God gave them the victory. Abijah and his troops slaughtered them—500,000 of Israel’s best fighters were killed that day. The army of Israel fell flat on its face—a humiliating defeat. The army of Judah won hands down because they trusted , the God of their ancestors."}],[{"type":"prose","content":"Abijah followed up his victory by pursuing Jeroboam, taking the towns of Bethel, Jeshanah, and Ephron with their surrounding villages. Jeroboam never did recover from his defeat while Abijah lived. Later on  struck him down and he died. Meanwhile Abijah flourished; he married fourteen wives and ended up with a family of twenty-two sons and sixteen daughters."}],[{"type":"prose","content":"The rest of the history of Abijah, what he did and said, is written in the study written by Iddo the prophet."}]]