[{"header":"Abijah’s Bold Speech"},{"num":13,"verse":"In the 18 th year of King Jeroboam, Abijah began to reign over Judah. "},{"num":2,"verse":"He reigned three years in Jerusalem. His mother’s name was Micaiah, the daughter of Uriel of Gibeah."},{"num":3,"verse":"Abijah went into battle with an army of valiant warriors, 400,000 chosen men, while Jeroboam arranged for battle against him 800,000 chosen men, mighty warriors."},{"num":4,"verse":"Abijah stood on top of Mount Zemaraim, which is a hill of Ephraim, and said, “Listen to me Jeroboam and all Israel! "},{"num":5,"verse":"Don’t you know that Adonai, God of Israel, has given kingship over Israel to David forever—to him and his sons by a covenant of salt? "},{"num":6,"verse":"Yet Jeroboam son of Nebat, the servant of Solomon son of David, rose up and rebelled against his master. "},{"num":7,"verse":"Riffraff and scoundrels gathered around him and pressed hard on Rehoboam son of Solomon, when Rehoboam was young and tenderhearted and could not stand up to them."},{"num":8,"verse":"“So now, do you intend to oppose the kingdom of Adonai, which is in the hand of David’s descendants? Are you indeed a great multitude—and with you the golden calves that Jeroboam made for you as gods? "},{"num":9,"verse":"Have you not banished the kohanim of Adonai, the sons of Aaron, as well as the Levites, and then appointed your own priests—just as the peoples of the lands do? Can whoever comes to consecrate himself with a bull from a young cow and seven rams become a priest—for gods of nothing?"},{"num":10,"verse":"“But as for us, Adonai is our God! And we have not forsaken Him. We have the sons of Aaron ministering as kohanim to Adonai and the Levites in their work. "},{"num":11,"verse":"Every morning and evening they burn to Adonai burnt offerings and sweet incense. They set the rows of bread on the pure table and they light the golden menorah with its lamps burning every evening—for we keep the service of Adonai Eloheinu—but you have forsaken Him. "},{"num":12,"verse":"So look, God is with us at our head, and His kohanim with the signal trumpets to sound an alarm against you. O men of Israel, do not fight against Adonai, the God of your fathers—for you will not succeed!”"},{"num":13,"verse":"But Jeroboam had commanded the ambush to go around and come from the rear. So while they were in front of Judah, the ambush was behind them. "},{"num":14,"verse":"When Judah turned around, behold, the battle was before and behind them. They cried out to Adonai and the kohanim blew the trumpets. "},{"num":15,"verse":"Then the men of Judah raised a battle cry, and as the men of Judah shouted, God struck down Jeroboam and all Israel before Abijah and Judah. "},{"num":16,"verse":"Then men of Israel fled before Judah and God delivered them into their hand. "},{"num":17,"verse":"So Abijah and his people defeated them with a great slaughter, and 500,000 chosen men of Israel fell slain. "},{"num":18,"verse":"Thus men of Israel were subdued at that time, while the children of Judah prevailed—because they relied upon Adonai, the God of their fathers."},{"num":19,"verse":"Abijah pursued Jeroboam and captured towns from him: Bethel with its villages, Jeshanah with its villages, and Ephron with its villages. "},{"num":20,"verse":"Jeroboam could not muster strength again in the days of Abijah. Finally Adonai struck him and he died."},{"num":21,"verse":"But Abijah grew powerful and took to himself 14 wives and fathered 22 sons and 16 daughters. "},{"num":22,"verse":"Now the rest of the acts of Abijah, his ways and his sayings, are written in the chronicles of the prophet Iddo. "},{"num":23,"verse":"Then Abijah slept with his fathers and was buried in the city of David. His son Asa became king in his place. During his days the land was untroubled for ten years."}]