[{"num":8,"verse":"“Sound the alarm! They are coming! Like a vulture, the enemy descends upon the people of God because they have broken my treaty and revolted against my laws."},{"num":2,"verse":"“Now Israel pleads with me and says, ‘Help us, for you are our God!’ "},{"num":3,"verse":"But it is too late! Israel has thrown away her chance with contempt, and now her enemies will chase her. "},{"num":4,"verse":"She has appointed kings and princes, but not with my consent. They have cut themselves off from my help by worshiping the idols that they made from their silver and gold."},{"num":5,"verse":"“O Samaria, I reject this calf—this idol you have made. My fury burns against you. How long will it be before one honest man is found among you? "},{"num":6,"verse":"When will you admit this calf you worship was made by human hands! It is not God! Therefore, it must be smashed to bits."},{"num":7,"verse":"“They have sown the wind, and they will reap the whirlwind. Their cornstalks stand there barren, withered, sickly, with no grain; if it has any, foreigners will eat it."},{"num":8,"verse":"“Israel is destroyed; she lies among the nations as a broken pot. "},{"num":9,"verse":"She is a lonely, wandering wild ass. The only friends she has are those she hires; Assyria is one of them."},{"num":10,"verse":"“But though she hires ‘friends’ from many lands, I will send her off to exile. Then for a while at least she will be free of the burden of her wonderful king! "},{"num":11,"verse":"Ephraim has built many altars, but they are not to worship me! They are altars of sin! "},{"num":12,"verse":"Even if I gave her ten thousand laws, she’d say they weren’t for her—that they applied to someone far away. "},{"num":13,"verse":"Her people love the ritual of their sacrifice, but to me it is meaningless! I will call for an accounting of their sins and punish them; they shall return to Egypt."},{"num":14,"verse":"“Israel has built great palaces; Judah has constructed great defenses for her cities, but they have forgotten their Maker. Therefore, I will send down fire upon those palaces and burn those fortresses.”"}]