[{"num":8,"verse":"A trump be in thy throat, as an eagle on the house of the Lord; for that that they went over my bond of peace, and brake my law. (Let a trumpet be at thy lips, like an eagle on the House of the Lord; for they have broken my covenant, and rebelled against my teaching.)"},{"num":2,"verse":"They called me to help, (and said,) A! my God, we Israel have known thee. (They called to me for help, and said, O! my God, we Israel have known thee.)"},{"num":3,"verse":"Israel hath cast away good [thing], the enemy shall pursue him. (But Israel hath thrown away a good thing, and the enemy shall pursue them.)"},{"num":4,"verse":"They reigned, and not of me; they were princes, and I knew not. They made their gold and silver (into) idols to them, that they should perish. (They reigned, but not by me; they ordained rulers, but I did not know them. They made their silver and gold into idols for themselves, and so now they shall perish.)"},{"num":5,"verse":"A! Samaria, thy calf is cast away; my strong vengeance is wroth against them. How long may they not be cleansed? (O! Samaria, thy calf is thrown away; my strong vengeance is raging against them. How long until they be cleansed?)"},{"num":6,"verse":"for also it is of Israel. A craftsman made it, and it is not (a) god; for the calf of Samaria shall be into webs of araneida. (for it is also of Israel. A craftsman made it, and it is not God; for the calf of Samaria shall be like spider webs.)"},{"num":7,"verse":"For they shall sow wind, and they shall reap whirlwind. A stalk standing (up) is not in them, the seed shall not make meal; that if also it maketh meal, aliens shall eat it. (For they shall sow the wind, and they shall reap the whirlwind. A standing stalk is not among them, the seed shall not make meal, or grain; and even if it maketh meal, foreigners, or strangers, shall eat it up.)"},{"num":8,"verse":"Israel is devoured; now Israel is made as an unclean vessel among nations (and now Israel is made like an unclean, or a worthless, vessel among the peoples),"},{"num":9,"verse":"for they ascended to Assur. Ephraim is a wild ass, solitary to himself (for they went up to Assyria. Ephraim is like a wild donkey, alone unto itself). They gave gifts to [their] lovers;"},{"num":10,"verse":"but also with meed they hired nations (and with money they hired men from among the nations). Now I shall gather them together, and they shall rest a little from (the) burden of the king and of (the) princes."},{"num":11,"verse":"For Ephraim multiplied altars to do sin, altars were made to him into trespass. (For Ephraim multiplied altars to do sin, yea, altars were made for them to do sin.)"},{"num":12,"verse":"I shall write to them my manyfold laws, that be areckoned as alien laws. (I wrote for them my many laws, but they be reckoned as foreign, or strange, laws.)"},{"num":13,"verse":"They shall bring sacrifices, they shall offer, and eat fleshes; and the Lord shall not receive those. Now he shall have mind on the wickednesses of them, and he shall visit the sins of them; they shall turn (again) into Egypt. (They shall bring sacrifices, they shall offer, and eat the meat, but I the Lord shall not receive them. Now I shall remember their wickednesses, and I shall punish their sins; and they shall return to Egypt.)"},{"num":14,"verse":"And Israel forgat his maker, and builded temples to his idols, and Judah multiplied strong cities; and I shall send fire into the cities of him, and it shall devour the houses of him. (For Israel forgot their Maker, and built temples to their idols, and Judah made many fortified cities; but I shall send fire into their cities, and it shall devour their houses, or their palaces.)"}]