[{"num":28,"verse":"And Dovid assembled kol Sarei Yisroel, the Sarei HaShevatim, and the Sarei HaMachlekot that ministered to HaMelech by course, and the Sarei HaAlafim, and Sarei HaMe’ot, and the Sarei kol rechush (stewards over all the property) and mikneh (livestock) of HaMelech, and of his banim, with the sarisim (palace officials), and with the Gibborim, and with all the Gibbor chayil, unto Yerushalayim."},{"num":2,"verse":"Then Dovid HaMelech stood up upon his feet, and said, Hear me, my brethren, and my people. As for me, I had in mine levav to build a Bais Menuchah for the Aron Brit Hashem, and for the hadom (footstool) of Eloheinu, and had made ready to build;"},{"num":3,"verse":"But HaElohim said unto me, Thou shalt not build a Bais for My Shem, because thou hast been an ish milchamot of shefach damim."},{"num":4,"verse":"Howbeit Hashem Elohei Yisroel chose me before all the Bais Avi to be Melech over Yisroel l’olam; for He hath chosen Yehudah to be Nagid; and of the Bais Yehudah, the Bais Avi; and among the Bnei Avi He was pleased to make me Melech over kol Yisroel."},{"num":5,"verse":"And of all my banim, (for Hashem hath given me rabbim banim,) He hath chosen Sh’lomo beni (my son) to sit upon the kisse Malchut Hashem over Yisroel."},{"num":6,"verse":"And He said unto me, Sh’lomo binecha, he shall build My Bais and My khatzerot (courts, courtyards), for I have chosen him to be Beni (My Son), and I will be his Av."},{"num":7,"verse":"Moreover I will establish his Malchut ad l’olam, if he be steadfast to do My mitzvot and My mishpatim, as on this yom."},{"num":8,"verse":"Now therefore in the sight of kol Yisroel the kehal Hashem, and in the ears of Eloheinu, be shomer and seek for all the Mitzvot Hashem Eloheichem lema’an (in order that) ye may possess this eretz hatovah; and leave it for a nachalah for your banim after you ad olam."},{"num":9,"verse":"And thou, Sh’lomo beni (my son), know thou the Elohei Avicha, and serve Him with a lev shalem and with a nefesh chafetzah (willing mind), for Hashem searcheth kol levavot, and understandeth all the yetzer machashavot. If thou seek Him, He will be found by thee; but if thou forsake Him, He will cast thee off forever."},{"num":10,"verse":"Take heed now, for Hashem hath chosen thee to build a Bais l’Mikdash. Chazak! And do it!"},{"num":11,"verse":"Then Dovid gave to Sh’lomo bno the tavnit (plan, pattern) of the ulam, and of the structures thereof, and of the Ganzakim (storerooms) thereof, and of the Aliyyot (upper rooms) thereof, and of the Penimim (Inner ones) thereof, and of the Bais Hakappores (house of the kapporet),"},{"num":12,"verse":"And the tavnit of all that he had by the Ruach [Hakodesh], of the khatzerot (courtyards) of the Bais Hashem, and of all the surrounding chambers, of the Otzerot of the Bais HaElohim, and of the Otzerot of the kadashim (consecrated things);"},{"num":13,"verse":"Also for the courses of the Kohanim and the Levi’im, and for all the work of the Avodas Bais Hashem, and for all the kelei Avodas Bais Hashem."},{"num":14,"verse":"He gave zahav by weight for things of zahav, for all kelei Avodah of every kind of avodah (service); for all kelei hakesef by weight, for all kelei avodah va’avodah (vessels for every kind of service),"},{"num":15,"verse":"Even the weight for the menorot hazahav, and for their nerot (lamps) of zahav was according to the weight for every menorah, and for the nerot (lamps) thereof; and for the menorat hakesef by weight, both for the menorah, and also for the nerot (lamps) thereof, according to the use of every menorah."},{"num":16,"verse":"And by weight he gave zahav for the Shulchanot HaMa’arechet (the tables of the spreading out [showbread]) for each shulchan; and likewise kesef for the shulchanot hakesef (silver tables);"},{"num":17,"verse":"Also pure zahav for the mizlagot (forks), and the mizrakot (blood bowls), and shelves; kesot zahav tahor and the kipor hazahav (golden basin) for every kipor (basin); and likewise kesef by weight for every kipor hakesef (silver basin);"},{"num":18,"verse":"And for the Mizbe’ach HaKetoret refined zahav by weight; and zahav for the tavnit of the Merkavah, the Keruvim Zahav, that spread out their wings, and covered the Aron Brit Hashem."},{"num":19,"verse":"All this, said Dovid, is in writing by the Yad Hashem on me, giving me seichel to understand all the works of this tavnit (plan, pattern)."},{"num":20,"verse":"And Dovid said to Sh’lomo bno, Chazak! Ve’emetz! (Be strong and take courage!) And do it; fear not, nor be discouraged; for Hashem Elohim, even Elohai, will be with thee; He will not fail thee, nor forsake thee, until thou hast finished all the work for the Avodas Bais Hashem."},{"num":21,"verse":"And, hinei, the divisions of the Kohanim and the Levi’im, even they shall be with thee for all the Avodas Bais HaElohim and there shall be with thee for all manner of workmanship every willing man, bringing their chochmah for kol Avodah; also the Sarim and kol HaAm will be wholly at thy commandment."}]