[{"num":28,"verse":"At the end of his life, David assembled in Jerusalem all the officials of Israel to instruct them in how to run both the state and the religion after his death. These officials included the leaders of the tribes, the commanders of the divisions that served the king, the commanders of thousands, commanders of hundreds, the managers of all the royal property and livestock, the officials, the warriors, and all the valiant men."},{"num":11,"verse":"After instructing Solomon, David gave him blueprints of the temple porch, its buildings, its storehouses, its upper rooms, its inner rooms, and the holy of holies for the covenant chest. "},{"num":12,"verse":"And David also gave Solomon the plans he had in mind for the courts of the temple of the Eternal, all the surrounding rooms, the storehouses of the temple of God, and the storehouses of the dedicated gifts. "},{"num":13,"verse":"David also provided lists of the divisions of the priests and Levites and the work of the service they would perform in the temple of the Eternal. David also described how the priests and Levites would treat all the utensils of service in the house of the Eternal: "},{"num":14,"verse":"the ideal weight of gold for all the golden utensils for every kind of service, the ideal weight of silver for all the silver utensils for every kind of service, "},{"num":15,"verse":"the ideal weight of gold for each of the golden lampstands and their golden lamps, the ideal weight of silver for each of the silver lampstands and their silver lamps, "},{"num":16,"verse":"the ideal weight of gold for each of the tables of unleavened bread, and the silver for the silver tables, "},{"num":17,"verse":"the ideal weight of pure gold for the forks, the basins, and the pitchers, the ideal weight of gold for each of the golden bowls, the ideal weight for each of the silver bowls, "},{"num":18,"verse":"the ideal weight of refined gold for the altar of incense, for the model of the chariot, and for the winged guardian whose wings covered the covenant chest of the Eternal."}]