[[],[{"type":"header","content":"The Ordination of the Priests"},{"type":"prose","content":"Now this is what you shall do to them to consecrate them, so that they may serve me as priests. Take one young bull and two rams without blemish, "}],[{"type":"prose","content":"and unleavened bread, unleavened cakes mixed with oil, and unleavened wafers spread with oil. You shall make them of choice wheat flour. "}],[{"type":"prose","content":"You shall put them in one basket and bring them in the basket, and bring the bull and the two rams. "}],[{"type":"prose","content":"You shall bring Aaron and his sons to the entrance of the tent of meeting, and wash them with water. "}],[{"type":"prose","content":"Then you shall take the vestments, and put on Aaron the tunic and the robe of the ephod, and the ephod, and the breastpiece, and gird him with the decorated band of the ephod; "}],[{"type":"prose","content":"and you shall set the turban on his head, and put the holy diadem on the turban. "}],[{"type":"prose","content":"You shall take the anointing oil, and pour it on his head and anoint him. "}],[{"type":"prose","content":"Then you shall bring his sons, and put tunics on them, "}],[{"type":"prose","content":"and you shall gird them with sashes and tie headdresses on them; and the priesthood shall be theirs by a perpetual ordinance. You shall then ordain Aaron and his sons."}],[{"type":"prose","content":"You shall bring the bull in front of the tent of meeting. Aaron and his sons shall lay their hands on the head of the bull, "}],[{"type":"prose","content":"and you shall slaughter the bull before the LORD, at the entrance of the tent of meeting, "}],[{"type":"prose","content":"and shall take some of the blood of the bull and put it on the horns of the altar with your finger, and all the rest of the blood you shall pour out at the base of the altar. "}],[{"type":"prose","content":"You shall take all the fat that covers the entrails, and the appendage of the liver, and the two kidneys with the fat that is on them, and turn them into smoke on the altar. "}],[{"type":"prose","content":"But the flesh of the bull, and its skin, and its dung, you shall burn with fire outside the camp; it is a sin offering."}],[{"type":"prose","content":"Then you shall take one of the rams, and Aaron and his sons shall lay their hands on the head of the ram, "}],[{"type":"prose","content":"and you shall slaughter the ram, and shall take its blood and dash it against all sides of the altar. "}],[{"type":"prose","content":"Then you shall cut the ram into its parts, and wash its entrails and its legs, and put them with its parts and its head, "}],[{"type":"prose","content":"and turn the whole ram into smoke on the altar; it is a burnt offering to the LORD; it is a pleasing odor, an offering by fire to the LORD."}],[{"type":"prose","content":"You shall take the other ram; and Aaron and his sons shall lay their hands on the head of the ram, "}],[{"type":"prose","content":"and you shall slaughter the ram, and take some of its blood and put it on the lobe of Aaron’s right ear and on the lobes of the right ears of his sons, and on the thumbs of their right hands, and on the big toes of their right feet, and dash the rest of the blood against all sides of the altar. "}],[{"type":"prose","content":"Then you shall take some of the blood that is on the altar, and some of the anointing oil, and sprinkle it on Aaron and his vestments and on his sons and his sons’ vestments with him; then he and his vestments shall be holy, as well as his sons and his sons’ vestments."}],[{"type":"prose","content":"You shall also take the fat of the ram, the fat tail, the fat that covers the entrails, the appendage of the liver, the two kidneys with the fat that is on them, and the right thigh (for it is a ram of ordination), "}],[{"type":"prose","content":"and one loaf of bread, one cake of bread made with oil, and one wafer, out of the basket of unleavened bread that is before the LORD; "}],[{"type":"prose","content":"and you shall place all these on the palms of Aaron and on the palms of his sons, and raise them as an elevation offering before the LORD. "}],[{"type":"prose","content":"Then you shall take them from their hands, and turn them into smoke on the altar on top of the burnt offering of pleasing odor before the LORD; it is an offering by fire to the LORD."}],[{"type":"prose","content":"You shall take the breast of the ram of Aaron’s ordination and raise it as an elevation offering before the LORD; and it shall be your portion. "}],[{"type":"prose","content":"You shall consecrate the breast that was raised as an elevation offering and the thigh that was raised as an elevation offering from the ram of ordination, from that which belonged to Aaron and his sons. "}],[{"type":"prose","content":"These things shall be a perpetual ordinance for Aaron and his sons from the Israelites, for this is an offering; and it shall be an offering by the Israelites from their sacrifice of offerings of well-being, their offering to the LORD."}],[{"type":"prose","content":"The sacred vestments of Aaron shall be passed on to his sons after him; they shall be anointed in them and ordained in them. "}],[{"type":"prose","content":"The son who is priest in his place shall wear them seven days, when he comes into the tent of meeting to minister in the holy place."}],[{"type":"prose","content":"You shall take the ram of ordination, and boil its flesh in a holy place; "}],[{"type":"prose","content":"and Aaron and his sons shall eat the flesh of the ram and the bread that is in the basket, at the entrance of the tent of meeting. "}],[{"type":"prose","content":"They themselves shall eat the food by which atonement is made, to ordain and consecrate them, but no one else shall eat of them, because they are holy. "}],[{"type":"prose","content":"If any of the flesh for the ordination, or of the bread, remains until the morning, then you shall burn the remainder with fire; it shall not be eaten, because it is holy."}],[{"type":"prose","content":"Thus you shall do to Aaron and to his sons, just as I have commanded you; through seven days you shall ordain them. "}],[{"type":"prose","content":"Also every day you shall offer a bull as a sin offering for atonement. Also you shall offer a sin offering for the altar, when you make atonement for it, and shall anoint it, to consecrate it. "}],[{"type":"prose","content":"Seven days you shall make atonement for the altar, and consecrate it, and the altar shall be most holy; whatever touches the altar shall become holy."}],[{"type":"header","content":"The Daily Offerings"},{"type":"prose","content":"Now this is what you shall offer on the altar: two lambs a year old regularly each day. "}],[{"type":"prose","content":"One lamb you shall offer in the morning, and the other lamb you shall offer in the evening; "}],[{"type":"prose","content":"and with the first lamb one-tenth of a measure of choice flour mixed with one-fourth of a hin of beaten oil, and one-fourth of a hin of wine for a drink offering. "}],[{"type":"prose","content":"And the other lamb you shall offer in the evening, and shall offer with it a grain offering and its drink offering, as in the morning, for a pleasing odor, an offering by fire to the LORD. "}],[{"type":"prose","content":"It shall be a regular burnt offering throughout your generations at the entrance of the tent of meeting before the LORD, where I will meet with you, to speak to you there. "}],[{"type":"prose","content":"I will meet with the Israelites there, and it shall be sanctified by my glory; "}],[{"type":"prose","content":"I will consecrate the tent of meeting and the altar; Aaron also and his sons I will consecrate, to serve me as priests. "}],[{"type":"prose","content":"I will dwell among the Israelites, and I will be their God. "}],[{"type":"prose","content":"And they shall know that I am the LORD their God, who brought them out of the land of Egypt that I might dwell among them; I am the LORD their God."}]]