[{"num":18,"verse":"After this, Sha’ul left Athens and went to Corinth, "},{"num":2,"verse":"where he met a Jewish man named Aquila, originally from Pontus but having recently come with his wife Priscilla from Italy, because Claudius had issued a decree expelling all the Jews from Rome. Sha’ul went to see them; "},{"num":3,"verse":"and because he had the same trade as they, making tents, he stayed on with them; and they worked together."},{"num":4,"verse":"Sha’ul also began carrying on discussions every Shabbat in the synagogue, where he tried to convince both Jews and Greeks. "},{"num":5,"verse":"But after Sila and Timothy arrived from Macedonia, Sha’ul felt pressed by the urgency of the message and testified in depth to the Jews that Yeshua is the Messiah. "},{"num":6,"verse":"However when they set themselves against him and began hurling insults, he shook out his clothes and said to them, “Your blood be on your own heads! For my part, I am clean; from now on, I will go to the Goyim!”"},{"num":7,"verse":"So he left them and went into the home of a “God-fearer” named Titius Justus, whose house was right next door to the synagogue. "},{"num":8,"verse":"Crispus, the president of the synagogue, came to trust in the Lord, along with his whole household; also many of the Corinthians who heard trusted and were immersed."},{"num":9,"verse":"One night, in a vision, the Lord said to Sha’ul, “Don’t be afraid, but speak right up, and don’t stop, "},{"num":10,"verse":"because I am with you. No one will succeed in harming you, for I have many people in this city.” "},{"num":11,"verse":"So Sha’ul stayed there for a year and a half, teaching them the word of God."},{"num":12,"verse":"But when Gallio became the Roman governor of Achaia, the unbelieving Jews made a concerted attack on Sha’ul and took him to court, "},{"num":13,"verse":"saying, “This man is trying to persuade people to worship God in ways that violate the Torah.” "},{"num":14,"verse":"Sha’ul was just about to open his mouth, when Gallio said to the Jews, “Listen, you Jews, if this were a case of inflicted injury or a serious crime, I could reasonably be expected to hear you out patiently. "},{"num":15,"verse":"But since it involves questions about words and names and your own law, then you must deal with it yourselves. I flatly refuse to judge such matters.” "},{"num":16,"verse":"And he had them ejected from the court. "},{"num":17,"verse":"They all grabbed Sosthenes, the president of the synagogue, and gave him a beating in full view of the bench; but Gallio showed no concern whatever."},{"num":18,"verse":"Sha’ul remained for some time, then said good-bye to the brothers and sailed off to Syria, after having his hair cut short in Cenchrea, because he had taken a vow; with him were Priscilla and Aquila."},{"num":19,"verse":"They came to Ephesus, and he left them there; but he himself went into the synagogue and held dialogue with the Jews. "},{"num":20,"verse":"When they asked him to stay with them longer, he declined; "},{"num":21,"verse":"however, in his farewell he said, “God willing, I will come back to you.” Then he set sail from Ephesus."},{"num":22,"verse":"After landing at Caesarea, he went up to Yerushalayim and greeted the Messianic community. Then he came down to Antioch, "},{"num":23,"verse":"spent some time there, and afterwards set out and passed systematically through the region of Galatia and Phrygia, strengthening all the talmidim."},{"num":24,"verse":"Meanwhile, a Jewish man named Apollos, a native of Alexandria, came to Ephesus. He was an eloquent speaker with a thorough knowledge of the Tanakh. "},{"num":25,"verse":"This man had been informed about the Way of the Lord, and with great spiritual fervor he spoke and taught accurately the facts about Yeshua, but he knew only the immersion of Yochanan. "},{"num":26,"verse":"He began to speak out boldly in the synagogue; but when Priscilla and Aquila heard him, they took him aside and explained to him the Way of God in fuller detail. "},{"num":27,"verse":"When he made plans to cross over into Achaia, the brothers encouraged him and wrote the talmidim there to welcome him. On arrival, he greatly helped those who through grace had come to trust; "},{"num":28,"verse":"for he powerfully and conclusively refuted the unbelieving Jews in public, demonstrating by the Tanakh that Yeshua is the Messiah."}]