[{"header":"Chapter 18"},{"num":1,"verse":"Paul in Corinth. After this he left Athens and went to Corinth. "},{"num":2,"verse":"There he met a Jew named Aquila, a native of Pontus, who had recently come from Italy with his wife Priscilla because Claudius had ordered all the Jews to leave Rome. He went to visit them "},{"num":3,"verse":"and, because he practiced the same trade, stayed with them and worked, for they were tentmakers by trade. "},{"num":4,"verse":"Every sabbath, he entered into discussions in the synagogue, attempting to convince both Jews and Greeks."},{"num":5,"verse":"When Silas and Timothy came down from Macedonia, Paul began to occupy himself totally with preaching the word, testifying to the Jews that the Messiah was Jesus. "},{"num":6,"verse":"When they opposed him and reviled him, he shook out his garments and said to them, “Your blood be on your heads! I am clear of responsibility. From now on I will go to the Gentiles.” "},{"num":7,"verse":"So he left there and went to a house belonging to a man named Titus Justus, a worshiper of God; his house was next to a synagogue. "},{"num":8,"verse":"Crispus, the synagogue official, came to believe in the Lord along with his entire household, and many of the Corinthians who heard believed and were baptized. "},{"num":9,"verse":"One night in a vision the Lord said to Paul, “Do not be afraid. Go on speaking, and do not be silent, "},{"num":10,"verse":"for I am with you. No one will attack and harm you, for I have many people in this city.” "},{"num":11,"verse":"He settled there for a year and a half and taught the word of God among them."},{"num":12,"verse":"Accusations Before Gallio. But when Gallio was proconsul of Achaia, the Jews rose up together against Paul and brought him to the tribunal, "},{"num":13,"verse":"saying, “This man is inducing people to worship God contrary to the law.” "},{"num":14,"verse":"When Paul was about to reply, Gallio spoke to the Jews, “If it were a matter of some crime or malicious fraud, I should with reason hear the complaint of you Jews; "},{"num":15,"verse":"but since it is a question of arguments over doctrine and titles and your own law, see to it yourselves. I do not wish to be a judge of such matters.” "},{"num":16,"verse":"And he drove them away from the tribunal. "},{"num":17,"verse":"They all seized Sosthenes, the synagogue official, and beat him in full view of the tribunal. But none of this was of concern to Gallio."},{"num":18,"verse":"Return to Syrian Antioch. Paul remained for quite some time, and after saying farewell to the brothers he sailed for Syria, together with Priscilla and Aquila. At Cenchreae he had his hair cut because he had taken a vow. "},{"num":19,"verse":"When they reached Ephesus, he left them there, while he entered the synagogue and held discussions with the Jews. "},{"num":20,"verse":"Although they asked him to stay for a longer time, he did not consent, "},{"num":21,"verse":"but as he said farewell he promised, “I shall come back to you again, God willing.” Then he set sail from Ephesus. "},{"num":22,"verse":"Upon landing at Caesarea, he went up and greeted the church and then went down to Antioch. "},{"num":23,"verse":"After staying there some time, he left and traveled in orderly sequence through the Galatian country and Phrygia, bringing strength to all the disciples."},{"num":24,"verse":"Apollos. A Jew named Apollos, a native of Alexandria, an eloquent speaker, arrived in Ephesus. He was an authority on the scriptures. "},{"num":25,"verse":"He had been instructed in the Way of the Lord and, with ardent spirit, spoke and taught accurately about Jesus, although he knew only the baptism of John. "},{"num":26,"verse":"He began to speak boldly in the synagogue; but when Priscilla and Aquila heard him, they took him aside and explained to him the Way [of God] more accurately. "},{"num":27,"verse":"And when he wanted to cross to Achaia, the brothers encouraged him and wrote to the disciples there to welcome him. After his arrival he gave great assistance to those who had come to believe through grace. "},{"num":28,"verse":"He vigorously refuted the Jews in public, establishing from the scriptures that the Messiah is Jesus."}]