[{"header":"The Daughters of Zelophehad"},{"num":27,"verse":"One day a petition was presented by the daughters of Zelophehad—Mahlah, Noah, Hoglah, Milcah, and Tirzah. Their father, Zelophehad, was a descendant of Hepher son of Gilead, son of Makir, son of Manasseh, son of Joseph."},{"num":2,"verse":"These women stood before Moses, Eleazar the priest, the tribal leaders, and the entire community at the entrance of the Tabernacle."},{"num":3,"verse":"“Our father died in the wilderness,” they said. “He was not among Korah’s followers, who rebelled against the Lord; he died because of his own sin. But he had no sons."},{"num":4,"verse":"Why should the name of our father disappear from his clan just because he had no sons? Give us property along with the rest of our relatives.”"},{"num":5,"verse":"So Moses brought their case before the Lord."},{"num":6,"verse":"And the Lord replied to Moses,"},{"num":7,"verse":"“The claim of the daughters of Zelophehad is legitimate. You must give them a grant of land along with their father’s relatives. Assign them the property that would have been given to their father."},{"num":8,"verse":"“And give the following instructions to the people of Israel: If a man dies and has no son, then give his inheritance to his daughters."},{"num":9,"verse":"And if he has no daughter either, transfer his inheritance to his brothers."},{"num":10,"verse":"If he has no brothers, give his inheritance to his father’s brothers."},{"num":11,"verse":"But if his father has no brothers, give his inheritance to the nearest relative in his clan. This is a legal requirement for the people of Israel, just as the Lord commanded Moses.”"},{"header":"Joshua Chosen to Lead Israel"},{"num":12,"verse":"One day the Lord said to Moses, “Climb one of the mountains east of the river, and look out over the land I have given the people of Israel."},{"num":13,"verse":"After you have seen it, you will die like your brother, Aaron,"},{"num":14,"verse":"for you both rebelled against my instructions in the wilderness of Zin. When the people of Israel rebelled, you failed to demonstrate my holiness to them at the waters.” (These are the waters of Meribah at Kadesh in the wilderness of Zin.)"},{"num":15,"verse":"Then Moses said to the Lord,"},{"num":16,"verse":"“O Lord, you are the God who gives breath to all creatures. Please appoint a new man as leader for the community."},{"num":17,"verse":"Give them someone who will guide them wherever they go and will lead them into battle, so the community of the Lord will not be like sheep without a shepherd.”"},{"num":18,"verse":"The Lord replied, “Take Joshua son of Nun, who has the Spirit in him, and lay your hands on him."},{"num":19,"verse":"Present him to Eleazar the priest before the whole community, and publicly commission him to lead the people."},{"num":20,"verse":"Transfer some of your authority to him so the whole community of Israel will obey him."},{"num":21,"verse":"When direction from the Lord is needed, Joshua will stand before Eleazar the priest, who will use the Urim—one of the sacred lots cast before the Lord—to determine his will. This is how Joshua and the rest of the community of Israel will determine everything they should do.”"},{"num":22,"verse":"So Moses did as the Lord commanded. He presented Joshua to Eleazar the priest and the whole community."},{"num":23,"verse":"Moses laid his hands on him and commissioned him to lead the people, just as the Lord had commanded through Moses."}]