[{"header":"A Request from Zelophehad’s Daughters"},{"num":27,"verse":"The daughters of Zelophehad, son of Hepher, grandson of Gilead, descendant of Machir, whose father was Manasseh, belonged to the families of Manasseh, son of Joseph. Their names were Mahlah, Noah, Hoglah, Milcah, and Tirzah. They came "},{"num":2,"verse":"to Moses and stood in front of him, the priest Eleazar, the leaders, and the whole community at the entrance to the tent of meeting. They said, "},{"num":3,"verse":"“Our father died in the desert. He was not a part of Korah’s followers who joined forces against Yahweh. He died for his own sin and left no sons. "},{"num":4,"verse":"Why should our father’s name be allowed to die out in his family because he had no son? Give us property among our father’s relatives.”"},{"num":5,"verse":"So Moses brought their case to Yahweh, "},{"num":6,"verse":"and Yahweh said to him, "},{"num":7,"verse":"“Zelophehad’s daughters are right. You must give them property of their own among their father’s relatives. Turn their father’s property over to them."},{"num":8,"verse":"“Tell the Israelites: If a man dies and leaves no sons, turn his property over to his daughters. "},{"num":9,"verse":"If he has no daughters, give his property to his brothers. "},{"num":10,"verse":"If he has no brothers, give his property to his uncles on his father’s side of the family. "},{"num":11,"verse":"If he has no uncles, give his property to the nearest relative in his family, and that relative will take possession of it. This will be a rule for the Israelites, as Yahweh commanded Moses.”"},{"header":"The Lord Appoints Joshua to Succeed Moses"},{"num":12,"verse":"Yahweh said to Moses, “Go up into the Abarim Mountains, and take a look at the land I will give the Israelites. "},{"num":13,"verse":"After you see it, you, too, will join your ancestors in death, as your brother Aaron did. "},{"num":14,"verse":"You both rebelled against my command in the Desert of Zin. You didn’t show the people how holy I am when they were complaining at the oasis.” (This was the oasis of Meribah at Kadesh in the Desert of Zin.)"},{"num":15,"verse":"Moses said to Yahweh, "},{"num":16,"verse":"“Yahweh, you are the Elohim who gives the breath of life to everyone. Please appoint someone over the community "},{"num":17,"verse":"who will lead them in and out of battle so that Yahweh’s community will not be like sheep without a shepherd.”"},{"num":18,"verse":"So Yahweh said to Moses, “Take Joshua, son of Nun, a man who has the Ruach, and place your hand on him. "},{"num":19,"verse":"Make him stand in front of the priest Eleazar and the whole community, and give him his instructions in their presence. "},{"num":20,"verse":"Give him some of your authority so that the whole community of Israel will obey him. "},{"num":21,"verse":"He will stand in front of the priest Eleazar, who will use the Urim to make decisions in Yahweh’s presence. At his command Joshua and the whole community of Israel will go into battle. And at his command they will return.”"},{"num":22,"verse":"Moses did as Yahweh commanded him. He took Joshua and made him stand in front of the priest Eleazar and the whole community. "},{"num":23,"verse":"Moses placed his hands on Joshua and gave him his instructions as Yahweh had told him."}]