[{"header":"Inheritance of Daughters"},{"num":27,"verse":"The daughters of Zelophehad son of Hepher son of Gilead son of Machir son of Manasseh, of the families of Manasseh son of Joseph (the names of his daughters were Mahlah, Noah, Hoglah, Milcah, and Tirzah) "},{"num":2,"verse":"stood before Moses, Eleazar the kohen and the princes of the entire assembly at the entrance to the Tent of Meeting and said, "},{"num":3,"verse":"“Our father died in the wilderness. But he was not one of the followers banding together against Adonai with Korah, though he died for his own sin. Yet he had no sons. "},{"num":4,"verse":"Why should our father’s name diminish from his family just because he had no son? Give to us property among our father’s brothers.”"},{"num":5,"verse":"So Moses brought their issue before Adonai, "},{"num":6,"verse":"and Adonai spoke to Moses saying, "},{"num":7,"verse":"“The daughters of Zelophehad are right in saying you should give them property by inheritance among their father’s relatives. You are to turn over the inheritance of their father to them.”"},{"num":8,"verse":"“Furthermore, you are to speak to Bnei-Yisrael saying: If a man dies without a son, you are to transfer his inheritance to his daughter. "},{"num":9,"verse":"If he has no daughter, you are to give his inheritance to his brothers. "},{"num":10,"verse":"If he has no brothers, you are to give it to his father’s brothers. "},{"num":11,"verse":"If his father had no brothers, you are to give it to the nearest relative in his family that he might possess it. This is to be a legal statute for Bnei-Yisrael, just as Adonai commanded to Moses.”"},{"header":"Commissioning of Joshua"},{"num":12,"verse":"Then Adonai said to Moses, “Go up this mountain of the Abarim range and look at the land that I have given to Bnei-Yisrael. "},{"num":13,"verse":"When you have seen it, you will be gathered to your people, just as Aaron your brother was gathered. "},{"num":14,"verse":"For in the wilderness of Zin during the strife of the community, you both rebelled against My Word instead of honoring Me as holy at the waters before their eyes.” (These were the waters of Meribah at Kadesh in the wilderness of Zin.)"},{"num":15,"verse":"Moses spoke to Adonai saying, "},{"num":16,"verse":"“May Adonai, God of the spirits of all flesh, appoint a man over the community "},{"num":17,"verse":"to go out and come in before them, who will lead them out and bring them out so that the people of Adonai will not be like sheep without a shepherd.”"},{"num":18,"verse":"Adonai said to Moses, “Take Joshua son of Nun, a man in whom is the Ruach, and lay your hand on him. "},{"num":19,"verse":"You will have him stand before Eleazar the kohen and the entire assembly and commission him before their eyes. "},{"num":20,"verse":"Give to him some of your authority so that the whole community of Bnei-Yisrael will obey him. "},{"num":21,"verse":"He will stand before Eleazar the kohen, who will pray and obtain judgments for him by Urim and before Adonai. At his mouth, they will go out and at his mouth they will come in, he and all the community of Bnei-Yisrael with him.”"},{"num":22,"verse":"Moses did as Adonai commanded him. He took Joshua, stood him before Eleazar the kohen and all the entire assembly. "},{"num":23,"verse":"Then he laid his hands on him and commissioned him just as Adonai had spoken, by Moses’ hand."}]