[[],[{"type":"header","content":"Thanksgiving"},{"type":"prose","content":"Paul and Timothy, bond-servants of Christ Jesus (the Messiah, the Anointed),To all the saints (God’s people) in Christ Jesus who are at Philippi, including the overseers and deacons: "}],[{"type":"prose","content":"Grace to you and peace [inner calm and spiritual well-being] from God our Father and the Lord Jesus Christ."}],[{"type":"prose","content":"I thank my God in every remembrance of you, "}],[{"type":"prose","content":"always offering every prayer of mine with joy [and with specific requests] for all of you, "}],[{"type":"prose","content":"[thanking God] for your participation  partnership [both your comforting fellowship and gracious contributions] in [advancing] the good news [regarding salvation] from the first day [you heard it] until now. "}],[{"type":"prose","content":"I am convinced  confident of this very thing, that He who has begun a good work in you will [continue to] perfect  complete it until the day of Christ Jesus [the time of His return]. "}],[{"type":"prose","content":"It is right for me to feel this way about you, because [you have me in your heart as] I have you in my heart, since both in my imprisonment and in the defense and confirmation of the good news [regarding salvation], all of you share in [His matchless] grace with me. "}],[{"type":"prose","content":"For God is my witness, how I long for all of you with the affection of Christ Jesus [whose great love fills me]. "}],[{"type":"prose","content":"And this I pray, that your love may abound more and more [displaying itself in greater depth] in real knowledge and in practical insight, "}],[{"type":"prose","content":"so that you may learn to recognize  treasure what is excellent [identifying the best, and distinguishing moral differences], and that you may be pure and blameless until the day of Christ [actually living lives that lead others away from sin]; "}],[{"type":"prose","content":"filled with the fruit of righteousness which comes through Jesus Christ, to the glory and praise of God [so that His glory may be both revealed and recognized]."},{"type":"header","content":"The Gospel Is Preached"}],[{"type":"prose","content":"Now I want you to know, believers, that what has happened to me [this imprisonment that was meant to stop me] has actually served to advance [the spread of] the good news [regarding salvation]. "}],[{"type":"prose","content":"My imprisonment in [the cause of] Christ has become common knowledge throughout the whole praetorian (imperial) guard and to everyone else. "}],[{"type":"prose","content":"Because of my chains [seeing that I am doing well and that God is accomplishing great things], most of the brothers have renewed confidence in the Lord, and have far more courage to speak the word of God [concerning salvation] without fear [of the consequences, seeing that God can work His good in all circumstances]. "}],[{"type":"prose","content":"Some, it is true, are [actually] preaching Christ out of envy and rivalry [toward me—for no better reason than a competitive spirit or misguided ambition], but others out of goodwill  a loyal spirit [toward me]. "}],[{"type":"prose","content":"The latter [preach Christ] out of love, because they know that I have been put here [by God on purpose] for the defense of the gospel; "}],[{"type":"prose","content":"but the former preach Christ [insincerely] out of selfish ambition [just self-promotion], thinking that they are causing me distress in my imprisonment. "}],[{"type":"prose","content":"What then [does it matter]? So long as in every way, whether in pretense [for self-promotion] or in all honesty [to spread the truth], Christ is being preached; and in this I rejoice.Yes, and I will rejoice [later as well], "}],[{"type":"prose","content":"for I know [with confidence] that this will turn out for my deliverance  spiritual well-being, through your prayers and the [superabundant] supply of the Spirit of Jesus Christ [which upholds me]. "}],[{"type":"prose","content":"It is my own eager expectation and hope, that [looking toward the future] I will not disgrace myself  be ashamed in anything, but that with courage  the utmost freedom of speech, even now as always, Christ will be magnified  exalted in my body, whether by life or by death."},{"type":"header","content":"To Live Is Christ"}],[{"type":"prose","content":"For to me, to live is Christ [He is my source of joy, my reason to live] and to die is gain [for I will be with Him in eternity]. "}],[{"type":"prose","content":"If, however, it is to be life here  I am to go on living, this  useful  productive service for me; so I do not know which to choose [if I am given that choice]. "}],[{"type":"prose","content":"But I am hard-pressed between the two. I have the desire to leave [this world] and be with Christ, for that is far, far better; "}],[{"type":"prose","content":"yet to remain in my body is more necessary  essential for your sake. "}],[{"type":"prose","content":"Since I am convinced of this, I know that I will remain and continue with all of you for your progress and joy in the faith, "}],[{"type":"prose","content":"so that your rejoicing for me may overflow in Christ Jesus through my coming to you again."}],[{"type":"prose","content":"Only [be sure to] lead your lives in a manner [that will be] worthy of the gospel of Christ, so that whether I do come and see you or remain absent, I will hear about you that you are standing firm in one spirit [and one purpose], with one mind striving side by side [as if in combat] for the faith of the gospel. "}],[{"type":"prose","content":"And in no way be alarmed  intimidated [in anything] by your opponents, for such [constancy and fearlessness on your part] is a [clear] sign [a proof and a seal] for them of [their impending] destruction, but [a clear sign] for you of deliverance  salvation, and that , from God. "}],[{"type":"prose","content":"For you have been granted [the privilege] for Christ’s sake, not only to believe  confidently trust in Him, but also to suffer for His sake, "}],[{"type":"prose","content":"[and so you are] experiencing the same [kind of] conflict which you saw me endure, and which you hear to be mine now."}]]