[{"num":1,"verse":"From Paul and Timothy, servants of Christ Jesus."},{"num":2,"verse":"I pray that God our Father and the Lord Jesus Christ will be kind to you and will bless you with peace!"},{"header":"Paul’s Prayer for the Church in Philippi"},{"num":3,"verse":"Every time I think of you, I thank my God. "},{"num":4,"verse":"And whenever I mention you in my prayers, it makes me happy. "},{"num":5,"verse":"This is because you have taken part with me in spreading the good news from the first day you heard about it. "},{"num":6,"verse":"God is the one who began this good work in you, and I am certain that he won’t stop before it is complete on the day that Christ Jesus returns."},{"num":7,"verse":"You have a special place in my heart. So it is only natural for me to feel the way I do. All of you have helped in the work that God has given me, as I defend the good news and tell about it here in jail. "},{"num":8,"verse":"God himself knows how much I want to see you. He knows that I care for you in the same way that Christ Jesus does."},{"num":9,"verse":"I pray that your love will keep on growing and that you will fully know and understand "},{"num":10,"verse":"how to make the right choices. Then you will still be pure and innocent when Christ returns. And until that day, "},{"num":11,"verse":"Jesus Christ will keep you busy doing good deeds that bring glory and praise to God."},{"header":"What Life Means to Paul"},{"num":12,"verse":"My dear friends, I want you to know that what has happened to me has helped to spread the good news. "},{"num":13,"verse":"The Roman guards and all the others know that I am here in jail because I serve Christ. "},{"num":14,"verse":"Now most of the Lord’s followers have become brave and are fearlessly telling the message."},{"num":15,"verse":"Some are preaching about Christ because they are jealous and envious of us. Others are preaching because they want to help. "},{"num":16,"verse":"They love Christ and know that I am here to defend the good news about him. "},{"num":17,"verse":"But the ones who are jealous of us are not sincere. They just want to cause trouble for me while I am in jail. "},{"num":18,"verse":"But that doesn’t matter. All that matters is that people are telling about Christ, whether they are sincere or not. That is what makes me glad."},{"num":19,"verse":"because I know that your prayers and the help that comes from the Spirit of Christ Jesus will keep me safe. "},{"num":20,"verse":"I honestly expect and hope that I will never do anything to be ashamed of. Whether I live or die, I always want to be as brave as I am now and bring honor to Christ."},{"num":21,"verse":"If I live, it will be for Christ, and if I die, I will gain even more. "},{"num":22,"verse":"I don’t know what to choose. I could keep on living and doing something useful. "},{"num":23,"verse":"It is a hard choice to make. I want to die and be with Christ, because that would be much better. "},{"num":24,"verse":"But I know that all of you still need me. That’s why I am sure I will stay on to help you grow and be happy in your faith. "},{"num":26,"verse":"Then, when I visit you again, you will have good reason to take great pride in Christ Jesus because of me."},{"num":27,"verse":"Above all else, you must live in a way that brings honor to the good news about Christ. Then, whether I visit you or not, I will hear that all of you think alike. I will know that you are working together and that you are struggling side by side to get others to believe the good news."},{"num":28,"verse":"Be brave when you face your enemies. Your courage will show them that they are going to be destroyed, and it will show you that you will be saved. God will make all of this happen, "},{"num":29,"verse":"and he has blessed you. Not only do you have faith in Christ, but you suffer for him. "},{"num":30,"verse":"You saw me suffer, and you still hear about my troubles. Now you must suffer in the same way."}]