[{"header":"Greeting"},{"num":1,"verse":"Paul and Timothy, slaves of Christ Jesus:"},{"num":2,"verse":"Grace to you and peace from God our Father and the Lord Jesus Christ."},{"header":"Thanksgiving and Prayer"},{"num":3,"verse":"I give thanks to my God for every remembrance of you, "},{"num":4,"verse":"always praying with joy for all of you in my every prayer, "},{"num":5,"verse":"because of your partnership in the gospel from the first day until now. "},{"num":6,"verse":"I am sure of this, that He who started a good work in you will carry it on to completion until the day of Christ Jesus. "},{"num":7,"verse":"It is right for me to think this way about all of you, because I have you in my heart, and you are all partners with me in grace, both in my imprisonment and in the defense and establishment of the gospel. "},{"num":8,"verse":"For God is my witness, how deeply I miss all of you with the affection of Christ Jesus. "},{"num":9,"verse":"And I pray this: that your love will keep on growing in knowledge and every kind of discernment, "},{"num":10,"verse":"so that you can approve the things that are superior and can be pure and blameless in the day of Christ, "},{"num":11,"verse":"filled with the fruit of righteousness that comes through Jesus Christ to the glory and praise of God."},{"header":"Advance of the Gospel"},{"num":12,"verse":"Now I want you to know, brothers, that what has happened to me has actually resulted in the advance of the gospel, "},{"num":13,"verse":"so that it has become known throughout the whole imperial guard, and to everyone else, that my imprisonment is in the cause of Christ. "},{"num":14,"verse":"Most of the brothers in the Lord have gained confidence from my imprisonment and dare even more to speak the message fearlessly. "},{"num":15,"verse":"To be sure, some preach Christ out of envy and strife, but others out of good will. "},{"num":16,"verse":"These do so out of love, knowing that I am appointed for the defense of the gospel; "},{"num":17,"verse":"the others proclaim Christ out of rivalry, not sincerely, seeking to cause me anxiety in my imprisonment. "},{"num":18,"verse":"What does it matter? Just that in every way, whether out of false motives or true, Christ is proclaimed. And in this I rejoice. Yes, and I will rejoice "},{"num":19,"verse":"because I know this will lead to my deliverance through your prayers and help from the Spirit of Jesus Christ. "},{"num":20,"verse":"My eager expectation and hope is that I will not be ashamed about anything, but that now as always, with all boldness, Christ will be highly honored in my body, whether by life or by death."},{"header":"Living Is Christ"},{"num":21,"verse":"For me, living is Christ and dying is gain. "},{"num":22,"verse":"Now if I live on in the flesh, this means fruitful work for me; and I don’t know which one I should choose. "},{"num":23,"verse":"I am pressured by both. I have the desire to depart and be with Christ—which is far better— "},{"num":24,"verse":"but to remain in the flesh is more necessary for you. "},{"num":25,"verse":"Since I am persuaded of this, I know that I will remain and continue with all of you for your progress and joy in the faith, "},{"num":26,"verse":"so that, because of me, your confidence may grow in Christ Jesus when I come to you again."},{"num":27,"verse":"Just one thing: Live your life in a manner worthy of the gospel of Christ. Then, whether I come and see you or am absent, I will hear about you that you are standing firm in one spirit, with one mind, working side by side for the faith that comes from the gospel, "},{"num":28,"verse":"not being frightened in any way by your opponents. This is a sign of destruction for them, but of your deliverance—and this is from God. "},{"num":29,"verse":"For it has been given to you on Christ’s behalf not only to believe in Him, but also to suffer for Him, "},{"num":30,"verse":"having the same struggle that you saw I had and now hear that I have."}]