[[],[{"type":"header","content":"Salutation"},{"type":"prose","content":"From Paul and Timothy, slaves of Christ Jesus, to all the saints in Christ Jesus who are in Philippi, with the overseers and deacons. "}],[{"type":"prose","content":"Grace and peace to you from God our Father and the Lord Jesus Christ!"},{"type":"header","content":"Prayer for the Church"}],[{"type":"prose","content":"I thank my God every time I remember you. "}],[{"type":"prose","content":"I always pray with joy in my every prayer for all of you "}],[{"type":"prose","content":"because of your participation in the gospel from the first day until now. "}],[{"type":"prose","content":"For I am sure of this very thing, that the one who began a good work in you will perfect it until the day of Christ Jesus. "}],[{"type":"prose","content":"For it is right for me to think this about all of you, because I have you in my heart, since both in my imprisonment and in the defense and confirmation of the gospel all of you became partners in God’s grace together with me. "}],[{"type":"prose","content":"For God is my witness that I long for all of you with the affection of Christ Jesus. "}],[{"type":"prose","content":"And I pray this, that your love may abound even more and more in knowledge and every kind of insight "}],[{"type":"prose","content":"so that you can decide what is best, and thus be sincere and blameless for the day of Christ, "}],[{"type":"prose","content":"filled with the fruit of righteousness that comes through Jesus Christ to the glory and praise of God."},{"type":"header","content":"Ministry as a Prisoner"}],[{"type":"prose","content":"I want you to know, brothers and sisters, that my situation has actually turned out to advance the gospel: "}],[{"type":"prose","content":"The whole imperial guard and everyone else knows that I am in prison for the sake of Christ, "}],[{"type":"prose","content":"and most of the brothers and sisters, having confidence in the Lord because of my imprisonment, now more than ever dare to speak the word fearlessly."}],[{"type":"prose","content":"Some, to be sure, are preaching Christ from envy and rivalry, but others from goodwill. "}],[{"type":"prose","content":"The latter do so from love because they know that I am placed here for the defense of the gospel. "}],[{"type":"prose","content":"The former proclaim Christ from selfish ambition, not sincerely, because they think they can cause trouble for me in my imprisonment. "}],[{"type":"prose","content":"What is the result? Only that in every way, whether in pretense or in truth, Christ is being proclaimed, and in this I rejoice.Yes, and I will continue to rejoice, "}],[{"type":"prose","content":"for I know that this will turn out for my deliverance through your prayers and the help of the Spirit of Jesus Christ. "}],[{"type":"prose","content":"My confident hope is that I will in no way be ashamed but that with complete boldness, even now as always, Christ will be exalted in my body, whether I live or die. "}],[{"type":"prose","content":"For to me, living is Christ and dying is gain. "}],[{"type":"prose","content":"Now if I am to go on living in the body, this will mean productive work for me, yet I don’t know which I prefer: "}],[{"type":"prose","content":"I feel torn between the two, because I have a desire to depart and be with Christ, which is better by far, "}],[{"type":"prose","content":"but it is more vital for your sake that I remain in the body. "}],[{"type":"prose","content":"And since I am sure of this, I know that I will remain and continue with all of you for the sake of your progress and joy in the faith, "}],[{"type":"prose","content":"so that what you can be proud of may increase because of me in Christ Jesus, when I come back to you."}],[{"type":"prose","content":"Only conduct yourselves in a manner worthy of the gospel of Christ so that—whether I come and see you or whether I remain absent—I should hear that you are standing firm in one spirit, with one mind, by contending side by side for the faith of the gospel, "}],[{"type":"prose","content":"and by not being intimidated in any way by your opponents. This is a sign of their destruction, but of your salvation—a sign which is from God. "}],[{"type":"prose","content":"For it has been granted to you not only to believe in Christ but also to suffer for him, "}],[{"type":"prose","content":"since you are encountering the same conflict that you saw me face and now hear that I am facing."}]]