[{"header":"Greetings"},{"num":1,"verse":"Paul and Timothy, slaves of Messiah Yeshua,"},{"num":2,"verse":"Grace to you and shalom from God our Father and the Lord Yeshua the Messiah."},{"header":"Thanksgiving and Prayers of Joy"},{"num":3,"verse":"I thank my God at every memory of you, "},{"num":4,"verse":"always praying with joy in every prayer of mine for you all, "},{"num":5,"verse":"because of your sharing in the Good News from the first day until now. "},{"num":6,"verse":"I am sure of this very thing—that He who began a good work in you will carry it on to completion until the Day of Messiah Yeshua. "},{"num":7,"verse":"It is right for me to feel this way about you all, because I have you in my heart—for you all are partakers of grace with me, both in my imprisonment and in the defense and confirmation of the Good News. "},{"num":8,"verse":"For God is my witness, how I long for all of you with the affection of Messiah Yeshua."},{"num":9,"verse":"Now this I pray, that your love might overflow still more and more in knowledge and depth of discernment, "},{"num":10,"verse":"in order to approve what is excellent—so that in the Day of Messiah you may be sincere and blameless, "},{"num":11,"verse":"filled with the fruit of righteousness that comes through Yeshua the Messiah, to the glory and praise of God."},{"header":"Even in Chains, Proclaiming Messiah"},{"num":12,"verse":"Now I want you to know, brothers and sisters, that what has happened to me has actually resulted in the advancement of the Good News. "},{"num":13,"verse":"And so my imprisonment in the cause of Messiah has become well known throughout the whole Praetorian Guard and to everyone else. "},{"num":14,"verse":"Because of my imprisonment, most of the brothers and sisters have become confident in the Lord to dare more than ever to speak the message fearlessly. "},{"num":15,"verse":"Some are proclaiming the Messiah out of envy and strife, but others out of good will. "},{"num":16,"verse":"The latter do so out of love, knowing that I am appointed for the defense of the Good News. "},{"num":17,"verse":"The former proclaim Messiah not sincerely, but out of selfishness—expecting to stir up trouble for me in my imprisonment. "},{"num":18,"verse":"But what does it matter? Only that in every way, whether in dishonesty or in truth, Messiah is being proclaimed—and in this I rejoice!"},{"header":"To Live Is Messiah"},{"num":19,"verse":"for I know that this will turn out for my deliverance, through your intercession and the help of the Ruach of Messiah Yeshua. "},{"num":20,"verse":"My eager expectation and hope is that in no way will I be put to shame, but that with complete boldness Messiah will even now, as always, be exalted in my body—whether through life or through death. "},{"num":21,"verse":"For to me, to live is Messiah and to die is gain. "},{"num":22,"verse":"But if to live on in the body means fruit from my work, what shall I choose? I do not know. "},{"num":23,"verse":"I am torn between the two—having a desire to leave and be with Messiah, which is far better; "},{"num":24,"verse":"yet for your sake, to remain in the body is more necessary. "},{"num":25,"verse":"Convinced of this, I know that I will remain and continue with you all, for the sake of your progress and joy in the faith—"},{"num":26,"verse":"so that your confidence in Messiah Yeshua might overflow because of me through my coming to you again."},{"num":27,"verse":"Only live your lives in a manner worthy of the Good News of the Messiah. Then, whether I come and see you or I am absent, I may hear of you that you are standing firm in one spirit—striving side by side with one mind for the faith of the Good News "},{"num":28,"verse":"and not being frightened in any way by your opponents. For them this is a sign of destruction, but for you salvation—and that from God. "},{"num":29,"verse":"For to you was granted for Messiah’s sake not only to trust in Him, but also to suffer for His sake—"},{"num":30,"verse":"experiencing the same struggle you saw in me and now you are hearing in me."}]