[{"num":1,"verse":"Paul and Timothy, slaves of Jesus the Anointed One, greet you, our friends in Philippi—those set apart by Jesus the Anointed—and we greet the elders and deacons who serve with you. "},{"num":2,"verse":"Grace and peace be with you from God our Father and the Lord Jesus the Anointed."},{"num":3,"verse":"Whenever you cross my mind, I thank my God for you and for the gift of knowing you. "},{"num":4,"verse":"My spirit is lightened with joy whenever I pray for you (and I do constantly) "},{"num":5,"verse":"because you have partnered with me to spread the gospel since the first day I preached to you."},{"num":6,"verse":"I am confident that the Creator, who has begun such a great work among you, will not stop in mid-design but will keep perfecting you until the day Jesus the Anointed, our Liberating King, returns to redeem the world. "},{"num":7,"verse":"It is only right that I should feel such admiration for you all—you hold me close to your hearts. And, since we are partners in this great work of grace, you have never failed to stand with me as I have defended and stood firm for the gospel—even from this prison cell. "},{"num":8,"verse":"Before God I want you to know how much I long to see you and love you with the affection of the Anointed One, Jesus."},{"num":9,"verse":"Here’s what I pray for you:"},{"num":12,"verse":"I have good news, brothers and sisters; and I want to share it. Believe it or not, my imprisonment has actually helped spread the good news to new places and populations. "},{"num":13,"verse":"Word has spread through the ranks of the imperial guard and to everyone else around me that I am in prison because of my faith in the Anointed One. "},{"num":14,"verse":"My imprisonment has instilled courage in most of our brothers and sisters, so they are trusting God more and have been even more daring as they speak the good news without fear."},{"num":15,"verse":"I am well aware that some people out there are preaching the message of the Anointed One because of jealousies and rivalries. Their motives aren’t pure. They’re driven by selfish ambitions and personal agendas, hoping somehow to add to my pain here in prison. And I also know there are others who are preaching the Anointed from true goodness, motivated by love. They wish me the best because they know I’m here in prison in defense of the gospel."},{"num":18,"verse":"So what do we do then? Listen. What matters is that in every way, regardless of the motives—whether pure or shady—the great story of the Anointed is a cause for joy. I will continue to rejoice "},{"num":19,"verse":"because I know that through your encouragement and prayers and through the help of the Spirit of Jesus the Anointed, I will soon be released from this dark place. "},{"num":20,"verse":"I don’t expect that dishonor and shame will plague me in any way, but I do hope that I will continue to be able to speak freely and courageously about Jesus, and that now and forever the Anointed One will be glorified and placed above all else through this body of mine—whether I live or die. "},{"num":21,"verse":"For my life is about the Anointed and Him alone. And my death, when that comes, will mean great gain for me. "},{"num":22,"verse":"So, if it’s His will that I go on serving here, my work will be fruitful for the message. I honestly wouldn’t know how or what to choose; "},{"num":23,"verse":"I would be hard-pressed to decide. I lean toward leaving this world to be with the Anointed One because I can only think that would be much better. "},{"num":24,"verse":"To stay in this body of flesh—even with all its pains and weaknesses—would best serve your needs. "},{"num":25,"verse":"Now that I think of it, I am sure of this: I would prefer to remain to share in the progress and joy of your growing belief. "},{"num":26,"verse":"When I return to you, we will celebrate Jesus the Anointed even more."},{"num":27,"verse":"So here is what I want you to do: conduct yourselves as true and worthy citizens of the Anointed’s gospel, so that whether I make it or don’t make it to see you, I will at least hear that you continue to stand, united in one spirit, single-minded in purpose as you struggle together for the faith in the gospel. "},{"num":28,"verse":"Don’t be paralyzed in any way by what your opponents are doing. Your steadfast faith in the face of opposition is a sign that they are doomed and that you have been graced with God’s salvation. "},{"num":29,"verse":"And now, you have been given the privilege of not only believing in Jesus the Anointed, our Liberating King, but being chosen to suffer for Him as well. "},{"num":30,"verse":"You have seen me suffer for Him. Since I’ve been away, you’ve heard of the other agonizing conflicts I’ve had to face. Now you know firsthand the pains of this battle."}]