[{"num":39,"verse":"“Son of man, prophesy against Gog. Tell him, ‘The Lord and King says, “Gog, I am against you. You are the chief prince of Meshek and Tubal. "},{"num":2,"verse":"But I will turn you around. I will drag you along. I will bring you from the far north. I will send you against the mountains of Israel. "},{"num":3,"verse":"Then I will knock your bow out of your left hand. I will make your arrows drop from your right hand. "},{"num":4,"verse":"You will fall dead on the mountains of Israel. You and all your troops will die there. So will the nations that join you. I will feed you to all kinds of birds that eat dead bodies. So they and the wild animals will eat you up. "},{"num":5,"verse":"You will fall dead in the open fields. I have spoken,” announces the Lord and King. "},{"num":6,"verse":"“I will send fire on the land of Magog. It will burn up the people who live in safety on the coast. So they will know that I am the Lord."},{"num":7,"verse":"“ ‘ “I will make my holy name known among my people Israel. I will no longer let them treat my name as if it were not holy. Then the nations will know that I am the Holy One in Israel. I am the Lord. "},{"num":8,"verse":"The day I will judge you is coming. You can be sure of it,” announces the Lord and King. “It is the day I have spoken about."},{"num":9,"verse":"“ ‘ “At that time those who live in the towns of Israel will go out and light a fire. They will use it to burn up the weapons. That includes small and large shields. It also includes bows and arrows, war clubs and spears. It will take seven years to burn all of them up. "},{"num":10,"verse":"People will not gather wood from the fields. They will not cut down the forests. Instead, they will burn the weapons. And they will rob those who robbed them. They will steal from those who stole from them,” announces the Lord and King."},{"num":11,"verse":"“ ‘ “Gog, at that time I will bury you in a grave in Israel. It will be in the valley where people travel east of the Dead Sea. It will block the path of travelers. That’s because you and your huge armies will be buried there. So it will be called the Valley of Gog’s Armies."},{"num":12,"verse":"“ ‘ “It will take seven months for the Israelites to bury the bodies. They will do this to make the land ‘clean’ again. "},{"num":13,"verse":"All the people in the land will bury them. The day that I show how glorious I am will be a time to remember.” This is what the Lord and King announces. "},{"num":14,"verse":"“People will keep being hired to make the land ‘clean’ again. They will go all through it. They and others will bury any bodies lying on the ground."},{"num":15,"verse":"As they go through the land here is what they’ll do. When anyone sees a bone, they will put a marker beside it. Then those who dig the graves will take the bone to the Valley of Gog’s Armies. There they will bury it. "},{"num":16,"verse":"That is how they will make the land ‘clean’ again.” ’ ” Also a town called Gog’s Armies is near there."},{"num":17,"verse":"The Lord and King said to me, “Son of man, speak to every kind of bird. Call out to all the wild animals. Tell them, ‘Gather together. Come from everywhere. Gather around the sacrifice I am preparing for you. It is the great sacrifice on the mountains of Israel. There you will eat human bodies and drink human blood. "},{"num":18,"verse":"You will eat the bodies of mighty men. You will drink the blood of the princes of the earth. You will eat their bodies and drink their blood. You will do this as if they were rams and lambs, goats and bulls. You will enjoy it as if you were eating the fattest animals from Bashan. "},{"num":19,"verse":"So I am preparing a sacrifice for you. You will eat fat until you are completely full. You will drink blood until you are drunk. "},{"num":20,"verse":"At my table you will eat horses, riders, mighty men and soldiers until you are full,’ announces the Lord and King."},{"num":21,"verse":"“ ‘I will show all the nations my glory. They will see how I punish them when I use my power against them. "},{"num":22,"verse":"From that time on, the people of Israel will know that I am the Lord their God. "},{"num":23,"verse":"The nations will know that the people of Israel were taken away as prisoners because they sinned against me. They were not faithful to me. So I turned my face away from them. I handed them over to their enemies. All of them were killed by swords. "},{"num":24,"verse":"I punished them because they were “unclean.” They did many things that were wrong. So I turned my face away from them.’ ”"},{"num":25,"verse":"The Lord and King says, “I will now cause the people of Jacob to recover from my judgment. I will show my tender love for all the people of Israel. I will make sure that my name is kept holy. "},{"num":26,"verse":"My people will forget the shameful things they have done. They will not remember all the ways they were unfaithful to me. They used to live in safety in their land. At that time no one made them afraid. "},{"num":27,"verse":"So I will bring them back from the nations. I will gather them from the countries of their enemies. And I will use them to prove to many nations how holy I am. "},{"num":28,"verse":"Then they will know that I am the Lord their God. I let the nations take my people away as prisoners. But now I will bring them back to their own land. I will not leave anyone behind. "},{"num":29,"verse":"I will no longer turn my face away from the people of Israel. I will pour out my Spirit on them,” announces the Lord and King."}]