[[],[{"type":"header","content":"The Slaughter of Gog’s Hordes"},{"type":"prose","content":"“Son of man, prophesy against Gog. Give him this message from the Sovereign LORD: I am your enemy, O Gog, ruler of the nations of Meshech and Tubal."}],[{"type":"prose","content":"I will turn you around and drive you toward the mountains of Israel, bringing you from the distant north."}],[{"type":"prose","content":"I will knock the bow from your left hand and the arrows from your right hand, and I will leave you helpless."}],[{"type":"prose","content":"You and your army and your allies will all die on the mountains. I will feed you to the vultures and wild animals."}],[{"type":"prose","content":"You will fall in the open fields, for I have spoken, says the Sovereign LORD."}],[{"type":"prose","content":"And I will rain down fire on Magog and on all your allies who live safely on the coasts. Then they will know that I am the LORD."}],[{"type":"prose","content":"“In this way, I will make known my holy name among my people of Israel. I will not let anyone bring shame on it. And the nations, too, will know that I am the LORD, the Holy One of Israel."}],[{"type":"prose","content":"That day of judgment will come, says the Sovereign LORD. Everything will happen just as I have declared it."}],[{"type":"prose","content":"“Then the people in the towns of Israel will go out and pick up your small and large shields, bows and arrows, javelins and spears, and they will use them for fuel. There will be enough to last them seven years!"}],[{"type":"prose","content":"They won’t need to cut wood from the fields or forests, for these weapons will give them all the fuel they need. They will plunder those who planned to plunder them, and they will rob those who planned to rob them, says the Sovereign LORD."}],[{"type":"prose","content":"“And I will make a vast graveyard for Gog and his hordes in the Valley of the Travelers, east of the Dead Sea. It will block the way of those who travel there, and they will change the name of the place to the Valley of Gog’s Hordes."}],[{"type":"prose","content":"It will take seven months for the people of Israel to bury the bodies and cleanse the land."}],[{"type":"prose","content":"Everyone in Israel will help, for it will be a glorious victory for Israel when I demonstrate my glory on that day, says the Sovereign LORD."}],[{"type":"prose","content":"“After seven months, teams of men will be appointed to search the land for skeletons to bury, so the land will be made clean again."}],[{"type":"prose","content":"Whenever bones are found, a marker will be set up so the burial crews will take them to be buried in the Valley of Gog’s Hordes."}],[{"type":"prose","content":"(There will be a town there named Hamonah, which means ‘horde.’) And so the land will finally be cleansed."}],[{"type":"prose","content":"“And now, son of man, this is what the Sovereign LORD says: Call all the birds and wild animals. Say to them: Gather together for my great sacrificial feast. Come from far and near to the mountains of Israel, and there eat flesh and drink blood!"}],[{"type":"prose","content":"Eat the flesh of mighty men and drink the blood of princes as though they were rams, lambs, goats, and bulls—all fattened animals from Bashan!"}],[{"type":"prose","content":"Gorge yourselves with flesh until you are glutted; drink blood until you are drunk. This is the sacrificial feast I have prepared for you."}],[{"type":"prose","content":"Feast at my banquet table—feast on horses and charioteers, on mighty men and all kinds of valiant warriors, says the Sovereign LORD."}],[{"type":"prose","content":"“In this way, I will demonstrate my glory to the nations. Everyone will see the punishment I have inflicted on them and the power of my fist when I strike."}],[{"type":"prose","content":"And from that time on the people of Israel will know that I am the LORD their God."}],[{"type":"prose","content":"The nations will then know why Israel was sent away to exile—it was punishment for sin, for they were unfaithful to their God. Therefore, I turned away from them and let their enemies destroy them."}],[{"type":"prose","content":"I turned my face away and punished them because of their defilement and their sins."}],[{"type":"header","content":"Restoration for God’s People"},{"type":"prose","content":"“So now, this is what the Sovereign LORD says: I will end the captivity of my people; I will have mercy on all Israel, for I jealously guard my holy reputation!"}],[{"type":"prose","content":"They will accept responsibility for their past shame and unfaithfulness after they come home to live in peace in their own land, with no one to bother them."}],[{"type":"prose","content":"When I bring them home from the lands of their enemies, I will display my holiness among them for all the nations to see."}],[{"type":"prose","content":"Then my people will know that I am the LORD their God, because I sent them away to exile and brought them home again. I will leave none of my people behind."}],[{"type":"prose","content":"And I will never again turn my face from them, for I will pour out my Spirit upon the people of Israel. I, the Sovereign LORD, have spoken!”"}]]