[{"header":"Offerings for the Temple"},{"num":29,"verse":"Then King David said to the entire assembly, “My son Solomon, whom alone God has chosen, is still young and inexperienced and the work is great; for the temple is not for man, but for the Lord God."},{"num":2,"verse":"Now with all my ability I have provided for the house of my God the gold for the things of gold, and the silver for the things of silver, and the bronze for the things of bronze, the iron for the things of iron, and wood for the things of wood, onyx stones and inlaid stones, stones of antimony and stones of various colors, and all kinds of precious stones and alabaster in abundance."},{"num":3,"verse":"Moreover, in my delight in the house of my God, the treasure I have of gold and silver, I give to the house of my God, over and above all that I have already provided for the holy temple,"},{"num":4,"verse":"namely, 3,000 talents of gold, of the gold of Ophir, and 7,000 talents of refined silver, to overlay the walls of the buildings;"},{"num":5,"verse":"of gold for the things of gold and of silver for the things of silver, that is, for all the work done by the craftsmen. Who then is willing to consecrate himself this day to the Lord?”"},{"num":6,"verse":"Then the rulers of the fathers’ households, and the princes of the tribes of Israel, and the commanders of thousands and of hundreds, with the overseers over the king’s work, offered willingly;"},{"num":7,"verse":"and for the service for the house of God they gave 5,000 talents and 10,000 darics of gold, and 10,000 talents of silver, and 18,000 talents of brass, and 100,000 talents of iron."},{"num":8,"verse":"Whoever possessed precious stones gave them to the treasury of the house of the Lord, in care of Jehiel the Gershonite."},{"num":9,"verse":"Then the people rejoiced because they had offered so willingly, for they made their offering to the Lord with a whole heart, and King David also rejoiced greatly."},{"header":"David’s Prayer"},{"num":10,"verse":"So David blessed the Lord in the sight of all the assembly; and David said, “Blessed are You, O Lord God of Israel our father, forever and ever."},{"num":11,"verse":"Yours, O Lord, is the greatness and the power and the glory and the victory and the majesty, indeed everything that is in the heavens and the earth; Yours is the dominion, O Lord, and You exalt Yourself as head over all."},{"num":12,"verse":"Both riches and honor come from You, and You rule over all, and in Your hand is power and might; and it lies in Your hand to make great and to strengthen everyone."},{"num":13,"verse":"Now therefore, our God, we thank You, and praise Your glorious name."},{"num":14,"verse":"“But who am I and who are my people that we should be able to offer as generously as this? For all things come from You, and from Your hand we have given You."},{"num":15,"verse":"For we are sojourners before You, and tenants, as all our fathers were; our days on the earth are like a shadow, and there is no hope."},{"num":16,"verse":"O Lord our God, all this abundance that we have provided to build You a house for Your holy name, it is from Your hand, and all is Yours."},{"num":17,"verse":"Since I know, O my God, that You try the heart and delight in uprightness, I, in the integrity of my heart, have willingly offered all these things; so now with joy I have seen Your people, who are present here, make their offerings willingly to You."},{"num":18,"verse":"O Lord, the God of Abraham, Isaac and Israel, our fathers, preserve this forever in the intentions of the heart of Your people, and direct their heart to You;"},{"num":19,"verse":"and give to my son Solomon a perfect heart to keep Your commandments, Your testimonies and Your statutes, and to do them all, and to build the temple, for which I have made provision.”"},{"num":20,"verse":"Then David said to all the assembly, “Now bless the Lord your God.” And all the assembly blessed the Lord, the God of their fathers, and bowed low and did homage to the Lord and to the king."},{"header":"Sacrifices"},{"num":21,"verse":"On the next day they made sacrifices to the Lord and offered burnt offerings to the Lord, 1,000 bulls, 1,000 rams and 1,000 lambs, with their drink offerings and sacrifices in abundance for all Israel."},{"num":22,"verse":"So they ate and drank that day before the Lord with great gladness."},{"header":"Solomon Again Made King"},{"num":23,"verse":"Then Solomon sat on the throne of the Lord as king instead of David his father; and he prospered, and all Israel obeyed him."},{"num":24,"verse":"All the officials, the mighty men, and also all the sons of King David pledged allegiance to King Solomon."},{"num":25,"verse":"The Lord highly exalted Solomon in the sight of all Israel, and bestowed on him royal majesty which had not been on any king before him in Israel."},{"num":26,"verse":"Now David the son of Jesse reigned over all Israel."},{"num":27,"verse":"The period which he reigned over Israel was forty years; he reigned in Hebron seven years and in Jerusalem thirty-three years."},{"header":"Death of David"},{"num":28,"verse":"Then he died in a ripe old age, full of days, riches and honor; and his son Solomon reigned in his place."},{"num":29,"verse":"Now the acts of King David, from first to last, are written in the chronicles of Samuel the seer, in the chronicles of Nathan the prophet and in the chronicles of Gad the seer,"},{"num":30,"verse":"with all his reign, his power, and the circumstances which came on him, on Israel, and on all the kingdoms of the lands."}]