[{"header":"Chapter 7"},{"num":1,"verse":"The Temple Sermon. The word came to Jeremiah from the Lord: "},{"num":2,"verse":"Stand at the gate of the house of the Lord and proclaim this message there: Hear the word of the Lord, all you of Judah who enter these gates to worship the Lord! "},{"num":3,"verse":"Thus says the Lord of hosts, the God of Israel: Reform your ways and your deeds so that I may dwell with you in this place. "},{"num":4,"verse":"Do not put your trust in these deceptive words: “The temple of the Lord! The temple of the Lord! The temple of the Lord!” "},{"num":5,"verse":"Only if you thoroughly reform your ways and your deeds; if each of you deals justly with your neighbor; "},{"num":6,"verse":"if you no longer oppress the alien, the orphan, and the widow; if you no longer shed innocent blood in this place or follow after other gods to your own harm, "},{"num":7,"verse":"only then will I let you continue to dwell in this place, in the land I gave your ancestors long ago and forever."},{"num":8,"verse":"But look at you! You put your trust in deceptive words to your own loss! "},{"num":9,"verse":"Do you think you can steal and murder, commit adultery and perjury, sacrifice to Baal, follow other gods that you do not know, "},{"num":10,"verse":"and then come and stand in my presence in this house, which bears my name, and say: “We are safe! We can commit all these abominations again!”? "},{"num":11,"verse":"Has this house which bears my name become in your eyes a den of thieves? I have seen it for myself!—oracle of the Lord. "},{"num":12,"verse":"Go to my place at Shiloh, where I made my name dwell in the beginning. See what I did to it because of the wickedness of my people Israel. "},{"num":13,"verse":"And now, because you have committed all these deeds—oracle of the Lord—because you did not listen, though I spoke to you untiringly, and because you did not answer, though I called you, "},{"num":14,"verse":"I will do to this house, which bears my name, in which you trust, and to the place which I gave you and your ancestors, exactly what I did to Shiloh. "},{"num":15,"verse":"I will cast you out of my sight, as I cast away all your kindred, all the offspring of Ephraim."},{"num":16,"verse":"Abuses in Worship. You, now, must not intercede for this people! Do not raise a cry or prayer in their behalf! Do not press me, for I will not listen to you! "},{"num":17,"verse":"Do you not see what they are doing in the cities of Judah, in the streets of Jerusalem? "},{"num":18,"verse":"The children gather wood, their fathers light the fire, and the women knead dough to make cakes for the Queen of Heaven, while libations are poured out to other gods—all to offend me! "},{"num":19,"verse":"Are they really offending me—oracle of the Lord—or rather themselves, to their own disgrace? "},{"num":20,"verse":"Therefore, thus says the Lord God: my anger and my wrath will pour out upon this place, upon human being and beast, upon the trees of the field and the fruits of the earth; it will burn and not be quenched."},{"num":21,"verse":"Thus says the Lord of hosts, the God of Israel: Heap your burnt offerings upon your sacrifices; eat up the meat! "},{"num":22,"verse":"In speaking to your ancestors on the day I brought them out of the land of Egypt, I gave them no command concerning burnt offering or sacrifice. "},{"num":23,"verse":"This rather is what I commanded them: Listen to my voice; then I will be your God and you shall be my people. Walk exactly in the way I command you, so that you may prosper."},{"num":24,"verse":"But they did not listen to me, nor did they pay attention. They walked in the stubbornness of their evil hearts and turned their backs, not their faces, to me. "},{"num":25,"verse":"From the day that your ancestors left the land of Egypt even to this day, I kept on sending all my servants the prophets to you. "},{"num":26,"verse":"Yet they have not listened to me nor have they paid attention; they have stiffened their necks and done worse than their ancestors. "},{"num":27,"verse":"When you speak all these words to them, they will not listen to you either. When you call to them, they will not answer you. "},{"num":28,"verse":"Say to them: This is the nation which does not listen to the voice of the Lord, its God, or take correction. Faithfulness has disappeared; the word itself is banished from their speech."},{"num":30,"verse":"The people of Judah have done what is evil in my eyes—oracle of the Lord. They have set up their detestable things in the house which bears my name, thereby defiling it. "},{"num":31,"verse":"In the Valley of Ben-hinnom they go on building the high places of Topheth to sacrifice their sons and daughters by fire, something I never commanded or considered. "},{"num":32,"verse":"Be assured! Days are coming—oracle of the Lord—when they will no longer say “Topheth” or “Valley of Ben-hinnom” but “Valley of Slaughter.” For want of space, Topheth will become burial ground. "},{"num":33,"verse":"The corpses of this people will be food for the birds of the sky and beasts of the earth, which no one will drive away. "},{"num":34,"verse":"I will silence the cry of joy, the cry of gladness, the voice of the bridegroom and the voice of the bride, in the cities of Judah and in the streets of Jerusalem; for the land will be turned to rubble."}]