[{"header":"Ahab’s Seventy Sons Are Killed"},{"num":10,"verse":"Now Ahab had seventy sons in Samaria. So Jehu wrote letters. He sent them to Samaria, to the rulers of Jezreel, to the leaders, and to those who took care of Ahab’s children. He said, "},{"num":2,"verse":"“Now your owner’s sons are with you. And you have war-wagons, and horses, and a strong city, and things to fight with. When this letter comes to you, "},{"num":3,"verse":"choose the best of your owner’s sons. Put him on his father’s throne. And fight for your owner’s house.” "},{"num":4,"verse":"But they were filled with fear, and said, “See, the two kings could not stand in front of him. How can we stand?” "},{"num":5,"verse":"So the head man of the house, the head man of the city, the leaders, and those who took care of the children, sent word to Jehu. They said, “We are your servants. We will do all that you say. We will not make any man king. Do what is good in your eyes.” "},{"num":6,"verse":"Then Jehu wrote a letter to them a second time. He said, “If you are on my side and will obey me, bring the heads of your owner’s sons to me. Meet me in Jezreel about this time tomorrow.” Now the king’s seventy sons were with the important men of the city who were taking care of them. "},{"num":7,"verse":"When the letter came to them, they took the king’s seventy sons and killed them. They put their heads in baskets, and sent them to Jehu at Jezreel. "},{"num":8,"verse":"The men who had been sent returned and told Jehu, “They have brought the heads of the king’s sons.” And he said, “Put them one upon the other in two places at the gate until morning.” "},{"num":9,"verse":"In the morning Jehu went out and stood, and said to all the people, “You are without guilt. See, I made plans against my owner and killed him. But who killed all these? "},{"num":10,"verse":"Know now that everything the Lord spoke about the family of Ahab will come true. For the Lord has done what He said through his servant Elijah.” "},{"num":11,"verse":"So Jehu killed all who were left of the family of Ahab in Jezreel. He killed all of Ahab’s important men, his friends, and his religious leaders. Not one person of Ahab was left alive."},{"header":"Ahaziah’s Forty-Two Brothers Are Killed"},{"num":12,"verse":"Then Jehu left and went to Samaria. On the way, while he was at Beth-eked of the shepherds, "},{"num":13,"verse":"Jehu met the brothers of Ahaziah king of Judah. He asked them, “Who are you?” And they answered, “We are the brothers of Ahaziah. We have come down to visit the sons of the king and the sons of the queen mother.” "},{"num":14,"verse":"Jehu said, “Take them alive.” So his men took them alive, and killed them at the hole of Beth-eked, forty-two men. He left none of them alive."},{"header":"The Rest of Ahab’s Family Are Killed"},{"num":15,"verse":"When Jehu left there, he met Jehonadab the son of Rechab coming to meet him. Jehu said to him, “Is your heart right with my heart as mine is with yours?” And Jehonadab answered, “It is.” Jehu said, “If it is, give me your hand.” So Jehonadab gave him his hand, and Jehu took him up into the war-wagon with him. "},{"num":16,"verse":"Then Jehu said, “Come with me and see how glad I am to work for the Lord.” And he had him go in his war-wagon. "},{"num":17,"verse":"When he came to Samaria, he killed all of Ahab’s people who were left in Samaria. He destroyed them, as the word of the Lord was spoken to Elijah."},{"header":"The Worshipers of Baal Are Killed"},{"num":18,"verse":"Then Jehu gathered all the people and said to them, “Ahab worshiped Baal a little. Jehu will worship him much. "},{"num":19,"verse":"Now call all the men who speak for Baal, all his worshipers and all his religious leaders. Let no one be missing. For I have a big gift for Baal. Whoever is missing will not live.” But Jehu did this to fool them, so that he might destroy the worshipers of Baal. "},{"num":20,"verse":"He said, “Set apart a special meeting for Baal.” And they made the news known. "},{"num":21,"verse":"Then Jehu sent for all the worshipers of Baal in Israel. Every one of them came. When they went into the house of Baal, the house was filled from one end to the other. "},{"num":22,"verse":"Jehu said to the one who took care of the clothes, “Bring out clothing for all the worshipers of Baal.” So he brought out clothing for them. "},{"num":23,"verse":"Jehu went into the house of Baal with Jehonadab the son of Rechab. And he said to the worshipers of Baal, “Look and see that there are no servants of the Lord here with you, but only the worshipers of Baal.” "},{"num":24,"verse":"Then they went in to kill animals on the altar and give burnt gifts. Now Jehu had left eighty of his men outside. He had told them, “The one who lets anyone get away, will pay for it with his life.”"},{"num":25,"verse":"As soon as he had finished giving the burnt gift, Jehu said to the soldiers and the leaders, “Go in and kill them. Let no one come out.” And they killed them with the sword. Then the soldiers and leaders threw the bodies out, and went into the inside room of the house of Baal. "},{"num":26,"verse":"They brought out the objects of the house of Baal, and burned them. "},{"num":27,"verse":"They destroyed the objects of Baal and destroyed the house of Baal. They made it a place for body waste to this day. "},{"num":28,"verse":"So Jehu got rid of Baal from Israel."},{"num":29,"verse":"But Jehu did not turn away from the sins of Jeroboam the son of Nebat, which he made Israel sin. He kept the gold calves at Bethel and Dan. "},{"num":30,"verse":"The Lord said to Jehu, “You have done well what is right in My eyes. You have done to the family of Ahab all that was in My heart. So your sons, even your great great grandson, will sit on the throne of Israel.” "},{"num":31,"verse":"But Jehu was not careful to walk in the Law of the Lord, the God of Israel, with all his heart. He did not turn away from the sins of Jeroboam, which he made Israel sin."},{"header":"The Death of Jehu"},{"num":32,"verse":"In those days the Lord began to cut off parts of Israel. Hazael won over them in battle through the land of Israel. "},{"num":33,"verse":"He took the land east of the Jordan, all the land of Gilead, the Gadites, the Reubenites and the Manassites, from Aroer, by the valley of the Arnon. He took Gilead and Bashan. "},{"num":34,"verse":"Now the rest of the acts of Jehu, all he did and all his strength, are they not written in the Book of the Chronicles of the Kings of Israel? "},{"num":35,"verse":"Then Jehu died and they buried him in Samaria. And his son Jehoahaz became king in his place. "},{"num":36,"verse":"Jehu ruled over Israel in Samaria for twenty-eight years."}]