[{"num":10,"verse":"Forsooth seventy sons in Samaria were to Ahab. Therefore Jehu wrote letters, and sent into Samaria to the best men of the city, and to the greater men in birth, and to all the nurses of the sons of Ahab, and said, (Now Ahab had seventy sons in Samaria. And so Jehu wrote letters, and sent them to Samaria, to the best men of the city, and to the men of great age, that is, to the elders, and to all the nurses, or the guardians, of the sons of Ahab, and said,)"},{"num":2,"verse":"Anon as ye have taken these letters, ye that have the sons of your lord, and the chariots, and horses, and strong cities, and armours, (As soon as ye have received these letters, ye who have the sons of your lord, and the chariots, and horses, and fortified cities, and arms, or weapons,)"},{"num":3,"verse":"choose the best, and him that pleaseth to you of the sons of your lord, and set him on the throne of his father, and fight ye for the house of your lord."},{"num":4,"verse":"And they dreaded greatly, and said, Lo! two kings might not stand before him, and how shall we be able to against-stand him? (And they greatly feared, and said, Lo! two kings could not stand against him, so how shall we be able to stand against him?)"},{"num":5,"verse":"Therefore the sovereigns of the house, and the prefect of the city, and the greater men of birth, and the nurses (of the sons) sent to Jehu, and said, We be thy servants; whatever things thou commandest, we shall do, and we shall not make a king to us; do thou whatever thing pleaseth thee. (And so the sovereign, or the ruler, of the household, and the prefect of the city, and the men of great age, that is, the elders, and the nurses, or the guardians, of Ahab’s sons sent to Jehu, and said, We be thy servants; whatever thou commandest, we shall do, and we shall not make a king for us; do thou whatever thing pleaseth thee.)"},{"num":6,"verse":"Forsooth he wrote again to them letters the second time, and said, If ye be mine, and obey to me, take ye (off) the heads of the sons of your lord, and come ye to me in this same hour tomorrow into Jezreel. And the sons of the king, seventy men, were nursed at the best men of the city. (And he wrote letters to them a second time, and said, If ye be mine, and obey me, then bring ye to me the heads of the sons of your lord, and come ye to me in Jezreel at this same hour tomorrow. And the sons of the king, seventy men, were nourished, or were cared for, by the best men of the city.)"},{"num":7,"verse":"And when the letters had come to them, they took the sons of the king, and killed those seventy men, and they putted the heads of them in coffins; and sent those to Jehu into Jezreel (and sent them to Jehu in Jezreel)."},{"num":8,"verse":"And a messenger came to him, and showed to him (and told him), and said, They have brought the heads of the sons of the king. Which answered, Put ye those heads (in)to twain heaps, beside the entering of the gate, till the morrowtide."},{"num":9,"verse":"And when it was clear day, he went out, and stood, and said to all the people, Ye be just men; if I conspired against my lord, and killed him, who killed all these?"},{"num":10,"verse":"Therefore see ye now, that none of the words of the Lord hath fallen down into the earth, which the Lord spake on the house of Ahab; and the Lord hath done that, that he spake in the hand of his servant, Elijah. (And so see ye now, that none of the words of the Lord hath fallen to the ground, words which the Lord spoke about the house of Ahab; yea, the Lord hath done what he spoke by his servant Elijah.)"},{"num":11,"verse":"Therefore Jehu smote all that were left of the house of Ahab in Jezreel, and all the best men of him, and his known men, and his priests, till no relics of him (were) left. (And so Jehu struck down all who were left of the house of Ahab in Jezreel, and all his best men, and his friends, and his priests, until none was left.)"},{"num":12,"verse":"And he rose, and came into Samaria; and when he had come to the chamber of the shepherds in the way, (And he rose up, and went to Samaria; and when he had come to the shepherds’ shelter on the way,)"},{"num":13,"verse":"he found there the brethren of Ahaziah, king of Judah (he found there the kinsmen of Ahaziah, the king of Judah); and he said to them, Who be ye? And they answered, We be the brethren of Ahaziah, and we came down to greet the sons of the king, and the sons of the queen."},{"num":14,"verse":"And Jehu said, Take ye them quick. And when they had taken them quick, they strangled them in the cistern, beside the chamber, two and forty men; and he left not any of them (alive). (And Jehu said, Take ye them alive. And when they had taken them alive, then they strangled them there at the well, beside the shelter, forty-two men; and he left none of them alive.)"},{"num":15,"verse":"And when he had gone from thence, he found Jehonadab, the son of Rechab, (coming) into (the) meeting of him; and he blessed him. And Jehu said to him, Whether thine heart is rightful with mine heart, as mine heart is with thine heart? (Is thy heart right with my heart, as my heart is with thy heart?) And Jehonadab said, It is. And Jehu said, If it is, give me thine hand. Which gave his hand to him; and Jehu raised him up to him(self) into his chariot."},{"num":16,"verse":"And he said to him, Come thou with me, and see my fervent love for the Lord. And he led him, put in his chariot, into Samaria (And they rode together, in his chariot, to Samaria)."},{"num":17,"verse":"And (once they arrived,) he killed all (the) men that were residue, or left, of Ahab in Samaria, till to one, by the word of the Lord, which he spake by Elijah."},{"num":18,"verse":"Therefore Jehu gathered together all the people (And then Jehu gathered together all the people), and said to them, Ahab worshipped Baal a little, but I shall worship him more."},{"num":19,"verse":"Now therefore call ye to me all the prophets of Baal, and all his servants, and all his priests; (let) none be that come not, for (a) great sacrifice is of me to Baal; whoever shall fail (to come), he shall not live. Forsooth Jehu did this by treason, that he should destroy all the worshippers of Baal. (And so now call unto me all the prophets of Baal, and all his servants, and all his priests; let there be no one who shall not come, for I shall make a great sacrifice to Baal; whoever shall fail to come, he shall not live. But Jehu did this to deceive them, so that he could destroy all the worshippers of Baal.)"},{"num":20,"verse":"And he said, Hallow ye a solemn day to Baal. And Jehu called, (And he said, Proclaim ye a sacred day for Baal. And they proclaimed it,)"},{"num":21,"verse":"and sent into all the terms of Israel; and all the servants of Baal came, none was left, and soothly not one was that came not. And they entered into the temple of Baal; and the house of Baal was [full-]filled, from one end till to the tother. (and Jehu sent into all the land of Israel; and all the servants of Baal came, and truly there was not one who did not come. And they entered into the temple of Baal; and the house of Baal was filled full, from one end unto the other.)"},{"num":22,"verse":"And Jehu said to them that were sovereigns over the priests’ clothes, Bring ye forth [the] vestments to all the servants of Baal; and they brought forth [the] vestments to them. (And Jehu said to them who looked after the priests’ clothing, Bring ye forth the vestments for all of Baal’s servants; and they brought forth the vestments for them.)"},{"num":23,"verse":"And Jehu entered, and Jehonadab, the son of Rechab, into the temple of Baal. And Jehu said to the worshippers of Baal, Inquire ye, and see, lest peradventure any of the servants of the Lord be with you; but that the servants be alone of Baal. (And Jehu, and Jehonadab, the son of Rechab, entered into the temple of Baal. And Jehu said to the worshippers of Baal, Inquire ye, and see, lest perhaps any of the servants of the Lord be with you; make certain that only Baal’s servants be here.)"},{"num":24,"verse":"Then they entered, to make slain sacrifices, and burnt sacrifices. Soothly Jehu had made ready to him withoutforth fourscore men, and had said to them, Whoever shall flee away of all these, which I shall bring into your hands, the life of him that suffereth any (to) escape shall be for the life of him that escapeth. (Then they entered, to offer slain sacrifices, and burnt sacrifices. Now Jehu had prepared eighty men outside, and had said to them, Of all these whom I shall bring into your hands, whoever shall let anyone of them flee away, his life shall be for the life of him who escapeth.)"},{"num":25,"verse":"Forsooth it was done, when the burnt sacrifice was [ful]filled, Jehu commanded to his knights and [his] dukes, (and said,) Enter ye, and slay them, that none escape. And the knights and dukes smote [them] with the sharpness of [the] sword, and cast forth. And they went into the city of the temple of Baal, (And it was done, when the burnt sacrifice was finished, Jehu commanded to his horsemen and his leaders, and said, Go ye in, and kill them all, so that none escape. And the horsemen and the leaders struck them down with the sharpness of their swords, and cast them forth. And then they went into the inner chamber of the temple of Baal,)"},{"num":26,"verse":"and they brought forth the image from the temple of Baal, and burnt it, (and they brought forth the sacred pillar from the temple of Baal, and burned it,/and they brought forth the images, or the idols, from the temple of Baal, and burned them,)"},{"num":27,"verse":"and all-brake it. Also they destroyed the house of Baal, and made privies for it unto this day. (and broke it all up/and broke them all up. And they utterly destroyed the house of Baal, and made it into latrines, as it still is unto this day.)"},{"num":28,"verse":"Therefore Jehu did away Baal from Israel; (And so Jehu did away Baal from Israel;)"},{"num":29,"verse":"nevertheless he went not away from the sins of Jeroboam, the son of Nebat, that made Israel to do sin, neither he forsook the golden calves, that were in Bethel and in Dan."},{"num":30,"verse":"Forsooth the Lord said to Jehu, For thou didest busily that that was rightful (For thou didest what was right), and that pleased in mine eyes, and hast done against the house of Ahab all things that were in mine heart, thy sons till to the fourth generation shall sit on the throne of Israel."},{"num":31,"verse":"Forsooth Jehu kept not, that he went in the law of the Lord God of Israel in all his heart; for he went not away from the sins of Jeroboam, that made Israel to do sin. (But Jehu did not follow the Law of the Lord God of Israel with all his heart; for he went not away from the sins of Jeroboam, who made Israel to do sin.)"},{"num":32,"verse":"In those days the Lord began to be annoyed upon Israel (In those days the Lord began to do harm to Israel); and Hazael smote them in all the coasts of Israel,"},{"num":33,"verse":"from Jordan against the east coast, all the land of Gilead, and of Gad, and of Reuben, and of Manasseh, from Aroer, which is on the strand of Arnon (which is by the Arnon Stream), and (even unto) Gilead, and Bashan."},{"num":34,"verse":"Forsooth the residue of [the] words of Jehu, and all things that he did, and his strength, whether these be not written in the book of [the] words of [the] days of the kings of Israel?"},{"num":35,"verse":"And Jehu slept with his fathers; and they buried him in Samaria; and Jehoahaz, his son, reigned for him."},{"num":36,"verse":"Forsooth the days, in which Jehu reigned upon Israel in Samaria, be eight and twenty years."}]