[[],[{"type":"header","content":"Jesus Feeds Four Thousand"},{"type":"prose","content":"About this time another large crowd had gathered, and the people ran out of food again. Jesus called his disciples and told them,"}],[],[],[{"type":"prose","content":"His disciples replied, “How are we supposed to find enough food to feed them out here in the wilderness?”"}],[{"type":"prose","content":"Jesus asked, “Seven loaves,” they replied."}],[{"type":"prose","content":"So Jesus told all the people to sit down on the ground. Then he took the seven loaves, thanked God for them, and broke them into pieces. He gave them to his disciples, who distributed the bread to the crowd."}],[{"type":"prose","content":"A few small fish were found, too, so Jesus also blessed these and told the disciples to distribute them."}],[{"type":"prose","content":"They ate as much as they wanted. Afterward, the disciples picked up seven large baskets of leftover food."}],[{"type":"prose","content":"There were about 4,000 men in the crowd that day, and Jesus sent them home after they had eaten."}],[{"type":"prose","content":"Immediately after this, he got into a boat with his disciples and crossed over to the region of Dalmanutha."},{"type":"header","content":"Pharisees Demand a Miraculous Sign"}],[{"type":"prose","content":"When the Pharisees heard that Jesus had arrived, they came and started to argue with him. Testing him, they demanded that he show them a miraculous sign from heaven to prove his authority."}],[{"type":"prose","content":"When he heard this, he sighed deeply in his spirit and said, "}],[{"type":"prose","content":"So he got back into the boat and left them, and he crossed to the other side of the lake."},{"type":"header","content":"Yeast of the Pharisees and Herod"}],[{"type":"prose","content":"But the disciples had forgotten to bring any food. They had only one loaf of bread with them in the boat."}],[{"type":"prose","content":"As they were crossing the lake, Jesus warned them, "}],[{"type":"prose","content":"At this they began to argue with each other because they hadn’t brought any bread."}],[{"type":"prose","content":"Jesus knew what they were saying, so he said, "}],[],[{"type":"prose","content":"“Twelve,” they said."}],[{"type":"prose","content":"“Seven,” they said."}],[{"type":"prose","content":" he asked them."},{"type":"header","content":"Jesus Heals a Blind Man"}],[{"type":"prose","content":"When they arrived at Bethsaida, some people brought a blind man to Jesus, and they begged him to touch the man and heal him."}],[{"type":"prose","content":"Jesus took the blind man by the hand and led him out of the village. Then, spitting on the man’s eyes, he laid his hands on him and asked, "}],[{"type":"prose","content":"The man looked around. “Yes,” he said, “I see people, but I can’t see them very clearly. They look like trees walking around.”"}],[{"type":"prose","content":"Then Jesus placed his hands on the man’s eyes again, and his eyes were opened. His sight was completely restored, and he could see everything clearly."}],[{"type":"prose","content":"Jesus sent him away, saying, "},{"type":"header","content":"Peter’s Declaration about Jesus"}],[{"type":"prose","content":"Jesus and his disciples left Galilee and went up to the villages near Caesarea Philippi. As they were walking along, he asked them, "}],[{"type":"prose","content":"“Well,” they replied, “some say John the Baptist, some say Elijah, and others say you are one of the other prophets.”"}],[{"type":"prose","content":"Then he asked them, Peter replied, “You are the Messiah.”"}],[{"type":"prose","content":"But Jesus warned them not to tell anyone about him."},{"type":"header","content":"Jesus Predicts His Death"}],[{"type":"prose","content":"Then Jesus began to tell them that the Son of Man must suffer many terrible things and be rejected by the elders, the leading priests, and the teachers of religious law. He would be killed, but three days later he would rise from the dead."}],[{"type":"prose","content":"As he talked about this openly with his disciples, Peter took him aside and began to reprimand him for saying such things."}],[{"type":"prose","content":"Jesus turned around and looked at his disciples, then reprimanded Peter.  he said. "}],[{"type":"prose","content":"Then, calling the crowd to join his disciples, he said, "}],[],[],[],[]]