[[],[{"type":"header","content":"Laws on Immoral Relations"},{"type":"prose","content":"Then the  spoke to Moses, saying, "}],[{"type":"prose","content":"“Speak to the children of Israel and say to them, ‘I am the  your God. "}],[{"type":"prose","content":"You shall not do what is done in the land of Egypt where you lived, and you shall not do what is done in the land of Canaan where I am bringing you. You shall not follow their statutes (practices, customs). "}],[{"type":"prose","content":"You are to follow My judgments (precepts, ordinances) and keep My statutes and live by them. I am the  your God. "}],[{"type":"prose","content":"So you shall keep My statutes and My judgments, by which, if a person keeps them, he shall live; I am the ."}],[{"type":"prose","content":"‘No one shall approach any blood relative of his to uncover nakedness (have intimate relations). I am the . "}],[{"type":"prose","content":"You shall not uncover the nakedness of your father, that is, the nakedness of your mother. She is your mother. You shall not uncover her nakedness. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your father’s wife; it is your father’s nakedness. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your sister,  the daughter of your father or of your mother, whether born at home or born elsewhere. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your son’s daughter or your daughter’s daughter; their nakedness you shall not uncover, for they are your own nakedness [that is, your own descendants]. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your father’s wife’s daughter; born to your father, she is your sister. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your father’s sister; she is your father’s blood relative. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your mother’s sister, for she is your mother’s blood relative. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your father’s brother’s wife; you shall not approach his wife; she is your aunt. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your daughter-in-law; she is your son’s wife. You shall not uncover her nakedness. "}],[{"type":"prose","content":"You shall not uncover the nakedness of your brother’s wife; it is your brother’s nakedness. "}],[{"type":"prose","content":"You shall not uncover the nakedness of a woman and her daughter, nor shall you take her son’s daughter or her daughter’s daughter to uncover their nakedness (have intimate relations with them); they are [her] blood relatives; it is an outrageous offense. "}],[{"type":"prose","content":"You shall not marry a woman in addition to her sister as a rival while she is alive, to uncover her nakedness."}],[{"type":"prose","content":"‘Also you shall not approach a woman to uncover her nakedness during her menstrual impurity  ceremonial uncleanness. "}],[{"type":"prose","content":"You shall not have intimate relations with your neighbor’s wife, to be defiled with her. "}],[{"type":"prose","content":"You shall not give any of your children to offer them [by fire as a sacrifice] to Molech [the god of the Ammonites], nor shall you profane the name of your God [by honoring idols as gods]. I am the . "}],[{"type":"prose","content":"You shall not lie [intimately] with a male as one lies with a female; it is repulsive. "}],[{"type":"prose","content":"You shall not have intimate relations with any animal to be defiled with it; nor shall a woman stand before an animal to mate with it; it is a perversion."}],[{"type":"prose","content":"‘Do not defile yourselves by any of these things; for by all these the nations which I am casting out before you have become defiled. "}],[{"type":"prose","content":"For the land has become defiled; therefore I have brought its punishment upon it, and the land vomits out its inhabitants. "}],[{"type":"prose","content":"But as for you, you are to keep My statutes and My judgments (precepts) and shall not commit any of these repulsive acts, neither the native-born, nor the stranger who lives temporarily among you "}],[{"type":"prose","content":"for all these repulsive acts have been done by the men who lived in the land before you, and the land has become defiled; "}],[{"type":"prose","content":"[do none of these things] so that the land will not vomit you out, should you defile it, as it has vomited out the nation which has been before you. "}],[{"type":"prose","content":"For whoever commits any of these repulsive acts, those persons who do so shall be cut off from among their people [excluding them from the atonement made for them]. "}],[{"type":"prose","content":"So keep My command: do not practice any of the repulsive customs which have been practiced before you, so as not to defile yourselves by them; I am the  your God.’”"}]]