[{"header":"Sexual Relations with Relatives Prohibited"},{"num":18,"verse":"The Lord told Moses, "},{"num":2,"verse":"“Tell the Israelis that I am the Lord your God. "},{"num":3,"verse":"You are not to do what you used to do in the land of Egypt where you lived. You are not to do what Canaan does, where I’m about to bring you, so that you live according to their statutes. "},{"num":4,"verse":"Obey my ordinances and keep my statutes by living by them. I am the Lord your God. "},{"num":5,"verse":"Keep my statutes and my ordinances, which a person is to obey in order to live in them. I am the Lord."},{"num":6,"verse":"“A person is not to approach a near blood relative for sexual relations. I am the Lord."},{"num":7,"verse":"“Neither your father’s nakedness nor your mother’s nakedness is to be exposed. She’s your mother, so you are not to have sexual relations with her."},{"num":8,"verse":"“You are not to have sexual relations with your father’s wife. It’s your own father’s nakedness."},{"num":9,"verse":"“You are not to have sexual relations with your sister, whether she’s your father’s daughter or your mother’s daughter, whether she’s born in your home or outside your home. You are not to have sexual relations with her."},{"num":10,"verse":"“You are not to have sexual relations with your son’s daughter or your daughter’s daughter. You are not to have sexual relations with them, because their nakedness is your own nakedness."},{"num":11,"verse":"“You are not to have sexual relations with the daughter of your father’s wife. Born of your father, she’s your sister, so you are not to have sexual relations with her."},{"num":12,"verse":"“You are not to have sexual relations with your father’s sister. She’s your father’s near blood relative."},{"num":13,"verse":"“You are not to have sexual relations with your mother’s sister. She’s your mother’s near blood relative."},{"num":14,"verse":"“You are not to expose the nakedness of your father’s brother by having sexual relations with his wife. She’s your aunt."},{"num":15,"verse":"“You are not to expose the nakedness of your daughter-in-law. She’s the wife of your son. You are not to have sexual relations with her."},{"num":16,"verse":"“You are not to have sexual relations with your brother’s wife. She’s the nakedness of your brother."},{"num":17,"verse":"“You are not to have sexual relations with a woman and her daughter."},{"num":18,"verse":"“You are not to marry a woman and then have sexual relations with her sister as a rival when your wife is still alive."},{"num":19,"verse":"“You are not to approach a menstruating woman to have sexual relations with her."},{"num":20,"verse":"“You are not to have sexual relations with your neighbor’s wife and thereby become ceremonially unclean with her.”"},{"header":"Child Sacrifice Prohibited"},{"num":21,"verse":"“You are not to present any of your children to Molech as a sacrifice. That way, you won’t defile the name of your God.”"},{"header":"Same Sex Unions Prohibited"},{"num":22,"verse":"You are not to have sexual relations with a male as you would with a woman. It’s detestable.”"},{"header":"Sexual Relations with Animals Prohibited"},{"num":23,"verse":"“You are not to present yourself to an animal in order to have sexual relations with it and by doing so to defile yourself. A woman is not to present herself to an animal to have sexual relations with it. It’s detestable."},{"num":24,"verse":"“You are not to defile yourselves by doing any of these things, since all of these nations that I’m casting out before you have defiled themselves this way. "},{"num":25,"verse":"The land has been defiled, so I brought the punishment of its iniquity to it. As a result, the land is vomiting out its inhabitants."},{"num":26,"verse":"“Therefore, keep my statutes and ordinances. You are not to do any of these detestable things—this applies to the native born and the resident alien who lives among you— "},{"num":27,"verse":"because the inhabitants of the land did all of these detestable things and by doing so defiled the land before you. "},{"num":28,"verse":"So you are not to let the land vomit you up because of your uncleanness as it is vomiting the nations that were here before you. "},{"num":29,"verse":"Anyone who does any of these detestable things—whoever the person may be—is to be eliminated from contact with his people. "},{"num":30,"verse":"Therefore, keep my injunctions so that you won’t practice these detestable things that have been done before you, and so that you won’t be defiled in them. I am the Lord.”"}]