[{"header":"List of the Returned Exiles"},{"num":2,"verse":"Now these were the people of the province who came from those captive exiles whom King Nebuchadnezzar of Babylon had carried captive to Babylonia; they returned to Jerusalem and Judah, all to their own towns. "},{"num":2,"verse":"They came with Zerubbabel, Jeshua, Nehemiah, Seraiah, Reelaiah, Mordecai, Bilshan, Mispar, Bigvai, Rehum, and Baanah."},{"num":3,"verse":"the descendants of Parosh, two thousand one hundred and seventy-two. "},{"num":4,"verse":"Of Shephatiah, three hundred and seventy-two. "},{"num":5,"verse":"Of Arah, seven hundred and seventy-five. "},{"num":6,"verse":"Of Pahath-moab, namely the descendants of Jeshua and Joab, two thousand eight hundred and twelve. "},{"num":7,"verse":"Of Elam, one thousand two hundred and fifty-four. "},{"num":8,"verse":"Of Zattu, nine hundred and forty-five. "},{"num":9,"verse":"Of Zaccai, seven hundred and sixty. "},{"num":10,"verse":"Of Bani, six hundred and forty-two. "},{"num":11,"verse":"Of Bebai, six hundred and twenty-three. "},{"num":12,"verse":"Of Azgad, one thousand two hundred and twenty-two. "},{"num":13,"verse":"Of Adonikam, six hundred and sixty-six. "},{"num":14,"verse":"Of Bigvai, two thousand and fifty-six. "},{"num":15,"verse":"Of Adin, four hundred and fifty-four. "},{"num":16,"verse":"Of Ater, namely of Hezekiah, ninety-eight. "},{"num":17,"verse":"Of Bezai, three hundred and twenty-three. "},{"num":18,"verse":"Of Jorah, one hundred and twelve. "},{"num":19,"verse":"Of Hashum, two hundred and twenty-three. "},{"num":20,"verse":"Of Gibbar, ninety-five. "},{"num":21,"verse":"Of Bethlehem, one hundred and twenty-three. "},{"num":22,"verse":"The people of Netophah, fifty-six. "},{"num":23,"verse":"Of Anathoth, one hundred and twenty-eight. "},{"num":24,"verse":"The descendants of Azmaveth, forty-two. "},{"num":25,"verse":"Of Kiriatharim, Chephirah, and Beeroth, seven hundred and forty-three. "},{"num":26,"verse":"Of Ramah and Geba, six hundred and twenty-one. "},{"num":27,"verse":"The people of Michmas, one hundred and twenty-two. "},{"num":28,"verse":"Of Bethel and Ai, two hundred and twenty-three. "},{"num":29,"verse":"The descendants of Nebo, fifty-two. "},{"num":30,"verse":"Of Magbish, one hundred and fifty-six. "},{"num":31,"verse":"Of the other Elam, one thousand two hundred and fifty-four. "},{"num":32,"verse":"Of Harim, three hundred and twenty. "},{"num":33,"verse":"Of Lod, Hadid, and Ono, seven hundred and twenty-five. "},{"num":34,"verse":"Of Jericho, three hundred and forty-five. "},{"num":35,"verse":"Of Senaah, three thousand six hundred and thirty."},{"num":36,"verse":"The priests: the descendants of Jedaiah, of the house of Jeshua, nine hundred and seventy-three. "},{"num":37,"verse":"Of Immer, one thousand and fifty-two. "},{"num":38,"verse":"Of Pashhur, one thousand two hundred and forty-seven. "},{"num":39,"verse":"Of Harim, one thousand and seventeen."},{"num":40,"verse":"The Levites: the descendants of Jeshua and Kadmiel, of the descendants of Hodaviah, seventy-four. "},{"num":41,"verse":"The singers: the descendants of Asaph, one hundred and twenty-eight. "},{"num":42,"verse":"The descendants of the gatekeepers: of Shallum, of Ater, of Talmon, of Akkub, of Hatita, and of Shobai, in all one hundred and thirty-nine."},{"num":43,"verse":"The temple servants: the descendants of Ziha, Hasupha, Tabbaoth, "},{"num":44,"verse":"Keros, Siaha, Padon, "},{"num":45,"verse":"Lebanah, Hagabah, Akkub, "},{"num":46,"verse":"Hagab, Shamlai, Hanan, "},{"num":47,"verse":"Giddel, Gahar, Reaiah, "},{"num":48,"verse":"Rezin, Nekoda, Gazzam, "},{"num":49,"verse":"Uzza, Paseah, Besai, "},{"num":50,"verse":"Asnah, Meunim, Nephisim, "},{"num":51,"verse":"Bakbuk, Hakupha, Harhur, "},{"num":52,"verse":"Bazluth, Mehida, Harsha, "},{"num":53,"verse":"Barkos, Sisera, Temah, "},{"num":54,"verse":"Neziah, and Hatipha."},{"num":55,"verse":"The descendants of Solomon’s servants: Sotai, Hassophereth, Peruda, "},{"num":56,"verse":"Jaalah, Darkon, Giddel, "},{"num":57,"verse":"Shephatiah, Hattil, Pochereth-hazzebaim, and Ami."},{"num":58,"verse":"All the temple servants and the descendants of Solomon’s servants were three hundred and ninety-two."},{"num":59,"verse":"The following were those who came up from Tel-melah, Tel-harsha, Cherub, Addan, and Immer, though they could not prove their families or their descent, whether they belonged to Israel: "},{"num":60,"verse":"the descendants of Delaiah, Tobiah, and Nekoda, six hundred and fifty-two. "},{"num":61,"verse":"Also, of the descendants of the priests: the descendants of Habaiah, Hakkoz, and Barzillai (who had married one of the daughters of Barzillai the Gileadite, and was called by their name). "},{"num":62,"verse":"These looked for their entries in the genealogical records, but they were not found there, and so they were excluded from the priesthood as unclean; "},{"num":63,"verse":"the governor told them that they were not to partake of the most holy food, until there should be a priest to consult Urim and Thummim."},{"num":64,"verse":"The whole assembly together was forty-two thousand three hundred and sixty, "},{"num":65,"verse":"besides their male and female servants, of whom there were seven thousand three hundred and thirty-seven; and they had two hundred male and female singers. "},{"num":66,"verse":"They had seven hundred and thirty-six horses, two hundred and forty-five mules, "},{"num":67,"verse":"four hundred and thirty-five camels, and six thousand seven hundred and twenty donkeys."},{"num":68,"verse":"As soon as they came to the house of the Lord in Jerusalem, some of the heads of families made freewill-offerings for the house of God, to erect it on its site. "},{"num":69,"verse":"According to their resources they gave to the building fund sixty-one thousand darics of gold, five thousand minas of silver, and one hundred priestly robes."},{"num":70,"verse":"The priests, the Levites, and some of the people lived in Jerusalem and its vicinity; and the singers, the gatekeepers, and the temple servants lived in their towns, and all Israel in their towns."}]