[{"num":2,"verse":"Here is the list of the Jewish exiles who now returned to Jerusalem and to the other cities of Judah, from which their parents had been deported to Babylon by King Nebuchadnezzar."},{"num":2,"verse":"The leaders were: Zerubbabel, Jeshua, Nehemiah, Seraiah, Reelaiah, Mordecai, Bilshan, Mispar, Bigvai, Rehum, Baanah."},{"num":36,"verse":"Here are the statistics concerning the returning priests:"},{"num":40,"verse":"Here are the statistics concerning the Levites who returned:"},{"num":43,"verse":"The following families of the Temple assistants were represented:"},{"num":55,"verse":"Those who made the trip also included the descendants of King Solomon’s officials:"},{"num":58,"verse":"The Temple assistants and the descendants of Solomon’s officers numbered 392."},{"num":59,"verse":"Another group returned to Jerusalem at this time from the Persian cities of Tel-melah, Tel-harsha, Cherub, Addan, and Immer. However, they had lost their genealogies and could not prove that they were really Israelites. "},{"num":60,"verse":"This group included the subclans of Delaiah, Tobiah, and Nekoda—a total of 652."},{"num":61,"verse":"Three subclans of priests—Habaiah, Hakkoz, and Barzillai (he married one of the daughters of Barzillai the Gileadite and took her family name)—also returned to Jerusalem. "},{"num":62,"verse":"But they too had lost their genealogies, so the leaders refused to allow them to continue as priests; they would not even allow them to eat the priests’ share of food from the sacrifices until the Urim and Thummim could be consulted to find out from God whether they actually were descendants of priests or not."},{"num":64,"verse":"So a total of 42,360 persons returned to Judah; in addition to 7,337 slaves and 200 choir members, both men and women. "},{"num":66,"verse":"They took with them 736 horses, 245 mules, 435 camels, and 6,720 donkeys."},{"num":68,"verse":"Some of the leaders were able to give generously toward the rebuilding of the Temple, "},{"num":69,"verse":"and each gave as much as he could. The total value of their gifts amounted to $300,000 of gold, $170,000 of silver, and 100 robes for the priests."},{"num":70,"verse":"So the priests and Levites and some of the common people settled in Jerusalem and its nearby villages; and the singers, the gatekeepers, the Temple workers, and the rest of the people returned to the other cities of Judah from which they had come."}]