[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Zechariah 8:6-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 8:6-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If it be marvellous — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If these things promised appear difficult, and in a manner impossible; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the eyes of the remnant of this people — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the judgment and opinion, or rather to the unbelief, of this people, who are few in number, exceedingly poor, and perpetually surrounded with dangers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in these days — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which are days of small things; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should it also be marvellous in mine eyes — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Impossible, or so much as difficult to me, who am the Almighty God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thus saith the Lord of hosts — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Here God engages his almighty power to make good his promise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, I will save my people — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, bring them safe; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the east country — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From Persia and Media, which lay east from Jerusalem, and were now masters of Babylon; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and from the west country — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From the countries of Europe, in which many of the Jews were, or would afterward be dispersed. The original words may be literally rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From the rising to the going down of the sun, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "including all parts of the world. This implies the general restoration of the Jewish nation from all their dispersions: an event foretold by most of the prophets of the Old Testament: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The west country ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here mentioned, has a particular relation to their present dispersion, great numbers of them being, in these latter ages, settled in the western parts of the world. “The Jews, upon the completion of the Babylonish captivity, returned from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "north, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "east, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but not from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "west: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "nor can any other time here be pointed out, than the last return of the Jews; when they shall flow from all parts of the world to the New Jerusalem, and there constitute a new republic, the fame of whose sanctity shall allure and draw to it many nations, as is foretold at the end of this chapter. We cannot understand this either of the Jews or of the Gentiles, who embraced the faith upon the preaching of the apostles. Not of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "because the Lord did not save at that time the Jewish nation, which he was about to disperse in a very short period; — not of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gentiles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "because the Gentiles were not the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "people of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my people,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") before he had called them from the east and from the west.” — Dodd.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-8 The sins of Zion were her worst enemies. God will take away her sins, and then no other enemies shall hurt her. Those who profess religion must adorn their profession by godliness and honesty. When become a city of truth and a mountain of holiness, Jerusalem is peaceable and prosperous. Verses 4,5, beautifully describe a state of great outward peace, attended with plenty, temperance, and contentment. The scattered Israelites shall be brought together from all parts. God will never leave nor forsake them in a way of mercy, for this he has promised them; and they shall never leave nor forsake him in a way of duty, as they have promised him. These promises were partly fulfilled in the Jewish church, betwixt the captivity and the time of Christ's coming; and they had fuller accomplishment in the gospel church; but the full import must be as to the future times of the Christian church, or the future restoration of the Jews. With men this is impossible, but with God all things are possible; so far are God's thoughts and ways above ours. In the present low state of vital godliness, we can hardly conceive that so complete a change can be made; but a change thus extensive and glorious, can be brought to pass by the almighty power of the new-creating Spirit, in less time than he was pleased to employ in creating the world. Let the hands of all who labour in the cause of the gospel be strong, serving the Lord in true holiness, assured that their labour shall not be in vain.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If it should be marvelous in the eyes of the remnant of this people in those - (not these) days, shall it be marvelous in Mine eyes also? saith the Lord of hosts Man's anticipations, by reason of his imperfections and the chequered character of earthly things, are always disappointing. God's doings, by reason of His infinite greatness and goodness, are always beyond our anticipations, past all belief. It is their very greatness which staggers us. It is not then merely that the temporal promises seemed \"too good to be true\" (in our words) (Jerome), \"in the eyes of the people who had come from the captivity, seeing that the city almost desolate, the ruins of the city-walls, the charred houses showed the doings of the Babylonians.\" It is in the day of the fulfillment, not of the anticipation, that they would seem marvelous in their eyes, as the Psalmist says, \"This is the Lord's doing: and it is marvelous in our eyes\" .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The temporal blessings which God would give were not so incredible. They were but the ordinary gifts of His Providence: they involved no change in their outward relations. His people were still to remain under their Persian masters, until their time too should come. It was matter of gladness and of God's Providence, that the walls of Jerusalem should be rebuilt: but not so marvelous, when it came to pass. The mysteries of the Gospel are a marvel even to the blessed angels. That fulfillment being yet future, so the people, in whose eyes that fulfillment should be marvelous, were future also. And this was to be a remnant still. It does not say, \"this people which is a remnant,\" nor \"this remnant of the people,\" that is, those who remained over out of the people who went into captivity, or this remnant, but \"the remnant of this people,\" that is, those who should remain over of it, that is, of the people who were returned. It is the remnant of the larger whole, this people (see at Amos 1:8, vol. i. p. 247, n. 28, and on Haggai 1:12, p. 305). It is still \"the remnant according to the election of grace;\" that election which obtained what all Israel sought, but, seeking wrongly, were blinded Romans 11:5-7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The temporal blessings which God would give were not so incredible. They were but the ordinary gifts of His Providence: they involved no change in their outward relations. His people were still to remain under their Persian masters, until their time too should come. It was matter of gladness and of God's Providence, that the walls of Jerusalem should be rebuilt: but not so marvelous, when it came to pass. The mysteries of the Gospel are a marvel even to the blessed angels. That fulfillment being yet future, so the people, in whose eyes that fulfillment should be marvelous, were future also. And this was to be a remnant still. It does not say, \"this people which is a remnant,\" nor \"this remnant of the people,\" that is, those who remained over out of the people who went into captivity, or this remnant, but \"the remnant of this people,\" that is, those who should remain over of it, that is, of the people who were returned. It is the remnant of the larger whole, this people (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", vol. i. p. 247, n. 28, and on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Haggai 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", p. 305). It is still \"the remnant according to the election of grace;\" that election which obtained what all Israel sought, but, seeking wrongly, were blinded ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:5-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall it be marvelous in Mine eyes also? - It is an indirect question in the way of exclamation . \"It be marvelous in Mine eyes also,\" rejecting the thought, as alien from the nature of God, to whom \"all things are possible, yea, what with men is impossible\" Matthew 19:26. As God says to Jeremiah, \"Behold, I am, the Lord, the God of all flesh. Is there anything too hard for Me?\" Jeremiah 32:27. \"For with God nothing shall be impossible\" Luke 1:37. \"The things which are impossible with men are possible with God\" Luke 18:27. \"For with God all things are possible.\" Mark 10:27 Cyril: \"For He is the Lord of all powers, fulfilling by His will what exceedingly surpasseth nature, and efecting at once what seemeth Him good. The mystery of the Incarnation passeth all marvel and discourse, and no less the benefits redounding to us. For how is it not next to incredible, that the Word, Begotten of God, should be united with the flesh and be in the form of a servant, and endure the Cross and the insults and outrages of the Jews? Or how should one not admire above measure the issue of the dispensation, whereby sin was destroyed, death abolished, corruption expelled, and man, once a recreant slave, became resplendent with the grace of an adopted son?\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall it be marvelous in Mine eyes also? - It is an indirect question in the way of exclamation . \"It be marvelous in Mine eyes also,\" rejecting the thought, as alien from the nature of God, to whom \"all things are possible, yea, what with men is impossible\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 19:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". As God says to Jeremiah, \"Behold, I am, the Lord, the God of all flesh. Is there anything too hard for Me?\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"For with God nothing shall be impossible\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"The things which are impossible with men are possible with God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 18:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"For with God all things are possible.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 10:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Cyril: \"For He is the Lord of all powers, fulfilling by His will what exceedingly surpasseth nature, and efecting at once what seemeth Him good. The mystery of the Incarnation passeth all marvel and discourse, and no less the benefits redounding to us. For how is it not next to incredible, that the Word, Begotten of God, should be united with the flesh and be in the form of a servant, and endure the Cross and the insults and outrages of the Jews? Or how should one not admire above measure the issue of the dispensation, whereby sin was destroyed, death abolished, corruption expelled, and man, once a recreant slave, became resplendent with the grace of an adopted son?\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. However impossible these things just promised by Me seem to you, they are not so with God. The \"remnant\" that had returned from the captivity, beholding the city desolate and the walls and houses in ruins, could hardly believe what God promised. The expression \"remnant\" glances at their ingratitude in rating so low God's power, though they had experienced it so \"marvellously\" displayed in their restoration. A great source of unbelief is, men \"limit\" God's power by their own (Ps 78:19, 20, 41).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "these days—\"of small things\" (Zec 4:10), when such great things promised seemed incredible. Maurer, after Jerome, translates, \"in those days\"; that is, if the thing which I promised to do in those days, seems \"marvellous,\" &c.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If it be marvellous:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these things promised may perhaps seem very strange and difficult, if not impossible. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the eyes; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the judgment and opinion, or rather, to the unbelief of this people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The remnant of this people:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " few in number, exceedingly poor, and perpetually surrounded with dangers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In these days; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which are days of small things. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Should it also be marvellous, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " impossible, or so much as difficult, to me? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Saith the Lord of hosts:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Almighty God will do this. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus saith the Lord of hosts,.... This is repeated for the same end as before; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If it be marvellous in the eyes of the remnant of this people in these days; either in the then present days and time; and the sense is, if it should seem wonderful, incredible, and scarcely possible to the small number of the Jews in Judea, that all the great and good things before promised should be fulfilled; or in the times of the Gospel, when the remnant, according to the election of grace, would wonder at the marvellous loving kindness of the Lord, in doing each great things for his church and people: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "should it also be marvellous in mine eyes? saith the Lord of hosts; no, not as if it was impossible to be done; it shall be done, as marvellous as it may seem to be. Aben Ezra understands these words, not as spoken by way of interrogation and admiration, but as an affirmation; that God would do that which was marvellous, and such as he had never done the like, even as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "should it also be marvellous in mine eyes? saith the Lord of hosts; no, not as if it was impossible to be done; it shall be done, as marvellous as it may seem to be. Aben Ezra understands these words, not as spoken by way of interrogation and admiration, but as an affirmation; that God would do that which was marvellous, and such as he had never done the like, even as follows: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thus saith the LORD of hosts; If it is {d} marvellous in the eyes of the remnant of this people in these days, should it also be marvellous in my eyes? saith the LORD of hosts.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus saith the LORD of hosts; If it is ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " marvellous in the eyes of the remnant of this people in these days, should it also be marvellous in my eyes? saith the LORD of hosts.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) He shows in what our faith consists, that is, to believe that God can perform that which he has promised, though it seem ever so impossible to man; Ge 13:14, Rom 4:20.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in these days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in those days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (as in R. V.), viz. in which it comes to pass. “It is in the day of the fulfilment, not of the anticipation, that they would seem marvellous in their eyes, as the Psalmist says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This is the Lord’s doing, and it is marvellous in our eyes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” Pusey.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should it also be marvellous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Some would render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it shall also be marvellous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. if in the eyes of those who in those days see the fair, prosperous city that has grown out of these blackened ruins, it is marvellous (as it will be), so shall it be also in My eyes. In other words, I Myself count it a marvellous work that I will achieve. It is better, however, to take this clause as a question, as in A. V. and R. V., and to understand it to mean, “the things that are impossible with men are possible with God.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In these days;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in those days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If what is promised in vers. 3-5 seems incredible to those who shall see the fulfilment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The remnant.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The returned Jews and their posterity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 1:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Should it also be marvellous in mine eyes?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Certainly not. Nothing is impossible with God. Zechariah 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Thus saith Jehovah of hosts, If it be marvellous in the eyes of the remnant of this nation in those days, will it also be marvellous in my eyes? is the saying of Jehovah of hosts.\" The second clause of this verse is to be taken as a question with a negative answer, גּם for הגם, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 22:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the meaning is the following: If this (what is promised in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:3-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") should appear marvellous, i.e., incredible, to the people in those days when it shall arrive, it will not on that account appear marvellous to Jehovah Himself, i.e., Jehovah will for all that cause what has been promised actually to occur. This contains an assurance not only of the greatness of the salvation set before them, but also of the certainty of its realization. \"The remnant of the nation,\" as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 1:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]