[{"header":"King Shishak of Egypt Invades Judah"},{"num":12,"verse":"Soon after Rehoboam had control of his kingdom, he and everyone in Judah stopped obeying the Lord. "},{"num":2,"verse":"So in the fifth year of Rehoboam’s rule, the Lord punished them for their unfaithfulness and allowed King Shishak of Egypt to invade Judah. "},{"num":3,"verse":"Shishak attacked with his army of one thousand two hundred chariots and sixty thousand cavalry troops, as well as Egyptian soldiers from Libya, Sukkoth, and Ethiopia. "},{"num":4,"verse":"He captured every one of the fortified cities in Judah and then marched to Jerusalem."},{"num":5,"verse":"Rehoboam and the leaders of Judah had gone to Jerusalem to escape Shishak’s invasion. And while they were there, Shemaiah the prophet told them, “The Lord says that because you have disobeyed him, he has now abandoned you. The Lord will not help you against Shishak!”"},{"num":6,"verse":"Rehoboam and the leaders were sorry for what they had done and admitted, “The Lord is right. We have deserted him.”"},{"num":7,"verse":"When the Lord heard this, he told Shemaiah:"},{"num":9,"verse":"Shishak attacked Jerusalem and took all the valuable things from the temple and from the palace, including Solomon’s gold shields."},{"num":10,"verse":"Rehoboam had bronze shields made to replace the gold ones, and he ordered the guards at the city gates to keep them safe. "},{"num":11,"verse":"Whenever Rehoboam went to the Lord’s temple, the guards carried the shields. But they always took them back to the guardroom as soon as he had finished worshiping."},{"num":12,"verse":"Rehoboam turned back to the Lord, and so the Lord did not let Judah be completely destroyed, and Judah was prosperous again."},{"header":"Rehoboam’s Rule in Judah"},{"num":13,"verse":"Rehoboam was forty-one years old when he became king, and he ruled seventeen years from Jerusalem, the city where the Lord had chosen to be worshiped. His mother Naamah was from Ammon. Rehoboam was a powerful king, "},{"num":14,"verse":"but he still did wrong and refused to obey the Lord."},{"num":15,"verse":"Everything else Rehoboam did while he was king, including a history of his family, is written in the records of the two prophets, Shemaiah and Iddo. During Rehoboam’s rule, he and King Jeroboam of Israel were constantly at war. "},{"num":16,"verse":"When Rehoboam died, he was buried beside his ancestors in Jerusalem, and his son Abijah became king."}]