[{"num":12,"verse":"1 Rehoboam forsaketh the Lord, and is punished by Shishak. 5 Shemaiah reproveth him. 6 He humbleth himself. 7 God sendeth him succor. 9 Shishak taketh his treasures. 13 His reign and death. 16 Abijah his son succeedeth him."},{"num":1,"verse":"And when Rehoboam had established the kingdom and made it strong, he forsook the Law of the Lord, and all Israel with him."},{"num":2,"verse":"Therefore in the fifth year of king Rehoboam, Shishak the king of Egypt came up against Jerusalem (because they had transgressed against the Lord)"},{"num":3,"verse":"With twelve hundred chariots, and threescore thousand horsemen, and the people were without number, that came with him from Egypt, even the Lubim, Sukkiim, and the Ethiopians."},{"num":4,"verse":"And he took the strong cities which were of Judah, and came unto Jerusalem."},{"num":5,"verse":"¶ Then came Shemaiah the Prophet to Rehoboam, and to the princes of Judah that were gathered together in Jerusalem, because of Shishak, and said unto them, Thus saith the Lord, Ye have forsaken me, therefore have I also left you in the hands of Shishak."},{"num":6,"verse":"Then the princes of Israel, and the King humbled themselves, and said, The Lord is just."},{"num":7,"verse":"And when the Lord saw that they humbled themselves, the word of the Lord came to Shemaiah, saying, They have humbled themselves, therefore I will not destroy them, but I will send them deliverance shortly, and my wrath shall not be poured out upon Jerusalem by the hand of Shishak."},{"num":8,"verse":"Nevertheless they shall be his servants: so shall they know my service, and the service of the kingdoms of the earth."},{"num":9,"verse":"¶ Then Shishak king of Egypt came up against Jerusalem, and took the treasures of the house of the Lord, and the treasures of the King’s house: he took even all, and he carried away the shields of gold, which Solomon had made."},{"num":10,"verse":"In stead whereof King Rehoboam made shields of brass, and committed them to the hands of the chief of the guard, that waited at the door of the king’s house."},{"num":11,"verse":"And when the king entered into the house of the Lord, the guard came and bare them and brought them again unto the guard chamber."},{"num":12,"verse":"And because he humbled himself, the wrath of the Lord turned from him, that he would not destroy all together. And also in Judah the things prospered."},{"num":13,"verse":"So King Rehoboam was strong in Jerusalem and reigned: for Rehoboam was one and forty years old, when he began to reign, and reigned seventeen years in Jerusalem, the city which the Lord had chosen out of all the tribes of Israel to put his Name there. And his mother’s name was Naamah an Ammonitess."},{"num":14,"verse":"And he did evil: for he prepared not his heart to seek the Lord."},{"num":15,"verse":"The acts also of Rehoboam, first and last, are they not written in the book of Shemaiah the Prophet, and Iddo the Seer, in rehearsing the genealogy? and there was war always between Rehoboam and Jeroboam."},{"num":16,"verse":"And Rehoboam slept with his fathers, and was buried in the city of David, and Abijah his son reigned in his stead."}]