[{"num":14,"verse":"1 The manners of the Gentiles in marking themselves for the dead, may not be followed. 4 What meats are clean to be eaten, and what not. 29 The tithes for the Levites, stranger, fatherless, and widow."},{"num":1,"verse":"Ye are the children of the Lord your God, Ye shall not cut yourselves, nor make you any baldness between your eyes for the dead."},{"num":2,"verse":"For thou art an holy people unto the Lord thy God, and the Lord hath chosen thee to be a precious people unto himself, above all the people that are upon the earth."},{"num":3,"verse":"¶ Thou shalt eat no manner of abomination."},{"num":4,"verse":"These are the beasts, which ye shall eat, the beef, the sheep, and the goat,"},{"num":5,"verse":"The hart, and the roebuck, and the bugle, and the wild goat, and the unicorn, and the wild ox, and the Chamois."},{"num":6,"verse":"And every beast that parteth the hoof, and cleaveth the cleft into two claws, and is of the beasts that cheweth the cud, that shall ye eat."},{"num":7,"verse":"But these ye shall not eat, of them that chew the cud, and of them that divide and cleave the hoof only: the camel, nor the hare, nor the coney: for they chew the cud, but divide not the hoof, therefore they shall be unclean unto you:"},{"num":8,"verse":"Also the swine, because he divideth the hoof: and cheweth not the cud, shall be unclean unto you: ye shall not eat of their flesh, nor touch their dead carcasses."},{"num":9,"verse":"¶ These ye shall eat, of all that are in the waters: all that have fins and scales shall ye eat."},{"num":10,"verse":"And whatsoever hath no fins nor scales, ye shall not eat: it shall be unclean unto you."},{"num":11,"verse":"¶ Of all clean birds ye shall eat."},{"num":12,"verse":"But these are they whereof ye shall not eat: the eagle nor the goshawk, nor the osprey,"},{"num":13,"verse":"Nor the glede, nor the kite, nor the vulture, after their kind,"},{"num":14,"verse":"Nor all kind of ravens,"},{"num":15,"verse":"Nor the ostrich, nor the night crow, nor the seamew, nor the hawk after her kind,"},{"num":16,"verse":"Neither the little owl, nor the great owl, nor the redshank,"},{"num":17,"verse":"Nor the pelican, nor the swan, nor the cormorant:"},{"num":18,"verse":"The stork also, and the heron in his kind, nor the lapwing, nor the [bat]."},{"num":19,"verse":"And every creeping thing that flieth, shall be unclean unto you: it shall not be eaten."},{"num":20,"verse":"But of all clean fowls ye may eat."},{"num":21,"verse":"Ye shall eat of nothing that dieth alone, but thou shalt give it unto the stranger that is within thy gates, that he may eat it: or thou mayest sell it unto a stranger: for thou art an holy people unto the Lord thy God. Thou shalt not seethe a kid in his mother’s milk."},{"num":22,"verse":"Thou shalt give the tithe of all the increase of thy seed, that cometh forth of the field year by year."},{"num":23,"verse":"And thou shalt eat before the Lord thy God (in the place which he shall choose to cause his Name to dwell there) the tithe of thy corn, of thy wine, and of thine oil, and the firstborn of thy kine, and of thy sheep, that thou mayest learn to fear the Lord thy God always."},{"num":24,"verse":"And if the way be too long for thee, so that thou art not able to carry it, because the place is far from thee, where the Lord thy God shall choose to set his name, when the Lord thy God shall bless thee,"},{"num":25,"verse":"Then shalt thou make it in money, and take the money in thine hand, and go unto the place which the Lord thy God shall choose."},{"num":26,"verse":"And thou shalt bestow the money for whatsoever thine heart desireth: whether it be ox, or sheep, or wine, or strong drink, or whatsoever thine heart desireth: and shalt eat it there before the Lord thy God, and rejoice, both thou, and thine household."},{"num":27,"verse":"And the Levite that is within thy gates, shalt thou not forsake: for he hath neither part nor inheritance with thee."},{"num":28,"verse":"At the end of three years thou shalt bring forth all the tithes of thine increase of the same year, and lay it up within thy gates."},{"num":29,"verse":"Then the Levite shall come, because he hath no part nor inheritance with thee, and the stranger, and the fatherless, and the widow, which are within thy gates, and shall eat, and be filled, that the Lord thy God may bless thee in all the work of thine hand which thou doest."}]