[{"header":"Refrain from Cutting Yourselves"},{"num":14,"verse":"“You are children of the Lord your God. You must not lacerate yourselves or shave your foreheads on account of the dead, "},{"num":2,"verse":"because you are a holy people to the Lord your God, and the Lord chose to make you his precious possession from among all the nations of the earth.”"},{"header":"Refrain from Unclean Food"},{"num":3,"verse":"“You must not eat any detestable food. "},{"num":4,"verse":"These are the animals that you may eat: ox, sheep, goat, "},{"num":5,"verse":"deer, gazelle, roebuck, wild goat, ibex, antelope, and mountain sheep. "},{"num":6,"verse":"You may eat every animal with a divided hoof—those with split cloven hooves—that chews the cud. "},{"num":7,"verse":"However, you must not eat these animals that chew the cud or have a divided hoof: the camel, hare, and rock badger. Even though they chew the cud, their hooves are not divided. Therefore, they are unclean for you. "},{"num":8,"verse":"And also the pig, because even though its hoof is divided, it does not chew the cud. It is therefore unclean for you. You must not eat their meat or even touch their carcasses."},{"num":9,"verse":"“You may choose to eat from these creatures in the water: you may eat anything with fin and scale, "},{"num":10,"verse":"but you may not eat anything without fin and scale, since it is unclean to you."},{"num":11,"verse":"“You may eat all clean birds, "},{"num":12,"verse":"but you must not eat any of these: the eagle, vulture, osprey, "},{"num":13,"verse":"buzzard, any kind of kite, "},{"num":14,"verse":"any kind of raven, "},{"num":15,"verse":"the ostrich, night hawk, seagull, any kind of falcon, "},{"num":16,"verse":"the little owl, great owl, horned owl, "},{"num":17,"verse":"pelican, carrion vulture, cormorant, "},{"num":18,"verse":"stork, any kind of heron, the hoopoe, and the bat. "},{"num":19,"verse":"Any winged, swarming insect is unclean to you—they are not to be eaten. "},{"num":20,"verse":"You may eat every bird that is clean."},{"num":21,"verse":"“You must not eat any carcass, but you may give it to the alien in your cities so he may either consume it or sell it to a foreigner, since you are a people that is holy to the Lord your God."},{"header":"Remember to Tithe"},{"num":22,"verse":"“Be sure to tithe annually from everything you plant that yields a harvest in the field. "},{"num":23,"verse":"Then in the presence of the Lord your God, in the place where he’ll choose to establish his name, you may consume the tithe of your grain, your new wine, your oil, and the firstborn of your livestock and flock, so that you’ll learn to revere the Lord your God all your life. "},{"num":24,"verse":"Now the way may be distant from you, so that you are unable to transport your tithe because you have been blessed by the Lord your God and the place where the Lord your God chooses to establish his name may be distant from you. "},{"num":25,"verse":"In that case, convert it into cash, secure the money, and then bring it to the place where the Lord will choose. "},{"num":26,"verse":"You may spend the money to your heart’s content to buy livestock, flocks, wine, strong drink, and whatever you desire. You and your household may eat there and rejoice in the presence of the Lord your God.”"},{"header":"The Levitical Tithe"},{"num":27,"verse":"“But you must not forget the descendant of Levi in your town, because there is no tribal allotment for him as there is for you. "},{"num":28,"verse":"Every third year, bring all the tithes of your produce of that year and store them in your cities "},{"num":29,"verse":"so the descendants of Levi—who have no tribal allotment as you do—foreigners, orphans, and widows who live in your cities may come, eat, and be satisfied. That way, the Lord your God will bless you in everything you do.”"}]