[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And should sleep, and rise.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—So it was in the world’s history. Men knew not the greatness of the new force that had been brought into action. Philosophers and statesmen ignored it. Even the very preachers of the new faith, the “sowers” of the parable, were hardly conscious of the enormous revolution which they were working. So it is in the individual life. The seemingly chance word, the new truth that flashes on the soul as a revelation, the old words now for the first time apprehended in their true force, these prove to be the seeds of a new growth in the soul.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:21-34 These declarations were intended to call the attention of the disciples to the word of Christ. By his thus instructing them, they were made able to instruct others; as candles are lighted, not to be covered, but to be placed on a candlestick, that they may give light to a room. This parable of the good seed, shows the manner in which the kingdom of God makes progress in the world. Let but the word of Christ have the place it ought to have in a soul, and it will show itself in a good conversation. It grows gradually: first the blade; then the ear; after that the full corn in the ear. When it is sprung up, it will go forward. The work of grace in the soul is, at first, but the day of small things; yet it has mighty products even now, while it is in its growth; but what will there be when it is perfected in heaven!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And should sleep, and rise night and day - Should sleep in the night and rise by day, for so the expression is to be understood. That is, should live in his usual way, without exerting any influence over the growing grain. By this we are not to infer that men are to use no diligence in the obtaining and in the growth of piety; but the illustration shows only that as we cannot tell how grain grows, so we cannot tell the mode in which piety increases in the heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He knoweth not how - This is still true. After all the researches of philosophers, no one has been able to tell the way in which grain grows. They can observe one fact after another; they can see the changes; they can see the necessity of rains and suns, of care and shelter, but beyond this they cannot go. So in religion. We can mark the change; we can see the need of prayer, and self-examination, and searching the Scriptures, and the ordinances of religion, but we cannot tell in what way the religious principle is developed and strengthened. As God unseen, yet by the use of proper means, makes the grass to flourish, so God unseen, but by proper means, nourishes the soul, and the plants of piety spring up, and bloom, and bear fruit. Compare the notes at John 3:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He knoweth not how - This is still true. After all the researches of philosophers, no one has been able to tell the way in which grain grows. They can observe one fact after another; they can see the changes; they can see the necessity of rains and suns, of care and shelter, but beyond this they cannot go. So in religion. We can mark the change; we can see the need of prayer, and self-examination, and searching the Scriptures, and the ordinances of religion, but we cannot tell in what way the religious principle is developed and strengthened. As God unseen, yet by the use of proper means, makes the grass to flourish, so God unseen, but by proper means, nourishes the soul, and the plants of piety spring up, and bloom, and bear fruit. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26, 27. So is the kingdom of God, as if a man should cast seed into the ground; and should sleep, and rise night and day—go about his other ordinary occupations, leaving it to the well-known laws of vegetation under the genial influences of heaven. This is the sense of \"the earth bringing forth fruit of herself,\" in Mr 4:27.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 27. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 4:26\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "6\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And should sleep,.... That is, the man that casts in the seed, who represents the ministers of the Gospel: and, as applied to them, is not to be understood of natural sleep, and indulging themselves in that; much less of spiritual sloth and indolence, as if they cared not what became of the seed sown, whether it sprung up, and came to any thing, or not; for neither of these belong to the characters of the true ministers of the word: for though bodily sleep in them, as in other men, is necessary for the support of nature, and to put them in a capacity of discharging their work; yet perhaps none have less of it than studious and laborious preachers of the Gospel; and much less do they indulge a spiritual sleep and slothfulness; though this may sometimes attend them, as well as others: but then, whilst they sleep, in this sense, tares are sown, and they spring up, and not the good seed of the word, as in this parable; besides, as they labour in the word and doctrine, by studying and preaching it, so they follow their ministrations with incessant prayers that they be succeeded to the conversion of sinners, and comfort of saints; nor can they be easy, unless they have some seals of their ministry: but rather, this may be understood of the sleep of death; for so it often is, that the seed sown by them does not appear in the fruits of it to the churches of Christ, among whom they have ministered, until after they are fallen asleep in Jesus: though it seems best to understand it of their holy security, confidence, and satisfaction in their own minds, that it will turn to profit and advantage, both to the good of souls, and glory of God, not despairing of success; but having left their work with their Lord, they sit down easy and satisfied, believing that the word shall prosper to the thing whereunto it is sent: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and rise night and day; which shows their diligence and laboriousness, and their constant attendance to other parts of their work, rising up early, and sitting up late, to prepare for, and discharge their ministerial work; and their continued expectation of the springing-up of the seed sown, which accordingly does in proper time: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the seed should spring and grow up, he knoweth not how; it is a mystery in nature, how the seed under the clods, where it dies before it is quickened, should spring and grow up, and bring forth fruit; and so it is in grace, how the word of God first operates on a sinner's heart, and becomes the ingrafted word there; the time when, and much less the manner how, grace, by this means, is implanted in the heart, are not known to a soul itself, and still less to the ministers of the word, who sometimes never know any thing of it; and when they do, not till some time after: this work is done secretly, and powerfully, under the influence of divine grace, without their knowledge, though by them as instruments; so that though the sowing and planting are theirs, all the increase is God's: this may encourage attendance on the ministry of the word, and teach us to ascribe the work of conversion entirely to the power and grace of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the seed should spring and grow up, he knoweth not how; it is a mystery in nature, how the seed under the clods, where it dies before it is quickened, should spring and grow up, and bring forth fruit; and so it is in grace, how the word of God first operates on a sinner's heart, and becomes the ingrafted word there; the time when, and much less the manner how, grace, by this means, is implanted in the heart, are not known to a soul itself, and still less to the ministers of the word, who sometimes never know any thing of it; and when they do, not till some time after: this work is done secretly, and powerfully, under the influence of divine grace, without their knowledge, though by them as instruments; so that though the sowing and planting are theirs, all the increase is God's: this may encourage attendance on the ministry of the word, and teach us to ascribe the work of conversion entirely to the power and grace of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And {g} should sleep, and rise night and day, and the seed should spring and grow up, he {h} knoweth not how.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " should sleep, and rise night and day, and the seed should spring and grow up, he ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " knoweth not how.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) That is, when he has finished sowing should wait both day and night not doubting that the seed should spring forth, which grows both by day and night.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) It is the duty of the ministers to work the ground with all diligence, and accredit the success to God: for the mighty work of the seed coming to blade and ear is mysterious, and is only known by the fruit that comes.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καθεύδῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμέραν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", sleep and rise night and day, suggestive of the monotonous life of a man who has nothing particular to do beyond waiting patiently for the result of what he has already done (seed sown). The presents express a habit, while ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βάλῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", expresses an act, done once for all.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βλαστᾷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the reading in [22] [23] [24], etc., as if from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βλαστάω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") may be either indicative or subjunctive, the former if we adopt the reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μηκύνεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ([25] [26]., etc.) = and the seed sprouts and lengthens.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς οὐκ οἶδεν αὐτός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", how knoweth not (nor careth) he, perfectly indifferent to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rationale",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of growth; the fact enough for him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[22] Codex Vaticanus (sæc. iv.), published in photographic facsimile in 1889 under the care of the Abbate Cozza-Luzi.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[23] Codex Bezae",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[24] Codex Regius--eighth century, represents an ancient text, and is often in agreement with א and B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[25] Codex Vaticanus (sæc. iv.), published in photographic facsimile in 1889 under the care of the Abbate Cozza-Luzi.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[26] Codex Bezae",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spring and grow up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] We need not inquire too minutely who the Sower is, though primarily it refers to the Lord Himself. It is the property of the seed which is intended to engage our attention, the secret energy of its own, the principle of life and growth within itself, whereby it springs up and grows.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καθεύδῃ καὶ ἐγείρηται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should sleep and rise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") With these two verbs are connected by Chiasmus [See Append.] the nouns ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "night",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "day [sleep",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " referring to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "night; rise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]. Moreover, sometimes night is wont to be put before day, as in Genesis 1 [The evening and the morning were the first day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ οἶδεν αὐτὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he knoweth not himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") After the safeguards of grace have been conferred on men, God leaves them in some measure to themselves. Yet this clause may be made to refer to the believing man himself; and then, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of its own accord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is opposed to man’s care, not to the cultivation of the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Mark 4:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Grow (μηκύνηται)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., lengthen; be extended by the seed lengthening out into blade and stalk.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He knoweth not how (ὡς οὐκ οἶδεν αὐτός)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Greek order is very lively: how knoweth not he. ",
        "children": []
      }
    ]
  }
]