[{"num":13,"verse":"Everyone is to obey the governing authorities. For there is no authority that is not from God, and the existing authorities have been placed where they are by God. "},{"num":2,"verse":"Therefore, whoever resists the authorities is resisting what God has instituted; and those who resist will bring judgment on themselves. "},{"num":3,"verse":"For rulers are no terror to good conduct, but to bad. Would you like to be unafraid of the person in authority? Then simply do what is good, and you will win his approval; "},{"num":4,"verse":"for he is God’s servant, there for your benefit. But if you do what is wrong, be afraid! Because it is not for nothing that he holds the power of the sword; for he is God’s servant, there as an avenger to punish wrongdoers. "},{"num":5,"verse":"Another reason to obey, besides fear of punishment, is for the sake of conscience. "},{"num":6,"verse":"This is also why you pay taxes; for the authorities are God’s public officials, constantly attending to these duties. "},{"num":7,"verse":"Pay everyone what he is owed: if you owe the tax-collector, pay your taxes; if you owe the revenue-collector, pay revenue; if you owe someone respect, pay him respect; if you owe someone honor, pay him honor. "},{"num":8,"verse":"Don’t owe anyone anything — except to love one another; for whoever loves his fellow human being has fulfilled Torah. "},{"num":9,"verse":"For the commandments, “Don’t commit adultery,” “Don’t murder,” “Don’t steal,” “Don’t covet,” and any others are summed up in this one rule: “Love your neighbor as yourself.” "},{"num":10,"verse":"Love does not do harm to a neighbor; therefore love is the fullness of Torah."},{"num":11,"verse":"Besides all this, you know at what point of history we stand; so it is high time for you to rouse yourselves from sleep; for the final deliverance is nearer than when we first came to trust. "},{"num":12,"verse":"The night is almost over, the day is almost here. So let us put aside the deeds of darkness and arm ourselves with the weapons of light. "},{"num":13,"verse":"Let us live properly, as people do in the daytime — not partying and getting drunk, not engaging in sexual immorality and other excesses, not quarrelling and being jealous. "},{"num":14,"verse":"Instead, clothe yourselves with the Lord Yeshua the Messiah; and don’t waste your time thinking about how to provide for the sinful desires of your old nature."}]