[{"header":"Chapter 13"},{"num":1,"verse":"Obedience to Authority. Let everyone submit himself to the governing authorities, for there is no authority except that which derives from God, and whatever authorities exist have been instituted by God."},{"num":2,"verse":"Consequently, anyone who resists authority is rebelling against what God has appointed, and those who so resist will bring judgment upon themselves."},{"num":3,"verse":"Rulers are a source of fear not to those who do good but rather to those who do evil. Do you wish to be free of fear from someone in authority? Then continue to do what is right and you will receive his approval."},{"num":4,"verse":"For he is acting as God’s representative for your welfare. But if you do what is evil, then be afraid for he does not wear a sword for nothing. People in authority are God’s servants to mete out punishment to wrongdoers."},{"num":5,"verse":"Therefore, you are obliged to submit, not only because of fear of punishment but also because of conscience."},{"num":6,"verse":"That is why you also pay taxes, for the authorities are God’s servants, and they devote themselves to this service."},{"num":7,"verse":"Pay to each person what is rightfully his—taxes to the one to whom taxes are due, tolls to the one to whom tolls are due, respect to the one to whom respect is due, honor to the one to whom honor is due."},{"num":8,"verse":"Love Is the Fulfillment of the Law. Owe nothing to anyone except the debt of love you owe one another. The one who loves others has fulfilled the Law."},{"num":9,"verse":"“You shall not commit adultery, You shall not kill, You shall not steal, You shall not covet,” and every other commandment are all summed up in this: “You shall love your neighbor as yourself.”"},{"num":10,"verse":"Love cannot result in any harm to the neighbor; therefore, love is the fulfillment of the Law."},{"num":11,"verse":"Live Honestly As in the Light. Do this knowing that the hour has come. It is time for you to awaken from sleep. For our salvation is nearer to us now than it was when we first began to believe."},{"num":12,"verse":"The night is nearly over, and the day is at hand."}]