[[],[{"type":"header","content":"Being Subject to Authorities"},{"type":"prose","content":"Let every person be subject to the governing authorities; for there is no authority except from God, and those authorities that exist have been instituted by God. "}],[{"type":"prose","content":"Therefore whoever resists authority resists what God has appointed, and those who resist will incur judgment. "}],[{"type":"prose","content":"For rulers are not a terror to good conduct, but to bad. Do you wish to have no fear of the authority? Then do what is good, and you will receive its approval; "}],[{"type":"prose","content":"for it is God’s servant for your good. But if you do what is wrong, you should be afraid, for the authority does not bear the sword in vain! It is the servant of God to execute wrath on the wrongdoer. "}],[{"type":"prose","content":"Therefore one must be subject, not only because of wrath but also because of conscience. "}],[{"type":"prose","content":"For the same reason you also pay taxes, for the authorities are God’s servants, busy with this very thing. "}],[{"type":"prose","content":"Pay to all what is due them—taxes to whom taxes are due, revenue to whom revenue is due, respect to whom respect is due, honor to whom honor is due."}],[{"type":"header","content":"Love for One Another"},{"type":"prose","content":"Owe no one anything, except to love one another; for the one who loves another has fulfilled the law. "}],[{"type":"prose","content":"The commandments, “You shall not commit adultery; You shall not murder; You shall not steal; You shall not covet”; and any other commandment, are summed up in this word, “Love your neighbor as yourself.” "}],[{"type":"prose","content":"Love does no wrong to a neighbor; therefore, love is the fulfilling of the law."}],[{"type":"header","content":"An Urgent Appeal"},{"type":"prose","content":"Besides this, you know what time it is, how it is now the moment for you to wake from sleep. For salvation is nearer to us now than when we became believers; "}],[{"type":"prose","content":"the night is far gone, the day is near. Let us then lay aside the works of darkness and put on the armor of light; "}],[{"type":"prose","content":"let us live honorably as in the day, not in reveling and drunkenness, not in debauchery and licentiousness, not in quarreling and jealousy. "}],[{"type":"prose","content":"Instead, put on the Lord Jesus Christ, and make no provision for the flesh, to gratify its desires."}]]