[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "124:6-8 God is the Author of all our deliverances, and he must have the glory. The enemies lay snares for God's people, to bring them into sin and trouble, and to hold them there. Sometimes they seem to prevail; but in the Lord let us put our trust, and we shall not be put to confusion. The believer will ascribe all the honour of his salvation, to the power, mercy, and truth of God, and look back with wonder and thanksgiving on the way in which the Lord has led him. Let us rejoice that our help for the time to come is in him who made heaven and earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed be the Lord - The Lord be praised; or, We have reason to praise the Lord because we have been delivered from these calamities.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who hath not given us as a prey to their teeth - The figure is here changed, though the same idea is retained. The imago is now that of destruction by wild beasts - a form of destruction not less fearful than that which comes from overflowing waters. Such changes of imagery constantly occur in the Book of Psalms, and in impassioned poetry everywhere. The mind is full of a subject; numerous illustrations occur in the rapidity of thought; and the mind seizes upon one and then upon another as best suited to express the emotions of the soul. The next verse furnishes another instance of this sudden transition. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who hath not given us as a prey to their teeth - The figure is here changed, though the same idea is retained. The imago is now that of destruction by wild beasts - a form of destruction not less fearful than that which comes from overflowing waters. Such changes of imagery constantly occur in the Book of Psalms, and in impassioned poetry everywhere. The mind is full of a subject; numerous illustrations occur in the rapidity of thought; and the mind seizes upon one and then upon another as best suited to express the emotions of the soul. The next verse furnishes another instance of this sudden transition. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6, 7. The figure is changed to that of a rapacious wild beast (Ps 3:7), and then of a fowler (Ps 91:3), and complete escape is denoted by breaking the net.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6 Blessed be the Lord, who hath not given us as a prey to their teeth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 Our soul is escaped as a bird out of the snare of the fowlers: the snare is broken, and we are escaped.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 124:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 124:6",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Blessed be the Lord, who hath not given us as a prey to their teeth.\" Leaving the metaphor of a boiling flood, he con-pares the adversaries of Israel to wild beasts who desired to make the godly their prey. Their teeth are prepared to tear, and they regard the godly as their victims. The Lord is heartily praised for not permitting his servants to be devoured when they were between the jaws of the raging ones. It implies that none can harm us till the Lord permits: we cannot be their prey unless the Lord gives us up to them, and that our loving Lord will never do. Hitherto he has refused permission to any foe to destroy us, blessed be his name. The more imminent the danger the more eminent the mercy which would not permit the soul to perish in it. God be blessed for ever for keeping us from the curse. Jehovah be praised for checking the fury of the foe, and saving his own. The verse reads like a merely negative blessing, but no boon can be more positively precious. He has given us to his Son Jesus, and he will never give us to our enemies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 124:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 124:7",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Our soul is escaped as a bird out of the snare of the fowlers.\" Our soul is like a bird for many reasons; but in this case the point of likeness is weakness, folly, and the ease with which it is enticed into the snare. Fowlers have many methods of taking small birds, and Satan, has many methods of entrapping souls. Some are decoyed by evil companions, others are enticed by the love of dainties; hunger drives many into the trap, and fright impels numbers to fly into the net. Fowlers know their birds, and how to take them; but the birds see not the snare so as to avoid it, and they cannot break it so as to escape from it. Happy is the bird that hath a deliverer strong, and mighty, and ready in the moment of peril; happier still is the soul over which the Lord watches day and night to pluck its feet out of the net. What joy there is in this song, \"our soul is escaped.\" How the emancipated one sings and soars, and soars and sings again. Blessed be God many of us can make joyous music with these notes, \"our soul is escaped.\" Escaped from our natural slavery; escaped from the guilt, the degradation, the habit, the dominion of sin; escaped from the vain deceits and fascinations of Satan; escaped from all that can destroy; we do indeed experience delight. What a wonder of grace it is! What a miraculous escape that we who are so easily misled should not have been permitted to die by the dread fowler's hand. The Lord has heard the prayer which he taught us to pray, and he hath delivered us from evil. \"The snare is broken, and we are escaped.\" The song is worth repeating; it is well to dwell upon so great a mercy. The snare may be false doctrine, pride, lust, or a temptation to indulge in policy, or to despair, or to presume; what a high favour it is to have it broken before our eyes, so that it has no more power over us. We see not the mercy while we are in the snare; perhaps we are so foolish as to deplore the breaking of the Satanic charm; the gratitude comes when the escape is seen, and when we perceive what we have escaped from, and by what hand we have been set free. Then our Lord has a song from our mouths and hearts as we make heaven and earth ring with the notes, \"the snare is broken, and we are escaped.\" We have been tempted, but not taken; cast down, but not destroyed; perplexed, but not in despair; in deaths oft, but still alive, blessed be Jehovah!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This song might well have suited our whole nation at the time of the Spanish Armada, the church in the days of the Jesuits, and each believer among us in seasons of strong personal temptation. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " A metaphor from wild beasts, which tear and devour their prey with their teeth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed be the Lord,.... Here begins the church's thanksgiving for deliverance from all their enemies, their proud persecutors; and from all afflictions and troubles by them; which they could never have been delivered from, had not the Lord appeared for them; and therefore it is but just that he should have all the glory of it, and be blessed and praised on account thereof; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who hath not given us as a prey to their teeth; the teeth of wicked men are like spears and arrows, like swords and knives, to devour good men; their passions are strong, and their desires very vehement after their ruin; and, if suffered, the saints would fall an easy prey to them: but God will not give them up to them, either to Satan the devouring lion, or to any of his emissaries; nay, when they have seized them, and got them in their mouths, they shall be snatched from them, as the lamb out of the mouth of the lion and the bear by David; see Psalm 57:4, 1 Peter 5:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who hath not given us as a prey to their teeth; the teeth of wicked men are like spears and arrows, like swords and knives, to devour good men; their passions are strong, and their desires very vehement after their ruin; and, if suffered, the saints would fall an easy prey to them: but God will not give them up to them, either to Satan the devouring lion, or to any of his emissaries; nay, when they have seized them, and got them in their mouths, they shall be snatched from them, as the lamb out of the mouth of the lion and the bear by David; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 57:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Blessed be the LORD, who hath not given us as a prey to their teeth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a prey to their teeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For the figure cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "6–8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thanksgiving and confidence for the future.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Blessed be the Lord, who hath not given us as a prey to their teeth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We are not devoured - we are not \"swallowed up\" - thanks to the interposition of the merciful and gracious Lord, to whom therefore praise and blessing are due. Psalm 124:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After the fact of the divine succour has been expressed, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 124:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows the thanksgiving for it, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 124:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the joyful shout of the rescued one. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 124:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the enemies are conceived of as beasts of prey on account of their bloodthirstiness, just as the worldly empires are in the Book of Daniel; in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 124:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as \"fowlers\" on account of their cunning. According to the punctuation it is not to be rendered: Our soul is like a bird that is escaped, in which case it would have been accented בפשׁנו כצפור, but: our soul (subject with Rebia magnum) is as a bird (כּצפור as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 23:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", instead of the syntactically more usual כּצּפור) escaped out of the snare of him who lays snares (יוקשׁ, elsewhere יקושׁ, יקוּשׁ, a fowler, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 91:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). נשׁבר (with ā beside Rebia) is 3rd:praet.: the snare was burst, and we - we became free. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 124:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 121:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 134:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the universal, and here pertinent thought, viz., the help of Israel is in the name of Jahve, the Creator of the world, i.e., in Him who is manifest as such and is continually verifying Himself, forms the epiphonematic close. Whether the power of the world seeks to make the church of Jahve like to itself or to annihilate it, it is not a disavowal of its God, but a faithful confession, stedfast even to death, that leads to its deliverance. ",
        "children": []
      }
    ]
  }
]