[{"num":5,"verse":"¶ And I saw in the right hand of him that was seated on the throne a book written within and on the backside, sealed with seven seals."},{"num":2,"verse":"And I saw a strong angel preaching with a loud voice, Who is worthy to open the book and to loose its seals?"},{"num":3,"verse":"And no one was able not in the heaven nor in the earth neither under the earth to open the book neither to look upon it."},{"num":4,"verse":"And I wept much because no one was found worthy to open the book nor to read it neither to look upon it."},{"num":5,"verse":"And one of the elders said unto me, Weep not: behold, the Lion of the tribe of Juda, the Root of David, who has overcome to open the book and to loose its seven seals."},{"num":6,"verse":"¶ And I saw, and, behold, in the midst of the throne and of the four animals and in the midst of the elders, stood a Lamb as it had been slain, having seven horns and seven eyes, which are the seven Spirits of God sent forth into all the earth."},{"num":7,"verse":"And he came and took the book out of the right hand of him that was seated upon the throne."},{"num":8,"verse":"And when he had taken the book, the four animals and the twenty-four elders fell on their faces before the Lamb, each one of them having harps, and golden vials full of incense, which are the prayers of saints."},{"num":9,"verse":"And they sang a new song, saying, Thou art worthy to take the book and to open its seals, for thou wast slain and hast redeemed us unto God by thy blood, out of every kindred and tongue and people and nation"},{"num":10,"verse":"and hast made us unto our God kings and priests, and we shall reign on the earth."},{"num":11,"verse":"And I beheld, and I heard the voice of many angels round about the throne and of the animals and of the elders; and the number of them was ten thousand times ten thousand, and thousands of thousands;"},{"num":12,"verse":"saying with a loud voice, Worthy is the Lamb that was slain to take power and riches and wisdom and strength and honour and glory and blessing."},{"num":13,"verse":"And I heard every creature which is in heaven and upon the earth and under the earth and such as are upon the sea and all that are in it, saying, Blessing and honour and glory and power, be unto him that is seated upon the throne, and unto the Lamb for ever and ever."},{"num":14,"verse":"And the four animals said, Amen. And the twenty-four elders fell on their faces and worshipped him that lives for ever and ever."}]