[{"header":"Chapter 5"},{"num":1,"verse":"Vision of the Lamb. Then I saw in the right hand of the one who was seated on the throne a scroll with writing on both sides and sealed with seven seals."},{"num":2,"verse":"And I beheld a mighty angel who proclaimed in a loud voice, “Who is worthy to open the scroll and break its seals?”"},{"num":3,"verse":"But there was no one in heaven or on earth or under the earth who was able to open the scroll and examine it."},{"num":4,"verse":"I began to weep bitterly because no one was found worthy to open the scroll and examine it."},{"num":5,"verse":"Then one of the elders said to me, “Do not weep. The Lion of the tribe of Judah, the Root of David, has triumphed, and thus has won the right to open the scroll and its seven seals.”"},{"num":6,"verse":"Then I saw, standing in the center of the throne, encircled by the four living creatures and the elders, a Lamb that had been slain. He had seven horns and seven eyes, which are the seven spirits of God sent forth into the entire world."},{"num":7,"verse":"He came forward and took the scroll from the right hand of the one who was seated on the throne."},{"num":8,"verse":"When he had taken the scroll, the four living creatures and the twenty-four elders prostrated themselves before the Lamb. Each of the elders was holding a harp, and they had gold bowls filled with incense, which are the prayers of the saints."},{"num":9,"verse":"They sang a new song:"},{"num":11,"verse":"In my vision, I heard the voices of a multitude of angels who surrounded the throne and the living creatures and the elders. These angels numbered thousands upon thousands and ten thousand times ten thousand of them."},{"num":12,"verse":"And they cried out with a loud voice:"},{"num":13,"verse":"Then I heard every creature in heaven and on earth and under the earth and in the sea, and all that is in them, saying:"},{"num":14,"verse":"The four living creatures said, “Amen,” and the elders prostrated themselves in worship."}]