[{"header":"The New Beginning"},{"num":9,"verse":"God blessed Noah and his sons and said to them, “Have many children. Fill the earth with your people."},{"num":2,"verse":"Every animal on earth, every bird in the air, every animal that crawls on the ground, and every fish in the sea will be afraid of you. All of them will be under your control."},{"num":3,"verse":"In the past, I gave you the green plants to eat. Now every animal will also be food for you. I give you everything on earth—it is yours."},{"num":4,"verse":"But I give you one command. You must not eat meat that still has its life (blood) in it."},{"num":5,"verse":"Also, I will demand your blood for your lives. That is, I will demand the life of any person or animal that takes a human life."},{"num":7,"verse":"“Have many children and fill the earth with your people.”"},{"num":8,"verse":"Then God said to Noah and his sons,"},{"num":9,"verse":"“I now make my promise to you and to your people who will live after you."},{"num":10,"verse":"I make my promise to all the birds, and to all the cattle, and to all the animals that came out of the boat with you. I make my promise to every living thing on earth."},{"num":11,"verse":"This is my promise to you: All life on the earth was destroyed by the flood. But that will never happen again. A flood will never again destroy all life on the earth.”"},{"num":12,"verse":"And God said, “I will give you something to prove that I made this promise to you. It will continue forever to show that I have made an agreement with you and every living thing on earth."},{"num":13,"verse":"I am putting a rainbow in the clouds as proof of the agreement between me and the earth."},{"num":14,"verse":"When I bring clouds over the earth, you will see the rainbow in the clouds."},{"num":15,"verse":"When I see this rainbow, I will remember the agreement between me and you and every living thing on the earth. This agreement says that a flood will never again destroy all life on the earth."},{"num":16,"verse":"When I look and see the rainbow in the clouds, I will remember the agreement that continues forever. I will remember the agreement between me and every living thing on the earth.”"},{"num":17,"verse":"So God said to Noah, “This rainbow is proof of the agreement that I made with all living things on earth.”"},{"header":"Problems Begin Again"},{"num":18,"verse":"Noah’s sons came out of the boat with him. Their names were Shem, Ham, and Japheth. (Ham was the father of Canaan.)"},{"num":19,"verse":"These three men were Noah’s sons. And all the people on earth came from these three sons."},{"num":20,"verse":"Noah became a farmer and planted a vineyard."},{"num":21,"verse":"One day Noah made some wine. He got drunk, went into his tent, and took off all his clothes."},{"num":22,"verse":"Ham, the father of Canaan, saw that his father was naked and told his brothers who were outside the tent."},{"num":23,"verse":"Shem and Japheth took a robe, put it across their shoulders, and walked backward into the tent. Then they covered their father without looking at him."},{"num":24,"verse":"Later, Noah woke up. (He was sleeping because of the wine.) When he learned what his youngest son Ham had done to him,"},{"num":25,"verse":"he said,"},{"num":26,"verse":"Noah also said,"},{"num":28,"verse":"After the flood Noah lived 350 years."},{"num":29,"verse":"He lived a total of 950 years; then he died."}]