[{"header":"Godly Living"},{"num":3,"verse":"In the same way, you wives, be submissive to your own husbands [subordinate, not as inferior, but out of respect for the responsibilities entrusted to husbands and their accountability to God, and so partnering with them] so that even if some do not obey the word [of God], they may be won over [to Christ] without discussion by the godly lives of their wives, "},{"num":2,"verse":"when they see your modest and respectful behavior [together with your devotion and appreciation—love your husband, encourage him, and enjoy him as a blessing from God]. "},{"num":3,"verse":"Your adornment must not be merely external—with interweaving and elaborate knotting of the hair, and wearing gold jewelry, or [being superficially preoccupied with] dressing in expensive clothes; "},{"num":4,"verse":"but let it be [the inner beauty of] the hidden person of the heart, with the imperishable quality and unfading charm of a gentle and peaceful spirit, [one that is calm and self-controlled, not overanxious, but serene and spiritually mature] which is very precious in the sight of God. "},{"num":5,"verse":"For in this way in former times the holy women, who hoped in God, used to adorn themselves, being submissive to their own husbands and adapting themselves to them; "},{"num":6,"verse":"just as Sarah obeyed Abraham [following him and having regard for him as head of their house], calling him lord. And you have become her daughters if you do what is right without being frightened by any fear [that is, being respectful toward your husband but not giving in to intimidation, nor allowing yourself to be led into sin, nor to be harmed]."},{"num":7,"verse":"In the same way, you husbands, live with your wives in an understanding way [with great gentleness and tact, and with an intelligent regard for the marriage relationship], as with someone physically weaker, since she is a woman. Show her honor and respect as a fellow heir of the grace of life, so that your prayers will not be hindered or ineffective."},{"num":8,"verse":"Finally, all of you be like-minded [united in spirit], sympathetic, brotherly, kindhearted [courteous and compassionate toward each other as members of one household], and humble in spirit; "},{"num":9,"verse":"and never return evil for evil or insult for insult [avoid scolding, berating, and any kind of abuse], but on the contrary, give a blessing [pray for one another’s well-being, contentment, and protection]; for you have been called for this very purpose, that you might inherit a blessing [from God that brings well-being, happiness, and protection]. "},{"num":10,"verse":"For,"},{"num":13,"verse":"Now who is there to hurt you if you become enthusiastic for what is good? "},{"num":14,"verse":"But even if you should suffer for the sake of righteousness [though it is not certain that you will], you are still blessed [happy, to be admired and favored by God]. Do not be afraid of their intimidating threats, nor be troubled or disturbed [by their opposition]. "},{"num":15,"verse":"But in your hearts set Christ apart [as holy—acknowledging Him, giving Him first place in your lives] as Lord. Always be ready to give a [logical] defense to anyone who asks you to account for the hope and confident assurance [elicited by faith] that is within you, yet [do it] with gentleness and respect. "},{"num":16,"verse":"And see to it that your conscience is entirely clear, so that every time you are slandered or falsely accused, those who attack or disparage your good behavior in Christ will be shamed [by their own words]. "},{"num":17,"verse":"For it is better that you suffer [unjustly] for doing what is right, if that should be God’s will, than [to suffer justly] for doing wrong. "},{"num":18,"verse":"For indeed Christ died for sins once for all, the Just and Righteous for the unjust and unrighteous [the Innocent for the guilty] so that He might bring us to God, having been put to death in the flesh, but made alive in the Spirit; "},{"num":19,"verse":"in which He also went and preached to the spirits now in prison, "},{"num":20,"verse":"who once were disobedient, when the great patience of God was waiting in the days of Noah, during the building of the ark, in which a few, that is, eight persons [Noah’s family], were brought safely through the water. "},{"num":21,"verse":"Corresponding to that [rescue through the flood], baptism [which is an expression of a believer’s new life in Christ] now saves you, not by removing dirt from the body, but by an appeal to God for a good (clear) conscience, [demonstrating what you believe to be yours] through the resurrection of Jesus Christ, "},{"num":22,"verse":"who has gone into heaven and is at the right hand of God [that is, the place of honor and authority], with [all] angels and authorities and powers made subservient to Him."}]