[{"header":"Wives and Husbands"},{"num":3,"verse":"If you are a wife, you must put your husband first. Even if he opposes our message, you will win him over by what you do. No one else will have to say anything to him, "},{"num":2,"verse":"because he will see how you honor God and live a pure life. "},{"num":3,"verse":"Don’t depend on things like fancy hairdos or gold jewelry or expensive clothes to make you look beautiful. "},{"num":4,"verse":"Be beautiful in your heart by being gentle and quiet. This kind of beauty will last, and God considers it very special."},{"num":5,"verse":"Long ago those women who worshiped God and put their hope in him made themselves beautiful by putting their husbands first. "},{"num":6,"verse":"For example, Sarah obeyed Abraham and called him her master. You are her true children, if you do right and don’t let anything frighten you."},{"num":7,"verse":"If you are a husband, you should be thoughtful of your wife. Treat her with honor, because she isn’t as strong as you are, and she shares with you in the gift of life. Then nothing will stand in the way of your prayers."},{"header":"Suffering for Doing Right"},{"num":8,"verse":"Finally, all of you should agree and have concern and love for each other. You should also be kind and humble. "},{"num":9,"verse":"Don’t be hateful and insult people just because they are hateful and insult you. Instead, treat everyone with kindness. You are God’s chosen ones, and he will bless you. The Scriptures say,"},{"num":13,"verse":"Can anyone really harm you for being eager to do good deeds? "},{"num":14,"verse":"Even if you have to suffer for doing good things, God will bless you. So stop being afraid and don’t worry about what people might do. "},{"num":15,"verse":"Honor Christ and let him be the Lord of your life."},{"num":16,"verse":"Give a kind and respectful answer and keep your conscience clear. This way you will make people ashamed for saying bad things about your good conduct as a follower of Christ. "},{"num":17,"verse":"You are better off to obey God and suffer for doing right than to suffer for doing wrong."},{"num":19,"verse":"Christ then preached to the spirits that were being kept in prison. "},{"num":20,"verse":"They had disobeyed God while Noah was building the boat, but God had been patient with them. Eight people went into that boat and were brought safely through the flood."},{"num":21,"verse":"Those flood waters were like baptism that now saves you. But baptism is more than just washing your body. It means turning to God with a clear conscience, because Jesus Christ was raised from death. "},{"num":22,"verse":"Christ is now in heaven, where he sits at the right side of God. All angels, authorities, and powers are under his control."}]