[{"num":3,"verse":"Likewise, wives, [be] subject to your own husbands, that, even if any are disobedient to the word, they may be gained without [the] word by the conversation of the wives,"},{"num":2,"verse":"having witnessed your pure conversation [carried out] in fear;"},{"num":3,"verse":"whose adorning let it not be that outward one of tressing of hair, and wearing gold, or putting on apparel;"},{"num":4,"verse":"but the hidden man of the heart, in the incorruptible [ornament] of a meek and quiet spirit, which in the sight of God is of great price."},{"num":5,"verse":"For thus also the holy women who have hoped in God heretofore adorned themselves, being subject to their own husbands;"},{"num":6,"verse":"as Sarah obeyed Abraham, calling him lord; whose children ye have become, doing good, and not fearing with any kind of consternation."},{"num":7,"verse":"[Ye] husbands likewise, dwell with [them] according to knowledge, as with a weaker, [even] the female, vessel, giving [them] honour, as also fellow-heirs of [the] grace of life, that your prayers be not hindered."},{"num":8,"verse":"Finally, [be] all of one mind, sympathising, full of brotherly love, tender hearted, humble minded;"},{"num":9,"verse":"not rendering evil for evil, or railing for railing; but on the contrary, blessing [others], because ye have been called to this, that ye should inherit blessing."},{"num":10,"verse":"For he that will love life and see good days, let him cause his tongue to cease from evil and his lips that they speak no guile."},{"num":11,"verse":"And let him avoid evil, and do good; let him seek peace and pursue it;"},{"num":12,"verse":"because [the] eyes of [the] Lord [are] on [the] righteous, and his ears towards their supplications; but [the] face of [the] Lord [is] against them that do evil."},{"num":13,"verse":"And who shall injure you if ye have become imitators of that which [is] good?"},{"num":14,"verse":"But if also ye should suffer for righteousness' sake, blessed [are ye]; but be not afraid of their fear, neither be troubled;"},{"num":15,"verse":"but sanctify [the] Lord the Christ in your hearts, and [be] always prepared to [give] an answer [to] every one that asks you to give an account of the hope that [is] in you, but with meekness and fear;"},{"num":16,"verse":"having a good conscience, that [as to that] in which they speak against you as evildoers, they may be ashamed who calumniate your good conversation in Christ."},{"num":17,"verse":"For [it is] better, if the will of God should will it, to suffer [as] well-doers than [as] evildoers;"},{"num":18,"verse":"for Christ indeed has once suffered for sins, [the] just for [the] unjust, that he might bring us to God; being put to death in flesh, but made alive in [the] Spirit,"},{"num":19,"verse":"in which also going he preached to the spirits [which are] in prison,"},{"num":20,"verse":"heretofore disobedient, when the longsuffering of God waited in [the] days of Noah while the ark was preparing, into which few, that is, eight souls, were saved through water:"},{"num":21,"verse":"which figure also now saves you, [even] baptism, not a putting away of [the] filth of flesh, but [the] demand as before God of a good conscience, by [the] resurrection of Jesus Christ,"},{"num":22,"verse":"who is at [the] right hand of God, gone into heaven, angels and authorities and powers being subjected to him."}]