[{"num":3,"verse":"In  the  same  way homoiōs,  · ho wives gynē should  be  subject hypotassō to ho their  own idios husbands anēr,  so  that hina even kai if ei some tis of them  refuse  to  believe apeitheō the ho word logos,  they  may  be  won kerdainō without aneu a  word logos by dia the ho conduct anastrophē of  their ho wives gynē"},{"num":2,"verse":"when  they  observe epopteuō with en respect phobos the ho purity hagnos of  your hymeis life anastrophē. "},{"num":3,"verse":"Do  not ou let  your hos beauty kosmos be eimi · ho external exōthen—such as  braiding emplokē the  hair thrix,  · kai wearing perithesis gold chrysion jewelry ,  or ē dressing endysis up  in  fine  clothes himation— "},{"num":4,"verse":"but alla let it be  the ho inner kryptos person anthrōpos of  the ho heart kardia,  the ho unfading aphthartos beauty  of ho a  gentle praus and kai tranquil hēsychios spirit pneuma,  which hos in  the  sight enōpion of ho God theos is eimi precious polytelēs. "},{"num":5,"verse":"For gar in  the  same  way houtōs,  at  an  earlier  time pote,  · kai the ho devout hagios women gynē— those ho who  put  their  hope elpizō in eis God theos— used  to  adorn kosmeō themselves heautou by  being  subject hypotassō to ho their  own idios husbands anēr, "},{"num":6,"verse":"just  as hōs Sarah Sarra obeyed hypakouō · ho Abraham Abraam,  calling kaleō him autos “my  lord kyrios.”  You  are ginomai her hos daughters teknon if  you  do  what  is  right agathopoieō and kai do  not mē fear phobeomai any mēdeis intimidation ptoēsis. "},{"num":7,"verse":"· ho Husbands anēr,  in  the  same  way homoiōs,  live  with synoikeō them  with kata understanding gnōsis,  showing aponemō honor timē to  the ho woman gynaikeios as hōs a  weaker asthenēs vessel skeuos,  since hōs · kai you  are  joint  heirs synklēronomos of  the  gracious  gift charis of  life zōē,  so  that eis your hymeis prayers proseuchē may  not mē be  hindered enkoptō.  · ho"},{"num":8,"verse":"· ho · de Finally telos,  all pas of you, be  of  one  mind homophrōn,  sympathetic sympathēs,  loving  your  believing  brothers philadelphos,  compassionate eusplanchnos,  humble tapeinophrōn— "},{"num":9,"verse":"not mē returning apodidōmi evil kakos for anti evil kakos or ē insult loidoria for anti insult loidoria,  but de on the contrary  blessing eulogeō,  because hoti for eis this houtos you  were  called kaleō that hina you  might  inherit klēronomeō a  blessing eulogia. "},{"num":10,"verse":"For gar “ The ho one  who  desires thelō to  love agapaō life zōē and kai to see  good agathos days hēmera,  let  him  keep pauō his ho tongue glōssa from apo evil kakos and kai his  lips cheilos from mē speaking laleō deceit dolos. "},{"num":11,"verse":"And de let  him  turn  away ekklinō from apo evil kakos and kai do poieō good agathos;  let  him  seek zēteō peace eirēnē and kai pursue diōkō it autos. "},{"num":12,"verse":"For hoti the  eyes ophthalmos of  the  Lord kyrios are  on epi the  righteous dikaios,  and kai his autos ears ous are open  to eis their autos prayers deēsis;  but de the  face prosōpon of  the  Lord kyrios is  against epi those  who  do poieō evil kakos.” "},{"num":13,"verse":"And kai who tis is  the ho one  who  will  harm kakoō you hymeis if ean you  become ginomai zealots zēlōtēs for  what ho is  good agathos? "},{"num":14,"verse":"But alla even kai if ei you  should  suffer paschō because  of dia righteousness dikaiosynē,  blessed makarios are you.  And de do phobeomai not mē fear phobeomai · ho their autos threats phobos or mēde be  troubled tarassō, "},{"num":15,"verse":"but de · ho in en · ho your hymeis hearts kardia set  apart hagiazō Christ Christos as  Lord kyrios, being  ready hetoimos at  all  times aei to  make pros a  defense apologia to  all pas who ho ask aiteō you hymeis for a  word logos concerning peri the ho hope elpis that is  in en you hymeis. "},{"num":16,"verse":"But alla do it  with meta gentleness prautēs and kai respect phobos,  maintaining echō a  clear agathos conscience syneidēsis,  so  that hina in en the  very  thing  for  which hos you  are  being  slandered katalaleō,  those ho who  are  reviling epēreazō your hymeis · ho good agathos conduct anastrophē in en Christ Christos will  be  put  to  shame kataischunō. "},{"num":17,"verse":"For gar it is  better kreittōn to  suffer paschō for  doing  good agathopoieō,  if ei it  is thelō · ho God’ s theos will thelēma,  · ho than ē for  doing  evil kakopoieō. "},{"num":18,"verse":"Because hoti Christ Christos also kai suffered paschō once hapax for peri our  sins hamartia, the  righteous dikaios on  behalf  of hyper the  unrighteous adikos,  that hina he  might  lead prosagō you hymeis to ho God theos.  He  was  put  to  death thanatoō in  the  flesh sarx but de made  alive zōiopoieō in  the  spirit pneuma, "},{"num":19,"verse":"in en which hos also kai he kēryssō went poreuō and  proclaimed kēryssō to  the ho spirits pneuma in en prison phylakē, "},{"num":20,"verse":"who  once pote were  disobedient apeitheō when hote the ho patience makrothumia of ho God theos waited apekdechomai in en the  days hēmera of  Noah Nōe while  the  ark kibōtos was  being  built kataskeuazō,  in eis which hos a  few oligos,  that houtos is eimi eight oktō souls psychē,  were  brought  safely diasōzō through dia water hydōr. "},{"num":21,"verse":"This water  prefigures antitypos baptism baptisma,  which hos · kai now nyn saves sōzō you hymeis— not ou the  removal apothesis of  dirt rhypos from  the  body sarx but alla the  answer eperōtēma of a  good agathos conscience syneidēsis to eis God theos— by dia the  resurrection anastasis of  Jesus Iēsous Christ Christos, "},{"num":22,"verse":"who hos is eimi at en the  right  hand dexios of ho God theos,  having  gone poreuō into eis heaven ouranos, all  angels angelos and kai authorities exousia and kai powers dynamis being  made  subject hypotassō to  him autos. "}]