[[],[{"type":"header","content":"Godly Living"},{"type":"prose","content":"In the same way, you wives, be subject to your own husbands so that even if any  are disobedient to the word, they may be won over without a word by the behavior of their wives,"}],[{"type":"prose","content":"as they observe your pure and respectful behavior."}],[{"type":"prose","content":"Your adornment must not be  the external—braiding the hair, wearing gold , or putting on apparel;"}],[{"type":"prose","content":"but  the hidden person of the heart, with the imperishable  of a gentle and quiet spirit, which is precious in the sight of God."}],[{"type":"prose","content":"For in this way the holy women of former times, who hoped in God, also used to adorn themselves, being subject to their own husbands,"}],[{"type":"prose","content":"just as Sarah obeyed Abraham, calling him lord; and you have proved to be her children if you do what is right without being frightened by any fear."}],[{"type":"prose","content":"You husbands in the same way, live with  in an understanding way, as with someone weaker,  a woman; and show her honor as a fellow heir of the grace of life, so that your prayers will not be hindered."}],[{"type":"prose","content":"To sum up, all  be harmonious, sympathetic, loving, compassionate,  humble;"}],[{"type":"prose","content":"not returning evil for evil or insult for insult, but giving a blessing instead; for you were called for the very purpose that you would inherit a blessing."}],[{"type":"prose","content":"For,"},{"type":"poetry","content":"“,"},{"type":"poetry","content":"."},{"type":"poetry","content":""}],[{"type":"poetry","content":";"},{"type":"poetry","content":"."},{"type":"poetry","content":""}],[{"type":"poetry","content":","},{"type":"poetry","content":","},{"type":"poetry","content":".”"}],[{"type":"prose","content":"And who is there to harm you if you prove zealous for what is good?"}],[{"type":"prose","content":"But even if you should suffer for the sake of righteousness, you are blessed.  ,"}],[{"type":"prose","content":"but sanctify Christ as Lord in your hearts, always  ready to make a defense to everyone who asks you to give an account for the hope that is in you, but with gentleness and respect;"}],[{"type":"prose","content":"and keep a good conscience so that in the thing in which you are slandered, those who disparage your good behavior in Christ will be put to shame."}],[{"type":"prose","content":"For it is better, if God should will it , that you suffer for doing what is right rather than for doing what is wrong."}],[{"type":"prose","content":"For Christ also suffered for sins once for all  just for  unjust, so that He might bring us to God, having been put to death in the flesh, but made alive in the spirit;"}],[{"type":"prose","content":"in which He also went and made proclamation to the spirits in prison,"}],[{"type":"prose","content":"who once were disobedient when the patience of God kept waiting in the days of Noah, during the construction of the ark, in which a few, that is, eight persons, were brought safely through  water."}],[{"type":"prose","content":"Corresponding to that, baptism now saves you—not the removal of dirt from the flesh, but an appeal to God for a good conscience—through the resurrection of Jesus Christ,"}],[{"type":"prose","content":"who is at the right hand of God, having gone into heaven, after angels and authorities and powers had been subjected to Him."}]]