[{"header":"Wives and Husbands"},{"num":3,"verse":"In the same way, wives, be subject to your own husbands. Then, even if some are disobedient to the word, they will be won over without a word by the way you live, "},{"num":2,"verse":"when they see your pure and reverent conduct. "},{"num":3,"verse":"Let your beauty not be external—the braiding of hair and wearing of gold jewelry or fine clothes—"},{"num":4,"verse":"but the inner person of the heart, the lasting beauty of a gentle and tranquil spirit, which is precious in God’s sight. "},{"num":5,"verse":"For in the same way the holy women who hoped in God long ago adorned themselves by being subject to their husbands, "},{"num":6,"verse":"like Sarah who obeyed Abraham, calling him lord. You become her children when you do what is good and have no fear in doing so. "},{"num":7,"verse":"Husbands, in the same way, treat your wives with consideration as the weaker partners and show them honor as fellow heirs of the grace of life. In this way nothing will hinder your prayers."},{"header":"Suffering for Doing Good"},{"num":8,"verse":"Finally, all of you be harmonious, sympathetic, affectionate, compassionate, and humble. "},{"num":9,"verse":"Do not return evil for evil or insult for insult, but instead bless others because you were called to inherit a blessing. "},{"num":10,"verse":"For"},{"num":13,"verse":"For who is going to harm you if you are devoted to what is good? "},{"num":14,"verse":"But in fact, if you happen to suffer for doing what is right, you are blessed. But do not be terrified of them or be shaken. "},{"num":15,"verse":"But set Christ apart as Lord in your hearts and always be ready to give an answer to anyone who asks about the hope you possess. "},{"num":16,"verse":"Yet do it with courtesy and respect, keeping a good conscience, so that those who slander your good conduct in Christ may be put to shame when they accuse you. "},{"num":17,"verse":"For it is better to suffer for doing good, if God wills it, than for doing evil."},{"num":20,"verse":"after they were disobedient long ago when God patiently waited in the days of Noah as an ark was being constructed. In the ark a few, that is eight souls, were delivered through water. "},{"num":21,"verse":"And this prefigured baptism, which now saves you—not the washing off of physical dirt but the pledge of a good conscience to God—through the resurrection of Jesus Christ, "},{"num":22,"verse":"who went into heaven and is at the right hand of God with angels and authorities and powers subject to him."}]