[{"num":6,"verse":"1 He showeth the duty of servants: 10 and what a mischievous evil coveteousness is: 13 and having spoken somewhat of rich men, he once again forbiddeth Timothy, 20 to cumber himself with vain babblings."},{"num":1,"verse":"Let as many servants as are under the yoke, count their masters worthy of all honor, that the Name of God, and his doctrine be not evil spoken of."},{"num":2,"verse":"And they which have believing masters, let them not despise them, because they are brethren, but rather do service, because they are faithful, and beloved, and partakers of the benefit. These things teach and exhort."},{"num":3,"verse":"If any man teach otherwise, and consenteth not to the wholesome words of our Lord Jesus Christ, and to the doctrine which is according to godliness,"},{"num":4,"verse":"He is puffed up and knoweth nothing, but doteth about questions and strive of words, whereof cometh envy, strife, railings, evil surmisings,"},{"num":5,"verse":"Froward disputations of men of corrupt minds and destitute of the truth, which think that gain is godliness: from such separate thyself."},{"num":6,"verse":"But godliness is great gain, if a man be content with that he hath."},{"num":7,"verse":"For we brought nothing into the world, and it is certain, that we can carry nothing out."},{"num":8,"verse":"Therefore when we have food and raiment, let us therewith be content."},{"num":9,"verse":"For they that will be rich, fall into tentation and snares, and into many foolish and noisome lusts, which drown men in perdition and destruction."},{"num":10,"verse":"For the desire of money is the root of all evil, which while some lusted after they erred from the faith, and pierced themselves through with many sorrows."},{"num":11,"verse":"But thou, O man of God, flee these things, and follow after righteousness, godliness, faith, love, patience, and meekness."},{"num":12,"verse":"Fight the good fight of faith: lay hold of eternal life, whereunto thou art also called, and hast professed a good profession before many witnesses."},{"num":13,"verse":"I charge thee in the sight of God, who quickeneth all things, and before Jesus Christ, which under Pontius Pilate witnessed a good confession."},{"num":14,"verse":"That thou keep this commandment without spot, and unrebukeable, until the appearing of our Lord Jesus Christ,"},{"num":15,"verse":"Which in due time he shall show, that is  blessed and Prince only, the King of kings and Lord of lords."},{"num":16,"verse":"Who only hath immortality, and dwelleth in the light that none can attain unto, whom never man saw, neither can see, unto whom be honor and power everlasting, Amen."},{"num":17,"verse":"Charge them that are rich in this world, that they be not high minded, and that they trust not in uncertain riches, but in the living God, (which giveth us abundantly all things to enjoy.)"},{"num":18,"verse":"That they do good, and be rich in good works, and be ready to distribute, and communicate,"},{"num":19,"verse":"Laying up in store for themselves a good foundation against the time to come, that they may obtain eternal life."},{"num":20,"verse":"O Timothy, keep that which is committed unto thee, and avoid profane and vain babblings, and oppositions of science falsely so called,"},{"num":21,"verse":"Which while some profess, they have erred concerning the faith. Grace be with thee, Amen."}]