[{"header":"Slaves and Masters"},{"num":6,"verse":"All those who are under the yoke as slaves must regard their own masters as worthy of all honor, lest the name of God and the teaching be slandered. "},{"num":2,"verse":"And those who have believing masters must not look down on them because they are brothers, but rather they must serve, because those who benefit by their service are believers and dearly loved."},{"header":"False Teachers and the Love of Money"},{"num":3,"verse":"If anyone teaches other doctrine and does not devote himself to the sound words of our Lord Jesus Christ and the teaching that is in accordance with godliness, "},{"num":4,"verse":"he is conceited, understanding nothing, but having a morbid interest concerning controversies and disputes about words, from which come envy, strife, slanders, evil suspicions, "},{"num":5,"verse":"constant wrangling by people of depraved mind and deprived of the truth, who consider godliness to be a means of gain. "},{"num":6,"verse":"But godliness with contentment is a great means of gain. "},{"num":7,"verse":"For we have brought nothing into the world, so that neither can we bring anything out. "},{"num":8,"verse":"But if we have food and clothing, with these things we will be content. "},{"num":9,"verse":"But those who want to be rich fall into temptation and a trap and many foolish and harmful desires, which plunge those people into ruin and destruction. "},{"num":10,"verse":"For the love of money is a root of all evil, by which some, because they desire it, have gone astray from the faith and have pierced themselves with many pains."},{"header":"Renewed Charge to Timothy"},{"num":11,"verse":"But you, O man of God, flee from these things, and pursue righteousness, godliness, faith, love, patient endurance, gentleness. "},{"num":12,"verse":"Fight the good fight of the faith; take hold of the eternal life to which you were called, and confessed the good confession in the presence of many witnesses. "},{"num":13,"verse":"I command you, in the sight of God who gives life to all things and Christ Jesus who testified the good confession before Pontius Pilate, "},{"num":14,"verse":"that you observe the commandment without fault, irreproachable until the appearing of our Lord Jesus Christ, "},{"num":15,"verse":"which he will make known in his own time, the blessed and only Sovereign, the King of those who reign as kings and Lord of those who rule as lords, "},{"num":16,"verse":"the one who alone possesses immortality, who lives in unapproachable light, whom no human being has seen nor is able to see, to whom be honor and eternal power. Amen."},{"header":"Instructions to the Rich"},{"num":17,"verse":"Command those who are rich in this present age not to be proud and not to put their hope in the uncertainty of riches, but in God, who provides us all things richly for enjoyment, "},{"num":18,"verse":"to do good, to be rich in good works, to be generous, sharing freely, "},{"num":19,"verse":"storing up for themselves a good foundation for the future, in order that they may take hold of what is truly life."},{"header":"Final Charge and Benediction"},{"num":20,"verse":"O Timothy, guard what has been entrusted to you. Turn away from pointless empty talk and contradictions of what is falsely called knowledge, "},{"num":21,"verse":"which some, by professing it, have deviated concerning the faith. Grace be with you all."}]