[{"num":6,"verse":"As  many  as hosos are eimi under hypo the  yoke zygos as slaves  should  consider hēgeomai · ho their  own idios masters despotēs as  worthy axios of  all pas honor timē so  that hina the ho name onoma of ho God theos and kai the ho teaching didaskalia might  not mē be  blasphemed blasphēmeō. "},{"num":2,"verse":"And de let  those ho who  have echō believing pistos masters despotēs not mē despise kataphroneō them  because hoti they  are eimi brothers adelphos;  rather alla,  let  them  serve douleuō all  the  more mallon since hoti those ho benefiting  from antilambanō their ho act  of  kindness euergesia are eimi believers pistos and kai beloved agapētos.  Teach didaskō and kai urge parakaleō these  things houtos. "},{"num":3,"verse":"If ei someone tis teaches  a  different  doctrine heterodidaskaleō and kai does  not mē adhere proserchomai to  the  healthy hygiainō words logos · ho of ho our hēmeis Lord kyrios Jesus Iēsous Christ Christos and kai the ho teaching didaskalia that is  according  to kata godliness eusebeia, "},{"num":4,"verse":"he  is  puffed  up  with  conceit typhoō,  understanding epistamai nothing mēdeis,  but alla has  a  sickly  craving noseō for peri speculations zētēsis and kai fights  about  words logomachia out  of ek which hos come ginomai envy phthonos,  strife eris,  slanders blasphēmia,  evil ponēros suspicions hyponoia, "},{"num":5,"verse":"constant  irritations diaparatribē among  people anthrōpos who  have  been  corrupted diaphtheirō in  their ho mind nous and kai have  been  robbed apostereō of  the ho truth alētheia,  imagining nomizō that  godliness eusebeia is eimi a  means  of  profit porismos.  · ho"},{"num":6,"verse":"Now de godliness eusebeia with meta contentment autarkeia is eimi great megas profit porismos.  · ho"},{"num":7,"verse":"For gar we  brought eispherō nothing oudeis into eis the ho world kosmos,  and hoti neither oude are  we  able dynamai to  take ekpherō anything tis out ; "},{"num":8,"verse":"but de having echō food diatrophē and kai clothing skepasma,  with  these houtos we  will  be  content arkeō. "},{"num":9,"verse":"But de those ho wishing boulomai to  be  rich plouteō fall empiptō into eis temptation peirasmos and kai a  snare pagis and kai many polys foolish anoētos and kai harmful blaberos passions epithumia that hostis plunge bythizō the ho people anthrōpos into eis ruin olethros and kai destruction apōleia. "},{"num":10,"verse":"For gar a  root rhiza of  all  kinds pas of ho evils kakos is eimi the ho love  of  money philargyria,  by  which hos some tis,  by  their  craving oregō,  were  led  astray apoplanaō from apo the ho faith pistis and kai have  pierced peripeirō themselves heautou with  many polys pains odynē. "},{"num":11,"verse":"But de you sy,  man anthrōpos of  God theos,  flee pheugō these  things houtos and de pursue diōkō righteousness dikaiosynē,  godliness eusebeia,  faith pistis,  love agapē,  endurance hypomonē,  gentleness praupatheia. "},{"num":12,"verse":"Fight agōnizomai the ho good kalos fight agōn of  the ho faith pistis.  Seize epilambanomai hold  of  the ho eternal aiōnios life zōē,  to eis which hos you  were  called kaleō and kai about which  you  confessed homologeō the ho good kalos confession homologia before enōpion many polys witnesses martys. "},{"num":13,"verse":"I  urge parangellō you sy,  in  the  presence enōpion of ho God theos who ho gives  life zōiogoneō to  · ho all pas things  and kai Christ Christos Jesus Iēsous who ho witnessed martyreō in  the  time epi of  Pontius Pontios Pilate Pilatos the ho good kalos confession homologia, "},{"num":14,"verse":"to  keep tēreō the ho commandment entolē unblemished aspilos and  above  reproach anepilēmptos until mechri the ho appearing epiphaneia of ho our hēmeis Lord kyrios Jesus Iēsous Christ Christos, "},{"num":15,"verse":"which hos he  will  make  known deiknymi at  the  proper idios time kairos. To  the ho Blessed makarios and kai only monos Sovereign dynastēs,  the ho King basileus of ho kings basileuō and kai Lord kyrios of ho lords kyrieuō, "},{"num":16,"verse":"the ho only monos one  having echō immortality athanasia, the  one  dwelling  in oikeō unapproachable aprositos light phōs,  whom hos no oudeis person anthrōpos has seen  or oude is  able dynamai to see,  to  him hos be  honor timē and kai might kratos forever aiōnios,  Amen amēn. "},{"num":17,"verse":"Urge parangellō the ho rich plousios in en the ho present nyn age aiōn not mē to  be  haughty hypsēlophroneō,  or mēde to  set  their  hope elpizō on epi the  uncertainty adēlotēs of  riches ploutos but alla on epi God theos who ho grants parechō to  us hēmeis all pas things  richly plousiōs for eis our  enjoyment apolausis, "},{"num":18,"verse":"to  do  good agathoergeō,  to  be  rich plouteō in en good kalos deeds ergon,  to  be eimi generous eumetadotos,  sharing koinōnikos, "},{"num":19,"verse":"laying  up apothēsaurizō for  themselves heautou a  good kalos foundation themelios for eis the ho coming mellō age,  so  that hina they  might  seize  hold epilambanomai of  what ho is  truly ontōs life zōē. "},{"num":20,"verse":"O ō Timothy Timotheos,  guard phylassō the ho deposit  entrusted parathēkē to you,  avoiding ektrepō the ho unholy bebēlos chatter kenophōnia and kai contradictions antithesis of  what ho is  falsely  named pseudōnymos “ knowledge gnōsis,” "},{"num":21,"verse":"for  by  professing epangellomai it hos,  some tis have  swerved astocheō from peri the ho faith pistis.  · ho Grace charis be  with meta you hymeis. "}]