[[],[{"type":"prose","content":"All slaves should show full respect for their masters so they will not bring shame on the name of God and his teaching."}],[{"type":"prose","content":"If the masters are believers, that is no excuse for being disrespectful. Those slaves should work all the harder because their efforts are helping other believers who are well loved."},{"type":"header","content":"False Teaching and True Riches"},{"type":"prose","content":"Teach these things, Timothy, and encourage everyone to obey them."}],[{"type":"prose","content":"Some people may contradict our teaching, but these are the wholesome teachings of the Lord Jesus Christ. These teachings promote a godly life."}],[{"type":"prose","content":"Anyone who teaches something different is arrogant and lacks understanding. Such a person has an unhealthy desire to quibble over the meaning of words. This stirs up arguments ending in jealousy, division, slander, and evil suspicions."}],[{"type":"prose","content":"These people always cause trouble. Their minds are corrupt, and they have turned their backs on the truth. To them, a show of godliness is just a way to become wealthy."}],[{"type":"prose","content":"Yet true godliness with contentment is itself great wealth."}],[{"type":"prose","content":"After all, we brought nothing with us when we came into the world, and we can’t take anything with us when we leave it."}],[{"type":"prose","content":"So if we have enough food and clothing, let us be content."}],[{"type":"prose","content":"But people who long to be rich fall into temptation and are trapped by many foolish and harmful desires that plunge them into ruin and destruction."}],[{"type":"prose","content":"For the love of money is the root of all kinds of evil. And some people, craving money, have wandered from the true faith and pierced themselves with many sorrows."},{"type":"header","content":"Paul’s Final Instructions"}],[{"type":"prose","content":"But you, Timothy, are a man of God; so run from all these evil things. Pursue righteousness and a godly life, along with faith, love, perseverance, and gentleness."}],[{"type":"prose","content":"Fight the good fight for the true faith. Hold tightly to the eternal life to which God has called you, which you have declared so well before many witnesses."}],[{"type":"prose","content":"And I charge you before God, who gives life to all, and before Christ Jesus, who gave a good testimony before Pontius Pilate,"}],[{"type":"prose","content":"that you obey this command without wavering. Then no one can find fault with you from now until our Lord Jesus Christ comes again."}],[{"type":"prose","content":"For, "}],[{"type":"prose","content":"Teach those who are rich in this world not to be proud and not to trust in their money, which is so unreliable. Their trust should be in God, who richly gives us all we need for our enjoyment."}],[{"type":"prose","content":"Tell them to use their money to do good. They should be rich in good works and generous to those in need, always being ready to share with others."}],[{"type":"prose","content":"By doing this they will be storing up their treasure as a good foundation for the future so that they may experience true life."}],[{"type":"prose","content":"Timothy, guard what God has entrusted to you. Avoid godless, foolish discussions with those who oppose you with their so-called knowledge."}],[{"type":"prose","content":"Some people have wandered from the faith by following such foolishness.May God’s grace be with you all."}]]