[{"num":6,"verse":"Let as many servants as are under the yoke count their masters worthy of all honour, so that the name of God and his precepts are not ill spoken of. "},{"num":2,"verse":"See to it that those who have believing masters do not honour them less because they are brethren, but so much more rather serve them, because they are believing, and beloved, and will benefit from the good service."},{"num":3,"verse":"If anyone teaches otherwise, and is not content with the wholesome words of our Lord Jesus Christ and with the instruction of godliness, "},{"num":4,"verse":"he is puffed up and knows nothing, but wastes his brains about questions and strife of words, whereof come envy, strife, railing, evil surmisings, "},{"num":5,"verse":"and the vain disputations of men with corrupt minds and destitute of the truth, who think that wealth is godliness. Separate yourself from such people."},{"num":6,"verse":"But godliness is great wealth, if a man is content with what he has. "},{"num":7,"verse":"For we brought nothing into the world, and it is a plain case that we can carry nothing out. "},{"num":8,"verse":"When we have food and clothing, let us therewith be content. "},{"num":9,"verse":"Those who want to be rich fall into temptation and snares, and into many foolish and harmful desires, which drown men in perdition and destruction. "},{"num":10,"verse":"For covetousness is the root of all evil, which, when some followed after, they erred from the faith, and tangled themselves with many sorrows. "},{"num":11,"verse":"But you who are the man of God, flee such things. Pursue righteousness, godliness, love, patience, and gentleness. "},{"num":12,"verse":"Fight the good fight of faith. Lay hold on eternal life, to which you are called and have pledged yourself with a good profession before many witnesses."},{"num":13,"verse":"I give you charge in the sight of God, who gives life to all things, and before Jesus Christ, who bore faithful witness under Pontius Pilate, "},{"num":14,"verse":"to keep the commandment, and be without spot and unrebukeable until the appearing of our Lord Jesus Christ – "},{"num":15,"verse":"which appearing (when the time is come) he will show, who is blessed and sole in dominion, King of kings and Lord of lords, "},{"num":16,"verse":"who alone has immortality, and dwells in light to which no man can attain, whom no man ever saw, neither can see: to whom be honour and rule everlasting. Amen."},{"num":17,"verse":"Charge those who are rich in this world not to be high-minded, and not to trust in uncertain riches, but in the living God, who gives us abundantly all things, to enjoy them; "},{"num":18,"verse":"and to do good, and to be rich in good works, and ready to give and distribute, "},{"num":19,"verse":"laying up in store for themselves a good foundation for the time to come, so that they may obtain eternal life."},{"num":20,"verse":"O Timothy, preserve that which has been given you to keep, and avoid unspiritual vanities of voices, and oppositions of knowledge falsely so-called, "},{"num":21,"verse":"which knowledge has led some who profess it to err as concerning the faith."}]