[{"header":"David and Goliath"},{"num":17,"verse":"Now the Philistines gathered their armies for battle, and were gathered at Sokoh, which belongs to Judah. And they camped between Sokoh and Azekah in Ephes Dammim. "},{"num":2,"verse":"Saul and Israel’s fighting men were gathered, and they camped in the Valley of Elah. And they drew up in battle order to meet the Philistines. "},{"num":3,"verse":"Now the Philistines were standing at the base of the mountain on the one side, and Israel was standing at the base of the mountain on the other side, and the valley was between them."},{"num":4,"verse":"There went out a champion from the camp of the Philistines, Goliath was his name, from Gath, whose height was six cubits and a span. "},{"num":5,"verse":"He had a helmet of bronze on his head, and he was armed with a coat of mail. Now the weight of the bronze coat was five thousand shekels. "},{"num":6,"verse":"He had greaves of bronze on his legs and a bronze javelin between his shoulders. "},{"num":7,"verse":"The staff of his spear was like a weaver’s beam. His iron spearhead weighed six hundred shekels. And a shield-bearer was walking before him."},{"num":8,"verse":"He stood and called out to the ranks of Israel, “Why have you come out to line up for battle? Am not I the Philistine, and you the servants of Saul? Choose for yourselves a man and let him come down to me. "},{"num":9,"verse":"If he is able to fight with me and to strike me down, then we will be your servants. But if I prevail against him and strike him down, then you will be our servants and will serve us.” "},{"num":10,"verse":"The Philistine said, “I defy the battle lines of Israel this day. Give me a man, and let us fight together.” "},{"num":11,"verse":"When Saul and all Israel heard these words of the Philistine, they were filled with terror and were greatly afraid."},{"num":12,"verse":"Now David was the son of that Ephrathite of Bethlehem in Judah whose name was Jesse, who had eight sons. And the man was old in the days of Saul and advanced in years. "},{"num":13,"verse":"The three eldest sons of Jesse went and followed Saul to the battle. And the names of his three sons that went to the battle were Eliab the firstborn, and next to him Abinadab, and the third was Shammah. "},{"num":14,"verse":"As for David, he was the youngest. The three eldest followed Saul, "},{"num":15,"verse":"but David would go back and forth from Saul to shepherd his father’s flock in Bethlehem."},{"num":16,"verse":"The Philistine stepped forward morning and evening and took his stand daily for forty days."},{"num":17,"verse":"Then Jesse said to David his son, “Take now for your brothers an ephah of this parched grain and these ten loaves and run to the camp to your brothers. "},{"num":18,"verse":"Carry these ten cheeses to the captain of their thousand, and look into your brothers’ health, and bring back news of them.” "},{"num":19,"verse":"Now Saul, and they, and all Israel’s fighting men were in the Valley of Elah fighting with the Philistines."},{"num":20,"verse":"So David rose up early in the morning and left the flock with a keeper. And he carried away the food and went as Jesse had commanded him. And when he came to the encampment, the army was going out to the battle line, and they shouted a war cry. "},{"num":21,"verse":"And Israel and the Philistines ordered themselves in battle lines, army against army. "},{"num":22,"verse":"David left his things with the keeper of the equipment, and he ran to the battle line. And he went and greeted his brothers. "},{"num":23,"verse":"As he was speaking with them, the champion, Goliath, the Philistine from Gath, was going up from the battle line of the Philistines. And he spoke these same words and David heard them. "},{"num":24,"verse":"When all Israel’s fighting men saw the man, they fled from him, and were very afraid."},{"num":25,"verse":"The men of Israel said, “Have you seen this man who has come up? Surely he has come up to defy Israel, and it will be that the man who kills him, the king will enrich him with great riches, will give him his daughter, and will make his father’s house exempt from taxes in Israel.”"},{"num":26,"verse":"David spoke to the men that stood by him, saying, “What will be done for the man that kills this Philistine and takes away this reproach from Israel? For who is this uncircumcised Philistine that he should defy the armies of the living God?”"},{"num":27,"verse":"And the people answered him in the same way, saying, “So will it be done to the man who kills him.”"},{"num":28,"verse":"Eliab his eldest brother heard when he spoke to the men. And Eliab’s anger was kindled against David, and he said, “Why have you come down here? And with whom have you left those few sheep in the wilderness? I know your pride and the evil of your heart. For you have come down that you might see the battle.”"},{"num":29,"verse":"David said, “What have I done now? Was it not only a word?” "},{"num":30,"verse":"And he turned from him toward another and spoke in the same way. And the people answered him again as at the first. "},{"num":31,"verse":"When the words which David spoke were heard, they reported them to Saul and he sent for him."},{"num":32,"verse":"David said to Saul, “Let no man’s heart fail because of him. Your servant will go and fight with this Philistine.”"},{"num":33,"verse":"Saul said to David, “You are not able to go against this Philistine to fight with him. For you are but a youth, and he has been a man of war from his youth.”"},{"num":34,"verse":"David said to Saul, “Your servant was a shepherd for my father’s flock, and the lion came and the bear, and took a lamb out of the flock. "},{"num":35,"verse":"And I went out after him, and struck him, and delivered it out of his mouth. And when he arose against me, I took hold of his beard, struck him, and killed him. "},{"num":36,"verse":"Your servant slew both the lion and the bear. And this uncircumcised Philistine will be as one of them, because he has reviled the armies of the living God.” "},{"num":37,"verse":"David said, “The Lord who delivered me out of the paw of the lion and out of the paw of the bear, He will deliver me out of the hand of this Philistine.”"},{"num":38,"verse":"Saul clothed David with his armor. And he put a helmet of bronze on his head. He also clothed him with a coat of mail. "},{"num":39,"verse":"David secured his sword to his armor and tried to walk, but he was not used to it, for he had not tested them."},{"num":40,"verse":"He took his staff in his hand and chose for himself five smooth stones out of the brook. And he put them in his shepherd’s bag, even in a pouch. And his sling was in his hand. Then he drew near to the Philistine."},{"num":41,"verse":"The Philistine came walking and drew near to David, and the man bearing the shield went before him. "},{"num":42,"verse":"When the Philistine looked and saw David, he despised him. For he was a youth and ruddy with a handsome appearance. "},{"num":43,"verse":"The Philistine said to David, “Am I a dog, that you come to me with sticks?” Then the Philistine cursed David by his gods. "},{"num":44,"verse":"The Philistine said to David, “Come to me, and I will give your flesh to the birds of the heavens and to the beasts of the field.”"},{"num":45,"verse":"Then David said to the Philistine, “You come to me with a sword, a spear, and a shield, but I come to you in the name of the Lord of Hosts, the God of the armies of Israel, whom you have reviled. "},{"num":46,"verse":"This day will the Lord deliver you into my hand. And I will strike you down and cut off your head. Then I will give the corpses of the Philistine camp this day to the birds of the air and to the beasts of the earth so that all the earth may know that there is a God in Israel. "},{"num":47,"verse":"And then all this assembly will know that it is not by sword and spear that the Lord saves. For the battle belongs to the Lord, and He will give you into our hands.”"},{"num":48,"verse":"When the Philistine arose and came near to meet David, David hurried and ran toward the battle line to meet the Philistine. "},{"num":49,"verse":"David put his hand in his bag and took from there a stone. And he slung it and struck the Philistine in his forehead. Therefore the stone sunk into his forehead and he fell upon his face to the ground."},{"num":50,"verse":"So David prevailed over the Philistine with a sling and with a stone. And he struck down the Philistine and slew him, but there was no sword in the hand of David."},{"num":51,"verse":"Therefore David ran and stood over the Philistine. Then he took his sword and drew it from out of its sheath, and he finished him off and he cut off his head with it."},{"num":52,"verse":"And the fighting men of Israel and Judah arose and shouted. And they pursued the Philistines from the entrance of the Valley of Elah as far as the gates of Ekron. So the Philistine dead lay slain on the road to Shaaraim as far as Gath and Ekron. "},{"num":53,"verse":"Then the children of Israel returned from chasing after the Philistines and they plundered their tents."},{"num":54,"verse":"David took the head of the Philistine and brought it to Jerusalem, but he put his armor in his tent."},{"num":55,"verse":"When Saul saw David going out against the Philistine, he said to Abner, the commander of the army, “Whose son is this youth, Abner?”"},{"num":56,"verse":"The king said, “Inquire whose son the young man is.”"},{"num":57,"verse":"So when David returned from slaying the Philistine, Abner took him and brought him before Saul with the Philistine’s head in his hand."},{"num":58,"verse":"Saul said to him, “Whose son are you, young man?”"}]