[{"num":17,"verse":"The Philistines now mustered their army for battle and camped between Socoh in Judah and Azekah in Ephes-dammim. "},{"num":2,"verse":"Saul countered with a buildup of forces at Elah Valley. "},{"num":3,"verse":"So the Philistines and Israelis faced each other on opposite hills, with the valley between them."},{"num":4,"verse":"Then Goliath, a Philistine champion from Gath, came out of the Philistine ranks to face the forces of Israel. He was a giant of a man, measuring over nine feet tall! He wore a bronze helmet, a two-hundred-pound coat of mail, bronze leggings, and carried a bronze javelin several inches thick, tipped with a twenty-five-pound iron spearhead, and his armor bearer walked ahead of him with a huge shield."},{"num":8,"verse":"He stood and shouted across to the Israelis, “Do you need a whole army to settle this? I will represent the Philistines, and you choose someone to represent you, and we will settle this in single combat! "},{"num":9,"verse":"If your man is able to kill me, then we will be your slaves. But if I kill him, then you must be our slaves! "},{"num":10,"verse":"I defy the armies of Israel! Send me a man who will fight with me!”"},{"num":11,"verse":"When Saul and the Israeli army heard this, they were dismayed and frightened. "},{"num":12,"verse":"David (the son of aging Jesse, a member of the tribe of Judah who lived in Bethlehem) had seven older brothers. "},{"num":13,"verse":"The three oldest—Eliab, Abinadab, and Shammah—had already volunteered for Saul’s army to fight the Philistines. "},{"num":14,"verse":"David was the youngest son and was on Saul’s staff on a part-time basis. He went back and forth to Bethlehem to help his father with the sheep. "},{"num":16,"verse":"For forty days, twice a day, morning and evening the Philistine giant strutted before the armies of Israel."},{"num":17,"verse":"One day Jesse said to David, “Take this bushel of roasted grain and these ten loaves of bread to your brothers. "},{"num":18,"verse":"Give this cheese to their captain and see how the boys are getting along; and bring us back a letter from them!”"},{"num":19,"verse":"(Saul and the Israeli army were camped at the valley of Elah.)"},{"num":20,"verse":"So David left the sheep with another shepherd and took off early the next morning with the gifts. He arrived at the outskirts of the camp just as the Israeli army was leaving for the battlefield with shouts and battle cries. "},{"num":21,"verse":"Soon the Israeli and Philistine forces stood facing each other, army against army. "},{"num":22,"verse":"David left his luggage with a baggage officer and hurried out to the ranks to find his brothers. "},{"num":23,"verse":"As he was talking with them, he saw Goliath the giant step out from the Philistine troops and shout his challenge to the army of Israel. "},{"num":24,"verse":"As soon as they saw him the Israeli army began to run away in fright."},{"num":25,"verse":"“Have you seen the giant?” the soldiers were asking. “He has insulted the entire army of Israel. And have you heard about the huge reward the king has offered to anyone who kills him? And the king will give him one of his daughters for a wife, and his whole family will be exempted from paying taxes!”"},{"num":26,"verse":"David talked to some others standing there to verify the report. “What will a man get for killing this Philistine and ending his insults to Israel?” he asked them. “Who is this heathen Philistine, anyway, that he is allowed to defy the armies of the living God?” "},{"num":27,"verse":"And he received the same reply as before."},{"num":28,"verse":"But when David’s oldest brother, Eliab, heard David talking like that, he was angry. “What are you doing around here, anyway?” he demanded. “What about the sheep you’re supposed to be taking care of? I know what a cocky brat you are; you just want to see the battle!”"},{"num":29,"verse":"“What have I done now?” David replied. “I was only asking a question!”"},{"num":30,"verse":"And he walked over to some others and asked them the same thing and received the same answer. "},{"num":31,"verse":"When it was finally realized what David meant, someone told King Saul, and the king sent for him."},{"num":32,"verse":"“Don’t worry about a thing,” David told him. “I’ll take care of this Philistine!”"},{"num":33,"verse":"“Don’t be ridiculous!” Saul replied. “How can a kid like you fight with a man like him? You are only a boy, and he has been in the army since he was a boy!”"},{"num":34,"verse":"But David persisted. “When I am taking care of my father’s sheep,” he said, “and a lion or a bear comes and grabs a lamb from the flock, "},{"num":35,"verse":"I go after it with a club and take the lamb from its mouth. If it turns on me, I catch it by the jaw and club it to death. "},{"num":36,"verse":"I have done this to both lions and bears, and I’ll do it to this heathen Philistine too, for he has defied the armies of the living God! "},{"num":37,"verse":"The Lord who saved me from the claws and teeth of the lion and the bear will save me from this Philistine!”"},{"num":38,"verse":"Then Saul gave David his own armor—a bronze helmet and a coat of mail. David put it on, strapped the sword over it, and took a step or two to see what it was like, for he had never worn such things before. “I can hardly move!” he exclaimed, and took them off again. "},{"num":40,"verse":"Then he picked up five smooth stones from a stream and put them in his shepherd’s bag and, armed only with his shepherd’s staff and sling, started across to Goliath. "},{"num":41,"verse":"Goliath walked out toward David with his shield-bearer ahead of him, sneering in contempt at this nice little red-cheeked boy!"},{"num":43,"verse":"“Am I a dog,” he roared at David, “that you come at me with a stick?” And he cursed David by the names of his gods. "},{"num":44,"verse":"“Come over here and I’ll give your flesh to the birds and wild animals,” Goliath yelled."},{"num":45,"verse":"David shouted in reply, “You come to me with a sword and a spear, but I come to you in the name of the Lord of the armies of heaven and of Israel—the very God whom you have defied. "},{"num":46,"verse":"Today the Lord will conquer you, and I will kill you and cut off your head; and then I will give the dead bodies of your men to the birds and wild animals, and the whole world will know that there is a God in Israel! "},{"num":47,"verse":"And Israel will learn that the Lord does not depend on weapons to fulfill his plans—he works without regard to human means! He will give you to us!”"},{"num":48,"verse":"As Goliath approached, David ran out to meet him and, reaching into his shepherd’s bag, took out a stone, hurled it from his sling, and hit the Philistine in the forehead. The stone sank in, and the man fell on his face to the ground. "},{"num":50,"verse":"So David conquered the Philistine giant with a sling and a stone. Since he had no sword, he ran over and pulled Goliath’s from its sheath and killed him with it, and then cut off his head. When the Philistines saw that their champion was dead, they turned and ran."},{"num":52,"verse":"Then the Israelis gave a great shout of triumph and rushed after the Philistines, chasing them as far as Gath and the gates of Ekron. The bodies of the dead and wounded Philistines were strewn all along the road to Shaaraim. "},{"num":53,"verse":"Then the Israeli army returned and plundered the deserted Philistine camp."},{"num":54,"verse":"(Later David took Goliath’s head to Jerusalem, but stored his armor in his tent.)"},{"num":55,"verse":"As Saul was watching David go out to fight Goliath, he asked Abner, the general of his army, “Abner, what sort of family does this young fellow come from?”"},{"num":56,"verse":"“Well, find out!” the king told him."},{"num":57,"verse":"After David had killed Goliath, Abner brought him to Saul with the Philistine’s head still in his hand."},{"num":58,"verse":"“Tell me about your father, my boy,” Saul said."}]