[{"num":17,"verse":"Now the Philistines had gathered an army for battle at Socoh, which is in the land of Judah, and they pitched their tents in Ephes-dammim between Socoh and Azekah. "},{"num":2,"verse":"Unwilling to allow another Philistine invasion of their nation, Saul and the forces of Israel went out against them. They camped in the valley of Elah and formed ranks against the Philistines. "},{"num":3,"verse":"The Philistines stood on one mountain and the Israelites on another, with the valley between them."},{"num":4,"verse":"Then a champion emerged from the Philistine camp, Goliath of Gath (one of the five capital cities in the Philistine confederation), who was over nine feet tall. "},{"num":5,"verse":"He wore a bronze helmet and a chain-mail coat that weighed more than 100 pounds of bronze. "},{"num":6,"verse":"His legs were protected by bronze shin guards, and he had a bronze javelin slung between his shoulders, ready to throw. "},{"num":7,"verse":"The shaft of his spear was as thick as a weaver’s beam, the iron head of his spear weighed 20 pounds, and his shield-bearer went ahead of him. He was a fearsome sight."},{"num":8,"verse":"Goliath stood and shouted to the watching Israelites."},{"num":11,"verse":"When Saul and his army heard the Philistine’s words, they were shocked and frightened."},{"num":12,"verse":"David was the son of Jesse, an Ephrathite from Bethlehem in Judah who had eight sons. At this time, Jesse was already an old man. "},{"num":13,"verse":"Jesse’s three oldest sons, Eliab (the firstborn), Abinadab (the second), and Shammah (the third) had gone with Saul to the battlefield. "},{"num":14,"verse":"David was the youngest son; and while the three oldest went with Saul, "},{"num":15,"verse":"he went back and forth between Saul’s battle and his father’s sheep in Bethlehem taking provisions to the troops and bringing word from the front line."},{"num":16,"verse":"For 40 days this Philistine giant, Goliath of Gath, stepped forward, challenging the men of Israel every morning and evening. But no one was brave enough to accept the challenge."},{"num":20,"verse":"David rose early the next morning, left the sheep in the care of another, took the provisions, and obeyed Jesse’s instructions. David reached the camp just as the army was lining up and shouting its war cries. "},{"num":21,"verse":"Both Israel and the Philistines prepared to fight against each other. "},{"num":22,"verse":"David left the provisions with the person in charge of baggage; he ran to the front lines and shoved his way through the soldiers to greet his brothers. "},{"num":23,"verse":"As David talked with them, Goliath, the Philistine champion from Gath, emerged again and shouted his challenge to the men of Israel. This time young David heard his words."},{"num":24,"verse":"When they saw Goliath, all the Israelites were frightened and retreated from him."},{"num":28,"verse":"David’s oldest brother, Eliab, overheard this conversation and became angry with David."},{"num":30,"verse":"David ignored him and asked another soldier the same question, and the people gave him the same answer. "},{"num":31,"verse":"When news of David’s valiant words reached the king, Saul sent for David."},{"num":38,"verse":"So Saul outfitted David in the king’s own armor: a bronze helmet to protect his head and a coat of mail to protect his chest. "},{"num":39,"verse":"David strapped on Saul’s sword outside the armor and then discovered he could not move because he was not used to the restrictions of the weighty armor."},{"num":40,"verse":"He took his staff in his hand and went to the stream to choose five smooth stones, which he kept in a pouch in his shepherd’s bag. He had his sling ready as he approached the Philistine."},{"num":41,"verse":"The Philistine, with his shield-bearer in front of him, came closer to David. "},{"num":42,"verse":"When he saw that David was only a healthy and handsome boy, Goliath’s eyes filled with contempt."},{"num":48,"verse":"When the Philistine stood up and approached, David ran toward the line of battle to meet him. "},{"num":49,"verse":"As quick as a flash, he reached into his bag, put a stone in his sling, and launched it at the Philistine, hitting him in the head. The stone sank deeply into his forehead, and the Philistine fell face-first onto the ground."},{"num":50,"verse":"That was how David defeated the Philistine with only a sling and a single stone, striking him down, ending his life without a sword in his hand."},{"num":51,"verse":"Then David ran to the Philistine and stood over his lifeless body. He pulled the man’s sword from its scabbard and finished him by cutting off his head."},{"num":52,"verse":"The people of Israel and Judah gave a great shout and chased the Philistines the length of the valley and back to the gates of Ekron; and Philistines wounded in the battle fell all along the five miles of the Shaaraim Way, which ran between the Philistine capital cities of Gath and Ekron. "},{"num":53,"verse":"Then the Israelites turned back from chasing the Philistines and plundered the Philistine camps."},{"num":54,"verse":"As the sons of Israel were distributing the spoils from the battle, David took the Philistine’s head and went to Jerusalem, but he kept the man’s armor and other possessions back in his own tent."},{"num":55,"verse":"Earlier in the day, as David was choosing his stones and bravely approaching the Philistine, Saul asked his cousin Abner, who was general of the army, where David came from."},{"num":57,"verse":"When David returned from killing the Philistine, Abner brought him in front of Saul holding the head of the Philistine."}]