[{"num":7,"verse":"Seeing that we have such promises, dearly beloveds, let us cleanse ourselves from all defilement of the flesh and spirit, and grow up to full holiness in the fear of God. "},{"num":2,"verse":"Understand us: we have hurt no one, we have corrupted no one, we have defrauded no one. "},{"num":3,"verse":"I do not say this to condemn you, for I have told you before that you are in our hearts, to die and live with you. "},{"num":4,"verse":"I make very much of you, and rejoice greatly in you."},{"num":5,"verse":"For when we had come into Macedonia, we had no rest in our flesh, but we were troubled on every side. Outwardly was conflict, inwardly was fear. "},{"num":6,"verse":"Nevertheless, God, who comforts the abject, comforted us at the coming of Titus. "},{"num":7,"verse":"And not with his coming only, but also with the consolation that he was comforted with by you. For he told us of your longing, your mourning, your fervent heart for me, so that I now rejoice the more. "},{"num":8,"verse":"Therefore, though I made you sorrowful with a letter, I do not regret it – though I did have regrets. For I realize that the letter made you sorrowful, though it was but for a season. "},{"num":9,"verse":"But now I am happy – not that you were sorrowful, but that you so sorrowed that you repented. For your sorrow was godly, so that in nothing were you hurt by us. "},{"num":10,"verse":"For godly sorrow causes repentance unto salvation, not to be regretted, while worldly sorrow causes death."},{"num":11,"verse":"Behold what diligence this godly sorrow that you felt has wrought in you. Yea, it caused you to clear yourselves: it led to indignation, it led to fear, it led to desire, it led to a fervent mind, it led to punishment. For in every point you have shown yourselves to be clear in that matter. "},{"num":12,"verse":"So although I wrote to you, I did it not for the sake of him who did the injury, nor for the sake of him who was injured, but so that our good mind that we have toward you in the sight of God might appear to you."},{"num":13,"verse":"Therefore we are comforted because you are comforted. Yea and we rejoiced much more for the joy that Titus had, because his spirit was refreshed by you all. "},{"num":14,"verse":"I am therefore not now ashamed, though I boasted to him of you. For just as all the things that I preached to you are true, so also the boasts that I made to Titus are found true. "},{"num":15,"verse":"And now his inward affection for you is greater when he remembers the obedience of every one of you, how with fear and trembling you received him. "},{"num":16,"verse":"I rejoice that I may be reassured about you in every point."}]