[{"header":"Parable of the Sower and Soils"},{"num":4,"verse":"Again Jesus began to teach beside the sea [of Galilee]. And a very large crowd gathered around Him, so He got into a boat [anchoring it a short distance out] on the sea and sat down; and the whole crowd was by the sea on the shore. "},{"num":2,"verse":"And He taught them many things in parables, and in His teaching He said to them, "},{"num":9,"verse":"And He said, “He who has ears to hear, let him hear and heed My words.”"},{"num":10,"verse":"As soon as He was alone, those who were around Him, together with the twelve [disciples], began asking Him about [the interpretation of] the parables. "},{"num":11,"verse":"He said to them, “The mystery of the kingdom of God has been given to you [who have teachable hearts], but those who are outside [the unbelievers, the spiritually blind] get everything in parables, "},{"header":"Explanation"},{"num":13,"verse":"Then He said to them, “Do you not understand this parable? How will you understand and grasp the meaning of all the parables? "},{"num":21,"verse":"He said to them, “A lamp is not brought in to be put under a basket or under a bed, is it? Is it not [brought in] to be put on the lampstand? "},{"num":24,"verse":"Then He said to them, “Pay attention to what you hear. By your own standard of measurement [that is, to the extent that you study spiritual truth and apply godly wisdom] it will be measured to you [and you will be given even greater ability to respond]—and more will be given to you besides. "},{"header":"Parable of the Seed"},{"num":26,"verse":"Then He said, “The kingdom of God is like a man who throws seed on the ground; "},{"header":"Parable of the Mustard Seed"},{"num":30,"verse":"And He said, “How shall we picture the kingdom of God, or what parable shall we use to illustrate and explain it? "},{"num":33,"verse":"With many such parables, Jesus spoke the word to them, as they were able to hear and understand it; "},{"num":34,"verse":"and He did not say anything to them without [using] a parable; He did, however, explain everything privately to His own disciples."},{"header":"Jesus Stills the Sea"},{"num":35,"verse":"On that [same] day, when evening had come, He said to them, “Let us go over to the other side [of the Sea of Galilee].” "},{"num":36,"verse":"So leaving the crowd, they took Him with them, just as He was, in the boat. And other boats were with Him. "},{"num":37,"verse":"And a fierce windstorm began to blow, and waves were breaking over the boat, so that it was already being swamped. "},{"num":38,"verse":"But Jesus was in the stern, asleep [with His head] on the [sailor’s leather] cushion. And they woke Him and said to Him, “Teacher, do You not care that we are about to die?” "},{"num":39,"verse":"And He got up and [sternly] rebuked the wind and said to the sea, “Hush, be still (muzzled)!” And the wind died down [as if it had grown weary] and there was [at once] a great calm [a perfect peacefulness]. "},{"num":40,"verse":"Jesus said to them, “Why are you afraid? Do you still have no faith and confidence [in Me]?” "},{"num":41,"verse":"They were filled with great fear, and said to each other, “Who then is this, that even the wind and the sea obey Him?”"}]