[{"num":4,"verse":"Jesus began to teach people by the sea again. Many people came to him. So he got in a boat on the sea and sat down. The people were by the sea on the land."},{"num":2,"verse":"He told the people stories and taught them many things."},{"num":3,"verse":"He said, `Listen. A man went out to sow some seed."},{"num":4,"verse":"As he sowed it, some of the seed fell on the road. Birds came and ate the seed."},{"num":5,"verse":"Some seed fell on the stony ground. Not much ground covered the stones. The seed started to grow right away because it was not deep in the ground."},{"num":6,"verse":"When the sun began to shine, it was too hot for the new plants. They died because they had no roots."},{"num":7,"verse":"Some seed fell among the weeds. The weeds grew up and made the new plants die. So no seeds grew on them."},{"num":8,"verse":"But some seed fell on good ground. That seed grew and the plants gave more seed. Some plants gave thirty seeds. Some gave sixty. And some gave a hundred.'"},{"num":9,"verse":"Jesus said to them, `Everyone who has ears to hear, listen!'"},{"num":10,"verse":"Later, Jesus was alone. Then the twelve disciples and the other people who were there asked him about the stories."},{"num":11,"verse":"He said to them, `You can learn the secret things about the kingdom of God. But we must use stories to tell the other people."},{"num":12,"verse":"`They may look and look, but they will not see. They may listen and listen, but they will not understand. If they did understand, they would turn back to God and he would forgive them for the wrong things they have done.'"},{"num":13,"verse":"Jesus said also, `Do you not understand this story? How then are you going to understand all the stories?"},{"num":14,"verse":"The man who sows the seed tells God's message."},{"num":15,"verse":"Those beside the road are like people who hear the message. But as soon as they hear it, Satan comes and takes it out of their hearts"},{"num":16,"verse":"The seed that fell on the stony ground is the same. It is like people who hear the message and as soon as they hear it they are very glad."},{"num":17,"verse":"They believe it for a short time. When trouble or a hard time comes because of the message, they stop believing."},{"num":18,"verse":"The seed that fell among the weeds is like people who hear the message."},{"num":19,"verse":"But they think about the things of this world. They want to get money and other things to be happy. These things push the message out of their hearts. No good comes from it."},{"num":20,"verse":"But some seed fell on good ground. That is like people who hear the message and understand it. Much good comes from it. Some people are like the seed that made thirty seeds. Some people are like the seed that gave sixty. Some people are like the seed that gave a hundred.'"},{"num":21,"verse":"Then Jesus said to them, `People do not bring a light and put it under a basket or under a bed. But they put it on the place for a lamp."},{"num":22,"verse":"Everything that is hidden will be seen. Everything that is secret will be known and come out to be seen."},{"num":23,"verse":"Everyone who has ears to hear, listen!'"},{"num":24,"verse":"And Jesus said, `Take care how you listen. How much you give to others is how much will be given to you. You who obey God will get more than you give."},{"num":25,"verse":"Anyone who has some will get more. But he who does not have anything, even the little that he has will be taken away from him.'"},{"num":26,"verse":"And Jesus said, `The kingdom of God is like this. A man sows some seed in the ground."},{"num":27,"verse":"Then he goes on just as he did before. He sleeps at night and wakes up in the morning. The seed begins to grow but he doesn't know what makes it grow."},{"num":28,"verse":"The ground itself makes the seed grow. First the plant comes up. Then it begins to have seed of its own. After a while the harvest is ready."},{"num":29,"verse":"When the harvest is really ready, he cuts it right away because the harvest time has come.'"},{"num":30,"verse":"And Jesus said, `What is the kingdom of God like? What shall I say it is like?"},{"num":31,"verse":"It is like this. A mustard seed is the smallest seed that is ever planted in the earth."},{"num":32,"verse":"But the plant that grows from that seed is bigger than any other plant. It puts out very big branches. The birds come and live in its branches.'"},{"num":33,"verse":"Jesus told the people many stories like this. He told them as much of God's words as they were able to understand."},{"num":34,"verse":"He did not tell them anything without a story. When he was alone with his disciples, he told them the meaning of the stories."},{"num":35,"verse":"In the evening of that day, Jesus said to his disciples, `Let us cross over to the other side of the sea.'"},{"num":36,"verse":"The disciples left the people and took Jesus away in the boat he was in. Other little boats were with him."},{"num":37,"verse":"A very strong wind began to blow. Water came in the boat. It began to fill up with water."},{"num":38,"verse":"Jesus was in the back end of the boat, sleeping with his head on a pillow. The disciples woke him up. `Master,' they shouted. `We will die! Do you not care?'"},{"num":39,"verse":"Then Jesus got up. He said to the wind and the sea, `Stop!' The wind stopped. Then all was quiet."},{"num":40,"verse":"Then he said to the disciples, `Why do you fear? Do you not believe in God?'"},{"num":41,"verse":"The disciples were surprised. They said to each other, `What kind of man is this? Even the wind and the sea obey him.'"}]