[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:20-23 David greatly lamented the calamity. It is great trouble to a good man to find himself any way the cause of evil to others. He must have been much pained, when he considered that his falsehood was one cause of this fatal event. David speaks with assurance of his own safety, and promises that Abiathar should have his protection. With the Son of David, all who are his may be sure they shall be in safeguard, Ps 91:1. In the hurry and distraction David was continually in, he found time for communion with God, and found comfort in it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The characteristic generosity of David's disposition breaks out in these words. He never forgot a friend. (Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) David acknowledges that Saul's enmity against Abiathar is the consequence of his enmity against himself, and therefore David makes common cause with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 22:20-23. Abiathar Escapes and Flees after David.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20-23. one of the sons of Ahimelech … escaped—This was Abiathar, who repaired to David in the forest of Hareth, rescuing, with his own life, the high priest's vestments (1Sa 23:6, 9). On hearing his sad tale, David declared that he had dreaded such a fatal result from the malice and intriguing ambition of Doeg; and, accusing himself as having been the occasion of all the disaster to Abiathar's family, David invited him to remain, because, firmly trusting himself in the accomplishment of the divine promise, David could guarantee protection to him.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Because God will certainly preserve me to the kingdom which he hath promised; and I by his help will protect thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abide thou with me, fear not,.... He appeared to be in a fright; which is not to be wondered at, as not knowing what to do, and where to go and provide for his safety; when, to allay his fears, and make him easy, David invites and encourages him to stay with him, and not be afraid of Saul, nor any other: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for he that seeketh my life seeketh thy life; or, as Kimchi observes, it may be interpreted, \"my life he seeks who seeks thy life\"; we are in the same circumstances, and have the same common enemy, and therefore it is best and safest to be together; as the Targum,\"he that seeks to kill me seeks to kill thee;''and as Jarchi adds, he that loves me will love thee, and he that keeps my life will keep thine: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but with me thou shalt be in safeguard; intimating, that he would be as careful of him as of himself; and that for this reason, as Ben Gersom suggests, because he brought the ephod with the Urim and Thummim with him, by which he could inquire of God for him; but this was the thing David was confident of, that God would preserve him, and raise him to the kingdom, and therefore Abiathar might be sure of safety with him: at this time he penned the fifty second psalm, which shows the frame of spirit he was now in; see Psalm 52:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but with me thou shalt be in safeguard; intimating, that he would be as careful of him as of himself; and that for this reason, as Ben Gersom suggests, because he brought the ephod with the Urim and Thummim with him, by which he could inquire of God for him; but this was the thing David was confident of, that God would preserve him, and raise him to the kingdom, and therefore Abiathar might be sure of safety with him: at this time he penned the fifty second psalm, which shows the frame of spirit he was now in; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 52:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Abide thou with me, fear not: for he that seeketh my life seeketh thy life: but with me thou shalt be in safeguard.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he that seeketh my life",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Our lives are both in danger from one common enemy, so that our interests will be identical.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 22:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The only one of the whole body of priests who escaped this bloody death was a son of Ahimelech, named Abiathar, who \"fled after David,\" i.e., to David the fugitive, and informed him of the barbarous vengeance which Saul had taken upon the priests of the Lord. Then David recognised and confessed his guilt. \"I knew that day that the Edomite Doeg was there, that he (i.e., that as the Edomite Doeg was there, he) would tell Saul: I am the cause of all the souls of thy father's house,\" i.e., of their death. סבב is used here in the sense of being the cause of a thing, which is one of the meanings of the verb in the Arabic and Talmudic (vid., Ges. Lex. s. v.). \"Stay with me, fear not; for he who seeks my life seeks thy life: for thou art safe with me.\" The abstract mishmereth, protection, keeping (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:33-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is used for the concrete, in the sense of protected, well kept. The thought is the following: As no other is seeking thy life than Saul, who also wants to kill me, thou mayest stay with me without fear, as I am sure of divine protection. David spoke thus in the firm belief that the Lord would deliver him from his foe, and give him the kingdom. The action of Saul, which had just been reported to him, could only strengthen him in this belief, as it was a sign of the growing hardness of Saul, which must accelerate his destruction. ",
        "children": []
      }
    ]
  }
]