[{"header":"Belshazzar’s Feast"},{"num":5,"verse":"Belshazzar the king [who was a descendant of Nebuchadnezzar] gave a great feast for a thousand of his nobles, and he was drinking his wine in the presence of the thousand [guests]. "},{"num":2,"verse":"Belshazzar, as he tasted the wine, gave a command to bring in the gold and silver vessels which his father Nebuchadnezzar had taken out of the temple which was in Jerusalem, so that the king and his nobles, his wives and his concubines might drink from them. "},{"num":3,"verse":"Then they brought in the gold and silver vessels that had been taken out of the temple, the house of God which was in Jerusalem; and the king and his nobles, his wives and his concubines drank from them. "},{"num":4,"verse":"They drank the wine and praised the gods of gold and silver, of bronze, iron, wood and stone."},{"num":5,"verse":"Suddenly the fingers of a man’s hand appeared and began writing opposite the lampstand on [a well-lit area of] the plaster of the wall of the king’s palace, and the king saw the part of the hand that did the writing. "},{"num":6,"verse":"Then the king’s face grew pale, and his thoughts alarmed him; the joints and muscles of his hips and back weakened and his knees began knocking together. "},{"num":7,"verse":"The king called aloud to bring in the enchanters (Magi), the Chaldeans [who were master astrologers] and the diviners. The king said to the wise men of Babylon, “Whoever can read this writing and explain its interpretation to me shall be clothed with purple and have a chain of gold put around his neck, and have authority as the third ruler in the kingdom.” "},{"num":8,"verse":"Then all the king’s wise men came in, but they could not read the writing or reveal to the king its interpretation. "},{"num":9,"verse":"Then King Belshazzar was greatly perplexed, his face became even paler, and his nobles were bewildered and alarmed."},{"num":10,"verse":"Now the queen [mother], overhearing the [excited] words of the king and his nobles, came into the banquet area. The queen [mother] spoke and said, “O king, live forever! Do not be alarmed at your thoughts or let your face be changed. "},{"num":11,"verse":"There is a man in your kingdom in whom is a spirit of the holy gods; and in the days of your father, illumination, understanding and wisdom like the wisdom of the gods were found in him. And King Nebuchadnezzar, your father—your father the king, appointed him chief of the magicians, enchanters, Chaldeans and diviners. "},{"num":12,"verse":"It was because an extraordinary spirit, knowledge and insight, the ability to interpret dreams, clarify riddles, and solve complex problems were found in this Daniel, whom the king named Belteshazzar. Now let Daniel be called and he will give the interpretation.”"},{"header":"Daniel Interprets Handwriting on the Wall"},{"num":13,"verse":"Then Daniel was brought in before the king. And the king said to Daniel, “Are you that Daniel who is one of the sons of the exiles of Judah, whom my father the king brought from Judah? "},{"num":14,"verse":"I have heard of you, that a spirit of the gods is in you, and that illumination, insight, and extraordinary wisdom have been found in you. "},{"num":15,"verse":"Now the wise men and the enchanters, were brought in before me so that they might read this writing and reveal its meaning to me, but they could not give the interpretation of the message. "},{"num":16,"verse":"But I personally have heard about you, that you are able to make interpretations and solve complex problems. Now if you are able to read the writing and reveal its interpretation to me, you shall be clothed with purple and have a chain of gold put around your neck, and you shall have authority as the third ruler in the kingdom.”"},{"num":17,"verse":"Then Daniel answered and said before the king, “Keep your gifts for yourself and give your rewards to someone else; however, I will read the writing to the king and reveal the interpretation to him. "},{"num":18,"verse":"O king, the Most High God gave Nebuchadnezzar your father a kingdom and greatness and glory and majesty; "},{"num":19,"verse":"and because of the greatness that He gave him, all the peoples, nations, and speakers of every language trembled and feared him. Whomever he wished he killed, and whomever he wished he kept alive; whomever he wished he promoted and whomever he wished he humbled. "},{"num":20,"verse":"But when his heart was lifted up and his spirit became so proud that he behaved arrogantly, he was deposed from his royal throne and his glory was taken away from him. "},{"num":21,"verse":"He was also driven from mankind, and his mind was made like that of an animal, and his dwelling place was with the wild donkeys. He was given grass to eat like cattle, and his body was wet with the dew of heaven until he came to know [without any doubt] that the Most High God rules over the kingdom of mankind and He appoints it to whomever He wills. "},{"num":22,"verse":"And you, his son, O Belshazzar, have not humbled your heart (mind), even though you knew all this. "},{"num":23,"verse":"And you have exalted yourself against the Lord of heaven, and the vessels of His house have been brought before you, and you and your nobles, your wives and your concubines have been drinking wine from them; and you have praised the gods of silver and gold, of bronze, iron, wood and stone, which do not see or hear or understand. But the God who holds in His hand your breath of life and your ways you have not honored and glorified [but have dishonored and defied]. "},{"num":24,"verse":"Then the hand was sent from the presence [of the Most High God], and this inscription was written:"},{"num":25,"verse":"“This is the inscription that was written, ‘mene, mene, tekel, upharsin [numbered, numbered, weighed, and divided].’ "},{"num":26,"verse":"This is the interpretation of the message: ‘mene’—God has numbered the days of your kingdom and put an end to it; "},{"num":27,"verse":"‘tekel’—you have been weighed on the scales [of righteousness] and found deficient; "},{"num":28,"verse":"‘peres’—your kingdom has been divided and given over to the Medes and Persians.”"},{"num":29,"verse":"Then Belshazzar gave the command, and Daniel was clothed with purple and a chain of gold was put around his neck, and a proclamation concerning him was issued [declaring] that he now had authority as the third ruler in the kingdom."},{"num":30,"verse":"During that same night Belshazzar the [last] Chaldean king was slain [by troops of the invading army]. "},{"num":31,"verse":"So Darius the Mede received the kingdom; he was about the age of sixty-two."}]