[{"header":"Handwriting on the Wall"},{"num":5,"verse":"King Belshazzar held a great feast for 1,000 of his nobles and was drinking wine in front of the thousand. "},{"num":2,"verse":"When Belshazzar tasted the wine, he issued an order to bring in the gold and silver vessels that Nebuchadnezzar his father had taken out of the Temple in Jerusalem, so that the king and his nobles, his consorts and his concubines could drink from them. "},{"num":3,"verse":"So they brought the gold vessels that were taken out of the Temple of the House of God in Jerusalem, and the king and his nobles, consorts and concubines drank from them. "},{"num":4,"verse":"They drank the wine and praised the gods made of gold and silver, bronze, iron, wood and stone."},{"num":5,"verse":"At that very moment, the fingers of a human hand emerged and wrote on the plaster of the wall of the king’s palace opposite the lampstand, so that the king could see the back of the hand that was writing. "},{"num":6,"verse":"The color drained from the king’s face, his thoughts alarmed him, his hips gave way and his knees began knocking together."},{"num":7,"verse":"The king called loudly to summon the astrologers, the Chaldeans, and the diviners. The king said to the wise men of Babylon, “Whoever reads this writing and tells me what it means will be clothed in purple and have a gold chain around his neck, and will have authority as the third ruler in the kingdom!”"},{"num":8,"verse":"Then all the king’s wise men came in, but they could not read the inscription nor tell the king what it meant. "},{"num":9,"verse":"So King Belshazzar became even more terrified and his face grew pale. His nobles were baffled."},{"num":10,"verse":"The queen hearing the words of the king and his nobles entered the banquet hall. The queen spoke out and said, “May the king live forever! Do not let your thoughts frighten you, or your face be so pale! "},{"num":11,"verse":"There is a man in your kingdom who has the spirit of the holy gods in him. In the days of your father, he was found to have insight and intelligence, and wisdom like the wisdom of the gods. So King Nebuchadnezzar your father made him chief of the magicians, astrologers, Chaldeans and diviners. "},{"num":12,"verse":"This man Daniel, whom the king named Belteshazzar, was found to have extraordinary spirit, knowledge and insight for interpreting dreams, explaining riddles, and solving problems. Now, let Daniel be summoned and he will explain the interpretation.”"},{"num":13,"verse":"So Daniel was brought before the king and the king said to Daniel, “Are you Daniel who is one of the captives of Judah that my father the king brought from Judah? "},{"num":14,"verse":"I have heard about you, how a spirit of the gods is in you and how there has been found in you insight, discernment and extraordinary wisdom. "},{"num":15,"verse":"Just now the wise men and diviners were brought before me to read this writing and to make its meaning known to me, but they are unable to declare its interpretation. "},{"num":16,"verse":"However, I have heard about you that you are able to provide interpretations and to solve difficult problems. Now if you are able to read the writing and explain to me its meaning, you will be clothed in purple and have a gold chain around your neck and have the authority to rule as the third in the kingdom.”"},{"num":17,"verse":"Then Daniel answered the king saying, “You may keep your gifts for yourself and give your rewards to someone else. Nevertheless, I will read the writing to the king and tell him its meaning. "},{"num":18,"verse":"Your majesty, God Most High gave your father Nebuchadnezzar the kingdom, as well as greatness, glory, and splendor. "},{"num":19,"verse":"Because of the grandeur that He bestowed on him, all the peoples, nations and languages dreaded and feared him. He killed whomever he wanted and spared anyone he wanted; he raised up whomever he wished and humbled anyone he wished. "},{"num":20,"verse":"But when his heart became haughty and his spirit hardened with pride, he was deposed from his royal throne and stripped of his glory. "},{"num":21,"verse":"He was driven away from among men and his mind became like an animal, and his dwelling was with the wild asses; he fed on grass like an ox, and his body was damp with the dew of heaven until he recognized that God Most High is sovereign over the realm of mankind and that He sets up over it whomever He wills."},{"num":22,"verse":"“But you his son, Belshazzar, have not humbled your heart, even though you knew all this. "},{"num":23,"verse":"Instead you have exalted yourself against the Lord of heaven. You had the vessels of His House brought before you, and you and your nobles, your consorts and your concubines have been drinking wine in them. You have praised the gods made of silver and gold, of bronze, iron, wood and stone, which cannot see or hear or understand. Yet you did not honor the God who holds in His hand your very breath and all your ways. "},{"num":24,"verse":"Therefore, the hand was sent from Him that wrote this inscription."},{"num":25,"verse":"“Now this is the writing that was inscribed:"},{"num":26,"verse":"This is the interpretation of the inscription:"},{"num":27,"verse":"TEKEL: You have been weighed in the balances and found wanting."},{"num":28,"verse":"PERES: Your kingdom has been divided and given to the Medes and Persians.”"},{"num":29,"verse":"Then at Belshazzar’s command, they clothed Daniel with purple, put a chain of gold around his neck, and issued a proclamation about him that he would have the authority as third ruler in the kingdom."},{"num":30,"verse":"On that very night King Belshazzar of the Chaldeans was slain."}]