[{"header":"Jeremiah Is Set Free"},{"num":40,"verse":"The Lord spoke his word to Jeremiah. This was after Nebuzaradan, commander of the guards, had set Jeremiah free at the city of Ramah. He had found Jeremiah in Ramah bound in chains. He was with all the captives from Jerusalem and Judah. They were being taken away to Babylon. "},{"num":2,"verse":"When commander Nebuzaradan found Jeremiah, Nebuzaradan said to him, “The Lord your God announced this disaster would come to this place. "},{"num":3,"verse":"And now the Lord has done everything he said he would do. This disaster happened because the people of Judah sinned against the Lord. You people did not obey the Lord. "},{"num":4,"verse":"But now I will set you free. I am taking the chains off your wrists. If you want to, come with me to Babylon. And I will take good care of you. But if you don’t want to come, then don’t. Look, the whole country is open to you.” "},{"num":5,"verse":"Before Jeremiah turned to leave, Nebuzaradan said, “Or go back to Gedaliah son of Ahikam, the son of Shaphan. The king of Babylon has chosen Gedaliah to be governor over the towns of Judah. Go and live with Gedaliah among the people. Or go anywhere you want.”"},{"num":6,"verse":"So Jeremiah went to Gedaliah son of Ahikam at Mizpah. And Jeremiah stayed with him there. He lived among the people who were left behind in Judah."},{"header":"The Short Rule of Gedaliah"},{"num":7,"verse":"There were some officers and their men from the army of Judah. These men were still out in the open country. They heard that the king of Babylon had put Gedaliah son of Ahikam in charge. He was put in charge of the people who were left in the land: the men, women and children who were very poor. They were the ones who were not carried off to Babylon as captives. "},{"num":8,"verse":"So these soldiers came to Gedaliah at Mizpah. They were Ishmael son of Nethaniah, and Johanan and Jonathan sons of Kareah. Also Seraiah son of Tanhumeth and the sons of Ephai the Netophathite came. And Jaazaniah son of the Maacathite and their men came."},{"num":9,"verse":"Gedaliah son of Ahikam, the son of Shaphan, made a promise to them. Gedaliah said, “Do not be afraid to serve the Babylonians. Live in the land and serve the king of Babylon. Then everything will go well for you. "},{"num":10,"verse":"I myself will live in Mizpah. I will speak for you before the Babylonians who come here. You harvest the wine, the summer fruit and the oil. Put what you harvest in your storage jars. Live in the towns you control.”"},{"num":11,"verse":"Some Jews were in Moab, Ammon, Edom and other countries. They heard that the king of Babylon had left a few Jews alive in the land. And they heard the king of Babylon had chosen Gedaliah as governor over them. (Gedaliah was the son of Ahikam, the son of Shaphan.) "},{"num":12,"verse":"When the people of Judah heard this news, they came back to Judah. They came back to Gedaliah at Mizpah. They came from all the countries where they had been scattered. They gathered a large harvest of wine and summer fruit."},{"num":13,"verse":"Johanan son of Kareah came to Gedaliah at Mizpah. All the army officers of Judah still in the open country also came. "},{"num":14,"verse":"Johanan and the officers with him said to Gedaliah, “Don’t you know that Baalis king of the Ammonite people wants you dead? He has sent Ishmael son of Nethaniah to kill you.” But Gedaliah son of Ahikam did not believe them."},{"num":15,"verse":"Then Johanan son of Kareah spoke to Gedaliah in private at Mizpah. He said to Gedaliah, “Let me go and kill Ishmael son of Nethaniah. No one will know anything about it. We should not let Ishmael kill you. All the Jews gathered around you would be scattered to different countries again. Then the few people of Judah who are left alive would be lost.”"},{"num":16,"verse":"But Gedaliah son of Ahikam said to Johanan son of Kareah, “Do not kill Ishmael! The things you are saying about Ishmael are not true!”"}]