[{"header":"Jeremiah Is Set Free"},{"num":40,"verse":"The Lord spoke his word to Jeremiah after Nebuzaradan, commander of the guards, had set Jeremiah free at the city of Ramah. He had found Jeremiah in Ramah bound in chains with all the captives from Jerusalem and Judah who were being taken away to Babylon. "},{"num":2,"verse":"When commander Nebuzaradan found Jeremiah, Nebuzaradan said to him, “The Lord your God announced this disaster would come to this place. "},{"num":3,"verse":"And now the Lord has done everything he said he would do. This disaster happened because the people of Judah sinned against the Lord and did not obey him. "},{"num":4,"verse":"But today I am freeing you from the chains on your wrists. If you want to, come with me to Babylon, and I will take good care of you. But if you don’t want to come, then don’t. Look, the whole country is open to you. Go wherever you wish.” "},{"num":5,"verse":"Before Jeremiah turned to leave, Nebuzaradan said, “Or go back to Gedaliah son of Ahikam, the son of Shaphan. The king of Babylon has chosen him to be governor over the towns of Judah. Go and live with Gedaliah among the people, or go anywhere you want.”"},{"num":6,"verse":"So Jeremiah went to Gedaliah son of Ahikam at Mizpah and stayed with him there. He lived among the people who were left behind in Judah."},{"header":"The Short Rule of Gedaliah"},{"num":7,"verse":"Some officers and their men from the army of Judah were still out in the open country. They heard that the king of Babylon had put Gedaliah son of Ahikam in charge of the people who were left in the land: the men, women, and children who were the poorest. They were the ones who were not taken to Babylon as captives. "},{"num":8,"verse":"So these soldiers came to Gedaliah at Mizpah: Ishmael son of Nethaniah, Johanan and Jonathan sons of Kareah, Seraiah son of Tanhumeth, the sons of Ephai the Netophathite, Jaazaniah son of the Maacathite, and their men."},{"num":9,"verse":"Gedaliah son of Ahikam, the son of Shaphan, made a promise to them, saying, “Do not be afraid to serve the Babylonians. Stay in the land and serve the king of Babylon. Then everything will go well for you. "},{"num":10,"verse":"I myself will live in Mizpah and will speak for you before the Babylonians who come to us here. Harvest the wine, the summer fruit, and the oil, and put what you harvest in your storage jars. Live in the towns you control.”"},{"num":11,"verse":"The Jews in Moab, Ammon, Edom, and other countries also heard that the king of Babylon had left a few Jews alive in the land. And they heard the king of Babylon had chosen Gedaliah as governor over them. (Gedaliah was the son of Ahikam, the son of Shaphan.) "},{"num":12,"verse":"When the people of Judah heard this news, they came back to Judah from all the countries where they had been scattered. They came to Gedaliah at Mizpah and gathered a large harvest of wine and summer fruit."},{"num":13,"verse":"Johanan son of Kareah and all the army officers of Judah still in the open country came to Gedaliah at Mizpah. "},{"num":14,"verse":"They said to him, “Don’t you know that Baalis king of the Ammonite people wants you dead? He has sent Ishmael son of Nethaniah to kill you.” But Gedaliah son of Ahikam did not believe them."},{"num":15,"verse":"Then Johanan son of Kareah spoke to Gedaliah in private at Mizpah. He said, “Let me go and kill Ishmael son of Nethaniah. No one will know anything about it. We should not let Ishmael kill you. Then all the Jews gathered around you would be scattered to different countries again, and the few people of Judah who are left alive would be lost.”"},{"num":16,"verse":"But Gedaliah son of Ahikam said to Johanan son of Kareah, “Do not kill Ishmael! The things you are saying about Ishmael are not true.”"}]