[{"header":"Jeremiah Free to Go"},{"num":40,"verse":"This is the word which came to Jeremiah from the Lord after Nebuzaradan, captain of the prison soldiers, had let him go from Ramah. He had taken him there in chains with all the other people of Jerusalem and Judah who were being taken to Babylon. "},{"num":2,"verse":"The captain of the prison soldiers took Jeremiah and said to him, “The Lord your God promised this trouble against this place. "},{"num":3,"verse":"The Lord has brought it about, and has done just as He promised. This thing has happened to you because you people sinned against the Lord and did not listen to Him. "},{"num":4,"verse":"But now I am setting you free today from the chains on your hands. If you would like to come with me to Babylon, then come, and I will see that it goes well with you. But if you do not want to come with me to Babylon, do not come. See, the whole land is before you. Go where you think it is good and right for you to go. "},{"num":5,"verse":"If you stay, then go back to Gedaliah the son of Ahikam, the son of Shaphan, whom the king of Babylon has set over the cities of Judah. Stay with him among the people. Or go where you think it is right to go.” Then the captain of the prison soldiers gave him a share of food and a gift, and let him go. "},{"num":6,"verse":"So Jeremiah went to Mizpah, to Gedaliah the son of Ahikam. And he stayed with him among the people who were left in the land."},{"header":"Gedaliah Is Ruler of Judah"},{"num":7,"verse":"Now all the captains of the armies that were in the field and their men heard that the king of Babylon had chosen Gedaliah the son of Ahikam to rule over the land. The king had put him over the men, women and children who were the poorest of the land and had not been taken to Babylon. "},{"num":8,"verse":"So they came to Gedaliah at Mizpah. With them were Ishmael the son of Nethaniah, Johanan and Jonathan the sons of Kareah, Seraiah the son of Tanhumeth, the sons of Ephai the Netophathite, and Jezaniah the son of the Maacathite, together with their men. "},{"num":9,"verse":"Then Gedaliah the son of Ahikam, the son of Shaphan, made a promise to them and their men, saying, “Do not be afraid of serving the Babylonians. Stay in the land and serve the king of Babylon. Then it will go well with you. "},{"num":10,"verse":"As for me, I will stay at Mizpah to stand for you in front of the Babylonians who come to us. But as for you, gather wine and summer fruit and oil, and store them in your jars. And live in your cities that you have taken.” "},{"num":11,"verse":"All the Jews in Moab and Ammon and Edom, and in all the other countries, heard that the king of Babylon had left some of the people in Judah. They heard that he had chosen Gedaliah the son of Ahikam, the son of Shaphan, to rule over them. "},{"num":12,"verse":"Then all the Jews returned from all the places where they had been driven, and came to the land of Judah, to Gedaliah at Mizpah. And they gathered much wine and summer fruit."},{"header":"Gedaliah Is Killed"},{"num":13,"verse":"Now Johanan the son of Kareah and all the captains of the armies that were in the field came to Gedaliah at Mizpah. "},{"num":14,"verse":"They said to him, “Do you know that Baalis, the king of the sons of Ammon, has sent Ishmael the son of Nethaniah to kill you?” But Gedaliah the son of Ahikam did not believe them. "},{"num":15,"verse":"Then Johanan the son of Kareah said in secret to Gedaliah in Mizpah, “Let me go and kill Ishmael the son of Nethaniah, and no one will know about it. Why should he kill you? Then all the Jews who are gathered to you would go everywhere. And those of Judah who are left here would die.” "},{"num":16,"verse":"But Gedaliah the son of Ahikam said to Johanan the son of Kareah, “Do not do this. For you are telling a lie about Ishmael.”"}]