[{"num":1,"verse":"¶ I will love thee, O LORD, my strength."},{"num":2,"verse":"The LORD is my rock and my fortress, and my deliverer; my God, my strength, in whom I will trust; my buckler, and the horn of my salvation, and my high tower."},{"num":3,"verse":"I will call upon the LORD, who is worthy to be praised, so shall I be saved from my enemies."},{"num":4,"verse":"The pain of death compassed me, and the rivers of Belial made me afraid."},{"num":5,"verse":"The pain of Sheol compassed me about: the snares of death came before me."},{"num":6,"verse":"In my distress I called upon the LORD and cried unto my God; he heard my voice out of his temple, and my cry came before him, even into his ears."},{"num":7,"verse":"Then the earth shook and trembled; the foundations of the mountains collapsed and were removed because he was wroth."},{"num":8,"verse":"Smoke went up out of his nostrils, and fire devoured out of his mouth; coals were kindled by it."},{"num":9,"verse":"He lowered the heavens and came down; and darkness was under his feet."},{"num":10,"verse":"And he rode upon a cherub and flew: yea, he flew upon the wings of the wind."},{"num":11,"verse":"He made darkness his hiding place; in his tabernacle round about him were dark waters and thick clouds of the heavens."},{"num":12,"verse":"At the brightness that was before him his thick clouds passed, hail stones and coals of fire."},{"num":13,"verse":"The LORD thundered in the heavens, and the Highest gave his voice; hail stones and coals of fire."},{"num":14,"verse":"He sent out his arrows and scattered them; he shot out lightnings and destroyed them."},{"num":15,"verse":"Then the depths of the waters were seen, and the foundations of the world were discovered at thy rebuke, O LORD, at the blast of the breath of thy nostrils."},{"num":16,"verse":"He sent from above, he took me, he drew me out of many waters."},{"num":17,"verse":"He delivered me from my strong enemy, and from those who hated me, even though they were too strong for me."},{"num":18,"verse":"They were ready for me in the day of my calamity, but the LORD was my staff."},{"num":19,"verse":"He brought me forth also into a wide place; he delivered me because he delighted in me."},{"num":20,"verse":"¶ The LORD will reward me according to my righteousness; according to the cleanness of my hands he shall recompense me."},{"num":21,"verse":"Because I have kept the ways of the LORD and did not become wicked departing in apostasy from my God."},{"num":22,"verse":"For all his judgments were before me, and I did not put away his statutes from me."},{"num":23,"verse":"I was perfect before him, and I kept myself from my iniquity."},{"num":24,"verse":"Therefore the LORD has recompensed me according to my righteousness, according to the cleanness of my hands before his eyes."},{"num":25,"verse":"With the merciful thou wilt show thyself merciful; with a perfect man thou wilt show thyself perfect;"},{"num":26,"verse":"with the pure thou wilt show thyself pure; and with the perverse thou wilt show thyself adversary."},{"num":27,"verse":"Therefore thou wilt save the humble people; but wilt bring down high looks."},{"num":28,"verse":"For thou wilt light my fire: the LORD my God will enlighten my darkness."},{"num":29,"verse":"¶ For with thee I have scattered armies; and in my God I have overcome walled defenses."},{"num":30,"verse":"As for God, his way is perfect: the word of the LORD is precise: a shield to all those that wait in him."},{"num":31,"verse":"For who is God except the LORD? or who is a refuge except our God?"},{"num":32,"verse":"It is God that girds me with strength and makes my way perfect."},{"num":33,"verse":"He makes my feet like hinds’ feet and sets me upon my high places."},{"num":34,"verse":"He trains my hands for the battle, so that a bow of bronze shall be broken by my arms."},{"num":35,"verse":"In the same manner thou hast also given me the shield of thy salvation: and thy right hand will hold me up, and thy meekness shall multiply me."},{"num":36,"verse":"Thou shall enlarge my steps under me, and my knees shall not tremble."},{"num":37,"verse":"I shall pursue my enemies and overtake them: neither shall I turn again until they are consumed."},{"num":38,"verse":"I shall smite them, and they will not be able to rise: they shall fall under my feet."},{"num":39,"verse":"For thou hast girded me with strength unto the battle: thou hast subdued my enemies under me."},{"num":40,"verse":"Thou hast also given me the necks of my enemies that I might destroy those that hate me."},{"num":41,"verse":"They cried out, but there was no one to save them: even unto the LORD, but he did not answer them."},{"num":42,"verse":"Then I beat them as small as the dust before the wind: I scattered them as the dirt in the streets."},{"num":43,"verse":"Thou hast delivered me from the strivings of the people; and thou hast made me the head of the Gentiles: a people whom I did not know served me."},{"num":44,"verse":"As soon as they heard of me, they obeyed me: the sons of strangers submitted themselves unto me even against their will."},{"num":45,"verse":"The strangers fell away and were afraid in their close places."},{"num":46,"verse":"The LORD lives; and blessed be my rock; and let the God of my salvation be exalted."},{"num":47,"verse":"It is God that avenges me and subdues the peoples under me."},{"num":48,"verse":"He delivers me from my enemies: yea, thou liftest me up above those that rise up against me: thou hast delivered me from the one who would betray me."},{"num":49,"verse":"Therefore I will give thanks unto thee, O LORD, among the Gentiles and sing praises unto thy name."},{"num":50,"verse":"He gives great deliverance to his king and shows mercy to his anointed, to David, and to his seed for evermore."}]