[{"header":"A Prophecy Against Gog"},{"num":38,"verse":"And the word of the Lord came to me, saying: "},{"num":2,"verse":"Son of man, set your face against Gog of the land of Magog, the prince of Rosh, Meshek and Tubal, and prophesy against him, "},{"num":3,"verse":"and say: Thus says the Lord God: I am against you, O Gog, the prince of Rosh, Meshek and Tubal. "},{"num":4,"verse":"And I will turn you back and put hooks into your jaws, and I will bring you out, and all your army, horses, and horsemen, all of them clothed with all sorts of armor, even a great company with buckler and shield, all of them handling swords. "},{"num":5,"verse":"Persia, Ethiopia, and Put with them, all of them with shield and helmet. "},{"num":6,"verse":"I will do so to Gomer and all its troops, Beth Togarmah of the north quarters and all its troops, and many peoples with you."},{"num":7,"verse":"Be prepared and prepare yourself, you and all your companies that are assembled to you, and be a guard to them. "},{"num":8,"verse":"After many days you shall be called. In the latter years you shall come into the land that is restored from the sword, whose inhabitants have been gathered out of many peoples, against the mountains of Israel which had been always a waste. But its people were brought out of the nations, and they, all of them, are dwelling safely. "},{"num":9,"verse":"You shall ascend and come like a storm; you shall be like a cloud to cover the land, you and all your troops, and many peoples with you."},{"num":10,"verse":"Thus says the Lord God: It shall come to pass on that day that things shall come into your mind and you shall think an evil thought, "},{"num":11,"verse":"and you shall say, “I will go up against the land of unwalled villages. I will go against those who are at rest, that dwell safely, all of them dwelling without walls and having neither bars nor gates,” "},{"num":12,"verse":"to take spoil and to seize prey, to turn your hand against the desolate places that are now inhabited, and against the people who are gathered out of the nations, who have obtained livestock and goods, who dwell in the midst of the world. "},{"num":13,"verse":"Sheba and Dedan and the merchants of Tarshish with all its villages shall say to you, “Have you come to take spoil? Have you gathered your company to seize prey, to carry away silver and gold, to take away livestock and goods, to take great spoil?”"},{"num":14,"verse":"Therefore, son of man, prophesy and say to Gog: Thus says the Lord God: On that day when My people of Israel dwell safely, shall you not know it? "},{"num":15,"verse":"And you shall come from your place out of the north parts, you and many peoples with you, all of them riding on horses, a great company and a mighty army. "},{"num":16,"verse":"And you shall come up against My people of Israel as a cloud to cover the land. It shall come about in the latter days that I will bring you against My land so that the nations may know Me when I shall be sanctified in you, O Gog, before their eyes."},{"header":"Judgment on Gog"},{"num":17,"verse":"Thus says the Lord God: Are you he of whom I have spoken in former days by My servants the prophets of Israel, who prophesied in those days for many years that I would bring you against them? "},{"num":18,"verse":"And it shall come to pass at the same time when Gog comes against the land of Israel, says the Lord God, that My fury shall come up in My anger. "},{"num":19,"verse":"For in My jealousy and in the fire of My wrath I have spoken: Surely in that day there shall be a great earthquake in the land of Israel. "},{"num":20,"verse":"The fish of the sea and the fowl of the heavens and the beasts of the field and all creeping things that creep upon the earth and all the men who are upon the face of the earth shall shake at My presence, and the mountains shall be thrown down, and the steep places shall fall, and every wall shall fall to the ground. "},{"num":21,"verse":"I will call for a sword against him on all My mountains, says the Lord God. Every man’s sword shall be against his brother. "},{"num":22,"verse":"I will enter into judgment with him with pestilence and with blood. And I will rain upon him and upon his troops and upon the many peoples who are with him, an overflowing rain and hailstones, fire and brimstone. "},{"num":23,"verse":"Thus I will magnify Myself, and sanctify Myself, and I will be known in the eyes of many nations. Then they shall know that I am the Lord."}]