[{"header":"Words against Gog"},{"num":38,"verse":"The Word of the Lord came to me saying, "},{"num":2,"verse":"“Son of man, look toward Gog of the land of Magog, the leader of Rosh, Meshech, and Tubal, and speak against him. "},{"num":3,"verse":"Tell him, ‘The Lord God says, “I am against you, O Gog, leader of Rosh, Meshech, and Tubal. "},{"num":4,"verse":"I will turn you around, put hooks into your mouth, and bring you out with your whole army. Your horses and horsemen will be dressed for battle. The army will be very large, with all the men holding battle-coverings and waving swords. "},{"num":5,"verse":"Persia, Ethiopia, and Put will be with you, all with battlecoverings and head-coverings. "},{"num":6,"verse":"There will be Gomer with all its army, and Beth-togarmah from the farthest parts of the north with all its army. Many nations will be with you."},{"num":7,"verse":"“Get ready and keep ready, you and all the armies gathered around you, and watch over them. "},{"num":8,"verse":"After many days you will be called. In future years you will come into the land where people have been gathered from many nations and have lived without fear of war. You will come to the mountains of Israel, which had been a waste land for a long time. But its people were brought out from the nations, and all of them are living without fear. "},{"num":9,"verse":"You and all your army will come up against them like a storm. You will be like a cloud covering the land. Many nations will be with you.”"},{"num":10,"verse":"‘The Lord God says, “On that day, thoughts will come into your mind, and you will make a sinful plan. "},{"num":11,"verse":"You will say, ‘I will go up against the open country, where people are quiet and live in peace. They live in villages without walls and have no iron pieces or gates.’ "},{"num":12,"verse":"You will go to rob the land and fight in the waste places where people now live. You will go up against the people who were gathered from the nations and are rich with cattle and good things and who live at the center of the land. "},{"num":13,"verse":"Sheba and Dedan and the traders of Tarshish and all its villages will say to you, ‘Have you come to take prizes of war? Have you gathered your army to carry away silver and gold, cattle, good things, and many prizes of war?’”’"},{"num":14,"verse":"“So, son of man, speak in My name and tell Gog, ‘The Lord God says, “On that day when My people Israel are living in peace and without fear, will you not know it? "},{"num":15,"verse":"You will come from your place in the far north, and many nations will be with you. All of them will be riding on horses, a large and powerful army. "},{"num":16,"verse":"You will come up against My people Israel like a cloud covering the land. In the last days, O Gog, I will bring you against My land, so that the nations may know Me when I show Myself holy through you in front of their eyes.” "},{"num":17,"verse":"‘The Lord God says, “Are you the one I spoke of in the past, through My servants of Israel who spoke in My name? At that time they said for many years that I would bring you against them."},{"num":18,"verse":"“On the day when Gog comes against the land of Israel, I will become very angry,” says the Lord God. "},{"num":19,"verse":"“In My jealousy and in My burning anger I have said that on that day the earth will shake in the land of Israel. "},{"num":20,"verse":"The fish of the sea, the birds of the air, the wild animals of the field, all the animals that move upon the earth, and all the men on the earth will shake before Me. Mountains will be thrown down, the mountain sides will fall, and every wall will fall to the ground. "},{"num":21,"verse":"I will call for a sword against Gog on all My mountains,” says the Lord God. “His men will turn their swords against one another. "},{"num":22,"verse":"I will punish him with disease and with blood. I will send down a hard rain, hailstones, fire and sulphur upon him and his army and the many nations with him. "},{"num":23,"verse":"I will show the many nations that I am great and holy. And they will know that I am the Lord.”"}]