[{"num":38,"verse":"Here is another message to me from the Lord:"},{"num":2,"verse":"“Son of dust, face northward toward the land of Magog and prophesy against Gog* king of Meshech and Tubal. Tell him that the Lord God says: ‘I am against you, Gog. "},{"num":4,"verse":"I will put hooks into your jaws and pull you to your doom. I will mobilize your troops and armored cavalry and make you a mighty host, all fully armed. "},{"num":5,"verse":"Peras, Cush, Put shall join you too with all their weaponry, "},{"num":6,"verse":"and so shall Gomer and all his hordes and the armies of Togarmah from the distant north, as well as many others. "},{"num":7,"verse":"Be prepared! Stay mobilized. You are their leader, Gog!"},{"num":8,"verse":"“‘A long time from now you will be called to action. In distant years you will swoop down onto the land of Israel that will be lying in peace after the return of its people from many lands. "},{"num":9,"verse":"You and all your allies—a vast and awesome army—will roll down upon them like a storm and cover the land like a cloud. "},{"num":10,"verse":"For at that time an evil thought will have come to your mind. "},{"num":11,"verse":"You will have said, “Israel is an unprotected land of unwalled villages! I will march against her and destroy these people living in such confidence! "},{"num":12,"verse":"I will go to those once-desolate cities that are now filled with people again—those who have returned from all the nations—and I will capture vast amounts of loot and many slaves. For the people are rich with cattle now, and the whole earth revolves around them!”’"},{"num":13,"verse":"“But Sheba and Dedan and the merchant princes of Tarshish with whom she trades* will ask, ‘Who are you to rob them of silver and gold and drive away their cattle and seize their goods and make them poor?’”"},{"num":14,"verse":"The Lord God says to Gog: “When my people are living in peace in their land, then you will rouse yourself. "},{"num":15,"verse":"You will come from all over the north with your vast host of cavalry and cover the land like a cloud. This will happen in the distant future—in the latter years of history. I will bring you against my land, and my holiness will be vindicated in your terrible destruction before their eyes, so that all the nations will know that I am God.”"},{"num":17,"verse":"The Lord God says: “You are the one I spoke of long ago through the prophets of Israel, saying that after many years had passed, I would bring you against my people. "},{"num":18,"verse":"But when you come to destroy the land of Israel, my fury will rise! "},{"num":19,"verse":"For in my jealousy and blazing wrath, I promise a mighty shaking in the land of Israel on that day. "},{"num":20,"verse":"All living things shall quake in terror at my presence; mountains shall be thrown down; cliffs shall tumble; walls shall crumble to the earth. "},{"num":21,"verse":"I will summon every kind of terror against you,” says the Lord God, “and you will fight against yourselves in mortal combat! "},{"num":22,"verse":"I will fight you with sword, disease, torrential floods, great hailstones, fire, and brimstone! "},{"num":23,"verse":"Thus will I show my greatness and bring honor upon my name, and all the nations of the world will hear what I have done and know that I am God!"}]