[{"num":49,"verse":"To victory, a psalm to the sons of Korah. All ye folks, hear these things; all ye that dwell in the world, perceive with ears. (To victory, a song for the sons of Korah. All ye nations, hear these things; all ye who live in the world, listen!)"},{"num":2,"verse":"All the sons of earth, and the sons of men; together the rich man, and the poor into one. (All the sons and daughters of the earth, the sons and daughters of men; yea, the rich and the poor, together as one.)"},{"num":3,"verse":"My mouth shall speak wisdom; and the thinking of mine heart shall speak prudence."},{"num":4,"verse":"I shall bow down mine ear into a parable; I shall open my reason set forth in a psaltery. (I shall listen closely to a parable; then I shall set forth my understanding on a lute.)"},{"num":5,"verse":"Why shall I dread in the evil day? the wickedness of mine heel shall (en)compass me. (Why should I have fear, or be afraid, on the day of evil, when the wickedness of my enemies shall surround me?)"},{"num":6,"verse":"Which trust in their own virtue (They who trust in their wealth); and have glory in the multitude of their riches."},{"num":7,"verse":"A brother again-buyeth not, shall a man again-buy? and he shall not give to God his pleasing. (No one shall ever be able to redeem himself; he shall never be able to pay God the price that he asketh for him.)"},{"num":8,"verse":"And he shall not (be able to) give the price of ransom for his soul; and he shall travail into without end, (Yea, he shall never be able to pay the price of ransom for his own soul; even if he could work forever,)"},{"num":9,"verse":"and he shall live yet into the end. He shall not see perishing, (so that he would live forever, and not see perishing, or corruption.)"},{"num":10,"verse":"when he shall see wise men dying; the unwise man and the fool shall perish together. And they shall leave their riches to aliens; (For he seeth that the wise die; and that the foolish and the ignorant perish together with them. But they all leave their riches to others, even strangers;)"},{"num":11,"verse":"and the sepulchres of them be the houses of them without end. The tabernacles of them be in generation and in generation; they called their names in their lands. (and their tombs, or their graves, shall be their houses forever. Yea, their dwelling places for all generations; even though their lands were once called by their own names.)"},{"num":12,"verse":"A man/Man, when he was in honour, understood not; he is comparisoned to unwise beasts, and is made like to those. (For anyone, even when he hath been given great honour, liveth not forever; he is comparable to the unthinking beasts, and soon is made like them.)"},{"num":13,"verse":"This way of them is cause of stumbling to them; and afterward they shall please (al)together in their mouth. (Their way is a trap for themselves; and for all who seek to please them.)"},{"num":14,"verse":"As sheep they be put in hell; death shall gnaw them. And just men shall be lords of them in the morrowtide; and the help of them shall wax eld in hell, for the glory of them/from the glory of them. (Like sheep they go down to Sheol, or the land of the dead; and death shall gnaw on them. The righteous shall be their lords; and their bodies shall grow old, or rotten, in Sheol, so different from their days of glory.)"},{"num":15,"verse":"Nevertheless God shall again-buy my soul from the power of hell; when he shall take me. (But God shall redeem my soul; and he shall take me away from the power of Sheol, or the power of death.)"},{"num":16,"verse":"Dread thou not (Fear thou not), when a man is made rich; and when the glory of his house is multiplied."},{"num":17,"verse":"For when he shall die, he shall not take all things with him (he shall not take anything with him); and his glory shall not go down with him."},{"num":18,"verse":"For his soul shall be blessed in his life; he shall acknowledge to thee, when thou hast done well to him. (Even though his soul shall be blessed in this life; and people shall praise him, when he hath done well for himself.)"},{"num":19,"verse":"He shall enter till into the generations of his fathers; and till into without end he shall not see light. (He shall go to the generations of his forefathers; and none of them shall ever see the light again.)"},{"num":20,"verse":"A man/Man, when he was in honour, understood not; he is comparisoned to unwise beasts, and is made like to those. (Anyone, even when he hath been given great honour, liveth not forever; he is comparable to the unthinking beasts, and soon is made like them.)"}]