[{"num":22,"verse":"If you must choose, take a good name rather than great riches; for to be held in loving esteem is better than silver and gold."},{"num":2,"verse":"The rich and the poor are alike before the Lord who made them all."},{"num":3,"verse":"A prudent man foresees the difficulties ahead and prepares for them; the simpleton goes blindly on and suffers the consequences."},{"num":4,"verse":"True humility and respect for the Lord lead a man to riches, honor, and long life."},{"num":5,"verse":"The rebel walks a thorny, treacherous road; the man who values his soul will stay away."},{"num":6,"verse":"Teach a child to choose the right path, and when he is older, he will remain upon it."},{"num":7,"verse":"Just as the rich rule the poor, so the borrower is servant to the lender."},{"num":8,"verse":"The unjust tyrant will reap disaster, and his reign of terror shall end."},{"num":9,"verse":"Happy is the generous man, the one who feeds the poor."},{"num":10,"verse":"Throw out the mocker, and you will be rid of tension, fighting, and quarrels."},{"num":11,"verse":"He who values grace and truth is the king’s friend."},{"num":12,"verse":"The Lord preserves the upright but ruins the plans of the wicked."},{"num":13,"verse":"The lazy man is full of excuses. “I can’t go to work!” he says. “If I go outside, I might meet a lion in the street and be killed!”"},{"num":14,"verse":"A prostitute is a dangerous trap; those cursed of God are caught in it."},{"num":15,"verse":"A youngster’s heart is filled with rebellion, but punishment will drive it out of him."},{"num":16,"verse":"He who gains by oppressing the poor or by bribing the rich shall end in poverty."},{"num":17,"verse":"Listen to this wise advice; follow it closely, for it will do you good, and you can pass it on to others: Trust in the Lord."},{"num":20,"verse":"In the past, haven’t I been right? Then believe what I am telling you now and share it with others."},{"num":22,"verse":"Don’t rob the poor and sick! For the Lord is their defender. If you injure them, he will punish you."},{"num":24,"verse":"Keep away from angry, short-tempered men, lest you learn to be like them and endanger your soul."},{"num":26,"verse":"Unless you have the extra cash on hand, don’t countersign a note. Why risk everything you own? They’ll even take your bed!"},{"num":28,"verse":"Do not move the ancient boundary marks. That is stealing."},{"num":29,"verse":"Do you know a hard-working man? He shall be successful and stand before kings!"}]