[{"header":"Laws of Religious Festivals"},{"num":23,"verse":"The Lord spoke again to Moses, saying, "},{"num":2,"verse":"“Speak to the children of Israel and say to them, ‘The appointed times (established feasts) of the Lord which you shall proclaim as holy convocations—My appointed times are these:"},{"header":"The Sabbath"},{"num":3,"verse":"‘For six days work may be done, but the seventh day is the Sabbath of complete rest, a holy convocation (calling together). You shall not do any work [on that day]; it is the Sabbath of the Lord wherever you may be."},{"header":"The Passover and Unleavened Bread"},{"num":4,"verse":"‘These are the appointed times of the Lord, holy convocations which you shall proclaim at their appointed times: "},{"num":5,"verse":"The Lord’s Passover is on the fourteenth day of the first month at twilight. "},{"num":6,"verse":"The Feast of Unleavened Bread to the Lord is on the fifteenth day of the same month; for seven days you shall eat unleavened bread. "},{"num":7,"verse":"On the first day you shall have a holy convocation (calling together); you shall not do any laborious work [on that day]. "},{"num":8,"verse":"But you shall present an offering by fire to the Lord for seven days; on the seventh day there shall be a holy convocation; you shall not do any laborious work [on that day].’”"},{"header":"The Feast of First Fruits"},{"num":9,"verse":"Then the Lord spoke to Moses, saying, "},{"num":10,"verse":"“Speak to the children of Israel and say to them, ‘When you enter the land which I am giving you and reap its harvest, you shall bring the sheaf of the first fruits of your harvest to the priest. "},{"num":11,"verse":"He shall wave the sheaf before the Lord so that you may be accepted; the priest shall wave it on the day after the Sabbath. "},{"num":12,"verse":"Now on the day when you wave the sheaf you shall offer a male lamb one year old without blemish as a burnt offering to the Lord. "},{"num":13,"verse":"Its grain offering shall be two-tenths of an ephah of fine flour mixed with [olive] oil, an offering by fire to the Lord for a sweet and soothing aroma, with its drink offering [to be poured out], a fourth of a hin of wine. "},{"num":14,"verse":"You shall not eat any bread or roasted grain or new growth, until this same day when you bring in the offering to your God; it is a permanent statute throughout your generations wherever you may be."},{"header":"The Feast of Weeks"},{"num":15,"verse":"‘You shall count from the day after the Sabbath, from the day when you brought in the sheaf (tied bundle of grain) of the wave offering; there shall be seven complete Sabbaths (seven full weeks). "},{"num":16,"verse":"You shall count fifty days to the day after the seventh Sabbath; then you shall present a new grain offering to the Lord. "},{"num":17,"verse":"You shall bring in from your places two loaves of bread as a wave offering, made from two-tenths of an ephah of fine flour; they shall be baked with leaven as first fruits to the Lord. "},{"num":18,"verse":"And you shall offer with the bread seven unblemished lambs, one year old, and one young bull and two rams. They are to be a burnt offering to the Lord, with their grain offering and their drink offerings. It is an offering by fire, a sweet and soothing aroma to the Lord. "},{"num":19,"verse":"And you shall sacrifice one male goat as a sin offering and two male lambs, one year old as a sacrifice of peace offerings. "},{"num":20,"verse":"The priest shall wave them before the Lord as a wave offering, together with the bread of the first fruits and the two lambs. They are to be holy to the Lord for the priest. "},{"num":21,"verse":"On this same day you shall make a proclamation, you are to have a holy convocation (calling together); you shall not do any laborious work [on that day]. It is to be a permanent statute throughout your generations wherever you may be."},{"num":22,"verse":"‘When you reap the harvest of your land, you shall not reap to the edges of your field, nor gather the gleaning of your harvest; you are to leave them for the poor and for the stranger. I am the Lord your God.’”"},{"header":"The Feast of Trumpets"},{"num":23,"verse":"Again the Lord spoke to Moses, saying, "},{"num":24,"verse":"“Say to the children of Israel, ‘On the first day of the seventh month (almost October), you shall observe a day of solemn sabbatical rest, a memorial day announced by the blowing of trumpets, a holy convocation. "},{"num":25,"verse":"You shall not do any laborious work [on that day], but you shall present an offering by fire to the Lord.’”"},{"header":"The Day of Atonement"},{"num":26,"verse":"The Lord spoke to Moses, saying, "},{"num":27,"verse":"“Also the tenth day of this seventh month is the Day of Atonement; it shall be a holy convocation for you, and you shall humble yourselves [by fasting] and present an offering by fire to the Lord. "},{"num":28,"verse":"You shall not do any work on this same day, for it is the Day of Atonement, to make atonement on your behalf before the Lord your God. "},{"num":29,"verse":"If there is any person who will not humble himself on this same day, he shall be cut off from his people [excluding him from the atonement made for them]. "},{"num":30,"verse":"If there is any person who does any work on this same day, I will destroy that person from among his people. "},{"num":31,"verse":"You shall do no work at all [on that day]. It is a permanent statute throughout your generations wherever you may be. "},{"num":32,"verse":"It is to be to you a Sabbath of complete rest, and you shall humble yourselves. On the ninth day of the month at evening, from evening to evening you shall keep your Sabbath.”"},{"header":"The Feast of Booths"},{"num":33,"verse":"Again the Lord spoke to Moses, saying, "},{"num":34,"verse":"“Say to the children of Israel, ‘On the fifteenth day of this seventh month, and for seven days, is the Feast of Booths (Tabernacles) to the Lord. "},{"num":35,"verse":"The first day is a holy convocation (calling together); you shall not do any laborious work [on that day]. "},{"num":36,"verse":"For seven days you shall present an offering by fire to the Lord. On the eighth day you shall have a holy convocation and present an offering by fire to the Lord. It is a festive assembly; you shall not do any laborious work [on that day]."},{"num":37,"verse":"‘These are the appointed times (established feasts) of the Lord, which you shall proclaim to be holy convocations, to present an offering by fire to the Lord, a burnt offering and a grain offering, sacrifices and drink offerings, each on its own day. "},{"num":38,"verse":"This is in addition to the [weekly] Sabbaths of the Lord, and in addition to your gifts and all your vowed offerings and all your freewill offerings, which you give to the Lord."},{"num":39,"verse":"‘On exactly the fifteenth day of the seventh month (nearly October), when you have gathered in the crops of the land, you shall celebrate the feast of the Lord for seven days, with a Sabbath rest on the first day and a Sabbath rest on the eighth day. "},{"num":40,"verse":"Now on the first day you shall take for yourselves the foliage of beautiful trees, branches of palm trees, and boughs of thick (leafy) trees, and willows of the brook [and make booths of them]; and you shall rejoice before the Lord your God for seven days. "},{"num":41,"verse":"You shall celebrate it as a feast to the Lord for seven days in the year. It shall be a permanent statute throughout your generations; you shall celebrate it in the seventh month. "},{"num":42,"verse":"You shall live in booths (temporary shelters) for seven days; all native-born in Israel shall live in booths, "},{"num":43,"verse":"so that your generations may know that I had the sons of Israel live in booths when I brought them out of the land of Egypt. I am the Lord your God.’” "},{"num":44,"verse":"So Moses declared to the Israelites the appointed feasts of the Lord."}]