[{"num":23,"verse":"The Lord said to Moses,"},{"num":2,"verse":"Say to the Israelites, The set feasts or appointed seasons of the Lord which you shall proclaim as holy convocations, even My set feasts, are these:"},{"num":3,"verse":"Six days shall work be done, but the seventh day is the Sabbath of rest, a holy convocation or assembly by summons. You shall do no work on that day; it is the Sabbath of the Lord in all your dwellings."},{"num":4,"verse":"These are the set feasts or appointed seasons of the Lord, holy convocations you shall proclaim at their stated times:"},{"num":5,"verse":"On the fourteenth day of the first month at twilight is the Lord’s Passover."},{"num":6,"verse":"On the fifteenth day of the same month is the Feast of Unleavened Bread to the Lord; for seven days you shall eat unleavened bread."},{"num":7,"verse":"On the first day you shall have a holy “calling together;” you shall do no servile or laborious work on that day."},{"num":8,"verse":"But you shall offer an offering made by fire to the Lord for seven days; on the seventh day is a holy convocation; you shall do no servile or laborious work on that day."},{"num":9,"verse":"And the Lord said to Moses,"},{"num":10,"verse":"Tell the Israelites, When you have come into the land I give you and reap its harvest, you shall bring the sheaf of the firstfruits of your harvest to the priest."},{"num":11,"verse":"And he shall wave the sheaf before the Lord, that you may be accepted; on the next day after the Sabbath the priest shall wave it [before the Lord]."},{"num":12,"verse":"You shall offer on the day when you wave the sheaf a male lamb a year old without blemish for a burnt offering to the Lord."},{"num":13,"verse":"Its cereal offering shall be two-tenths of an ephah of fine flour mixed with oil, an offering made by fire to the Lord for a sweet, pleasing, and satisfying fragrance; and the drink offering of it [to be poured out] shall be of wine, a fourth of a hin."},{"num":14,"verse":"And you shall eat neither bread nor parched grain nor green ears, until this same day when you have brought the offering of your God; it is a statute forever throughout your generations in all your houses."},{"num":15,"verse":"And you shall count from the day after the Sabbath, from the day that you brought the sheaf of the wave offering, seven Sabbaths; [seven full weeks] shall they be."},{"num":16,"verse":"Count fifty days to the day after the seventh Sabbath; then you shall present a cereal offering of new grain to the Lord."},{"num":17,"verse":"You shall bring from your dwellings two loaves of bread to be waved, made from two-tenths of an ephah of fine flour; they shall be baked with leaven, for firstfruits to the Lord."},{"num":18,"verse":"And you shall offer with the bread seven lambs, a year old and without blemish, and one young bull and two rams. They shall be a burnt offering to the Lord, with their cereal offering and their drink offerings, an offering made by fire, of a sweet and satisfying fragrance to the Lord."},{"num":19,"verse":"Then you shall sacrifice one he-goat for a sin offering and two he-lambs, a year old, for a sacrifice of peace offering."},{"num":20,"verse":"The priest shall wave the two lambs, together with the bread of the firstfruits, for a wave offering before the Lord. They shall be holy to the Lord for the priest."},{"num":21,"verse":"You shall make proclamation the same day, summoning a holy assembly; you shall do no servile work that day. It shall be a statute forever in all your dwellings throughout your generations."},{"num":22,"verse":"And when you reap the harvest of your land, you shall not wholly reap the corners of your field, neither shall you gather the gleanings of your harvest; you shall leave them for the poor and the stranger. I am the Lord your God."},{"num":23,"verse":"And the Lord said to Moses,"},{"num":24,"verse":"Say to the Israelites, On the first day of the seventh month [almost October], you shall observe a day of solemn [sabbatical] rest, a memorial day announced by blowing of trumpets, a holy [called] assembly."},{"num":25,"verse":"You shall do no servile work on it, but you shall present an offering made by fire to the Lord."},{"num":26,"verse":"And the Lord said to Moses,"},{"num":27,"verse":"Also the tenth day of this seventh month is the Day of Atonement; it shall be a holy [called] assembly, and you shall afflict yourselves [by fasting in penitence and humility] and present an offering made by fire to the Lord."},{"num":28,"verse":"And you shall do no work on this day, for it is the Day of Atonement, to make atonement for you before the Lord your God."},{"num":29,"verse":"For whoever is not afflicted [by fasting in penitence and humility] on this day shall be cut off from among his people [that he may not be included in the atonement made for them]."},{"num":30,"verse":"And whoever does any work on that same day I will destroy from among his people."},{"num":31,"verse":"You shall do no kind of work [on that day]. It is a statute forever throughout your generations in all your dwellings."},{"num":32,"verse":"It shall be to you a sabbath of rest, and you shall afflict yourselves [by fasting in penitence and humility]. On the ninth day of the month from evening to evening you shall keep your sabbath."},{"num":33,"verse":"And the Lord said to Moses,"},{"num":34,"verse":"Say to the Israelites, The fifteenth day of this seventh month, and for seven days, is the Feast of Tabernacles or Booths to the Lord."},{"num":35,"verse":"On the first day shall be a holy convocation; you shall do no servile work on that day."},{"num":36,"verse":"For seven days you shall offer an offering made by fire to the Lord; on the eighth day shall be a holy convocation and you shall present an offering made by fire to the Lord. It is a solemn assembly; you shall do no laborious work on that day."},{"num":37,"verse":"These are the set feasts or appointed seasons of the Lord, which you shall proclaim to be holy convocations, to present an offering made by fire to the Lord, a burnt offering and a cereal offering, sacrifices and drink offerings, each on its own day."},{"num":38,"verse":"This is in addition to the Sabbaths of the Lord and besides your gifts and all your vowed offerings and all your freewill offerings which you give to the Lord."},{"num":39,"verse":"Also on the fifteenth day of the seventh month [nearly October], when you have gathered in the fruit of the land, you shall keep the feast of the Lord for seven days, the first day and the eighth day each a Sabbath."},{"num":40,"verse":"And on the first day you shall take the fruit of pleasing trees [and make booths of them], branches of palm trees, and boughs of thick (leafy) trees, and willows of the brook; and you shall rejoice before the Lord your God for seven days."},{"num":41,"verse":"You shall keep it as a feast to the Lord for seven days in the year, a statute forever throughout your generations; you shall keep it in the seventh month."},{"num":42,"verse":"You shall dwell in booths (shelters) for seven days: All native Israelites shall dwell in booths,"},{"num":43,"verse":"That your generations may know that I made the Israelites dwell in booths when I brought them out of the land of Egypt. I am the Lord your God."},{"num":44,"verse":"Thus Moses declared to the Israelites the set or appointed feasts of the Lord."}]