[{"header":"The Special Festivals"},{"num":23,"verse":"The Lord said to Moses,"},{"num":2,"verse":"“Tell the Israelites: You will announce the Lord’s chosen festivals as holy meetings. These are my special festivals."},{"header":"Sabbath"},{"num":3,"verse":"“Work for six days, but the seventh day, the Sabbath, will be a special day of rest, a holy meeting. You must not do any work. It is a day of rest to honor the Lord in all your homes."},{"header":"Passover"},{"num":4,"verse":"“These are the Lord’s chosen festivals. You will announce the holy meetings at the times chosen for them."},{"num":5,"verse":"The Lord’s Passover is on the 14th day of the first month just before dark."},{"header":"Festival of Unleavened Bread"},{"num":6,"verse":"“The Lord’s Festival of Unleavened Bread is on the 15th day of the same month. You will eat unleavened bread for seven days."},{"num":7,"verse":"On the first day of this festival, you will have a special meeting. You must not do any work on that day."},{"num":8,"verse":"For seven days, you will bring sacrifices offered as gifts to the Lord. Then there will be another special meeting on the seventh day. You must not do any work on that day.”"},{"header":"Festival of the First Harvests"},{"num":9,"verse":"The Lord said to Moses,"},{"num":10,"verse":"“Tell the Israelites: You will enter the land that I will give you and reap its harvest. At that time you must bring in the first sheaf of your harvest to the priest."},{"num":11,"verse":"The priest will lift the sheaf to show it was offered before the Lord. Then you will be accepted. The priest will present the sheaf on Sunday morning."},{"num":12,"verse":"“On the day when you present the sheaf, you will offer a one-year-old male lamb. There must be nothing wrong with that lamb. That lamb will be a burnt offering to the Lord."},{"num":13,"verse":"You must also offer a grain offering of 16 cups of fine flour mixed with olive oil. You must also offer 1 quart of wine. The smell of that offering will please the Lord."},{"num":14,"verse":"You must not eat any of the new grain, or fruit, or bread made from the new grain until you bring that offering to your God. This law will always continue through your generations, wherever you live."},{"header":"Festival of Harvest"},{"num":15,"verse":"“From that Sunday morning (the day you bring the sheaf to be presented to God), count seven weeks."},{"num":16,"verse":"On the Sunday following the seventh week (that is, 50 days later), you will bring a new grain offering to the Lord."},{"num":17,"verse":"On that day bring two loaves of bread from your homes. That bread will be lifted up to show it was offered to God. Use yeast and 16 cups of flour to make those loaves of bread. That will be your gift to the Lord from your first harvest."},{"num":18,"verse":"“With these grain offerings bring one bull, one ram, and seven one-year-old male lambs for burnt offerings to the Lord. There must be nothing wrong with these animals. Offer them together with the grain offerings and the drink offerings. The smell of these offerings made by fire will be pleasing to the Lord."},{"num":19,"verse":"You will also offer one male goat for a sin offering and two one-year-old male lambs as a fellowship offering."},{"num":20,"verse":"“The priest will lift them up with the bread from the first harvest to show they were offered with the two lambs before the Lord. They are holy to the Lord. They will belong to the priest."},{"num":21,"verse":"On that same day you will call a holy meeting. You must not do any work. This law continues forever in all your homes."},{"num":22,"verse":"“Also, when you harvest the crops on your land, don’t cut all the way to the corners of your field. Don’t pick up the grain that falls on the ground. Leave it for poor people and for foreigners traveling through your country. I am the Lord your God.”"},{"header":"Festival of Trumpets"},{"num":23,"verse":"Again the Lord said to Moses,"},{"num":24,"verse":"“Tell the Israelites: On the first day of the seventh month, you must have a special day of rest. Blow the trumpet to remind the people that this is a holy meeting."},{"num":25,"verse":"You must not do any work. You must bring an offering as a gift to the Lord.”"},{"header":"Day of Atonement"},{"num":26,"verse":"The Lord said to Moses,"},{"num":27,"verse":"“The Day of Atonement will be on the tenth day of the seventh month. There will be a holy meeting. You must not eat food, and you must bring an offering as a gift to the Lord."},{"num":28,"verse":"You must not do any work on that day, because it is the Day of Atonement. On that day the priests will go before the Lord and perform the ceremony that makes you pure."},{"num":29,"verse":"“Anyone who refuses to fast on this day must be separated from their people."},{"num":30,"verse":"If anyone does any work on this day, I will destroy that person from among the people."},{"num":31,"verse":"You must not do any work at all. This is a law that continues forever for you, wherever you live."},{"num":32,"verse":"It will be a special day of rest for you. You must not eat food. You will start this special day of rest on the evening following the ninth day of the month. This special day of rest continues from that evening until the next evening.”"},{"header":"Festival of Shelters"},{"num":33,"verse":"Again the Lord said to Moses,"},{"num":34,"verse":"“Tell the Israelites: On the 15th day of the seventh month is the Festival of Shelters. This festival to the Lord will continue for seven days."},{"num":35,"verse":"There will be a holy meeting on the first day. You must not do any work."},{"num":36,"verse":"You will bring offerings as gifts to the Lord for seven days. On the eighth day, you will have another holy meeting. You must not do any work. You will bring an offering as a gift to the Lord."},{"num":37,"verse":"“These are the Lord’s special festivals. There will be holy meetings during these festivals. You will bring offerings as gifts to the Lord—burnt offerings, grain offerings, sacrifices, and drink offerings. You will bring these gifts at the right time."},{"num":38,"verse":"You will celebrate these festivals in addition to remembering the Lord’s Sabbath days. You will offer these gifts in addition to your other gifts and any offerings you give as payment for your special promises. They will be in addition to any special offerings you want to give to the Lord."},{"num":39,"verse":"“On the 15th day of the seventh month, when you have gathered in the crops of the land, you will celebrate the Lord’s festival for seven days. The first day will be a special day of rest, and then the eighth day will also be a special day of rest."},{"num":40,"verse":"On the first day you will take good fruit from fruit trees. And you will take branches from palm trees, poplar trees, and willow trees by the brook. You will celebrate before the Lord your God for seven days."},{"num":41,"verse":"You will celebrate this festival to the Lord for seven days each year. This law will continue forever. You will celebrate this festival in the seventh month."},{"num":42,"verse":"You will live in temporary shelters for seven days. All the people born in Israel will live in them."},{"num":43,"verse":"Why? So all your descendants will know that I made the Israelites live in temporary shelters during the time I brought them out of Egypt. I am the Lord your God.”"},{"num":44,"verse":"So Moses told the Israelites about all the special meetings to honor the Lord."}]