[{"header":"Chapter 23"},{"num":1,"verse":"Holy Days. The Lord said to Moses: "},{"num":2,"verse":"Speak to the Israelites and tell them: The following are the festivals of the Lord, which you shall declare holy days. These are my festivals:"},{"num":3,"verse":"For six days work may be done; but the seventh day is a sabbath of complete rest, a declared holy day; you shall do no work. It is the Lord’s sabbath wherever you dwell."},{"num":4,"verse":"Passover. These are the festivals of the Lord, holy days which you shall declare at their proper time. "},{"num":5,"verse":"The Passover of the Lord falls on the fourteenth day of the first month, at the evening twilight. "},{"num":6,"verse":"The fifteenth day of this month is the Lord’s feast of Unleavened Bread. For seven days you shall eat unleavened bread. "},{"num":7,"verse":"On the first of these days you will have a declared holy day; you shall do no heavy work. "},{"num":8,"verse":"On each of the seven days you shall offer an oblation to the Lord. Then on the seventh day you will have a declared holy day; you shall do no heavy work."},{"num":9,"verse":"The Lord said to Moses: "},{"num":10,"verse":"Speak to the Israelites and tell them: When you come into the land which I am giving you, and reap its harvest, you shall bring the first sheaf of your harvest to the priest, "},{"num":11,"verse":"who shall elevate the sheaf before the Lord that it may be acceptable on your behalf. On the day after the sabbath the priest shall do this. "},{"num":12,"verse":"On this day, when your sheaf is elevated, you shall offer to the Lord for a burnt offering an unblemished yearling lamb. "},{"num":13,"verse":"Its grain offering shall be two tenths of an ephah of bran flour mixed with oil, as a sweet-smelling oblation to the Lord; and its libation shall be a fourth of a hin of wine. "},{"num":14,"verse":"You shall not eat any bread or roasted grain or fresh kernels until this day, when you bring the offering for your God. This shall be a perpetual statute throughout your generations wherever you dwell."},{"num":15,"verse":"Pentecost. Beginning with the day after the sabbath, the day on which you bring the sheaf for elevation, you shall count seven full weeks; "},{"num":16,"verse":"you shall count to the day after the seventh week, fifty days. Then you shall present a new grain offering to the Lord. "},{"num":17,"verse":"For the elevated offering of your first-ripened fruits to the Lord, you shall bring with you from wherever you live two loaves of bread made of two tenths of an ephah of bran flour and baked with leaven. "},{"num":18,"verse":"Besides the bread, you shall offer to the Lord a burnt offering of seven unblemished yearling lambs, one bull of the herd, and two rams, along with their grain offering and libations, as a sweet-smelling oblation to the Lord. "},{"num":19,"verse":"One male goat shall be sacrificed as a purification offering, and two yearling lambs as a communion sacrifice. "},{"num":20,"verse":"The priest shall elevate them—that is, the two lambs—with the bread of the first-ripened fruits as an elevated offering before the Lord; these shall be sacred to the Lord and belong to the priest. "},{"num":21,"verse":"On this same day you shall make a proclamation: there shall be a declared holy day for you; no heavy work may be done. This shall be a perpetual statute through all your generations wherever you dwell."},{"num":22,"verse":"When you reap the harvest of your land, you shall not be so thorough that you reap the field to its very edge, nor shall you gather the gleanings of your harvest. These things you shall leave for the poor and the alien. I, the Lord, am your God."},{"num":23,"verse":"New Year’s Day. The Lord said to Moses: "},{"num":24,"verse":"Tell the Israelites: On the first day of the seventh month you will have a sabbath rest, with trumpet blasts as a reminder, a declared holy day; "},{"num":25,"verse":"you shall do no heavy work, and you shall offer an oblation to the Lord."},{"num":26,"verse":"The Day of Atonement. The Lord said to Moses: "},{"num":27,"verse":"Now the tenth day of this seventh month is the Day of Atonement. You will have a declared holy day. You shall humble yourselves and offer an oblation to the Lord. "},{"num":28,"verse":"On this day you shall not do any work, because it is the Day of Atonement, when atonement is made for you before the Lord, your God. "},{"num":29,"verse":"Those who do not humble themselves on this day shall be cut off from the people. "},{"num":30,"verse":"If anyone does any work on this day, I will remove that person from the midst of the people. "},{"num":31,"verse":"You shall do no work; this is a perpetual statute throughout your generations wherever you dwell; "},{"num":32,"verse":"it is a sabbath of complete rest for you. You shall humble yourselves. Beginning on the evening of the ninth of the month, you shall keep your sabbath from evening to evening."},{"num":33,"verse":"The Feast of Booths. The Lord said to Moses: "},{"num":34,"verse":"Tell the Israelites: The fifteenth day of this seventh month is the Lord’s feast of Booths, which shall continue for seven days. "},{"num":35,"verse":"On the first day, a declared holy day, you shall do no heavy work. "},{"num":36,"verse":"For seven days you shall offer an oblation to the Lord, and on the eighth day you will have a declared holy day. You shall offer an oblation to the Lord. It is the festival closing. You shall do no heavy work."},{"num":37,"verse":"These, therefore, are the festivals of the Lord which you shall declare holy days, in order to offer as an oblation to the Lord burnt offerings and grain offerings, sacrifices and libations, as prescribed for each day, "},{"num":38,"verse":"in addition to the Lord’s sabbaths, your donations, your various votive offerings, and the voluntary offerings that you present to the Lord."},{"num":39,"verse":"On the fifteenth day, then, of the seventh month, when you have gathered in the produce of the land, you shall celebrate the feast of the Lord for a whole week. The first and the eighth day shall be days of rest. "},{"num":40,"verse":"On the first day you shall gather fruit of majestic trees, branches of palms, and boughs of leafy trees and valley willows. Then for a week you shall make merry before the Lord, your God. "},{"num":41,"verse":"You shall keep this feast of the Lord for one whole week in the year. By perpetual statute throughout your generations in the seventh month of the year, you shall keep it. "},{"num":42,"verse":"You shall dwell in booths for seven days; every native-born Israelite shall dwell in booths, "},{"num":43,"verse":"that your descendants may realize that, when I led the Israelites out of the land of Egypt, I made them dwell in booths. I, the Lord, am your God."},{"num":44,"verse":"Thus did Moses announce to the Israelites the festivals of the Lord."}]