[[],[{"type":"header","content":"The Appointed Festivals"},{"type":"prose","content":"The  said to Moses,"}],[{"type":"prose","content":"“Give the following instructions to the people of Israel. These are the ’s appointed festivals, which you are to proclaim as official days for holy assembly."}],[{"type":"prose","content":"“You have six days each week for your ordinary work, but the seventh day is a Sabbath day of complete rest, an official day for holy assembly. It is the ’s Sabbath day, and it must be observed wherever you live."}],[{"type":"prose","content":"“In addition to the Sabbath, these are the ’s appointed festivals, the official days for holy assembly that are to be celebrated at their proper times each year."},{"type":"header","content":"Passover and the Festival of Unleavened Bread"}],[{"type":"prose","content":"“The ’s Passover begins at sundown on the fourteenth day of the first month."}],[{"type":"prose","content":"On the next day, the fifteenth day of the month, you must begin celebrating the Festival of Unleavened Bread. This festival to the  continues for seven days, and during that time the bread you eat must be made without yeast."}],[{"type":"prose","content":"On the first day of the festival, all the people must stop their ordinary work and observe an official day for holy assembly."}],[{"type":"prose","content":"For seven days you must present special gifts to the . On the seventh day the people must again stop all their ordinary work to observe an official day for holy assembly.”"},{"type":"header","content":"Celebration of First Harvest"}],[{"type":"prose","content":"Then the  said to Moses,"}],[{"type":"prose","content":"“Give the following instructions to the people of Israel. When you enter the land I am giving you and you harvest its first crops, bring the priest a bundle of grain from the first cutting of your grain harvest."}],[{"type":"prose","content":"On the day after the Sabbath, the priest will lift it up before the  so it may be accepted on your behalf."}],[{"type":"prose","content":"On that same day you must sacrifice a one-year-old male lamb with no defects as a burnt offering to the ."}],[{"type":"prose","content":"With it you must present a grain offering consisting of four quarts of choice flour moistened with olive oil. It will be a special gift, a pleasing aroma to the . You must also offer one quart of wine as a liquid offering."}],[{"type":"prose","content":"Do not eat any bread or roasted grain or fresh kernels on that day until you bring this offering to your God. This is a permanent law for you, and it must be observed from generation to generation wherever you live."},{"type":"header","content":"The Festival of Harvest"}],[{"type":"prose","content":"“From the day after the Sabbath—the day you bring the bundle of grain to be lifted up as a special offering—count off seven full weeks."}],[{"type":"prose","content":"Keep counting until the day after the seventh Sabbath, fifty days later. Then present an offering of new grain to the ."}],[{"type":"prose","content":"From wherever you live, bring two loaves of bread to be lifted up before the  as a special offering. Make these loaves from four quarts of choice flour, and bake them with yeast. They will be an offering to the  from the first of your crops."}],[{"type":"prose","content":"Along with the bread, present seven one-year-old male lambs with no defects, one young bull, and two rams as burnt offerings to the . These burnt offerings, together with the grain offerings and liquid offerings, will be a special gift, a pleasing aroma to the ."}],[{"type":"prose","content":"Then you must offer one male goat as a sin offering and two one-year-old male lambs as a peace offering."}],[{"type":"prose","content":"“The priest will lift up the two lambs as a special offering to the , together with the loaves representing the first of your crops. These offerings, which are holy to the , belong to the priests."}],[{"type":"prose","content":"That same day will be proclaimed an official day for holy assembly, a day on which you do no ordinary work. This is a permanent law for you, and it must be observed from generation to generation wherever you live."}],[{"type":"prose","content":"“When you harvest the crops of your land, do not harvest the grain along the edges of your fields, and do not pick up what the harvesters drop. Leave it for the poor and the foreigners living among you. I am the  your God.”"},{"type":"header","content":"The Festival of Trumpets"}],[{"type":"prose","content":"The  said to Moses,"}],[{"type":"prose","content":"“Give the following instructions to the people of Israel. On the first day of the appointed month in early autumn, you are to observe a day of complete rest. It will be an official day for holy assembly, a day commemorated with loud blasts of a trumpet."}],[{"type":"prose","content":"You must do no ordinary work on that day. Instead, you are to present special gifts to the .”"},{"type":"header","content":"The Day of Atonement"}],[{"type":"prose","content":"Then the  said to Moses,"}],[{"type":"prose","content":"“Be careful to celebrate the Day of Atonement on the tenth day of that same month—nine days after the Festival of Trumpets. You must observe it as an official day for holy assembly, a day to deny yourselves and present special gifts to the ."}],[{"type":"prose","content":"Do no work during that entire day because it is the Day of Atonement, when offerings of purification are made for you, making you right with the  your God."}],[{"type":"prose","content":"All who do not deny themselves that day will be cut off from God’s people."}],[{"type":"prose","content":"And I will destroy anyone among you who does any work on that day."}],[{"type":"prose","content":"You must not do any work at all! This is a permanent law for you, and it must be observed from generation to generation wherever you live."}],[{"type":"prose","content":"This will be a Sabbath day of complete rest for you, and on that day you must deny yourselves. This day of rest will begin at sundown on the ninth day of the month and extend until sundown on the tenth day.”"},{"type":"header","content":"The Festival of Shelters"}],[{"type":"prose","content":"And the  said to Moses,"}],[{"type":"prose","content":"“Give the following instructions to the people of Israel. Begin celebrating the Festival of Shelters on the fifteenth day of the appointed month—five days after the Day of Atonement. This festival to the  will last for seven days."}],[{"type":"prose","content":"On the first day of the festival you must proclaim an official day for holy assembly, when you do no ordinary work."}],[{"type":"prose","content":"For seven days you must present special gifts to the . The eighth day is another holy day on which you present your special gifts to the . This will be a solemn occasion, and no ordinary work may be done that day."}],[{"type":"prose","content":"(“These are the ’s appointed festivals. Celebrate them each year as official days for holy assembly by presenting special gifts to the —burnt offerings, grain offerings, sacrifices, and liquid offerings—each on its proper day."}],[{"type":"prose","content":"These festivals must be observed in addition to the ’s regular Sabbath days, and the offerings are in addition to your personal gifts, the offerings you give to fulfill your vows, and the voluntary offerings you present to the .)"}],[{"type":"prose","content":"“Remember that this seven-day festival to the —the Festival of Shelters—begins on the fifteenth day of the appointed month, after you have harvested all the produce of the land. The first day and the eighth day of the festival will be days of complete rest."}],[{"type":"prose","content":"On the first day gather branches from magnificent trees—palm fronds, boughs from leafy trees, and willows that grow by the streams. Then celebrate with joy before the  your God for seven days."}],[{"type":"prose","content":"You must observe this festival to the  for seven days every year. This is a permanent law for you, and it must be observed in the appointed month from generation to generation."}],[{"type":"prose","content":"For seven days you must live outside in little shelters. All native-born Israelites must live in shelters."}],[{"type":"prose","content":"This will remind each new generation of Israelites that I made their ancestors live in shelters when I rescued them from the land of Egypt. I am the  your God.”"}],[{"type":"prose","content":"So Moses gave the Israelites these instructions regarding the annual festivals of the ."}]]