[[],[{"type":"header","content":"Appointed Festivals"},{"type":"prose","content":"The  spoke to Moses, saying: "}],[{"type":"prose","content":"Speak to the people of Israel and say to them: These are the appointed festivals of the  that you shall proclaim as holy convocations, my appointed festivals."},{"type":"header","content":"The Sabbath, Passover, and Unleavened Bread"}],[{"type":"prose","content":"Six days shall work be done; but the seventh day is a sabbath of complete rest, a holy convocation; you shall do no work: it is a sabbath to the  throughout your settlements."}],[{"type":"prose","content":"These are the appointed festivals of the , the holy convocations, which you shall celebrate at the time appointed for them. "}],[{"type":"prose","content":"In the first month, on the fourteenth day of the month, at twilight, there shall be a passover offering to the , "}],[{"type":"prose","content":"and on the fifteenth day of the same month is the festival of unleavened bread to the ; seven days you shall eat unleavened bread. "}],[{"type":"prose","content":"On the first day you shall have a holy convocation; you shall not work at your occupations. "}],[{"type":"prose","content":"For seven days you shall present the ’s offerings by fire; on the seventh day there shall be a holy convocation: you shall not work at your occupations."},{"type":"header","content":"The Offering of First Fruits"}],[{"type":"prose","content":"The  spoke to Moses: "}],[{"type":"prose","content":"Speak to the people of Israel and say to them: When you enter the land that I am giving you and you reap its harvest, you shall bring the sheaf of the first fruits of your harvest to the priest. "}],[{"type":"prose","content":"He shall raise the sheaf before the , that you may find acceptance; on the day after the sabbath the priest shall raise it. "}],[{"type":"prose","content":"On the day when you raise the sheaf, you shall offer a lamb a year old, without blemish, as a burnt offering to the . "}],[{"type":"prose","content":"And the grain offering with it shall be two-tenths of an ephah of choice flour mixed with oil, an offering by fire of pleasing odor to the ; and the drink offering with it shall be of wine, one-fourth of a hin. "}],[{"type":"prose","content":"You shall eat no bread or parched grain or fresh ears until that very day, until you have brought the offering of your God: it is a statute forever throughout your generations in all your settlements."},{"type":"header","content":"The Festival of Weeks"}],[{"type":"prose","content":"And from the day after the sabbath, from the day on which you bring the sheaf of the elevation offering, you shall count off seven weeks; they shall be complete. "}],[{"type":"prose","content":"You shall count until the day after the seventh sabbath, fifty days; then you shall present an offering of new grain to the . "}],[{"type":"prose","content":"You shall bring from your settlements two loaves of bread as an elevation offering, each made of two-tenths of an ephah; they shall be of choice flour, baked with leaven, as first fruits to the . "}],[{"type":"prose","content":"You shall present with the bread seven lambs a year old without blemish, one young bull, and two rams; they shall be a burnt offering to the , along with their grain offering and their drink offerings, an offering by fire of pleasing odor to the . "}],[{"type":"prose","content":"You shall also offer one male goat for a sin offering, and two male lambs a year old as a sacrifice of well-being. "}],[{"type":"prose","content":"The priest shall raise them with the bread of the first fruits as an elevation offering before the , together with the two lambs; they shall be holy to the  for the priest. "}],[{"type":"prose","content":"On that same day you shall make proclamation; you shall hold a holy convocation; you shall not work at your occupations. This is a statute forever in all your settlements throughout your generations."}],[{"type":"prose","content":"When you reap the harvest of your land, you shall not reap to the very edges of your field, or gather the gleanings of your harvest; you shall leave them for the poor and for the alien: I am the  your God."},{"type":"header","content":"The Festival of Trumpets"}],[{"type":"prose","content":"The  spoke to Moses, saying: "}],[{"type":"prose","content":"Speak to the people of Israel, saying: In the seventh month, on the first day of the month, you shall observe a day of complete rest, a holy convocation commemorated with trumpet blasts. "}],[{"type":"prose","content":"You shall not work at your occupations; and you shall present the ’s offering by fire."},{"type":"header","content":"The Day of Atonement"}],[{"type":"prose","content":"The  spoke to Moses, saying: "}],[{"type":"prose","content":"Now, the tenth day of this seventh month is the day of atonement; it shall be a holy convocation for you: you shall deny yourselves and present the ’s offering by fire; "}],[{"type":"prose","content":"and you shall do no work during that entire day; for it is a day of atonement, to make atonement on your behalf before the  your God. "}],[{"type":"prose","content":"For anyone who does not practice self-denial during that entire day shall be cut off from the people. "}],[{"type":"prose","content":"And anyone who does any work during that entire day, such a one I will destroy from the midst of the people. "}],[{"type":"prose","content":"You shall do no work: it is a statute forever throughout your generations in all your settlements. "}],[{"type":"prose","content":"It shall be to you a sabbath of complete rest, and you shall deny yourselves; on the ninth day of the month at evening, from evening to evening you shall keep your sabbath."},{"type":"header","content":"The Festival of Booths"}],[{"type":"prose","content":"The  spoke to Moses, saying: "}],[{"type":"prose","content":"Speak to the people of Israel, saying: On the fifteenth day of this seventh month, and lasting seven days, there shall be the festival of booths to the . "}],[{"type":"prose","content":"The first day shall be a holy convocation; you shall not work at your occupations. "}],[{"type":"prose","content":"Seven days you shall present the ’s offerings by fire; on the eighth day you shall observe a holy convocation and present the ’s offerings by fire; it is a solemn assembly; you shall not work at your occupations."}],[{"type":"prose","content":"These are the appointed festivals of the , which you shall celebrate as times of holy convocation, for presenting to the  offerings by fire—burnt offerings and grain offerings, sacrifices and drink offerings, each on its proper day— "}],[{"type":"prose","content":"apart from the sabbaths of the , and apart from your gifts, and apart from all your votive offerings, and apart from all your freewill offerings, which you give to the ."}],[{"type":"prose","content":"Now, the fifteenth day of the seventh month, when you have gathered in the produce of the land, you shall keep the festival of the , lasting seven days; a complete rest on the first day, and a complete rest on the eighth day. "}],[{"type":"prose","content":"On the first day you shall take the fruit of majestic trees, branches of palm trees, boughs of leafy trees, and willows of the brook; and you shall rejoice before the  your God for seven days. "}],[{"type":"prose","content":"You shall keep it as a festival to the  seven days in the year; you shall keep it in the seventh month as a statute forever throughout your generations. "}],[{"type":"prose","content":"You shall live in booths for seven days; all that are citizens in Israel shall live in booths, "}],[{"type":"prose","content":"so that your generations may know that I made the people of Israel live in booths when I brought them out of the land of Egypt: I am the  your God."}],[{"type":"prose","content":"Thus Moses declared to the people of Israel the appointed festivals of the ."}]]