[{"num":6,"verse":"Does any of you dare, when he has a matter of complaint against another [brother], to go to law before unrighteous men [men neither upright nor right with God, laying it before them] instead of before the saints (the people of God)?"},{"num":2,"verse":"Do you not know that the saints (the believers) will [one day] judge and govern the world? And if the world [itself] is to be judged and ruled by you, are you unworthy and incompetent to try [such petty matters] of the smallest courts of justice?"},{"num":3,"verse":"Do you not know also that we [Christians] are to judge the [very] angels and pronounce opinion between right and wrong [for them]? How much more then [as to] matters pertaining to this world and of this life only!"},{"num":4,"verse":"If then you do have such cases of everyday life to decide, why do you appoint [as judges to lay them before] those who [from the standpoint] of the church count for least and are without standing?"},{"num":5,"verse":"I say this to move you to shame. Can it be that there really is not one man among you who [in action is governed by piety and integrity and] is wise and competent enough to decide [the private grievances, disputes, and quarrels] between members of the brotherhood,"},{"num":6,"verse":"But brother goes to law against brother, and that before [Gentile judges who are] unbelievers [without faith or trust in the Gospel of Christ]?"},{"num":7,"verse":"Why, the very fact of your having lawsuits with one another at all is a defect (a defeat, an evidence of positive moral loss for you). Why not rather let yourselves suffer wrong and be deprived of what is your due? Why not rather be cheated (defrauded and robbed)?"},{"num":8,"verse":"But [instead it is you] yourselves who wrong and defraud, and that even your own brethren [by so treating them]!"},{"num":9,"verse":"Do you not know that the unrighteous and the wrongdoers will not inherit or have any share in the kingdom of God? Do not be deceived (misled): neither the impure and immoral, nor idolaters, nor adulterers, nor those who participate in homosexuality,"},{"num":10,"verse":"Nor cheats (swindlers and thieves), nor greedy graspers, nor drunkards, nor foulmouthed revilers and slanderers, nor extortioners and robbers will inherit or have any share in the kingdom of God."},{"num":11,"verse":"And such some of you were [once]. But you were washed clean (purified by a complete atonement for sin and made free from the guilt of sin), and you were consecrated (set apart, hallowed), and you were justified [pronounced righteous, by trusting] in the name of the Lord Jesus Christ and in the [Holy] Spirit of our God."},{"num":12,"verse":"Everything is permissible (allowable and lawful) for me; but not all things are helpful (good for me to do, expedient and profitable when considered with other things). Everything is lawful for me, but I will not become the slave of anything or be brought under its power."},{"num":13,"verse":"Food [is intended] for the stomach and the stomach for food, but God will finally end [the functions of] both and bring them to nothing. The body is not intended for sexual immorality, but [is intended] for the Lord, and the Lord [is intended] for the body [to save, sanctify, and raise it again]."},{"num":14,"verse":"And God both raised the Lord to life and will also raise us up by His power."},{"num":15,"verse":"Do you not see and know that your bodies are members (bodily parts) of Christ (the Messiah)? Am I therefore to take the parts of Christ and make [them] parts of a prostitute? Never! Never!"},{"num":16,"verse":"Or do you not know and realize that when a man joins himself to a prostitute, he becomes one body with her? The two, it is written, shall become one flesh."},{"num":17,"verse":"But the person who is united to the Lord becomes one spirit with Him."},{"num":18,"verse":"Shun immorality and all sexual looseness [flee from impurity in thought, word, or deed]. Any other sin which a man commits is one outside the body, but he who commits sexual immorality sins against his own body."},{"num":19,"verse":"Do you not know that your body is the temple (the very sanctuary) of the Holy Spirit Who lives within you, Whom you have received [as a Gift] from God? You are not your own,"},{"num":20,"verse":"You were bought with a price [purchased with a preciousness and paid for, made His own]. So then, honor God and bring glory to Him in your body."}]