[{"num":6,"verse":"Dare any of you, having a matter against another, go to be judged before the unjust, and not before the saints?"},{"num":2,"verse":"Know you not that the saints shall judge this world? And if the world shall be judged by you, are you unworthy to judge the smallest matters?"},{"num":3,"verse":"Know you not that we shall judge angels? how much more things of this world?"},{"num":4,"verse":"If therefore you have judgments of things pertaining to this world, set them to judge, who are the most despised in the church."},{"num":5,"verse":"I speak to your shame. Is it so that there is not among you any one wise man, that is able to judge between his brethren?"},{"num":6,"verse":"But brother goeth to law with brother, and that before unbelievers."},{"num":7,"verse":"Already indeed there is plainly a fault among you, that you have lawsuits one with another. Why do you not rather take wrong? Why do you not rather suffer yourselves to be defrauded?"},{"num":8,"verse":"But you do wrong and defraud, and that to your brethren."},{"num":9,"verse":"Know you not that the unjust shall not possess the kingdom of God? Do not err: neither fornicators, nor idolaters, nor adulterers,"},{"num":10,"verse":"Nor the effeminate, nor liers with mankind, nor thieves, nor covetous, nor drunkards, nor railers, nor extortioners, shall possess the kingdom of God."},{"num":11,"verse":"And such some of you were; but you are washed, but you are sanctified, but you are justified in the name of our Lord Jesus Christ, and the Spirit of our God."},{"num":12,"verse":"All things are lawful to me, but all things are not expedient. All things are lawful to me, but I will not be brought under the power of any."},{"num":13,"verse":"Meat for the belly, and the belly for the meats; but God shall destroy both it and them: but the body is not for fornication, but for the Lord, and the Lord for the body."},{"num":14,"verse":"Now God hath both raised up the Lord, and will raise us up also by his power."},{"num":15,"verse":"Know you not that your bodies are the members of Christ? Shall I then take the members of Christ, and make them the members of an harlot? God forbid."},{"num":16,"verse":"Or know you not, that he who is joined to a harlot, is made one body? For they shall be, saith he, two in one flesh."},{"num":17,"verse":"But he who is joined to the Lord, is one spirit."},{"num":18,"verse":"Fly fornication. Every sin that a man doth, is without the body; but he that committeth fornication, sinneth against his own body."},{"num":19,"verse":"Or know you not, that your members are the temple of the Holy Ghost, who is in you, whom you have from God; and you are not your own?"},{"num":20,"verse":"For you are bought with a great price. Glorify and bear God in your body."}]