[{"header":"Going to Court Against Christians"},{"num":6,"verse":"Why do you go to court when you have something against another Christian? You are asking people who are not Christians to judge who is guilty. You should go to those who belong to Christ and ask them. "},{"num":2,"verse":"Did you not know that those who belong to Christ will someday judge this world? If you judge the people of the world as guilty, are you not able to do this in small things? "},{"num":3,"verse":"Did you not know that we are to judge angels? So you should be able to take care of your problem here in this world without any trouble."},{"num":4,"verse":"When you have things to decide about this life, why do you go to men in courts who are not even Christians? "},{"num":5,"verse":"You should be ashamed! Is it true that there is not one person wise enough in your church to decide who is right when people argue? "},{"num":6,"verse":"Instead, one Christian takes another Christian to court. And that court is made up of people who are not Christians! "},{"num":7,"verse":"This shows you are wrong when you have to go to court against each other. Would it not be better to let someone do something against you that is wrong? Would it not be better to let them rob you? "},{"num":8,"verse":"Instead, you rob and do wrong to other Christians."},{"header":"The Body Is to Be Holy"},{"num":9,"verse":"Do you not know that sinful men will have no place in the holy nation of God? Do not be fooled. A person who does sex sins, or who worships false gods, or who is not faithful in marriage, or men who act like women, or people who do sex sins with their own sex, will have no place in the holy nation of God. "},{"num":10,"verse":"Also those who steal, or those who always want to get more of everything, or who get drunk, or who say bad things about others, or take things that are not theirs, will have no place in the holy nation of God. "},{"num":11,"verse":"Some of you were like that. But now your sins are washed away. You were set apart for God-like living to do His work. You were made right with God through our Lord Jesus Christ by the Spirit of our God."},{"num":12,"verse":"I am allowed to do all things, but not everything is good for me to do! Even if I am free to do all things, I will not do them if I think it would be hard for me to stop when I know I should. "},{"num":13,"verse":"Food was meant for the stomach. The stomach needs food, but God will bring to an end both food and the stomach. The body was not meant for sex sins. It was meant to work for the Lord. The Lord is for our body. "},{"num":14,"verse":"God raised the Lord from death. He will raise us from death by His power also."},{"header":"The Body Belongs to the Lord"},{"num":15,"verse":"Do you not know that your bodies are a part of Christ Himself? Am I to take a part of Christ and make it a part of a woman who sells the use of her body? No! Never! "},{"num":16,"verse":"Do you not know that a man who joins himself to a woman who sells the use of her body becomes a part of her? The Holy Writings say, “The two will become one.” "},{"num":17,"verse":"But if you join yourself to the Lord, you are one with Him in spirit."},{"num":18,"verse":"Have nothing to do with sex sins! Any other sin that a man does, does not hurt his own body. But the man who does a sex sin sins against his own body. "},{"num":19,"verse":"Do you not know that your body is a house of God where the Holy Spirit lives? God gave you His Holy Spirit. Now you belong to God. You do not belong to yourselves. "},{"num":20,"verse":"God bought you with a great price. So honor God with your body. You belong to Him."}]