[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) No doubt there is poetical hyperbole here, but for the enormous numbers of quails that are now caught, see the article quoted above.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "78:9-39. Sin dispirits men, and takes away the heart. Forgetfulness of God's works is the cause of disobedience to his laws. This narrative relates a struggle between God's goodness and man's badness. The Lord hears all our murmurings and distrusts, and is much displeased. Those that will not believe the power of God's mercy, shall feel the fire of his indignation. Those cannot be said to trust in God's salvation as their happiness at last, who can not trust his providence in the way to it. To all that by faith and prayer, ask, seek, and knock, these doors of heaven shall at any time be opened; and our distrust of God is a great aggravation of our sins. He expressed his resentment of their provocation; not in denying what they sinfully lusted after, but in granting it to them. Lust is contented with nothing. Those that indulge their lust, will never be estranged from it. Those hearts are hard indeed, that will neither be melted by the mercies of the Lord, nor broken by his judgments. Those that sin still, must expect to be in trouble still. And the reason why we live with so little comfort, and to so little purpose, is, because we do not live by faith. Under these rebukes they professed repentance, but they were not sincere, for they were not constant. In Israel's history we have a picture of our own hearts and lives. God's patience, and warnings, and mercies, imbolden them to harden their hearts against his word. And the history of kingdoms is much the same. Judgments and mercies have been little attended to, until the measure of their sins has been full. And higher advantages have not kept churches from declining from the commandments of God. Even true believers recollect, that for many a year they abused the kindness of Providence. When they come to heaven, how will they admire the Lord's patience and mercy in bringing them to his kingdom!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He rained flesh also upon them as dust - The flesh of quails, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word \"rained\" means that they seemed to come upon them like a copious shower. The word dust denotes their great abundance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And feathered fowls - Margin, as in Hebrew, \"fowl of wing.\" This is a poetic expression, designed to give beauty to the description by the image of their fluttering wings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Like as the sand of the sea - An expression also designed to denote their great numbers, Genesis 22:17; Genesis 32:12; Genesis 41:49; Joshua 11:4; 1 Samuel 13:5; Revelation 20:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Like as the sand of the sea - An expression also designed to denote their great numbers, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25. angels' food—literally, \"bread of the mighty\" (compare Ps 105:40); so called, as it came from heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "meat—literally, \"victuals,\" as for a journey.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Feathered fowls, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "winged fowl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which is noted to show that it was a supernatural work, whereby God took away from them the use of their wings, and made them to fall into the hands of the Israelites. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He rained flesh also upon them as dust,.... By \"flesh\" is meant fowl, as the following clause shows; for there is flesh of birds, as well as of other creatures, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the quails which are here meant may be very fitly called flesh, since they are, for their size, a very plump, fat, and fleshy bird: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and feathered fowls like as the sand of the sea; or \"fowl of wing\" (h): winged fowls, so the Targum; fowl that flies; and therefore it was the more remarkable that these should be rained and fall, and be taken by the Israelites; and which fell in great numbers, as is signified by these phrases, the dust and the sand of the sea; for there fell enough to feed six hundred thousand men, beside women and children, for a month together; they lay in heaps, two cubits high, on one another, and everyone that gathered them brought in ten homers; see Numbers 11:19, which is the history referred to; and quails are used to fly together in large bodies; and sometimes, as Pliny (i) relates, will light on ships at sea, and sink them with their numbers. Some think one sort of locusts is meant, which were used for food, and was very delicious food; and the circumstances of bringing them with an east or southeast wind, their falling in heaps, and being gathered in bushels, and spread about to be dried in the sun, seem to favour such a sense; See Gill on Numbers 11:19; see Gill on Numbers 11:20; see Gill on Numbers 11:21; see Gill on Numbers 11:31; see Gill on Numbers 11:32. The ancients interpret this mystically of the flesh of Christ, whose flesh is meat indeed, delicious food for faith, as the quails were a rich food; and as they were rained down from heaven, so Christ is the bread of life which came down from heaven, and the bread he gave for the life of the world was his flesh: and as these came up, however the first quails, in the evening, Exodus 16:13, so Christ came in the flesh, in the evening or end of the world, to put away sin by the sacrifice of himself; to which may be added, that these creatures sit upon their young, and cherish and protect them, as an hen her chickens (k) with which compare Matthew 23:37, but seeing the quails are never called spiritual meat, as the manna is, 1 Corinthians 10:3, but were given in wrath and judgment, they are rather an emblem of riches, or worldly goods, things given to carnal men; these are of God, as the quails were, and are by some persons enjoyed without care or trouble, as these were; their meat, as it is sometimes said, falls into their mouth, as these quails did into the mouths of the Israelites, as it were; and are in wrath, their blessings are cursed to them, and, while they have a great affluence of worldly things, have leanness in their souls, as the Israelites now had, Psalm 106:15, moreover, as these were feathered or winged fowl, so riches have wings, and sometimes flee away, and are very uncertain things to trust to, Proverbs 23:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and feathered fowls like as the sand of the sea; or \"fowl of wing\" (h): winged fowls, so the Targum; fowl that flies; and therefore it was the more remarkable that these should be rained and fall, and be taken by the Israelites; and which fell in great numbers, as is signified by these phrases, the dust and the sand of the sea; for there fell enough to feed six hundred thousand men, beside women and children, for a month together; they lay in heaps, two cubits high, on one another, and everyone that gathered them brought in ten homers; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is the history referred to; and quails are used to fly together in large bodies; and sometimes, as Pliny (i) relates, will light on ships at sea, and sink them with their numbers. Some think one sort of locusts is meant, which were used for food, and was very delicious food; and the circumstances of bringing them with an east or southeast wind, their falling in heaps, and being gathered in bushels, and spread about to be dried in the sun, seem to favour such a sense; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The ancients interpret this mystically of the flesh of Christ, whose flesh is meat indeed, delicious food for faith, as the quails were a rich food; and as they were rained down from heaven, so Christ is the bread of life which came down from heaven, and the bread he gave for the life of the world was his flesh: and as these came up, however the first quails, in the evening, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so Christ came in the flesh, in the evening or end of the world, to put away sin by the sacrifice of himself; to which may be added, that these creatures sit upon their young, and cherish and protect them, as an hen her chickens (k) with which compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 23:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but seeing the quails are never called spiritual meat, as the manna is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but were given in wrath and judgment, they are rather an emblem of riches, or worldly goods, things given to carnal men; these are of God, as the quails were, and are by some persons enjoyed without care or trouble, as these were; their meat, as it is sometimes said, falls into their mouth, as these quails did into the mouths of the Israelites, as it were; and are in wrath, their blessings are cursed to them, and, while they have a great affluence of worldly things, have leanness in their souls, as the Israelites now had, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 106:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", moreover, as these were feathered or winged fowl, so riches have wings, and sometimes flee away, and are very uncertain things to trust to, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h)  \"volucres alatas\", Tigurine version, Junius & Tremellius, Piscator, Cocceius. (i) Hist. l. 10. c. 23. (k) Arist. de Hist. Animal. l. 9. c. 8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h)  \"volucres alatas\", Tigurine version, Junius & Tremellius, Piscator, Cocceius. (i) Hist. l. 10. c. 23. (k) Arist. de Hist. Animal. l. 9. c. 8. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He rained flesh also upon them as dust, and feathered fowls like as the sand of the sea:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And he rained flesh upon them as the dust,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And winged fowl as the sand of the seas.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The sending of quails is connected, as in Exodus 16, with the sending of the manna; but the language of the Psalm follows the description of the second sending of quails in Numbers 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The verbs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 78:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " are the same as those in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 78:52",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:52",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "East",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "South",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are separated for the sake of rhythm. A S.E. wind brought up the quails from ‘the sea,’ i.e. the Red Sea. “The period when they were brought to the camp of Israel was in spring, when on their northward migration from Africa. According to their well-known instinct, they would follow up the coast of the Red Sea until they came to its bifurcation by the Sinaitic Peninsula, and then would cross at the narrow part.” Tristram, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nat. Hist. of Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 231.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He rained flesh also upon them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". With the expression, \"rained flesh,\" comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Behold, I will ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "rain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " bread from heaven;\" and see also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 9:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As dust;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"as thick as dust\" (Prayer book Version). The quails lay \"as it were two cubits high\" for the distance of a day's journey round about each encampment (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And feathered fowls like as the sand of the sea. The commonest image of multiplicity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Psalm 78:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Passing over to the giving of the quails, the poet is thinking chiefly of the first occasion mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which directly preceded the giving of the manna. But the description follows the second: יסּע (He caused to depart, set out) after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"East\" and \"south\" belong together: it was a south-east wind from the Aelanitic Gulf. \"To rain down\" is a figurative expression for a plentiful giving of dispensing from above. \"Its camp, its tents,\" are those of Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The תּעוה, occurring twice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:29-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of the object of strong desire, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), points to Kibroth-hattaavah, the scene of this carnal lusting; הביא is the transitive of the בּוא in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:30-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " even in the construction the poet closely follows ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. also זרוּ with לזרא, aversion, loathing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Waw unites what takes place simultaneously; a construction which presents the advantage of being able to give special prominence to the subject. The wrath of God consisted in the breaking out of a sickness which was the result of immoderate indulgence, and to which even the best-nourished and most youthfully vigorous fell a prey. When the poet goes on in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to say that in spite of these visitations (בּכל־זאת) they went on sinning, he has chiefly before his mind the outbreak of \"fat\" rebelliousness after the return of the spies, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refers to the judgment of death in the wilderness threatened at that time to all who had come out of Egypt from twenty years old and upward (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:28-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Their life devoted to death vanished from that time onwards בּהבל, in breath-like instability, and בּבּהלה, in undurable precipitancy; the mode of expression in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 36:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " suggests to the poet an expressive play of words. When now a special judgment suddenly and violently thinned the generation that otherwise was dying off, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., then they inquired after Him, they again sought His favour, those who were still preserved in the midst of this dying again remembered the God who had proved Himself to be a \"Rock\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and to be a \"Redeemer\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to them. And what next? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:36-37",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: According to the reckoning of the Masora this Psalm 78:36 is the middle verse of the 2527 verses of the Psalter (Buxtorf, Tiberias, 1620, p. 133).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: According to the reckoning of the Masora this ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is the middle verse of the 2527 verses of the Psalter (Buxtorf, Tiberias, 1620, p. 133).)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "tell us what effect they gave to this disposition to return to God. They appeased Him with their mouth, is meant to say: they sought to win Him over to themselves by fair speeches, inasmuch as they thus anthropopathically conceived of God, and with their tongue they played the hypocrite to Him; their heart, however, was not sincere towards Him (עם like את in Psalm 78:8), i.e., not directed straight towards Him, and they proved themselves not stedfast (πιστοί, or properly βέβαιοι) in their covenant-relationship to Him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "tell us what effect they gave to this disposition to return to God. They appeased Him with their mouth, is meant to say: they sought to win Him over to themselves by fair speeches, inasmuch as they thus anthropopathically conceived of God, and with their tongue they played the hypocrite to Him; their heart, however, was not sincere towards Him (עם like את in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., not directed straight towards Him, and they proved themselves not stedfast (πιστοί, or properly βέβαιοι) in their covenant-relationship to Him. ",
            "children": []
          }
        ]
      }
    ]
  }
]