[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(38) The verbs in the first clause should be in the present, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But he, the compassionate, forgives iniquity, and doth not destroy, and many a time he turned away, &c.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 78:38",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But he, being full of compassion — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Of pity for them amidst their sins and miseries; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forgave their iniquity — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not simply and absolutely, for in that sense it is undeniably certain from the Holy Scriptures, God pardons none but true penitents, such as these were not; but respectively, and so far as not to destroy them at that time, (which he had threatened to do,) as the next words limit and explain the expression. He remitted their punishment, for iniquity is often put for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "punishment ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of iniquity. Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "יכפר עון",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jechapper gnavon, he expiated ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "iniquity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He accepted their atonement, or their professed repentance, so far as to compensate it with a removal of this outward and present affliction, as he did also to wicked Ahab upon his humiliation. And this God does for the encouragement of true penitents, who may hence learn how much greater and better recompenses they may expect and shall receive from God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And did not stir up all his wrath — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But set bounds to it; and though he chastened them, yet he would not utterly destroy them, as they deserved.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "78:9-39. Sin dispirits men, and takes away the heart. Forgetfulness of God's works is the cause of disobedience to his laws. This narrative relates a struggle between God's goodness and man's badness. The Lord hears all our murmurings and distrusts, and is much displeased. Those that will not believe the power of God's mercy, shall feel the fire of his indignation. Those cannot be said to trust in God's salvation as their happiness at last, who can not trust his providence in the way to it. To all that by faith and prayer, ask, seek, and knock, these doors of heaven shall at any time be opened; and our distrust of God is a great aggravation of our sins. He expressed his resentment of their provocation; not in denying what they sinfully lusted after, but in granting it to them. Lust is contented with nothing. Those that indulge their lust, will never be estranged from it. Those hearts are hard indeed, that will neither be melted by the mercies of the Lord, nor broken by his judgments. Those that sin still, must expect to be in trouble still. And the reason why we live with so little comfort, and to so little purpose, is, because we do not live by faith. Under these rebukes they professed repentance, but they were not sincere, for they were not constant. In Israel's history we have a picture of our own hearts and lives. God's patience, and warnings, and mercies, imbolden them to harden their hearts against his word. And the history of kingdoms is much the same. Judgments and mercies have been little attended to, until the measure of their sins has been full. And higher advantages have not kept churches from declining from the commandments of God. Even true believers recollect, that for many a year they abused the kindness of Providence. When they come to heaven, how will they admire the Lord's patience and mercy in bringing them to his kingdom!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But he, being full of compassion - literally, \"But he, merciful,\" That is, he was ready to forgive them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Forgave their iniquity - literally, Atoned for, expiated, covered over their iniquity. There is connected with the word the idea of expiation or atonement, as the ground of pardon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And destroyed them not - Did not cut them off in their repeated acts of rebellion. He bore with them, and spared them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yea, many a time turned he his anger away - literally, He multiplied to turn his anger away. That is, he did it repeatedly. There were frequent occasions on their journey for doing this, and he did it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And did not stir up all his wrath - literally, Did not excite, or arouse all his anger. His anger was stayed or mitigated, and they were suffered still to live. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 78:38-39He will not always chide;",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38-39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "He will not always chide;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither will he keep his anger forever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Like as a father pitieth his children,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "37. heart … not right—or, \"firm\" (compare Ps 78:8; Ps 51:10).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Forgave their iniquity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not simply and absolutely, for so it is undeniably certain from the Holy Scriptures that God pardons none but true penitents, such as these were not; but respectively, and so far as not to destroy them at that time, which he threatened, and was about to do, as the next words limit and explain it. He remitted their punishment, for ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "iniquity ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is oft put for the punishment of it. Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he expiated their iniquity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He accepted of their atonement, or of their professed repentance, so far as to compensate it with a removal of this outward and present affliction; as he did also to wicked Ahab upon his hypocritical humiliation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 21:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 21:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And this God doth for the encouragement of all true penitents, who may hence learn how much greater and better recompences they may expect and shall receive from God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Did not stir up all his wrath; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but set bounds to it; and though he chastened them, yet he would not utterly destroy them, as they deserved. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But he, being full of compassion,.... Or merciful; having bowels of mercy, as a tender mother to the son of her womb; a word from the same root as this signifies the womb: the mercies of God are tender and abundant; there is a multitude of them; he is rich and plenteous in mercy, and so ready to forgive; hence it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "forgave their iniquity; forgiveness of sin flows from the tender mercy of God; it is according to the multitude of his mercies, and the riches of his grace; yet is through the blood and attoning sacrifice of his Son; and the word (c) that is here used signifies to expiate or atone; God never intended to pardon sinners, but through the propitiation of his Son, whom he set forth in his purpose, and sent forth in the fulness of time to be the propitiatory sacrifice for sin; he forgave the sins of Old Testament saints with a view to that; and it is for Christ's sake he forgives any; for without shedding of blood there is no remission; though perhaps, since these persons were impenitent, unbelievers and hypocrites, no more may be meant here by the forgiveness of their sins than averting a threatened judgment, or a removing of one, and putting a stop to the further execution of it, which is sometimes meant by forgiving sin; see Numbers 14:19, 1 Kings 8:30 which sense the following words incline to: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "forgave their iniquity; forgiveness of sin flows from the tender mercy of God; it is according to the multitude of his mercies, and the riches of his grace; yet is through the blood and attoning sacrifice of his Son; and the word (c) that is here used signifies to expiate or atone; God never intended to pardon sinners, but through the propitiation of his Son, whom he set forth in his purpose, and sent forth in the fulness of time to be the propitiatory sacrifice for sin; he forgave the sins of Old Testament saints with a view to that; and it is for Christ's sake he forgives any; for without shedding of blood there is no remission; though perhaps, since these persons were impenitent, unbelievers and hypocrites, no more may be meant here by the forgiveness of their sins than averting a threatened judgment, or a removing of one, and putting a stop to the further execution of it, which is sometimes meant by forgiving sin; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 14:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which sense the following words incline to: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and destroyed them not; though they deserved it, and he was able to do it, he did not destroy them immediately and at once, nor all of them, at least not their seed and posterity, who were preserved and brought into the land of Canaan: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yea, many a time turned he his anger away; he does not retain it for ever, or always carry on a resentment, or the appearance of it; though he causes grief, he has and shows compassion; he is said to turn away his anger from his own people when he forgives their sins, and comforts their souls, Psalm 85:2, so when he causes the effects of his displeasure to cease, or stays a plague, or stops a judgment, by means of any of his servants; see Numbers 25:8, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "yea, many a time turned he his anger away; he does not retain it for ever, or always carry on a resentment, or the appearance of it; though he causes grief, he has and shows compassion; he is said to turn away his anger from his own people when he forgives their sins, and comforts their souls, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 85:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so when he causes the effects of his displeasure to cease, or stays a plague, or stops a judgment, by means of any of his servants; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 25:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and did not stir up all his wrath; which their sins deserved, and was laid up among his treasures: the wrath of a temporal king is as the roaring of a lion, Proverbs 19:12 much more that of the King of kings; and the allusion here seems to be to the arousing of some fierce creature; the wrath of God is intolerable, and, even when it is kindled but a little, it cannot be endured; and much less should it be all stirred up; but here in wrath he remembered mercy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and did not stir up all his wrath; which their sins deserved, and was laid up among his treasures: the wrath of a temporal king is as the roaring of a lion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " much more that of the King of kings; and the allusion here seems to be to the arousing of some fierce creature; the wrath of God is intolerable, and, even when it is kindled but a little, it cannot be endured; and much less should it be all stirred up; but here in wrath he remembered mercy. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) \"propitiabitur\", Montanus; \"propitiatus est\", Pagninus, Museulus; \"propitius fuit\", Tigurine version; \"expiabat\", Junius & Tremellius, Piscator, Cocceius, Gejerus, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) \"propitiabitur\", Montanus; \"propitiatus est\", Pagninus, Museulus; \"propitius fuit\", Tigurine version; \"expiabat\", Junius & Tremellius, Piscator, Cocceius, Gejerus, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But he, being full of compassion, {x} forgave their iniquity, and destroyed them not: yea, many a time turned he his anger away, and did not stir up all his wrath.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But he, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "being",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " full of compassion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{x}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " forgave ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "their",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " iniquity, and destroyed ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "them",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not: yea, many a time turned he his anger away, and did not stir up all his wrath.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Because he would always have some remnant of a Church to praise his Name in earth, he did not permit their sins to overcome his mercy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This verse describes the general attributes of God, in virtue of which (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 78:39",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") He spared Israel in spite of their guilt. Render:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But he, being full of compassion, forgiveth iniquity and destroyeth not,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And offtimes turneth his anger away,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And stirreth not up all his wrath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "V",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 38 is, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Kiddushin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 30",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the middle of the 5896 lines (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "στίχοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the Psalter. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Maccoth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 22",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:58-59",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were recited, when the forty stripes save one, which Paul five times suffered (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 11:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), were inflicted on the offender.” (Delitzsch).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 38.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But he, being full of compassion, forgave their iniquity.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (On God's compassion, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6, 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 145:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And destroyed them not.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The allusion is to such occasions as are noted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:10-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:12-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:21, 45-50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", when God was on the point of destroying the whole people, but relented at the intercession of Moses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yea, many a time turned he his anger away, and did not stir up all his wrath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 2:11-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 3:8, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 4:2, 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 6:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Psalm 78:38",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second part of the Psalm now begins. God, notwithstanding, in His compassion restrains His anger; but Israel's God-tempting conduct was continued, even after the journey through the desert, in Canaan, and the miracles of judgment amidst which the deliverance out of Egypt had been effected were forgotten. With והוּא in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:38",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: According to B. Kiddushin 30a, this Psalm 78:38 is the middle one of the 5896 פסוקין, στίχοι, of the Psalter. According to B. Maccoth 22b, Psalm 78:38, and previously Deuteronomy 28:58-59; Deuteronomy 29:8 [9], were recited when the forty strokes of the lash save one, which according to 2 Corinthians 11:24 Paul received five times, were being counted out to the culprit.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: According to B. Kiddushin 30a, this ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is the middle one of the 5896 פסוקין, στίχοι, of the Psalter. According to B. Maccoth 22b, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and previously ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:58-59",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 29:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " [9], were recited when the forty strokes of the lash save one, which according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 11:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Paul received five times, were being counted out to the culprit.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "begins an adversative clause, which is of universal import as far as ישׁהית, and then becomes historical. Psalm 78:38 expands what lies in רחוּם: He expiates iniquity and, by letting mercy instead of right take its course, arrests the destruction of the sinner. With והרבּה (Ges. ֗֗142, 2) this universal truth is supported out of the history of Israel. As this history shows, He has many a time called back His anger, i.e., checked it in its course, and not stirred up all His blowing anger (cf. Isaiah 42:13), i.e., His anger in all its fulness and intensity. We see that Psalm 78:38 refers to His conduct towards Israel, then Psalm 78:39 follows with the ground of the determination, and that in the form of an inference drawn from such conduct towards Israel. He moderated His anger against Israel, and consequently took human frailty and perishableness into consideration. The fact that man is flesh (which not merely affirms his physical fragility, but also his moral weakness, Genesis 6:3, cf. Genesis 8:21), and that, after a short life, he falls a prey to death, determines God to be long-suffering and kind; it was in fact sensuous desire and loathing by which Israel was beguiled time after time. The exclamation \"how oft!\" Psalm 78:40, calls attention to the praiseworthiness of this undeserved forbearance.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "begins an adversative clause, which is of universal import as far as ישׁהית, and then becomes historical. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " expands what lies in רחוּם: He expiates iniquity and, by letting mercy instead of right take its course, arrests the destruction of the sinner. With והרבּה (Ges. ֗֗142, 2) this universal truth is supported out of the history of Israel. As this history shows, He has many a time called back His anger, i.e., checked it in its course, and not stirred up all His blowing anger (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., His anger in all its fulness and intensity. We see that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " refers to His conduct towards Israel, then ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " follows with the ground of the determination, and that in the form of an inference drawn from such conduct towards Israel. He moderated His anger against Israel, and consequently took human frailty and perishableness into consideration. The fact that man is flesh (which not merely affirms his physical fragility, but also his moral weakness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 8:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and that, after a short life, he falls a prey to death, determines God to be long-suffering and kind; it was in fact sensuous desire and loathing by which Israel was beguiled time after time. The exclamation \"how oft!\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", calls attention to the praiseworthiness of this undeserved forbearance.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But with Psalm 78:41 the record of sins begins anew. There is nothing by which any reference of this Psalm 78:41 to the last example of insubordination recorded in the Pentateuch, Numbers 35:1-9 (Hitzig), is indicated. The poet comes back one more to the provocations of God by the Israel of the wilderness in order to expose the impious ingratitude which revealed itself in this conduct. התוה is the causative of תּוה  equals  Syriac tewā', תּהא, to repent, to be grieved, lxx παρώξυναν. The miracles of the tie of redemption are now brought before the mind in detail, ad exaggerandum crimen tentationis Deu cum summa ingratitudine conjunctum (Venema). The time of redemption is called יום, as in Genesis 2:4 the hexahemeron. שׂים אות (synon. עשׂה, נתן) is used as in Exodus 10:2. We have already met with מנּי־צר in Psalm 44:11. The first of the plagues of Egypt (Exodus 7:14-25), the turning of the waters into blood, forms the beginning in Psalm 78:44. From this the poet takes a leap over to the fourth plague, the ערב (lxx κυνόμυια), a grievous and destructive species of fly (Exodus 8:20-32), and combines with it the frogs, the second plague (Exodus 8:1-15). צפרדּע is the lesser Egyptian frog, Rana Mosaica, which is even now called Arab. ḍfd‛, ḍofda. Next in Psalm 78:46 he comes to the eighth plague, the locusts, חסיל (a more select name of the migratory locusts than ארבּה), Exodus 10:1-20; the third plague, the gnats and midges, כּנּים, is left unmentioned in addition to the fourth, which is of a similar kind. For the chastisement by means of destructive living things is now closed, and in Psalm 78:47 follows the smiting with hail, the seventh plague, Exodus 9:13-35. חנמל (with pausal , not ā, cf. in Ezekiel 8:2 the similarly formed החשׁמלה) in the signification hoar-frost (πάχνη, lxx, Vulgate, Saadia, and Abulwald), or locusts (Targum כּזוּבא  equals  חגב), or ants (J. D. Michaelis), does not harmonize with the history; also the hoar-frost is called כּפוּר, the ant נּמלה (collective in Arabic neml). Although only conjecturing from the context, we understand it, with Parchon and Kimchi, of hailstones or hail. With thick lumpy pieces of ice He smote down vines and sycamore-trees (Fayum was called in ancient Egyptian \"the district of the sycamore\"). הרג proceeds from the Biblical conception that the plant has a life of its own. The description of this plague is continued in Psalm 78:48. Two MSS present לדּבר instead of לבּרד; but even supposing that רשׁפים might signify the fever-burnings of the pestilence (vid., on Habakkuk 3:5), the mention of the pestilence follows in Psalm 78:50, and the devastation which, according to Exodus 9:19-22, the hail caused among the cattle of the Egyptians is in its right place here. Moreover it is expressly said in Exodus 9:24 that there was conglomerate fire among the hail; רשׁפים are therefore flaming, blazing lightnings. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the record of sins begins anew. There is nothing by which any reference of this ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the last example of insubordination recorded in the Pentateuch, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Hitzig), is indicated. The poet comes back one more to the provocations of God by the Israel of the wilderness in order to expose the impious ingratitude which revealed itself in this conduct. התוה is the causative of תּוה  equals  Syriac tewā', תּהא, to repent, to be grieved, lxx παρώξυναν. The miracles of the tie of redemption are now brought before the mind in detail, ad exaggerandum crimen tentationis Deu cum summa ingratitudine conjunctum (Venema). The time of redemption is called יום, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the hexahemeron. שׂים אות (synon. עשׂה, נתן) is used as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". We have already met with מנּי־צר in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 44:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The first of the plagues of Egypt (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 7:14-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the turning of the waters into blood, forms the beginning in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". From this the poet takes a leap over to the fourth plague, the ערב (lxx κυνόμυια), a grievous and destructive species of fly (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 8:20-32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and combines with it the frogs, the second plague (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 8:1-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). צפרדּע is the lesser Egyptian frog, Rana Mosaica, which is even now called Arab. ḍfd‛, ḍofda. Next in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:46",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he comes to the eighth plague, the locusts, חסיל (a more select name of the migratory locusts than ארבּה), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:1-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the third plague, the gnats and midges, כּנּים, is left unmentioned in addition to the fourth, which is of a similar kind. For the chastisement by means of destructive living things is now closed, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " follows the smiting with hail, the seventh plague, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 9:13-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". חנמל (with pausal , not ā, cf. in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the similarly formed החשׁמלה) in the signification hoar-frost (πάχνη, lxx, Vulgate, Saadia, and Abulwald), or locusts (Targum כּזוּבא  equals  חגב), or ants (J. D. Michaelis), does not harmonize with the history; also the hoar-frost is called כּפוּר, the ant נּמלה (collective in Arabic neml). Although only conjecturing from the context, we understand it, with Parchon and Kimchi, of hailstones or hail. With thick lumpy pieces of ice He smote down vines and sycamore-trees (Fayum was called in ancient Egyptian \"the district of the sycamore\"). הרג proceeds from the Biblical conception that the plant has a life of its own. The description of this plague is continued in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Two MSS present לדּבר instead of לבּרד; but even supposing that רשׁפים might signify the fever-burnings of the pestilence (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the mention of the pestilence follows in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the devastation which, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 9:19-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the hail caused among the cattle of the Egyptians is in its right place here. Moreover it is expressly said in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that there was conglomerate fire among the hail; רשׁפים are therefore flaming, blazing lightnings. ",
            "children": []
          }
        ]
      }
    ]
  }
]