[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "78:1-8 These are called dark and deep sayings, because they are carefully to be looked into. The law of God was given with a particular charge to teach it diligently to their children, that the church may abide for ever. Also, that the providences of God, both in mercy and in judgment, might encourage them to conform to the will of God. The works of God much strengthen our resolution to keep his commandments. Hypocrisy is the high road to apostacy; those that do not set their hearts right, will not be stedfast with God. Many parents, by negligence and wickedness, become murderers of their children. But young persons, though they are bound to submit in all things lawful, must not obey sinful orders, or copy sinful examples.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That the generation to come might know them ... - That people in future times might enjoy the benefit of them as their fathers had done, and that they should then send them forward to those who were to succeed them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who should arise and declare them to their children - Who, as they appeared on the stage of life, should receive the trust, and send it onward to future ages. Thus the world makes progress; thus one age starts where the previous one left off; thus it enters on its own career with the advantage of all the toils, the sacrifices, the happy thoughts, the inventions of all past times. It is designed that the world shall thus grow wiser and better as it advances; and that future generations shall be enriched with all that was worth preserving in the experience of the past. See the notes at Psalm 71:18. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who should arise and declare them to their children - Who, as they appeared on the stage of life, should receive the trust, and send it onward to future ages. Thus the world makes progress; thus one age starts where the previous one left off; thus it enters on its own career with the advantage of all the toils, the sacrifices, the happy thoughts, the inventions of all past times. It is designed that the world shall thus grow wiser and better as it advances; and that future generations shall be enriched with all that was worth preserving in the experience of the past. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 71:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. testimony—(Ps 19:7).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That the generation to come might know them,.... Not only notionally, but spiritually and experimentally; which is the case, when human teachings are attended with the spirit of wisdom and revertion in the knowledge of divine truths; for the truths of the Gospel are unknown to men; the Gospel is hidden wisdom, the wisdom of God in a mystery; the Bible is a sealed book, the doctrines of it are riddles and dark sayings; the ministry of the word is the means of knowledge, which become effectual when attended with the Spirit and power of God: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "even the children which should be born, who should arise and declare them to their children; and so be transmitted from age to age: it is the will of God, that, besides private instructions, there should be a standing ministry kept up in all ages, to the end of the world; and he will have some that shall receive the Gospel, and profess his name; there has been and will be a succession of regenerate persons; instead of the fathers come up the children, a seed to serve the Lord, accounted to him for a generation; the seed and the seed's seed of the church, from whose mouth the word of God shall never depart; but they shall declare it one to another, by which means it shall be continued to the latest posterity, Psalm 22:30. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "even the children which should be born, who should arise and declare them to their children; and so be transmitted from age to age: it is the will of God, that, besides private instructions, there should be a standing ministry kept up in all ages, to the end of the world; and he will have some that shall receive the Gospel, and profess his name; there has been and will be a succession of regenerate persons; instead of the fathers come up the children, a seed to serve the Lord, accounted to him for a generation; the seed and the seed's seed of the church, from whose mouth the word of God shall never depart; but they shall declare it one to another, by which means it shall be continued to the latest posterity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "That the {e} generation to come might know them, even the children which should be born; who should arise and declare them to their children:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " generation to come might know ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "them, even",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the children ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "which",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " should be born; ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "who",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " should arise and declare ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "them",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to their children:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) He shows how the children would be like their father's: that is, in maintaining God's pure religion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The A.V. follows the Massoretic division of the verse; but it is better to connect the clauses thus:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That another generation might know,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That sons which should be born might arise and tell their sons.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That the generation to come might know them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"The generation to come\" is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "next",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " generation, that immediately following those to whom the command was directly given. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Even the children which should be born.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Their actual sons and daughters. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who should arise and declare them to their children.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The first generation were to hand the knowledge on to the second, the second to the third, and so on. This is the way in which the hulk of human knowledge actually passes on. Not much is learnt from books without a teacher (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 8:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 78:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet begins very similarly to the poet of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He comes forward among the people as a preacher, and demands for his tra a willing, attentive hearing. תּורה is the word for every human doctrine or instruction, especially for the prophetic discourse which sets forth and propagates the substance of the divine teaching. Asaph is a prophet, hence ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is quoted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". as ῥηθὲν διὰ τοῦ προφήτου.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The reading διὰ Ἠσαΐ́ου τοῦ προφήτου is, although erroneous, nevertheless ancient; since even the Clementine Homilies introduce this passage as the language of Isaiah.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He here recounts to the people their history מנּי־קדם, from that Egyptaeo-Sinaitic age of yore to which Israel's national independence and specific position in relation to the rest of the world goes back. It is not, however, with the external aspect of the history that he has to do, but with its internal teachings. משׁל is an allegory or parable, παραβολή, more particularly the apophthegm as the characteristic species of poetry belonging to the Chokma, and then in general a discourse of an elevated style, full of figures, thoughtful, pithy, and rounded. חידה is that which is entangled, knotted, involved, perlexe dictum. The poet, however, does not mean to say that he will literally discourse gnomic sentences and propound riddles, but that he will set forth the history of the fathers after the manner of a parable and riddle, so that it may become as a parable, i.e., a didactic history, and its events as marks of interrogation and nota-bene's to the present age. The lxx renders thus: ἀνοίξω ἐν παραβολαῖς τὸ στόμα μου, φθέγξομαι προβλήματα ἀπ ̓ ἀρχῆς. Instead of this the Gospel by Matthew has: ἀνοίξω ἐν παραβολαῖς τὸ στόμα μου, ἐρεύξομαι κεκρυμμένα ἀπὸ καταβολῆς (κόσμου), and recognises in this language of the Psalm a prophecy of Christ; because it is moulded so appropriately for the mouth of Him who is the Fulfiller not only of the Law and of Prophecy, but also of the vocation of the prophet. It is the object-clause to נכחד, and not a relative clause belonging to the \"riddles out of the age of yore,\" that follows in Psalm 78:3 with אשׁר, for that which has been heard only becomes riddles by the appropriation and turn the poet gives to it. Psalm 78:3 begins a new period (cf. Psalm 69:27; Jeremiah 14:1, and frequently): What we have heard, and in consequence thereof known, and what our fathers have told us (word for word, like Psalm 44:1; Judges 6:13), that will we not hide from their children (cf. Job 15:18). The accentuation is perfectly correct. The Rebı̂a by מבניהם has a greater distinctive force than the Rebı̂a by אחרון (לדור); it is therefore to be rendered: telling to the later generation (which is just what is intended by the offspring of the fathers) the glorious deeds of Jahve, etc. The fut. consec. ויּקם joins on to אשׁר עשׂה. Glorious deeds, proofs of power, miracles hath He wrought, and in connection therewith set up an admonition in Jacob, and laid down an order in Israel, which He commanded our fathers, viz., to propagate by tradition the remembrance of those mighty deeds (Exodus 13:8, Exodus 13:14; Deuteronomy 4:9, and other passages). להודיעם has the same object as והודעתּם in Deuteronomy 4:9; Joshua 4:22. The matter in question is not the giving of the Law in general, as the purpose of which, the keeping of the laws, ought then to have been mentioned before anything else, but a precept, the purpose of which was the further proclamation of the magnalia Dei, and indirectly the promotion of trust in god and fidelity to the Law; cf. Psalm 81:5., where the special precept concerning the celebration of the Feast of the Passover is described as a עדוּת laid down in Joseph. The following generation, the children, which shall be born in the course of the ages, were to know concerning His deeds, and also themselves to rise up (יקוּמוּ, not: come into being, like the יבאוּ of the older model-passage Psalm 22:32) and to tell them further to their children, in order that these might place their confidence in god (שׂים כּסל, like שׁית מחסה in Psalm 73:28), and might not forget the mighty deeds of God (Psalm 118:17), and might keep His commandments, being warned by the disobedience of the fathers. The generation of the latter is called סורר וּמרה, just as the degenerate son that is to be stoned is called in Deuteronomy 21:18. הכין לבּו, to direct one's heart, i.e., to give it the right direction or tendency, to put it into the right state, is to be understood after Psalm 78:37, 2 Chronicles 20:33, Sir. 2:17.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He here recounts to the people their history מנּי־קדם, from that Egyptaeo-Sinaitic age of yore to which Israel's national independence and specific position in relation to the rest of the world goes back. It is not, however, with the external aspect of the history that he has to do, but with its internal teachings. משׁל is an allegory or parable, παραβολή, more particularly the apophthegm as the characteristic species of poetry belonging to the Chokma, and then in general a discourse of an elevated style, full of figures, thoughtful, pithy, and rounded. חידה is that which is entangled, knotted, involved, perlexe dictum. The poet, however, does not mean to say that he will literally discourse gnomic sentences and propound riddles, but that he will set forth the history of the fathers after the manner of a parable and riddle, so that it may become as a parable, i.e., a didactic history, and its events as marks of interrogation and nota-bene's to the present age. The lxx renders thus: ἀνοίξω ἐν παραβολαῖς τὸ στόμα μου, φθέγξομαι προβλήματα ἀπ ̓ ἀρχῆς. Instead of this the Gospel by Matthew has: ἀνοίξω ἐν παραβολαῖς τὸ στόμα μου, ἐρεύξομαι κεκρυμμένα ἀπὸ καταβολῆς (κόσμου), and recognises in this language of the Psalm a prophecy of Christ; because it is moulded so appropriately for the mouth of Him who is the Fulfiller not only of the Law and of Prophecy, but also of the vocation of the prophet. It is the object-clause to נכחד, and not a relative clause belonging to the \"riddles out of the age of yore,\" that follows in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with אשׁר, for that which has been heard only becomes riddles by the appropriation and turn the poet gives to it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " begins a new period (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 69:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and frequently): What we have heard, and in consequence thereof known, and what our fathers have told us (word for word, like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 44:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that will we not hide from their children (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The accentuation is perfectly correct. The Rebı̂a by מבניהם has a greater distinctive force than the Rebı̂a by אחרון (לדור); it is therefore to be rendered: telling to the later generation (which is just what is intended by the offspring of the fathers) the glorious deeds of Jahve, etc. The fut. consec. ויּקם joins on to אשׁר עשׂה. Glorious deeds, proofs of power, miracles hath He wrought, and in connection therewith set up an admonition in Jacob, and laid down an order in Israel, which He commanded our fathers, viz., to propagate by tradition the remembrance of those mighty deeds (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and other passages). להודיעם has the same object as והודעתּם in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 4:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The matter in question is not the giving of the Law in general, as the purpose of which, the keeping of the laws, ought then to have been mentioned before anything else, but a precept, the purpose of which was the further proclamation of the magnalia Dei, and indirectly the promotion of trust in god and fidelity to the Law; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 81:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., where the special precept concerning the celebration of the Feast of the Passover is described as a עדוּת laid down in Joseph. The following generation, the children, which shall be born in the course of the ages, were to know concerning His deeds, and also themselves to rise up (יקוּמוּ, not: come into being, like the יבאוּ of the older model-passage ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and to tell them further to their children, in order that these might place their confidence in god (שׂים כּסל, like שׁית מחסה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and might not forget the mighty deeds of God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and might keep His commandments, being warned by the disobedience of the fathers. The generation of the latter is called סורר וּמרה, just as the degenerate son that is to be stoned is called in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 21:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". הכין לבּו, to direct one's heart, i.e., to give it the right direction or tendency, to put it into the right state, is to be understood after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 20:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Sir. 2:17.",
            "children": []
          }
        ]
      }
    ]
  }
]