[{"num":21,"verse":"And once we had launched forth and drawn away from them, we went with a straight course to Cos, and the day following to Rhodes, and from there to Patara. "},{"num":2,"verse":"And we found a ship ready to sail to Phoenicia, and went aboard and set sail. "},{"num":3,"verse":"Then we came in sight of Cyprus, and we passed it on the left hand and sailed to Syria. We put in at Tyre, because the ship was to unload her cargo there.  "},{"num":4,"verse":"And when we found brethren, we stayed there seven days. And they told Paul through the Spirit that he should not go up to Jerusalem."},{"num":5,"verse":"And when the days were ended, we departed and went our ways; and they all brought us on our way, with their wives and children, till we got to the outskirts of the city. And we kneeled down on the shore and prayed. And when we had taken our leave of one another, "},{"num":6,"verse":"we boarded ship, and they returned home again."},{"num":7,"verse":"When we had completed the voyage from Tyre, we went on to Ptolemais and greeted the brethren, and stayed with them one day. "},{"num":8,"verse":"The next day, we who were of Paul’s company departed and went to Caesarea. And we entered into the house of Philip the evangelist, who was one of the seven deacons, and stayed with him. "},{"num":9,"verse":"This man had four daughters, virgins who prophesied."},{"num":10,"verse":"And while we tarried there a good many days, there came a certain prophet from Judea named Agabus. "},{"num":11,"verse":"When he had come to us, he took Paul’s girdle and bound his hands and feet, and said, Thus says the Holy Spirit: in this manner the Jews at Jerusalem will bind the man that owns this girdle, and will deliver him into the hands of the Gentiles."},{"num":12,"verse":"When we heard this, both we and others of the same place besought Paul not to go up to Jerusalem. "},{"num":13,"verse":"Then Paul answered and said, What are you doing, weeping and breaking my heart? I am ready not only to be bound, but also to die at Jerusalem for the name of the Lord Jesus."},{"num":14,"verse":"When we could not turn his mind, we gave up, saying, May the will of the Lord be fulfilled."},{"num":15,"verse":"After those days we made ourselves ready and went up to Jerusalem. "},{"num":16,"verse":"There went with us also certain of the disciples of Caesarea, and they brought with them one Mnason of Cyprus, an old disciple, with whom we would lodge. "},{"num":17,"verse":"And when we got to Jerusalem, the brethren received us gladly. "},{"num":18,"verse":"And on the morrow, Paul went in with us to James. And all the elders came together. "},{"num":19,"verse":"And when he had greeted them, he told in order all the things that God had wrought among the Gentiles through his ministry."},{"num":20,"verse":"And when they heard it, they glorified the Lord and said to him, You see, brother, how many thousand Jews there are who believe, and they are all zealous over the law. "},{"num":21,"verse":"And they are informed of you that you teach all the Jews who are among the Gentiles to forsake Moses, and say that they ought not to circumcise their children, nor live according to the customs. "},{"num":22,"verse":"What then? This group is bound to get together, because they will hear that you have come. "},{"num":23,"verse":"Do therefore what we say to you: We have four men who are under a vow. "},{"num":24,"verse":"Take them, and purify yourself with them, and bear their expenses so that they can shave their heads, and everyone will know that those things that they have heard concerning you are nothing, but that you yourself also walk keeping the law. "},{"num":25,"verse":"For concerning the Gentiles who believe, we have written and concluded that they need observe no such things, but should keep themselves from things offered to idols, from blood, from things strangled, and from fornication."},{"num":26,"verse":"Then the next day Paul took the men and purified himself with them, and entered into the temple, declaring that he was observing the days of purification until an offering should be offered for every one of them."},{"num":27,"verse":"And as the seven days were almost ended, the Jews of Asia, when they saw Paul in the temple, moved all the people, and laid hands on him, "},{"num":28,"verse":"crying, Men of Israel, help! This is the man that teaches everyone everywhere against the people and the law and this place. Moreover, he has also brought Greeks into the temple, and has defiled this holy place. "},{"num":29,"verse":"(For they had seen one Trophimus, an Ephesian, with him in the city, and they supposed Paul had brought him into the temple.)"},{"num":30,"verse":"And all the city was moved, and the people swarmed together. And they took Paul and drew him out of the temple, and immediately the doors were shut to."},{"num":31,"verse":"As they went about to kill him, a report came to the high captain of the soldiers that all Jerusalem was in an uproar. "},{"num":32,"verse":"He immediately took soldiers and centurions and ran down to them. When they saw the high captain and the soldiers, the people stopped beating Paul. "},{"num":33,"verse":"Then the captain came near and took him, and commanded him to be bound with two chains, and demanded who he was and what he had done. "},{"num":34,"verse":"And one shouted this and another that among the people. And when he could not ascertain the facts due to the tumult, the captain commanded Paul to be taken into the castle. "},{"num":35,"verse":"And when Paul came to a flight of stairs, he had to be carried by the soldiers because of the violence of the people. "},{"num":36,"verse":"For the crowd of people followed after, crying, Away with him!"},{"num":37,"verse":"And as Paul began to be led into the castle, he said to the high captain, May I speak to you? He said, Can you speak Greek? "},{"num":38,"verse":"Are you not that Egyptian who before these days caused a riot, and led out into the wilderness four thousand men that were murderers?"},{"num":39,"verse":"But Paul said, I am a Jew of Tarsus, a city in Cilicia, a citizen of no mean city. I beseech you, allow me to speak to the people."},{"num":40,"verse":"When he had given him leave, Paul stood on the steps and beckoned with his hand to the people, and there was a great silence. And he spoke to them in the Hebrew tongue, saying,"}]