[{"num":21,"verse":"And as we launched forth, and had left them, we set a straight course to Cos, and the next day to Rhodes, and from there to Patara."},{"num":2,"verse":"And we found a ship that went over to Phoenicia, and went aboard, and set forth."},{"num":3,"verse":"And when we had discovered Cyprus, we left it on the left side, and sailed toward Syria, and arrived at Tyre. For there the ship unloaded its cargo."},{"num":4,"verse":"And when we had found disciples, we remained there for seven days. And through the Spirit, they told Paul that he should not go up to Jerusalem."},{"num":5,"verse":"But when those days had ended, we departed and went our way. And they all, with their wives and children, accompanied us until we were out of the city. And we kneeled down on the shore and prayed."},{"num":6,"verse":"Then, after we had embraced one another, we boarded the ship. And they returned home."},{"num":7,"verse":"And when we had finished the voyage from Tyre, we arrived at Ptolemais, and greeted the brothers, and stayed with them for one day."},{"num":8,"verse":"And the next day, Paul (and we who were with him) left and came to Caesarea. And we entered into the house of Philip the Evangelist (who was one of the seven) and stayed with him."},{"num":9,"verse":"Now he had four virgin daughters who prophesied."},{"num":10,"verse":"And as we remained there many days, a certain prophet named Agabus came from Judea."},{"num":11,"verse":"And when he had come to us, he took Paul’s belt, and bound his own hands and feet, and said, “Thus says the Holy Ghost, ‘So shall the Jews at Jerusalem bind the man that owns this belt, and shall deliver him into the hands of the Gentiles.’”"},{"num":12,"verse":"And when we had heard these things, both we and the residents there begged him not to go up to Jerusalem."},{"num":13,"verse":"Then Paul answered, and said, “Why are you weeping and breaking my heart? For I am ready, not only to be bound, but also to die at Jerusalem for the Name of the Lord Jesus.”"},{"num":14,"verse":"So when he would not be persuaded, we ceased, saying, “The will of the Lord be done.”"},{"num":15,"verse":"And after those days, we made ourselves ready and went up to Jerusalem."},{"num":16,"verse":"Some of the disciples of Caesarea also went with us, and brought with them one Mnason of Cyprus, an old disciple with whom we were to lodge."},{"num":17,"verse":"And when we had come to Jerusalem, the brothers received us gladly."},{"num":18,"verse":"And the next day Paul went in with us to James. And all the elders were assembled there."},{"num":19,"verse":"And after he had embraced them, he told in order all things that God had worked among the Gentiles through his ministry."},{"num":20,"verse":"So when they heard it, they glorified God, and said to him, “You see, brother, how many thousand Jews there are who believe. And they are all zealous for the Law."},{"num":21,"verse":"“Now they are informed that you teach all the Jews who are among the Gentiles to forsake Moses, saying that they ought not to circumcise their sons, nor to live after the customs."},{"num":22,"verse":"What then? The multitude must certainly come together. For they shall hear that you have come."},{"num":23,"verse":"Therefore, do what we tell you. We have four men who have made a vow."},{"num":24,"verse":"Take them. And purify yourself with them. And contribute with them, so that they may shave their heads. And all shall know that those things about which they have been informed concerning you, are nothing. And that you yourself also walk and keep the Law."},{"num":25,"verse":"As for the Gentiles who believe, we have written and determined that they should observe no such thing, except that they keep themselves from things offered to idols, and from blood, and from that which is strangled, and from fornication."},{"num":26,"verse":"Then the next day Paul took the men, and having been purified with them, entered into the Temple and declared the completion of the days of the purification and that an offering would be offered for each one of them."},{"num":27,"verse":"And when the seven days had almost ended, the Asian Jews (when they saw him in the Temple) incited all the people, and laid hands on him,"},{"num":28,"verse":"crying, “Men of Israel! Help! This is the man who teaches against the people, and the Law, and this place - to everyone, everywhere! Moreover, he has brought Greeks into the Temple, and has polluted this holy place!”"},{"num":29,"verse":"For they had seen Trophimus (an Ephesian) with him in the city before, whom they assumed that Paul had brought into the Temple."},{"num":30,"verse":"Then all the city was moved, and the people ran together. And they took Paul, and dragged him out of the Temple, and immediately the doors were shut."},{"num":31,"verse":"But as they were seeking to kill him, word came to the chief captain of the band that all Jerusalem was in an uproar;"},{"num":32,"verse":"who immediately took soldiers and Centurions and ran down to them. And when they saw the chief captain and the soldiers, they stopped beating of Paul."},{"num":33,"verse":"Then the chief captain came near and took him, and commanded that he be bound with two chains, and asked who he was and what he had done."},{"num":34,"verse":"And one cried this, and another that, among the people. So, when he could not discern the veracity because of the uproar, he commanded him to be led into the castle."},{"num":35,"verse":"And when he came to the stairs, it happened that he was carried by the soldiers because of the violence of the people."},{"num":36,"verse":"For the multitude of the people followed them, crying, “Away with him!”"},{"num":37,"verse":"And as Paul was being been led into the castle, he said to the chief captain, “May I speak to you?” Who said, “Can you speak Greek?"},{"num":38,"verse":"“Are you not the Egyptian who previously led a revolt, and led four thousand assassins out into the wilderness?”"},{"num":39,"verse":"Then Paul said, “Doubtless, I am a Jew, and a citizen of Tarsus, (a famous city of Cilicia). And I beg you, allow me to speak to the people.”"},{"num":40,"verse":"And when he had let him, Paul stood on the stairs and beckoned with the hand to the people. And when there was a great silence, he spoke to them in the Hebrew tongue, saying,"}]