[{"header":"Paul’s Journey to Jerusalem"},{"num":21,"verse":"After we tore ourselves away from them, we put out to sea and sailed a direct course for the island of Kos, and on the next day to the island of Rhodes, and from there to Patara. "},{"num":2,"verse":"There we found a ship that was crossing over to Syria, so we went aboard and sailed away. "},{"num":3,"verse":"After we sighted Cyprus and sailed south of it, we docked at Tyre in Syria, where the ship unloaded its cargo."},{"num":4,"verse":"When we went ashore we found a number of believers and stayed with them for a week. They prophesied to Paul repeatedly, warning him by the Holy Spirit not to set foot in Jerusalem. "},{"num":5,"verse":"When it was time for us to leave and be on our way, everyone—men, women, and children—accompanied us out of the city down to the beach. After we all knelt in the sand and prayed together, "},{"num":6,"verse":"we kissed one another, said our good-byes, and boarded the ship, while the believers went back to their homes."},{"num":7,"verse":"From Tyre we sailed on to the town of Akko and greeted the believers there with peace. We stayed with them for a day. "},{"num":8,"verse":"Then we went on to Caesarea and stayed for several days in the home of Philip the evangelist, who was one of the seven deacons and "},{"num":9,"verse":"the father of four unmarried daughters who prophesied."},{"num":10,"verse":"During our stay of several days, Agabus, a prophet from Judea, came to visit us. "},{"num":11,"verse":"As a prophetic gesture, he took Paul’s belt and tied his own hands and feet with it as he prophesied, “The Holy Spirit says, ‘The one who owns this belt will be tied up in this same way by the Jews and they will hand him over to those who are not Jews.’ ”"},{"num":12,"verse":"When we heard this, both we and the believers of Caesarea begged Paul not to go on to Jerusalem. "},{"num":13,"verse":"But Paul replied, “Why do you cry and break my heart with your tears? Don’t you know that I’m prepared not only to be imprisoned but to die in Jerusalem for the sake of the wonder of the name of our Lord Jesus?”"},{"num":14,"verse":"Because we couldn’t persuade him, we gave up and said nothing more except “May the will of the Lord be done.”"},{"header":"Paul Arrives in Jerusalem"},{"num":15,"verse":"Afterward we packed our bags and set off for Jerusalem, "},{"num":16,"verse":"with some of the believers from Caesarea accompanying us. They brought us to a village where they introduced us to Mnason, a Cypriot, one of the original disciples, and he offered us hospitality."},{"num":17,"verse":"When we finally arrived in Jerusalem, the believers welcomed us with delight. "},{"num":18,"verse":"The next day Paul and our team had a meeting with Jacob and all the elders of the Jerusalem church. "},{"num":19,"verse":"After greeting everyone, Paul explained in detail what God had accomplished through his ministry among the non-Jewish people."},{"num":20,"verse":"When they heard Paul’s report, they praised God. And they said to him, “You should know, brother, that there are many tens of thousands of Jews who have also embraced the faith and are passionately keeping the law of Moses. "},{"num":21,"verse":"But they’ve heard a rumor that you’ve been instructing the Jews everywhere to abandon Moses by telling them they don’t need to circumcise their children or keep our Jewish customs. "},{"num":22,"verse":"They will certainly hear that you’ve come to Jerusalem. So what is the proper way to proceed? "},{"num":23,"verse":"We urge you to follow our suggestion. We have four men here who have taken a vow and are ready to have their heads shaved. "},{"num":24,"verse":"Now go with them to the temple and sponsor them in their purification ceremony, and pay all their required expenses. Then everyone will know that the rumors they’ve heard are false. They’ll see that you are one who lives according to the law of Moses. "},{"num":25,"verse":"But in reference to the non-Jewish believers, we’ve sent them a letter with our decision, stating that they should avoid eating meat that has been offered to an idol, or eating blood or any animal that has been strangled, and to avoid sexual immorality.”"},{"header":"Paul Arrested in Jerusalem"},{"num":26,"verse":"The next day, Paul took the four men to the temple and ceremonially purified himself along with them. He publicly gave notice of the date when their vows would end and when sacrifices would be offered for each of them."},{"num":27,"verse":"When the seven-day period was almost over, a number of Jews from western Turkey who had seen him in the temple courts stirred up the whole crowd against him. Seizing him, "},{"num":28,"verse":"they shouted, “Men of Israel, help us! This is the man who teaches everywhere what is contrary to our nation, our law, and this temple. And not only that, but now he brings these non-Jewish men with him into the inner courts of our temple! They have made this sacred place ritually unclean.” "},{"num":29,"verse":"(For Trophimus, an Ephesian, had been seen previously with him, and they assumed that he entered the inner courts with Paul.)"},{"num":30,"verse":"This ignited a huge riot in the city as all the people came together to seize Paul and drag him out of the temple courts, closing the gates behind him. "},{"num":31,"verse":"But as they were about to kill Paul, the news reached the commander of the Roman garrison that the entire city was in an uproar. "},{"num":32,"verse":"He immediately ran out to the crowd with a large number of his officers and soldiers. When the crowd saw them coming, they stopped beating Paul. "},{"num":33,"verse":"The commander arrested him and ordered that he be bound with two chains. He then asked, “Who is he and what has he done wrong?”"},{"num":34,"verse":"Some in the crowd shouted one thing and others something else, just adding to the confusion. Since the commander was unable to get to the truth because of the disturbance, he ordered that Paul be brought back to their headquarters. "},{"num":35,"verse":"When they reached the steps leading up to the fortress, they had to protect Paul and carry him up because of the violent mob following them, "},{"num":36,"verse":"and everyone was screaming out, “Away with this man! Kill him!”"},{"num":37,"verse":"As Paul was being led to the entrance of the compound, he said to the commander in Greek, “May I have a word with you?”"},{"num":38,"verse":"Aren’t you that Egyptian fanatic who started a rebellion some time ago and led four thousand assassins out into the wilderness?”"},{"num":39,"verse":"Paul answered, “I am, in fact, a Jew from Tarsus, in Cilicia, a well-known city of southern Turkey where I was born. I beg you, sir, please give me a moment to speak to these people.”"},{"num":40,"verse":"When the commander gave his permission, Paul stood on the steps and gestured with his hands for the people to listen. When the crowd quieted down, Paul addressed them in Aramaic and said:"}]