[[],[{"type":"header","content":"Sennacherib Invades Judah"},{"type":"prose","content":"Now in the fourteenth year of King Hezekiah, Sennacherib king of Assyria came up against all the fortified cities of Judah and conquered them. "}],[{"type":"prose","content":"And the king of Assyria sent the Rabshakeh [his military commander] from Lachish [the Judean fortress commanding the road from Egypt] to King Hezekiah at Jerusalem with a large army. And he stood by the canal of the Upper Pool on the highway to the Fuller’s Field. "}],[{"type":"prose","content":"Then Eliakim the son of Hilkiah, who was in charge of the [royal] household, and Shebna the scribe, and Joah the son of Asaph, the recording historian, came out to [meet] him."}],[{"type":"prose","content":"Then the Rabshakeh said to them, “Say to Hezekiah, ‘This is what the great king, the king of Assyria says, “What is [the reason for] this confidence that you have? "}],[{"type":"prose","content":"I say, ‘Your plan and strength for the war are only empty words.’ Now in whom do you trust  on whom do you rely, that you have rebelled against me? "}],[{"type":"prose","content":"Listen carefully, you rely on the staff of this broken reed, Egypt, which will pierce the hand of any man who leans on it. So is Pharaoh king of Egypt to all who rely on him. "}],[{"type":"prose","content":"But if you say to me, ‘We trust in  rely on the LORD our God,’ is it not He whose high places and whose altars Hezekiah has taken away, saying to Judah and to Jerusalem, ‘You shall worship before this altar’? "}],[{"type":"prose","content":"So now, exchange pledges with my master the king of Assyria and I will give you two thousand horses, if you are able on your part to put riders on them. "}],[{"type":"prose","content":"How then can you repulse [the attack of] a single commander of the least of my master’s servants, and rely on Egypt for chariots and for horsemen? "}],[{"type":"prose","content":"Moreover, is it without the LORD that I have now come up against this land to destroy it? The LORD said to me, ‘Go up against this land and destroy it.’”’”"}],[{"type":"prose","content":"Then Eliakim and Shebna and Joah said to the Rabshakeh, “Please, speak to your servants in Aramaic, because we understand it; and do not speak to us in Judean (Hebrew) in the hearing of the people who are [stationed] on the wall.” "}],[{"type":"prose","content":"But the Rabshakeh said, “Has my master sent me to speak these words  to your master and to you, and not to the men sitting on the wall,  to eat their own dung and drink their own urine with you?”"}],[{"type":"prose","content":"Then the Rabshakeh stood and called out with a loud voice in Judean (Hebrew): “Hear the words of the great king, the king of Assyria. "}],[{"type":"prose","content":"This is what the king says, ‘Do not let Hezekiah deceive you, for he will not be able to rescue you; "}],[{"type":"prose","content":"nor let Hezekiah make you trust in the LORD, saying, “The LORD will most certainly rescue us; this city will not be given into the hand of the king of Assyria.” "}],[{"type":"prose","content":"Do not listen to Hezekiah,’ for this is what the king of Assyria says, ‘Make peace with me and come out to me, and each one of you will eat from his own vine and each from his own fig tree and each [one of you] drink from the water of his own cistern, "}],[{"type":"prose","content":"until I come and take you away to a land like your own land, a land of grain and new wine, a land of bread and vineyards. "}],[{"type":"prose","content":" that Hezekiah does not mislead you by saying, “The LORD will rescue us.” Has any one of the gods of the nations [ever] rescued his land from the hand of the king of Assyria? "}],[{"type":"prose","content":"Where are the gods of Hamath and Arpad [in Aram]? Where are the gods of Sepharvaim? And when have they rescued Samaria from my hand? "}],[{"type":"prose","content":"Who among all the gods of these lands have rescued their land from my hand, that [you should think that] the LORD would rescue Jerusalem from my hand?’”"}],[{"type":"prose","content":"But they kept silent and did not say a word to him in reply, for King Hezekiah’s command was, “Do not answer him.” "}],[{"type":"prose","content":"Then Eliakim the son of Hilkiah, who was in charge of the household, and Shebna the scribe and Joah the son of Asaph, the recording historian, came to Hezekiah with their clothes torn [in grief], and told him the words of the Rabshakeh [the Assyrian commander]."}]]