[{"header":"The Assyrians Invade Judah"},{"num":36,"verse":"During Hezekiah’s fourteenth year as king, Sennacherib king of Assyria attacked all the strong, walled cities of Judah and captured them. "},{"num":2,"verse":"The king of Assyria sent out his field commander with a large army from Lachish to King Hezekiah in Jerusalem. When the commander came near the waterway from the upper pool on the road where people do their laundry, he stopped. "},{"num":3,"verse":"Eliakim, Shebna, and Joah went out to meet him. Eliakim son of Hilkiah was the palace manager, Shebna was the royal secretary, and Joah son of Asaph was the recorder."},{"num":4,"verse":"The field commander said to them, “Tell Hezekiah this:"},{"num":5,"verse":"You say you have battle plans and power for war, but your words mean nothing. Whom are you trusting for help so that you turn against me? "},{"num":6,"verse":"Look, you are depending on Egypt to help you, but Egypt is like a splintered walking stick. If you lean on it for help, it will stab your hand and hurt you. The king of Egypt will hurt all those who depend on him. "},{"num":7,"verse":"You might say, “We are depending on the Lord our God,” but Hezekiah destroyed the Lord’s altars and the places of worship. Hezekiah told Judah and Jerusalem, “You must worship only at this one altar.”"},{"num":8,"verse":"“‘Now make an agreement with my master, the king of Assyria: I will give you two thousand horses if you can find enough men to ride them. "},{"num":9,"verse":"You cannot defeat one of my master’s least important officers, so why do you depend on Egypt to give you chariots and horsemen? "},{"num":10,"verse":"I have not come to attack and destroy this country without an order from the Lord. The Lord himself told me to come to this country and destroy it.’”"},{"num":11,"verse":"Then Eliakim, Shebna, and Joah said to the field commander, “Please speak to us in the Aramaic language. We understand it. Don’t speak to us in Hebrew, because the people on the city wall can hear you.”"},{"num":12,"verse":"But the commander said, “My master did not send me to tell these things only to you and your king. He sent me to speak also to those people sitting on the wall who will have to eat their own dung and drink their own urine like you.”"},{"num":13,"verse":"Then the commander stood and shouted loudly in the Hebrew language, “Listen to what the great king, the king of Assyria says, "},{"num":14,"verse":"The king says you should not let Hezekiah fool you, because he can’t save you. "},{"num":15,"verse":"Don’t let Hezekiah talk you into trusting the Lord by saying, ‘The Lord will surely save us. This city won’t be handed over to the king of Assyria.’"},{"num":16,"verse":"“Don’t listen to Hezekiah. The king of Assyria says, ‘Make peace with me, and come out of the city to me. Then everyone will be free to eat the fruit from his own grapevine and fig tree and to drink water from his own well. "},{"num":17,"verse":"After that I will come and take you to a land like your own—a land with grain and new wine, bread and vineyards.’"},{"num":18,"verse":"“Don’t let Hezekiah fool you, saying, ‘The Lord will save us.’ Has a god of any other nation saved his people from the power of the king of Assyria? "},{"num":19,"verse":"Where are the gods of Hamath and Arpad? Where are the gods of Sepharvaim? They did not save Samaria from my power. "},{"num":20,"verse":"Not one of all the gods of these countries has saved his people from me. Neither can the Lord save Jerusalem from my power.”"},{"num":21,"verse":"The people were silent. They didn’t answer the commander at all, because King Hezekiah had ordered, “Don’t answer him.”"},{"num":22,"verse":"Then Eliakim, Shebna, and Joah tore their clothes to show how upset they were. (Eliakim son of Hilkiah was the palace manager, Shebna was the royal secretary, and Joah son of Asaph was the recorder.) The three men went to Hezekiah and told him what the field commander had said."}]