[{"header":"The End Is Near for Israel"},{"num":7,"verse":"The Lord spoke to me. "},{"num":2,"verse":"“Mortal man,” he said, “this is what I, the Sovereign Lord, am saying to the land of Israel: This is the end for the whole land!"},{"num":3,"verse":"“Israel, the end has come. You will feel my anger, because I am judging you for what you have done. I will pay you back for all your disgusting conduct. "},{"num":4,"verse":"I will not spare you or show you any mercy. I am going to punish you for the disgusting things you have done, so that you will know that I am the Lord.”"},{"num":5,"verse":"This is what the Sovereign Lord is saying: “One disaster after another is coming on you. "},{"num":6,"verse":"It's all over. This is the end. You are finished. "},{"num":7,"verse":"The end is coming for you people who live in the land. The time is near when there will be no more celebrations at the mountain shrines, only confusion."},{"num":8,"verse":"“Very soon now you will feel all the force of my anger. I am judging you for what you have done, and I will pay you back for all your disgusting conduct. "},{"num":9,"verse":"I will not spare you or show you any mercy. I am going to punish you for the disgusting things you have done, so that you will know that I am the Lord and that I am the one who punishes you.”"},{"num":10,"verse":"The day of disaster is coming. Violence is flourishing. Pride is at its height. "},{"num":11,"verse":"Violence produces more wickedness. Nothing of theirs will remain, nothing of their wealth, their splendor, or their glory."},{"num":12,"verse":"The time is coming. The day is near when buying and selling will have no more meaning, because God's punishment will fall on everyone alike. "},{"num":13,"verse":"No merchants will live long enough to get back what they have lost, because God's anger is on everyone. Those who are evil cannot survive. "},{"num":14,"verse":"The trumpet blows, and everyone gets ready. But no one goes off to war, for God's anger will fall on everyone alike."},{"header":"Punishment for Israel's Sins"},{"num":15,"verse":"There is fighting in the streets, and sickness and hunger in the houses. Anyone who is out in the country will die in the fighting, and anyone in the city will be a victim of sickness and hunger. "},{"num":16,"verse":"Some will escape to the mountains like doves frightened from the valleys. All of them will moan over their sins. "},{"num":17,"verse":"Everyone's hands will be weak, and their knees will shake. "},{"num":18,"verse":"They will put on sackcloth and they will tremble all over. Their heads will be shaved, and they will all be disgraced. "},{"num":19,"verse":"They will throw their gold and silver away in the streets like garbage, because neither silver nor gold can save them when the Lord pours out his fury. They cannot use it to satisfy their desires or fill their stomachs. Gold and silver led them into sin. "},{"num":20,"verse":"Once they were proud of their beautiful jewels, but they used them to make disgusting idols. That is why the Lord has made their wealth repulsive to them."},{"num":21,"verse":"“I will let foreigners rob them,” says the Lord, “and lawbreakers will take all their wealth and defile it. "},{"num":22,"verse":"I will not interfere when my treasured Temple is profaned, when robbers break into it and defile it."},{"num":23,"verse":"“Everything is in confusion—the land is full of murders and the cities are full of violence. "},{"num":24,"verse":"I will bring the most evil nations here and let them have your homes. Your strongest men will lose their confidence when I let the nations profane the places where you worship. "},{"num":25,"verse":"Despair is coming. You will look for peace and never find it. "},{"num":26,"verse":"One disaster will follow another, and a steady stream of bad news will pour in. You will beg the prophets to reveal what they foresee. The priests will have nothing to teach the people, and the elders will have no advice to give. "},{"num":27,"verse":"The king will mourn, the prince will give up hope, and the people will shake with fear. I will punish you for all you have done, and will judge you in the same way as you have judged others. This will show you that I am the Lord.”"}]