[{"header":"Ezekiel Tells of the End"},{"num":7,"verse":"Again the Lord spoke his word to me. He said: "},{"num":2,"verse":"“Human being, the Lord says this to the land of Israel: An end! The end has come on the four corners of the land. "},{"num":3,"verse":"Now the end has come for you. I will send my anger against you. I will judge you for the way you have lived. I will make you pay for your terrible actions. "},{"num":4,"verse":"I will have no pity on you. I will not hold back punishment from you. I will make you pay for your ways and for your terrible actions. Then you will know that I am the Lord."},{"num":5,"verse":"“This is what the Lord God says: Disaster on top of disaster is coming. "},{"num":6,"verse":"The end has come! The end has come! It has stirred itself up against you! Look! It has come! "},{"num":7,"verse":"The end has come for you who live in the land! The time has come. The day of confusion is near. There will be no happy shouting on the mountains. "},{"num":8,"verse":"Soon I will pour out my anger against you. I will carry out my anger against you. I will judge you for the way you have lived. I will make you pay for all the things you have done that I hate. "},{"num":9,"verse":"I will show no pity. I will not hold back punishment. I will pay you back for the way you have lived and the terrible things you have done. Then you will know that I am the Lord who punishes."},{"num":10,"verse":"“Look, the day is here. It has come. Destruction has come. Violence has grown. There is more pride than ever. "},{"num":11,"verse":"Violence has grown into a weapon for punishing wickedness. None of the people will be left. None of that crowd, none of their wealth, and nothing of value will be left among them. "},{"num":12,"verse":"The time has come. The day has arrived. Don’t let the buyer be happy or the seller be sad. My burning anger is against the whole crowd. "},{"num":13,"verse":"Sellers will not return to the land they have sold as long as they live. This is because the vision against all that crowd will not be changed. Because of their sins, no one will save his life. "},{"num":14,"verse":"They have blown the trumpet, and everything is ready. But no one is going to the battle. My anger is against all that crowd."},{"num":15,"verse":"“The sword is outside. Disease and hunger are inside. The person who is in the field will die by the sword. Hunger and disease will destroy those in the city. "},{"num":16,"verse":"Those who are left alive and who escape will be on the mountains. They will moan like doves of the valleys. Each person will groan about his own sin. "},{"num":17,"verse":"All hands will hang weakly. All knees will become as weak as water. "},{"num":18,"verse":"They will put on rough cloth to show how sad they are. They will tremble all over with fear. Their faces will show their shame. And all their heads will be shaved. "},{"num":19,"verse":"The people will throw their silver into the streets. Their gold will be like trash. Their silver and gold will not save them from the Lord’s anger. It will not satisfy their hunger or fill their stomachs. It was what caused them to fall into sin. "},{"num":20,"verse":"They were proud of their beautiful jewelry. They used it to make their idols, which I hate, and their evil statues. So I will turn their wealth into something they hate. "},{"num":21,"verse":"And I will give it to the foreigners as treasures from war. I will give it to the evil people of the earth as treasure. These foreigners and evil people will dishonor the people’s jewelry. "},{"num":22,"verse":"I will also turn away from the people of Israel. They will dishonor my treasured place. Then robbers will enter and dishonor it."},{"num":23,"verse":"“Make chains for captives. The land is full of bloody crimes. And the city is full of violence. "},{"num":24,"verse":"So I will bring the worst of the nations to take over the people’s houses. I will also end the pride of the rich. And their holy places will be dishonored. "},{"num":25,"verse":"When the people are suffering greatly, they will look for peace. But there will be none. "},{"num":26,"verse":"Disaster will come on top of disaster. Rumor will be added to rumor. Then they will try to get a vision from a prophet. Even the teachings of God from the priest will be lost. And advice from the elders will also be lost. "},{"num":27,"verse":"The king will cry greatly. The prince will give up hope. The hands of the people who owned land will shake with fear. I will punish them for the way they have lived. The way they have judged others is the way I will judge them. Then they will know that I am the Lord.”"}]