[{"num":7,"verse":"Moreover the Devar Hashem came unto me, saying,"},{"num":2,"verse":"Also, thou ben adam, thus saith Adonoi Hashem unto Eretz Yisroel: Ketz (End), the End is come upon the four corners of ha’aretz."},{"num":3,"verse":"Now is the Ketz (End, Doom) come upon thee, and I will send Mine anger upon thee, and will judge thee according to thy drakhim, and will repay thee for all thine to’avot (abominations)."},{"num":4,"verse":"And Mine eye shall not pity thee, neither will I spare; but I will repay thy drakhim upon thee, and thine to’avot shall be in the midst of thee; and ye shall know that I am Hashem."},{"num":5,"verse":"Thus saith Adonoi Hashem; A ra’ah, a singular ra’ah, hinei, has come."},{"num":6,"verse":"Ketz is come, the ketz is come; it is ripe for thee; hinei, it is come."},{"num":7,"verse":"The Tzefirah (the Web) is come upon thee, O thou that dwellest in ha’aretz; the time is come, the Yom Mehumah (Day of Panic) is near, and not of rejoicing in the harim."},{"num":8,"verse":"Now will I shortly pour out My fury upon thee, and spend Mine anger upon thee; and I will judge thee according to thy drakhim, and will repay thee for all thine to’avot."},{"num":9,"verse":"And Mine eye shall not pity, neither will I spare; I will repay thee according to thy drakhim and thine to’avot that are in the midst of thee; and ye shall know that I am Hashem that striketh."},{"num":10,"verse":"Hinei, the Yom, hinei, it is come; The Tzefirah (Web) is gone forth; the mateh (rod) hath blossomed, zadon (pride) hath budded."},{"num":11,"verse":"Chamas is risen up into mateh resha (a rod of wickedness); none of them shall remain, nor of their tumult, nor of any of their’s; none of their preeminence."},{"num":12,"verse":"The time is come, the day draweth near; let not the koneh (buyer) rejoice, nor the mokher (seller) mourn; for charon (wrath) is upon all the multitude thereof."},{"num":13,"verse":"For the mokher (seller) shall not return to that which is sold, as long as his life is alive; for the chazon (vision) concerns the whole multitude thereof, which shall not be reversed; neither shall any strengthen himself in the avon of his life."},{"num":14,"verse":"They have blown the trumpet, even to make all ready; but none goeth to the milchamah; for My charon (wrath) is upon all the multitude thereof."},{"num":15,"verse":"The cherev is outside, and the dever and the ra’av (famine) inside; he that is in the sadeh shall die with the cherev; and he that is in the Ir, ra’av (famine) and dever shall devour him."},{"num":16,"verse":"But they that survive of them shall escape, and shall be on the harim like doves of the ge’ayot (valleys), all of them moaning, every one for his avon."},{"num":17,"verse":"All hands shall go limp, and all birkayim (knees) shall be weak as mayim."},{"num":18,"verse":"They shall also gird themselves with sackcloth, and terror shall cover them; and bushah (shame) shall be upon all faces, and shaved scalps [the sign of mourning] upon all their heads."},{"num":19,"verse":"They shall cast their kesef in the streets, and their zahav shall be like niddah; their kesef and their zahav shall not be able to save them in the Yom Evrat Hashem (Day of the Wrath of Hashem); they shall not satisfy their nefashot, neither fill their stomachs; for it has become the stumbling block of their avon."},{"num":20,"verse":"As for the beauty of his jewelry, he set it in ga’on (pride); but they made the tzelem of their to’avot and of their shikkutzim therein; therefore I will make it like niddah to them."},{"num":21,"verse":"And I will give it into the hands of the zarim (strangers) for plunder, and to the resha’im of ha’aretz for loot; and they shall defile it."},{"num":22,"verse":"My face will I turn also from them, and they shall desecrate My treasure; for the robbers shall enter into it [i.e., Yerushalayim], and defile it."},{"num":23,"verse":"Make a chain; for ha’aretz is full of mishpat damim, and the ir is full of chamas."},{"num":24,"verse":"Therefore I will bring the worst of the Goyim, and they shall possess their batim (houses); I will also make the ga’on (pride) of the mighty to cease; and their mikdashim (holy places) shall be defiled."},{"num":25,"verse":"Terror cometh; and they shall seek shalom, and there shall be none."},{"num":26,"verse":"Disaster shall come upon disaster, and rumor shall be upon rumor; then shall they seek a chazon (vision) from the navi; but the torah shall perish from the kohen, and etzah from the zekenim (elders)."},{"num":27,"verse":"HaMelech shall mourn, and the nasi shall be clothed with despair, and the hands of the am ha’aretz shall fearfully tremble; I will do unto them according to their derech, and according to their mishpatim will I judge them; and they shall know that I am Hashem."}]