[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mirth . . . Cease.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The mirth is here indicative of the general character of the ceremonial—certainly not in itself a bad sign. David danced before the Lord, and justified the act. No one was to appear with sad countenance before Jehovah, any more than before an earthly potentate. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The “feast days” are to be distinguished from the “solemn feasts.” The latter term is more generic in Hebrew, while the former denoted the three great festivals of the year (especially the Feast of Tabernacles). These feasts, which Jeroboam I. had instituted, are not spoken of in themselves as sinful.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:6-13 God threatens what he would do with this treacherous, idolatrous people. They did not turn, therefore all this came upon them; and it is written for admonition to us. If lesser difficulties be got over, God will raise greater. The most resolute in sinful pursuits, are commonly most crossed in them. The way of God and duty is often hedged about with thorns, but we have reason to think it is a sinful way that is hedged up with thorns. Crosses and obstacles in an evil course are great blessings, and are to be so accounted; they are God's hedges, to keep us from transgressing, to make the way of sin difficult, and to keep us from it. We have reason to bless God for restraining grace, and for restraining providences; and even for sore pain, sickness, or calamity, if it keeps us from sin. The disappointments we meet with in seeking for satisfaction from the creature, should, if nothing else will do it, drive us to the Creator. When men forget, or consider not that their comforts come from God, he will often in mercy take them away, to bring them to think upon their folly and danger. Sin and mirth can never hold long together; but if men will not take away sin from their mirth, God will take away mirth from their sin. And if men destroy God's word and ordinances, it is just with him to destroy their vines and fig-trees. This shall be the ruin of their mirth. Taking away the solemn seasons and the sabbaths will not do it, they will readily part with them, and think it no loss; but He will take away their sensual pleasures. Days of sinful mirth must be visited with days of mourning.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will also cause her mirth to cease, her feast days ... - Israel had forsaken the temple of God; despised His priests; received from Jeroboam others whom God had not chosen; altered, at least, one of the festivals; celebrated all, where God had forbidden; and worshiped the Creator under the form of a brute creature (see Introduction). Yet they kept the great \"feast-days,\" whereby they commemorated His mercies to their forefathers; the \"new moons,\" whereby the first of every month was given to God; \"the sabbaths,\" whereby they owned God as the Creator of all things; and all the other \"solemn feasts,\" whereby they thanked God for acts of His special providence, or for His annual gifts of nature, and condemned themselves for trusting in false gods for those same gifts, and for associating His creatures with Himself. But man, even while he disobeys God, does not like to part with Him altogether, but would serve Him enough to soothe his own conscience, or as far as he can without parting with his sin which he loves better. Jeroboam retained all of God's worship, which he could combine with his own political ends; and even in Ahab's time Israel \"halted between two opinions,\" and Judah \"sware both by the Lord and by Malcham\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the true God and the false. All this their worship was vain, because contrary to the will of God. Yet since God says, \"I will take away all her mirth,\" they had, what they supposed to be, religious \"mirth\" in their \"feasts,\" fulfilling as they thought, the commandment of God, \"Thou shalt rejoice in thy feasts\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". She could have no real joy, since true joy is \"in the Lord\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Philippians 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So, in order that she might not deceive herself anymore, God says that he will take away that feigned formal service of Himself, which they blended with the real service of idols, and will remove the hollow outward joy, that, through repentance, they might come to the true joy in Him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. her feast days—of Jeroboam's appointment, distinct from the Mosaic (1Ki 12:32). However, most of the Mosaic feasts, \"new-moons\" and \"sabbaths\" to Jehovah, remained, but to degenerate Israel worship was a weariness; they cared only for the carnal indulgence on them (Am 8:5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will also cause all her mirth to cease; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the jollity of Israel was certainly damped when Tiglath-pileser took Ijon, and other cities, and captivated Naphtali, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 15:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which was some, yet but few, years after this prophecy: but sure all their joy ceased about ten or twelve years after, when Samaria was taken, and Hoshea and all Israel made captives: so the threat was executed in this sense. But the prophet speaks (as by what follows appeareth) of their sacred or religious joys, which God will abolish. He did not set them up, but he will pull them down. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Her feast days:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though apostate Israel was fallen to idolatry, and renounced the true worship of God, yet by this text it appears they retained many of the rites and ceremonies that were used by the Jews, or else set up others like them, as their solemn feast at setting up the calves at Dan and Beth-el, in Jeroboam’s time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "New moons:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these were days of greater sacrifices, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 28:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 28:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and greater feasting, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 20:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 20:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sabbaths; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their weekly sabbaths. All her solemn feasts; the three annual feasts of tabernacles, weeks, and passover, or others with them, all which should cease when these people were carried captive, as they were by Shalmaneser. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will also cause all her mirth to cease,.... As it must in course, this being her case, as before described, whether considered in individuals, or as a body politic, or in their church state, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "her feast days; which the Jews understand of the three feasts of tabernacles, passover, and pentecost; typical of Christ's tabernacling in human nature; of his being the passover sacrificed for us; and of the firstfruits of the Spirit; which being come, the shadows are gone and vanished, and these feasts are no more: her new moons, and her sabbaths; the first day of every month, and the seventh day of every week, observed for religious exercises; typical of the light the church receives from Christ, and the rest it has in him; and he, the body and substance of them, being come, these are no more, Colossians 2:16, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "her feast days; which the Jews understand of the three feasts of tabernacles, passover, and pentecost; typical of Christ's tabernacling in human nature; of his being the passover sacrificed for us; and of the firstfruits of the Spirit; which being come, the shadows are gone and vanished, and these feasts are no more: her new moons, and her sabbaths; the first day of every month, and the seventh day of every week, observed for religious exercises; typical of the light the church receives from Christ, and the rest it has in him; and he, the body and substance of them, being come, these are no more, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and all her solemn feasts; all others, whether of God's appointment or their own; all are made to cease of right, if not in fact; the law of commandments, contained in ordinances, being abolished by Christ, and the Jews without a priest, sacrifice, and ephod, Ephesians 2:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and all her solemn feasts; all others, whether of God's appointment or their own; all are made to cease of right, if not in fact; the law of commandments, contained in ordinances, being abolished by Christ, and the Jews without a priest, sacrifice, and ephod, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I will also cause all her mirth to cease, her feast days, her new moons, and her sabbaths, and all her solemn feasts.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "her feast days, her new moons, and her sabbaths",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] (The Hebrew has the singular, ‘her feast-day’ &c.) These expressions are remarkable, for Hosea is a prophet of northern Israel. It would appear, then, that the separation of north and south did not involve a discontinuance of the festivals in the north (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Amos had already predicted the ruin of the ‘feasts’ in N. Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In addition to the ‘feasts’ which are doubtless those mentioned in the earliest body of legislation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.), Hosea specifies the new moon and the sabbath (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as passing away together with the national independence. This was not strictly speaking the case with regard to the sabbath, which became one great bond of union among the Jews in exile. But the old, popular sabbath of unrestrained joy (comp. Hosea’s ‘all her mirth’) did pass away; the sabbath of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 58:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was very different from that which was popularly observed in ancient Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and all her solemn feasts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "festal assemblies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The term is more comprehensive than ‘feast’; the Levitical legislation recognizes seven ‘festal assemblies’, but only three ‘feasts’ (comp. Lev. 33).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will also cause all her mirth to cease, her feast days, her new moons, and her sabbaths, and all her solemn feasts.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The enumeration is complete, \"Her feast days\" were the three annual festivals of Passover, Pentecost, and Tabernacles. \"Her new moons\" were the monthly celebrations at the commencement of each month. \"Her sabbaths\" were the weekly solemnities of one day in seven, dedicated to the Lord. Then there is a general summing up of the whole by the addition of \"all her solemn feasts,\" - all her festal days and seasons, including, besides those named, the beginning of the years, the solemn assembly or holy convocation on the seventh day of the Passover and on the eighth day of Tabernacles. Preceding the enumeration is the general ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "characteristic",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of all Israel's festivities. They were times of joy, as we read in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"In the day of your gladness, and in your solemn days, and in the beginnings of your months, ye shall blow with the trumpets;\" and in Dent. 12:12 it is expressly declared, \"Ye shall rejoice before the Lord... ye, and your sons, and your daughters, and your menservants, and your maidservants, and the Levite that is within your gates.\" All this was to cease; the coming captivity would render all such celebrations impossible. Kimchi remarks on this (ver. 11): \"For in the distress there is no new moon and no sabbath; and the beginnings of months and sabbaths on which offerings were presented were days of joy. And so with respect to the feast days and solemn assemblies, which were days of rest and quiet joy, they shall not have in them any joy in consequence of the greatness of their distresses.\" He subsequently adds, \"There is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "chag",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is not a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "raced",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but joy wherewith men rejoice and eat and drink; and it is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "chag",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" referring to Solomon's feast of dedication; \"and there is also a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "moed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is not a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "chag",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as for signs and for seasons (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "moedim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and at the appointed time I will return unto thee\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "raced",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יער",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to appoint as time and place). Hosea 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And now will I uncover her shame before her lovers, and no one shall tear her out of my hand.\" The ἅπ. λεγ. נבלוּה, lit., a withered state, from נבל, to be withered or faded, probably denotes, as Hengstenberg says, corpus multa stupra passum, and is rendered freely in the lxx by ἀκαθαρσία. \"Before the eyes of the lovers,\" i.e., not so that they shall be obliged to look at it, without being able to avoid it, but so that the woman shall become even to them an object of abhorrence, from which they will turn away (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In this concrete form the general truth is expressed, that \"whoever forsakes God for the world, will be put to shame by God before the world itself; and that all the more, the nearer it stood to Him before\" (Hengstenberg). By the addition of the words \"no one,\" etc., all hope is cut off that the threatened punishment can be averted (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This punishment is more minutely defined in Hosea 2:11-13, in which the figurative drapery is thrown into the background by the actual fact. Hosea 2:11. \"And I make all her joy keep holiday (i.e., cease), her feast, and her new moon, and her sabbath, and all her festive time.\" The feast days and festive times were days of joy, in which Israel was to rejoice before the Lord its God. To bring into prominence this character of the feasts, כּל־משׂושׂהּ, \"all her joy,\" is placed first, and the different festivals are mentioned afterwards. Châg stands for the three principal festivals of the year, the Passover, Pentecost, and the feast of Tabernacles, which had the character of châg, i.e., of feasts of joy par excellence, as being days of commemoration of the great acts of mercy which the Lord performed on behalf of His people. Then came the day of the new moon every month, and the Sabbath every week. Finally, these feasts are all summed up in כּל־מועדהּ; for מועד, מועדים is the general expression for all festive seasons and festive days (Leviticus 23:2, Leviticus 23:4). As a parallel, so far as the facts are concerned, comp. Amos 8:10; Jeremiah 7:34, and Lamentations 1:4; Lamentations 5:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This punishment is more minutely defined in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:11-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in which the figurative drapery is thrown into the background by the actual fact. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"And I make all her joy keep holiday (i.e., cease), her feast, and her new moon, and her sabbath, and all her festive time.\" The feast days and festive times were days of joy, in which Israel was to rejoice before the Lord its God. To bring into prominence this character of the feasts, כּל־משׂושׂהּ, \"all her joy,\" is placed first, and the different festivals are mentioned afterwards. Châg stands for the three principal festivals of the year, the Passover, Pentecost, and the feast of Tabernacles, which had the character of châg, i.e., of feasts of joy par excellence, as being days of commemoration of the great acts of mercy which the Lord performed on behalf of His people. Then came the day of the new moon every month, and the Sabbath every week. Finally, these feasts are all summed up in כּל־מועדהּ; for מועד, מועדים is the general expression for all festive seasons and festive days (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As a parallel, so far as the facts are concerned, comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 8:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 5:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]