[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Set her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—Reduce Israel to the destitute exposed condition in which she struggled into being in Egyptian bondage, and endured the wanderings and terrors of the wilderness. Probably we have here an allusion to the custom of female infanticide, which still prevails very widely in the East, as it did in the ancient world, the child being simply abandoned to death on the day that she was born. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 2:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lest I strip her naked, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The punishment frequently inflicted upon harlots was, to strip them naked and expose them to the world. The punishment of adulteresses among the Germans is thus described by Tacitus, “Accisis crinibus nudatam coram propinguis expellit domo maritus.” Or the allusion may be to the ignominy which brutal conquerors sometimes inflicted on the captives they took in war, by stripping them of their clothing and causing them to travel in that condition, exposed to the inclemency of the weather, and, which was yet worse, to the intolerable heat of the sun: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus God threatens to deal with the Israelites: to deliver them into the hands of their enemies, and carry them away naked into captivity, (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) in as forlorn and desolate a condition as they were in during their bondage in Egypt. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And make her as a wilderness — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A state of captivity is fitly compared to being placed in a wilderness, in want of common necessaries: compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 19:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “It may seem harsh,” says Bishop Horsley, “to say of a woman that she shall be laid waste like a wilderness, and reduced to the condition of a parched land. But it is to be observed that the allegorical style makes an intercommunity of attributes between the type and the thing typified. So that when a woman is the image of a country or of a church, that may be said of a woman, which, in unfigured language, might be said of the country, or the church, which she represents. The country might literally be made a waste wilderness, by unfruitful seasons, by the devastations of war, or of noxious vermin: a church is made a wilderness and a parched land, when the living waters of the Spirit are withheld.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-5 This chapter continues the figurative address to Israel, in reference to Hosea's wife and children. Let us own and love as brethren, all whom the Lord seems to put among his children, and encourage them in that they have received mercy. But every Christian, by his example and conduct, must protest against evil and abuses, even among those to whom he belongs and owes respect. Impenitent sinners will soon be stripped of the advantages they misuse, and which they consume upon their lusts.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Lest I strip her naked - \"There is an outward visible nakedness and an inward, which is invisible. The invisible nakedness is, when the soul within is bared of the glory and the grace of God.\" The visible nakedness is the privation of God's temporal and visible gifts, the goods of this world, or outward distinction. God's inward gifts the sinful soul or nation despises, while those outward gifts she prizes. And therefore, when the soul parts with the inward ornaments of God's grace, He strips her of the outward, His gifts of nature, of His providence and of His protection, if so be, through her outward misery and shame and poverty, she may come to feel that deeper misery and emptiness and disgrace within, which she had had no heart to feel. So, when our first parents lost the robe of innocence, \"they knew that they were naked\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And set her - (Literally \"I will fix her,\" so that she shall have no power to free herself, but must remain as a gazing stock,) \"as in the day that she was born,\" i. e., helpless, defiled, uncleansed, uncared for, unformed, cast out and loathsome. Such she was in Egypt, which is in Holy Scripture spoken of, as her birthplace Ezekiel 16:4; for there she first became a people; thence the God of her fathers called her to be His people. There she was naked of the grace and of the love of God, and of the wisdom of the law; indwelt by an evil spirit, as being an idolatress; without God; and under hard bondage, in works of mire and clay, to Pharaoh, the type of Satan, and her little ones a prey. For when a soul casts off the defense of heavenly grace, it is an easy prey to Satan.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And set her - (Literally \"I will fix her,\" so that she shall have no power to free herself, but must remain as a gazing stock,) \"as in the day that she was born,\" i. e., helpless, defiled, uncleansed, uncared for, unformed, cast out and loathsome. Such she was in Egypt, which is in Holy Scripture spoken of, as her birthplace ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for there she first became a people; thence the God of her fathers called her to be His people. There she was naked of the grace and of the love of God, and of the wisdom of the law; indwelt by an evil spirit, as being an idolatress; without God; and under hard bondage, in works of mire and clay, to Pharaoh, the type of Satan, and her little ones a prey. For when a soul casts off the defense of heavenly grace, it is an easy prey to Satan.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And make her as a wilderness, and set her as a dry land, and slay her with thirst - The outward desolation, which God inflicts, is a picture of the inward. Drought and famine are among the four sore judgments, with which God threatened the land, and our Lord forewarned them, \"Your house is left unto you desolate\" Matthew 23:38; and Isaiah says, \"Whereas thou hast been forsaken and hated, so that no man went through thee\" Isaiah 60:15. But the prophet does not say, make her a wilderness, but make \"her as a wilderness.\" The soul of the sinner is solitary and desolate, for it has not the presence of God; unfruitful, bearing briars and thorns only, for it is unbedewed by God's grace, unwatered by the Fountain of living waters; athirst, \"not with thirst for water, but of hearing the word of the Lord,\" yet also, burning with desire, which the foul streams of this world's pleasure never slake. In contrast with such thirst, Jesus says of the Holy Spirit which He would give to them that believe in Him, \"Whosoever drinketh of the water, that I shall give him, shall never thirst; but the water, that I shall give him, shall be in him a well of water, springing up into everlasting life\" John 4:14; John 7:38-39.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And make her as a wilderness, and set her as a dry land, and slay her with thirst - The outward desolation, which God inflicts, is a picture of the inward. Drought and famine are among the four sore judgments, with which God threatened the land, and our Lord forewarned them, \"Your house is left unto you desolate\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 23:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Isaiah says, \"Whereas thou hast been forsaken and hated, so that no man went through thee\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But the prophet does not say, make her a wilderness, but make \"her as a wilderness.\" The soul of the sinner is solitary and desolate, for it has not the presence of God; unfruitful, bearing briars and thorns only, for it is unbedewed by God's grace, unwatered by the Fountain of living waters; athirst, \"not with thirst for water, but of hearing the word of the Lord,\" yet also, burning with desire, which the foul streams of this world's pleasure never slake. In contrast with such thirst, Jesus says of the Holy Spirit which He would give to them that believe in Him, \"Whosoever drinketh of the water, that I shall give him, shall never thirst; but the water, that I shall give him, shall be in him a well of water, springing up into everlasting life\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 7:38-39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": ": \"But was not that certain, which God had said, 'I will no more have mercy on the house of Israel?' How then does God recall it, saying, 'Let her put away her fornications, etc. lest I do to her this or that which I have spoken?' This is not unlike to that, when sentence had been passed on Nebuchadnezzar, Daniel saying, 'This is the decree of the Most High, which is come upon my Lord the king; they shall drive thee from men, and thy dwelling; the same Daniel says, Wherefore, O king, let my counsel be acceptable unto thee, and redeem thy sins by righteousness, and thine iniquities by shewing mercy on the poor, if it may be a lengthening of thy tranquility' Daniel 4:24-25, Daniel 4:27. What should we learn hereby, but that it hangs upon our own will, whether God suspend the judgment or no? For we ought not to impute our own evil to God, or impiously think that fate rules us. In other words, this or that evil comes, not because God foreknew or foreordained it; but, because this evil was to be, or would be done, therefore God both foreknew it, and prefixed His sentence upon it. Why then does God predetermine an irrevocable sentence? Because He foresaw incorrigible malice. Why, again, after pronouncing sentence, doth God counsel amendment? That we may know by experience, that they are incorrigible. Therefore, He waits for them, although they will not return, and with much patience invites them to repentance.\" Individuals also repented, although the nation was incorrigible. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ": \"But was not that certain, which God had said, 'I will no more have mercy on the house of Israel?' How then does God recall it, saying, 'Let her put away her fornications, etc. lest I do to her this or that which I have spoken?' This is not unlike to that, when sentence had been passed on Nebuchadnezzar, Daniel saying, 'This is the decree of the Most High, which is come upon my Lord the king; they shall drive thee from men, and thy dwelling; the same Daniel says, Wherefore, O king, let my counsel be acceptable unto thee, and redeem thy sins by righteousness, and thine iniquities by shewing mercy on the poor, if it may be a lengthening of thy tranquility' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:24-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". What should we learn hereby, but that it hangs upon our own will, whether God suspend the judgment or no? For we ought not to impute our own evil to God, or impiously think that fate rules us. In other words, this or that evil comes, not because God foreknew or foreordained it; but, because this evil was to be, or would be done, therefore God both foreknew it, and prefixed His sentence upon it. Why then does God predetermine an irrevocable sentence? Because He foresaw incorrigible malice. Why, again, after pronouncing sentence, doth God counsel amendment? That we may know by experience, that they are incorrigible. Therefore, He waits for them, although they will not return, and with much patience invites them to repentance.\" Individuals also repented, although the nation was incorrigible. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. set her as in the day … born—(Eze 16:4; 23:25, 26, 28, 29). The day of her political \"birth\" was when God delivered her from the bondage of Egypt, and set up the theocracy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "make her as a wilderness—(Jer 6:8; Zep 2:13). Translate, \"make her as the wilderness,\" namely, that in which she passed forty years on her way to her goodly possession of Canaan. With this agrees the mention of \"thirst\" (compare Jer 2:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lest:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this little word suggests great hopes; if this treacherous wife will cease her lewdness, and become chaste, she may be forgiven; it reserves room for repentance and reconciliation, without these it threatens. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Strip her naked; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as was usually done by incensed husbands, divorcing impudent adulteresses: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 16:38,39 23:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",39 23:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". So God will strip her of all her ornaments which he gave; so he did gradually by Israel’s enemies the Assyrians, till at last by Shalmaneser she was stripped to the skin, and led away captive; God east her out thus by him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And set her as in the day that she was born:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is not much material to fix the period of this birth, but it is enough God threatens, as sometimes we do, an extreme, poor, desolate, and comfortless condition, by a kind of proverbial speech, as naked as ever born. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And make her as a wilderness:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this phrase may somewhat intimate the time of Israel’s birth, viz. between their going out of Egypt and the giving of the law, or their entering upon their travels in the wilderness. Their state was poor enough then, now it shall be as bad, or worse; they shall be as the wilderness, barren and desolate, affording nothing for life or delight, much less for profit: whereas adulteresses ordinarily hunt after profit and delights, God will punish adulterous Israel with denying both to her, she shall be like the wilderness, horrid and starving. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And set her like a dry land:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is much the same with the former, and added to confirm and illustrate it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And slay her:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all this shall be done to the end she may be destroyed: of old God led his people through the. wilderness to a city of habitation, now he will make them as the wilderness that they may perish in it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With thirst:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a miserable end, surely, thus to be scorched up with parching heat! so will God’s wrath burn up these wicked, idolatrous Israelites. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Lest I strip her naked, and set her as in the day that she was born,.... Alluding to the case of an infant when born, which comes naked into the world; and referring to the state and condition of the Israelites in Egypt, which was the time of their nativity, as a people and church; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and when they were in a state of servitude and bondage, and had no wealth and substance, and without possessions and lands, and had no country of their own to inhabit; and signifying that this should be their case again, if they persisted in their idolatry, impenitence, and unbelief; as has been the case of the ten tribes upon their captivity, when they were stripped of all their wealth and riches, carried away out of their own land, and scattered among the nations, and have never returned since; and as was the case of the Jews in their last destruction, for the rejection of Christ, they were stripped of their civil and religious privileges, of their temporal and spiritual mercies as a nation and church; what they feared is come upon them, that the Romans would come and take away their place and nation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:48",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and make her as a wilderness, and set her like a dry land; having some respect to her former condition in the wilderness, where they had no food nor drink but what they had from God, as Abarbinel thinks; or else to the destruction and consumption of them in the wilderness, their carcasses falling there, who sinned against the Lord, as the Targum and Jarchi; and denoting the utter destruction of their commonwealth and church, when their land was laid waste, their city destroyed, their house and temple left desolate and burnt, and they deprived of all the necessaries of life, which was their case at their last destruction by the Romans; and to this day they are as they are described, Hosea 3:4, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and make her as a wilderness, and set her like a dry land; having some respect to her former condition in the wilderness, where they had no food nor drink but what they had from God, as Abarbinel thinks; or else to the destruction and consumption of them in the wilderness, their carcasses falling there, who sinned against the Lord, as the Targum and Jarchi; and denoting the utter destruction of their commonwealth and church, when their land was laid waste, their city destroyed, their house and temple left desolate and burnt, and they deprived of all the necessaries of life, which was their case at their last destruction by the Romans; and to this day they are as they are described, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and slay her with thirst; after their vainly expected Messiah, which has brought them to desperation; or with a thirst, not for water, but of hearing the word of the Lord, Amos 8:11, the Gospel, and the ordinances of it, being taken away from them, and the clouds ordered to drop down no rain upon them; that is, the ministers of the word not to preach the Gospel to them; and so are left destitute of the means of grace, and of spiritual life, and of escaping eternal death, Matthew 21:43. The Targum of the whole is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and slay her with thirst; after their vainly expected Messiah, which has brought them to desperation; or with a thirst, not for water, but of hearing the word of the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Gospel, and the ordinances of it, being taken away from them, and the clouds ordered to drop down no rain upon them; that is, the ministers of the word not to preach the Gospel to them; and so are left destitute of the means of grace, and of spiritual life, and of escaping eternal death, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Targum of the whole is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"lest I remove my Shechinah from her, and take away her glory, and set her forsaken, as in the days of old, before she came to my worship; and my fury shall remain upon her, as it remained upon the people of that generation that transgressed my law in the wilderness; and I will set the land desolate, and kill her with thirst.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"lest I remove my Shechinah from her, and take away her glory, and set her forsaken, as in the days of old, before she came to my worship; and my fury shall remain upon her, as it remained upon the people of that generation that transgressed my law in the wilderness; and I will set the land desolate, and kill her with thirst.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Lest I strip her naked, and {d} set her as in the day that she was {e} born, and make her as a wilderness, and set her like a dry land, and slay her with thirst.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lest I strip her naked, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " set her as in the day that she was ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " born, and make her as a wilderness, and set her like a dry land, and slay her with thirst.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) For even though his people were as a harlot for their idolatries, yet he had left them with their dress and dowry and certain signs of his favour, but if they continued still, he would utterly destroy them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) When I brought her out of Egypt. See Geneva Eze 16:4",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lest I strip her naked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …] So far the punishment of the adulteress agrees with that customary among the Germans (Tac. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Germ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " §§ 18, 19). But the punishment of the Hebrew adulteress is not intended to stop here; death was the penalty she had to fear—death by strangling, according to the Rabbinical explanation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", death by stoning, according to Ezekiel in a passage which alludes to the present (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:39-40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But the prophet speaks here of neither form of punishment, but of death by thirst in the desert. The meaning of the allegory is, that the people of N. Israel shall be put to open shame, and deprived of the rich temporal blessings vouchsafed to them. At the beginning of Israel’s history, we see her, as it were, a homeless wanderer in the wilderness, with nothing either in her nature or in her surroundings to promise a longer existence than was enjoyed by many another of the Semitic pastoral tribes (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the close of her history, says the prophet, shall present an exactly similar picture. Observe in passing how nearly the ideas of ‘land’ and ‘people’ cover each other in the mind of Hosea. In fact, in the mythic stage of religion (from which Hosea’s countrymen had not as yet for the most part emerged), it was the land which was imagined as in direct relation to the deity, the people being only so related in virtue of their dwelling in the land. They were in fact the children of the land (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘bereave it,’ viz. the land); nationality, land, and religion were three inseparable ideas. Hence, though Hosea begins with the figure of disclothing, he glides insensibly into forms of expression appropriate to a land. ‘Lest I make her as the wilderness, and set her as a dry land, and slay her with thirst.’ The latter expression could of course be used of a wanderer in the desert, but was also allowable of a desolate region (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 19:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and comp. Koran 30:18).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Lest I strip her naked, and set her as in the day that she was born.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Lord, by his servant the prophet, enforces the preceding exhortation by a stern denunciation, and the threat of further severities unless averted by repentance; as an injured husband withdraws from a faithless wife all the gifts and presents he had made for her adornment, leaving her poor and bare. Not only the removal of her garments by way of degradation and disgrace, but exposure in that position to insult and ignominy would ensue. In other words, the nation is threatened with deprivation of all the blessings previously lavished upon them - property, prosperity, population, and privileges; while dishonor of the deepest dye would aggravate the misery. The day of the nation's birth denotes the weakness and wretchedness of their infant state. To this corresponded their servile, suffering condition during their bondage and oppression in Egypt. Rashi thus explains it; Kimchi says, \"The figure of birth is the time they are slaves in Egypt;\" so also Theodoret, - the latter calls the day of her birth the sojourn in Egypt. The Prophet Ezekiel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") expands the idea, occasionally employing, as Rosenmüller remarks, the very words of Hosea. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And make her as a wilderness, and set her like a dry land, and clay her with thirst.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This part of the verse is susceptible of two explanations. The faithless female, under which character the northern kingdom is personified, may be compared to a wilderness, that is, according to Cyril, fruitless, parched, and productive only of thorns, thirsty and waterless. This comparison of a woman to a desert is wanting in suitability, and seems in some degree awkward in itself, beside being out of harmony with the closing clause; for to \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "slay",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with thirst,\" however applicable to a person, cannot with any propriety be said of a place, whether desert or otherwise. No doubt the wilderness may stand for those dwelling in it. We prefer, therefore, the alternative rendering, \"make her as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a wilderness, and set her as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a dry land.\" Rashi aptly explains the threat to mean, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Lest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I pronounce against them such a sentence as of old in this desert (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), 'In this wilderness they shall be consumed, and there they shall die.'\" There ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", moreover, a natural connection of ideas between a wilderness, a dry land, and thirst. The nation's birth, represented by or compared to their sojourn in Egypt, naturally suggests the idea of their wandering in the wilderness after their exodus from that country; a wilderness, again, suggests what is an ordinary feature of such a district, namely, a dry land; while a region thus without water is suggestive as well as provocative of thirst. The former explanation, however, is given by Kimehi: \"I will make thee like the wilderness which is open to every one, and in which, moreover, one finds no means of subsistence, nor anything that man needs; so I'll withdraw my goodness from them, and they shall be surrendered as a prey to every one.\" Hosea 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "What the prophet announced in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:2-2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", partly by a symbolical act, and partly also in a direct address, is carried out still further in the section before us. The close connection between the contents of the two sections is formally indicated by the simple fact, that just as the first section closed with a summons to appropriate the predicted salvation, so the section before us commences with a call to conversion. As Rckert aptly says, \"The significant pair give place to the thing signified; Israel itself appears as the adulterous woman.\" The Lord Himself will set bounds to her adulterous conduct, i.e., to the idolatry of the Israelites. By withdrawing the blessings which they have hitherto enjoyed, and which they fancy that they have received from their idols, He will lead the idolatrous nation to reflection and conversion, and pour the fulness of the blessings of His grace in the most copious measure upon those who have been humbled and improved by the punishment. The threatening and the announcement of punishment extend from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the proclamation of salvation commences with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and reaches to the close of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The threatening of punishment is divided into two strophes, viz., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:2-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:8-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the first, the condemnation of their sinful conduct is the most prominent; in the second, the punishment is more fully developed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Reason with your mother, reason! for she is not my wife, and I am not her husband: that she put away her whoredom from her countenance, and her adultery from between her breasts.\" Jehovah is the speaker, and the command to get rid of the whoredom is addressed to the Israelites, who are represented as the children of the adulterous wife. The distinction between mother and children forms part of the figurative drapery of the thought; for, in fact, the mother had no existence apart from the children. The nation or kingdom, regarded as an ideal unity, is called the mother; whereas the several members of the nation are the children of this mother. The summons addressed to the children to contend or reason with this mother, that she may give up her adultery, presupposes that, although the nation regarded as a whole was sunken in idolatry, the individual members of it were not all equally slaves to it, so as to have lost their susceptibility for the divine warning, or the possibility of conversion. Not only had the Lord reserved to Himself seven thousand in Elijah's time who had not bowed their knees to Baal, but at all times there were many individuals in the midst of the corrupt mass, who hearkened to the voice of the Lord and abhorred idolatry. The children had reason to plead, because the mother was no longer the wife of Jehovah, and Jehovah was no longer her husband, i.e., because she had dissolved her marriage with the Lord; and the inward, moral dissolution of the covenant of grace would be inevitably followed by the outward, actual dissolution, viz., by the rejection of the nation. It was therefore the duty of the better-minded of the nation to ward off the coming destruction, and do all they could to bring the adulterous wife to desist from her sins. The object of the pleading is introduced with ותסר. The idolatry is described as whoredom and adultery. Whoredom becomes adultery when it is a wife who commits whoredom. Israel had entered into the covenant with Jehovah its God; and therefore its idolatry became a breach of the fidelity which it owed to its God, an act of apostasy from God, which was more culpable than the idolatry of the heathen. The whoredom is attributed to the face, the adultery to the breasts, because it is in these parts of the body that the want of chastity on the part of a woman is openly manifested, and in order to depict more plainly the boldness and shamelessness with which Israel practised idolatry.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The summons to repent is enforced by a reference to the punishment. Hosea 2:3. \"Lest I strip her naked, and put her as in the day of her birth, and set her like the desert, and make her like a barren land, and let her die with thirst.\" In the first hemistich the threat of punishment corresponds to the figurative representation of the adulteress; in the second it proceeds from the figure to the fact. In the marriage referred to, the husband had redeemed the wife out of the deepest misery, to unite himself with her. Compare Ezekiel 16:4., where the nation is represented as a naked child covered with filth, which the Lord took to Himself, covering its nakedness with beautiful clothes and costly ornaments, and entering into covenant with it. These gifts, with which the Lord also presented and adorned His wife during the marriage, He would now take away from the apostate wife, and put her once more into a state of nakedness. The day of the wife's birth is the time of Israel's oppression and bondage in Egypt, when it was given up in helplessness to its oppressors. The deliverance out of this bondage was the time of the divine courtship; and the conclusion of the covenant with the nation that had been brought out of Egypt, the time of the marriage. The words, \"I set (make) her like the desert,\" are to be understood as referring not to the land of Israel, which was to be laid waste, but to the nation itself, which was to become like the desert, i.e., to be brought into a state in which it would be destitute of the food that is indispensable to the maintenance of life. The dry land is a land without water, in which men perish from thirst. There is hardly any need to say that these words to not refer to the sojourn of Israel in the Arabian desert; for there the Lord fed His people with manna from heaven, and gave them water to drink out of the rock. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The summons to repent is enforced by a reference to the punishment. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Lest I strip her naked, and put her as in the day of her birth, and set her like the desert, and make her like a barren land, and let her die with thirst.\" In the first hemistich the threat of punishment corresponds to the figurative representation of the adulteress; in the second it proceeds from the figure to the fact. In the marriage referred to, the husband had redeemed the wife out of the deepest misery, to unite himself with her. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., where the nation is represented as a naked child covered with filth, which the Lord took to Himself, covering its nakedness with beautiful clothes and costly ornaments, and entering into covenant with it. These gifts, with which the Lord also presented and adorned His wife during the marriage, He would now take away from the apostate wife, and put her once more into a state of nakedness. The day of the wife's birth is the time of Israel's oppression and bondage in Egypt, when it was given up in helplessness to its oppressors. The deliverance out of this bondage was the time of the divine courtship; and the conclusion of the covenant with the nation that had been brought out of Egypt, the time of the marriage. The words, \"I set (make) her like the desert,\" are to be understood as referring not to the land of Israel, which was to be laid waste, but to the nation itself, which was to become like the desert, i.e., to be brought into a state in which it would be destitute of the food that is indispensable to the maintenance of life. The dry land is a land without water, in which men perish from thirst. There is hardly any need to say that these words to not refer to the sojourn of Israel in the Arabian desert; for there the Lord fed His people with manna from heaven, and gave them water to drink out of the rock. ",
            "children": []
          }
        ]
      }
    ]
  }
]