[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6-7) Contains a brief introductory prelude, summarizing the general contents of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:8-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jehovah addresses the adulterous wife: “I will erect impassable barriers that shall pierce and mangle her flesh. The path of evil shall be a path of thorns.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hedge up . . . and make a wall.—In accordance with most Hebrew texts, the literal rendering is, wall up her wall. Here, again, we have a sudden change of person.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Hedge up . . . and make a wall.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In accordance with most Hebrew texts, the literal rendering is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "wall up her wall.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Here, again, we have a sudden change of person.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "She shall . . .—She may anticipate in her exile closer proximity to her idol-lovers, but in respect of national prosperity or religious satisfaction she will make complete mistake.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "She shall",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " . . .—She may anticipate in her exile closer proximity to her idol-lovers, but in respect of national prosperity or religious satisfaction she will make complete mistake.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 2:6-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:6-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore I will hedge up thy way with thorns, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That is, with difficulties and distresses; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and make a wall — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "גדרה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a stone fence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I will effectually block up her way, and surround her with great calamities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That she shall not find her paths — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That she shall not know which way to turn to extricate herself from them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And she shall follow after her lovers — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "She shall seek for help of her idols, and her idolatrous allies, but shall receive none. Or, as Archbishop Newcome paraphrases the words, “For some time she shall remain addicted to her Egyptian and Syrian idols, and to all her former idolatrous and immoral practices: but without carrying her evil wishes into execution.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "She shall seek them, but not find them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A proverbial expression denoting lost labour. She shall seek for favour and succour at her lovers’ hands, but all in vain, they shall all forsake her, and change their ancient love into mortal hatred. “It is the usual practice of the devil and his instruments,” says an old writer, “to bring men into the briers and thorns, and there to leave them to shift as they can. Thus the Pharisees dealt by Judas; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What is that to us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "say they, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "see thou to that: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "they left him when they had led him to his ruin.” God deals very differently with his people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As in very faithfulness he afflicts them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that he may be true to their best interests: so when they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "follow hard after him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and seek him as David did, they are sure to find him; if they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "search for him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all their heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When they meet with disappointments it is in mercy, and they are ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chastened of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may not be condemned ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "with the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then shall she say, I will return to my first husband, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Her afflictions will bring her to a sense of her duty, and of the happiness she enjoyed as long as she cleaved steadfastly unto Jehovah the true God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:6-13 God threatens what he would do with this treacherous, idolatrous people. They did not turn, therefore all this came upon them; and it is written for admonition to us. If lesser difficulties be got over, God will raise greater. The most resolute in sinful pursuits, are commonly most crossed in them. The way of God and duty is often hedged about with thorns, but we have reason to think it is a sinful way that is hedged up with thorns. Crosses and obstacles in an evil course are great blessings, and are to be so accounted; they are God's hedges, to keep us from transgressing, to make the way of sin difficult, and to keep us from it. We have reason to bless God for restraining grace, and for restraining providences; and even for sore pain, sickness, or calamity, if it keeps us from sin. The disappointments we meet with in seeking for satisfaction from the creature, should, if nothing else will do it, drive us to the Creator. When men forget, or consider not that their comforts come from God, he will often in mercy take them away, to bring them to think upon their folly and danger. Sin and mirth can never hold long together; but if men will not take away sin from their mirth, God will take away mirth from their sin. And if men destroy God's word and ordinances, it is just with him to destroy their vines and fig-trees. This shall be the ruin of their mirth. Taking away the solemn seasons and the sabbaths will not do it, they will readily part with them, and think it no loss; but He will take away their sensual pleasures. Days of sinful mirth must be visited with days of mourning.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore - that is, because she said, \"I will go after my lovers,\" \"behold I will hedge up thy ways;\" literally, \"behold, I hedging.\" It expresses an immediate future, or something which, as being fixed in the mind of God, is as certain as if it were actually taking place. So swift and certain should be her judgments.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thy way - God had before spoken of Israel; now He turns to her, pronouncing judgment upon her; then again He turneth away from her, as not deigning to regard her. \"If the sinner's way were plain, and the soul still had temporal prosperity, after it had turned away from its Creator, scarcely or never could it be recalled, nor would it \"hear the voice behind it,\" warning it. But when adversity befalls it, and tribulation or temporal difficulties overtake it in its course, then it remembers the Lord its God.\" So it was with Israel in Egypt. When \"they sat by the flesh pots, and did eat bread to the full, amid the fish, which they did eat freely, the cucumbers and the melons,\" they forgat the God of their fathers, and served the idols of Egypt. Then He raised up \"a new king, who made their lives bitter with hard bondage, in mortar and in brick and in all the service of the field;\" then \"they groaned by reason of the bondage, and they cried, and their cry came up unto God by reason of their bondage, and God heard their groaning\" Exodus 16:3; Numbers 11:5; Exodus 1:8, Exodus 1:14; Exodus 2:23, Exodus 2:4.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thy way - God had before spoken of Israel; now He turns to her, pronouncing judgment upon her; then again He turneth away from her, as not deigning to regard her. \"If the sinner's way were plain, and the soul still had temporal prosperity, after it had turned away from its Creator, scarcely or never could it be recalled, nor would it \"hear the voice behind it,\" warning it. But when adversity befalls it, and tribulation or temporal difficulties overtake it in its course, then it remembers the Lord its God.\" So it was with Israel in Egypt. When \"they sat by the flesh pots, and did eat bread to the full, amid the fish, which they did eat freely, the cucumbers and the melons,\" they forgat the God of their fathers, and served the idols of Egypt. Then He raised up \"a new king, who made their lives bitter with hard bondage, in mortar and in brick and in all the service of the field;\" then \"they groaned by reason of the bondage, and they cried, and their cry came up unto God by reason of their bondage, and God heard their groaning\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "So in the book of Judges the ever-recurring history is, they forsook God; He delivered them into the hands of their enemies; they cried unto Him; He sent them a deliverer. A way may be found through a \"hedge of thorns,\" although with pain and suffering; through a stone \"wall\" even a strong man cannot burst a way. \"Thorns\" then may be the pains to the flesh, with which God visits sinful pleasures, so that the soul, if it would break through to them, is held back and torn; the wall may mean, that all such sinful joys shall be cut off altogether, as by bereavement, poverty, sickness, failure of plans, etc. In sorrows, we cannot find our idols, which, although so near, vanish from us; but we may find our God, though we are so far from Him, and He so often seems so far from us. \"God hedgeth with thorns the ways of the elect, when they find prickles in the things of time, which they desire. They attain not the pleasures of this world which they crave.\" They cannot \"find their paths,\" when, in the special love of God, they are hindered from obtaining what they seek amiss. \"I escaped not Thy scourges,\" says Augustine, as to his pagan state, \"for what mortal can? For Thou wert ever with me, mercifully rigorous, and with most bitter alloy all my unlawful pleasures, that I might seek pleasure without alloy. But where to find such, I could not discover, save in Thee, O Lord, who teachest by sorrow, and woundest us, to heal, and killest us, lest we die from Thee\" (Conf. ii. 4). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So in the book of Judges the ever-recurring history is, they forsook God; He delivered them into the hands of their enemies; they cried unto Him; He sent them a deliverer. A way may be found through a \"hedge of thorns,\" although with pain and suffering; through a stone \"wall\" even a strong man cannot burst a way. \"Thorns\" then may be the pains to the flesh, with which God visits sinful pleasures, so that the soul, if it would break through to them, is held back and torn; the wall may mean, that all such sinful joys shall be cut off altogether, as by bereavement, poverty, sickness, failure of plans, etc. In sorrows, we cannot find our idols, which, although so near, vanish from us; but we may find our God, though we are so far from Him, and He so often seems so far from us. \"God hedgeth with thorns the ways of the elect, when they find prickles in the things of time, which they desire. They attain not the pleasures of this world which they crave.\" They cannot \"find their paths,\" when, in the special love of God, they are hindered from obtaining what they seek amiss. \"I escaped not Thy scourges,\" says Augustine, as to his pagan state, \"for what mortal can? For Thou wert ever with me, mercifully rigorous, and with most bitter alloy all my unlawful pleasures, that I might seek pleasure without alloy. But where to find such, I could not discover, save in Thee, O Lord, who teachest by sorrow, and woundest us, to heal, and killest us, lest we die from Thee\" (Conf. ii. 4). ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6, 7. thorns … wall—(Job 19:8; La 3:7, 9). The hindrances which the captivity interposed between Israel and her idols. As she attributes all her temporal blessings to idols, I will reduce her to straits in which, when she in vain has sought help from false gods, she will at last seek Me as her only God and Husband, as at the first (Isa 54:5; Jer 3:14; Eze 16:8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then—before Israel's apostasy, under Jeroboam. The way of duty is hedged about with thorns; it is the way of sin that is hedged up with thorns. Crosses in an evil course are God's hedges to turn us from it. Restraining grace and restraining providences (even sicknesses and trials) are great blessings when they stop us in a course of sin. Compare Lu 15:14-18, \"I will arise, and go to my father.\" So here, \"I will go, and return,\" &c.; crosses in the both cases being sanctified to produce this effect.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because she is so impetuous and shameless in her idolatrous courses, nothing hath, and she resolves nothing shall, hinder her, but she will follow them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " take notice of it, thou lewd woman, and all that stand by. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will hedge up thy way with thorns:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thou wilt set no bounds to thy lusts, and thy wanderings to satisfy them; I will deal with thee as men do with unruly and rambling beasts, set a hedge of thorns about thee, i.e. compass thee in with wars and other calamities, which shall wound and pierce thee, that though thou love thy sinful courses, and wilt follow them, thou shalt have little pleasure in them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And make a wall; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " another allusion to the method men take to keep in the wildest cattle, which would break through hedges, but cannot break through walls. God will make the calamities of this people as a strong and high wall, over which they cannot leap, nor through which they cannot break. So was the Assyrian army under Shalmaneser, which cooped them up in a long siege of Samaria, and at last took them, and carried them into a long captivity, which now lasteth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That she shall not find her paths; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " wherein then didst go when thou wentest to Egypt or Syria for help; but by my judgments, and thine enemies’ power and watchfulness, always shall be watched and guarded, thou shalt not find how to send to them for relief. These were her paths, whereas a chaste wife would have gone to her husband for relief. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore, behold, I will hedge up thy way with thorns,.... As fields and vineyards are fenced with thorn hedges to keep out beasts; or rather as closes and fields are fenced to keep cattle in, from going out and straying elsewhere; which may be expressive of afflictions, aud particularly wars among them, that they could not stir out and go from place to place: and make a wall, that she shall not find her paths: to go to Dan and Bethel, and worship the calves there, as some; or to go to the Egyptians and Assyrians for help, as Jarchi and Kimchi; though it was by the latter that they were hedged in, and walled and cooped up, when the city of Samaria was besieged three years: rather this respects the straits and difficulties the Jews have been reduced to by the destruction of Jerusalem, and the continuance of them ever since; so that they are not able to offer their daily sacrifice, kill and eat their passover lamb, and perform other rites and ceremonies they used in their own land; which they would fain perform, though abolished by Christ, but are restrained by this hedge and wall, the destruction of their temple and altar, and not being suffered to possess their land; hence they are said to be without a sacrifice and an ephod. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore, behold, I will hedge up {h} thy way with thorns, and make a wall, that she shall not find her paths.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore, behold, I will hedge up ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thy way with thorns, and make a wall, that she shall not find her paths.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) I will punish you so that you may then test whether your idols can help you, and bring you into such straightness that you will have no lust to play the harlot.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will hedge up thy way with thorns",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Notice how, in the excitement of anger, the person changes from the second to the third. The figure is that of a traveller, who has not indeed lost his way, but finds it shut up by a thorn-hedge planted right across it, and by a wall, which formerly could be scaled through a breach, but is now solidly built up. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are strikingly parallel. The reality signified is of course some dark calamity utterly paralyzing the vital powers. In the second line render ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a wall for her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (lit., ‘her wall’).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Therefore, behold, I will hedge up thy way with thorns, and make a wall, that she shall not find her paths",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sudden change of person from the third to the second is very observable. This directness of address is, in this instance, expressive of deep indignation. She had avowed her determination to pursue her evil courses shamefully and sinfully, as if in despite and defiance of the Almighty. In deep and undisguised displeasure, and with a suddenness springing from indignation, he affirms his determination to thwart her course of sin and shame; as though addressing her personally and promptly, he said, \"Then thou shalt not be able to carry out thy plan or accomplish thy purpose; I will see to that.\" The hedge and wall are elsewhere, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", used for protection and defense, here for prevention and obstruction, and similarly in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"He hath fenced up my way that I cannot pass, and he hath set darkness in my paths;\" and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"He hath hedged me about, that I cannot get out,\" and ver. 9, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hath enclosed my ways with hewn stone, he hath made my paths crooked.\" Thus Kimchi: \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " will hedge thy way with thorns, so that they cannot go out of the city because of the devastation; and her lovers shall not be able to help her, and they are Assyria and Egypt.\" After quoting his father's explanation of lovers, he pro-coeds: \"So their way is as if there were in it a thorn hedge, and thorns that she could not pass through it, and could not find her paths in which she walked.\" The fence here is double one a hedge of thorns, sharp, prickly, and piercing, such as forbid her forcing a way through: the other a wall of stone that cannot be climbed, or leaped, or otherwise got over. We need not try to specify the particular circumstances that thus hedged in and walled about the adulteress - whether fightings within or foes beleaguering without, whether straitened means or stress of circumstances raising an impassable barrier against the practice of idolatry, or an enforced conviction of its futility. \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "If",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" says Kimchi, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "she",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seek to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Assyria",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Egypt, they will not give her their friendship and their help.\" Hosea 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Therefore (because the woman says this), behold, thus will I hedge up thy way with thorns, and wall up a wall, and she shall not find her paths.\" The hedging up of the way, strengthened by the similar figure of the building of a wall to cut off the way, denotes her transportation into a situation in which she could no longer continue her adultery with the idols. The reference is to distress and tribulation (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), especially the distress and anguish of exile, in which, although Israel was in the midst of idolatrous nations, and therefore had even more outward opportunity to practise idolatry, it learned the worthlessness of all trust in idols, and their utter inability to help, and was thus impelled to reflect and turn to the Lord, who smites and heals (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This thought is carried out still further in Hosea 2:7 : \"And she will pursue her lovers, and not overtake them; and seek them, and not find them: and will say, I will go and return to my first husband, for it was better with me then than now.\" Distress at first increases their zeal in idolatry, but it soon brings them to see that the idols afford no help. The failure to reach or find the lovers, who are sought with zeal (riddēph, piel in an intensive sense, to pursue eagerly), denotes the failure to secure what is sought from them, viz., the anticipated deliverance from the calamity, which the living God has sent as a punishment. This sad experience awakens the desire to return to the faithful covenant God, and the acknowledgment that prosperity and all good things are to be found in vital fellowship with Him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This thought is carried out still further in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"And she will pursue her lovers, and not overtake them; and seek them, and not find them: and will say, I will go and return to my first husband, for it was better with me then than now.\" Distress at first increases their zeal in idolatry, but it soon brings them to see that the idols afford no help. The failure to reach or find the lovers, who are sought with zeal (riddēph, piel in an intensive sense, to pursue eagerly), denotes the failure to secure what is sought from them, viz., the anticipated deliverance from the calamity, which the living God has sent as a punishment. This sad experience awakens the desire to return to the faithful covenant God, and the acknowledgment that prosperity and all good things are to be found in vital fellowship with Him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The thought that God will fill the idolatrous nation with disgust at its coquetry with strange gods, by taking away all its possessions, and thus putting to shame its delusive fancy that the possessions which it enjoyed really came from the idols, is still further expanded in the second strophe, commencing with the eighth verse. Hosea 2:8. \"And she knows not that I have given her the corn, and the must, and the oil, and have multiplied silver to her, and gold, which they have used for Baal.\" Corn, must, and oil are specified with the definite article as being the fruits of the land, which Israel received from year to year. These possessions were the foundation of the nation's wealth, through which gold and silver were multiplied. Ignorance of the fact that Jehovah was the giver of these blessings, was a sin. That Jehovah had given the land to His people, was impressed upon the minds of the people for all time, together with the recollection of the mighty acts of the Lord, by the manner in which Israel had been put in possession of Canaan; and not only had Moses again and again reminded the Israelites most solemnly that it was He who gave rain to the land, and multiplied and blessed its fruitfulness and its fruits (compare, for example, Deuteronomy 7:13; Deuteronomy 11:14-15), but this was also perpetually called to their remembrance by the law concerning the offering of the first-fruits at the feasts. The words ‛âsū labba‛al are to be taken as a relative clause without 'asher, though not in the sense of \"which they have made into Baal,\" i.e., out of which they have made Baal-images (Chald., Rabb., Hitzig, Ewald, and others); for even though עשׂה ל occurs in this sense in Isaiah 44:17, the article, which is wanting in Isaiah, and also in Genesis 12:2 and Exodus 32:10, precludes such an explanation here, apart from the fact that habba‛al cannot stand by itself for a statue of Baal. Here עשׂה ל has rather the general meaning \"apply to anything,\" just as in 2 Chronicles 24:7, where it occurs in a perfectly similar train of thought. This use of the word may be obtained from the meaning \"to prepare for anything,\" whereas the meaning \"to offer,\" which Gesenius adopts (\"which they have offered to Baal\"), is untenable, since עשׂה simply denotes the preparation of the sacrifice for the altar, which is out of the question in the case of silver and gold. They had applied their gold and silver to Baal, however, not merely by using them for the preparation of idols, but by employing them in the maintenance and extension of the worship of Baal, or even by regarding them as gifts of Baal, and thus confirming themselves in the zealous worship of that god. By habba'al we are not simply to understand the Canaanitish or Phoenician Baal in the stricter sense of the word, whose worship Jehu had exterminated from Israel, though not entirely, as is evident from the allusion to an Asherah in Samaria in the reign of Jehoahaz (2 Kings 13:6); but Baal is a general expression for all idols, including the golden calves, which are called other gods in 1 Kings 14:9, and compared to actual idols. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The thought that God will fill the idolatrous nation with disgust at its coquetry with strange gods, by taking away all its possessions, and thus putting to shame its delusive fancy that the possessions which it enjoyed really came from the idols, is still further expanded in the second strophe, commencing with the eighth verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"And she knows not that I have given her the corn, and the must, and the oil, and have multiplied silver to her, and gold, which they have used for Baal.\" Corn, must, and oil are specified with the definite article as being the fruits of the land, which Israel received from year to year. These possessions were the foundation of the nation's wealth, through which gold and silver were multiplied. Ignorance of the fact that Jehovah was the giver of these blessings, was a sin. That Jehovah had given the land to His people, was impressed upon the minds of the people for all time, together with the recollection of the mighty acts of the Lord, by the manner in which Israel had been put in possession of Canaan; and not only had Moses again and again reminded the Israelites most solemnly that it was He who gave rain to the land, and multiplied and blessed its fruitfulness and its fruits (compare, for example, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 11:14-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but this was also perpetually called to their remembrance by the law concerning the offering of the first-fruits at the feasts. The words ‛âsū labba‛al are to be taken as a relative clause without 'asher, though not in the sense of \"which they have made into Baal,\" i.e., out of which they have made Baal-images (Chald., Rabb., Hitzig, Ewald, and others); for even though עשׂה ל occurs in this sense in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the article, which is wanting in Isaiah, and also in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 32:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", precludes such an explanation here, apart from the fact that habba‛al cannot stand by itself for a statue of Baal. Here עשׂה ל has rather the general meaning \"apply to anything,\" just as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 24:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it occurs in a perfectly similar train of thought. This use of the word may be obtained from the meaning \"to prepare for anything,\" whereas the meaning \"to offer,\" which Gesenius adopts (\"which they have offered to Baal\"), is untenable, since עשׂה simply denotes the preparation of the sacrifice for the altar, which is out of the question in the case of silver and gold. They had applied their gold and silver to Baal, however, not merely by using them for the preparation of idols, but by employing them in the maintenance and extension of the worship of Baal, or even by regarding them as gifts of Baal, and thus confirming themselves in the zealous worship of that god. By habba'al we are not simply to understand the Canaanitish or Phoenician Baal in the stricter sense of the word, whose worship Jehu had exterminated from Israel, though not entirely, as is evident from the allusion to an Asherah in Samaria in the reign of Jehoahaz (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 13:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but Baal is a general expression for all idols, including the golden calves, which are called other gods in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 14:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and compared to actual idols. ",
            "children": []
          }
        ]
      }
    ]
  }
]