[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4-11) Nehemiah’s appeal to God. The prayer is a perfect example of the private and individual devotion with which the later Hebrew Scriptures abound. It begins with formal and appropriate invocation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:5-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), flows into earnest confession (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), pleads the covenant promises (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:8-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and supplicates a present answer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The extant Scriptures, freely used, are the foundation of all.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) Fasted.—Like Daniel, Esther, and Ezra, Nehemiah fasted: fasting appears in later Judaism a prominent part of individual devotion, as it is in the New Testament.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Fasted.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Like Daniel, Esther, and Ezra, Nehemiah fasted: fasting appears in later Judaism a prominent part of individual devotion, as it is in the New Testament.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) Both I and my father’s house have sinned.—The supplication was for the nation; and in such cases of personal intercession the individual assumes the sin of all the past.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(6) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Both I and my father’s house have sinned.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The supplication was for the nation; and in such cases of personal intercession the individual assumes the sin of all the past.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(8) The spirit of many threatenings and promises is summed up, as in the prayer of Nehemiah 9.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(11) This day . . . this man.—During his “certain days” of mourning Nehemiah had fixed upon his plan, suggested by his God. “This day” is “this occasion”: the appeal itself was deferred for some months. The king becomes “this man” in the presence of the “God of heaven.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(11) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "This day . . . this man.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—During his “certain days” of mourning Nehemiah had fixed upon his plan, suggested by his God. “This day” is “this occasion”: the appeal itself was deferred for some months. The king becomes “this man” in the presence of the “God of heaven.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For I was the king’s cupbearer.—One of his cupbearers, therefore in high authority, having confidential access to him.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "For I was the king’s cupbearer.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—One of his cupbearers, therefore in high authority, having confidential access to him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nehemiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A REFORMER’S SCHOOLING",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE CHURCH AND SOCIAL EVILSNehemiah 1:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE CHURCH AND SOCIAL EVILS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ninety years had passed since the returning exiles had arrived at Jerusalem. They had encountered many difficulties which had marred their progress and cooled their enthusiasm. The Temple, indeed, was rebuilt, but Jerusalem lay in ruins, and its walls remained as they had been left, by Nebuchadnezzar’s siege, some century and a half before. A little party of pious pilgrims had gone from Persia to the city, and had come back to Shushan with a sad story of weakness and despondency, affliction and hostility. One of the travellers had a brother, a youth named Nehemiah, who was a cup-bearer in the court of the Persian king. Living in a palace, and surrounded with luxury, his heart was with his brethren; and the ruins of Jerusalem were dearer to him than the pomp of Shushan.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " My text tells how the young cupbearer was affected by the tidings, and how he wept and prayed before God. The accurate dates given in this book show that this period of brooding contemplation of the miseries of his brethren lasted for four months. Then he took a great resolution, flung up brilliant prospects, identified himself with the afflicted colony, and asked for leave to go and share, and, if it might be, to redress, the sorrows which had made so deep a dint upon his heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, I think that this vivid description, drawn by himself, of the emotions excited in Nehemiah by his countrymen’s sorrows, which influenced his whole future, contains some very plain lessons for Christian people, the observance of which is every day becoming more imperative by reason of the drift of public opinion, and the new prominence which is being given to so-called ‘social questions.’ I wish to gather up one or two of these lessons for you now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, note the plain Christian duty of sympathetic contemplation of surrounding sorrows.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Nehemiah might have made a great many very good excuses for treating lightly the tidings that his brother had brought him. He might have said: ‘Jerusalem is a long way off. I have my own work to do; it is no part of my business to rebuild the walls of Jerusalem. I am the King’s cupbearer. They went with their eyes open, and experience has shown that the people who knew when they were well off, and stayed where they were, were a great deal wiser.’ These were not his excuses. He let the tidings fill his heart, and burn there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, the first condition of sympathy is knowledge; and the second is attending to what we do know. Nehemiah had probably known, in a kind of vague way, for many a day how things were going in Palestine. Communications between it and Persia were not so difficult but that there would come plenty of Government despatches; and a man at headquarters who had the ear of the monarch, was not likely to be ignorant of what was going on in that part of his dominions. But there is all the difference between hearing vague general reports, and sitting and hearing your own brother tell you what he had seen with his own eyes. So the impression which had existed before was all inoperative until it was kindled by attention to the facts which all the time had been, in some degree, known.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, how many of us are there that know-and don’t know-what is going on round about us in the slums and back courts of this city? How many of us are there who are habitually ignorant of what we actually know, because we never, as we say, ‘give heed’ to it. ‘I did not think of that,’ is a very poor excuse about matters concerning which there is knowledge, whether there is thought or not. And so I want to press upon all you Christian people the plain duty of knowing what you do know, and of giving an ample place in your thoughts to the stark staring facts around us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Why! loads of people at present seem to think that the miseries, and hideous vices, and sodden immorality, and utter heathenism, which are found down amongst the foundations of every civic community are as indispensable to progress as the noise of the wheels of a train is to its advancement, or as the bilge-water in a wooden ship is to keep its seams tight. So we prate about ‘civilisation,’ which means turning men into cities. If agglomerating people into these great communities, which makes so awful a feature of modern life, be necessarily attended by such abominations as we live amongst and never think about, then, better that there had never been civilisation in such a sense at all. Every consideration of communion with and conformity to Jesus Christ, of loyalty to His words, of a true sense of brotherhood and of lower things-such as self-interest-every consideration demands that Christian people shall take to their hearts, in a fashion that the churches have never done yet, ‘the condition of England question,’ and shall ask, ‘Lord! what wouldst Thou have me to do?’ I do not care to enter upon controversy raised by recent utterances, the motive of which may be worthy of admiration, though the expression cannot be acquitted of the charge of exaggeration, to the effect that the Christian churches as a whole have been careless of the condition of the people. It is not true in its absolute sense. I suppose that, taking the country over, the majority of the members of, at all events the Nonconformist churches and congregations, are in receipt of weekly wages or belong to the upper ranks of the working-classes, and that the lever which has lifted them to these upper ranks has been God’s Gospel. I suppose it will be admitted that the past indifference with which we are charged belonged to the whole community, and that the new sense of responsibility which has marked, and blessedly marked, recent years, is largely owing to political and other causes which have lately come into operation. I suppose it will not be denied that, to a very large extent, any efforts which have been made in the past for the social, intellectual, and moral, and religious elevation of the people have had their impulse, and to a large extent their support, both pecuniary and active, from Christian churches and individuals. All that is perfectly true and, I believe, undeniable. But it is also true that there remains an enormous, shameful, dead mass of inertness in our churches, and that, unless we can break up that, the omens are bad, bad for society, worse for the church. If cholera is raging in the slums, the suburbs will not escape. If the hovels are infected, the mansions will have to pay their tribute to the disease. If we do not recognise the brotherhood of the suffering and the sinful, in any other fashion-’Then,’ as a great teacher told us a generation ago now, and nobody paid any attention to him, ‘then they will begin and show you that they are your brethren by killing some of you.’ And so self-preservation conjoins with loftier motives to make this sympathetic observation of the surrounding sorrows the plainest of Christian duties.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Secondly, such a realisation of the dark facts is indispensable to all true work for alleviating them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Secondly, such a realisation of the dark facts is indispensable to all true work for alleviating them.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is no way of helping men out by bearing what they bear. No man will ever lighten a sorrow of which he has not himself felt the pressure. Jesus Christ’s Cross, to which we are ever appealing as the ground of our redemption and the anchor of our hope, is these, thank God! But it is more than these. It is the pattern for our lives, and it lays down, with stringent accuracy and completeness, the enduring conditions of helping the sinful and the sorrowful. The ‘saviours of society’ have still, in lower fashion, to be crucified. Jesus Christ would never have been ‘the Lamb of God that bore away the sins of the world’ unless He Himself had ‘taken our infirmities and borne our sicknesses.’ No work of any real use will be done except by those whose hearts have bled with the feeling of the miseries which they set themselves to cure.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh! we all want a far fuller realisation of that sympathetic spirit of the pitying Christ, if we are ever to be of any use in the world, or to help the miseries of any of our brethren. Such a sorrowful and participating contemplation of men’s sorrows springing from men’s sins will give tenderness to our words, will give patience, will soften our whole bearing. Help that is flung to people, as you might fling a bone to a dog, hurts those whom it tries to help, and patronising help is help that does little good, and lecturing help does little more. You must take blind beggars by the hand if you are going to make them see; and you must not be afraid to lay your white, clean fingers upon the feculent masses of corruption in the leper’s glistening whiteness if you are going to make him whole. Go down in order to lift, and remember that without sympathy there is no sufficient help, and without communion with Christ there is no sufficient sympathy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Thirdly, such realisation of surrounding sorrows should drive to communion with God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Thirdly, such realisation of surrounding sorrows should drive to communion with God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Nehemiah wept and mourned, and that was well. But between his weeping and mourning and his practical work there had to be still another link of connection. ‘He wept and mourned,’ and because he was sad he turned to God, ‘and I fasted and prayed certain days.’ There he got at once comfort for his sorrows, his sympathies, and deepening of his sympathies, and thence he drew inspiration that made him a hero and a martyr. So all true service for the world must begin with close communion with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There was a book published several years since which made a great noise in its little day, and called itself ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Service of Man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which service it proposed to substitute for the effete conception of worship as the service of God. The service of man is, then, best done when it is the service of God. I suppose nowadays it is ‘old-fashioned’ and ‘narrow,’ which is the sin of sins at present, but I for my part have very little faith in the persistence and wide operation of any philanthropic motives except the highest-namely, compassion caught from Jesus Christ. I do not believe that you will get men, year in and year out, to devote themselves in any considerable numbers to the service of man unless you appeal to this highest of motives. You may enlist a little corps-and God forbid that I should deny such a plain fact-of selecter spirits to do purely secular alleviative work, with an entire ignoring of Christian motives, but you will never get the army of workers that is needed to grapple with the facts of our present condition, unless you touch the very deepest springs of conduct, and these are to be found in communion with God. All the rest is surface drainage. Get down to the love of God, and the love of men therefrom, and you have got an Artesian well which will bubble up unfailingly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And I have not much faith in remedies which ignore religion, and are brought, without communion with God, as sufficient for the disease. I do not want to say one word that might seem to depreciate what are good and valid and noble efforts in their several spheres. There is no need for antagonism-rather, Christian men are bound by every consideration to help to the utmost of their power, even in the incomplete attempts that are made to grapple with social problems. There is room enough for us all. But sure I am that until grapes and waterbeds cure smallpox, and a spoonful of cold water puts out Vesuvius, you will not cure the evils of the body politic by any lesser means than the application of the Gospel of Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We hear a great deal to-day about a ‘social gospel,’ and I am glad of the conception, and of the favour which it receives. Only let us remember that the Gospel is social ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "second",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and individual ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "first",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And that if you get the love of God and obedience to Jesus Christ into a man’s heart it will be like putting gas into a balloon, it will go up, and the man will get out of the slums fast enough; and he will not be a slave to the vices of the world much longer, and you will have done more for him and for the wide circle that he may influence than by any other means. I do not want to depreciate any helpers, but I say it is the work of the Christian church to carry to the world the only thing that will make men deeply and abidingly happy, because it will make them good.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. And so, lastly, such sympathy should be the parent of a noble, self-sacrificing life.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Look at the man in our text. He had the ball at his feet. He had the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "entree",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of a court, and the ear of a king. Brilliant prospects were opening before him, but his brethren’s sufferings drew him, and with a noble resolution of self-sacrifice, he shut himself out from the former and went into the wilderness. He is one of the Scripture characters that never have had due honour-a hero, a saint, a martyr, a reformer. He did, though in a smaller sphere, the very same thing that the writer of the Epistle to the Hebrews magnified with his splendid eloquence, in reference to the great Lawgiver, ‘And chose rather to suffer affliction with the people of God,’ and to turn his back upon the dazzlements of a court, than to ‘enjoy the pleasures of sin for a season,’ whilst his brethren were suffering.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, dear friends! the letter of the example may be put aside; the spirit of it must be observed. If Christians are to do the work that they can do, and that Christ has put them into this world that they may do, there must be self-sacrifice with it. There is no shirking that obligation, and there is no discharging our duty without it. You and I, in our several ways, are as much under the sway of that absolute law, that ‘if a corn of wheat fall into the ground and die, it brings forth fruit,’ as ever was Jesus Christ or His Apostles. I have nothing to say about the manner of the sacrifice. It is no part of my business to prescribe to you details of duty. It is my business to insist on the principles which must regulate these, and of these principles in application to Christian service there is none more stringent than-’I will not offer unto my God burnt-offering of that which doth cost me nothing.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I am sure that, under God, the great remedy for social evils lies mainly here, that the bulk of professing Christians shall recognise and discharge their responsibilities. It is not ministers, city missionaries, Bible-women, or any other paid people that can do the work. It is by Christian men and by Christian women, and, if I might use a very vulgar distinction which has a meaning in the present connection, very specially by Christian ladies, taking their part in the work amongst the degraded and the outcasts, that our sorest difficulties and problems will be solved. If a church does not face these, well, all I can say is, its light will go out; and the sooner the better. ‘If thou forbear to deliver them that are appointed to death, and say, Behold! I knew it not, shall not He that weigheth the hearts consider it, and shall He not render to every man according to his work?’ And, on the other hand, there are no blessings more rich, select, sweet, and abiding, than are to be found in sharing the sorrow of the Man of Sorrows, and carrying the message of His pity and His redemption to an outcast world. ‘If thou draw out thy soul to the hungry, and satisfy the afflicted soul, the Lord shall satisfy thy soul; and thou shalt be as a watered garden, and as a spring of water whose waters fail not.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Nehemiah 1:4. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When I heard these words I sat down — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably upon the ground, as the manner was, in great sorrow, and perhaps in ashes; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and wept and mourned certain days — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thus the desolations and distresses of the church of Christ ought to be the matter of our grief, how much soever we live at ease. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And fasted and prayed — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not in public, which he had no opportunity of doing, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before the God of heaven — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sees in secret, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "reward openly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:15-44 The best reformers can but do their endeavour; when the Redeemer himself shall come to Zion, he shall effectually turn away ungodliness from Jacob. And when sin is repented of and forsaken, God will forgive it; but the blood of Christ, our Sin-offering, is the only atonement which takes away our guilt. No seeming repentance or amendment will benefit those who reject Him, for self-dependence proves them still unhumbled. All the names written in the book of life, are those of penitent sinners, not of self-righteous persons, who think they have no need of repentance.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The God of heaven - This title of the Almighty, which is Persian rather than Jewish (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 36:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is a favorite one with Nehemiah, who had been born and brought up in Persia. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ne 1:4-11. His Prayer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. when I heard these words, that I sat down … and mourned … and fasted, and prayed—The recital deeply affected the patriotic feelings of this good man, and no comfort could he find but in earnest and protracted prayer, that God would favor the purpose, which he seems to have secretly formed, of asking the royal permission to go to Jerusalem.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass, when I heard these words,.... This sad and melancholy account of things: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I sat down and wept, and mourned certain days; sat down upon the ground in dust and ashes, after the manner of mourners, and wept bitterly, and mourned in a most sorrowful manner, see Job 2:8, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that I sat down and wept, and mourned certain days; sat down upon the ground in dust and ashes, after the manner of mourners, and wept bitterly, and mourned in a most sorrowful manner, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and fasted and prayed before the God of heaven; that made it, and dwells in it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and fasted and prayed before the God of heaven; that made it, and dwells in it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it came to pass, when I heard these words, that I sat down and wept, and mourned certain days, and fasted, and prayed before the God of heaven,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When I heard these things, I sat down and wept",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The revelation of the actual condition of Jerusalem came upon Nehemiah with a shock. He had perhaps not thought much upon the subject before; he had had no means of exact information; he had supposed the city flourishing under the superintendence of Ezra, whose piety and patriotism were no doubt known to him. It was a bitter grief to him to find that his people were still \"a reproach to their neighbours,\" laughed to scorn by those whose walls had never been destroyed, or who had been allowed to rebuild them. And he may have felt that his city, under the circumstances of the time, was in real danger. As Dean Stanley observes - \"In those days rather one may say m those countries of disorder, a city without locked gates and lofty walls was no city at all\" ('Lectures on the Jewish Church,' Third Series, p. 124). A few years previously Egypt had been in revolt; she might revolt again, and carry her arms into Syria. Arab tribes from the desert might extend their raids into Judaea, and be tempted by the known value of the temple treasures to swoop upon the unwalled town. Such thoughts occurring to an excitable Oriental, produced not grief and anxiety merely, but a flood of tears (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And fasted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Fasting had become a frequent practice among the Jews during the captivity. Solemn fasts had been introduced on the anniversaries of the taking of Jerusalem, the burning of the temple, and the murder of Gedaliah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Fasting had also taken a prominent place in the devotions of individuals. Daniel fasted (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Esther fasted (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Ezra fasted (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and now Nehemiah fasted. On the grounds of natural piety out of which the practice arises, see the comment on Ezra 10:6. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The God of heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See the comment on Ezra 1:2. Nehemiah 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This description of the state of the returned captives plunged Nehemiah into such deep affliction, that he passed some days in mourning, fasting, and prayer. Opinions are divided with respect to the historical relation of the facts mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some older expositors thought that Hanani could not have spoken of the destruction of the walls and gates of Jerusalem by the Babylonians, because this was already sufficiently known to Nehemiah, but of some recent demolition on the part of Samaritans and other hostile neighbours of the Jews; in opposition to which, Rambach simply replies that we are told nothing of a restoration of the wall of Jerusalem by Zerubbabel and Ezra. More recently Ewald (Geschichte, iv. p. 137f.) has endeavoured to show, from certain psalms which he transposes to post-Babylonian times, the probability of a destruction of the rebuilt wall, but gives a decided negative to the question, whether this took place during the thirteen years between the arrivals of Ezra and Nehemiah. \"For,\" says he, \"there is not in the whole of Nehemiah's record the most distant hint that the walls had been destroyed only a short time since; but, on the contrary, this destruction was already so remote an event, that its occasion and authors were no longer spoken of.\" Vaihinger (Theol. Stud. und Krit., 1857, p. 88, comp. 1854, p. 124f.) and Bertheau are of opinion that it indisputably follows from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as appearances show, that the walls of Jerusalem were actually rebuilt and the gates set up before the twentieth year of Artaxerxes, and that the destruction of this laborious work, which occasioned the sending of an embassy to the Persian court, was of quite recent occurrence, since otherwise Nehemiah would not have been so painfully affected by it. But even the very opposite opinion held concerning the impression made upon the reader by these verses, shows that appearances are deceitful, and the view that the destruction of the walls and gates was of quite recent occurrence is not implied by the words themselves, but only inserted in them by expositors. There is no kind of historical evidence that the walls of Jerusalem which had been destroyed by the Chaldeans were once more rebuilt before Nehemiah's arrival.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The documents given by Ezra 4:8-22, which are in this instance appealed to, so far from proving the fact, rather bear testimony against it. The counsellor Rehum and the scribe Shimshai, in their letter to Artaxerxes, accuse indeed the Jews of building a rebellious and bad city, of restoring its walls and digging its foundations (Ezra 4:12); but they only give the king to understand that if this city be built and its walls restored, the king will no longer have a portion on this side the river (Ezra 4:16), and hasten to Jerusalem, as soon as they receive the king's decision, to hinder the Jews by force and power (Ezra 4:23). Now, even if this accusation were quite well founded, nothing further can be inferred from it than that the Jews had begun to restore the walls, but were hindered in the midst of their undertaking. Nothing is said in these documents either of a rebuilding, i.e., a complete restoration, of the walls and setting up of the gates, or of breaking down the walls and burning the gates. It cannot be said that to build a wall means the same as pulling down a wall already built. Nor is anything said in Nehemiah 1:3 and Nehemiah 1:4 of a recent demolition. The assertion, too, that the destruction of this laborious work was the occasion of the mission of Hanani and certain men of Judah to the Persian court (Vaihinger), is entirely without scriptural support. In Nehemiah 1:2 and Nehemiah 1:3 it is merely said that Hanani and his companions came from Judah to Nehemiah, and that Nehemiah questioned them concerning the condition of the Jews in the province of Judah, and concerning Jerusalem, and that they answered: The Jews there are in great affliction and reproach, for the wall of Jerusalem is broken down (מפרצת is a participle expressing the state, not the praeter. or perfect, which would be found here if a destruction recently effected were spoken of). Nehemiah, too, in Nehemiah 2:3 and Nehemiah 2:17, only says: The city of my fathers' sepulchres (Jerusalem) lieth desolate (חרבה is an adjective), not: has been desolated. Nor can a visit on the part of Jews from Judah to their compatriot and relative, the king's cup-bearer, be called a mission to the Persian court. - With respect also to the deep affliction of Nehemiah, upon which Bertheau lays so much stress, it by no means proves that he had received a terrible account of some fresh calamity which had but just befallen the community at Jerusalem, and whose whole extent was as yet unknown to him. Nehemiah had not as yet been to Jerusalem, and could not from his own experience know the state of affairs in Judah and Jerusalem; hence he questioned the newly arrived visitors, not concerning the latest occurrences, but as to the general condition of the returned captives. The fact of the destruction of Jerusalem by the Chaldees could not, of course, be unknown to him; but neither could he be ignorant that now ninety years since a great number of captives had returned to their homes with Zerubbabel and settled in Judah and Jerusalem, and that seventy years since the temple at Jerusalem had been rebuilt. Judging from these facts, he might not have imagined that the state of affairs in Judah and Jerusalem was so bad as it really was. When, then, he now learnt that those who had returned to Judah were in great affliction, that the walls of the town were still lying in ruins and its gates burned, and that it was therefore exposed defenceless to all the insults of hostile neighbours, even this information might well grieve him. It is also probable that it was through Hanani and his companions that he first learnt of the inimical epistle of the royal officials Rehum and Shimshai to Artaxerxes, and of the answer sent thereto by that monarch and thus became for the first time aware of the magnitude of his fellow-countrymen's difficulties. Such intelligence might well be such a shock to him as to cause the amount of distress described Nehemiah 1:4. For even if he indulged the hope that the king might repeal the decree by which the rebuilding of the wall had been prohibited till further orders, he could not but perceive how difficult it would be effectually to remedy the grievous state in which his countrymen who had returned to the land of their fathers found themselves, while the disposition of their neighbours towards them was thus hostile. This state was indeed sufficiently distressing to cause deep pain to one who had a heart alive to the welfare of his nation, and there is no need for inventing new \"calamities,\" of which history knows nothing, to account for the sorrow of Nehemiah. Finally, the circumstance that the destruction of the walls and burning of the gates are alone mentioned as proofs of the affliction and reproach which the returned exiles were suffering, arises simply from an intention to hint at the remedy about to be described in the narrative which follows, by bringing this special kind of reproach prominently forward. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The documents given by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 4:8-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which are in this instance appealed to, so far from proving the fact, rather bear testimony against it. The counsellor Rehum and the scribe Shimshai, in their letter to Artaxerxes, accuse indeed the Jews of building a rebellious and bad city, of restoring its walls and digging its foundations (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 4:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but they only give the king to understand that if this city be built and its walls restored, the king will no longer have a portion on this side the river (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 4:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and hasten to Jerusalem, as soon as they receive the king's decision, to hinder the Jews by force and power (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 4:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Now, even if this accusation were quite well founded, nothing further can be inferred from it than that the Jews had begun to restore the walls, but were hindered in the midst of their undertaking. Nothing is said in these documents either of a rebuilding, i.e., a complete restoration, of the walls and setting up of the gates, or of breaking down the walls and burning the gates. It cannot be said that to build a wall means the same as pulling down a wall already built. Nor is anything said in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of a recent demolition. The assertion, too, that the destruction of this laborious work was the occasion of the mission of Hanani and certain men of Judah to the Persian court (Vaihinger), is entirely without scriptural support. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is merely said that Hanani and his companions came from Judah to Nehemiah, and that Nehemiah questioned them concerning the condition of the Jews in the province of Judah, and concerning Jerusalem, and that they answered: The Jews there are in great affliction and reproach, for the wall of Jerusalem is broken down (מפרצת is a participle expressing the state, not the praeter. or perfect, which would be found here if a destruction recently effected were spoken of). Nehemiah, too, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", only says: The city of my fathers' sepulchres (Jerusalem) lieth desolate (חרבה is an adjective), not: has been desolated. Nor can a visit on the part of Jews from Judah to their compatriot and relative, the king's cup-bearer, be called a mission to the Persian court. - With respect also to the deep affliction of Nehemiah, upon which Bertheau lays so much stress, it by no means proves that he had received a terrible account of some fresh calamity which had but just befallen the community at Jerusalem, and whose whole extent was as yet unknown to him. Nehemiah had not as yet been to Jerusalem, and could not from his own experience know the state of affairs in Judah and Jerusalem; hence he questioned the newly arrived visitors, not concerning the latest occurrences, but as to the general condition of the returned captives. The fact of the destruction of Jerusalem by the Chaldees could not, of course, be unknown to him; but neither could he be ignorant that now ninety years since a great number of captives had returned to their homes with Zerubbabel and settled in Judah and Jerusalem, and that seventy years since the temple at Jerusalem had been rebuilt. Judging from these facts, he might not have imagined that the state of affairs in Judah and Jerusalem was so bad as it really was. When, then, he now learnt that those who had returned to Judah were in great affliction, that the walls of the town were still lying in ruins and its gates burned, and that it was therefore exposed defenceless to all the insults of hostile neighbours, even this information might well grieve him. It is also probable that it was through Hanani and his companions that he first learnt of the inimical epistle of the royal officials Rehum and Shimshai to Artaxerxes, and of the answer sent thereto by that monarch and thus became for the first time aware of the magnitude of his fellow-countrymen's difficulties. Such intelligence might well be such a shock to him as to cause the amount of distress described ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For even if he indulged the hope that the king might repeal the decree by which the rebuilding of the wall had been prohibited till further orders, he could not but perceive how difficult it would be effectually to remedy the grievous state in which his countrymen who had returned to the land of their fathers found themselves, while the disposition of their neighbours towards them was thus hostile. This state was indeed sufficiently distressing to cause deep pain to one who had a heart alive to the welfare of his nation, and there is no need for inventing new \"calamities,\" of which history knows nothing, to account for the sorrow of Nehemiah. Finally, the circumstance that the destruction of the walls and burning of the gates are alone mentioned as proofs of the affliction and reproach which the returned exiles were suffering, arises simply from an intention to hint at the remedy about to be described in the narrative which follows, by bringing this special kind of reproach prominently forward. ",
            "children": []
          }
        ]
      }
    ]
  }
]