[[],[{"type":"header","content":"Nathan Rebukes David"},{"type":"prose","content":"So the  sent Nathan the prophet to tell David this story: “There were two men in a certain town. One was rich, and one was poor."}],[{"type":"prose","content":"The rich man owned a great many sheep and cattle."}],[{"type":"prose","content":"The poor man owned nothing but one little lamb he had bought. He raised that little lamb, and it grew up with his children. It ate from the man’s own plate and drank from his cup. He cuddled it in his arms like a baby daughter."}],[{"type":"prose","content":"One day a guest arrived at the home of the rich man. But instead of killing an animal from his own flock or herd, he took the poor man’s lamb and killed it and prepared it for his guest.”"}],[{"type":"prose","content":"David was furious. “As surely as the  lives,” he vowed, “any man who would do such a thing deserves to die!"}],[{"type":"prose","content":"He must repay four lambs to the poor man for the one he stole and for having no pity.”"}],[{"type":"prose","content":"Then Nathan said to David, “You are that man! The , the God of Israel, says: I anointed you king of Israel and saved you from the power of Saul."}],[{"type":"prose","content":"I gave you your master’s house and his wives and the kingdoms of Israel and Judah. And if that had not been enough, I would have given you much, much more."}],[{"type":"prose","content":"Why, then, have you despised the word of the  and done this horrible deed? For you have murdered Uriah the Hittite with the sword of the Ammonites and stolen his wife."}],[{"type":"prose","content":"From this time on, your family will live by the sword because you have despised me by taking Uriah’s wife to be your own."}],[{"type":"prose","content":"“This is what the  says: Because of what you have done, I will cause your own household to rebel against you. I will give your wives to another man before your very eyes, and he will go to bed with them in public view."}],[{"type":"prose","content":"You did it secretly, but I will make this happen to you openly in the sight of all Israel.”"},{"type":"header","content":"David Confesses His Guilt"}],[{"type":"prose","content":"Then David confessed to Nathan, “I have sinned against the .”Nathan replied, “Yes, but the  has forgiven you, and you won’t die for this sin."}],[{"type":"prose","content":"Nevertheless, because you have shown utter contempt for the word of the  by doing this, your child will die.”"}],[{"type":"prose","content":"After Nathan returned to his home, the  sent a deadly illness to the child of David and Uriah’s wife."}],[{"type":"prose","content":"David begged God to spare the child. He went without food and lay all night on the bare ground."}],[{"type":"prose","content":"The elders of his household pleaded with him to get up and eat with them, but he refused."}],[{"type":"prose","content":"Then on the seventh day the child died. David’s advisers were afraid to tell him. “He wouldn’t listen to reason while the child was ill,” they said. “What drastic thing will he do when we tell him the child is dead?”"}],[{"type":"prose","content":"When David saw them whispering, he realized what had happened. “Is the child dead?” he asked.“Yes,” they replied, “he is dead.”"}],[{"type":"prose","content":"Then David got up from the ground, washed himself, put on lotions, and changed his clothes. He went to the Tabernacle and worshiped the . After that, he returned to the palace and was served food and ate."}],[{"type":"prose","content":"His advisers were amazed. “We don’t understand you,” they told him. “While the child was still living, you wept and refused to eat. But now that the child is dead, you have stopped your mourning and are eating again.”"}],[{"type":"prose","content":"David replied, “I fasted and wept while the child was alive, for I said, ‘Perhaps the  will be gracious to me and let the child live.’"}],[{"type":"prose","content":"But why should I fast when he is dead? Can I bring him back again? I will go to him one day, but he cannot return to me.”"}],[{"type":"prose","content":"Then David comforted Bathsheba, his wife, and slept with her. She became pregnant and gave birth to a son, and David named him Solomon. The  loved the child"}],[{"type":"prose","content":"and sent word through Nathan the prophet that they should name him Jedidiah (which means “beloved of the ”), as the  had commanded."},{"type":"header","content":"David Captures Rabbah"}],[{"type":"prose","content":"Meanwhile, Joab was fighting against Rabbah, the capital of Ammon, and he captured the royal fortifications."}],[{"type":"prose","content":"Joab sent messengers to tell David, “I have fought against Rabbah and captured its water supply."}],[{"type":"prose","content":"Now bring the rest of the army and capture the city. Otherwise, I will capture it and get credit for the victory.”"}],[{"type":"prose","content":"So David gathered the rest of the army and went to Rabbah, and he fought against it and captured it."}],[{"type":"prose","content":"David removed the crown from the king’s head, and it was placed on his own head. The crown was made of gold and set with gems, and it weighed seventy-five pounds. David took a vast amount of plunder from the city."}],[{"type":"prose","content":"He also made slaves of the people of Rabbah and forced them to labor with saws, iron picks, and iron axes, and to work in the brick kilns. That is how he dealt with the people of all the Ammonite towns. Then David and all the army returned to Jerusalem."}]]