[{"header":"Jeremiah’s Letter to the Exiles"},{"num":29,"verse":"Now these are the words of the letter that Jeremiah the prophet sent from Jerusalem to the rest of the elders of the captivity, and the priests, and the prophets, and all the people whom Nebuchadnezzar had carried away captive from Jerusalem to Babylon. "},{"num":2,"verse":"(This was after Jeconiah the king, and the queen, and the eunuchs, and the officials of Judah and Jerusalem, and the carpenters, and the smiths had departed from Jerusalem.) "},{"num":3,"verse":"It was sent by the hand of Elasah the son of Shaphan and Gemariah the son of Hilkiah (whom Zedekiah, king of Judah, sent to Babylon to Nebuchadnezzar king of Babylon), saying:"},{"num":4,"verse":"Thus says the Lord of Hosts, the God of Israel, to all who have been carried away captive whom I have caused to be carried away from Jerusalem to Babylon: "},{"num":5,"verse":"Build houses and dwell in them; and plant gardens and eat their fruit. "},{"num":6,"verse":"Take wives and beget sons and daughters; and take wives for your sons and give your daughters to husbands, so that they may bear sons and daughters; so that you may increase there and not diminish. "},{"num":7,"verse":"Seek the peace of the city where I have caused you to be carried away captive, and pray to the Lord for it; for in its peace you will have peace. "},{"num":8,"verse":"For thus says the Lord of Hosts, the God of Israel: Do not let your prophets and your diviners who are in your midst deceive you, and do not listen to the dreams which they dream. "},{"num":9,"verse":"For they prophesy falsely to you in My name. I have not sent them, says the Lord."},{"num":10,"verse":"For thus says the Lord: When seventy years have been completed for Babylon, I will visit you and perform My good word toward you, in causing you to return to this place. "},{"num":11,"verse":"For I know the plans that I have for you, says the Lord, plans for peace and not for evil, to give you a future and a hope. "},{"num":12,"verse":"Then you shall call upon Me, and you shall come and pray to Me, and I will listen to you. "},{"num":13,"verse":"You shall seek Me and find Me, when you shall search for Me with all your heart. "},{"num":14,"verse":"I will be found by you, says the Lord, and I will turn away your captivity and gather you from all the nations and from all the places where I have driven you, says the Lord, and I will bring you back into the place from where I caused you to be carried away captive."},{"num":15,"verse":"Because you have said, “The Lord has raised up prophets for us in Babylon,” "},{"num":16,"verse":"thus says the Lord concerning the king who sits on the throne of David, and concerning all the people who dwell in this city, your brothers who did not go out with you into exile, "},{"num":17,"verse":"thus says the Lord of Hosts: I will send upon them the sword, the famine, and the pestilence, and will make them like vile figs that cannot be eaten, they are so rotten. "},{"num":18,"verse":"I will pursue them with the sword, with famine, and with pestilence; and will make them a terror to all the kingdoms of the earth, to be a curse and an astonishment, a hissing and a reproach among all the nations where I have driven them, "},{"num":19,"verse":"because they have not listened to My words, says the Lord, which I sent to them by My servants the prophets, rising up early and sending them. But you would not listen, says the Lord."},{"num":20,"verse":"Therefore hear the word of the Lord, all you in captivity whom I have sent from Jerusalem to Babylon. "},{"num":21,"verse":"Thus says the Lord of Hosts, the God of Israel, concerning Ahab the son of Kolaiah and concerning Zedekiah the son of Maaseiah, who prophesy a lie to you in My name: I will deliver them into the hand of Nebuchadnezzar king of Babylon, and he shall slay them before your eyes. "},{"num":22,"verse":"And because of them a curse shall be taken up by all the captives of Judah who are in Babylon, saying, “May the Lord make you like Zedekiah and Ahab, whom the king of Babylon roasted in the fire,” "},{"num":23,"verse":"because they have committed folly in Israel, and have committed adultery with their neighbors’ wives, and have spoken lying words in My name, which I have not commanded them. Indeed, I know and am a witness, says the Lord."},{"header":"A Message to Shemaiah"},{"num":24,"verse":"Thus you shall also speak to Shemaiah the Nehelamite, saying: "},{"num":25,"verse":"Thus says the Lord of Hosts, the God of Israel: Because you have sent letters in your name to all the people who are in Jerusalem, and to Zephaniah the son of Maaseiah the priest, and to all the priests, saying, "},{"num":26,"verse":"The Lord has made you priest instead of Jehoiada the priest, that you should be officers in the house of the Lord, for every man that is mad and makes himself a prophet, that you should put him in the stocks and in prison. "},{"num":27,"verse":"Now therefore why have you not reproved Jeremiah of Anathoth who prophesies to you? "},{"num":28,"verse":"For he has sent to us in Babylon, saying, “This captivity will be long; build houses and dwell in them, and plant gardens and eat their fruit.”"},{"num":29,"verse":"Zephaniah the priest read this letter in the ears of Jeremiah the prophet. "},{"num":30,"verse":"Then the word of the Lord came to Jeremiah, saying: "},{"num":31,"verse":"Send to all the captives, saying, Thus says the Lord concerning Shemaiah the Nehelamite: Because Shemaiah has prophesied to you though I did not send, and he caused you to trust in a lie, "},{"num":32,"verse":"therefore thus says the Lord: I will punish Shemaiah the Nehelamite and his seed. He will not have a man to dwell among this people, nor will he see the good that I will do for My people, says the Lord, because he has taught rebellion against the Lord."}]