[{"num":2,"verse":"Why gnashed with teeth heathen men; and peoples thought vain things? (Why do the heathen gnash with their teeth? and the peoples think up useless plans?)"},{"num":2,"verse":"The kings of earth stood together; and princes came together against the Lord, and against his Christ. (The kings of the earth stood together; yea, the rulers came together against the Lord, and against his anointed king.)"},{"num":3,"verse":"Break we the bonds of them; and cast we away the yoke of them from us. (And they said, Let us break their bonds, that is, their rule over us; yea, let us throw off their yoke from us.)"},{"num":4,"verse":"He that dwelleth in heavens shall scorn them; and the Lord shall bemock them. (But he who liveth in heaven shall scorn them; yea, the Lord shall mock them.)"},{"num":5,"verse":"Then he shall speak to them in his wrath; and he shall trouble them in his strong vengeance. (And then he shall speak to them in his anger; and he shall trouble them with his fury.)"},{"num":6,"verse":"Soothly I am ordained of him a king upon Zion, his holy hill; (And the Lord saith of me, I have set my king upon Zion; upon my holy hill.)"},{"num":7,"verse":"preaching his commandment. The Lord said to me, Thou art my son; I have begotten thee today. (And I said, I shall tell out his decree. Then the Lord said to me, Thou art my son; and today I have become thy father.)"},{"num":8,"verse":"Ask thou of me, and I shall give to thee heathen men (for) thine heritage; and (for) thy possession the terms of earth. (Ask thou of me, and I shall give thee the heathen for thy inheritance; and the ends of the earth for thy possession.)"},{"num":9,"verse":"Thou shalt govern them in an iron rod; and thou shalt break them together as the vessel of a potter. (Thou shalt govern them with an iron rod; and thou shalt break them in pieces, like a clay pot.)"},{"num":10,"verse":"And now, ye kings, understand; ye that deem the earth, be ye learned. (And so now, ye kings, understand; ye who judge, or who rule, the earth, learn your lesson!)"},{"num":11,"verse":"Serve ye the Lord with dread; and make ye full out joy to him with trembling. (Serve ye the Lord in fear/Serve ye the Lord with reverence; and bow down before him with trembling.)"},{"num":12,"verse":"Take ye lore of chastising; lest the Lord be wroth sometime, and ye perish from the just way. When his wrath shall burn out in short time; blessed be all they, that trust in him. (Kiss ye the King, that is, worship and serve him; lest sometime, the Lord be angry. And then, ye perish on the way; when, in a moment of time, his anger flareth up. Happy be all they, who trust in him.)"}]