[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall not take of the people’s inheritance.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Fresh warning is here given against oppression on the part of the prince, and he is reminded that the territory given inalienably to him and his heirs is to provide for his sons’ inheritance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46:1-24 The ordinances of worship for the prince and for the people, are here described, and the gifts the prince may bestow on his sons and servants. Our Lord has directed us to do many duties, but he has also left many things to our choice, that those who delight in his commandments may abound therein to his glory, without entangling their own consciences, or prescribing rules unfit for others; but we must never omit our daily worship, nor neglect to apply the sacrifice of the Lamb of God to our souls, for pardon, peace, and salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prince was robe provided with possessions of his own, in order to prevent exactions from his subjects; further enactments are added to prevent the alienation of the prince's land. Any gifts made to his servants must revert to the prince in the \"year of liberty,\" or jubilee (see the marginal reference note). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16-18. The prince's possession is to be inalienable, and any portion given to a servant is to revert to his sons at the year of jubilee, that he may have no temptation to spoil his people of their inheritance, as formerly (compare Ahab and Naboth, 1Ki 21:1-29). The mention of the year of jubilee implies that there is something literal meant, besides the spiritual sense. The jubilee year was restored after the captivity [Josephus, Antiquities, 14.10,6; 1 Maccabees 6:49]. Perhaps it will be restored under Messiah's coming reign. Compare Isa 61:2, 3, where \"the acceptable year of the Lord\" is closely connected with the comforting of the mourners in Zion, and \"the day of vengeance\" on Zion's foes. The mention of the prince's sons is another argument against Messiah being meant by \"the prince.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall not take; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seize and escheat as forfeited, (like as Ahab dealt with Naboth, or David with Mephibosheth,) to give to others, or keep for himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By oppression; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whether fraudulent or violent oppression, whether under colour of justice or against all rules of law. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To thrust them out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that he may put in his own creatures or children. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He shall give his sons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " provide for his own, ont of that is his own. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That my people be not scattered; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they may keep together in their own land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Moreover the prince shall not take of the people's inheritance by oppression, to thrust them out of their possession,.... Christ, the Prince, will never do this; he will never take any part of his people's inheritance from them, or thrust them out of the possession of any benefit or blessing of grace; they have chosen that good part which shall never be taken from them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 10:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", this is said, not as a direction to the prince, as a law enjoined him, or a caution to him against oppression; but as expressing his clemency, grace, and goodness to his subjects, and their safety and security under him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but he shall give his sons inheritance out of his own possession; whatever Christ gives his sons, whether present grace, or future glory, it is out of his own possession; for all that the Father has are his; all the blessings of goodness are with him; all the fulness of grace is in him; the eternal inheritance is reserved with him in heaven; and it is all his own he gives, and not another's: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that my people be not scattered every man from his possession; or, \"that therefore my people may not be scattered every\" \"men from his possession\" (o); because what is given them, and they are in possession of, was Christ's own, and not another's; and which he had a right to dispose of, and therefore they need not fear being dispossessed by another claimant. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o)     \"ideo ne dispergantur populus meus\", Starckius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o)     \"ideo ne dispergantur populus meus\", Starckius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Moreover the prince shall not {d} take of the people's inheritance by oppression, to thrust them out of their possession; but he shall give his sons inheritance out of his own possession: that my people be not dispossessed every man from his possession.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Moreover the prince shall not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " take of the people's inheritance by oppression, to thrust them out of their possession; ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "but",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he shall give his sons inheritance out of his own possession: that my people be not dispossessed every man from his possession.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) But be content with that portion that God has assigned him, as in Eze 45:8.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "third regulation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prince in all cases should endow his sons (or others) out of his own, and not out of his subjects' possessions, of which they have been violently robbed. A good rule for other princes besides this, and for owners of property in general Ezekiel 46:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the Right of the Prince to Dispose of his Landed Property",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 46:16. Thus saith the Lord Jehovah, If the prince gives a present to one of his sons, it is his inheritance, shall belong to his sons; it is their possession, in an hereditary way. Ezekiel 46:17. But if he gives a present from his inheritance to one of his servants, it shall belong to him till the year of liberty, and then return to the prince; to his sons alone shall his inheritance remain. Ezekiel 46:18. And the prince shall not take from the inheritance of the people, so as to thrust them out of their possession; from his own possession he shall transmit to his sons, that no one of my people be scattered from his possession. - According to Ezekiel 45:7-8, at the future division of the land among the tribes, a possession was to be given to the prince on both sides of the holy heave and of the city domain, that he might not seize upon a possession by force, as the former princes had done. The prince might give away portions of this royal property, but only within such limits that the design with which a regal possession had been granted might not be frustrated. To his sons, as his heirs, he might make gifts therefrom, which would remain their own property; but if he presented to any one of his servants a portion of his hereditary property, it was to revert to the prince in the year of liberty; just as, according to the Mosaic law, the hereditary field of an Israelite, which had been alienated, was to revert to its hereditary owner (Leviticus 27:24, compared with Leviticus 25:10-13). The suffix in נחלתו (Ezekiel 46:16) is not to be taken as referring to the prince, and connected with the preceding words in opposition to the accents, but refers to אישׁ מבּניו. What the prince gives to one of his sons from his landed property shall be his נחלה, i.e., after the manner of an hereditary possession. On the other hand, what the prince presents to one of his servants shall not become hereditary in his case, but shall revert to the prince in the year of liberty, or the year of jubilee. The second half of Ezekiel 46:17 reads verbally thus: \"only his inheritance is it; as for his sons, it shall belong to them.\" - And as the prince was not to break up his regal possession by presents made to servants, so was he (Ezekiel 46:18) also not to put any one out of his possession by force, for the purpose, say, of procuring property for his own sons; but was to give his sons their inheritance from his own property alone. For הונה, compare Ezekiel 45:8, and such passages as 1 Samuel 8:14; 1 Samuel 22:7. We shall return by and by to the question, how this regulation stands related to the view that the prince is the Messiah. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thus saith the Lord Jehovah, If the prince gives a present to one of his sons, it is his inheritance, shall belong to his sons; it is their possession, in an hereditary way. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But if he gives a present from his inheritance to one of his servants, it shall belong to him till the year of liberty, and then return to the prince; to his sons alone shall his inheritance remain. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And the prince shall not take from the inheritance of the people, so as to thrust them out of their possession; from his own possession he shall transmit to his sons, that no one of my people be scattered from his possession. - According to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 45:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", at the future division of the land among the tribes, a possession was to be given to the prince on both sides of the holy heave and of the city domain, that he might not seize upon a possession by force, as the former princes had done. The prince might give away portions of this royal property, but only within such limits that the design with which a regal possession had been granted might not be frustrated. To his sons, as his heirs, he might make gifts therefrom, which would remain their own property; but if he presented to any one of his servants a portion of his hereditary property, it was to revert to the prince in the year of liberty; just as, according to the Mosaic law, the hereditary field of an Israelite, which had been alienated, was to revert to its hereditary owner (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 27:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:10-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The suffix in נחלתו (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is not to be taken as referring to the prince, and connected with the preceding words in opposition to the accents, but refers to אישׁ מבּניו. What the prince gives to one of his sons from his landed property shall be his נחלה, i.e., after the manner of an hereditary possession. On the other hand, what the prince presents to one of his servants shall not become hereditary in his case, but shall revert to the prince in the year of liberty, or the year of jubilee. The second half of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " reads verbally thus: \"only his inheritance is it; as for his sons, it shall belong to them.\" - And as the prince was not to break up his regal possession by presents made to servants, so was he (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") also not to put any one out of his possession by force, for the purpose, say, of procuring property for his own sons; but was to give his sons their inheritance from his own property alone. For הונה, compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 45:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and such passages as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 22:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". We shall return by and by to the question, how this regulation stands related to the view that the prince is the Messiah. ",
            "children": []
          }
        ]
      }
    ]
  }
]