[{"num":14,"verse":"Now Churam Melech Tzor sent malachim to Dovid, and timber of cedars, with masons and carpenters, to build him a bais (palace)."},{"num":2,"verse":"And Dovid perceived that Hashem had established him Melech over Yisroel, for his malchut was lifted up on high, for the sake of His people Yisroel."},{"num":3,"verse":"And Dovid took more nashim at Yerushalayim; and Dovid fathered more banim and banot."},{"num":4,"verse":"Now these are the shmot of his banim which were born in Yerushalayim: Shammua, and Shovav, Natan, and Sh’lomo,"},{"num":5,"verse":"And Yivchar, and Elishua, and Elpalet,"},{"num":6,"verse":"And Nogah, and Nepheg, and Yaphia,"},{"num":7,"verse":"And Elishama, and Be’elyada, and Eliphalet."},{"num":8,"verse":"And when the Pelishtim (Philistines) heard that Dovid nimshach (was anointed) Melech over kol Yisroel, all the Pelishtim went up to search for Dovid. Dovid heard of it, and went out against them."},{"num":9,"verse":"And the Pelishtim (Philistines) came and spread out in the Emek Rephaim."},{"num":10,"verse":"And Dovid inquired of Elohim, saying, Shall I go up against the Pelishtim? And wilt Thou deliver them into mine yad? And Hashem said unto him, Go up; for I will deliver them into thine yad."},{"num":11,"verse":"So they came up to Ba’al-Peratzim; and Dovid defeated them there. Then Dovid said, Elohim hath broken out upon mine oyevim by mine yad like the peretz mayim (breaking forth of waters); therefore they called the shem of that makom Ba’al-Peratzim."},{"num":12,"verse":"And when they [the Pelishtim] had abandoned their elohim there, Dovid gave a commandment, and they were burned with eish."},{"num":13,"verse":"And the Pelishtim (Philistines) yet again spread out in the emek (valley)."},{"num":14,"verse":"Therefore Dovid inquired again of Elohim, and Elohim said unto him, Go not up after them; circle around upon them, and come upon them opposite the mulberry trees."},{"num":15,"verse":"And it shall be, when thou shalt hear a sound of marching in the tops of the mulberry trees, that then thou shalt go out to milchamah; for HaElohim is gone forth before thee to strike the machaneh Pelishtim."},{"num":16,"verse":"Dovid therefore did as Elohim commanded him, and they struck down the machaneh Pelishtim from Giveon even to Gezer."},{"num":17,"verse":"And the shem (fame) of Dovid went out into all lands; and Hashem brought the pachad (terror) of him upon kol HaGoyim."}]