[{"header":"A Prophet Without Honor"},{"num":6,"verse":"Jesus left there and went to his hometown. His disciples followed him. "},{"num":2,"verse":"When the Sabbath came, he began to teach in the synagogue. Many who heard him were amazed. They asked, “Where did this man learn these things? What is this wisdom that has been given to this man? How is it that miracles such as these are performed by his hands? "},{"num":3,"verse":"Isn’t this the carpenter, the son of Mary and the brother of James, Joses, Judas, and Simon? And aren’t his sisters here with us?” And they took offense at him."},{"num":4,"verse":"Jesus said to them, “A prophet is not without honor except in his hometown and among his own relatives and in his own house.” "},{"num":5,"verse":"He could not do any miracles there except to lay his hands on a few sick people and heal them. "},{"num":6,"verse":"He was amazed at their unbelief. Then he went around the villages teaching."},{"header":"Jesus Sends Out the Twelve"},{"num":7,"verse":"Jesus called the Twelve and began to send them out two by two. He gave them authority over the unclean spirits. "},{"num":8,"verse":"He instructed them to take nothing for their journey except a staff—no bread, no bag, no money in their money belts. "},{"num":9,"verse":"They were to put on sandals but not to wear two coats. "},{"num":10,"verse":"He said to them, “Wherever you enter a house, stay there until you leave that area. "},{"num":11,"verse":"Any place that will not receive you or listen to you, as you leave there, shake off the dust that is under your feet as a testimony against them.”"},{"num":12,"verse":"They went out and preached that people should repent. "},{"num":13,"verse":"They also drove out many demons. They anointed many sick people with oil and healed them."},{"header":"Recalling the Death of John the Baptizer"},{"num":14,"verse":"King Herod heard about this because Jesus’ name had become well known. Herod was saying, “John the Baptizer has been raised from the dead! That is why these powers are at work in him.”"},{"num":15,"verse":"But others were saying, “He is Elijah.” Still others were saying, “He is a prophet, like one of the prophets of old.”"},{"num":16,"verse":"When Herod heard this, he said, “This is John, the man I beheaded. He was raised.” "},{"num":17,"verse":"For it was Herod who had sent men to arrest John. He had him bound in prison because Herod had married Herodias, the wife of his brother Philip. "},{"num":18,"verse":"Indeed, John had been telling him, “It is not lawful for you to have your brother’s wife.”"},{"num":19,"verse":"Herodias held a grudge against John and wanted to put him to death, but she could not, "},{"num":20,"verse":"because Herod feared John. He knew that John was a righteous and holy man, so he kept him safe. When Herod listened to John, he was perplexed in many ways, yet he gladly kept listening to him."},{"num":21,"verse":"An opportune day came when it was Herod’s birthday. He gave a banquet for his nobles, the military officers, and the prominent men of Galilee. "},{"num":22,"verse":"When the daughter of Herodias came in and danced, she pleased Herod and his guests. The king said to the girl, “Ask me whatever you want, and I will give it to you.” "},{"num":23,"verse":"With an oath he promised her, “Whatever you ask of me, I will give you, up to half of my kingdom.”"},{"num":24,"verse":"She went out and said to her mother, “What should I ask for?”"},{"num":25,"verse":"The girl hurried right back to the king and made her request: “I want you to give me the head of John the Baptist on a platter right now.”"},{"num":26,"verse":"The king was very sad. But because of his oaths and his dinner guests, he did not want to refuse her. "},{"num":27,"verse":"The king sent an executioner at once and ordered him to bring John’s head. He went, beheaded John in prison, "},{"num":28,"verse":"brought his head on a platter, and gave it to the girl. Then the girl gave it to her mother."},{"num":29,"verse":"When John’s disciples heard about this, they came and took his body and laid it in a tomb."},{"header":"Jesus Feeds More Than Five Thousand"},{"num":30,"verse":"The apostles gathered around Jesus and reported to him all that they had done and taught. "},{"num":31,"verse":"He said to them, “Come away by yourselves to a secluded place and rest a while.” For there were so many people coming and going that they did not even have a chance to eat. "},{"num":32,"verse":"They went away in the boat to a deserted place by themselves. "},{"num":33,"verse":"But many people saw them leave and knew where they were going. They ran there on foot from all the towns and arrived ahead of them. "},{"num":34,"verse":"When Jesus stepped out of the boat, he saw a large crowd. His heart went out to them because they were like sheep without a shepherd. He began to teach them many things. "},{"num":35,"verse":"It was already late in the day when his disciples came to him and said, “This is a deserted place and it is already very late. "},{"num":36,"verse":"Send them away so they can go into the surrounding country and villages and buy themselves something to eat.”"},{"num":37,"verse":"But he answered them, “You give them something to eat.”"},{"num":38,"verse":"He said to them, “How many loaves do you have? Go see.”"},{"num":39,"verse":"He directed everyone to sit down in groups on the green grass. "},{"num":40,"verse":"They sat down in groups of hundreds and fifties. "},{"num":41,"verse":"Jesus took the five loaves and the two fish, looked up to heaven, and blessed the loaves and broke them. Then he kept giving pieces to his disciples to set in front of them. He also divided the two fish among them all. "},{"num":42,"verse":"They all ate and were satisfied. "},{"num":43,"verse":"Then they picked up twelve basketfuls of broken pieces of bread and fish. "},{"num":44,"verse":"There were five thousand men who ate the loaves."},{"header":"Jesus Walks on Water"},{"num":45,"verse":"Immediately Jesus made his disciples get into the boat and go ahead to the other side, to Bethsaida, while he himself dismissed the crowd. "},{"num":46,"verse":"After he had sent them off, he went up the mountain to pray."},{"num":47,"verse":"When it was evening, the boat was in the middle of the sea, and Jesus was alone on the land. "},{"num":48,"verse":"He saw them straining at the oars, because the wind was against them. About the fourth watch of the night, he went to them, walking on the sea. He was ready to pass by them. "},{"num":49,"verse":"When they saw him walking on the sea, they thought he was a ghost, and they cried out. "},{"num":50,"verse":"They all saw him and were terrified. Immediately he spoke with them and said, “Take courage! It is I. Do not be afraid.” "},{"num":51,"verse":"Then he climbed up into the boat with them, and the wind stopped. They were completely amazed, "},{"num":52,"verse":"because they had not understood about the loaves. Instead, their hearts were hardened."},{"num":53,"verse":"When they had crossed over, they landed at Gennesaret and anchored there. "},{"num":54,"verse":"As soon as they stepped out of the boat, people recognized Jesus. "},{"num":55,"verse":"They ran around that whole region and began to bring sick people on their stretchers to where they heard he was. "},{"num":56,"verse":"Wherever he entered villages, cities, or the countryside, they were laying sick people in the marketplaces and pleading with him that they might just touch the edge of his garment. And all who touched it were made well."}]