[{"header":"The Rejection of Jesus at Nazareth(A)"},{"num":6,"verse":"He went away from there and came into His own country. And His disciples followed Him. "},{"num":2,"verse":"When the Sabbath came, He began to teach in the synagogue. And many hearing Him were astonished, saying, “Where did this Man get this? What is this wisdom that is given Him, that even miracles are done by His hands? "},{"num":3,"verse":"Is this not the carpenter, the Son of Mary and the brother of James and Joseph and Judas and Simon? Are not His sisters here with us?” And they took offense at Him."},{"num":4,"verse":"Jesus said to them, “A prophet is not without honor, except in his own country, and among his own relatives, and in his own house.” "},{"num":5,"verse":"He could not do any miracles there, except that He laid His hands on a few sick people and healed them. "},{"num":6,"verse":"And He was amazed because of their unbelief."},{"header":"The Mission of the Twelve(B)"},{"num":7,"verse":"He called to Him the twelve, and began to send them out two by two, and gave them authority over unclean spirits."},{"num":8,"verse":"He commanded them to take nothing for their journey except a staff: no bag, no bread, and no money in their purse, "},{"num":9,"verse":"but to wear sandals, and not put on two tunics. "},{"num":10,"verse":"He said to them, “Wherever you enter a house, remain there until you depart from that place. "},{"num":11,"verse":"And whoever will not receive you or hear you, when you depart from there, shake the dust off your feet as a testimony against them. Truly I say to you, it will be more tolerable for Sodom and Gomorrah on the Day of Judgment than for that city.”"},{"num":12,"verse":"So they went out and preached that men should repent. "},{"num":13,"verse":"And they cast out many demons and anointed with oil many who were sick and healed them."},{"header":"The Death of John the Baptist(C)"},{"num":14,"verse":"King Herod heard of Him, for His name was spread publicly. He said, “John the Baptist has been raised from the dead, and therefore these miracles are at work in him.”"},{"num":15,"verse":"But others said, “He is Elijah.”"},{"num":16,"verse":"But when Herod heard of it, he said, “It is John, whom I beheaded. He has been raised from the dead!”"},{"num":17,"verse":"Herod had sent and seized John and bound him in prison for the sake of Herodias, his brother Philip’s wife, for he had married her. "},{"num":18,"verse":"For John said to Herod, “It is not lawful for you to have your brother’s wife.” "},{"num":19,"verse":"So Herodias had a grudge against him and would have killed him, but she could not, "},{"num":20,"verse":"for Herod feared John, knowing that he was a righteous and holy man, and protected him. When he heard him, he was greatly perplexed, but heard him gladly."},{"num":21,"verse":"But a convenient day came when Herod on his birthday prepared a ceremonial dinner for his lords and commanding officers and leading men of Galilee. "},{"num":22,"verse":"When the daughter of Herodias came in and danced and pleased Herod and those who sat with him, the king said to the girl, “Ask of me whatever you desire, and I will give it to you.” "},{"num":23,"verse":"And he swore to her, “Whatever you ask of me, I will give you, up to half of my kingdom.”"},{"num":24,"verse":"She went out and said to her mother, “What shall I ask?”"},{"num":25,"verse":"She came in immediately with haste to the king and asked, “I want you to give me the head of John the Baptist on a platter at once.”"},{"num":26,"verse":"The king was extremely sorrowful. Yet for the sake of his oath and those who sat with him, he would not reject her. "},{"num":27,"verse":"So the king immediately sent an executioner and commanded his head to be brought. He went and beheaded him in the prison, "},{"num":28,"verse":"and brought his head on a platter, and gave it to the girl. And the girl gave it to her mother. "},{"num":29,"verse":"When his disciples heard of it, they came and took up his corpse and laid it in a tomb."},{"header":"The Feeding of the Five Thousand(D)"},{"num":30,"verse":"The apostles met with Jesus and told him everything, both what they had done and what they had taught. "},{"num":31,"verse":"Then He said to them, “Come away by yourselves to a remote place and rest a while,” for many were coming and going, and they had no leisure even to eat."},{"num":32,"verse":"So they went into a remote place privately by boat. "},{"num":33,"verse":"But the people saw them departing, and many knew Him and ran there on foot out of every city. They arrived first and came together to Him. "},{"num":34,"verse":"When Jesus came out and saw many people, He was moved with compassion on them, because they were like sheep without a shepherd. And He began to teach them many things."},{"num":35,"verse":"When the day was now getting late, His disciples came to Him and said, “This is a remote place, and now the time is passing. "},{"num":36,"verse":"Send them away into the surrounding country and villages to buy themselves bread, for they have nothing to eat.”"},{"num":37,"verse":"But He answered, “You give them something to eat.”"},{"num":38,"verse":"He said to them, “How many loaves have you? Go and see.”"},{"num":39,"verse":"Then He commanded them to make everyone sit down by companies on the green grass. "},{"num":40,"verse":"So they sat down in ranks, by hundreds and by fifties. "},{"num":41,"verse":"When He had taken the five loaves and the two fish, He looked up to heaven, and blessed and broke the loaves, and gave them to His disciples to set before them. And He divided the two fish among them all. "},{"num":42,"verse":"They all ate and were filled. "},{"num":43,"verse":"And they took up twelve baskets full of the fragments and of the fish. "},{"num":44,"verse":"Those who ate of the loaves were about five thousand men."},{"header":"Walking on the Water(E)"},{"num":45,"verse":"Immediately He compelled His disciples to get into the boat and to go before Him to the other side, to Bethsaida, while He sent the crowd away. "},{"num":46,"verse":"When He had sent them away, He departed to a mountain to pray."},{"num":47,"verse":"When evening came, the boat was in the midst of the sea. And He was alone on the land. "},{"num":48,"verse":"He saw them straining at rowing, for the wind was against them. About the fourth watch of the night He came to them, walking on the sea and would have passed by them. "},{"num":49,"verse":"But when they saw Him walking on the sea, they supposed it was a ghost, and cried out. "},{"num":50,"verse":"For they all saw Him and were troubled."},{"num":51,"verse":"Then He went up to them in the boat and the wind ceased. They were greatly astonished in themselves beyond measure, and wondered. "},{"num":52,"verse":"For they had not comprehended the miracle of the loaves, for their hearts were hardened."},{"header":"The Healing of the Sick in Gennesaret(F)"},{"num":53,"verse":"When they had crossed over, they came to the land of Gennesaret and anchored on the shore. "},{"num":54,"verse":"When they had come out of the boat, immediately the people recognized Him, "},{"num":55,"verse":"and ran throughout the surrounding region, and began to carry the sick on beds to wherever they heard He was. "},{"num":56,"verse":"And wherever He entered, into villages, cities, or the country, they laid the sick in the marketplaces and pleaded with Him that they might touch even the fringe of His garment. And as many as touched Him were healed."}]