[{"num":6,"verse":"And kai Jesus  left exerchomai from ekeithen there  and kai went erchomai to eis · ho his autos hometown patris,  and kai his autos disciples mathētēs followed akoloutheō him autos.  · ho"},{"num":2,"verse":"And kai when  the  Sabbath sabbaton came ginomai,  he  began archō to  teach didaskō in en the ho synagogue synagōgē.  And kai many polys,  when  they  heard akouō him,  were  astonished ekplēssō,  saying legō, “ Where pothen does  this houtos man  get  these houtos things ?  · kai What tis · ho wisdom sophia · ho has  been  given didōmi to  him houtos?  · kai How  are ginomai such toioutos · ho mighty dynamis works  done ginomai through dia · ho his autos hands cheir? "},{"num":3,"verse":"Is eimi this  man houtos not ou the ho carpenter tektōn,  the ho son hyios of ho Mary Maria and kai the  brother adelphos of  James Iakōbos,  · kai Joses Iōsēs,  · kai Judas Ioudas,  and kai Simon Simōn?  And kai are eimi not ou · ho his autos sisters adelphē here hōde with pros us hēmeis?”  And kai they  were  deeply  offended skandalizō at en him autos. "},{"num":4,"verse":"And kai Jesus Iēsous said legō to  them autos,  · ho “A  prophet prophētēs is eimi not ou without  honor atimos except ei mē in en · ho his autos hometown patris,  and kai among en · ho his autos relatives syngenēs,  and kai in en · ho his autos own  household oikia.” "},{"num":5,"verse":"And kai he  was  not ou able dynamai to  do poieō any oudeis mighty  work dynamis there ekei,  except ei mē that  he  laid epitithēmi his ho hands cheir on epitithēmi a  few oligos sick arrōstos people  and  healed therapeuō them. "},{"num":6,"verse":"And kai he  was  amazed thaumazō at dia · ho their autos lack  of  faith apistia.  And kai he  went periagō around  among kyklōi the ho villages kōmē teaching didaskō. "},{"num":7,"verse":"And kai he  called proskaleō to  himself  the ho twelve dōdeka and kai began archō to  send apostellō them autos out  two dyo by  two dyo,  and kai gave didōmi them autos authority exousia over  the ho unclean akathartos spirits pneuma.  · ho"},{"num":8,"verse":"· kai He  instructed parangellō them autos to hina take airō nothing mēdeis for eis their  journey hodos except ei mē simply monon a  staff rhabdos— no mē bread artos,  no mē bag pēra,  no mē money chalkos in eis their ho belts zōnē— "},{"num":9,"verse":"but alla to  wear hypodeō sandals sandalion.  Then kai he added, “ Do  not mē put endyō on  two dyo tunics chitōn.” "},{"num":10,"verse":"And kai he  said legō to  them autos, “ Whenever hopou ean you  enter eiserchomai a  house oikia,  stay menō there ekei until heōs you  leave exerchomai that  area ekeithen. "},{"num":11,"verse":"And kai any hos place topos that  does  not mē receive dechomai you hymeis or mēde listen akouō to  you hymeis,  when  you  leave ekporeuomai there ekeithen,  shake ektinassō off  the ho dust chous · ho from  under hypokatō · ho your hymeis feet pous as eis a  witness martyrion against  them autos.” "},{"num":12,"verse":"So kai departing exerchomai,  they  proclaimed kēryssō that hina people  should  repent metanoeō, "},{"num":13,"verse":"and kai they  drove  out ekballō many polys demons daimonion.  · kai They  anointed aleiphō with  oil elaion many polys who  were  sick arrōstos and kai healed therapeuō them. "},{"num":14,"verse":"· kai King basileus Herod hērōdēs heard akouō about  · ho this,  for gar Jesus’ autos name onoma had  become ginomai well  known phaneros.  · ho · kai Some  were  saying legō, “ John Iōannēs the ho baptizer baptizō has  been  raised egeirō from ek the  dead nekros.  · kai That  is  why dia miraculous  powers dynamis are  at  work energeō · ho in en him autos.” "},{"num":15,"verse":"But de others allos were  saying legō, “ He  is eimi Elijah ēlias.”  Still de others allos were  saying legō, “He is a  prophet prophētēs,  like hōs one heis of  the ho prophets prophētēs of old.” "},{"num":16,"verse":"But de when  Herod hērōdēs heard akouō · ho this,  he  said legō, “He is  John Iōannēs, the  man hos I egō beheaded apokephalizō;  he houtos has  been  raised egeirō from the dead.” "},{"num":17,"verse":"For gar it was  Herod hērōdēs himself autos · ho who  had  sent apostellō and  arrested krateō · ho John Iōannēs and kai bound deō him autos in en prison phylakē on  account dia of  Herodias hērōidias,  the ho wife gynē of  Philip Philippos · ho his autos brother adelphos,  because hoti he  had  married gameō her autos. "},{"num":18,"verse":"For gar John Iōannēs had  been  saying legō · ho to ho Herod hērōdēs, “It is  not ou lawful  for  you sy to  have echō the ho wife gynē of ho your sy brother adelphos.” "},{"num":19,"verse":"· ho So de Herodias hērōidias was  nursing enechō a  grudge  against  him autos and kai wanted thelō to  kill apokteinō him autos.  But kai she  was  not ou able dynamai to do it, "},{"num":20,"verse":"· ho because gar Herod hērōdēs feared phobeomai · ho John Iōannēs,  knowing oida him autos to be a  just dikaios and kai holy hagios man anēr,  and kai he  protected syntēreō him autos.  · kai When  he  heard akouō him autos,  he  was  greatly polys perplexed aporeō,  yet kai he  heard akouō him autos gladly hēdeōs. "},{"num":21,"verse":"Then kai an  opportune eukairos day hēmera came ginomai when hote Herod hērōdēs on ho his autos birthday genesia gave poieō a  banquet deipnon for ho his autos government megistan officials ,  · kai · ho military chiliarchos commanders ,  and kai · ho prominent prōtos men  of ho Galilee Galilaia. "},{"num":22,"verse":"· kai When  the ho daughter thugatēr of  Herodias hērōidias came  in eiserchomai and kai danced orcheomai,  she  pleased areskō · ho Herod hērōdēs and kai his ho dinner synanakeimai companions .  The ho king basileus said legō to  the ho young korasion girl , “ Ask aiteō me egō for  whatever hos ean you  wish thelō,  and kai I  will  give didōmi it  to  you sy.” "},{"num":23,"verse":"And kai he  promised omnyō her autos insistently polys with  an  oath , “ Whatever hos tis you  ask  for aiteō,  I  will  give didōmi it  to  you sy,  up heōs to  half hēmisys of ho my egō kingdom basileia.” "},{"num":24,"verse":"So kai she  went exerchomai out  and  said legō to ho her autos mother mētēr, “ What tis should  I  ask aiteō for ?”  And de her ho mother  said legō, “ The ho head kephalē of  John Iōannēs the ho baptizer baptizō.” "},{"num":25,"verse":"And kai immediately,  entering eiserchomai with meta haste spoudē to pros the ho king basileus,  she  asked aiteō him,  saying legō, “ I  want thelō you didōmi to hina give didōmi me egō right exautēs now  the ho head kephalē of  John Iōannēs the ho baptizer baptistēs on epi a  platter pinax.” "},{"num":26,"verse":"· kai The ho king basileus became ginomai very  sad perilypos, but  because dia of  what ho he  had  promised  with  an  oath horkos,  and kai because  of  his ho dinner anakeimai guests ,  he  did  not ou want thelō to  refuse atheteō her autos request . "},{"num":27,"verse":"So kai without delay  the ho king basileus dispatched apostellō the  executioner spekoulatōr and  ordered epitassō him  to  bring pherō · ho John’ s autos head kephalē.  · kai He  went aperchomai and  beheaded apokephalizō John autos in en · ho prison phylakē, "},{"num":28,"verse":"and kai brought pherō · ho his autos head kephalē on epi a  platter pinax and kai gave didōmi it autos to  the ho young korasion girl .  · kai The ho young korasion girl  in turn  gave didōmi it autos to ho her autos mother mētēr. "},{"num":29,"verse":"· kai When  John’ s autos disciples mathētēs heard akouō · ho of this,  they  came erchomai and kai took airō · ho his autos corpse ptōma and kai placed tithēmi it autos in en a  tomb mnēmeion. "},{"num":30,"verse":"· kai The ho apostles apostolos rejoined synagō · ho Jesus Iēsous and kai reported apangellō to  him autos all pas they  had  done poieō and kai taught didaskō. "},{"num":31,"verse":"And kai he  said legō to  them autos, “ Come deute away  by  yourselves hymeis to eis some  deserted erēmos place topos and kai rest anapauō a  while oligos.”  For gar many polys were eimi · ho coming erchomai and kai · ho going hypagō,  and kai they  did eukaireō not oude even  have  a  time eukaireō to  eat esthiō. "},{"num":32,"verse":"So kai they  left aperchomai in en a ho boat ploion to eis a  deserted erēmos place topos by kata themselves idios. "},{"num":33,"verse":"· kai Many  people polys saw  them autos leaving hypagō,  · kai recognized epiginōskō them,  and kai hurried  together syntrechō on  foot pezē from apo all pas the ho towns polis and kai arrived proerchomai there ekei ahead  of  them autos. "},{"num":34,"verse":"· kai When  Jesus  got exerchomai out  of the boat, he saw the  large polys crowd ochlos,  and kai had  compassion splanchnizomai on epi them autos,  because hoti they  were eimi like hōs sheep probaton without mē echō a  shepherd poimēn.  And kai he  began archō to  teach didaskō them autos many polys things . "},{"num":35,"verse":"· kai As ēdē the  hour hōra grew ginomai late polys,  his autos disciples mathētēs came proserchomai to  him autos · ho and  said legō, “ This  is eimi a  deserted erēmos · ho place topos and kai the  hour hōra is  already ēdē late polys. "},{"num":36,"verse":"Send apolyō them autos away  so hina they  can  go aperchomai into eis the ho surrounding kyklōi hamlets agros and kai villages kōmē and  buy agorazō for  themselves heautou something tis to  eat esthiō.” "},{"num":37,"verse":"But de he ho answered apokrinomai them autos,  saying legō, “ You hymeis give didōmi them autos something  to  eat esthiō.”  And kai they  said legō to  him autos, “ Should  we  go aperchomai and  buy agorazō two  hundred diakosioi denarii dēnarion worth of  bread artos and kai give didōmi it  to  them autos to  eat esthiō?” "},{"num":38,"verse":"And de he ho said legō to  them autos, “ How posos many  loaves artos do  you  have echō?  Go hypagō and see.”  · kai When  they  found ginōskō out  they  said legō, “ Five pente— and kai two dyo fish ichthus.” "},{"num":39,"verse":"Then kai he  ordered epitassō them autos to  have  all pas the people  sit anaklinō down  in  groups symposion on epi the ho green chlōros grass chortos. "},{"num":40,"verse":"So kai they  sat anapiptō down  in  orderly  groups prasia of kata hundreds hekaton and kai fifties pentēkonta. "},{"num":41,"verse":"And kai taking lambanō the ho five pente loaves artos and kai the ho two dyo fish ichthus, and  looking anablepō up  to eis · ho heaven ouranos,  he  blessed eulogeō and kai broke kataklaō the ho loaves artos and kai gave didōmi them  to ho his autos disciples mathētēs so hina they  could  distribute paratithēmi them autos.  And kai he  divided merizō the ho two dyo fish ichthus among  them  all pas. "},{"num":42,"verse":"So kai they  all pas ate esthiō and kai were  filled chortazō. "},{"num":43,"verse":"Then kai they  picked airō up  twelve dōdeka baskets kophinos full plērōma of  broken  pieces klasma and kai what apo was  left  of  the ho fish ichthus. "},{"num":44,"verse":"And kai those ho who  had  eaten esthiō the ho loaves artos were eimi five pentakischilioi thousand  men anēr. "},{"num":45,"verse":"· kai Immediately Jesus  made anankazō · ho his autos disciples mathētēs get embainō into eis the ho boat ploion and kai go proagō on  ahead  of  him  to eis the ho other peran side ,  toward pros Bethsaida Bēthsaida,  while heōs he autos dispersed apolyō the ho crowd ochlos. "},{"num":46,"verse":"· kai After  he  had  taken apotassō leave  of  them autos,  he  went aperchomai to eis the ho mountain oros to  pray proseuchomai. "},{"num":47,"verse":"· kai When  evening opsia had  come ginomai,  the ho boat ploion was eimi in en the  middle mesos of  the ho lake thalassa and kai he autos was  alone monos on epi the ho land gē. "},{"num":48,"verse":"· kai He saw  them autos straining basanizō at en the ho oars elaunō,  for gar the ho wind anemos was eimi against enantios them autos.  About peri the  fourth tetartos watch phylakē of  the ho night nyx he  came erchomai toward pros them autos,  walking peripateō on epi the ho lake thalassa.  · kai He  intended thelō to  pass parerchomai by  them autos, "},{"num":49,"verse":"but de when  they ho saw  him autos walking peripateō on epi the ho lake thalassa,  they  thought dokeō that hoti he  was eimi a  ghost phantasma.  And kai they  cried anakrazō out , "},{"num":50,"verse":"for gar they  all pas saw  him autos and kai were  terrified tarassō.  But de immediately  he ho spoke laleō with meta them autos and kai said legō to  them autos, “ Take  courage tharseō!  It  is eimi I egō.  Do  not mē be  afraid phobeomai!” "},{"num":51,"verse":"Then kai he  got anabainō into eis the ho boat ploion with pros them autos,  and kai the ho wind anemos died kopazō down .  And kai they  were  absolutely lian ek amazed existēmi, "},{"num":52,"verse":"for gar they  did  not ou understand syniēmi about epi the ho loaves artos;  but alla their autos heart kardia was eimi · ho hardened pōroō. "},{"num":53,"verse":"So kai when  they  had  crossed diaperaō over ,  they  came erchomai to epi · ho land gē at eis Gennesaret Gennēsaret · kai where  they  tied prosormizō up  the  boat . "},{"num":54,"verse":"· kai When  they autos got exerchomai out  of ek the ho boat ploion, the people immediately  recognized epiginōskō Jesus autos, "},{"num":55,"verse":"ran peritrechō throughout  that ekeinos whole holos · ho area chōra,  and kai began archō to  bring peripherō those ho who  were echō ill kakōs on epi their ho mats krabattos to  wherever hopou they  heard akouō he  was eimi. "},{"num":56,"verse":"And kai wherever hopou an he  entered eisporeuomai villages kōmē,  towns polis,  or ē rural agros areas ,  they  would  place tithēmi the ho sick astheneō in en the ho marketplaces agora and kai implore parakaleō him autos that hina they  might  touch haptō just kan the ho fringe kraspedon of ho his autos cloak himation.  And kai as  many  as hosos touched haptō him autos were  made  well sōzō. "}]