[{"header":"Teaching at Nazareth"},{"num":6,"verse":"Jesus went out from there and *came into His hometown; and His disciples *followed Him."},{"num":2,"verse":"And when the Sabbath came, He began to teach in the synagogue; and the many listeners were astonished, saying, “Where did this man learn these things, and what is this wisdom that has been given to Him, and such miracles as these performed by His hands?"},{"num":3,"verse":"Is this not the carpenter, the son of Mary and brother of James, Joses, Judas, and Simon? And are His sisters not here with us?” And they took offense at Him."},{"num":4,"verse":"Jesus said to them, “A prophet is not dishonored except in his hometown and among his own relatives, and in his own household.”"},{"num":5,"verse":"And He could not do any miracle there except that He laid His hands on a few sick people and healed them."},{"num":6,"verse":"And He was amazed at their unbelief."},{"header":"The Twelve Sent Out"},{"num":7,"verse":"And He *summoned the twelve and began to send them out in pairs, and gave them authority over the unclean spirits;"},{"num":8,"verse":"and He instructed them that they were to take nothing for their journey, except a mere staff—no bread, no bag, no money in their belt—"},{"num":9,"verse":"but to wear sandals; and He added, “Do not wear two tunics.”"},{"num":10,"verse":"And He said to them, “Wherever you enter a house, stay there until you leave town."},{"num":12,"verse":"And they went out and preached that people are to repent."},{"num":13,"verse":"And they were casting out many demons and were anointing with oil many sick people and healing them."},{"header":"John’s Fate Recalled"},{"num":14,"verse":"And King Herod heard about it, for His name had become well known; and people were saying, “John the Baptist has risen from the dead, and that is why these miraculous powers are at work in Him.”"},{"num":15,"verse":"But others were saying, “He is Elijah.” And others were saying, “He is a prophet, like one of the prophets of old.”"},{"num":16,"verse":"But when Herod heard about it, he kept saying, “John, whom I beheaded, has risen!”"},{"num":17,"verse":"For Herod himself had sent men and had John arrested and bound in prison on account of Herodias, the wife of his brother Philip, because he had married her."},{"num":18,"verse":"For John had been saying to Herod, “It is not lawful for you to have your brother’s wife.”"},{"num":19,"verse":"And Herodias held a grudge against him and wanted to put him to death, and could not do so;"},{"num":20,"verse":"for Herod was afraid of John, knowing that he was a righteous and holy man, and he had been protecting him. And when he heard him, he was very perplexed; and yet he used to enjoy listening to him."},{"num":21,"verse":"An opportune day came when Herod, on his birthday, held a banquet for his nobles and military commanders, and the leading people of Galilee;"},{"num":22,"verse":"and when the daughter of Herodias herself came in and danced, she pleased Herod and his dinner guests; and the king said to the girl, “Ask me for whatever you want, and I will give it to you.”"},{"num":23,"verse":"And he swore to her, “Whatever you ask of me, I will give it to you, up to half of my kingdom.”"},{"num":24,"verse":"And she went out and said to her mother, “What shall I ask for?” And she said, “The head of John the Baptist.”"},{"num":25,"verse":"Immediately she came in a hurry to the king and asked, saying, “I want you to give me at once the head of John the Baptist on a platter.”"},{"num":26,"verse":"And although the king was very sorry, because of his oaths and his dinner guests, he was unwilling to refuse her."},{"num":27,"verse":"Immediately the king sent an executioner and commanded him to bring back his head. And he went and beheaded him in the prison,"},{"num":28,"verse":"and brought his head on a platter, and gave it to the girl; and the girl gave it to her mother."},{"num":29,"verse":"When his disciples heard about this, they came and carried away his body, and laid it in a tomb."},{"num":30,"verse":"The apostles *gathered together with Jesus; and they reported to Him all that they had done and taught."},{"num":31,"verse":"And He *said to them, “Come away by yourselves to a secluded place and rest a little while.” (For there were many people coming and going, and they did not even have time to eat.)"},{"num":32,"verse":"And they went away in the boat to a secluded place by themselves."},{"header":"Five Thousand Men Fed"},{"num":33,"verse":"The people saw them going, and many recognized them and ran there together on foot from all the cities, and got there ahead of them."},{"num":34,"verse":"When Jesus went ashore, He saw a large crowd, and He felt compassion for them because they were like sheep without a shepherd; and He began to teach them many things."},{"num":35,"verse":"And when it was already late, His disciples came up to Him and said, “This place is secluded and it is already late;"},{"num":36,"verse":"send them away so that they may go into the surrounding countryside and villages and buy themselves something to eat.”"},{"num":37,"verse":"But He answered them, “You give them something to eat!” And they *said to Him, “Shall we go and spend two hundred denarii on bread, and give it to them to eat?”"},{"num":38,"verse":"But He *said to them, “How many loaves do you have? Go look!” And when they found out, they *said, “Five, and two fish.”"},{"num":39,"verse":"And He ordered them all to recline by groups on the green grass."},{"num":40,"verse":"They reclined in groups of hundreds and fifties."},{"num":41,"verse":"And He took the five loaves and the two fish, and looking up toward heaven, He blessed the food and broke the loaves and He gave them to the disciples again and again to set before them; and He divided the two fish among them all."},{"num":42,"verse":"And they all ate and were satisfied;"},{"num":43,"verse":"and they picked up twelve full baskets of the broken pieces of bread, and of the fish."},{"num":44,"verse":"There were five thousand men who ate the loaves."},{"header":"Jesus Walks on the Water"},{"num":45,"verse":"And immediately Jesus had His disciples get into the boat and go ahead of Him to the other side, to Bethsaida, while He Himself *dismissed the crowd."},{"num":46,"verse":"And after saying goodbye to them, He left for the mountain to pray."},{"num":47,"verse":"When it was evening, the boat was in the middle of the sea, and He was alone on the land."},{"num":48,"verse":"Seeing them straining at the oars—for the wind was against them—at about the fourth watch of the night, He *came to them, walking on the sea; and He intended to pass by them."},{"num":49,"verse":"But when they saw Him walking on the sea, they thought that it was a ghost, and they cried out;"},{"num":50,"verse":"for they all saw Him and were terrified. But immediately He spoke with them and *said to them, “Take courage; it is I, do not be afraid.”"},{"num":51,"verse":"Then He got into the boat with them, and the wind stopped; and they were utterly astonished,"},{"num":52,"verse":"for they had not gained any insight from the incident of the loaves, but their hearts were hardened."},{"header":"Healing at Gennesaret"},{"num":53,"verse":"When they had crossed over they came to land at Gennesaret, and moored at the shore."},{"num":54,"verse":"And when they got out of the boat, immediately the people recognized Him,"},{"num":55,"verse":"and ran about that entire country and began carrying here and there on their pallets those who were sick, to wherever they heard He was."},{"num":56,"verse":"And wherever He entered villages, or cities, or a countryside, they were laying the sick in the marketplaces and imploring Him that they might just touch the fringe of His cloak; and all who touched it were being healed."}]