[[],[{"type":"header","content":"Rejection at Nazareth"},{"type":"prose","content":"Now Jesus left that place and came to his hometown, and his disciples followed him. "}],[{"type":"prose","content":"When the Sabbath came, he began to teach in the synagogue. Many who heard him were astonished, saying, “Where did he get these ideas? And what is this wisdom that has been given to him? What are these miracles that are done through his hands? "}],[{"type":"prose","content":"Isn’t this the carpenter, the son of Mary and brother of James, Joses, Judas, and Simon? And aren’t his sisters here with us?” And so they took offense at him. "}],[{"type":"prose","content":"Then Jesus said to them, “A prophet is not without honor except in his hometown, and among his relatives, and in his own house.” "}],[{"type":"prose","content":"He was not able to do a miracle there, except to lay his hands on a few sick people and heal them. "}],[{"type":"prose","content":"And he was amazed because of their unbelief. Then he went around among the villages and taught."},{"type":"header","content":"Sending Out the Twelve Apostles"}],[{"type":"prose","content":"Jesus called the twelve and began to send them out two by two. He gave them authority over the unclean spirits. "}],[{"type":"prose","content":"He instructed them to take nothing for the journey except a staff—no bread, no bag, no money in their belts—"}],[{"type":"prose","content":"and to put on sandals but not to wear two tunics. "}],[{"type":"prose","content":"He said to them, “Wherever you enter a house, stay there until you leave the area. "}],[{"type":"prose","content":"If a place will not welcome you or listen to you, as you go out from there, shake the dust off your feet as a testimony against them.” "}],[{"type":"prose","content":"So they went out and preached that all should repent. "}],[{"type":"prose","content":"They cast out many demons and anointed many sick people with olive oil and healed them."},{"type":"header","content":"The Death of John the Baptist"}],[{"type":"prose","content":"Now King Herod heard this, for Jesus’ name had become known. Some were saying, “John the baptizer has been raised from the dead, and because of this, miraculous powers are at work in him.” "}],[{"type":"prose","content":"Others said, “He is Elijah.” Others said, “He is a prophet, like one of the prophets from the past.” "}],[{"type":"prose","content":"But when Herod heard this, he said, “John, whom I beheaded, has been raised!” "}],[{"type":"prose","content":"For Herod himself had sent men, arrested John, and bound him in prison on account of Herodias, his brother Philip’s wife, because Herod had married her. "}],[{"type":"prose","content":"For John had repeatedly told Herod, “It is not lawful for you to have your brother’s wife.” "}],[{"type":"prose","content":"So Herodias nursed a grudge against him and wanted to kill him. But she could not "}],[{"type":"prose","content":"because Herod stood in awe of John and protected him, since he knew that John was a righteous and holy man. When Herod heard him, he was thoroughly baffled, and yet he liked to listen to John."}],[{"type":"prose","content":"But a suitable day came, when Herod gave a banquet on his birthday for his court officials, military commanders, and leaders of Galilee. "}],[{"type":"prose","content":"When his daughter Herodias came in and danced, she pleased Herod and his dinner guests. The king said to the girl, “Ask me for whatever you want and I will give it to you.” "}],[{"type":"prose","content":"He swore to her, “Whatever you ask I will give you, up to half my kingdom.” "}],[{"type":"prose","content":"So she went out and said to her mother, “What should I ask for?” Her mother said, “The head of John the baptizer.” "}],[{"type":"prose","content":"Immediately she hurried back to the king and made her request: “I want the head of John the Baptist on a platter immediately.” "}],[{"type":"prose","content":"Although it grieved the king deeply, he did not want to reject her request because of his oath and his guests. "}],[{"type":"prose","content":"So the king sent an executioner at once to bring John’s head, and he went and beheaded John in prison. "}],[{"type":"prose","content":"He brought his head on a platter and gave it to the girl, and the girl gave it to her mother. "}],[{"type":"prose","content":"When John’s disciples heard this, they came and took his body and placed it in a tomb."},{"type":"header","content":"The Feeding of the Five Thousand"}],[{"type":"prose","content":"Then the apostles gathered around Jesus and told him everything they had done and taught. "}],[{"type":"prose","content":"He said to them, “Come with me privately to an isolated place and rest a while” (for many were coming and going, and there was no time to eat). "}],[{"type":"prose","content":"So they went away by themselves in a boat to some remote place. "}],[{"type":"prose","content":"But many saw them leaving and recognized them, and they hurried on foot from all the towns and arrived there ahead of them. "}],[{"type":"prose","content":"As Jesus came ashore he saw the large crowd and he had compassion on them, because they were like sheep without a shepherd. So he taught them many things."}],[{"type":"prose","content":"When it was already late, his disciples came to him and said, “This is an isolated place and it is already very late. "}],[{"type":"prose","content":"Send them away so that they can go into the surrounding countryside and villages and buy something for themselves to eat.” "}],[{"type":"prose","content":"But he answered them, “You give them something to eat.” And they said, “Should we go and buy bread for 200 silver coins and give it to them to eat?” "}],[{"type":"prose","content":"He said to them, “How many loaves do you have? Go and see.” When they found out, they said, “Five—and two fish.” "}],[{"type":"prose","content":"Then he directed them all to sit down in groups on the green grass. "}],[{"type":"prose","content":"So they reclined in groups of hundreds and fifties. "}],[{"type":"prose","content":"He took the five loaves and the two fish, and looking up to heaven, he gave thanks and broke the loaves. He gave them to his disciples to serve the people, and he divided the two fish among them all. "}],[{"type":"prose","content":"They all ate and were satisfied, "}],[{"type":"prose","content":"and they picked up the broken pieces and fish that were left over, twelve baskets full. "}],[{"type":"prose","content":"Now there were 5,000 men who ate the bread."},{"type":"header","content":"Walking on Water"}],[{"type":"prose","content":"Immediately Jesus made his disciples get into the boat and go on ahead to the other side, to Bethsaida, while he dispersed the crowd. "}],[{"type":"prose","content":"After saying goodbye to them, he went to the mountain to pray. "}],[{"type":"prose","content":"When evening came, the boat was in the middle of the sea and he was alone on the land. "}],[{"type":"prose","content":"He saw them straining at the oars, because the wind was against them. As the night was ending, he came to them walking on the sea, for he wanted to pass by them. "}],[{"type":"prose","content":"When they saw him walking on the water they thought he was a ghost. They cried out, "}],[{"type":"prose","content":"for they all saw him and were terrified. But immediately he spoke to them: “Have courage! It is I. Do not be afraid.” "}],[{"type":"prose","content":"Then he went up with them into the boat, and the wind ceased. They were completely astonished, "}],[{"type":"prose","content":"because they did not understand about the loaves, but their hearts were hardened."},{"type":"header","content":"Healing the Sick"}],[{"type":"prose","content":"After they had crossed over, they came to land at Gennesaret and anchored there. "}],[{"type":"prose","content":"As they got out of the boat, people immediately recognized Jesus. "}],[{"type":"prose","content":"They ran through that whole region and began to bring the sick on mats to wherever he was rumored to be. "}],[{"type":"prose","content":"And wherever he would go—into villages, towns, or countryside—they would place the sick in the marketplaces, and would ask him if they could just touch the edge of his cloak, and all who touched it were healed."}]]