[{"header":"Spying in Canaan"},{"num":13,"verse":"And the Lord spoke to Moses, saying, "},{"num":2,"verse":"“Send men that they may explore the land of Canaan, which I am giving to the children of Israel. Of every tribe of their fathers you will send a man, each one a chief among them.”"},{"num":3,"verse":"And Moses sent them from the Wilderness of Paran according to the Lord. All those men were heads of the children of Israel. "},{"num":4,"verse":"These were their names:"},{"num":16,"verse":"These are the names of the men whom Moses sent to explore the land. And Moses called Hoshea the son of Nun Joshua."},{"num":17,"verse":"Moses sent them to explore the land of Canaan and said to them, “Go up to this southland, and go up into the mountain. "},{"num":18,"verse":"And see what the land is, and the people that dwell in it, whether they are strong or weak, few or many; "},{"num":19,"verse":"and what the land is that they dwell in, whether it is good or bad, and what cities are that they dwell in, whether in tents, or in fortifications; "},{"num":20,"verse":"and what the land is, whether it is fat or lean, whether there is wood in it or not. And you be courageous and bring some of the fruit of the land.” Now the time was the time of the first ripe grapes."},{"num":21,"verse":"So they went up and explored the land from the Wilderness of Zin to Rehob, near Lebo Hamath. "},{"num":22,"verse":"They went up by the Negev and came to Hebron where Ahiman, Sheshai, and Talmai, the children of Anak, were (now Hebron was built seven years before Zoan in Egypt). "},{"num":23,"verse":"And they came to the Valley of Eshkol, and cut down from there a branch with one cluster of grapes, and they carried it on a pole between two of them, and they brought some of the pomegranates and of the figs. "},{"num":24,"verse":"The place was called the Valley of Eshkol because of the cluster of grapes which the children of Israel cut down from there. "},{"num":25,"verse":"They returned from exploring the land after forty days."},{"header":"The Spies’ Report"},{"num":26,"verse":"And they returned and came to Moses and to Aaron and to all the assembly of the children of Israel, to the Wilderness of Paran, to Kadesh, and brought back word to them and to the entire assembly and showed them the fruit of the land. "},{"num":27,"verse":"They reported to him and said, “We came to the land where you sent us, and surely it flows with milk and honey, and this is the fruit of it. "},{"num":28,"verse":"However, the people are strong that dwell in the land, and the cities are fortified and very great, and also we saw the children of Anak there. "},{"num":29,"verse":"The Amalekites dwell in the land of the Negev, and the Hittites, and the Jebusites, and the Amorites dwell in the mountains, and the Canaanites dwell by the sea and by the edge of the Jordan.”"},{"num":30,"verse":"Caleb silenced the people before Moses and said, “Let us go up at once and possess it, for we are able to overcome it.”"},{"num":31,"verse":"But the men that went up with him said, “We are not able to go up against the people because they are stronger than we.” "},{"num":32,"verse":"They gave the children of Israel a bad report of the land which they had spied out, saying, “The land through which we have gone as spies is a land that devours its inhabitants, and all the people whom we saw in it are men of great stature. "},{"num":33,"verse":"And there we saw the giants, the sons of Anak, which come from the giants, and in our eyes we were like grasshoppers, and so we were in their eyes.”"}]