[{"header":"Twelve Men Check Out the Land of Canaan"},{"num":13,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Send some men to check out the land of Canaan. I am giving it to the Israelites. Send one leader from each of Israel’s tribes.”"},{"num":3,"verse":"So Moses sent them out from the Desert of Paran. He sent them as the Lord had commanded. All of them were leaders of the Israelites."},{"num":4,"verse":"Here are their names."},{"num":16,"verse":"Those are the men Moses sent to check out the land. He gave the name Joshua to Hoshea, the son of Nun."},{"num":17,"verse":"Moses sent the 12 men to check out Canaan. He said, “Go up through the Negev Desert. Go on into the central hill country. "},{"num":18,"verse":"See what the land is like. See whether the people who live there are strong or weak. See whether they are few or many. "},{"num":19,"verse":"What kind of land do they live in? Is it good or bad? What kind of towns do they live in? Do the towns have high walls around them or not? "},{"num":20,"verse":"How is the soil? Is it rich land or poor land? Are there trees in it or not? Do your best to bring back some of the fruit of the land.” It was the season for the first ripe grapes."},{"num":21,"verse":"So the men went up and checked out the land. They went from the Desert of Zin as far as Rehob. It was in the direction of Lebo Hamath. "},{"num":22,"verse":"They went up through the Negev Desert and came to Hebron. That’s where Ahiman, Sheshai and Talmai lived. They belonged to the family line of Anak. Hebron had been built seven years before Zoan. Zoan was a city in Egypt. "},{"num":23,"verse":"The men came to the Valley of Eshkol. There they cut off a branch that had a single bunch of grapes on it. Two of them carried it on a pole between them. They carried some pomegranates and figs along with it. "},{"num":24,"verse":"That place was called the Valley of Eshkol. That’s because the men of Israel cut off a bunch of grapes there. "},{"num":25,"verse":"At the end of 40 days, the men returned from checking out the land."},{"header":"The Men Report on What They Found"},{"num":26,"verse":"The men came back to Moses, Aaron and the whole community of Israel. The people were at Kadesh in the Desert of Paran. There the men reported to Moses and Aaron and all the people. They showed them the fruit of the land. "},{"num":27,"verse":"They gave Moses their report. They said, “We went into the land you sent us to. It really does have plenty of milk and honey! Here’s some fruit from the land. "},{"num":28,"verse":"But the people who live there are powerful. Their cities have high walls around them and are very large. We even saw members of the family line of Anak there. "},{"num":29,"verse":"The Amalekites live in the Negev Desert. The Hittites, Jebusites and Amorites live in the central hill country. The Canaanites live near the Mediterranean Sea. They also live along the Jordan River.”"},{"num":30,"verse":"Then Caleb interrupted the men speaking to Moses. He said, “We should go up and take the land. We can certainly do it.”"},{"num":31,"verse":"But the men who had gone up with him spoke. They said, “We can’t attack those people. They are stronger than we are.” "},{"num":32,"verse":"The men spread a bad report about the land among the Israelites. They said, “The land we checked out destroys those who live in it. All the people we saw there are very big and tall. "},{"num":33,"verse":"We saw the Nephilim there. We seemed like grasshoppers in our own eyes. And that’s also how we seemed to them.” The family line of Anak came from the Nephilim."}]