[{"num":13,"verse":"And Hashem spoke unto Moshe, saying,"},{"num":2,"verse":"Send thou anashim, that they may spy out Eretz Kena’an, which I give unto the Bnei Yisroel: of every tribe of their avot shall ye send a man, every one a nasi among them."},{"num":3,"verse":"And Moshe by the mouth of Hashem sent them from the Midbar Paran; all those men were Roshei Bnei Yisroel."},{"num":4,"verse":"And these were their shmot: of the tribe of Reuven, Shammua ben Zaccur."},{"num":5,"verse":"Of the tribe of Shim’on, Shaphat ben Chori."},{"num":6,"verse":"Of the tribe of Yehudah, Kalev ben Yephunneh."},{"num":7,"verse":"Of the tribe of Yissakhar, Yigal ben Yosef."},{"num":8,"verse":"Of the tribe of Ephrayim, Hoshea ben Nun."},{"num":9,"verse":"Of the tribe of Binyamin, Palti ben Raphu."},{"num":10,"verse":"Of the tribe of Zevulun, Gaddiel ben Sodi."},{"num":11,"verse":"Of the tribe of Yosef, namely, of the tribe of Menasheh, Gaddi ben Susi."},{"num":12,"verse":"Of the tribe of Dan, Ammiel ben Gemalli."},{"num":13,"verse":"Of the tribe of Asher, Setur ben Michael."},{"num":14,"verse":"Of the tribe of Naphtali, Nachbi ben Vophsi."},{"num":15,"verse":"Of the tribe of Gad, Geuel ben Machi."},{"num":16,"verse":"These are the shmot of the men which Moshe sent to spy out the land. And Moshe called Hoshea ben Nun Yehoshua [See Zecharyah 6:11-12 on the personal name of Moshiach in prophecy]."},{"num":17,"verse":"And Moshe sent them to spy out Eretz Kena’an, and said unto them, Get you up to the Negev, and go up into the mountain;"},{"num":18,"verse":"And see the land, what it is like, and the people that dwelleth therein, whether they be strong or weak, few or many;"},{"num":19,"verse":"And what the land is that they dwell in, whether it be good or bad; and what cities they be that they dwell in, whether in tents, or in strongholds;"},{"num":20,"verse":"And what the land is, whether it be fertile or barren, whether there be wood therein, or not. And be ye of good courage, and bring of the fruit of the land. Now the time was the time of the first ripe grapes."},{"num":21,"verse":"So they went up, and searched the land from the midbar of Tzin unto Rechov, as men come to Chamat."},{"num":22,"verse":"And they ascended by the south, and came unto Chevron; where Achiman, Sheshai, and Talmai, the Anak, were. (Now Chevron was built seven shanim before Tzoan in Mitzrayim.)"},{"num":23,"verse":"And they came unto the Wadi Eshcol, and cut down from thence a branch with cluster of anavim echad, and they bore it between two upon a staff; and they brought of the pomegranates, and of the figs."},{"num":24,"verse":"The place was called the Wadi Eshcol, because of the cluster of grapes which the Bnei Yisroel cut down from thence."},{"num":25,"verse":"And they returned from searching of the land after arba’im days."},{"num":26,"verse":"And they went and came to Moshe, and to Aharon, and to all the congregation of the Bnei Yisroel, unto the Midbar Paran, to Kadesh; and brought back word unto them, and unto Kol HaEdah, and showed them the pri ha’aretz."},{"num":27,"verse":"And they told him, and said, We came unto ha’aretz where thou didst send us, and truly it floweth with cholov and devash; and this is the fruit of it."},{"num":28,"verse":"Nevertheless the people are strong that dwell in the land, and the cities are walled, and gedolot me’od; and moreover we saw the Anak there."},{"num":29,"verse":"The Amalek dwell in the eretz of the Negev; and the Chitti, and the Yevusi, and the Emori, dwell in the hills; and the Kena’ani dwell by the yam, and by the bank of the Yarden."},{"num":30,"verse":"And Kalev silenced HaAm before Moshe, and said, Let us go up at once, and take possession of it; for we are well able to overcome it."},{"num":31,"verse":"But the anashim that went up with him said, We are not able to go up against the people; for they are chazak (stronger) than we."},{"num":32,"verse":"And they spread an evil report of HaAretz which they had explored unto the Bnei Yisroel, saying, HaAretz, through which we have gone to explore it, is a land that eateth up the inhabitants thereof; and all the people that we saw in it are men of a great stature."},{"num":33,"verse":"And there we saw the Nephilim, the Bnei Anak, which come of the Nephilim; and we were in our own sight as grasshoppers, and so we were in their sight."}]