[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His neighbour.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his fellow-citizen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "according to the best reading. The second promise is the universality of the knowledge of God. The divine teaching shall not only be internal, but for this very reason shall extend to all.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hebrews",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "‘ALL SHALL KNOW ME’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "IN former sermons I have tried to bring out the force of the preceding two articles of ‘the New Covenant’ These two were the substitution of inward inclination and impulse for the rigid bonds of an external commandment, and the substitution of a real, spiritual, mutual possession of God and His people for the mere outward relationship that existed between Israel and Jehovah-My text is the third article of the New Covenant, It lays hold, like the other two, of something that characterised the ancient dispensation, declares its imperfection, recognises its prophetic aspect, and asserts that all which the former merely shadowed and foretold is accomplished in Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In old days there had been some direct communication between God and a chosen few, the spiritual aristocracy of the nation, and they spake the things that they had heard of God to the multitude who had had no such communication. My text says that all this is swept away, and that the prerogative of every Christian man is direct access to, communication with, and instruction from, God Himself. The text has two things in it; the promise, which is the essence of it, and a consequence which is deduced from that promise, and sets forth its results in a graphic manner. ‘They all shall know Me, from the least to the greatest’; that is the real promise. ‘They shall no more teach every man his neighbour saying, ‘Know the",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Lord,’ is but a result thereof.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Now, I ask you to look with me at what this great promise means.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘They shall know Me.’ Perhaps I can best explain what I take it to mean by commencing with an analogy or two which may help us to apprehend what is the significance of these words. We all know the difference between hearsay and sight. We may have read books of travel, and tell of some scene of great natural beauty or historic interest, and may think that we understand all about it, but it is always an epoch when our own eyes look for the first time at the snowy summit of an Alp, or for the first time at the Parthenon on its rocky height. We all know the difference between hearsay and experience. We read books of the poets that portray love and sorrow, and the other emotions that make up our throbbing, changeful life; but we need to go through the mill ourselves before we understand what the grip of the iron teeth of the harrow of affliction is, and we need to have had our own hearts dilated By a true and blessed affection, before we know the sweetness of love. Men may tell us about it, but we have to feel it ourselves before we know.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "To come still closer to the force of my text, we all know the difference between hearing about a man and making his acquaintance. We may have been told much about him, and be familiar with his character, as we think, but, when we come face to face with him, and actually for ourselves experience the magnetism of his presence, or fall under the direct influence of his character, then we know that our former acquaintance with him, by means of hearsay, was but superficial and shadowy. ‘I have heard of thee by the hearing of the ear, but now mine eyes see thee.’ Can you say that? If so, you understand my text - ‘They shall no more teach every man... his brother, saying, Know the Lord, and make acquaintance with Him’ as if He were a stranger - for ‘all shall know Me, from the least to the greatest.’ There is all the difference between knowing about God and knowing God; just the difference .that there is between dogma and life, between theology and religion. We may have all articles of the Christian creed clear in our understandings, and may owe our possession of them to other people’s teaching; we may even, in a sense, believe them, and yet they may be absolutely outside of our lives, and it is only when they pass into the very substance of our being, and influence the springs of our conduct - it is only then that we know God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, I maintain that this acquaintance with Him is what is meant in our text. It may not include any more intellectual propositions about Him than a man had before he knew Him, but it has turned doctrines into fact, and instead of the mere hearsay and traditional religion, which is the only religion of millions, it has brought the true heart-grasp of Him, which is the only thing worth calling a knowledge of God. For let me remind you that, whilst we may know a science or proposition by the exercise of our understandings in appropriate ways, that is not how we know people. And God is a person, and to know Him does not mean to understand about Him, but to be on speaking terms with Him, to have a familiar acquaintance with Him, to ‘summer and winter’ with Him, and so, by experience, to verify the things that before were mere doctrines. Now, at least the large majority of you call yourselves believers in Christianity. I want you to ask yourselves, and I would ask myself, whether my religion is knowing about God or knowing Him; whether it is all made up of a set of truths which I assent to, mainly because I am not sufficiently interested in them to contradict them, or whether these truths have become the very substance of my life. I do not believe in a religion without a dogma - I was going to say, I believe still less in a dogma without religion; and that is the Christianity of hosts of professing Christians. It is as useless as are the dried seeds that rattle in the withered head of a poppy in the autumn, or as the shrivelled kernel that sounds in the hollowness of a half-empty nut. Remember, dear brethren, that to know God is to become acquainted with Him, and that only on the path of such familiar, friendly, loving intercourse and communion with Him, can men find the confirmation of the truths about Him which make up the eternal revelation of Him in the gospel. ‘We know’ - that is a valid certainty, arising from experience, and it has as good a right to call itself knowledge as have the processes by which men come to be sure about the physical facts of this material universe. Nay! I would even go further, and say that the fact that such a continual stream of witnesses, through all the generations, have been able to say, ‘I have tasted and I have seen that God is good,’ is to be taken into account by all impartial searchers after truth. And if men want to square their creeds with all the facts of humanity, let them not omit, in their consideration of the claims of Christian evidence, this fact, that from generation to generation men have said, and their lives have witnessed to its truths, ‘We know in whom we have believed, and that He is able to keep us. We know that we are of God. Dear brethren! the whole case for Christianity cannot be appreciated from outside. ‘Taste and see.’ My text shows us the more true way. If we will accept that covenant we shall know the Lord in the depths of our hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Notice how far this promise extends.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "They all, from the least to the greatest, shall know; There is to be no distinction of rank or age, or endowment, which shall result in some of the people of God having a position from which any of the others are altogether shut out.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The writer is, of course, contrasting in his mind, though he does not express the contrast, the condition of things of old, when, as I said, the spiritual aristocracy of the nation received communications which they then imparted to their fellows. In the morning dawn the highest summits catch the rays first, but as the sun rises it floods the lower levels, and at mid-day shines right down into the depths of the cavities. So the world is now flooded with the light of Christ; and all Christian men and women, by virtue of their Christian character, do possess the unction from the Holy One, in which lie the potency and the promise of the knowledge of all things that are needful to be known for life and godliness. This is the true democracy of the gospel-the universal possession of the life of Christ through the Spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, if that be so, then it is by no means a truth to be kept simply for the purpose of fighting against ecclesiastical or sacerdotal encroachments and denials of it, but it ought to be taken as the candle of the Lord, by each of us, and in the light of it we ought to search very rigidly, and very often, our own Christian character and experiences. You, dear brethren, with whom I am most closely associated here, you professing Christians of this congregation - do you know anything about that inward knowledge of God which comes from friendship with Him, and speaks irrefragable certainties in the heart which receives it? ‘If any man have not the spirit of Christ, he is none of His.’ If you owe all your knowledge of, and your faith in, the great verities of the gospel, and the loving personality of God, to the mere report of others, if you cannot verify these by your own experience, if you cannot say, ‘Many things I know not; you can easily puzzle me with critical and philosophical subtleties, but this one thing I do know, that whereas I was blind, now I see’ - if you cannot say that, I pray you, bethink yourselves whether your religion is not mainly a form, and how far it has any life in it at all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But whilst thus the great promise of my text, in its very blessedness and fulness, does carry with it soma solemn suggestions for searching self- examination, it also points in another direction. For consider what it excludes and what it permits, in the way of brotherly help and guidance. It certainly excludes on the one hand, all assumption of authority over the consciences and the understandings of Christian people, on the part either of churches or individuals, and, it makes short work of all claims that there continues a class of persons officially distinguished from their brethren, and having closer access to God than they. The true understanding of these words of my text, the recognition of the universality of the knowledge of God in all Christian people, has great revolutionary work yet to do amongst the churches of Christendom. For I do not know that there are any of them that have sufficiently recognised this principle. Not only in a church whore there is a priesthood and an infallible head of the Church on earth, nor only in churches that are bound by human creeds imposed on them by men, but also in churches like ours, where there is no formal recognition of either of these two errors, the practical contradiction of this article of the New Covenant is apt to creep in. It is a great deal more the fault of the people than of the priest, a great deal more the fault of the congregation than of the pastor, when they are lazily contented to take all their religion at second-hand from him, and to shuffle all the responsibility off their own shoulders on to his. If my text obliges me, and all men who stand in my position, to say with the Apostle, ‘Not for that we have dominion over your faith, but are helpers of your joy,’ it obliges you, dear brethren, to take nothing from me, or any man, on our bare words, nor to exalt any of us into a position which would contradict the great principle of my text, but yourselves, at first hand, to go to God, and get straight from Him the teaching which He only can give. Dominion and subjection, authority and submission to men, in any part of the church are shut out by such words as these.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But brotherly help is not shut out. If a party of men are climbing a hill, and one is in advance of his fellows, when he reaches the summit he may look down and call to those below, and tell them how fair and wide the view is, and beckon them to come and give them a helping hand up. So, because Christian men vary in the extent to which they possess and utilise the one gift of knowledge of God, and some of them are in advance of the others, it is all in accordance with the principle of my text that they that are in advance should help their brethren, and give them a brotherly hand. Not as if my brother’s word can give me the inward knowledge of God, but it may help me to get that knowledge for myself. We - I speak now as a member of the preaching class - we can but do what the friend of the bridegroom does; he brings the bride to her lover, and then he shuts the door and leaves the two to themselves That is all that any of us can do. You must yourself draw the water from the well of salvation. We can only tell you, ‘there is the well, and the water is sweet.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, the means by which this promise is fulfilled.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I have already pointed out, in previous sermons, that the conception of the gospel as a new covenant was endorsed by Jesus Christ Himself in words which tell us how all these blessings that are set forth in this context are secured and brought to men, when in the institution of the Lord’s Supper, He spoke of ‘the New Covenant in His blood.’ So I set first and foremost, above all other means, this one great truth, that all this inward knowledge of God, which is the prerogative of every Christian man, is made possible and actual for any of us, only by and through the mission, and especially the death, of Jesus Christ our Lord. For therein does He set forth God to be known as nothing else but that supreme suffering and supreme self- surrender upon the Cross, ever can do or has done. We know God as He would have us know Him, only when we see Jesus suffering and dying for us; and then adoringly, as one in the presence of a mystery into which he can but look a little way, Bay that even there and then ‘he that hath seen that Christ hath seen the Father.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jesus Christ’s Mood, the seal of the Covenant, is the great means by which this promise is fulfilled, inasmuch u in that death He sweeps away all the hindrances which bar us out from the knowledge of God. The great dark wall of my sin rises between me and my Father. Christ’s blood, like some magic drops upon a fortification, causes all the black barrier to melt away like a cloud; and the access to the throne of God is patent, even for sinful creatures like us. The veil is rent, and by that blood we have access into the holiest of all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Christ is the source of this knowledge of God, inasmuch, further, as by His mission and death there is given to the whole world, if it will receive it, and to all who exercise faith in His name, the gift of that Divine Spirit who teaches to our inmost spirit the true knowledge of His Son.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And so, dear brethren, since it is in the incarnate and dying Christ that all knowledge of God is brought to men, that all possibility of friendship and communion between men and God is rooted, and that the Divine Spirit who leads us into the deep things of God is granted to each of us, there follows the plain conclusion that the one way by which every man and",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "woman on earth may find him and herself included within that ‘all, from the least to the greatest,’ is simply trust in Christ Jesus, in whom, in whose life, in whose death, God is made known, our alienation is swept away, and the Spirit of God, the Divine Teacher, is granted to us all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Only, remember that my text stands in close connection with the preceding articles of this covenant, and that to delight in the law of the Lord is the sure way to know more of the Lord. One act of obedience from the heart will teach us more of God than all the sages can. It is more illuminating simply to do as He willed than to read and think and speculate and study.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘If any man wills to do His will, he shall know of the teaching.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And mutual possession of God by us, and of us by God, leads to fuller knowledge. To possess God is to love Him; and ‘he that loveth knoweth God, yea! rather is known of God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So, dear brethren, do not be content with traditional religion, with a hearsay Christianity. ‘Acquaint now thyself with Him,’ and be at peace. Oh! there is nothing sweeter to a true preacher of Christ and His salvation than that those to whom he preaches should be able to do without him. It is my business to point you away from myself, however much I prize your love and confidence, as I ought to do; and to beseech you, for your own soul’s sake, that you would by faith in Christ attain that knowledge of the only true God which He is sent to give. Then you will be able to say, ‘Now, we believe not because of thy saying, for we have heard Him ourselves, and know that this is, indeed, the Christ, the Saviour of the world.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 8:11-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:11-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who are under this covenant; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall not teach",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — That is, shall not any more have need to teach; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "every man his neighbour, &c., saying, Know the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Though in other respects they will have need to teach each other to their lives’ end; yet they shall not need to teach each other the knowledge of the Lord; for this they shall possess; yea, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "real Christians, who believe in Jesus as the true Messiah, with a living faith, a faith working by love, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall know me ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Even as a pardoning God, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and therefore savingly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the least to the greatest ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— From the babe in Christ, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "little children ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "spoken of by St. John, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whose sins are forgiven them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "unto such as are of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "full ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "age; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strong ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the Lord, and deeply experienced in his ways. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 2:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the least ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "may be meant the poor and despised, and by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the greatest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "persons of wealth, authority, and power. In this order, the saving knowledge of God ever did, and ever will proceed; not from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "greatest ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "least, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but from the least to the greatest; from the poor to the rich; from the low to the high; that no flesh may glory in his presence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For I will be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "merciful to their unrighteousness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— I will pardon and accept them through my Son, in consequence of their repentance and faith in him; or, I will justify them, and give them peace with myself, and thus will make them wise unto salvation, truly holy and happy. Observe, reader, justification and peace with God is the root of all true knowledge of God and conformity to him. This, therefore, is God’s method; First, a sinner, being brought to true repentance toward God, and faith in our Lord Jesus Christ, is pardoned; then he knows God as gracious and merciful; then God’s laws are written on his heart; he is God’s, and God is his. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And their sins and their iniquities will I remember no more ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, so as to punish them. In the Hebrew of Jeremiah, this passage runs thus; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will forgive their iniquity, and will remember their sin no more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably the apostle translated the prophet’s words freely, to show, that, under the new covenant, every kind of sin is freely forgiven to the truly penitent and believing, which was not the case under the former covenant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:7-13 The superior excellence of the priesthood of Christ, above that of Aaron, is shown from that covenant of grace, of which Christ was Mediator. The law not only made all subject to it, liable to be condemned for the guilt of sin, but also was unable to remove that guilt, and clear the conscience from the sense and terror of it. Whereas, by the blood of Christ, a full remission of sins was provided, so that God would remember them no more. God once wrote his laws to his people, now he will write his laws in them; he will give them understanding to know and to believe his laws; he will give them memories to retain them; he will give them hearts to love them, courage to profess them, and power to put them in practice. This is the foundation of the covenant; and when this is laid, duty will be done wisely, sincerely, readily, easily, resolutely, constantly, and with comfort. A plentiful outpouring of the Spirit of God will make the ministration of the gospel so effectual, that there shall be a mighty increase and spreading of Christian knowledge in persons of all sorts. Oh that this promise might be fulfilled in our days, that the hand of God may be with his ministers so that great numbers may believe, and be turned to the Lord! The pardon of sin will always be found to accompany the true knowledge of God. Notice the freeness of this pardon; its fulness; its fixedness. This pardoning mercy is connected with all other spiritual mercies: unpardoned sin hinders mercy, and pulls down judgments; but the pardon of sin prevents judgment, and opens a wide door to all spiritual blessings. Let us search whether we are taught by the Holy Spirit to know Christ, so as uprightly to love, fear, trust, and obey him. All worldly vanities, outward privileges, or mere notions of religion, will soon vanish away, and leave those who trust in them miserable for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall not teach every man his neighbor ... - That is, no one shall be under a necessity of imparting instruction to another, or of exhorting him to become acquainted with the Lord. This is designed to set forth another of the advantages which would attend the new dispensation. In the previous verse it had been said that one advantage of that economy would be, that the Law would be written on the heart, and that they who were thus blessed would be regarded as the people of God. Another advantage over the \"old\" arrangement or covenant is here stated. It is, that the knowledge of the Lord and of the true religion would be deeply engraved on the minds of all, and that there would be no necessity for mutual exhortation and counsel. \"They shall have a much more certain and effectual teaching than they can derive from another.\" \"Doddridge.\" This passage does not refer to the fact that the true religion will be universally diffused, but that among those who are interested in the blessings of the new covenant there would be an accurate and just knowledge of the Lord. In some way they would be so taught respecting his character that they would not need the aid to be derived from others. All under that dispensation, or sustaining to him the relation of \"a people,\" would in fact have a correct knowledge of the Lord. This could not be said of the old dispensation, for.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) their religion consisted much in outward observances.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) it was not to such an extent as the new system a dispensation of the Holy Spirit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) there were not as many means as now for learning the true character of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) the fullest revelations had not been made to them of that character. That was reserved for the coming of the Saviour, and under him it was intended that there should be communicated the full knowledge of the character of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Many mss., and those among the best, here have πολίτην  politēn - \"citizen;\" \"fellow-citizen,\" instead of πλησίον  plēsion, \"neighbor,\" and this is adopted by Griesbach, Tittman, Rosenmuller, Knapp, Stuart, and by many of the fathers. It is also in the version of the Septuagint in the place quoted from Jeremiah. It is not easy to determine the true reading, but the word \"neighbor\" better agrees with the meaning of the Hebrew - רץ  rēà - and there is strong authority from the mss. and the versions for this reading.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And every man his brother - Another form of expression, meaning that there would be no necessity that one should teach another.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Saying, Know the Lord - That is, become acquainted with God; learn his character and his will. The idea is, that the true knowledge of Yahweh would prevail as a characteristic of those times.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For all shall know me - That is, all those referred to; all who are interested in the new covenant, and who are partakers of its blessings. It does not mean that all persons, in all lands, would then know the Lord - though the time will come when that will be true; but the expression is to be limited by the point under discussion. That point is not that the knowledge of the Lord will fill the whole world, but that all who are interested in the new dispensation will have a much more full and clear knowledge of God than was possessed under the old. Of the truth of this no one can doubt. Christians have a much more perfect knowledge of God and of his government than could have been learned merely from the revelations of the Old Testament. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For all shall know me - That is, all those referred to; all who are interested in the new covenant, and who are partakers of its blessings. It does not mean that all persons, in all lands, would then know the Lord - though the time will come when that will be true; but the expression is to be limited by the point under discussion. That point is not that the knowledge of the Lord will fill the whole world, but that all who are interested in the new dispensation will have a much more full and clear knowledge of God than was possessed under the old. Of the truth of this no one can doubt. Christians have a much more perfect knowledge of God and of his government than could have been learned merely from the revelations of the Old Testament. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. Second of the \"better promises\" (Heb 8:6).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall not—\"they shall not have to teach\" [Alford].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his neighbour—So Vulgate reads; but the oldest manuscripts have \"his (fellow) citizen.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "brother—a closer and more endearing relation than fellow citizen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from the least to the greatest—Greek, \"from the little one to the great one.\" Zec 12:8, \"He that is feeble among them shall be as David.\" Under the old covenant, the priest's lips were to keep knowledge, and at his mouth the people were to seek the law: under the new covenant, the Holy Spirit teaches every believer. Not that the mutual teaching of brethren is excluded while the covenant is being promulgated; but when once the Holy Spirit shall have fully taught all the remission of their sins and inward sanctification, then there shall be no further' need of man teaching his fellow man. Compare 1Th 4:9; 5:1, an earnest of that perfect state to come. On the way to that perfect state every man should teach his neighbor. \"The teaching is not hard and forced, because grace renders all teachable; for it is not the ministry of the letter, but of the spirit (2Co 3:6). The believer's firmness does not depend on the authority of human teachers. God Himself teaches\" [Bengel]. The New Testament is shorter than the Old Testament, because, instead of the details of an outward letter law, it gives the all-embracing principles of the spiritual law written on the conscience, leading one to spontaneous instinctive obedience in outward details. None save the Lord can teach effectually, \"know the Lord.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And they shall not teach:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the subject implied in the plural verb, and by a partitive particle expressed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "every man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is in Jeremiah’s text vya a man, even every truly covenanted one who hath the knowledge of the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they shall teach no more, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 31:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". A double negative supplieth it in this verse, ou mn denying that weak and fruitless kind of teaching which was under the Mosaical covenant administration, whereby souls were not savingly edified in the knowledge of God, there was imperfection both in their knowledge and teaching, which should not be under the gospel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Every man his neighbour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " such as are nearer to each other in society or commerce, a fellow citizen; or are near by relation, by nature or alliance, by consanguinity or affinity, one near at hand, ignorant of the Lord; and that needs instruction, one capable and possible to be taught. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Saying, Know the Lord:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this intimates the manner of teaching denied, a formal, customary way of teaching, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saying; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it was proverbial with them; and so was the matter of it: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Know the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as they used to say: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The temple of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Jeremiah 7:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The burden of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Jeremiah 23:34",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The day of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Amos 5:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 5:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": or otherwise, not to teach them to know the Lord notionally only, without any influence on their heart, without believing, loving, fearing, or obeying him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1Jo 2:3,4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Jo 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or to teach them to know the Lord, as redeeming and delivering of them out of Egypt, or out of the land of the north, that is, bringing them back from their captivity in Babylon, as they were taught, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 20:2 Jeremiah 23:7,8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 20:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; but as delivering them from sin, the curse, wrath, and hell. Or, they shall not teach one another so darkly, slenderly, and imperfectly in the meaning of types, shadows, and ceremonies, that they might know the Lord in truth, and worship him according to his mind; or to take so much pains to instruct them concerning the Lord and his worship, as they took with the Gentiles when they proselyted them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For all shall know me, from the least to the greatest; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for under the gospel administration all the covenanted ones, the infant in the church and the aged, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 65:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", all ages in Christ, children, fathers, and young men, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1Jo 2:12-14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Jo 2:12-14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", young and old, shall have his laws put into their mind’s, and written on their hearts, the true saving knowledge of him in Christ in the fulness of it, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 11:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": they shall so perfectly know him, as not to depart from him; he shall be theirs and they his by an everlasting covenant, ordered in all things and sure; by the plentiful effusion of his Spirit in all the gifts and graces of it through his gospel institutions on them; they shall be so enlightened in gospel truths, that they shall know their duties, and perform them, as if they were immediately enlightened from above, rather than by the common methods of teaching by his word; that they shall not need so much cautioning, threatening, correcting as they did under the law; but shall entirely cleave to him, without a disposition to revolt. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall not teach every man his neighbour,.... The Alexandrian copy reads, \"citizen\"; that is, fellow citizen; and so the Syriac and Arabic versions: \"and every man his brother, saying, know the Lord\": this is not to be understood, so as to set aside the external and public ministry of the word, which is a standing ordinance of God under the Gospel dispensation; or even the, private instructions of saints one to another, in Christian conversation, whereby they may build up one another in their most holy faith; but the sense is, that men should not only teach, but the Spirit of God should teach with them, and by them; and it stands opposed to particular and pretended revelations, and especially to magisterial dictates; and denotes the abundance of knowledge that should be in Gospel times, which should not be restrained to particular persons, and sets of men, but should be shared by all believers, more or less: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for all shall know me, from the least to the greatest; from babes to fathers in Christ; not with a natural, but with a spiritual knowledge; not with general knowledge of him, that he is, but with a special knowledge of him, that he is theirs; not with a legal, but with an evangelical knowledge; not with the knowledge of him in, and through the creatures, but in Christ; and that not speculative, but experimental; such as is attended with faith in him, fear of him, love to him, and a cheerful obedience to his will: the knowledge of the Lord, under the New Testament dispensation, is greater than under the former dispensation; the subject matter of it is more distinct; God is more known in the persons of the Father, Son, and Spirit, in the perfections of his nature, in his titles and characters, and in his Son; the manner of it is more clear, open, and perspicuous; the persons to whom it is communicated are more numerous; it is not restrained to Jews, but is given to the Gentiles; and all this owing to a greater effusion of the Spirit; see 1 John 2:27. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for all shall know me, from the least to the greatest; from babes to fathers in Christ; not with a natural, but with a spiritual knowledge; not with general knowledge of him, that he is, but with a special knowledge of him, that he is theirs; not with a legal, but with an evangelical knowledge; not with the knowledge of him in, and through the creatures, but in Christ; and that not speculative, but experimental; such as is attended with faith in him, fear of him, love to him, and a cheerful obedience to his will: the knowledge of the Lord, under the New Testament dispensation, is greater than under the former dispensation; the subject matter of it is more distinct; God is more known in the persons of the Father, Son, and Spirit, in the perfections of his nature, in his titles and characters, and in his Son; the manner of it is more clear, open, and perspicuous; the persons to whom it is communicated are more numerous; it is not restrained to Jews, but is given to the Gentiles; and all this owing to a greater effusion of the Spirit; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 2:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they shall not teach every man his neighbour, and every man his brother, saying, Know the Lord: for all shall know me, from the least to the greatest.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The consequence resulting from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διδόναι νόμους εἰς τὴν διάνοιαν αὐτῶν κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 2:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ οὐ μὴ διδάξωσιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and then they shall not instruct",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Winer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gramm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 7 Aufl. p. 472; Buttmann, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gramm. des neutest. Sprachgebr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 183), as regards the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sense",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " equivalent to: and then it will not be needful that they instruct each other; the reason for which is stated immediately after, in the on ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι πάντες εἰδήσουσίν με κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the intensifying ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐ μή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see Winer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gramm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 7 Aufl. p. 471 f.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν πολίτην αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his fellow-citizen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So in the LXX., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cod. Vatic.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and most MSS., while ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cod. Alex",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". has in the first member ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν ἀδελφόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the second ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν πλησίον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γνῶθι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] in the Hebrew the plural: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "דְּעוּ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μικροῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] With the LXX. in most Codd.: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μικροῦ αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ μικροῦ ἕως μεγάλου αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Young and old (כְמִקְּטַנָם וְעַד־גְּדו̇לָם). Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", al.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his neighbour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. “his fellow-citizen.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for all shall know me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "second",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " promise of the New Covenant is that there shall be no ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "appropriation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of knowledge; no sacerdotal exclusiveness; no learned caste that shall monopolise the keys of knowledge, and lock out those that desire to enter in. “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thy children shall be taught of the Lord” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and all shall be “a chosen generation, a royal priesthood, a holy nation, a peculiar people.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all shall know me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] By virtue of the anointing of the Holy Spirit, which “teacheth us of all things” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 2:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the least to the greatest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] That is, from the eldest to the youngest (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Οὐ μὴ διδάξωσιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they shall not teach",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A Metonymy of the consequent for the antecedent: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " All will be taught by GOD Himself especially the love, which is the sum of the law. The exertions of brethren in teaching are not absolutely denied; for men must first be taught, whilst the covenant itself is being promulgated to them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 3:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : then the instruction of brethren is plainly no longer necessary, at least to those who attain to the very power of the covenant in the remission of sins, and in the knowledge of the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We have no need to write, nor you to he written to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", says ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Paul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There will be a very full accomplishment of these promises when ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that which is perfect",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has come, even eternal life. But on the way to it every man should certainly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "teach and exhort",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " himself and his brother; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In short, even the doctrine, which is either solid meat or milk for the strong and for the weak, both alike being godly, delights the godly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : nay, these very persons now at last, and not till now, fully comprehend ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doctrine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (‘teaching’); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the apostle himself, both here and in the whole of his office, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "teaches",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That precept of highest importance, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Know the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is learned from the Lord. One proclaims to another every doctrine (every kind of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "teaching",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that is agreeable to this one, which stands highest: and admonition has the principal place; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the mean time the doctrine is not difficult and forced, because grace renders all very teachable; for it is no longer the ministry of the letter, but of the spirit; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. Nor does the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "firmness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of believers depend on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "authority",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of human ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "teachers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is also the reason why the scripture of the New Testament is shorter, and why some things are not so clearly decided. GOD Himself teaches His people.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν ἀδελφὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his brother",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This implies a closer relation than a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neighbour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fellow-citizen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[45]–[46] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ μικροῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from a little one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the least",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He that is feeble among them shall be as David",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[45] A citizen, he says: for the reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πολίτην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is preferred to that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πλησίον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the margin of both Ed., and is translated in the Germ. Vers. by the word Mitbürger.—E. B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[46] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εἰδήσουσί με",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they shall know Me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from the utmost experience of My grace; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "ABD(",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Δ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and almost all the oldest authorities, read ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πολίτην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But Vulg. reads, as Rec. Text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πλησίον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—ED.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrews 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "His neighbor (τὸν πολίτην)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit. his citizen: his fellow-citizen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Know the Lord (γνῶθι τὸν κύριον)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As if commending God to the knowledge of one who is ignorant of him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All shall know (πάντες εἰδήσουσιν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Observe the two words for know: γνῶθι of the recognition of a stranger; εἰδήσουσιν of an absolute acquaintance as of one born under God's covenant.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From the least to the greatest (ἀπὸ μικροῦ ἕως μεγάλου αὐτῶν).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit. from the little unto the great of them. This knowledge of God will be without distinction of age or station. ",
        "children": []
      }
    ]
  }
]