[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They go to nothing.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is doubtful whether this applies to the streams or to the caravans. Thus, “The paths of their way are turned aside and come to nought;” or, “The caravans that travel by the way of them turn aside, and go into the waste and perish.” The nineteenth verse seems to suggest the latter as the more probable.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:14-30 In his prosperity Job formed great expectations from his friends, but now was disappointed. This he compares to the failing of brooks in summer. Those who rest their expectations on the creature, will find it fail when it should help them; whereas those who make God their confidence, have help in the time of need, Heb 4:16. Those who make gold their hope, sooner or later will be ashamed of it, and of their confidence in it. It is our wisdom to cease from man. Let us put all our confidence in the Rock of ages, not in broken reeds; in the Fountain of life, not in broken cisterns. The application is very close; for now ye are nothing. It were well for us, if we had always such convictions of the vanity of the creature, as we have had, or shall have, on a sick-bed, a death-bed, or in trouble of conscience. Job upbraids his friends with their hard usage. Though in want, he desired no more from them than a good look and a good word. It often happens that, even when we expect little from man, we have less; but from God, even when we expect much, we have more. Though Job differed from them, yet he was ready to yield as soon as it was made to appear that he was in error. Though Job had been in fault, yet they ought not to have given him such hard usage. His righteousness he holds fast, and will not let it go. He felt that there had not been such iniquity in him as they supposed. But it is best to commit our characters to Him who keeps our souls; in the great day every upright believer shall have praise of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The paths of their way are turned aside - Noyes renders this, \"The caravans turn aside to them on their way.\" Good, \"The outlets of their channel wind about.\" Rosenmuller, \"The bands of travelers direct their journey to them.\" Jerome, \"Involved are the paths of their steps.\" According to the interpretation of Rosenmuller, Noyes, Umbreit, and others, it means that the caravans on their journey turn aside from their regular way in order to find water there; and that in doing it they go up into a desert and perish. According to the other interpretation, it means that the channels of the stream wind along until they diminish and come to nothing. This latter I take to be the true sense of the passage, as it is undoubtedly the most poetical. It is a representation of the stream winding along in its channels, or making new channels as it flows from the mountain, until it diminishes by evaporation, and finally comes to nothing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They go to nothing - Noyes renders this very singularly, \"into the desert,\" - meaning that the caravans, when they suppose they are going to a place of refreshment, actually go to a desert, and thus perish. The word used here, however תהוּ  tôhû, does not occur in the sense of a desert elsewhere in the Scriptures. It denotes nothingness, emptiness, vanity (see Genesis 1:2), and very appropriately expresses the nothingness into which a stream vanishes when it is dried up or lost in the sand. The sense is, that those streams wander along until they become smaller and smaller, and then wholly disappear. They deceive the traveler who hoped to find refreshment there. Streams depending on snows and storms, and having no permanent fountains, cannot be confided in. Pretended friends are like them. In times of prosperity they are full of professions, and their aid is proffered to us. But we go to them when we need their assistance, when we are like the weary and thirsty traveler, and they disappear like deceitful streams in the sands of the desert. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They go to nothing - Noyes renders this very singularly, \"into the desert,\" - meaning that the caravans, when they suppose they are going to a place of refreshment, actually go to a desert, and thus perish. The word used here, however תהוּ  tôhû, does not occur in the sense of a desert elsewhere in the Scriptures. It denotes nothingness, emptiness, vanity (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and very appropriately expresses the nothingness into which a stream vanishes when it is dried up or lost in the sand. The sense is, that those streams wander along until they become smaller and smaller, and then wholly disappear. They deceive the traveler who hoped to find refreshment there. Streams depending on snows and storms, and having no permanent fountains, cannot be confided in. Pretended friends are like them. In times of prosperity they are full of professions, and their aid is proffered to us. But we go to them when we need their assistance, when we are like the weary and thirsty traveler, and they disappear like deceitful streams in the sands of the desert. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. turned aside—rather, \"caravans\" (Hebrew, \"travellers\") turn aside from their way, by circuitous routes, to obtain water. They had seen the brook in spring full of water: and now in the summer heat, on their weary journey, they turn off their road by a devious route to reach the living waters, which they remembered with such pleasure. But, when \"they go,\" it is \"into a desert\" [Noyes and Umbreit]. Not as English Version, \"They go to nothing,\" which would be a tame repetition of the drying up of the waters in Job 6:17; instead of waters, they find an \"empty wilderness\"; and, not having strength to regain their road, bitterly disappointed, they \"perish.\" The terse brevity is most expressive.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " i.e. The course of those waters is changed, they are gone out of their channel, flowing hither and thither, till they be quite consumed; as it here follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The paths of their way are turned aside,.... That is, the waters, when melted by the heat of the sun, and the warmth of the weather, run, some one way, and some another in little streams and windings, till they are quite lost and the tracks of them are no more to be seen; denoting that all appearance of friendship was quite gone, and no traces of it to be found: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they go to nothing, and perish: some of them are lost in little meanders and windings about, and others are exhaled by the heat of the sun, and go into \"Tohu\", as the word is, into empty air; so vain and empty, and perishing, were all the comforts he hoped for from his friends; though some understand this of the paths of travellers in the deserts being covered in the sand, and not to be seen and found; of which see Pliny (z). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Nat. Hist. l. 6. c. 29. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Nat. Hist. l. 6. c. 29. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The paths of their way are turned aside; they go to nothing, and perish.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they go to nothing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "they go up into the waste",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The expression ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "go up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Heb. is used when no ascent in the strict sense is meant; it signifies to go inland, into the interior of a region. The streams of these brooks flow out and wind into the desert and are consumed by the heat or lost in the sand. A somewhat different sense is drawn from the words by many writers. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "paths, Job 6:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "paths, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is the same as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "troops",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or caravans, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 6:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and they assume that the reference to the caravans is already made in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 6:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", rendering: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the caravans that go by the way of them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the streams) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "turn aside, they go up into the desert and perish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In favour of this interpretation it is urged that there is something unnatural in the use of the same word in different senses in two consecutive verses; and that it is customary in the Poets to express a general idea first (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 6:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") and then to particularize and exemplify it (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 6:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). On the other hand Ibn Ezra has already remarked that it is not usual for caravans to leave the route and “turn aside” in search of water, a route is selected and formed rather because water is found on it. The danger of the caravan is that it be exhausted before it reach the place where water is known to be, or, as here, that the water may be found dried up.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The paths of their way are turned aside",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, as in the Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the caravans that travel by the way of them turn aside.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It seems impossible that the streams can be intended, since their paths are never \"turned aside\" - they simply shrink, fail, and dry up. But nothing is commoner than for caravans short of water to go out of their way in order to reach a wady, where they expect to be able to replenish their water-skins. If they are disappointed, if the wady is dry, they may be brought into great straits, and may even possibly perish. (For a probable instance, where dependence on a wady would, but for a miracle, have led to a great disaster, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 3:9-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They go to nothing, and perish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "they go up into the waste",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and perish.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Having vainly sought water in the dry wady, they ascend out of it, and enter the broad waste of the desert, where they too often miserably perish. Job 6:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18  The paths of their course are turned about,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They go up in the waste and perish.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19  The travelling bands of Tma looked for them,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The caravans of Saba hoped for them;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20  They were disappointed on account of their trust,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They came thus far, and were red with shame.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the text is pointed, ארחות, Job 6:18, are the paths of the torrents. Hitz., Ew., and Schlottm., however, correct ארחות, caravans, which Hahn even thinks may be understood without correction, since he translates: the caravans of their way are turned about (which is intended to mean: aside from the way that they are pursuing), march into the desert and perish (i.e., because the streams on which they reckoned are dried up). So, in reality, all modern commentators understand it; but is it likely that the poet would let the caravans perish in Job 6:18, and in Job 6:19. still live? With this explanation, Job 6:19. drag along tautologically, and the feebler figure follows the stronger. Therefore we explain as follows: the mountain streams, נחלים, flow off in shallow serpentine brooks, and the shallow waters completely evaporate by the heat of the sun. בתּהוּ עלה signifies to go up into nothing (comp. Isaiah 40:23), after the analogy of בעשׁן כּלה, to pass away in smoke. Thus e.g., also Mercier: in auras abeunt, in nihilum rediguntur. What next happens is related as a history, Job 6:19., hence the praett. Job compares his friends to the wady swollen by ice and snow water, and even to the travelling bands themselves languishing for water. He thirsts for friendly solace, but the seeming comfort which his friends utter is only as the scattered meandering waters in which the mountain brook leaks out. The sing. בּטח individualizes; it is unnecessary with Olsh. to read בּטחוּ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As the text is pointed, ארחות, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are the paths of the torrents. Hitz., Ew., and Schlottm., however, correct ארחות, caravans, which Hahn even thinks may be understood without correction, since he translates: the caravans of their way are turned about (which is intended to mean: aside from the way that they are pursuing), march into the desert and perish (i.e., because the streams on which they reckoned are dried up). So, in reality, all modern commentators understand it; but is it likely that the poet would let the caravans perish in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". still live? With this explanation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". drag along tautologically, and the feebler figure follows the stronger. Therefore we explain as follows: the mountain streams, נחלים, flow off in shallow serpentine brooks, and the shallow waters completely evaporate by the heat of the sun. בתּהוּ עלה signifies to go up into nothing (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), after the analogy of בעשׁן כּלה, to pass away in smoke. Thus e.g., also Mercier: in auras abeunt, in nihilum rediguntur. What next happens is related as a history, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., hence the praett. Job compares his friends to the wady swollen by ice and snow water, and even to the travelling bands themselves languishing for water. He thirsts for friendly solace, but the seeming comfort which his friends utter is only as the scattered meandering waters in which the mountain brook leaks out. The sing. בּטח individualizes; it is unnecessary with Olsh. to read בּטחוּ. ",
            "children": []
          }
        ]
      }
    ]
  }
]