[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 6:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Can that which is unsavoury — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that which is insipid, be eaten without salt? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Is it not requisite that every thing insipid should be seasoned, to give it a relish, and make it agreeable? Therefore life itself, when it has lost those comforts, which are the seasoning to it, and give it its relish, then becomes insipid, so that it is nothing more than a burden. Now, if men commonly complain of their meat when it is only unsavoury, how much more when it is so bitter as mine is? Some commentators, however, consider Job here as referring to Eliphaz’s discourse, which had been insipid and disagreeable to him, as having no substance, and carrying no weight with it: like unsavoury food, not seasoned nor cured, instead of satisfying and instructing him, it had been nauseous and offensive, like corrupted meat to a weak and sick stomach. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Or is there any taste in the white of an egg? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“Our version of this clause,” says Dr. Dodd, “seems to be void of all sense and connection with what goes before. Mr. Mudge supposes Job to allude, in the original words, to those medicinal potions, which were administered by way of alterative; and, agreeably to his criticism, the clause should be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is there any relish in the nauseous medicinal draught?”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-7 Job still justifies himself in his complaints. In addition to outward troubles, the inward sense of God's wrath took away all his courage and resolution. The feeling sense of the wrath of God is harder to bear than any outward afflictions. What then did the Saviour endure in the garden and on the cross, when he bare our sins, and his soul was made a sacrifice to Divine justice for us! Whatever burden of affliction, in body or estate, God is pleased to lay upon us, we may well submit to it as long as he continues to us the use of our reason, and the peace of our conscience; but if either of these is disturbed, our case is very pitiable. Job reflects upon his friends for their censures. He complains he had nothing offered for his relief, but what was in itself tasteless, loathsome, and burdensome.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Can that which is unsavoury - Which is insipid, or without taste.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Be eaten without salt - It is necessary to add salt in order to make it either palatable or wholesome. The literal truth of this no one can doubt, Insipid food cannot be relished, nor would it long sustain life. \"The Orientals eat their bread often with mere salt, without any other addition except some dry and pounded summer-savory, which last is the common method at Aleppo.\" Russell's Natural History of Aleppo, p. 27. It should be remembered, also, that the bread of the Orientals is commonly mere unleavened cakes; see Rosenmuller, Alte u. neue Morgenland, on Genesis 18:6. The idea of Job in this adage or proverb is, that there was a fitness and propriety in things. Certain things went together, and were necessary companions. One cannot be expected without the other; one is incomplete without the other. Insipid food requires salt in order to make it palatable and nutritious, and so it is proper that suffering and lamentation should be united.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Be eaten without salt - It is necessary to add salt in order to make it either palatable or wholesome. The literal truth of this no one can doubt, Insipid food cannot be relished, nor would it long sustain life. \"The Orientals eat their bread often with mere salt, without any other addition except some dry and pounded summer-savory, which last is the common method at Aleppo.\" Russell's Natural History of Aleppo, p. 27. It should be remembered, also, that the bread of the Orientals is commonly mere unleavened cakes; see Rosenmuller, Alte u. neue Morgenland, on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The idea of Job in this adage or proverb is, that there was a fitness and propriety in things. Certain things went together, and were necessary companions. One cannot be expected without the other; one is incomplete without the other. Insipid food requires salt in order to make it palatable and nutritious, and so it is proper that suffering and lamentation should be united.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There was a reason for his complaints, as there was for adding salt to unsavory food. Much perplexity, however, has been felt in regard to this whole passage; Job 6:6-7. Some have supposed that Job means to rebuke Eliphaz severely for his harangue on the necessity of patience, which he characterizes as insipid, impertinent, and disgusting to him; as being in fact as unpleasant to his soul as the white of an egg was to the taste. Dr. Good explains it as meaning, \"Doth that which has nothing of seasoning, nothing of a pungent or irritating power within it, produce pungency or irritation? I too should be quiet and complain not, if I had nothing provocative or acrimonious; but alas! the food I am doomed to partake of is the very calamity which is most acute to my soul, that which I most loathe, and which is most grievous or trying to my palate.\" But the real sense of this first part of the verse is, I think, that which is expressed above - that insipid food requires proper condiment, and that in his sufferings there was a real ground for lamentation and complaint - as there was for making use of salt in that which is unsavory. I see no reason to think that he meant in this to reproach Eliphaz for an insipid and unmeaning address.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There was a reason for his complaints, as there was for adding salt to unsavory food. Much perplexity, however, has been felt in regard to this whole passage; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Some have supposed that Job means to rebuke Eliphaz severely for his harangue on the necessity of patience, which he characterizes as insipid, impertinent, and disgusting to him; as being in fact as unpleasant to his soul as the white of an egg was to the taste. Dr. Good explains it as meaning, \"Doth that which has nothing of seasoning, nothing of a pungent or irritating power within it, produce pungency or irritation? I too should be quiet and complain not, if I had nothing provocative or acrimonious; but alas! the food I am doomed to partake of is the very calamity which is most acute to my soul, that which I most loathe, and which is most grievous or trying to my palate.\" But the real sense of this first part of the verse is, I think, that which is expressed above - that insipid food requires proper condiment, and that in his sufferings there was a real ground for lamentation and complaint - as there was for making use of salt in that which is unsavory. I see no reason to think that he meant in this to reproach Eliphaz for an insipid and unmeaning address.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Or is there any taste in the white of an egg? - Critics and commentators have been greatly divided about the meaning of this. The Septuagint renders it, εἰ δέ καί ἐστί γεῦμα ἐν ῥήμασι κενοῖς  ei de kai esti geuma en rēmasi kenois; is there any taste in vain words? Jerome (Vulgate), \"can anyone taste that which being tasted produces death?\" The Targums render it substantially as it is in our version. The Hebrew word rendered \"white\" (ריר  rı̂yr) means properly spittle; 1 Samuel 21:13. If applied to an egg, it means the white of it, as resembling spittle. The word rendered \"egg\" (חלמוּת  challâmûth) occurs nowhere else in the Scriptures. If it be regarded as derived from חלם  châlam, to sleep, or dream, it may denote somnolency or dreams, and then fatuity, folly, or a foolish speech, as resembling dreams; and many have supposed that Job meant to characterize the speech of Eliphaz as of this description.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Or is there any taste in the white of an egg? - Critics and commentators have been greatly divided about the meaning of this. The Septuagint renders it, εἰ δέ καί ἐστί γεῦμα ἐν ῥήμασι κενοῖς  ei de kai esti geuma en rēmasi kenois; is there any taste in vain words? Jerome (Vulgate), \"can anyone taste that which being tasted produces death?\" The Targums render it substantially as it is in our version. The Hebrew word rendered \"white\" (ריר  rı̂yr) means properly spittle; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 21:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". If applied to an egg, it means the white of it, as resembling spittle. The word rendered \"egg\" (חלמוּת  challâmûth) occurs nowhere else in the Scriptures. If it be regarded as derived from חלם  châlam, to sleep, or dream, it may denote somnolency or dreams, and then fatuity, folly, or a foolish speech, as resembling dreams; and many have supposed that Job meant to characterize the speech of Eliphaz as of this description.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The word may mean, as it does in Syriac, a species of herb, the \"purslain\" (Gesenius), proverbial for its insipidity among the Arabs, Greeks, and Romans, but which was used as a salad; and the whole phrase here may denote purslain-broth, and hence, an insipid discourse. This is the interpretation of Gesenius. But the more common and more probable explanation is that of our common version, denoting the white of an egg. But what is the point of the remark as Job uses it? That it is a proverbial expression, is apparent; but in what way Job meant to apply it, is not so clear. The Jews say that he meant to apply it to the speech of Eliphaz as being insipid and dull, without anything to penetrate the heart or to enliven the fancy; a speech as disagreeable to the mind as the white of an egg was insipid to the taste. Rosenmuller supposes that he refers to his afflictions as being as unpleasant to bear as the white of an egg was to the taste. It seems to me that the sense of all the proverbs used here is about the same, and that they mean, \"there is a reason for everything which occurs. The ass brays and the ox lows only when destitute of food. That which is insipid is unpleasant, and the white of an egg is loathsome. So with my afflictions. They produce loathing and disgust, My very food Job 6:7 is disagreeable, and everything seems tasteless as the most insipid food would. Hence the language which I have used - language spoken not without reason, and expressive of this state of the soul.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The word may mean, as it does in Syriac, a species of herb, the \"purslain\" (Gesenius), proverbial for its insipidity among the Arabs, Greeks, and Romans, but which was used as a salad; and the whole phrase here may denote purslain-broth, and hence, an insipid discourse. This is the interpretation of Gesenius. But the more common and more probable explanation is that of our common version, denoting the white of an egg. But what is the point of the remark as Job uses it? That it is a proverbial expression, is apparent; but in what way Job meant to apply it, is not so clear. The Jews say that he meant to apply it to the speech of Eliphaz as being insipid and dull, without anything to penetrate the heart or to enliven the fancy; a speech as disagreeable to the mind as the white of an egg was insipid to the taste. Rosenmuller supposes that he refers to his afflictions as being as unpleasant to bear as the white of an egg was to the taste. It seems to me that the sense of all the proverbs used here is about the same, and that they mean, \"there is a reason for everything which occurs. The ass brays and the ox lows only when destitute of food. That which is insipid is unpleasant, and the white of an egg is loathsome. So with my afflictions. They produce loathing and disgust, My very food ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is disagreeable, and everything seems tasteless as the most insipid food would. Hence the language which I have used - language spoken not without reason, and expressive of this state of the soul.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. unsavoury—tasteless, insipid. Salt is a chief necessary of life to an Easterner, whose food is mostly vegetable.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the white—literally, \"spittle\" (1Sa 21:13), which the white of an egg resembles.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Can or do men use to eat unsavoury meats with delight, or without complaint? This is either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. A reflection upon Eliphaz’s discourse, as unsavoury, which could not give him any conviction or satisfaction. But his censure of Eliphaz’s speech begins not till ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 6:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and then it proceeds. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. A justification of Job’s complaints (of which both the foregoing and following verses treat) by another argument. Men do commonly complain of their meat when it is but unsavoury, how much more when it is so bitter as mine is! which is implied here, and expressed in the next verse; where the sense here begun is completed, and this general proposition is accommodated to Job’s condition. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the white of an egg, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the white of a yolk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. which encompasseth the yolk of an egg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Can that which is unsavoury be eaten without salt?.... As any sort of pulse, peas, beans, lentiles, &c. which have no savoury and agreeable taste unless salted, and so many other things; and are disagreeable to men, and not relished by them, and more especially things bitter and unpleasant; and therefore Job intimates, it need not seem strange that the wormwood and water of gall, or the bread of adversity and water of affliction, he was fed with, should be so distasteful to him, and he should show such a nausea of it, and an aversion to it, and complain thereof as he did: though some apply this to the words and speeches of Eliphaz, and his friends he represented, which with Job were insipid and foolish talk, and very unsuitable and disagreeable to him, yea, loathed and abhorred by him, not being seasoned with the salt of prudence, grace, and goodness, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or is there any taste in the white of an egg? none at all. The same things are designed by this as the former. Mr. Broughton renders it, \"the white of the yolk\"; and Kimchi says (d) it signifies, in the language of the Rabbins, the red part of the yolk, the innermost part; but others, from the use of the word in the Arabic language, interpret it of the froth of milk (e), which is very tasteless and insipid: but the first of the words we render \"white\" always signifies \"spittle\"; and some of the Jewish writers (f) call it the spittle of soundness, or a sound man, which has no taste, in distinction from that of a sick man, which has; and the latter word comes from one which signifies to dream; and Jarchi observes, that some so understand it here; and the whole is by some rendered, \"is there any taste\" or \"savour in the spittle of a dream\" or \"drowsiness\" (g)? such as flows from a person asleep, or in a dream; and so may fitly express the vain and empty words, as the Septuagint translate the phrase, of Job's friends, in his esteem, which to him were no than the words of some idle and dreaming person, or were like the dribble of a fool or madman, as David mimicked, 1 Samuel 21:13; and it is observed (h), that the word \"spittle\" is very emphatically used, since it useless in judging of different tastes, and mixed with food, goes into nourishment, as the white of an egg. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or is there any taste in the white of an egg? none at all. The same things are designed by this as the former. Mr. Broughton renders it, \"the white of the yolk\"; and Kimchi says (d) it signifies, in the language of the Rabbins, the red part of the yolk, the innermost part; but others, from the use of the word in the Arabic language, interpret it of the froth of milk (e), which is very tasteless and insipid: but the first of the words we render \"white\" always signifies \"spittle\"; and some of the Jewish writers (f) call it the spittle of soundness, or a sound man, which has no taste, in distinction from that of a sick man, which has; and the latter word comes from one which signifies to dream; and Jarchi observes, that some so understand it here; and the whole is by some rendered, \"is there any taste\" or \"savour in the spittle of a dream\" or \"drowsiness\" (g)? such as flows from a person asleep, or in a dream; and so may fitly express the vain and empty words, as the Septuagint translate the phrase, of Job's friends, in his esteem, which to him were no than the words of some idle and dreaming person, or were like the dribble of a fool or madman, as David mimicked, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 21:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it is observed (h), that the word \"spittle\" is very emphatically used, since it useless in judging of different tastes, and mixed with food, goes into nourishment, as the white of an egg. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Sepher Shorash, rad.  so Ben Melech. (e) Hottinger. Smegma Oriental. l. 1. c. 7. p. 152. Hinckeman. Praefat. ad Alcoran. p. 29. (f) R. Issac in Kimchi ibid. Ben Melech & Ben Gersom in loc; so some in Bar Tzemach; \"saliva sanitatis\", Gussetius, p. 260. (g)  \"in saliva somnolentiae\", Schultens. (h) Scheuchzer. Physic. Sacr. vol. 4. p. 670. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Sepher Shorash, rad.  so Ben Melech. (e) Hottinger. Smegma Oriental. l. 1. c. 7. p. 152. Hinckeman. Praefat. ad Alcoran. p. 29. (f) R. Issac in Kimchi ibid. Ben Melech & Ben Gersom in loc; so some in Bar Tzemach; \"saliva sanitatis\", Gussetius, p. 260. (g)  \"in saliva somnolentiae\", Schultens. (h) Scheuchzer. Physic. Sacr. vol. 4. p. 670. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Can that which is {e} unsavoury be eaten without salt? or is there any taste in the white of an egg?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Can that which is ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " unsavoury be eaten without salt? or is there ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "any",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " taste in the white of an egg?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Can a man's taste delight in that, which has no savour? meaning that no one takes pleasure in affliction seeing they cannot do away with things that are unsavoury to the mouth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Can that which is unsavoury be eaten without salt?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that which is insipid.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Many critics suppose that in this and the following verse Job reproaches Eliphaz with the insipidity of his remarks, and declares that his soul refuses to touch such loathsome food. Others regard him as still speaking in his own defence, and justifying his expressions of disgust by the nauseous character of the food which had been put before him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the treatment which he has received. Either explanation produces good sense; but perhaps the former is the more natural",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": ". Or is there any taste in the white of an egg?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So our Revisers; and so Dillmann and Canon Cook. Professor Lee suggests \"the whey of cheese\" for \"the white of an egg;\" others, \"the juice of purslaine.\" We have certainly no other evidence that eggs were eaten in primitive times. Job 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  5  Doth the wild ass bray at fresh grass?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or loweth an ox over good fodder?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  6  Is that which is tasteless eaten unsalted?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or is there flavour in the white of an egg?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  7  That which my soul refused to touch,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The same is as my loathsome food.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The meaning of the first two figures is: He would not complain, if there were really no cause for it; of the two others: It is not to be expected that he should smile at his suffering, and enjoy it as delicate food. על־בּלילו I have translated \"over good fodder,\" for בּליל is mixed fodder of different kinds of grain, farrago. \"Without salt\" is virtually adjective to תּפל, insipid, tasteless. What is without salt one does not relish, and there is no flavour in the slime of the yolk of an egg, i.e., the white of an egg (Targ.), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Saadia compares b. Aboda zara, 40, a, where it is given as a mark of the purity of the eggs in the roe of fish: מבפנים וחלמון מב מבחוץ חלבון, when the white is outside and the yellow within.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or in the slime of purslain (according to Chalmetho in the Peschito, Arab. ḥamqâ), fatua  equals  purslain), which is less probable on account of ריר (slime, not: broth): there is no flavour so that it can be enjoyed. Thus is it with his sufferings. Those things which he before inwardly detested (dirt and dust of leprosy) are now sicut fastidiosa cibi mei, i.e., as loathsome food which he must eat. The first clause, Job 6:7, must be taken as an elliptic relative clause forming the subject: vid., Ges. 123, 3, c. Such disagreeable counsel is now like his unclean, disgusting diet. Eliphaz desires him to take them as agreeable. דּוי in כּדרי is taken by Ges. Ew., Hahn, Schlottm., Olsh. (165, b), as constr. from דּוי, sickness, filth; but דּוי, as plur. from דּוה, sick, unclean (especially of female menstruation, Isaiah 30:22), as Heiligst. among modern commentators explains it, is far more suitable. Hitz. (as anonym. reviewer of Ewald's Job in the liter. Centralblatt) translates: they (my sufferings) are the morsels of my food; but the explanation of המּה is not correct, nor is it necessary to go to the Arabic for an explanation of כּדרי. It is also unnecessary, with Bttcher, to read כּדוי (such is my food in accordance with my disease); Job does not here speak of his diet as an invalid. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or in the slime of purslain (according to Chalmetho in the Peschito, Arab. ḥamqâ), fatua  equals  purslain), which is less probable on account of ריר (slime, not: broth): there is no flavour so that it can be enjoyed. Thus is it with his sufferings. Those things which he before inwardly detested (dirt and dust of leprosy) are now sicut fastidiosa cibi mei, i.e., as loathsome food which he must eat. The first clause, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", must be taken as an elliptic relative clause forming the subject: vid., Ges. 123, 3, c. Such disagreeable counsel is now like his unclean, disgusting diet. Eliphaz desires him to take them as agreeable. דּוי in כּדרי is taken by Ges. Ew., Hahn, Schlottm., Olsh. (165, b), as constr. from דּוי, sickness, filth; but דּוי, as plur. from דּוה, sick, unclean (especially of female menstruation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as Heiligst. among modern commentators explains it, is far more suitable. Hitz. (as anonym. reviewer of Ewald's Job in the liter. Centralblatt) translates: they (my sufferings) are the morsels of my food; but the explanation of המּה is not correct, nor is it necessary to go to the Arabic for an explanation of כּדרי. It is also unnecessary, with Bttcher, to read כּדוי (such is my food in accordance with my disease); Job does not here speak of his diet as an invalid. ",
            "children": []
          }
        ]
      }
    ]
  }
]