[{"header":"Judas Hangs Himself"},{"num":27,"verse":"It was early in the morning. All the chief priests and the elders of the people planned how to put Jesus to death. "},{"num":2,"verse":"So they tied him up and led him away. Then they handed him over to Pilate, who was the governor."},{"num":3,"verse":"Judas, who had handed him over, saw that Jesus had been sentenced to die. He felt deep shame and sadness for what he had done. So he returned the 30 silver coins to the chief priests and the elders. "},{"num":4,"verse":"“I have sinned,” he said. “I handed over a man who is not guilty.”"},{"num":5,"verse":"So Judas threw the money into the temple and left. Then he went away and hanged himself."},{"num":6,"verse":"The chief priests picked up the coins. They said, “It’s against the law to put this money into the temple fund. It is blood money. It has paid for a man’s death.” "},{"num":7,"verse":"So they decided to use the money to buy a potter’s field. People from other countries would be buried there. "},{"num":8,"verse":"That is why it has been called the Field of Blood to this day. "},{"num":9,"verse":"Then the words spoken by Jeremiah the prophet came true. He had said, “They took the 30 silver coins. That price was set for him by the people of Israel. "},{"num":10,"verse":"They used the coins to buy a potter’s field, just as the Lord commanded me.” (Zechariah 11:12,13; Jeremiah 19:1–13; 32:6–9)"},{"header":"Jesus Is Brought to Pilate"},{"num":11,"verse":"Jesus was standing in front of the governor. The governor asked him, “Are you the king of the Jews?”"},{"num":12,"verse":"But when the chief priests and the elders brought charges against him, he did not answer. "},{"num":13,"verse":"Then Pilate asked him, “Don’t you hear the charges they are bringing against you?” "},{"num":14,"verse":"But Jesus made no reply, not even to a single charge. The governor was really amazed."},{"num":15,"verse":"It was the governor’s practice at the Passover Feast to let one prisoner go free. The people could choose the one they wanted. "},{"num":16,"verse":"At that time they had a well-known prisoner named Jesus Barabbas. "},{"num":17,"verse":"So when the crowd gathered, Pilate asked them, “Which one do you want me to set free? Jesus Barabbas? Or Jesus who is called the Messiah?” "},{"num":18,"verse":"Pilate knew that the leaders wanted to get their own way. He knew this was why they had handed Jesus over to him."},{"num":19,"verse":"While Pilate was sitting on the judge’s seat, his wife sent him a message. It said, “Don’t have anything to do with that man. He is not guilty. I have suffered a great deal in a dream today because of him.”"},{"num":20,"verse":"But the chief priests and the elders talked the crowd into asking for Barabbas and having Jesus put to death."},{"num":21,"verse":"“Which of the two do you want me to set free?” asked the governor."},{"num":22,"verse":"“Then what should I do with Jesus who is called the Messiah?” Pilate asked."},{"num":23,"verse":"“Why? What wrong has he done?” asked Pilate."},{"num":24,"verse":"Pilate saw that he wasn’t getting anywhere. Instead, the crowd was starting to get angry. So he took water and washed his hands in front of them. “I am not guilty of this man’s death,” he said. “You are accountable for that!”"},{"num":25,"verse":"All the people answered, “Put the blame for his death on us and our children!”"},{"num":26,"verse":"Pilate let Barabbas go free. But he had Jesus whipped. Then he handed him over to be nailed to a cross."},{"header":"The Soldiers Make Fun of Jesus"},{"num":27,"verse":"The governor’s soldiers took Jesus into the palace, which was called the Praetorium. All the rest of the soldiers gathered around him. "},{"num":28,"verse":"They took off his clothes and put a purple robe on him. "},{"num":29,"verse":"Then they twisted thorns together to make a crown. They placed it on his head. They put a stick in his right hand. Then they fell on their knees in front of him and made fun of him. “We honor you, king of the Jews!” they said. "},{"num":30,"verse":"They spit on him. They hit him on the head with the stick again and again. "},{"num":31,"verse":"After they had made fun of him, they took off the robe. They put his own clothes back on him. Then they led him away to nail him to a cross."},{"header":"Jesus Is Nailed to a Cross"},{"num":32,"verse":"On their way out of the city, they met a man from Cyrene. His name was Simon. They forced him to carry the cross. "},{"num":33,"verse":"They came to a place called Golgotha. The word Golgotha means the Place of the Skull. "},{"num":34,"verse":"There they mixed wine with bitter spices and gave it to Jesus to drink. After tasting it, he refused to drink it. "},{"num":35,"verse":"When they had nailed him to the cross, they divided up his clothes by casting lots. "},{"num":36,"verse":"They sat down and kept watch over him there. "},{"num":37,"verse":"Above his head they placed the written charge against him. It read,"},{"num":38,"verse":"Two rebels against Rome were crucified with him. One was on his right and one was on his left. "},{"num":39,"verse":"Those who passed by shouted at Jesus and made fun of him. They shook their heads "},{"num":40,"verse":"and said, “So you are going to destroy the temple and build it again in three days? Then save yourself! Come down from the cross, if you are the Son of God!” "},{"num":41,"verse":"In the same way the chief priests, the teachers of the law and the elders made fun of him. "},{"num":42,"verse":"“He saved others,” they said. “But he can’t save himself! He’s the king of Israel! Let him come down now from the cross! Then we will believe in him. "},{"num":43,"verse":"He trusts in God. Let God rescue him now if he wants him. He’s the one who said, ‘I am the Son of God.’ ” "},{"num":44,"verse":"In the same way the rebels who were being crucified with Jesus also made fun of him."},{"header":"Jesus Dies"},{"num":45,"verse":"From noon until three o’clock, the whole land was covered with darkness. "},{"num":46,"verse":"About three o’clock, Jesus cried out in a loud voice. He said, “Eli, Eli, lema sabachthani?” This means “My God, my God, why have you deserted me?” (Psalm 22:1)"},{"num":47,"verse":"Some of those standing there heard Jesus cry out. They said, “He’s calling for Elijah.”"},{"num":48,"verse":"Right away one of them ran and got a sponge. He filled it with wine vinegar and put it on a stick. He offered it to Jesus to drink. "},{"num":49,"verse":"The rest said, “Leave him alone. Let’s see if Elijah comes to save him.”"},{"num":50,"verse":"After Jesus cried out again in a loud voice, he died."},{"num":51,"verse":"At that moment the temple curtain was torn in two from top to bottom. The earth shook. The rocks split. "},{"num":52,"verse":"Tombs broke open. The bodies of many holy people who had died were raised to life. "},{"num":53,"verse":"They came out of the tombs. After Jesus was raised from the dead, they went into the holy city. There they appeared to many people."},{"num":54,"verse":"The Roman commander and those guarding Jesus saw the earthquake and all that had happened. They were terrified. They exclaimed, “He was surely the Son of God!”"},{"num":55,"verse":"Not very far away, many women were watching. They had followed Jesus from Galilee to take care of his needs. "},{"num":56,"verse":"Mary Magdalene was among them. Mary, the mother of James and Joseph, was also there. So was the mother of Zebedee’s sons."},{"header":"Jesus Is Buried"},{"num":57,"verse":"As evening approached, a rich man came from the town of Arimathea. His name was Joseph. He had become a follower of Jesus. "},{"num":58,"verse":"He went to Pilate and asked for Jesus’ body. Pilate ordered that it be given to him. "},{"num":59,"verse":"Joseph took the body and wrapped it in a clean linen cloth. "},{"num":60,"verse":"He placed it in his own new tomb that he had cut out of the rock. He rolled a big stone in front of the entrance to the tomb. Then he went away. "},{"num":61,"verse":"Mary Magdalene and the other Mary were sitting there across from the tomb."},{"header":"The Guards at the Tomb"},{"num":62,"verse":"The next day was the day after Preparation Day. The chief priests and the Pharisees went to Pilate. "},{"num":63,"verse":"“Sir,” they said, “we remember something that liar said while he was still alive. He claimed, ‘After three days I will rise again.’ "},{"num":64,"verse":"So give the order to make the tomb secure until the third day. If you don’t, his disciples might come and steal the body. Then they will tell the people that Jesus has been raised from the dead. This last lie will be worse than the first.”"},{"num":65,"verse":"“Take some guards with you,” Pilate answered. “Go. Make the tomb as secure as you can.” "},{"num":66,"verse":"So they went and made the tomb secure. They put a royal seal on the stone and placed some guards on duty."}]