[[],[{"type":"prose","content":"And morning having come, all the chief priests and the elders of the people took counsel against Jesus, so as to put him to death;"}],[{"type":"prose","content":"and having bound him, they did lead away, and delivered him up to Pontius Pilate, the governor."}],[{"type":"prose","content":"Then Judas -- he who delivered him up -- having seen that he was condemned, having repented, brought back the thirty silverlings to the chief priests, and to the elders, saying,"}],[{"type":"prose","content":"`I did sin, having delivered up innocent blood;' and they said, `What -- to us? thou shalt see!'"}],[{"type":"prose","content":"and having cast down the silverlings in the sanctuary, he departed, and having gone away, he did strangle himself."}],[{"type":"prose","content":"And the chief priests having taken the silverlings, said, `It is not lawful to put them to the treasury, seeing it is the price of blood;'"}],[{"type":"prose","content":"and having taken counsel, they bought with them the field of the potter, for the burial of strangers;"}],[{"type":"prose","content":"therefore was that field called, `Field of blood,' unto this day."}],[{"type":"prose","content":"Then was fulfilled that spoken through Jeremiah the prophet, saying, `And I took the thirty silverlings, the price of him who hath been priced, whom they of the sons of Israel did price,"}],[{"type":"prose","content":"and gave them for the field of the potter, as the Lord did appoint to me.'"}],[{"type":"prose","content":"And Jesus stood before the governor, and the governor did question him, saying, `Art thou the king of the Jews!' And Jesus said to him, `Thou sayest.'"}],[{"type":"prose","content":"And in his being accused by the chief priests and the elders, he did not answer any thing,"}],[{"type":"prose","content":"then saith Pilate to him, `Dost thou not hear how many things they witness against thee?'"}],[{"type":"prose","content":"And he did not answer him, not even to one word, so that the governor did wonder greatly."}],[{"type":"prose","content":"And at the feast the governor had been accustomed to release one to the multitude, a prisoner, whom they willed,"}],[{"type":"prose","content":"and they had then a noted prisoner, called Barabbas,"}],[{"type":"prose","content":"they therefore having been gathered together, Pilate said to them, `Whom will ye I shall release to you? Barabbas or Jesus who is called Christ?'"}],[{"type":"prose","content":"for he had known that because of envy they had delivered him up."}],[{"type":"prose","content":"And as he is sitting on the tribunal, his wife sent unto him, saying, `Nothing -- to thee and to that righteous one, for many things did I suffer to-day in a dream because of him.'"}],[{"type":"prose","content":"And the chief priests and the elders did persuade the multitudes that they might ask for themselves Barabbas, and might destroy Jesus;"}],[{"type":"prose","content":"and the governor answering said to them, `Which of the two will ye [that] I shall release to you?' And they said, `Barabbas.'"}],[{"type":"prose","content":"Pilate saith to them, `What then shall I do with Jesus who is called Christ?' They all say to him, `Let be crucified!'"}],[{"type":"prose","content":"And the governor said, `Why, what evil did he?' and they were crying out the more, saying, `Let be crucified.'"}],[{"type":"prose","content":"And Pilate having seen that it profiteth nothing, but rather a tumult is made, having taken water, he did wash the hands before the multitude, saying, `I am innocent from the blood of this righteous one; ye -- ye shall see;'"}],[{"type":"prose","content":"and all the people answering said, `His blood [is] upon us, and upon our children!'"}],[{"type":"prose","content":"Then did he release to them Barabbas, and having scourged Jesus, he delivered [him] up that he may be crucified;"}],[{"type":"prose","content":"then the soldiers of the governor having taken Jesus to the Praetorium, did gather to him all the band;"}],[{"type":"prose","content":"and having unclothed him, they put around him a crimson cloak,"}],[{"type":"prose","content":"and having plaited him a crown out of thorns they put [it] on his head, and a reed in his right hand, and having kneeled before him, they were mocking him, saying, `Hail, the king of the Jews.'"}],[{"type":"prose","content":"And having spit on him, they took the reed, and were smiting on his head;"}],[{"type":"prose","content":"and when they had mocked him, they took off from him the cloak, and put on him his own garments, and led him away to crucify [him]."}],[{"type":"prose","content":"And coming forth, they found a man, a Cyrenian, by name Simon: him they impressed that he might bear his cross;"}],[{"type":"prose","content":"and having come to a place called Golgotha, that is called Place of a Skull,"}],[{"type":"prose","content":"they gave him to drink vinegar mixed with gall, and having tasted, he would not drink."}],[{"type":"prose","content":"And having crucified him, they divided his garments, casting a lot, that it might be fulfilled that was spoken by the prophet, `They divided my garments to themselves, and over my vesture they cast a lot;'"}],[{"type":"prose","content":"and sitting down, they were watching him there,"}],[{"type":"prose","content":"and they put up over his head, his accusation written, `This is Jesus, the king of the Jews.'"}],[{"type":"prose","content":"Then crucified with him are two robbers, one on the right hand, and one on the left,"}],[{"type":"prose","content":"and those passing by were speaking evil of him, wagging their heads,"}],[{"type":"prose","content":"and saying, `Thou that art throwing down the sanctuary, and in three days building [it], save thyself; if Son thou art of God, come down from the cross.'"}],[{"type":"prose","content":"And in like manner also the chief priests mocking, with the scribes and elders, said,"}],[{"type":"prose","content":"`Others he saved; himself he is not able to save! If he be King of Israel, let him come down now from the cross, and we will believe him;"}],[{"type":"prose","content":"he hath trusted on God, let Him now deliver him, if He wish him, because he said -- Son of God I am;'"}],[{"type":"prose","content":"with the same also the robbers, who were crucified with him, were reproaching him."}],[{"type":"prose","content":"And from the sixth hour darkness came over all the land unto the ninth hour,"}],[{"type":"prose","content":"and about the ninth hour Jesus cried out with a great voice, saying, `Eli, Eli, lama sabachthani?' that is, `My God, my God, why didst Thou forsake me?'"}],[{"type":"prose","content":"And certain of those standing there having heard, said -- `Elijah he doth call;'"}],[{"type":"prose","content":"and immediately, one of them having run, and having taken a spunge, having filled [it] with vinegar, and having put [it] on a reed, was giving him to drink,"}],[{"type":"prose","content":"but the rest said, `Let alone, let us see if Elijah doth come -- about to save him.'"}],[{"type":"prose","content":"And Jesus having again cried with a great voice, yielded the spirit;"}],[{"type":"prose","content":"and lo, the vail of the sanctuary was rent in two from top unto bottom, and the earth did quake, and the rocks were rent,"}],[{"type":"prose","content":"and the tombs were opened, and many bodies of the saints who have fallen asleep, arose,"}],[{"type":"prose","content":"and having come forth out of the tombs after his rising, they went into the holy city, and appeared to many."}],[{"type":"prose","content":"And the centurion, and those with him watching Jesus, having seen the earthquake, and the things that were done, were exceedingly afraid, saying, `Truly this was God's Son.'"}],[{"type":"prose","content":"And there were there many women beholding from afar, who did follow Jesus from Galilee, ministering to him,"}],[{"type":"prose","content":"among whom was Mary the Magdalene, and Mary the mother of James and of Joses, and the mother of the sons of Zebedee."}],[{"type":"prose","content":"And evening having come, there came a rich man, from Arimathea, named Joseph, who also himself was discipled to Jesus,"}],[{"type":"prose","content":"he having gone near to Pilate, asked for himself the body of Jesus; then Pilate commanded the body to be given back."}],[{"type":"prose","content":"And having taken the body, Joseph wrapped it in clean linen,"}],[{"type":"prose","content":"and laid it in his new tomb, that he hewed in the rock, and having rolled a great stone to the door of the tomb, he went away;"}],[{"type":"prose","content":"and there were there Mary the Magdalene, and the other Mary, sitting over-against the sepulchre."}],[{"type":"prose","content":"And on the morrow that is after the preparation, were gathered together the chief priests, and the Pharisees, unto Pilate,"}],[{"type":"prose","content":"saying, `Sir, we have remembered that that deceiver said while yet living, After three days I do rise;"}],[{"type":"prose","content":"command, then, the sepulchre to be made secure till the third day, lest his disciples, having come by night, may steal him away, and may say to the people, He rose from the dead, and the last deceit shall be worse than the first.'"}],[{"type":"prose","content":"And Pilate said to them, `Ye have a watch, go away, make secure -- as ye have known;'"}],[{"type":"prose","content":"and they, having gone, did make the sepulchre secure, having sealed the stone, together with the watch."}]]