[{"header":"God Sent His Son"},{"num":4,"verse":"What I am saying is this: As long as the heir is a young child, he is no different from a slave. Although he is owner of everything, "},{"num":2,"verse":"he is still under guardians and managers until the day set by his father. "},{"num":3,"verse":"So also, when we were younger children, we were enslaved under the basic principles of the world. "},{"num":4,"verse":"But when the set time had fully come, God sent his Son to be born of a woman, so that he would be born under the law, "},{"num":5,"verse":"in order to redeem those under the law, so that we would be adopted as sons. "},{"num":6,"verse":"And because you are sons, God sent the Spirit of his Son into our hearts to shout, “Abba, Father!” "},{"num":7,"verse":"So you are no longer a slave, but a son. And if you are a son, then you are also an heir of God through Christ."},{"header":"Paul’s Concern for the Gentiles"},{"num":8,"verse":"Formerly, when you did not know God, you were slaves to those who by nature are not gods. "},{"num":9,"verse":"But now that you know God, or rather are known by God, why are you turning back again to the basic principles that are weak and miserable? Do you want to be enslaved by them all over again? "},{"num":10,"verse":"You carefully observe days, months, seasons, and years. "},{"num":11,"verse":"I am fearful about you, that somehow my labor for you was wasted."},{"num":12,"verse":"I beg you, brothers, become like me, for I also became like you. You did me no harm. "},{"num":13,"verse":"You know that, because of a weakness of the flesh, I preached the gospel to you the first time. "},{"num":14,"verse":"And you did not despise or disdain the test my flesh gave you. Instead, you welcomed me as an angel of God, as Christ Jesus."},{"num":15,"verse":"So where is this blessed attitude of yours now? Yes, I can say for a fact that, if it were possible, you would have plucked out your eyes and given them to me. "},{"num":16,"verse":"So then, have I become your enemy by telling you the truth? "},{"num":17,"verse":"Those people are eager to win you over, but not in a good way. Rather, they want to alienate you, so that you will be eager for them. "},{"num":18,"verse":"But it is always a good thing to have someone eager in a good way—not just when I am present with you."},{"num":19,"verse":"My children, I am suffering birth pains for you again until Christ is formed in you. "},{"num":20,"verse":"I wish I were present with you now and could change my tone, because I am perplexed about you."},{"header":"An Illustration: Hagar and Sarah"},{"num":21,"verse":"Tell me, you who want to be under the law, are you really listening to the law? "},{"num":22,"verse":"For it is written that Abraham had two sons, one by the slave woman, and one by the free woman. "},{"num":23,"verse":"However, the son by the slave woman was born according to the flesh, but the son by the free woman was born through a promise. "},{"num":24,"verse":"These things can be used as an illustration; namely, the women are two covenants. One is from Mount Sinai, bearing children into slavery. This is Hagar. "},{"num":25,"verse":"You see, this Hagar is Mount Sinai in Arabia, and she corresponds to present-day Jerusalem, because Jerusalem is in slavery along with her children. "},{"num":26,"verse":"But the Jerusalem that is above is free. She is our mother. "},{"num":27,"verse":"For it is written:"},{"num":28,"verse":"Now you, brothers, like Isaac, are children of the promise. "},{"num":29,"verse":"But just as back then the one who was born according to the flesh persecuted the one who was born according to the Spirit, so this is also the case now. "},{"num":30,"verse":"But what does the Scripture say? “Throw out the slave woman and her son, because the son of the slave woman will certainly not receive the inheritance with the son of the free woman.” "},{"num":31,"verse":"For this same reason, brothers, we are not children of a slave woman, but of the free woman."}]