[{"num":4,"verse":"But now to continue—the son who will receive his father's property is treated just like a slave while he is young, even though he really owns everything. "},{"num":2,"verse":"While he is young, there are men who take care of him and manage his affairs until the time set by his father. "},{"num":3,"verse":"In the same way, we too were slaves of the ruling spirits of the universe before we reached spiritual maturity. "},{"num":4,"verse":"But when the right time finally came, God sent his own Son. He came as the son of a human mother and lived under the Jewish Law, "},{"num":5,"verse":"to redeem those who were under the Law, so that we might become God's children."},{"num":6,"verse":"To show that you are his children, God sent the Spirit of his Son into our hearts, the Spirit who cries out, “Father, my Father.” "},{"num":7,"verse":"So then, you are no longer a slave but a child. And since you are his child, God will give you all that he has for his children."},{"header":"Paul's Concern for the Galatians"},{"num":8,"verse":"In the past you did not know God, and so you were slaves of beings who are not gods. "},{"num":9,"verse":"But now that you know God—or, I should say, now that God knows you—how is it that you want to turn back to those weak and pitiful ruling spirits? Why do you want to become their slaves all over again? "},{"num":10,"verse":"You pay special attention to certain days, months, seasons, and years. "},{"num":11,"verse":"I am worried about you! Can it be that all my work for you has been for nothing?"},{"num":12,"verse":"I beg you, my friends, be like me. After all, I am like you. You have not done me any wrong. "},{"num":13,"verse":"You remember why I preached the gospel to you the first time; it was because I was sick. "},{"num":14,"verse":"But even though my physical condition was a great trial to you, you did not despise or reject me. Instead, you received me as you would an angel from heaven; you received me as you would Christ Jesus. "},{"num":15,"verse":"You were so happy! What has happened? I myself can say that you would have taken out your own eyes, if you could, and given them to me. "},{"num":16,"verse":"Have I now become your enemy by telling you the truth?"},{"num":17,"verse":"Those other people show a deep interest in you, but their intentions are not good. All they want is to separate you from me, so that you will have the same interest in them as they have in you. "},{"num":18,"verse":"Now, it is good to have such a deep interest if the purpose is good—this is true always, and not merely when I am with you. "},{"num":19,"verse":"My dear children! Once again, just like a mother in childbirth, I feel the same kind of pain for you until Christ's nature is formed in you. "},{"num":20,"verse":"How I wish I were with you now, so that I could take a different attitude toward you. I am so worried about you!"},{"header":"The Example of Hagar and Sarah"},{"num":21,"verse":"Let me ask those of you who want to be subject to the Law: do you not hear what the Law says? "},{"num":22,"verse":"It says that Abraham had two sons, one by a slave woman, the other by a free woman. "},{"num":23,"verse":"His son by the slave woman was born in the usual way, but his son by the free woman was born as a result of God's promise. "},{"num":24,"verse":"These things can be understood as a figure: the two women represent two covenants. The one whose children are born in slavery is Hagar, and she represents the covenant made at Mount Sinai. "},{"num":25,"verse":"Hagar, who stands for Mount Sinai in Arabia, is a figure of the present city of Jerusalem, in slavery with all its people. "},{"num":26,"verse":"But the heavenly Jerusalem is free, and she is our mother. "},{"num":27,"verse":"For the scripture says,"},{"num":28,"verse":"Now, you, my friends, are God's children as a result of his promise, just as Isaac was. "},{"num":29,"verse":"At that time the son who was born in the usual way persecuted the one who was born because of God's Spirit; and it is the same now. "},{"num":30,"verse":"But what does the scripture say? It says, “Send the slave woman and her son away; for the son of the slave woman will not have a part of the father's property along with the son of the free woman.” "},{"num":31,"verse":"So then, my friends, we are not the children of a slave woman but of a free woman."}]