[{"num":4,"verse":"Here is what I have been saying. As long as your own children are young, they are no different from slaves in your house. They are no different, even though they will own all the property. "},{"num":2,"verse":"People are in charge of the property. And other people are in charge of the children. The children remain under their care until they become adults. At that time their fathers give them the property. "},{"num":3,"verse":"It is the same with us. When we were children, we were slaves to the basic spiritual powers of the world. "},{"num":4,"verse":"But then the chosen time came. God sent his Son. A woman gave birth to him. He was born under the authority of the law. "},{"num":5,"verse":"He came to set free those who were under the authority of the law. He wanted us to be adopted as children with all the rights children have. "},{"num":6,"verse":"Because you are his children, God sent the Spirit of his Son into our hearts. He is the Holy Spirit. By his power we call God Abba. Abba means Father. "},{"num":7,"verse":"So you aren’t a slave any longer. You are God’s child. Because you are his child, God gives you the rights of those who are his children."},{"header":"Paul’s Concern for the Believers in Galatia"},{"num":8,"verse":"At one time you didn’t know God. You were slaves to gods that are really not gods at all. "},{"num":9,"verse":"But now you know God. Even better, God knows you. So why are you turning back to those weak and worthless powers? Do you want to be slaves to them all over again? "},{"num":10,"verse":"You are observing special days and months and seasons and years! "},{"num":11,"verse":"I am afraid for you. I am afraid that somehow I have wasted my efforts on you."},{"num":12,"verse":"I make my appeal to you, brothers and sisters. I’m asking you to become like me. After all, I became like you. You didn’t do anything wrong to me. "},{"num":13,"verse":"Remember when I first preached the good news to you? Remember I did that because I was sick. "},{"num":14,"verse":"And my sickness was hard on you. But you weren’t mean to me. You didn’t make fun of me. Instead, you welcomed me as if I were an angel of God. You welcomed me as if I were Christ Jesus himself. "},{"num":15,"verse":"So why aren’t you treating me the same way now? Suppose you could have torn out your own eyes and given them to me. Then you would have done it. I am a witness to this. "},{"num":16,"verse":"Have I become your enemy now by telling you the truth?"},{"num":17,"verse":"Those people are trying hard to win you over. But it is not for your good. They want to take you away from us. They want you to commit yourselves to them. "},{"num":18,"verse":"It is fine to be committed to something, if the purpose is good. And you shouldn’t be committed only when I am with you. You should always be committed. "},{"num":19,"verse":"My dear children, I am in pain for you like I was when we first met. I have pain like a woman giving birth. And my pain will continue until Christ makes you like himself. "},{"num":20,"verse":"I wish I could be with you now. I wish I could change my tone of voice. As it is, I don’t understand you."},{"header":"Hagar and Sarah"},{"num":21,"verse":"You who want to be under the authority of the law, tell me something. Don’t you know what the law says? "},{"num":22,"verse":"It is written that Abraham had two sons. The slave woman gave birth to one of them. The free woman gave birth to the other one. "},{"num":23,"verse":"Abraham’s son by the slave woman was born in the usual way. But his son by the free woman was born because of God’s promise."},{"num":24,"verse":"These things are examples. The two women stand for two covenants. One covenant comes from Mount Sinai. It gives birth to children who are going to be slaves. It is Hagar. "},{"num":25,"verse":"Hagar stands for Mount Sinai in Arabia. She stands for the present city of Jerusalem. That’s because she and her children are slaves. "},{"num":26,"verse":"But the Jerusalem that is above is free. She is our mother. "},{"num":27,"verse":"It is written,"},{"num":28,"verse":"Brothers and sisters, you are children because of God’s promise just as Isaac was. "},{"num":29,"verse":"At that time, the son born in the usual way tried to hurt the other son. The other son was born by the power of the Holy Spirit. It is the same now. "},{"num":30,"verse":"But what does Scripture say? “Get rid of the slave woman. Get rid of her son. The slave woman’s son will never have a share of the family’s property. He’ll never share it with the free woman’s son.” (Genesis 21:10) "},{"num":31,"verse":"Brothers and sisters, we are not the slave woman’s children. We are the free woman’s children."}]