[{"num":4,"verse":"Then I say that the heir (as long as he is a child) differs nothing from a servant - though he be Lord of all -"},{"num":2,"verse":"but is under tutors and governors until the time appointed by the Father."},{"num":3,"verse":"Even so, we (when we were children) were in bondage under the basic principles of the world."},{"num":4,"verse":"But when the fullness of time had come, God sent forth his Son, made of a woman and made under the Law;"},{"num":5,"verse":"so that He might redeem those who were under the Law (that we might receive adoption as sons)."},{"num":6,"verse":"And because you are sons, God has sent forth the Spirit of His Son into your hearts, who cries, “Abba, Father!”"},{"num":7,"verse":"Therefore, you are a servant no more, but a son. Now, if you are a son, you are also the heir of God, through Christ."},{"num":8,"verse":"But even then, when you did not know God, you were enslaved by those who, by nature, are not gods."},{"num":9,"verse":"But now, seeing you know God - indeed, rather, are known by God - how can you turn again to weak and poor principals; so that, as before, you will be in bondage again?"},{"num":10,"verse":"You observe days and months and times and years."},{"num":11,"verse":"I am in fear for you, lest I have bestowed upon you labor in vain."},{"num":12,"verse":"Be as me, brothers, I beg you (for I am also like you). You have not hurt me at all."},{"num":13,"verse":"And you know how through weakness of the flesh I preached the Gospel to you at first."},{"num":14,"verse":"And your trial from me (which was in my flesh) you neither despised nor abhorred. But you received me as an angel of God; indeed, as Christ Jesus."},{"num":15,"verse":"Where then is your felicity? For I bear witness that if it had been possible, you would have plucked out your own eyes and have given them to me."},{"num":16,"verse":"Have I therefore become your enemy because I tell you the truth?"},{"num":17,"verse":"They are wrongly jealous for you. Yea, they would separate you from us, so that you would be jealous for them."},{"num":18,"verse":"But it is a good thing to always love earnestly in a good thing, and not only when I am present with you,"},{"num":19,"verse":"my little children with whom I travail in birth again, until Christ is formed in you."},{"num":20,"verse":"And I would that I were with you now, so I might change my voice. For I am in doubt of you."},{"num":21,"verse":"Tell me, you who would be under the Law, do you not hear the Law?"},{"num":22,"verse":"For it is written that Abraham had two sons: one by a servant and one by a free woman."},{"num":23,"verse":"But he who was by the servant was born after the flesh. And he who was by the free woman was born by promise."},{"num":24,"verse":"These things are allegorical. For these mothers are the two Testaments. The one called Hagar begat those of mount Sinai, who are enslaved."},{"num":25,"verse":"For Hagar (or Sinai) is a mountain in Arabia, and it is now presently Jerusalem. And she is enslaved with her children."},{"num":26,"verse":"But the Jerusalem above is free and is the mother of us all."},{"num":27,"verse":"For it is written, “Rejoice, you barren who bear no children! Break forth, and cry, you who do not travail! For the desolate has many more children than she who has a husband.”"},{"num":28,"verse":"Therefore, brothers, we are like Isaac: children of the promise."},{"num":29,"verse":"But just as at that time the one who was born after the flesh persecuted the one who was born after the Spirit, so also it is now."},{"num":30,"verse":"But what says the Scripture? ‘Put out the servant and her son. For the son of the servant shall not be heir with the son of the free woman.’"},{"num":31,"verse":"Then, brothers, we are not children of the servant, but of the free woman."}]