[{"num":7,"verse":"The Lord said to Moses, “See how important I have made you? In speaking to Pharaoh, you will be like God, and your brother Aaron will be your prophet."},{"num":2,"verse":"You will tell Aaron everything that I command you. Then he will tell the king what I say. And Pharaoh will let the Israelites leave this country."},{"num":3,"verse":"But I will make Pharaoh stubborn so that he will not do what you tell him. Then I will do many miracles in Egypt to prove who I am."},{"num":4,"verse":"But he will still refuse to listen. So then I will punish Egypt very much. And I will lead my army, my people, out of that land."},{"num":5,"verse":"I will punish the people of Egypt, and they will learn that I am the Lord. Then I will lead my people out of their country.”"},{"num":6,"verse":"Moses and Aaron did what the Lord told them."},{"num":7,"verse":"Moses was 80 years old at the time, and Aaron was 83."},{"header":"Moses’ Walking Stick Becomes a Snake"},{"num":8,"verse":"The Lord said to Moses and Aaron,"},{"num":9,"verse":"“Pharaoh will ask you to prove your power. He will ask you to do a miracle. Tell Aaron to throw his walking stick on the ground. While Pharaoh is watching, the stick will become a snake.”"},{"num":10,"verse":"So Moses and Aaron went to Pharaoh and obeyed the Lord. Aaron threw his walking stick down. While Pharaoh and his officers watched, the stick became a snake."},{"num":11,"verse":"So Pharaoh called for his wise men and magicians. These men used their magic, and they were able to do the same thing as Aaron."},{"num":12,"verse":"They threw their walking sticks on the ground, and their sticks became snakes. But then Aaron’s walking stick ate theirs."},{"num":13,"verse":"Pharaoh still refused to let the people go, just as the Lord had said. Pharaoh refused to listen to Moses and Aaron."},{"header":"The Water Becomes Blood"},{"num":14,"verse":"Then the Lord said to Moses, “Pharaoh is being stubborn. He refuses to let the people go."},{"num":15,"verse":"In the morning Pharaoh will go out to the river. Go to him by the edge of the Nile River. Take the walking stick that became a snake."},{"num":16,"verse":"Tell him this: ‘The Lord, the God of the Hebrews, sent me to you. He told me to tell you to let his people go worship him in the desert. Until now you have not listened to the Lord."},{"num":17,"verse":"So the Lord says that he will do something to show you that he is the Lord. I will hit the water of the Nile River with this walking stick in my hand, and the river will turn into blood."},{"num":18,"verse":"The fish in the river will die, and the river will begin to stink. Then the Egyptians will not be able to drink the water from the river.’”"},{"num":19,"verse":"The Lord said to Moses: “Tell Aaron to hold the walking stick in his hand over the rivers, canals, lakes, and every place where they store water. When he does this, all the water will turn into blood. All the water, even the water stored in wood and stone jars, will turn into blood.”"},{"num":20,"verse":"So Moses and Aaron did what the Lord commanded. Aaron raised the walking stick and hit the water in the Nile River. He did this in front of Pharaoh and his officials. So all the water in the river changed into blood."},{"num":21,"verse":"The fish in the river died, and the river began to stink. So the Egyptians could not drink water from the river. The blood was everywhere in Egypt."},{"num":22,"verse":"The magicians used their magic to do the same thing. So Pharaoh refused to listen to Moses and Aaron. This happened just as the Lord said."},{"num":23,"verse":"Pharaoh ignored what Moses and Aaron had done. He turned and went into his house."},{"num":24,"verse":"The Egyptians could not drink the water from the river, so they dug wells around the river for water to drink."},{"header":"The Frogs"},{"num":25,"verse":"Seven days passed after the Lord changed the Nile River."}]