[{"num":7,"verse":"3 God hardeneth Pharaoh’s heart. 10 Moses and Aaron do the miracles of the serpent, and the blood: and Pharaoh’s sorcerers do the like."},{"num":1,"verse":"Then the Lord said to Moses, Behold, I have made thee Pharaoh’s God, and Aaron thy brother shall be thy Prophet."},{"num":2,"verse":"Thou shalt speak all that I commanded thee: and Aaron thy brother shall speak unto Pharaoh, that he suffer the children of Israel to go out of his land."},{"num":3,"verse":"But I will harden Pharaoh’s heart, and multiply my miracles, and my wonders in the land of Egypt."},{"num":4,"verse":"And Pharaoh shall not hearken unto you, that I may lay mine hand upon Egypt, and bring out mine armies, even my people, the children of Israel out of the land of Egypt, by great judgments."},{"num":5,"verse":"Then the Egyptians shall know that I am the Lord, when I stretch forth mine hand upon Egypt, and bring out the children of Israel from among them."},{"num":6,"verse":"So Moses and Aaron did as the Lord commanded them, even so did they."},{"num":7,"verse":"(Now Moses was fourscore years old, and Aaron fourscore and three, when they spake unto Pharaoh.)"},{"num":8,"verse":"¶ And the Lord had spoken unto Moses and Aaron, saying,"},{"num":9,"verse":"If Pharaoh speak unto you, saying, Show a miracle for you, then thou shalt say unto Aaron, Take thy rod, and cast it before Pharaoh, and it shall be turned into a serpent."},{"num":10,"verse":"¶ Then went Moses and Aaron unto Pharaoh, and did even as the Lord had commanded, and Aaron cast forth his rod before Pharaoh and before his servants, and it was turned into a serpent."},{"num":11,"verse":"Then Pharaoh also called for the wise men and sorcerers: and those charmers also of Egypt did in like manner with their enchantments."},{"num":12,"verse":"For they cast down every man his rod, and they were turned into serpents: but Aaron’s rod devoured their rods."},{"num":13,"verse":"So Pharaoh’s heart was hardened, and he hearkened not to them, as the Lord had said."},{"num":14,"verse":"¶ The Lord then said unto Moses, Pharaoh’s heart is obstinate, he refuseth to let the people go."},{"num":15,"verse":"Go unto Pharaoh in the morning, (lo, he will come forth unto the water) and thou shalt stand and meet him by the river’s brink, and the rod, which was turned into a serpent, shalt thou take in thine hand."},{"num":16,"verse":"And thou shalt say unto him, The Lord God of the Hebrews hath sent me unto thee, saying, Let my people go that they may serve me in the wilderness: and behold, hitherto thou wouldest not hear."},{"num":17,"verse":"Thus saith the Lord, In this thou shalt know that I am the Lord: behold, I will smite with the rod that is in mine hand upon the water that is in the river, and it shall be turned into blood."},{"num":18,"verse":"And the fish that is in the river shall die, and the river shall stink, and it shall grieve the Egyptians to drink of the water of the river."},{"num":19,"verse":"¶ The Lord then spake to Moses, Say unto Aaron, Take thy rod, and stretch out thine hand over the waters of Egypt, over their streams, over their rivers, and over their ponds, and over all pools of their waters, and they shall be blood, and there shall be blood throughout the land of Egypt, both in vessels of wood, and of stone."},{"num":20,"verse":"So Moses and Aaron did even as the Lord commanded: and he lift up the rod, and smote the water that was in the river in the sight of Pharaoh, and in the sight of his servants: and all the water that was in the river, was turned into blood."},{"num":21,"verse":"And the fish that was in the river died, and the river stank: so that the Egyptians could not drink of the water of the river: and there was blood throughout the land of Egypt."},{"num":22,"verse":"And the enchanters of Egypt did likewise with their sorceries: and the heart of Pharaoh was hardened: so that he did not hearken unto them, as the Lord hath said."},{"num":23,"verse":"Then Pharaoh returned, and went again into his house, neither did this yet enter into his heart."},{"num":24,"verse":"All the Egyptians then dug round about the river for waters to drink: for they could not drink of the water of the river."},{"num":25,"verse":"And this continued fully seven days after the Lord had smitten the river."}]