[{"num":7,"verse":"So the Lord said to Moses, “See, I have made you a god to Pharaoh, and Aaron your brother will be your prophet. "},{"num":2,"verse":"You shall speak all that I command you, and Aaron your brother shall tell Pharaoh to send the children of Israel out of his land. "},{"num":3,"verse":"But I will harden Pharaoh’s heart and multiply My signs and My wonders in the land of Egypt. "},{"num":4,"verse":"Nevertheless, Pharaoh will not listen to you, so that I may lay My hand upon Egypt and bring forth My armies and My people, the children of Israel, out of the land of Egypt by great judgments. "},{"num":5,"verse":"And the Egyptians shall know that I am the Lord when I stretch forth My hand upon Egypt and bring out the children of Israel from among them.”"},{"num":6,"verse":"So Moses and Aaron did it. Just as the Lord commanded them, so they did. "},{"num":7,"verse":"Moses was eighty years old, and Aaron was eighty-three years old when they spoke to Pharaoh."},{"header":"Aaron’s Rod Becomes a Snake"},{"num":8,"verse":"Now the Lord spoke to Moses and to Aaron, saying, "},{"num":9,"verse":"“When Pharaoh shall speak to you, saying, ‘Show a miracle,’ then you shall say to Aaron, ‘Take your rod, and throw it before Pharaoh,’ and it shall become a serpent.”"},{"num":10,"verse":"So Moses and Aaron went to Pharaoh, and they did what the Lord had commanded. And Aaron threw down his rod before Pharaoh and before his servants, and it became a serpent. "},{"num":11,"verse":"Then Pharaoh also called the wise men and the sorcerers. Then the magicians of Egypt likewise performed with their secret arts. "},{"num":12,"verse":"For every man threw down his rod, and they became serpents. But Aaron’s rod swallowed up their rods. "},{"num":13,"verse":"Nonetheless, Pharaoh’s heart hardened so that he would not listen to them, just as the Lord had said."},{"header":"The First Plague: Waters Turn to Blood"},{"num":14,"verse":"The Lord said to Moses, “Pharaoh’s heart is hardened. He refuses to let the people go. "},{"num":15,"verse":"Go to Pharaoh in the morning as he goes out to the water, and you shall stand by the river’s bank to meet him. You must take the rod which was turned to a serpent in your hand. "},{"num":16,"verse":"Then you are to say to him, ‘The Lord, the God of the Hebrews, has sent me to you, saying, “Let My people go, so that they may serve Me in the wilderness.” But up to this point you have not listened! "},{"num":17,"verse":"Thus says the Lord, “In this you shall know that I am the Lord: Indeed, I will strike the waters of the Nile with the rod that is in my hand, and they shall be turned to blood. "},{"num":18,"verse":"And the fish that are in the river shall die, and the river shall stink so that the Egyptians shall be weary of drinking the river’s water.” ’ ”"},{"num":19,"verse":"Then the Lord spoke to Moses, “Say to Aaron, ‘Take your rod, and stretch out your hand over the waters of Egypt, over their rivers, over their canals, over their ponds, and over all their pools of water, so that they may become blood. And there will be blood throughout all the land of Egypt, both in vessels of wood, and in vessels of stone.’ ”"},{"num":20,"verse":"Moses and Aaron did so, just as the Lord commanded. And he lifted up the rod and struck the waters that were in the river, in the sight of Pharaoh, and in the sight of his servants, and all the waters that were in the river were turned to blood. "},{"num":21,"verse":"The fish that were in the river died, the river stank, and the Egyptians could not drink of the water of the river. Blood was everywhere throughout the land of Egypt."},{"num":22,"verse":"Nevertheless, the magicians of Egypt did the same with their secret arts, and Pharaoh’s heart was hardened, and he did not listen to them, as the Lord had said. "},{"num":23,"verse":"Then Pharaoh turned and went into his house, and he did not concern himself with this either. "},{"num":24,"verse":"So all the Egyptians dug around about the river for water to drink, because they could not drink of the water of the river."},{"num":25,"verse":"Seven days passed after the Lord had struck the river."}]