[{"num":1,"verse":"And the Lord said to Moses, “See, I make you as God to Pharaoh; and Aaron your brother shall be your prophet. "},{"num":2,"verse":"You shall speak all that I command you; and Aaron your brother shall tell Pharaoh to let the people of Israel go out of his land. "},{"num":3,"verse":"But I will harden Pharaoh’s heart, and though I multiply my signs and wonders in the land of Egypt, "},{"num":4,"verse":"Pharaoh will not listen to you; then I will lay my hand upon Egypt and bring forth my hosts, my people the sons of Israel, out of the land of Egypt by great acts of judgment. "},{"num":5,"verse":"And the Egyptians shall know that I am the Lord, when I stretch forth my hand upon Egypt and bring out the people of Israel from among them.” "},{"num":6,"verse":"And Moses and Aaron did so; they did as the Lord commanded them. "},{"num":7,"verse":"Now Moses was eighty years old, and Aaron eighty-three years old, when they spoke to Pharaoh."},{"header":"Aaron’s Miraculous Rod"},{"num":8,"verse":"And the Lord said to Moses and Aaron, "},{"num":9,"verse":"“When Pharaoh says to you, ‘Prove yourselves by working a miracle,’ then you shall say to Aaron, ‘Take your rod and cast it down before Pharaoh, that it may become a serpent.’” "},{"num":10,"verse":"So Moses and Aaron went to Pharaoh and did as the Lord commanded; Aaron cast down his rod before Pharaoh and his servants, and it became a serpent. "},{"num":11,"verse":"Then Pharaoh summoned the wise men and the sorcerers; and they also, the magicians of Egypt, did the same by their secret arts. "},{"num":12,"verse":"For every man cast down his rod, and they became serpents. But Aaron’s rod swallowed up their rods. "},{"num":13,"verse":"Still Pharaoh’s heart was hardened, and he would not listen to them; as the Lord had said."},{"header":"The First Plague: Water Turned to Blood"},{"num":14,"verse":"Then the Lord said to Moses, “Pharaoh’s heart is hardened, he refuses to let the people go. "},{"num":15,"verse":"Go to Pharaoh in the morning, as he is going out to the water; wait for him by the river’s brink, and take in your hand the rod which was turned into a serpent. "},{"num":16,"verse":"And you shall say to him, ‘The Lord, the God of the Hebrews, sent me to you, saying, “Let my people go, that they may serve me in the wilderness; and behold, you have not yet obeyed.” "},{"num":17,"verse":"Thus says the Lord, “By this you shall know that I am the Lord: behold, I will strike the water that is in the Nile with the rod that is in my hand, and it shall be turned to blood, "},{"num":18,"verse":"and the fish in the Nile shall die, and the Nile shall become foul, and the Egyptians will loathe to drink water from the Nile.”’” "},{"num":19,"verse":"And the Lord said to Moses, “Say to Aaron, ‘Take your rod and stretch out your hand over the waters of Egypt, over their rivers, their canals, and their ponds, and all their pools of water, that they may become blood; and there shall be blood throughout all the land of Egypt, both in vessels of wood and in vessels of stone.’”"},{"num":20,"verse":"Moses and Aaron did as the Lord commanded; in the sight of Pharaoh and in the sight of his servants, he lifted up the rod and struck the water that was in the Nile, and all the water that was in the Nile turned to blood. "},{"num":21,"verse":"And the fish in the Nile died; and the Nile became foul, so that the Egyptians could not drink water from the Nile; and there was blood throughout all the land of Egypt. "},{"num":22,"verse":"But the magicians of Egypt did the same by their secret arts; so Pharaoh’s heart remained hardened, and he would not listen to them; as the Lord had said. "},{"num":23,"verse":"Pharaoh turned and went into his house, and he did not lay even this to heart. "},{"num":24,"verse":"And all the Egyptians dug round about the Nile for water to drink, for they could not drink the water of the Nile."},{"header":"The Second Plague: Frogs"},{"num":25,"verse":"Seven days passed after the Lord had struck the Nile. "}]