[{"num":7,"verse":"And Jehovah saith unto Moses, `See, I have given thee a god to Pharaoh, and Aaron thy brother is thy prophet;"},{"num":2,"verse":"thou -- thou dost speak all that I command thee, and Aaron thy brother doth speak unto Pharaoh, and he hath sent the sons of Israel out of his land."},{"num":3,"verse":"`And I harden the heart of Pharaoh, and have multiplied My signs and My wonders in the land of Egypt,"},{"num":4,"verse":"and Pharaoh doth not hearken, and I have put My hand on Egypt, and have brought out My hosts, My people, the sons of Israel, from the land of Egypt by great judgments;"},{"num":5,"verse":"and the Egyptians have known that I [am] Jehovah, in My stretching out My hand against Egypt; and I have brought out the sons of Israel from their midst.'"},{"num":6,"verse":"And Moses doth -- Aaron also -- as Jehovah commanded them; so have they done;"},{"num":7,"verse":"and Moses [is] a son of eighty years, and Aaron [is] a son of eighty and three years, in their speaking unto Pharaoh."},{"num":8,"verse":"And Jehovah speaketh unto Moses and unto Aaron, saying,"},{"num":9,"verse":"`When Pharaoh speaketh unto you, saying, Give for yourselves a wonder; then thou hast said unto Aaron, Take thy rod, and cast before Pharaoh -- it becometh a monster.'"},{"num":10,"verse":"And Moses goeth in -- Aaron also -- unto Pharaoh, and they do so as Jehovah hath commanded; and Aaron casteth his rod before Pharaoh, and before his servants, and it becometh a monster."},{"num":11,"verse":"And Pharaoh also calleth for wise men, and for sorcerers; and the scribes of Egypt, they also, with their flashings, do so,"},{"num":12,"verse":"and they cast down each his rod, and they become monsters, and the rod of Aaron swalloweth their rods;"},{"num":13,"verse":"and the heart of Pharaoh is strong, and he hath not hearkened unto them, as Jehovah hath spoken."},{"num":14,"verse":"And Jehovah saith unto Moses, `The heart of Pharaoh hath been hard, he hath refused to send the people away;"},{"num":15,"verse":"go unto Pharaoh in the morning, lo, he is going out to the water, and thou hast stood to meet him by the edge of the River, and the rod which was turned to a serpent thou dost take in thy hand,"},{"num":16,"verse":"and thou hast said unto him: Jehovah, God of the Hebrews, hath sent me unto thee, saying, Send My people away, and they serve Me in the wilderness; and lo, thou hast not hearkened hitherto."},{"num":17,"verse":"`Thus said Jehovah: By this thou knowest that I [am] Jehovah; lo, I am smiting with the rod which [is] in my hand, on the waters which [are] in the River, and they have been turned to blood,"},{"num":18,"verse":"and the fish that [are] in the River die, and the River hath stank, and the Egyptians have been wearied of drinking waters from the River.'"},{"num":19,"verse":"And Jehovah saith unto Moses, `Say unto Aaron, Take thy rod, and stretch out thy hand against the waters of Egypt, against their streams, against their rivers, and against their ponds, and against all their collections of waters; and they are blood -- and there hath been blood in all the land of Egypt, both in [vessels of] wood, and in [those of] stone.'"},{"num":20,"verse":"And Moses and Aaron do so, as Jehovah hath commanded, and he lifteth up [his hand] with the rod, and smiteth the waters which [are] in the River, before the eyes of Pharaoh, and before the eyes of his servants, and all the waters which [are] in the River are turned to blood,"},{"num":21,"verse":"and the fish which [is] in the River hath died, and the River stinketh, and the Egyptians have not been able to drink water from the River; and the blood is in all the land of Egypt."},{"num":22,"verse":"And the scribes of Egypt do so with their flashings, and the heart of Pharaoh is strong, and he hath not hearkened unto them, as Jehovah hath spoken,"},{"num":23,"verse":"and Pharaoh turneth and goeth in unto his house, and hath not set his heart even to this;"},{"num":24,"verse":"and all the Egyptians seek water round about the river to drink, for they have not been able to drink of the waters of the River."},{"num":25,"verse":"And seven days are completed after Jehovah's smiting the River,"}]