[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(25) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Destroyed . . . eighteen thousand men.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This second defeat seems to have been due, like the first, to overweening confidence and carelessness. Thus in two battles the eleven tribes lost 40,000 men—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "13,300 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "more than the entire Benjamite army, which was only ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "26,700. Such a hideous massacre can only be accounted for by the supposition that the Benjamite slings did deadly execution from some vantage-ground. Similarly at Crecy ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "1,200 knights and 30,000 footmen—a number equal to the whole English force—lay dead upon the ground” (Green, 1:419).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:7-13 Micah thought it was a sign of God's favour to him and his images, that a Levite should come to his door. Thus those who please themselves with their own delusions, if Providence unexpectedly bring any thing to their hands that further them in their evil way, are apt from thence to think that God is pleased with them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Gibeah, being on a hill, was difficult of access to an attacking army, and gave great advantage to the defenders, who fought from higher ground, and probably defended a narrow pass, while their companions on the walls could gall the assailants with their slingstones. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jud 20:18-28. The Israelites Lose Forty Thousand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18-28. the children of Israel arose, and went up to the house of God—This consultation at Shiloh was right. But they ought to have done it at the commencement of their proceedings. Instead of this, all their plans were formed, and never doubting, it would seem, that the war was just and inevitable, the only subject of their inquiry related to the precedency of the tribes—a point which it is likely was discussed in the assembly. Had they asked counsel of God sooner, their expedition would have been conducted on a different principle—most probably by reducing the number of fighting men, as in the case of Gideon's army. As it was, the vast number of volunteers formed an excessive and unwieldy force, unfit for strenuous and united action against a small, compact, and well-directed army. A panic ensued, and the confederate tribes, in two successive engagements, sustained great losses. These repeated disasters (notwithstanding their attack on Benjamin had been divinely authorized) overwhelmed them with shame and sorrow. Led to reflection, they became sensible of their guilt in not repressing their national idolatries, as well as in too proudly relying on their superior numbers and the precipitate rashness of this expedition. Having humbled themselves by prayer and fasting, as well as observed the appointed method of expiating their sins, they were assured of acceptance as well as of victory. The presence and services of Phinehas on this occasion help us to ascertain the chronology thus far, that the date of the occurrence must be fixed shortly after the death of Joshua.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Benjamin went forth against them out of Gibeah the second day,.... Flushed with the victory they had obtained the day before: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and destroyed down to the ground of the children of Israel again eighteen thousand men, all these drew the sword, were armed men; this, with the 22,000 slain the day preceding, made 40,000; the same number singled out from among them by lot to provide food for them, and is thought by some to be the case Deborah refers to, Judges 5:8 and is what is certainly intended in Hosea 10:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and destroyed down to the ground of the children of Israel again eighteen thousand men, all these drew the sword, were armed men; this, with the 22,000 slain the day preceding, made 40,000; the same number singled out from among them by lot to provide food for them, and is thought by some to be the case Deborah refers to, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and is what is certainly intended in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Benjamin went forth against them out of Gibeah the second day, and destroyed down to the ground of the children of Israel again eighteen thousand men; all these drew the sword.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Of the children of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We are not told upon which tribe the lot fell, or the answer was given, that they should go up the second day. Judges 20:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But on the second day also the Benjaminites brought 18,000 of them to the ground. \"The second day\" is not the day following the first engagement, as if the battles had been fought upon two successive days, but the second day of actual fighting, which took place some days after the first, for the inquiry was made at Bethel as to the will of God between the two engagements. ",
        "children": []
      }
    ]
  }
]