[{"num":6,"verse":"To the overcomer in psalms, the psalm of David, on the eighth. Lord, reprove thou not me in thy strong vengeance; neither chastise thou me in thine ire. (To the overcomer, in songs, the song of David, on the eighth. Lord, do not thou condemn me in thy fury; nor chastise thou me in thy anger.)"},{"num":2,"verse":"Lord, have thou mercy on me, for I am sick (for I am weak, or feeble); Lord, make thou me whole, for all my bones be troubled."},{"num":3,"verse":"And my soul is troubled greatly; but thou, Lord, how long? (And my soul is greatly troubled; but thou, O Lord, how long shalt thou wait?)"},{"num":4,"verse":"Lord, be thou converted/be thou turned again, and deliver my soul; make thou me safe, for thy mercy. (Lord, return thou, and rescue my soul; save thou me, in thy mercy/for the sake of thy love.)"},{"num":5,"verse":"For none there is in death, that is mindful of thee; but in hell who shall acknowledge to thee? (For there is no one among the dead, who remembereth thee; who shall praise thee in Sheol, or the land of the dead?/who shall praise thee in the grave?)"},{"num":6,"verse":"I travailed in my wailing, I shall wash my bed by each night; I shall moisten, either make wet, my bedstraw with my tears. (I am travailed, or made weary, from all my wailing, and each night I wash my bed with my weeping; yea, I moisten my bedstraw with my tears.)"},{"num":7,"verse":"Mine eye is troubled of strong vengeance; I wax eld among all mine enemies. (My eyes be full of grief; they grow old because of all my enemies.)"},{"num":8,"verse":"All ye that work wickedness, depart from me; for the Lord hath heard the voice of my weeping. (All ye who do evil, go away from me; for the Lord hath heard the sound of my weeping.)"},{"num":9,"verse":"The Lord hath heard my beseeching; the Lord hath received my prayer. (The Lord hath heard my plea; the Lord hath received my prayer.)"},{"num":10,"verse":"All mine enemies be ashamed, and be troubled greatly; be they turned (al)together, and be they ashamed full swiftly. (Let all my enemies be ashamed, and be greatly troubled; yea, let them be turned away, and be they quickly ashamed/and be they greatly confused.)"}]