[{"num":2,"verse":"I decided to enjoy myself and find out what happiness is. But I found that this is useless, too. "},{"num":2,"verse":"I discovered that laughter is foolish, that pleasure does you no good. "},{"num":3,"verse":"Driven on by my desire for wisdom, I decided to cheer myself up with wine and have a good time. I thought that this might be the best way people can spend their short lives on earth."},{"num":4,"verse":"I accomplished great things. I built myself houses and planted vineyards. "},{"num":5,"verse":"I planted gardens and orchards, with all kinds of fruit trees in them; "},{"num":6,"verse":"I dug ponds to irrigate them. "},{"num":7,"verse":"I bought many slaves, and there were slaves born in my household. I owned more livestock than anyone else who had ever lived in Jerusalem. "},{"num":8,"verse":"I also piled up silver and gold from the royal treasuries of the lands I ruled. Men and women sang to entertain me, and I had all the women a man could want."},{"num":9,"verse":"Yes, I was great, greater than anyone else who had ever lived in Jerusalem, and my wisdom never failed me. "},{"num":10,"verse":"Anything I wanted, I got. I did not deny myself any pleasure. I was proud of everything I had worked for, and all this was my reward. "},{"num":11,"verse":"Then I thought about all that I had done and how hard I had worked doing it, and I realized that it didn't mean a thing. It was like chasing the wind—of no use at all. "},{"num":12,"verse":"After all, a king can only do what previous kings have done."},{"num":13,"verse":"Oh, I know, “Wisdom is better than foolishness, just as light is better than darkness. "},{"num":14,"verse":"The wise can see where they are going, and fools cannot.” But I also know that the same fate is waiting for us all. "},{"num":15,"verse":"I thought to myself, “What happens to fools is going to happen to me, too. So what have I gained from being so wise?” “Nothing,” I answered, “not a thing.” "},{"num":16,"verse":"No one remembers the wise, and no one remembers fools. In days to come, we will all be forgotten. We must all die—wise and foolish alike. "},{"num":17,"verse":"So life came to mean nothing to me, because everything in it had brought me nothing but trouble. It had all been useless; I had been chasing the wind."},{"num":18,"verse":"Nothing that I had worked for and earned meant a thing to me, because I knew that I would have to leave it to my successor, "},{"num":19,"verse":"and he might be wise, or he might be foolish—who knows? Yet he will own everything I have worked for, everything my wisdom has earned for me in this world. It is all useless. "},{"num":20,"verse":"So I came to regret that I had worked so hard. "},{"num":21,"verse":"You work for something with all your wisdom, knowledge, and skill, and then you have to leave it all to someone who hasn't had to work for it. It is useless, and it isn't right! "},{"num":22,"verse":"You work and worry your way through life, and what do you have to show for it? "},{"num":23,"verse":"As long as you live, everything you do brings nothing but worry and heartache. Even at night your mind can't rest. It is all useless."},{"num":24,"verse":"The best thing we can do is eat and drink and enjoy what we have earned. And yet, I realized that even this comes from God. "},{"num":25,"verse":"How else could you have anything to eat or enjoy yourself at all? "},{"num":26,"verse":"God gives wisdom, knowledge, and happiness to those who please him, but he makes sinners work, earning and saving, so that what they get can be given to those who please him. It is all useless. It is like chasing the wind."}]