[{"header":"A List of Priests and Levites"},{"num":12,"verse":"Many priests and Levites had returned from Babylonia with Zerubbabel and Joshua as their leaders. Those priests were Seraiah, Jeremiah, Ezra, "},{"num":2,"verse":"Amariah, Malluch, Hattush, "},{"num":3,"verse":"Shecaniah, Rehum, Meremoth, "},{"num":4,"verse":"Iddo, Ginnethoi, Abijah, "},{"num":5,"verse":"Mijamin, Maadiah, Bilgah, "},{"num":6,"verse":"Shemaiah, Joiarib, Jedaiah, "},{"num":7,"verse":"Sallu, Amok, Hilkiah, and another Jedaiah. These were the leading priests and their assistants during the time of Joshua."},{"num":8,"verse":"The Levites who returned were Jeshua, Binnui, Kadmiel, Sherebiah, Judah, and Mattaniah. They and their assistants were responsible for the songs of praise, "},{"num":9,"verse":"while Bakbukiah and Unno, together with their assistants, were responsible for the choral responses."},{"header":"Descendants of Joshua the High Priest"},{"num":10,"verse":"Joshua was the father of Joiakim, the grandfather of Eliashib, and the great-grandfather of Joiada. "},{"num":11,"verse":"Joiada was the father of Jonathan and the grandfather of Jaddua."},{"header":"Leaders of the Priestly Clans"},{"num":12,"verse":"When Joiakim was high priest, the following priests were leaders of their clans: Meraiah of the Seraiah clan, Hananiah of Jeremiah, "},{"num":13,"verse":"Meshullam of Ezra, Jehohanan of Amariah, "},{"num":14,"verse":"Jonathan of Malluchi, Joseph of Shebaniah, "},{"num":15,"verse":"Adna of Harim, Helkai of Meraioth, "},{"num":16,"verse":"Zechariah of Iddo, Meshullam of Ginnethon, "},{"num":17,"verse":"Zichri of Abijah, Piltai of Moadiah, "},{"num":18,"verse":"Shammua of Bilgah, Jehonathan of Shemaiah, "},{"num":19,"verse":"Mattenai of Joiarib, Uzzi of Jedaiah, "},{"num":20,"verse":"Kallai of Sallai, Eber of Amok, "},{"num":21,"verse":"Hashabiah of Hilkiah, and Nethanel of Jedaiah."},{"header":"The Priestly and Levite Families"},{"num":22,"verse":"During the time of the high priests Eliashib, Joiada, Johanan, and Jaddua, and including the time that Darius was king of Persia, a record was kept of the heads of the Levite and priestly families. "},{"num":23,"verse":"However, no official record was kept of the heads of the Levite clans after the death of Johanan, the grandson of Eliashib."},{"num":24,"verse":"Hashabiah, Sherebiah, Jeshua son of Kadmiel, and their assistants organized two choirs of Levites to offer praises to God, just as King David, the man of God, had commanded."},{"num":25,"verse":"Mattaniah, Bakbukiah, Obadiah, Meshullam, Talmon, and Akkub were responsible for guarding the storerooms near the temple gates."},{"num":26,"verse":"All of these men lived during the time of Joiakim and during the time that I was governor and Ezra, a teacher of the Law of Moses, was priest."},{"header":"Nehemiah Dedicates the City Wall"},{"num":27,"verse":"When the city wall was dedicated, Levites from everywhere in Judah were invited to join in the celebration with songs of praise and with the music of cymbals, small harps, and other stringed instruments. "},{"num":28,"verse":"The Levite singers lived in villages around Jerusalem, and so they came from there, as well as from the villages around Netophah, Beth-Gilgal, Geba, and Azmaveth. "},{"num":30,"verse":"The priests and Levites held special ceremonies to make themselves holy, and then they did the same for the rest of the people and for the gates and walls of the city."},{"num":31,"verse":"I brought the leaders of Judah to the top of the city wall and put them in charge of the two groups that were to march around on top of the wall, singing praises to God. One group marched to the right in the direction of Garbage Gate. "},{"num":32,"verse":"Hoshaiah and half of the leaders followed them. "},{"num":33,"verse":"Then came the priests Azariah, Ezra, Meshullam, "},{"num":34,"verse":"Judah, Benjamin, Shemaiah, and Jeremiah, "},{"num":35,"verse":"all of them blowing trumpets. Next, there was Zechariah of the Asaph clan "},{"num":36,"verse":"and his relatives, Shemaiah, Azarel, Milalai, Gilalai, Maai, Nethanel, Judah, and Hanani. They played musical instruments like those that had been played by David, the man of God. And they marched behind Ezra, the teacher of the Law. "},{"num":37,"verse":"When they reached Fountain Gate, they climbed the steps to David’s City and went past his palace, before stopping at the Water Gate near the eastern wall of the city."},{"num":38,"verse":"The second group of singers marched along the wall in the opposite direction, and I followed them, together with the other half of the leaders of Judah. We went past Oven Tower, Broad Wall, "},{"num":39,"verse":"Ephraim Gate, Old Gate, Fish Gate, Hananel Tower, Hundred Tower, and on to Sheep Gate. Finally, we stopped at Gate of the Guard, "},{"num":40,"verse":"where we stood in front of the temple with the other group, praising God. In the group with me were half of the leaders, "},{"num":41,"verse":"as well as the priests Eliakim, Maaseiah, Miniamin, Micaiah, Elioenai, Zechariah, and Hananiah, who were blowing trumpets. "},{"num":42,"verse":"Maaseiah, Shemaiah, Eleazar, Uzzi, Jehohanan, Malchijah, Elam, and Ezer also stood there, as Jezrahiah led the singers. "},{"num":43,"verse":"God had made the people very happy, and so on that day they celebrated and offered many sacrifices. The women and children joined in the festivities, and joyful shouts could be heard far from the city of Jerusalem."},{"header":"Preparation for Worship"},{"num":44,"verse":"On that same day, some leaders were appointed to be responsible for the safekeeping of gifts for the temple and to be in charge of receiving the first part of the harvest and the ten percent of the crops and livestock that was offered to God. These same leaders also collected the part of crops that the Law of Moses taught was to be given to the Levites."},{"num":45,"verse":"when they performed the ceremonies to make people acceptable to worship God. And the singers and the temple guards did their jobs according to the instructions given by David and his son Solomon. "},{"num":46,"verse":"In fact, ever since the days of David and Asaph, there had been song leaders and songs of praise and worship. "},{"num":47,"verse":"During the time that Zerubbabel and I were in charge, everyone in Israel gave what they were supposed to give for the daily needs of the singers and temple guards from the Levi tribe. Then the Levites would give the priests their share from what they had received."}]