[{"header":"Legitimate Servants for the Temple"},{"num":12,"verse":"These are the priests and the Levites who came up with Zerubbabel son of Shealtiel and with Jeshua:"},{"header":"The Succession of Priests"},{"num":12,"verse":"Now in the days of Joiakim, the priests who were the heads of the families were as follows:"},{"num":22,"verse":"In the days of Eliashib, Joiada, and Johanan, and Jaddua, the Levites were recorded by the heads of families, as were the priests, until the reign of Darius the Persian. "},{"num":23,"verse":"The descendants of Levi who were heads of families were recorded in the book of the chronicles, down to the days of Johanan son of Eliashib."},{"header":"The Dedication of the Wall of Jerusalem"},{"num":27,"verse":"Now for the dedication of the wall of Jerusalem, the Levites had been invited from all their places, in order to bring them to Jerusalem to celebrate the joyful dedication with both thanksgiving hymns and with songs using cymbals, harps, and lyres. "},{"num":28,"verse":"The singers had been gathered both from the district around Jerusalem and from the villages of the Netophathites, "},{"num":29,"verse":"from Beth Gilgal, and from the countryside of Geba and Azmaveth, because the singers had built villages for themselves around Jerusalem. "},{"num":30,"verse":"The priests and the Levites purified themselves, and they purified the people, the gates, and the wall."},{"num":31,"verse":"I brought the officers of Judah up onto the wall and appointed two large thanksgiving choirs and two groups for the procession."},{"num":32,"verse":"Behind them went Hoshaiah and half of the officers of Judah, "},{"num":33,"verse":"also Azariah, Ezra, and Meshullam, "},{"num":34,"verse":"Judah and Benjamin, and Shemaiah and Jeremiah, "},{"num":35,"verse":"as well as some of the priests with trumpets, namely, Zechariah the son of Jonathan, the son of Shemaiah, the son of Mattaniah, the son of Micaiah, the son of Zakkur, the son of Asaph, "},{"num":36,"verse":"and his relatives Shemaiah, Azarel, Milalai, Gilalai, Ma’ai, Nethanel, and Judah, and Hanani with the musical instruments of David the man of God. Ezra the scribe led them. "},{"num":37,"verse":"From the Fountain Gate they went directly up the steps to the City of David, by the ascent to the wall which was above David’s house and over the Water Gate on the east."},{"num":38,"verse":"The second thanksgiving choir was assigned to go in the opposite direction. Both I and half of the people were behind it on top of the wall. They went over the Tower of the Ovens to the Broad Wall, "},{"num":39,"verse":"and over the Ephraim Gate (that is, over the Old Gate), and over the Fish Gate and the Tower of Hananel and the Tower of the Hundred, and up to the Sheep Gate, and they stood at the Guard’s Gate."},{"num":40,"verse":"The two thanksgiving choirs stood in the house of God, as did I and half of the officials with me, "},{"num":41,"verse":"as well as the priests: Eliakim, Ma’aseiah, Miniamin, Mikaiah, Elioenai, Zechariah, and Hananiah with trumpets, "},{"num":42,"verse":"and Ma’aseiah, Shemaiah, Eleazar, Uzzi, Jehohanan, and Malkijah, and Elam, and Ezer. Then the singers sang with Jezrahiah as their leader. "},{"num":43,"verse":"That day they offered great sacrifices and rejoiced because God had given them great joy. The women and children also rejoiced. The joy of Jerusalem was heard a long way away."},{"num":44,"verse":"That day men were appointed as supervisors over the storerooms, the contributions, the firstfruits, and the tithes, in order to gather the portions required by the Law for the priests and the Levites from the fields of the towns, because Judah rejoiced over the priests and Levites who carried out their duties. "},{"num":45,"verse":"They and the singers and the gatekeepers continued the service of their God and the service of purification, according to the command of David and his son Solomon, "},{"num":46,"verse":"because formerly in the days of David and Asaph, Asaph was the head of the singers and of songs of praise and thanksgiving to God. "},{"num":47,"verse":"In the days of Zerubbabel and in the days of Nehemiah, all Israel continued to give the required portions for the singers and the gatekeepers daily. They would set apart that portion which was for the Levites, and the Levites would set apart that portion which was for the descendants of Aaron."}]