[{"header":"Priests and Levites"},{"num":12,"verse":"These are the priests and Levites who ·returned [went up] with Zerubbabel son of Shealtiel and with Jeshua [Ezra 1—2]. There were Seraiah, Jeremiah, Ezra, "},{"num":2,"verse":"Amariah, Malluch, Hattush, "},{"num":3,"verse":"Shecaniah, Rehum, Meremoth, "},{"num":4,"verse":"Iddo, Ginnethon, Abijah, "},{"num":5,"verse":"Mijamin, Moadiah, Bilgah, "},{"num":6,"verse":"Shemaiah, Joiarib, Jedaiah, "},{"num":7,"verse":"Sallu, Amok, Hilkiah, and Jedaiah. They were the leaders of the priests and their ·relatives [colleagues; kinsmen; brothers] in the days of Jeshua."},{"num":8,"verse":"The Levites were Jeshua, Binnui, Kadmiel, Sherebiah, Judah, and Mattaniah. Mattaniah and his ·relatives [colleagues; kinsmen; brothers] were in charge of the songs of thanksgiving. "},{"num":9,"verse":"Bakbukiah and Unni, their ·relatives [colleagues; kinsmen; brothers], stood ·across from [opposite; as an antiphonal choir; v. 24] them in the services."},{"num":10,"verse":"Jeshua was the father of Joiakim. Joiakim was the father of Eliashib. Eliashib was the father of Joiada. "},{"num":11,"verse":"Joiada was the father of Jonathan, and Jonathan was the father of Jaddua."},{"num":12,"verse":"In the days of Joiakim, these priests were the ·leaders [heads] of the families of priests: Meraiah, from Seraiah’s family; Hananiah, from Jeremiah’s family; "},{"num":13,"verse":"Meshullam, from Ezra’s family; Jehohanan, from Amariah’s family; "},{"num":14,"verse":"Jonathan, from Malluch’s family; Joseph, from Shecaniah’s family; "},{"num":15,"verse":"Adna, from Harim’s family; Helkai, from Meremoth’s family; "},{"num":16,"verse":"Zechariah, from Iddo’s family; Meshullam, from Ginnethon’s family; "},{"num":17,"verse":"Zicri, from Abijah’s family; Piltai, from Miniamin’s and Moadiah’s families; "},{"num":18,"verse":"Shammua, from Bilgah’s family; Jehonathan, from Shemaiah’s family; "},{"num":19,"verse":"Mattenai, from Joiarib’s family; Uzzi, from Jedaiah’s family; "},{"num":20,"verse":"Kallai, from Sallu’s family; Eber, from Amok’s family; "},{"num":21,"verse":"Hashabiah, from Hilkiah’s family; and Nethanel, from Jedaiah’s family."},{"num":22,"verse":"The ·leaders [heads] of the families of the Levites and the priests were written down in the days of Eliashib, Joiada, Johanan, and Jaddua, while Darius the Persian was king. "},{"num":23,"verse":"The family ·leaders [heads] among the Levites were written down in the ·history book [Book/Scroll of the Chronicles/Annals/History] up to the time of Johanan son of Eliashib. "},{"num":24,"verse":"The ·leaders [heads] of the Levites were Hashabiah, Sherebiah, Jeshua son of Kadmiel, and their ·relatives [colleagues; kinsmen; brothers]. Their ·relatives [colleagues; kinsmen; brothers] stood ·across from [opposite] them and ·gave [offered] praise and thanksgiving. One group ·answered the [responded to the; antiphonally] other group, as David, the man of God, had ·commanded [prescribed]."},{"num":25,"verse":"These were the gatekeepers who ·guarded [kept watch at] the storerooms next to the gates: Mattaniah, Bakbukiah, Obadiah, Meshullam, Talmon, and Akkub. "},{"num":26,"verse":"They served in the days of Joiakim son of Jeshua, the son of Jozadak. They also served in the days of Nehemiah the governor and Ezra the priest and ·teacher [scribe]."},{"header":"The Wall of Jerusalem"},{"num":27,"verse":"When the wall of Jerusalem was ·offered as a gift to God [dedicated], they asked the Levites to come from wherever they lived to Jerusalem to celebrate with joy the ·gift of the wall [dedication]. They were to celebrate with ·songs [hymns] of thanksgiving and with the music of cymbals, harps, and lyres. "},{"num":28,"verse":"They also brought together ·singers [sons of singers] from all around Jerusalem, from the Netophathite ·villages [settlements], "},{"num":29,"verse":"from Beth Gilgal, and from the areas of Geba and Azmaveth. The singers had built ·villages [settlements] for themselves around Jerusalem. "},{"num":30,"verse":"The priests and Levites made themselves pure, and they also made the people, the gates, and the wall of Jerusalem pure."},{"num":31,"verse":"I had the leaders of Judah go up on top of the wall, and I appointed two large ·choruses [choirs] to give thanks. One ·chorus [choir] went to the right on top of the wall, toward the ·Trash [Garbage; Refuse; Dung] Gate. "},{"num":32,"verse":"Behind them went Hoshaiah and half the leaders of Judah. "},{"num":33,"verse":"Azariah, Ezra, Meshullam, "},{"num":34,"verse":"Judah, Benjamin, Shemaiah, and Jeremiah also went. "},{"num":35,"verse":"Some ·priests [sons of priests] with trumpets also went, along with Zechariah son of Jonathan. (Jonathan was the son of Shemaiah, the son of Mattaniah. Mattaniah was the son of Micaiah, the son of Zaccur. Zaccur was the son of Asaph.) "},{"num":36,"verse":"Zechariah’s ·relatives [colleagues; kinsmen; brothers] also went. They were Shemaiah, Azarel, Milalai, Gilalai, Maai, Nethanel, Judah, and Hanani. These men played the musical instruments of David, the man of God, and Ezra the ·teacher [scribe] ·walked in front of [led] them. "},{"num":37,"verse":"They went from the Fountain Gate straight up the steps ·to the highest part of the wall by the older part of the city [of the City of David]. They ·went on [passed] above the ·house [palace] of David to the Water Gate on the east."},{"num":38,"verse":"The second ·chorus [choir] ·went to the left [proceeded in the opposite direction], while I followed them on top of the wall with half the people. We went from the Tower of the ·Ovens [Furnaces; Firepots] to the Broad Wall, "},{"num":39,"verse":"·over [above] the Gate of Ephraim to the ·Old [Jeshanah] Gate and the Fish Gate, to the Tower of Hananel and the Tower of the Hundred. We went as far as the Sheep Gate and ·stopped [stood] at the Gate of the Guard."},{"num":40,"verse":"The two ·choruses [choirs] ·took their places [stood] at the ·Temple [house] of God. Half of the ·leaders [officials] and I did also. "},{"num":41,"verse":"These priests were there with their trumpets: Eliakim, Maaseiah, Miniamin, Micaiah, Elioenai, Zechariah, and Hananiah. "},{"num":42,"verse":"These people were also there: Maaseiah, Shemaiah, Eleazar, Uzzi, Jehohanan, Malkijah, Elam, and Ezer. The ·choruses [choirs] sang loudly, ·led [directed] by Jezrahiah. "},{"num":43,"verse":"The people offered ·many [great] sacrifices that day and ·were happy [rejoiced] because God had given them great joy. The women and children ·were happy [rejoiced]. The ·sound of happiness in [joy of; rejoicing in] Jerusalem could be heard far away."},{"num":44,"verse":"At that time men were appointed to be in charge of the storerooms. These rooms were for the ·gifts [contributions; offerings], the firstfruits [of the harvest], and the ·ten percent that the people brought [tithes]. The ·Teachings [Laws; Instructions; Torah] said they should bring a share for the priests and Levites from the fields around the towns. The people of Judah were ·happy [delighted] to do this for the priests and Levites who ·served [stood]. "},{"num":45,"verse":"They performed the service of their God ·in making things pure [or and the service of purification]. The singers and gatekeepers also did their jobs, as David had commanded [or and] his son Solomon. "},{"num":46,"verse":"·Earlier [Long ago], in the ·time [days] of David and Asaph, there was a ·leader [head; director] of the singers and of the songs of praise and [hymns of] thanksgiving to God. "},{"num":47,"verse":"So it was in the days of Zerubbabel and Nehemiah. All the people of Israel gave ·something [the daily portions] to the singers and gatekeepers, and they also ·set aside [dedicated] part for the Levites. Then the Levites ·set aside [dedicated] part for the ·descendants [sons] of Aaron."}]