[{"header":"List of Priests and Levites"},{"num":12,"verse":"The following is a list of the priests and Levites who returned from exile with Zerubbabel son of Shealtiel and with the High Priest Joshua:"},{"header":"Priests"},{"num":2,"verse":"Seraiah, Jeremiah, Ezra, Amariah, Malluch, Hattush, Shecaniah, Rehum, Meremoth, Iddo, Ginnethoi, Abijah, Mijamin, Maadiah, Bilgah, Shemaiah, Joiarib, Jedaiah, Sallu, Amok, Hilkiah, and Jedaiah."},{"header":"Levites"},{"num":8,"verse":"The following were in charge of the singing of hymns of thanksgiving: Jeshua, Binnui, Kadmiel, Sherebiah, Judah, and Mattaniah."},{"num":9,"verse":"The following formed the choir that sang the responses: Bakbukiah, Unno, and their fellow Levites."},{"header":"Descendants of the High Priest Joshua"},{"num":10,"verse":"Joshua was the father of Joiakim; Joiakim was the father of Eliashib; Eliashib was the father of Joiada; "},{"num":11,"verse":"Joiada was the father of Jonathan; and Jonathan was the father of Jaddua."},{"header":"Heads of the Priestly Clans"},{"num":12,"verse":"When Joiakim was High Priest, the following priests were the heads of the priestly clans:"},{"header":"Record of the Priestly and Levite Families"},{"num":22,"verse":"A record was kept of the heads of the Levite families and of the priestly families during the lifetimes of the following High Priests: Eliashib, Joiada, Jonathan, and Jaddua. This record was finished when Darius was emperor of Persia."},{"num":23,"verse":"The heads of the Levite families, however, were recorded in the official records only until the time of Jonathan, the grandson of Eliashib."},{"header":"Assignment of Duties in the Temple"},{"num":24,"verse":"Under the direction of Hashabiah, Sherebiah, Jeshua, Binnui, and Kadmiel, the Levites were organized into groups. Two groups at a time praised God responsively and gave thanks to him, in accordance with the instructions given by King David, the man of God."},{"num":25,"verse":"The following Temple guards were in charge of guarding the storerooms by the gates to the Temple: Mattaniah, Bakbukiah, Obadiah, Meshullam, Talmon, and Akkub."},{"num":26,"verse":"These people lived during the time of Joiakim, the son of Joshua and grandson of Jehozadak, and the time of Nehemiah the governor, and the time of Ezra, the priest who was a scholar of the Law."},{"header":"Nehemiah Dedicates the City Wall"},{"num":27,"verse":"When the city wall of Jerusalem was dedicated, the Levites were brought in from wherever they were living, so that they could join in celebrating the dedication with songs of thanksgiving and with the music of cymbals and harps. "},{"num":28,"verse":"The Levite families of singers gathered from the area where they had settled around Jerusalem and from the towns around Netophah, "},{"num":29,"verse":"and from Bethgilgal, Geba, and Azmaveth. "},{"num":30,"verse":"The priests and the Levites performed ritual purification for themselves, the people, the gates, and the city wall."},{"num":31,"verse":"I assembled the leaders of Judah on top of the wall and put them in charge of two large groups to march around the city, giving thanks to God."},{"num":32,"verse":"Hoshaiah marched behind the singers, followed by half the leaders of Judah. "},{"num":33,"verse":"The following priests, blowing trumpets, marched next: Azariah, Ezra, Meshullam, Judah, Benjamin, Shemaiah, and Jeremiah. Next came Zechariah, the son of Jonathan and grandson of Shemaiah. (His ancestors also included Mattaniah, Micaiah, and Zaccur, of the clan of Asaph.) "},{"num":36,"verse":"He was followed by other members of his clan—Shemaiah, Azarel, Milalai, Gilalai, Maai, Nethanel, Judah, and Hanani—all of whom carried musical instruments of the kind played by King David, the man of God. Ezra the scholar led this group in the procession. "},{"num":37,"verse":"At the Fountain Gate they went up the steps that led to David's City, past David's palace, and back to the wall at the Water Gate, on the east side of the city."},{"num":38,"verse":"The other group of those who gave thanks went to the left along the top of the wall, and I followed with half of the people. We marched past the Tower of the Ovens to the Broad Wall, "},{"num":39,"verse":"and from there we went past Ephraim Gate, Jeshanah Gate, the Fish Gate, the Tower of Hananel, and the Tower of the Hundred, to the Sheep Gate. We ended our march near the gate to the Temple."},{"num":40,"verse":"So both the groups that were giving thanks to God reached the Temple area."},{"num":41,"verse":"my group included the following priests, blowing trumpets: Eliakim, Maaseiah, Miniamin, Micaiah, Elioenai, Zechariah, and Hananiah; "},{"num":42,"verse":"and they were followed by Maaseiah, Shemaiah, Eleazar, Uzzi, Jehohanan, Malchijah, Elam, and Ezer. The singers, led by Jezrahiah, sang at the top of their voices."},{"num":43,"verse":"That day many sacrifices were offered, and the people were full of joy because God had made them very happy. The women and the children joined in the celebration, and the noise they all made could be heard for miles."},{"header":"Providing for Worship in the Temple"},{"num":44,"verse":"At that time men were put in charge of the storerooms where contributions for the Temple were kept, including the tithes and the first grain and fruit that ripened each year. These men were responsible for collecting from the farms near the various cities the contributions for the priests and the Levites which the Law required. All the people of Judah were pleased with the priests and the Levites, "},{"num":45,"verse":"because they performed the ceremonies of purification and the other rituals that God had commanded. The Temple musicians and the Temple guards also performed their duties in accordance with the regulations made by King David and his son Solomon. "},{"num":46,"verse":"From the time of King David and the musician Asaph long ago, the musicians have led songs of praise and thanksgiving to God. "},{"num":47,"verse":"In the time of Zerubbabel and also in the time of Nehemiah, all the people of Israel gave daily gifts for the support of the Temple musicians and the Temple guards. The people gave a sacred offering to the Levites, and the Levites gave the required portion to the priests."}]