[{"header":"Identifying the Kohanim and Levites"},{"num":12,"verse":"Now these are the kohanim and the Levites who returned with Zerubbabel son of Shealtiel, and Jeshua: Seraiah, Jeremiah, Ezra, "},{"num":2,"verse":"Amariah, Malluch, Hattush, "},{"num":3,"verse":"Shecaniah, Rehum, Meremot, "},{"num":4,"verse":"Iddo, Ginnethoi, Abijah, "},{"num":5,"verse":"Mijamin, Maadiah, Bilgah, "},{"num":6,"verse":"Shemaiah, Joiarib, Jedaiah, "},{"num":7,"verse":"Sallu, Amok, Hilkiah, and Jedaiah. These were the leaders of the kohanim and their brothers in the days of Jeshua."},{"num":8,"verse":"The Levites were Jeshua, Binnui, Kadmiel, Sherebiah, Judah, and also Mattaniah—he and his brothers conducted the songs of praise—"},{"num":9,"verse":"and Bakbukiah and Unni, their brothers, were opposite them in ranks. "},{"num":10,"verse":"Jeshua fathered Joiakim, Joiakim fathered Eliashib, Eliashib fathered Joiada, "},{"num":11,"verse":"Joiada fathered Jonathan, and Jonathan fathered Jaddua."},{"num":12,"verse":"In the days of Joiakim, the family leaders of the kohanim were: Meraiah for Seraiah, Hananiah for Jeremiah, "},{"num":13,"verse":"Meshullam for Ezra, Jehohanan for Amariah, "},{"num":14,"verse":"Jonathan for Melicu, Joseph for Shebaniah, "},{"num":15,"verse":"Adna for Harim, Helkai for Meraiot, "},{"num":16,"verse":"Zechariah for Iddo, Meshullam for Ginnethon, "},{"num":17,"verse":"Zichri for Abijah, Piltai for Miniamin and Moadiah, "},{"num":18,"verse":"Shammua for Bilgah, Jehonathan for Shemaiah, "},{"num":19,"verse":"Mattenai for Joiarib, Uzzi for Jedaiah, "},{"num":20,"verse":"Kallai for Sallai, Eber for Amok, "},{"num":21,"verse":"Hashabiah for Hilkiah, and Nethanel for Jedaiah."},{"num":22,"verse":"The family heads of the Levites were recorded in the days of Eliashib, Joiada, and Johanan, and Jaddua, as well as for the kohanim, up until the reign of Darius the Persian. "},{"num":23,"verse":"The family leaders among the sons of Levi were recorded in the Book of the Chronicles up to the days of Johanan son of Eliashib."},{"num":24,"verse":"So the leaders of the Levites were: Hashabiah, Sherebiah, and Jeshua son of Kadmiel, with their brothers facing them, to give praise and thanks, according to the commandment of David the man of God, one section responding to the other. "},{"num":25,"verse":"Mattaniah, Bakbukiah, Obadiah, Meshullam, Talmon, and Akkub were gatekeepers guarding the storehouses at the gates. "},{"num":26,"verse":"These served in the days of Joiakim son of Jeshua, son of Jozadak, in the days of Nehemiah the governor, and of Ezra the kohen-scribe."},{"header":"Dedicating the Wall"},{"num":27,"verse":"At the dedication of the wall of Jerusalem, they sought out Levites from all their places to bring them to Jerusalem to celebrate the dedication with joy and thanksgiving, and songs with cymbals, harps and lyres. "},{"num":28,"verse":"The companies of singers were also assembled from the district around Jerusalem and from the Netophathite villages, "},{"num":29,"verse":"and from Beth-gilgal, and from the fields of Geba and Azmavet, for the singers had built communities for themselves round about Jerusalem."},{"num":30,"verse":"After the kohanim and the Levites had purified themselves, they purified the people, the gates, and the wall. "},{"num":31,"verse":"Then I led the leaders of Judah up on the wall, and I appointed two great choirs to give thanks. One of the processions went to the right on the wall toward the Dung Gate, "},{"num":32,"verse":"and going after them, Hoshaiah and half of the leaders of Judah—"},{"num":33,"verse":"Azariah, Ezra, and Meshullam, "},{"num":34,"verse":"Judah, Benjamin, Shemaiah and Jeremiah, "},{"num":35,"verse":"some of the kohanim with trumpets, Zechariah son of Jonathan, son of Shemaiah, son of Mattaniah, son of Micaiah, son of Zaccur, son of Asaph, "},{"num":36,"verse":"and his brothers, Shemaiah, Azarel, Milalai, Gilalai, Maai, Nethanel, Judah and Hanani—all with the musical instruments of David the man of God—and Ezra the scribe was ahead of them. "},{"num":37,"verse":"They went over the Fountain Gate and continued up the stairs of the city of David at the ascent to the wall, and passed, above the house of David all the way to the Water Gate toward the east."},{"num":38,"verse":"The second thanksgiving choir proceeded to the left. I followed them, along with half of the people on the wall above the Tower of the Furnaces as far as the Broad Wall, "},{"num":39,"verse":"over the Ephraim Gate, the gate of the old city, the Fish Gate, the Tower of Hananel and the Tower of the Hundred, to the Sheep Gate. They stopped at the Gate of the Guard."},{"num":40,"verse":"So the two thanksgiving choirs stood in the House of God. "},{"num":41,"verse":"So did I along with half the officials with me, and the kohanim—Eliakim, Maaseiah, Miniamin, Micaiah, Elioenai, Zechariah, and Hananiah with their trumpets—"},{"num":42,"verse":"and also Maaseiah, Shemaiah, Eleazar, Uzzi, Jehohanan, Malchijah, Elam and Ezer. The singers sang under the direction of Jezrahiah. "},{"num":43,"verse":"On that day they offered great sacrifices and rejoiced, for God had given them great joy. The women and children also rejoiced. The joy in Jerusalem could be heard from far off."},{"num":44,"verse":"On that day men were appointed over the storehouses for the offerings, firstfruits and tithes. They were to gather into them the portions from the fields of the cities required by the Torah for the kohanim and the Levites. For Judah delighted in the kohanim and in the Levites who were ministering. "},{"num":45,"verse":"They kept the ceremonial functions of their God and the ceremony of the purification according to the command of David and of Solomon his son. "},{"num":46,"verse":"For of old, in the days of David and Asaph, there were leaders of the singers who sang songs of praise and thanksgiving to God."},{"num":47,"verse":"So in the days of Zerubbabel and of Nehemiah, all Israel gave daily portions for the singers and the gatekeepers. They also set apart the portion for the Levites, and the Levites set apart the portion for the sons of Aaron."}]