[{"num":3,"verse":"That is to say, If a man puts away his wife and she goes from him and becomes another man’s, will he return to her again? [Of course not!] Would not that land [where such a thing happened] be greatly polluted? But you have played the harlot [against Me] with many lovers—yet would you now return to Me? says the Lord [or do you even think to return to Me?]"},{"num":2,"verse":"Lift up your eyes to the bare heights and see. Where have you not been adulterously lain with? By the wayside you have sat waiting for lovers [eager for idolatry], like an Arabian [desert tribesman who waits to plunder] in the wilderness; and you have polluted the land with your vile harlotry and your wickedness (unfaithfulness and disobedience to God)."},{"num":3,"verse":"Therefore the showers have been withheld, and there has been no spring rain. Yet you have the brow of a prostitute; you refuse to be ashamed."},{"num":4,"verse":"Have you not just now cried to Me: My Father, You were the guide and companion of my youth?"},{"num":5,"verse":"Will He retain His anger forever? Will He keep it to the end? Behold, you have so spoken, but you have done all the evil things you could and have had your way and have carried them through."},{"num":6,"verse":"Moreover, the Lord said to me [Jeremiah] in the days of Josiah the king [of Judah], Have you seen what that faithless and backsliding Israel has done—how she went up on every high hill and under every green tree and there played the harlot?"},{"num":7,"verse":"And I said, After she has done all these things, she will return to Me; but she did not return, and her faithless and treacherous sister Judah saw it."},{"num":8,"verse":"And I saw, even though [Judah knew] that for this very cause of committing adultery (idolatry) I [the Lord] had put faithless Israel away and given her a bill of divorce; yet her faithless and treacherous sister Judah was not afraid, but she also went and played the harlot [following after idols]."},{"num":9,"verse":"And through the infamy and unseemly frivolity of Israel’s whoredom [because her immorality mattered little to her], she polluted and defiled the land, [by her idolatry] committing adultery with [idols of] stones and trees."},{"num":10,"verse":"But in spite of all this, her faithless and treacherous sister Judah did not return to Me in sincerity and with her whole heart, but only in sheer hypocrisy [has she feigned obedience to King Josiah’s reforms], says the Lord."},{"num":11,"verse":"And the Lord said to me, Backsliding and faithless Israel has shown herself less guilty than false and treacherous Judah."},{"num":12,"verse":"Go and proclaim these words toward the north [where the ten tribes have been taken as captives] and say, Return, faithless Israel, says the Lord, and I will not cause My countenance to fall and look in anger upon you, for I am merciful, says the Lord; I will not keep My anger forever."},{"num":13,"verse":"Only know, understand, and acknowledge your iniquity and guilt—that you have rebelled and transgressed against the Lord your God and have scattered your favors among strangers under every green tree, and you have not obeyed My voice, says the Lord."},{"num":14,"verse":"Return, O faithless children [of the whole twelve tribes], says the Lord, for I am Lord and Master and Husband to you, and I will take you [not as a nation, but individually]—one from a city and two from a tribal family—and I will bring you to Zion."},{"num":15,"verse":"And I will give you [spiritual] shepherds after My own heart [in the final time], who will feed you with knowledge and understanding and judgment."},{"num":16,"verse":"And it shall be that when you have multiplied and increased in the land in those days, says the Lord, they shall no more say, The ark of the covenant of the Lord. It shall not come to mind, nor shall they [seriously] remember it, nor shall they miss or visit it, nor shall it be repaired or made again [for instead of the ark, which represented God’s presence, He will show Himself to be present throughout the city]."},{"num":17,"verse":"At that time they shall call Jerusalem The Throne of the Lord, and all the nations shall be gathered to it, in the renown and name of the Lord, to Jerusalem; nor shall they walk any more after the stubbornness of their own evil hearts."},{"num":18,"verse":"In those days the house of Judah shall walk with the house of Israel, and together they shall come out of the land of the north to the land that I gave as an inheritance to your fathers."},{"num":19,"verse":"And I thought how [gloriously and honorably] I would set you among My children and give you a pleasant land, a goodly heritage, the most beautiful and best [inheritance] among all nations! And I thought you would call Me My Father and would not turn away from following Me."},{"num":20,"verse":"Surely, as a wife treacherously and faithlessly departs from her husband, so have you dealt treacherously and faithlessly with Me, O house of Israel, says the Lord."},{"num":21,"verse":"A voice is heard on the bare heights, the weeping and pleading of the sons of Israel, because they have perverted their ways, they have [eagerly] forgotten the Lord their God."},{"num":22,"verse":"Return, O faithless sons, [says the Lord, and] I will heal your faithlessness. [And they answer] Behold, we come to You, for You are the Lord our God."},{"num":23,"verse":"Truly in vain is the hope of salvation from the hills and from the tumult and noisy throng on the mountains; truly in and with the Lord our God rests the salvation of Israel."},{"num":24,"verse":"[We have been ruined as a nation by our faithlessness and idolatry] for the shameful thing has consumed all for which our fathers toiled from our youth—their flocks and their herds, their sons and their daughters."},{"num":25,"verse":"Let us lie prostrate in our shame, and let our dishonor and confusion cover us; for we have sinned against the Lord our God, we and our fathers; from our youth even to this day we have not obeyed the voice of the Lord our God."}]