[{"header":"Unfaithful Israel"},{"num":3,"verse":"The Lord says, “If a man divorces his wife, and she leaves him and becomes another man's wife, he cannot take her back again. This would completely defile the land. But, Israel, you have had many lovers, and now you want to return to me! "},{"num":2,"verse":"Look up at the hilltops. Is there any place where you have not acted like a prostitute? You waited for lovers along the roadside, as an Arab waits for victims in the desert. You have defiled the land with your prostitution. "},{"num":3,"verse":"That is why the rains were held back, and the spring showers did not come. You even look like a prostitute; you have no shame."},{"num":4,"verse":"“And now you say to me, ‘You are my father, and you have loved me ever since I was a child. "},{"num":5,"verse":"You won't always be angry; you won't be mad at me forever.’ Israel, that is what you said, but you did all the evil you could.”"},{"header":"Israel and Judah Must Repent"},{"num":6,"verse":"When Josiah was king, the Lord said to me, “Have you seen what Israel, that unfaithful woman, has done? She has turned away from me, and on every high hill and under every green tree she has acted like a prostitute. "},{"num":7,"verse":"I thought that after she had done all this, she would surely return to me. But she did not return, and her unfaithful sister Judah saw it all. "},{"num":8,"verse":"Judah also saw that I divorced Israel and sent her away because she had turned from me and had become a prostitute. But Judah, Israel's unfaithful sister, was not afraid. She too became a prostitute "},{"num":9,"verse":"and was not at all ashamed. She defiled the land, and she committed adultery by worshiping stones and trees. "},{"num":10,"verse":"And after all this, Judah, Israel's unfaithful sister, only pretended to return to me; she was not sincere. I, the Lord, have spoken.”"},{"num":11,"verse":"Then the Lord told me that, even though Israel had turned away from him, she had proved to be better than unfaithful Judah. "},{"num":12,"verse":"He told me to go and say to Israel, “Unfaithful Israel, come back to me. I am merciful and will not be angry; I will not be angry with you forever. "},{"num":13,"verse":"Only admit that you are guilty and that you have rebelled against the Lord, your God. Confess that under every green tree you have given your love to foreign gods and that you have not obeyed my commands. I, the Lord, have spoken."},{"num":14,"verse":"“Unfaithful people, come back; you belong to me. I will take one of you from each town and two from each clan, and I will bring you back to Mount Zion. "},{"num":15,"verse":"I will give you rulers who obey me, and they will rule you with wisdom and understanding. "},{"num":16,"verse":"Then when you have become numerous in that land, people will no longer talk about my Covenant Box. They will no longer think about it or remember it; they will not even need it, nor will they make another one. "},{"num":17,"verse":"When that time comes, Jerusalem will be called ‘The Throne of the Lord,’ and all nations will gather there to worship me. They will no longer do what their stubborn and evil hearts tell them. "},{"num":18,"verse":"Israel will join with Judah, and together they will come from exile in the country in the north and will return to the land that I gave your ancestors as a permanent possession.”"},{"header":"The Idolatry of God's People"},{"num":19,"verse":"The Lord says,"},{"num":23,"verse":"We were not helped at all by our pagan worship on the hilltops. Help for Israel comes only from the Lord our God. "},{"num":24,"verse":"But the worship of Baal, the god of shame, has made us lose flocks and herds, sons and daughters—everything that our ancestors have worked for since ancient times. "},{"num":25,"verse":"We should lie down in shame and let our disgrace cover us. We and our ancestors have always sinned against the Lord our God; we have never obeyed his commands.”"}]