[{"header":"Great Generosity"},{"num":8,"verse":"Now, brothers and sisters, we want to tell you about the grace of God which has been evident in the churches of Macedonia [awakening in them a longing to contribute]; "},{"num":2,"verse":"for during an ordeal of severe distress, their abundant joy and their deep poverty [together] overflowed in the wealth of their lavish generosity. "},{"num":3,"verse":"For I testify that according to their ability, and beyond their ability, they gave voluntarily, "},{"num":4,"verse":"begging us insistently for the privilege of participating in the service for [the support of] the saints [in Jerusalem]. "},{"num":5,"verse":"Not only [did they give materially] as we had hoped, but first they gave themselves to the Lord and to us [as His representatives] by the will of God [disregarding their personal interests and giving as much as they possibly could]. "},{"num":6,"verse":"So we urged Titus that, as he began it, he should also complete this gracious work among you as well."},{"num":7,"verse":"But just as you excel in everything, [and lead the way] in faith, in speech, in knowledge, in genuine concern, and in your love for us, see that you excel in this gracious work [of giving] also. "},{"num":8,"verse":"I am not saying this as a command [to dictate to you], but to prove, by [pointing out] the enthusiasm of others, the sincerity of your love as well. "},{"num":9,"verse":"For you are recognizing [more clearly] the grace of our Lord Jesus Christ [His astonishing kindness, His generosity, His gracious favor], that though He was rich, yet for your sake He became poor, so that by His poverty you might become rich (abundantly blessed). "},{"num":10,"verse":"I give you my opinion in this matter: this is to your advantage, who were the first to begin a year ago not only to take action [to help the believers in Jerusalem], but also [the first] to desire to do it. "},{"num":11,"verse":"So now finish this, so that your eagerness in desiring it may be equaled by your completion of it, according to your ability. "},{"num":12,"verse":"For if the eagerness [to give] is there, it is acceptable according to what one has, not according to what he does not have. "},{"num":13,"verse":"For it is not [intended] that others be relieved [of their responsibility] and that you be burdened [unfairly], but that there be equality [in sharing the burden]— "},{"num":14,"verse":"at this present time your surplus [over necessities] is going to supply their need, so that [at some other time] their surplus may be given to supply your need, that there may be equality; "},{"num":15,"verse":"as it is written [in Scripture], “He who gathered much did not have too much, and he who gathered little did not lack.”"},{"num":16,"verse":"But thanks be to God who puts the same genuine concern for you in the heart of Titus. "},{"num":17,"verse":"For Titus not only accepted our appeal, but was so very interested in you that he has gone to visit you of his own accord. "},{"num":18,"verse":"And we have sent along with him the brother who is praised in the gospel [ministry] throughout all the churches; "},{"num":19,"verse":"and not only this, but he has also been appointed by the churches to travel with us in regard to this gracious offering which we are administering for the glory of the Lord Himself, and to show our eagerness [as believers to help one another]. "},{"num":20,"verse":"We are taking precaution so that no one will [find anything with which to] discredit us in our administration of this generous gift. "},{"num":21,"verse":"For we have regard for what is honorable [and above suspicion], not only in the sight of the Lord, but also in the sight of men. "},{"num":22,"verse":"We have sent with them our brother, whom we have often tested and found to be diligent in many things, but who is now even more diligent [than ever] because of his great confidence in you. "},{"num":23,"verse":"As for Titus, he is my partner and fellow worker in your service; and as for the [other two] brothers, they are [special] messengers of the churches, a glory and credit to Christ. "},{"num":24,"verse":"Therefore, show these men, in the sight of the churches, the proof of your love and our reason for being proud of you."}]