[{"num":8,"verse":"1 He exhorteth them by the example of the Macedonians, 9 and also even of Christ himself, 14 to be liberal towards the saints: 16 for which purpose, he showeth that Titus, 18 and another brother came unto them."},{"num":1,"verse":"We do you also to wit, brethren, of the grace of God bestowed upon the Churches of Macedonia."},{"num":2,"verse":"Because in great trial of affliction their joy abounded, and their most extreme poverty abounded unto their rich liberality."},{"num":3,"verse":"For to their power (I bear record) yea, and beyond their power they were willing."},{"num":4,"verse":"And prayed us with great instance that we would receive the grace, and fellowship of the ministering which is toward the Saints."},{"num":5,"verse":"And this they did, not as we looked for: but gave their own selves, first to the Lord, and after unto us by the will of God,"},{"num":6,"verse":"That we should exhort Titus, that as he had begun, so he would also accomplish the same grace among you also."},{"num":7,"verse":"Therefore, as ye abound in everything, in faith and word, and knowledge, and in all diligence, and in your love towards us, even so see that ye abound in this grace also."},{"num":8,"verse":"This say I not by commandment, but because of the diligence of others: therefore prove I the naturalness of your love."},{"num":9,"verse":"For ye know the grace of our Lord Jesus Christ, that he being rich, for your sakes became poor, that ye through his poverty might be made rich."},{"num":10,"verse":"And I show my mind herein: for this is expedient for you, which have begun not to do only, but also to will, a year ago."},{"num":11,"verse":"Now therefore perform to do it also, that as there was a readiness to will, even so ye may perform it of that which ye have."},{"num":12,"verse":"For if there be first a willing mind, it is accepted according to that a man hath, and not according to that he hath not."},{"num":13,"verse":"Neither is it that other men should be eased and you grieved: But upon like condition, at this time your abundance supplieth their lack:"},{"num":14,"verse":"That also their abundance may be for your lack, that there may be equality."},{"num":15,"verse":"As it is written, He that gathered much, had nothing over, and he that gathered little, had not the less."},{"num":16,"verse":"And thanks be unto God, which had put in the heart of Titus the same care for you."},{"num":17,"verse":"Because he accepted the exhortation, yea, he was so careful that of his own accord he went unto you."},{"num":18,"verse":"And we have sent also with him the brother, whose praise is in the Gospel throughout all the Churches."},{"num":19,"verse":"(And not so only, but is also chosen of the Churches to be a fellow in our journey, concerning this grace that is ministered by us unto the glory of the same Lord, and declaration of your prompt mind.)"},{"num":20,"verse":"Avoiding this, that no man should blame us in this abundance that is ministered by us,"},{"num":21,"verse":"Providing for honest things, not only before the Lord, but also before men."},{"num":22,"verse":"And we have sent with them our brother, whom we have ofttimes proved to be diligent in many things, but now much more diligent, for the great confidence, which I have in you."},{"num":23,"verse":"Whether any do inquire of Titus, he is my fellow and helper to you-ward: or of our brethren, they are messengers of the Churches, and the glory of Christ."},{"num":24,"verse":"Wherefore show toward them, and before the Churches the proof of your love, and of the rejoicing that we have of you."}]