[{"num":8,"verse":"We  want  you hymeis to  know gnōrizō,  · de brothers adelphos,  about  the ho grace charis of ho God theos · ho shown didōmi among en the ho churches ekklēsia of ho Macedonia Makedonia, "},{"num":2,"verse":"how  that hoti in en a  severe polys test dokimē of  affliction thlipsis,  the ho fullness perisseia of ho their autos joy chara and kai · ho their autos extreme kata bathos poverty ptōcheia have  overflowed perisseuō in eis the ho richness ploutos of ho their autos generosity haplotēs. "},{"num":3,"verse":"For hoti—as  I  can  testify martyreō—they gave  according  to kata their  means dynamis,  and kai even  beyond para their  means dynamis;  acting  spontaneously authairetos, "},{"num":4,"verse":"begging deomai us hēmeis with meta great polys insistence paraklēsis for  the ho privilege charis of  · kai · ho joining koinōnia in  this ho ministry diakonia · ho to eis the ho saints hagios. "},{"num":5,"verse":"And kai they did this,  not ou simply  as kathōs we  had  hoped elpizō,  but alla first prōton they  gave didōmi themselves heautou to  the ho Lord kyrios and kai then  to  us hēmeis,  by dia the  will thelēma of  God theos. "},{"num":6,"verse":"So eis we hēmeis urged parakaleō Titus Titos that hina just  as kathōs he  had  previously  begun  the  work proenarchomai,  so houtōs now kai he  should  complete epiteleō this houtos act  of  kindness charis among eis you hymeis.  · kai · ho"},{"num":7,"verse":"But alla as hōsper you  excel perisseuō in en everything pas— in  faith pistis,  · kai in  speech logos,  · kai in  knowledge gnōsis,  · kai in  all pas eagerness spoudē,  and kai in  the ho love agapē we hēmeis have  aroused ek in en you hymeis—make sure  that hina · kai you  excel perisseuō in en this houtos · ho act  of  kindness charis. "},{"num":8,"verse":"I  am legō not ou saying legō this  as kata an  order epitagē,  but alla as  a  way  of  testing dokimazō the ho genuineness gnēsios of ho your hymeteros love agapē by  comparison dia with  the ho eagerness spoudē of  others heteros.  · kai"},{"num":9,"verse":"For gar you  know ginōskō the ho grace charis of ho our hēmeis Lord kyrios Jesus Iēsous Christ Christos,  that hoti though  he  was eimi rich plousios, yet  for dia your hymeis sakes  he  became  poor ptōcheuō,  so  that hina you hymeis by ho his ekeinos poverty ptōcheia might  become  rich plouteō. "},{"num":10,"verse":"And kai in en this  matter houtos I  am  giving didōmi my  opinion gnōmē;  for gar this houtos is  beneficial sympherō for  you hymeis,  who hostis last  year perysi not ou only monon began proenarchomai to  do poieō this work  but alla also kai to  desire thelō to do it. "},{"num":11,"verse":"So de now nyni · kai finish epiteleō doing poieō it,  so  that hopōs your ho readiness prothumia in  desiring thelō it  may  be  matched houtōs · kai by  your  completing epiteleō it,  as ek your  means  allow echō. "},{"num":12,"verse":"For gar if ei the ho readiness prothumia is  present prokeimai, the gift is  acceptable euprosdektos according katho to  whatever ean a person  has echō,  not ou according  to katho what  he  does  not ou have echō. "},{"num":13,"verse":"For gar this is  not ou for hina the  ease anesis of  others allos and a  burden thlipsis for  you hymeis,  but alla a  matter  of ek equality isotēs; "},{"num":14,"verse":"at en the ho present nyn time kairos · ho your hymeis abundance perisseuma should  supply eis what ho they ekeinos need hysterēma,  so  that hina then kai · ho their ekeinos abundance perisseuma may ginomai supply eis · ho your hymeis need hysterēma;  in  this  way hopōs there  will  be ginomai equality isotēs. "},{"num":15,"verse":"As kathōs it  is  written graphō, “ The ho one who gathered  · ho much polys did  not ou have  a  surplus pleonazō,  and kai the ho one who gathered  · ho little oligos did  not ou have  too  little elattoneō.” "},{"num":16,"verse":"But de thanks charis be  to ho God theos who ho put didōmi the ho same autos eagerness spoudē on hyper your hymeis behalf  in en the ho heart kardia of  Titus Titos, "},{"num":17,"verse":"because hoti he dechomai not  only men accepted dechomai our ho request paraklēsis,  but de being  very  eager spoudaios and  acting hyparchō on  his  own  initiative authairetos,  he  is  on  his  way exerchomai to pros you hymeis. "},{"num":18,"verse":"And de we  sent  along sympempō with meta him autos the ho brother adelphos who hos is  · ho highly  respected epainos throughout dia all pas the ho churches ekklēsia for his work  in en the ho gospel euangelion. "},{"num":19,"verse":"And de not ou only monon this,  but alla · kai he  has  been  appointed cheirotoneō by hypo the ho churches ekklēsia to be  our hēmeis traveling  companion synekdēmos as  we hēmeis carry  out diakoneō · ho this houtos act  of  kindness charis · ho for pros the ho glory doxa of  the ho Lord kyrios himself autos,  and kai to show  our hēmeis readiness prothumia. "},{"num":20,"verse":"We  are  taking  this houtos precaution stellō so that  no mē one tis should  blame mōmaomai us hēmeis for the way  we hēmeis are  administering diakoneō · ho this houtos generous  gift hadrotēs,  · ho"},{"num":21,"verse":"for gar we  are  concerned pronoeō to  do  what  is  right kalos,  not ou only monon before enōpion the  Lord kyrios but alla also kai before enōpion men anthrōpos. "},{"num":22,"verse":"And de we  are  sending  along  with sympempō them autos · ho our hēmeis brother adelphos whom hos we  have  often pollakis tested dokimazō in en many polys matters  and found  to  be eimi eager spoudaios,  and de now nyni he is  all polys the  more  eager spoudaios because  of  his  great polys confidence pepoithēsis · ho in eis you hymeis. "},{"num":23,"verse":"As eite for hyper Titus Titos, he is  my emos companion koinōnos and kai fellow  worker synergos among eis you hymeis.  As eite for  our hēmeis brothers adelphos, they are  delegates apostolos of  the  churches ekklēsia, an  honor doxa to  Christ Christos. "},{"num":24,"verse":"Therefore oun show endeiknymi them autos openly endeiknymi before prosōpon the ho churches ekklēsia the ho proof endeixis of ho your hymeis love agapē and kai the reason for  our hēmeis pride kauchēsis in hyper you hymeis. "}]