[{"num":9,"verse":"So he stepped into a boat, crossed the lake again and came to his own town. "},{"num":2,"verse":"Some people brought him a paralyzed man lying on a mattress. When Yeshua saw their trust, he said to the paralyzed man, “Courage, son! Your sins are forgiven.” "},{"num":3,"verse":"On seeing this, some of the Torah-teachers said among themselves, “This man is blaspheming!” "},{"num":4,"verse":"Yeshua, knowing what they were thinking, said, “Why are you entertaining evil thoughts in your hearts? "},{"num":5,"verse":"Tell me, which is easier to say — ‘Your sins are forgiven’ or ‘Get up and walk’? "},{"num":6,"verse":"But look! I will prove to you that the Son of Man has authority on earth to forgive sins.” He then said to the paralyzed man, “Get up, pick up your mattress, and go home!” "},{"num":7,"verse":"And the man got up and went home. "},{"num":8,"verse":"When the crowds saw this, they were awestruck and said a b’rakhah to God the Giver of such authority to human beings."},{"num":9,"verse":"As Yeshua passed on from there he spotted a tax-collector named Mattityahu sitting in his collection booth. He said to him, “Follow me!” and he got up and followed him."},{"num":10,"verse":"While Yeshua was in the house eating, many tax-collectors and sinners came and joined him and his talmidim at the meal. "},{"num":11,"verse":"When the P’rushim saw this, they said to his talmidim, “Why does your rabbi eat with tax-collectors and sinners?” "},{"num":12,"verse":"But Yeshua heard the question and answered, “The ones who need a doctor aren’t the healthy but the sick. "},{"num":13,"verse":"As for you, go and learn what this means: ‘I want compassion rather than animal-sacrifices.’ For I didn’t come to call the ‘righteous,’ but sinners!”"},{"num":14,"verse":"Next, Yochanan’s talmidim came to him and asked, “Why is it that we and the P’rushim fast frequently, but your talmidim don’t fast at all?” "},{"num":15,"verse":"Yeshua said to them, “Can wedding guests mourn while the bridegroom is still with them? But the time will come when the bridegroom is taken away from them; then they will fast. "},{"num":16,"verse":"No one patches an old coat with a piece of unshrunk cloth, because the patch tears away from the coat and leaves a worse hole. "},{"num":17,"verse":"Nor do people put new wine in old wineskins; if they do, the skins burst, the wine spills and the wineskins are ruined. No, they pour new wine into freshly prepared wineskins, and in this way both are preserved.”"},{"num":18,"verse":"While he was talking, an official came in, kneeled down in front of him and said, “My daughter has just died. But if you come and lay your hand on her, she will live.” "},{"num":19,"verse":"Yeshua, with his talmidim, got up and followed him."},{"num":20,"verse":"A woman who had had a hemorrhage for twelve years approached him from behind and touched the tzitzit on his robe. "},{"num":21,"verse":"For she said to herself, “If I can only touch his robe, I will be healed.” "},{"num":22,"verse":"Yeshua turned, saw her and said, “Courage, daughter! Your trust has healed you.” And she was instantly healed."},{"num":23,"verse":"When Yeshua arrived at the official’s house and saw the flute-players, and the crowd in an uproar, "},{"num":24,"verse":"he said, “Everybody out! The girl isn’t dead, she’s only sleeping!” And they jeered at him. "},{"num":25,"verse":"But after the people had been put outside, he entered and took hold of the girl’s hand, and she got up. "},{"num":26,"verse":"News of this spread through all that region."},{"num":27,"verse":"As Yeshua went on from there, two blind men began following him, shouting, “Son of David! Take pity on us!” "},{"num":28,"verse":"When he entered the house, the blind men came up, and Yeshua said to them, “Do you believe that I have the power to do this?” They replied, “Yes, sir.” "},{"num":29,"verse":"Then he touched their eyes and said, “Let it happen to you according to your trust”; "},{"num":30,"verse":"and their sight was restored. Yeshua warned them severely, “See that no one knows about it.” "},{"num":31,"verse":"But instead, they went away and talked about him throughout that district."},{"num":32,"verse":"As they were going, a man controlled by a demon and unable to speak was brought to Yeshua. "},{"num":33,"verse":"After the demon was expelled the man who had been mute spoke, and the crowds were amazed. “Nothing like this has ever been seen in Isra’el,” they said. "},{"num":34,"verse":"But the P’rushim said, “It is through the ruler of the demons that he expels demons.”"},{"num":35,"verse":"Yeshua went about all the towns and villages, teaching in their synagogues, proclaiming the Good News of the Kingdom, and healing every kind of disease and weakness. "},{"num":36,"verse":"When he saw the crowds, he had compassion on them because they were harried and helpless, like sheep without a shepherd. "},{"num":37,"verse":"Then he said to his talmidim, “The harvest is rich, but the workers are few. "},{"num":38,"verse":"Pray that the Lord of the harvest will send out workers to gather in his harvest.”"}]