[{"header":"Jesus Forgives and Heals a Paralyzed Man(A)"},{"num":9,"verse":"Jesus stepped into a boat, crossed over and came to his own town."},{"num":2,"verse":"Some men brought to him a paralyzed man, lying on a mat. When Jesus saw their faith, he said to the man, “Take heart, son; your sins are forgiven.”"},{"num":3,"verse":"At this, some of the teachers of the law said to themselves, “This fellow is blaspheming!”"},{"num":4,"verse":"Knowing their thoughts, Jesus said, “Why do you entertain evil thoughts in your hearts?"},{"num":7,"verse":"Then the man got up and went home."},{"num":8,"verse":"When the crowd saw this, they were filled with awe; and they praised God, who had given such authority to man."},{"header":"The Calling of Matthew(K)"},{"num":9,"verse":"As Jesus went on from there, he saw a man named Matthew sitting at the tax collector’s booth. “Follow me,” he told him, and Matthew got up and followed him."},{"num":10,"verse":"While Jesus was having dinner at Matthew’s house, many tax collectors and sinners came and ate with him and his disciples."},{"num":11,"verse":"When the Pharisees saw this, they asked his disciples, “Why does your teacher eat with tax collectors and sinners?”"},{"num":12,"verse":"On hearing this, Jesus said, “It is not the healthy who need a doctor, but the sick."},{"header":"Jesus Questioned About Fasting(P)"},{"num":14,"verse":"Then John’s disciples came and asked him, “How is it that we and the Pharisees fast often, but your disciples do not fast?”"},{"num":15,"verse":"Jesus answered, “How can the guests of the bridegroom mourn while he is with them? The time will come when the bridegroom will be taken from them; then they will fast."},{"header":"Jesus Raises a Dead Girl and Heals a Sick Woman(U)"},{"num":18,"verse":"While he was saying this, a synagogue leader came and knelt before him and said, “My daughter has just died. But come and put your hand on her, and she will live.”"},{"num":19,"verse":"Jesus got up and went with him, and so did his disciples."},{"num":20,"verse":"Just then a woman who had been subject to bleeding for twelve years came up behind him and touched the edge of his cloak."},{"num":21,"verse":"She said to herself, “If I only touch his cloak, I will be healed.”"},{"num":22,"verse":"Jesus turned and saw her. “Take heart, daughter,” he said, “your faith has healed you.” And the woman was healed at that moment."},{"num":23,"verse":"When Jesus entered the synagogue leader’s house and saw the noisy crowd and people playing pipes,"},{"num":24,"verse":"he said, “Go away. The girl is not dead but asleep.” But they laughed at him."},{"num":25,"verse":"After the crowd had been put outside, he went in and took the girl by the hand, and she got up."},{"num":26,"verse":"News of this spread through all that region."},{"header":"Jesus Heals the Blind and the Mute"},{"num":27,"verse":"As Jesus went on from there, two blind men followed him, calling out, “Have mercy on us, Son of David!”"},{"num":28,"verse":"When he had gone indoors, the blind men came to him, and he asked them, “Do you believe that I am able to do this?”"},{"num":29,"verse":"Then he touched their eyes and said, “According to your faith let it be done to you”;"},{"num":30,"verse":"and their sight was restored. Jesus warned them sternly, “See that no one knows about this.”"},{"num":31,"verse":"But they went out and spread the news about him all over that region."},{"num":32,"verse":"While they were going out, a man who was demon-possessed and could not talk was brought to Jesus."},{"num":33,"verse":"And when the demon was driven out, the man who had been mute spoke. The crowd was amazed and said, “Nothing like this has ever been seen in Israel.”"},{"num":34,"verse":"But the Pharisees said, “It is by the prince of demons that he drives out demons.”"},{"header":"The Workers Are Few"},{"num":35,"verse":"Jesus went through all the towns and villages, teaching in their synagogues, proclaiming the good news of the kingdom and healing every disease and sickness."},{"num":36,"verse":"When he saw the crowds, he had compassion on them, because they were harassed and helpless, like sheep without a shepherd."},{"num":37,"verse":"Then he said to his disciples, “The harvest is plentiful but the workers are few."}]