[{"header":"The Good and the Sinful"},{"num":73,"verse":"For sure God is good to Israel, to those who are pure in heart. "},{"num":2,"verse":"But as for me, my feet came close to falling. My steps had almost tripped. "},{"num":3,"verse":"For I was jealous of the proud when I saw that all was going well with the sinful. "},{"num":4,"verse":"For they suffer no pain in their death, and their body is fat. "},{"num":5,"verse":"They do not have the troubles of other men or suffer like other men. "},{"num":6,"verse":"So they wear pride around their neck. Fighting covers them like a coat. "},{"num":7,"verse":"They are so fat that their eyes are pushed out. The crazy thoughts of their hearts run wild. "},{"num":8,"verse":"They laugh at the truth, and speak sinful things about making it hard for others. They speak from a high place. "},{"num":9,"verse":"They say bad things against heaven, and their tongue walks through the earth."},{"num":10,"verse":"And so his people return to this place and drink water from a full cup. "},{"num":11,"verse":"They say, “How does God know? Is there much learning with the Most High?”"},{"num":12,"verse":"See, this is what the sinful are like. They always have it easy and their riches grow. "},{"num":13,"verse":"For no good reason I have kept my heart pure and have not sinned. "},{"num":14,"verse":"For I have suffered all day long. I have been punished every morning."},{"num":15,"verse":"I would not have been true to Your children if I had spoken this way. "},{"num":16,"verse":"It was too hard for me when I tried to understand this, "},{"num":17,"verse":"until I went into the holy place of God. Then I understood their end. "},{"num":18,"verse":"For sure, You set the sinful in places where there is danger at every step. You throw them down to be destroyed. "},{"num":19,"verse":"How they are destroyed right away! They come to an end with much fear. "},{"num":20,"verse":"Like a dream when one wakes up, so You will hate what they look like when You rise up, O Lord."},{"num":21,"verse":"My heart was troubled and I was hurt inside. "},{"num":22,"verse":"I was without reason and did not know better. I was like an animal before You. "},{"num":23,"verse":"Yet I am always with You. You hold me by my right hand. "},{"num":24,"verse":"You will lead me by telling me what I should do. And after this, You will bring me into shining-greatness."},{"num":25,"verse":"Whom have I in heaven but You? I want nothing more on earth, but You. "},{"num":26,"verse":"My body and my heart may grow weak, but God is the strength of my heart and all I need forever. "},{"num":27,"verse":"For, see, those who are far from You will be lost from You forever. You have destroyed all those who are not faithful to You. "},{"num":28,"verse":"But as for me, it is good to be near God. I have made the Lord God my safe place. So I may tell of all the things You have done."}]