[[],[{"type":"header","content":"Barnabas and Saul Commissioned"},{"type":"prose","content":"Now in the church at Antioch there were prophets and teachers: Barnabas, Simeon who was called Niger, Lucius of Cyrene, Manaen a member of the court of Herod the ruler, and Saul. "}],[{"type":"prose","content":"While they were worshiping the Lord and fasting, the Holy Spirit said, “Set apart for me Barnabas and Saul for the work to which I have called them.” "}],[{"type":"prose","content":"Then after fasting and praying they laid their hands on them and sent them off."}],[{"type":"header","content":"The Apostles Preach in Cyprus"},{"type":"prose","content":"So, being sent out by the Holy Spirit, they went down to Seleucia; and from there they sailed to Cyprus. "}],[{"type":"prose","content":"When they arrived at Salamis, they proclaimed the word of God in the synagogues of the Jews. And they had John also to assist them. "}],[{"type":"prose","content":"When they had gone through the whole island as far as Paphos, they met a certain magician, a Jewish false prophet, named Bar-Jesus. "}],[{"type":"prose","content":"He was with the proconsul, Sergius Paulus, an intelligent man, who summoned Barnabas and Saul and wanted to hear the word of God. "}],[{"type":"prose","content":"But the magician Elymas (for that is the translation of his name) opposed them and tried to turn the proconsul away from the faith. "}],[{"type":"prose","content":"But Saul, also known as Paul, filled with the Holy Spirit, looked intently at him "}],[{"type":"prose","content":"and said, “You son of the devil, you enemy of all righteousness, full of all deceit and villainy, will you not stop making crooked the straight paths of the Lord? "}],[{"type":"prose","content":"And now listen—the hand of the Lord is against you, and you will be blind for a while, unable to see the sun.” Immediately mist and darkness came over him, and he went about groping for someone to lead him by the hand. "}],[{"type":"prose","content":"When the proconsul saw what had happened, he believed, for he was astonished at the teaching about the Lord."}],[{"type":"header","content":"Paul and Barnabas in Antioch of Pisidia"},{"type":"prose","content":"Then Paul and his companions set sail from Paphos and came to Perga in Pamphylia. John, however, left them and returned to Jerusalem; "}],[{"type":"prose","content":"but they went on from Perga and came to Antioch in Pisidia. And on the sabbath day they went into the synagogue and sat down. "}],[{"type":"prose","content":"After the reading of the law and the prophets, the officials of the synagogue sent them a message, saying, “Brothers, if you have any word of exhortation for the people, give it.” "}],[{"type":"prose","content":"So Paul stood up and with a gesture began to speak:“You Israelites, and others who fear God, listen. "}],[{"type":"prose","content":"The God of this people Israel chose our ancestors and made the people great during their stay in the land of Egypt, and with uplifted arm he led them out of it. "}],[{"type":"prose","content":"For about forty years he put up with them in the wilderness. "}],[{"type":"prose","content":"After he had destroyed seven nations in the land of Canaan, he gave them their land as an inheritance "}],[{"type":"prose","content":"for about four hundred fifty years. After that he gave them judges until the time of the prophet Samuel. "}],[{"type":"prose","content":"Then they asked for a king; and God gave them Saul son of Kish, a man of the tribe of Benjamin, who reigned for forty years. "}],[{"type":"prose","content":"When he had removed him, he made David their king. In his testimony about him he said, ‘I have found David, son of Jesse, to be a man after my heart, who will carry out all my wishes.’ "}],[{"type":"prose","content":"Of this man’s posterity God has brought to Israel a Savior, Jesus, as he promised; "}],[{"type":"prose","content":"before his coming John had already proclaimed a baptism of repentance to all the people of Israel. "}],[{"type":"prose","content":"And as John was finishing his work, he said, ‘What do you suppose that I am? I am not he. No, but one is coming after me; I am not worthy to untie the thong of the sandals on his feet.’"}],[{"type":"prose","content":"“My brothers, you descendants of Abraham’s family, and others who fear God, to us the message of this salvation has been sent. "}],[{"type":"prose","content":"Because the residents of Jerusalem and their leaders did not recognize him or understand the words of the prophets that are read every sabbath, they fulfilled those words by condemning him. "}],[{"type":"prose","content":"Even though they found no cause for a sentence of death, they asked Pilate to have him killed. "}],[{"type":"prose","content":"When they had carried out everything that was written about him, they took him down from the tree and laid him in a tomb. "}],[{"type":"prose","content":"But God raised him from the dead; "}],[{"type":"prose","content":"and for many days he appeared to those who came up with him from Galilee to Jerusalem, and they are now his witnesses to the people. "}],[{"type":"prose","content":"And we bring you the good news that what God promised to our ancestors "}],[{"type":"prose","content":"he has fulfilled for us, their children, by raising Jesus; as also it is written in the second psalm,"},{"type":"poetry","content":"‘You are my Son;"}],[{"type":"prose","content":"As to his raising him from the dead, no more to return to corruption, he has spoken in this way,"},{"type":"poetry","content":"‘I will give you the holy promises made to David.’"}],[{"type":"prose","content":"Therefore he has also said in another psalm,"},{"type":"poetry","content":"‘You will not let your Holy One experience corruption.’"}],[{"type":"prose","content":"For David, after he had served the purpose of God in his own generation, died, was laid beside his ancestors, and experienced corruption; "}],[{"type":"prose","content":"but he whom God raised up experienced no corruption. "}],[{"type":"prose","content":"Let it be known to you therefore, my brothers, that through this man forgiveness of sins is proclaimed to you; "}],[{"type":"prose","content":"by this Jesus everyone who believes is set free from all those sins from which you could not be freed by the law of Moses. "}],[{"type":"prose","content":"Beware, therefore, that what the prophets said does not happen to you:"}],[{"type":"poetry","content":"‘Look, you scoffers!"},{"type":"poetry","content":"for in your days I am doing a work,"}],[{"type":"prose","content":"As Paul and Barnabas were going out, the people urged them to speak about these things again the next sabbath. "}],[{"type":"prose","content":"When the meeting of the synagogue broke up, many Jews and devout converts to Judaism followed Paul and Barnabas, who spoke to them and urged them to continue in the grace of God."}],[{"type":"prose","content":"The next sabbath almost the whole city gathered to hear the word of the Lord. "}],[{"type":"prose","content":"But when the Jews saw the crowds, they were filled with jealousy; and blaspheming, they contradicted what was spoken by Paul. "}],[{"type":"prose","content":"Then both Paul and Barnabas spoke out boldly, saying, “It was necessary that the word of God should be spoken first to you. Since you reject it and judge yourselves to be unworthy of eternal life, we are now turning to the Gentiles. "}],[{"type":"prose","content":"For so the Lord has commanded us, saying,"},{"type":"poetry","content":"‘I have set you to be a light for the Gentiles,"}],[{"type":"prose","content":"When the Gentiles heard this, they were glad and praised the word of the Lord; and as many as had been destined for eternal life became believers. "}],[{"type":"prose","content":"Thus the word of the Lord spread throughout the region. "}],[{"type":"prose","content":"But the Jews incited the devout women of high standing and the leading men of the city, and stirred up persecution against Paul and Barnabas, and drove them out of their region. "}],[{"type":"prose","content":"So they shook the dust off their feet in protest against them, and went to Iconium. "}],[{"type":"prose","content":"And the disciples were filled with joy and with the Holy Spirit."}]]