[{"num":13,"verse":"Among the prophets and teachers of the church at Antioch were Barnabas and Symeon (also called “The Black Man”), Lucius (from Cyrene), Manaen (the foster-brother of King Herod), and Paul. "},{"num":2,"verse":"One day as these men were worshiping and fasting the Holy Spirit said, “Dedicate Barnabas and Paul for a special job I have for them.” "},{"num":3,"verse":"So after more fasting and prayer, the men laid their hands on them—and sent them on their way."},{"num":4,"verse":"Directed by the Holy Spirit they went to Seleucia and then sailed for Cyprus. "},{"num":5,"verse":"There, in the town of Salamis, they went to the Jewish synagogue and preached. (John Mark went with them as their assistant.)"},{"num":6,"verse":"Afterwards they preached from town to town across the entire island until finally they reached Paphos where they met a Jewish sorcerer, a fake prophet named Bar-Jesus. He had attached himself to the governor, Sergius Paulus, a man of considerable insight and understanding. The governor invited Barnabas and Paul to visit him, for he wanted to hear their message from God. "},{"num":8,"verse":"But the sorcerer, Elymas (his name in Greek), interfered and urged the governor to pay no attention to what Paul and Barnabas said, trying to keep him from trusting the Lord."},{"num":9,"verse":"Then Paul, filled with the Holy Spirit, glared angrily at the sorcerer and said, "},{"num":10,"verse":"“You son of the devil, full of every sort of trickery and villainy, enemy of all that is good, will you never end your opposition to the Lord? "},{"num":11,"verse":"And now God has laid his hand of punishment upon you, and you will be stricken awhile with blindness.”"},{"num":12,"verse":"When the governor saw what happened, he believed and was astonished at the power of God’s message."},{"num":13,"verse":"Now Paul and those with him left Paphos by ship for Turkey, landing at the port town of Perga. There John Mark deserted them* and returned to Jerusalem. "},{"num":14,"verse":"But Barnabas and Paul went on to Antioch, a city in the province of Pisidia."},{"num":15,"verse":"After the usual readings from the Books of Moses and from the Prophets, those in charge of the service sent them this message: “Brothers, if you have any word of instruction for us come and give it!”"},{"num":16,"verse":"So Paul stood, waved a greeting to them and began. “Men of Israel,” he said, “and all others here who reverence God, let me begin my remarks with a bit of history.*"},{"num":17,"verse":"“The God of this nation Israel chose our ancestors and honored them in Egypt by gloriously leading them out of their slavery. "},{"num":18,"verse":"And he nursed them through forty years of wandering around in the wilderness. "},{"num":19,"verse":"Then he destroyed seven nations in Canaan and gave Israel their land as an inheritance. Judges ruled for about four hundred and fifty years and were followed by Samuel the prophet."},{"num":21,"verse":"“Then the people begged for a king, and God gave them Saul (son of Kish), a man of the tribe of Benjamin, who reigned for forty years. "},{"num":22,"verse":"But God removed him and replaced him with David as king, a man about whom God said, ‘David (son of Jesse) is a man after my own heart, for he will obey me.’ "},{"num":23,"verse":"And it is one of King David’s descendants, Jesus, who is God’s promised Savior of Israel!"},{"num":24,"verse":"“But before he came, John the Baptist preached the need for everyone in Israel to turn from sin to God. "},{"num":25,"verse":"As John was finishing his work he asked, ‘Do you think I am the Messiah? No! But he is coming soon—and in comparison with him, I am utterly worthless.’"},{"num":26,"verse":"“Brothers—you sons of Abraham, and also all of you Gentiles here who reverence God—this salvation is for all of us! "},{"num":27,"verse":"The Jews in Jerusalem and their leaders fulfilled prophecy by killing Jesus; for they didn’t recognize him or realize that he is the one the prophets had written about, though they heard the prophets’ words read every Sabbath. "},{"num":28,"verse":"They found no just cause to execute him, but asked Pilate to have him killed anyway. "},{"num":29,"verse":"When they had fulfilled all the prophecies concerning his death, he was taken from the cross and placed in a tomb."},{"num":30,"verse":"“But God brought him back to life again! "},{"num":31,"verse":"And he was seen many times during the next few days by the men who had accompanied him to Jerusalem from Galilee—these men have constantly testified to this in public witness."},{"num":32,"verse":"“And now Barnabas and I are here to bring you this Good News—that God’s promise to our ancestors has come true in our own time, in that God brought Jesus back to life again. This is what the second Psalm is talking about when it says concerning Jesus, ‘Today I have honored you as my Son.’"},{"num":34,"verse":"“For God had promised to bring him back to life again, no more to die. This is stated in the Scripture that says, ‘I will do for you the wonderful thing I promised David.’ "},{"num":35,"verse":"In another Psalm he explained more fully, saying, ‘God will not let his Holy One decay.’ "},{"num":36,"verse":"This was not a reference to David, for after David had served his generation according to the will of God, he died and was buried, and his body decayed. "},{"num":37,"verse":"No, it was a reference to another—someone God brought back to life, whose body was not touched at all by the ravages of death.*"},{"num":38,"verse":"“Brothers! Listen! In this man Jesus there is forgiveness for your sins! "},{"num":39,"verse":"Everyone who trusts in him is freed from all guilt and declared righteous—something the Jewish law could never do. "},{"num":40,"verse":"Oh, be careful! Don’t let the prophets’ words apply to you. For they said, "},{"num":41,"verse":"‘Look and perish, you despisers of the truth, for I am doing something in your day—something that you won’t believe when you hear it announced.’”"},{"num":42,"verse":"As the people left the synagogue that day, they asked Paul to return and speak to them again the next week. "},{"num":43,"verse":"And many Jews and godly Gentiles who worshiped at the synagogue followed Paul and Barnabas down the street as the two men urged them to accept the mercies God was offering. "},{"num":44,"verse":"The following week almost the entire city turned out to hear them preach the Word of God."},{"num":45,"verse":"But when the Jewish leaders saw the crowds, they were jealous, and cursed* and argued against whatever Paul said."},{"num":46,"verse":"Then Paul and Barnabas spoke out boldly and declared, “It was necessary that this Good News from God should be given first to you Jews. But since you have rejected it and shown yourselves unworthy of eternal life—well, we will offer it to Gentiles. "},{"num":47,"verse":"For this is as the Lord commanded when he said, ‘I have made you a light to the Gentiles, to lead them from the farthest corners of the earth to my salvation.’”"},{"num":48,"verse":"When the Gentiles heard this, they were very glad and rejoiced in Paul’s message; and as many as wanted eternal life, believed. "},{"num":49,"verse":"So God’s message spread all through that region."},{"num":50,"verse":"Then the Jewish leaders stirred up both the godly women and the civic leaders of the city and incited a mob against Paul and Barnabas, and ran them out of town. "},{"num":51,"verse":"But they shook off the dust of their feet against the town and went on to the city of Iconium. "},{"num":52,"verse":"And their converts were filled with joy and with the Holy Spirit."}]