[{"num":13,"verse":"In the church at Antioch there were prophets and teachers. They were Barnabas, Simeon Niger, Lucius from Cyrene, Manaen who grew up with Herod the ruler, and Saul."},{"num":2,"verse":"They were worshipping the Lord and fasting [not eating food for a time]. The Holy Spirit said, `Give me Barnabas and Saul to do the work for which I have called them.'"},{"num":3,"verse":"The men fasted and talked to God. Then they laid their hands on Barnabas and Paul and sent them on their way."},{"num":4,"verse":"Barnabas and Saul left Antioch. The Holy Spirit sent them to the town of Seleucia. From there they went in a boat to the island of Cyprus."},{"num":5,"verse":"When they reached the town of Salamis, they told God's word in the meeting places of the Jews. John was with them to help."},{"num":6,"verse":"They went through all the island to the town of Paphos. There they met a witch doctor. He was a Jew named Bar-Jesus. He was not a true prophet."},{"num":7,"verse":"This witch-doctor was with Sergius Paulus, the ruler of the country. Sergius Paulus was a wise man. He wanted to hear God's word, so he called for Barnabas and Saul."},{"num":8,"verse":"The witch-doctor was also called Elymas. He tried to stop them. He did not want the ruler to believe the truth."},{"num":9,"verse":"Then Saul, who is also called Paul, being filled with the Holy Spirit, looked at him."},{"num":10,"verse":"`You son of the devil!' he said. `You do nothing but tell lies and make much trouble. You hate everything that is right. The Lord's way is right. Will you not stop spoiling his way?"},{"num":11,"verse":"See now, the Lord's hand is upon you. You will be blind and will not be able to see the sun for a while.' And right then something like a dark cloud came over Elymas' eyes. He went around begging someone to take his hand and lead him."},{"num":12,"verse":"The ruler saw what had happened. And he was very much surprised at the teaching about the Lord. He believed it."},{"num":13,"verse":"Paul and his friends left Paphos in a boat. They went to the town of Perga in the district of Pamphylia. There John left them and went back to Jerusalem."},{"num":14,"verse":"The others went on from Perga. They came to Antioch in the district of Pisidia. On the Sabbath day they went into the meeting house and sat down."},{"num":15,"verse":"First, someone read from the books of the law and the prophets. Then the rulers of the meeting house called Paul and Barnabas and said, `Men and brothers, have you something to say that will help us? Please say it.'"},{"num":16,"verse":"Then Paul stood up and put out his hand. He said, `Men of Israel and you who worship and fear God, please listen to me."},{"num":17,"verse":"The God of the people of Israel chose our fathers. He made the people into a large tribe when they were strangers in the land of Egypt. God brought them out of Egypt by his power."},{"num":18,"verse":"For forty years in the wilderness God cared for them like a father."},{"num":19,"verse":"God took seven tribes out of the land of Canaan. Then he divided the land among our people."},{"num":20,"verse":"God gave judges to rule over them until Samuel the prophet came. About four hundred and fifty years had passed."},{"num":21,"verse":"Then the people asked for a king. God gave them Saul. He was the son of Kish, a man from Benjamin's family. Saul was their king for forty years."},{"num":22,"verse":"Then God took him away. He made David king over them. This is what God said about him, \"David, Jesse's son, is the kind of man I love. He will do all that I want him to do.\""},{"num":23,"verse":"God has given Israel a Saviour from David's family, as he promised to do. His name is Jesus."},{"num":24,"verse":"Before he came, John [the baptiser] talked to all the people of Israel. He said they should stop doing wrong things and be baptised."},{"num":25,"verse":"When John was finishing his work, he said, \"Who do you think I am? I am not the one. But wait, someone else will come after me. I am not good enough to untie his shoe strings.\""},{"num":26,"verse":"`Men and brothers, sons of Abraham, and all of you who worship God, the news of this way to be saved has been sent to us."},{"num":27,"verse":"The people who live in Jerusalem and their rulers did not know who this Jesus really was. They did not understand the words of the prophets of God long ago which were read every Sabbath day. But even so, they did what the prophets had said they would do. They judged him."},{"num":28,"verse":"They could not prove that he did anything wrong for which he should die. Yet they begged Pilate to kill him."},{"num":29,"verse":"They did all the things that the prophets had written about him. Then they took him down from the cross made from a tree. They laid him in a grave cut from the rock."},{"num":30,"verse":"But God raised him from death."},{"num":31,"verse":"People had come with Jesus from Galilee to Jerusalem. They saw him many days. Now they tell people what they saw."},{"num":32,"verse":"And we are bringing you this good news. God made a promise to our fathers long ago. Now he has made his promise come true."},{"num":33,"verse":"We, their children, have now received the promise. He sent Jesus just as it was written in the second, \"You are my Son. Today I have become your Father.\""},{"num":34,"verse":"`God raised Jesus from death. His body did not go back to the grave to be spoiled. Here is what God said about it. \"I will give to you the blessings which I promised David.\""},{"num":35,"verse":"`In another psalm it says, \"You will not let the body of your Holy One be spoiled.\""},{"num":36,"verse":"`As for David, he did the work God wanted him to do for the people in his time. Then, after that, he died. He was buried with his fathers. His body spoiled."},{"num":37,"verse":"But God has raised one from death. His body did not spoil."},{"num":38,"verse":"`Men and brothers, understand this. It is because of this Jesus that we tell you your wrong ways will be forgiven you."},{"num":39,"verse":"The law of Moses could not make you free. But this man makes you free. You will not be judged if you believe in him."},{"num":40,"verse":"Be careful then, so that what the prophets said will not happen to you."},{"num":41,"verse":"They said, \"Look, you people who despise everything. You will look in wonder before you die. I will do something in your time. I will do something that you will not believe even if someone told you what it is.\" '"},{"num":42,"verse":"As Paul and Barnabas left the meeting house the people said, `Tell us these things again next Sabbath day.'"},{"num":43,"verse":"The meeting was finished. There were many Jews, also those who were not Jews but worshipped God. They followed Paul and Barnabas. Paul and Barnabus kept talking to the people and told them to keep on living in the way that will bring God's blessing."},{"num":44,"verse":"The next Sabbath day almost all of the people in that city gathered to hear God's word."},{"num":45,"verse":"The leaders of the Jews saw that many people came. They were very jealous. They talked back to Paul and said he was not telling the truth. They also said wrong things about him."},{"num":46,"verse":"But Paul and Barnabas did not fear the Jewish leaders. They said, `We had to tell God's word to you first but you will not listen to it. By that you are saying you Jews are not good enough to live for ever. So we will go to the people who are not Jews."},{"num":47,"verse":"That is what the Lord told us to do. He said, \"I have made you to be a light to the people who are not Jews. You will tell people everywhere in the world how to be saved.\" '"},{"num":48,"verse":"Those who were not Jews heard this. They were glad and they thanked God for his message. All those who had been chosen to live for ever believed."},{"num":49,"verse":"The word of the Lord was told through all that part of the country."},{"num":50,"verse":"But the leaders of the Jews talked to the leading women who worshipped God and to the chief men of Antioch. They made plenty of trouble for Paul and Barnabas. They made them leave that part of the country."},{"num":51,"verse":"So Paul and Barnabas shook the dust off their feet and left them. They went on to Iconium."},{"num":52,"verse":"And the followers were filled with joy and the Holy Spirit."}]