[{"num":78,"verse":"(Maskil of Asaph.) Give ear, O my people, to my torah; incline your ears to the words of my mouth."},{"num":2,"verse":"I will open my mouth in a mashal; I will utter dark sayings from of old,"},{"num":3,"verse":"Which we have heard and known, and Avoteinu have told us."},{"num":4,"verse":"We will not hide them from their banim, recounting to the dor acharon the tehillot Hashem, and His power, and His nifla’ot (wonderful works) that He hath done."},{"num":5,"verse":"For He established edut in Ya’akov, set torah in Yisroel, which He commanded Avoteinu, that they should make them known to their banim;"},{"num":6,"verse":"So that the dor acharon might know them, even the banim which should be born; who should arise and recount them to their banim;"},{"num":7,"verse":"That they might put their confidence in Elohim, and not forget the ma’allei El (works of G-d), but keep His mitzvot;"},{"num":8,"verse":"And might not be as their Avot, a dor sorer u’moreh (stubborn and rebellious generation); a generation that set not its lev aright, and whose ruach was not faithful to G-d."},{"num":9,"verse":"The Bnei Ephrayim, being armed, and shooting keshet (the bows), turned back in the day of battle."},{"num":10,"verse":"They kept not the Brit Elohim, and refused to walk in His torah;"},{"num":11,"verse":"And forgot His works, and His nifla’ot (wonders) that He had shown them."},{"num":12,"verse":"Peleh (marvellous things) did He in the sight of their avot, in Eretz Mitzrayim, in the sadeh (area) of Tzoan."},{"num":13,"verse":"He divided the yam, and caused them to pass through; and He made the mayim to stand like a heap."},{"num":14,"verse":"In the daytime also He led them with an anan, and all the lailah with an ohr of eish."},{"num":15,"verse":"He split the rocks in the midbar, and gave them drink as out of the great tehomot."},{"num":16,"verse":"He brought streams also out of the rock, and caused mayim to run down like rivers."},{"num":17,"verse":"And they sinned yet more against Him by provoking Elyon in the wilderness."},{"num":18,"verse":"And they tested G-d by their lev by demanding ochel for their lust."},{"num":19,"verse":"And they spoke against Elohim; they said, Can G-d spread a shulchan in the midbar?"},{"num":20,"verse":"Behold, He struck the Tzur, that the mayim gushed out, and the streams overflowed; can He give lechem also? Can He provide meat for His people?"},{"num":21,"verse":"Therefore Hashem heard this, and was in wrath; so an eish was kindled against Ya’akov, and anger also came up against Yisroel;"},{"num":22,"verse":"Because they believed not in Elohim, and trusted not in His Yeshuah (salvation);"},{"num":23,"verse":"Though He had commanded the clouds from above, and opened the daletei Shomayim (doors of heaven),"},{"num":24,"verse":"And had rained down manna upon them to eat, and had given them of the bread of Shomayim [see Yn 6:31 OJBC]."},{"num":25,"verse":"Ish did eat the bread of angels; He sent them lechem to the full."},{"num":26,"verse":"He caused an east wind to blow from Shomayim; and by His oz He brought in the south wind."},{"num":27,"verse":"He rained meat also upon them like aphar, and winged fowls like the chol (sand) of the sea;"},{"num":28,"verse":"And He let it fall in the midst of their machaneh, all around their mishkenot (habitations)."},{"num":29,"verse":"So they did eat, and were well filled; for He gave them their own ta’avah (evil desire)."},{"num":30,"verse":"They were not estranged from their ta’avah. But while their food was yet in their mouths,"},{"num":31,"verse":"The Af Elohim (wrath of G-d) came upon them, and slaughtered the stoutest of them, and cut down the bochurim of Yisroel."},{"num":32,"verse":"For all this they sinned still, and believed not in His nifla’ot (wondrous works)."},{"num":33,"verse":"Therefore their yamim did He consume in hevel (futility, vanity) and their shanim in terror."},{"num":34,"verse":"When He slaughtered them, then they sought Him; and they returned and inquired diligently after G-d."},{"num":35,"verse":"And they remembered that Elohim was their Tzur, and the El Elyon their Go’el (Redeemer)."},{"num":36,"verse":"Nevertheless they did flatter Him with their mouth, and they lied unto Him with their leshon."},{"num":37,"verse":"For their lev was not right with Him, neither were they faithful in His Brit."},{"num":38,"verse":"But He, being full of compassion, made kapporah for their avon and destroyed them not; and He many times turned His anger away, and did not stir up all His wrath."},{"num":39,"verse":"For He remembered that they were but basar; a ruach (wind) that passeth away, and cometh not again."},{"num":40,"verse":"How oft did they provoke Him in the midbar, and grieve Him in the desert!"},{"num":41,"verse":"Again and again they turned back and tested G-d, and imposed limits on Kadosh Yisroel."},{"num":42,"verse":"They remembered not His Yad (Hand, Power), nor the yom (day) when He redeemed them from the enemy."},{"num":43,"verse":"How He had wrought His otot in Mitzrayim, and His mofetim in the area of Tzoan."},{"num":44,"verse":"And had turned their rivers into dahm; and their streams, that they could not drink."},{"num":45,"verse":"He sent swarms of flies among them, which devoured them; and tzfarde’a (frogs), which destroyed them."},{"num":46,"verse":"He gave also their crop unto the grasshopper, and their produce unto the arbeh (locust)."},{"num":47,"verse":"He destroyed their gefen with barad (hail), and their fig trees with frost."},{"num":48,"verse":"He gave up their cattle also to the barad (hail), and their livestock herds to hot thunderbolts."},{"num":49,"verse":"He cast upon them His charon af, evrah (wrath), and za’am (indignation), and tzarah, by sending malachim ra’im among them."},{"num":50,"verse":"He made a way for His anger; He spared not their nefesh from mavet (death), but gave their beasts over to the dever (plague);"},{"num":51,"verse":"And struck all the bechor in Mitzrayim; the reshit (first fruit) of their strength in the ohalim of Cham;"},{"num":52,"verse":"But made His own people to go forth like tzon, and guided them in the midbar like an eder (flock)."},{"num":53,"verse":"And He led them in safety, so that they had no terror; but the yam overwhelmed their oyevim."},{"num":54,"verse":"And He brought them to His gevul kadosh (His holy border), even to this Har, which His Yamin had purchased."},{"num":55,"verse":"He cast out the Goyim also before them, and divided by measure a nachalah for them, and made the Shivtei Yisroel to dwell in their ohalim."},{"num":56,"verse":"Yet they tested and provoked Elohim Elyon, and were not shomer over His edot;"},{"num":57,"verse":"But turned back, and dealt unfaithfully like their avot; they turned like a treacherous keshet."},{"num":58,"verse":"For they provoked Him to anger with their high places, and moved Him to jealousy with their pesilim."},{"num":59,"verse":"When Elohim heard this, He was in wrath, and greatly abhorred Yisroel;"},{"num":60,"verse":"So that He forsook the Mishkan of Shiloh, the Ohel which He placed among adam (men);"},{"num":61,"verse":"And delivered His oz (strength) into captivity, and His tiferet into the hand of the enemy."},{"num":62,"verse":"He gave His people over also unto the cherev; and was in wrath with His nachalah."},{"num":63,"verse":"The eish consumed their bochurim; and their betulot had no wedding celebration."},{"num":64,"verse":"Their kohanim fell by the cherev; and their almanot made no lamentation."},{"num":65,"verse":"Then Adonoi awaked as one from sleep, and like a gibbor that shouteth from yayin."},{"num":66,"verse":"And He struck down His enemies behind; He put them to cherpat olam (perpetual reproach)."},{"num":67,"verse":"Moreover He rejected the Ohel Yosef, and chose not the Shevet Ephrayim;"},{"num":68,"verse":"But chose the Shevet Yehudah, Har Tziyon which He loved."},{"num":69,"verse":"And He built His Mikdash like heavenly heights, like Eretz which He hath established l’olam."},{"num":70,"verse":"He chose Dovid also His Eved, and took him from the mikhle’ot tzon (sheepfolds);"},{"num":71,"verse":"From following the nursing ewes He brought him to shepherd Ya’akov His people, and Yisroel His nachalah."},{"num":72,"verse":"So he shepherded them according to the tohm (integrity, guilelessness) of his lev; and led them by the skillfulness of his hands."}]