[{"header":"The Lion, the Lamb"},{"num":5,"verse":"I saw that there was a scroll in the right hand of the one sitting on the throne. The scroll was written on the inside and the outside, and it was sealed with seven seals. "},{"num":2,"verse":"I saw a strong angel announcing in a loud voice, ‘Does anybody deserve to open the scroll, to undo its seals?’ "},{"num":3,"verse":"And nobody in heaven or on the earth or under the earth could open the scroll or look at it. "},{"num":4,"verse":"I burst into tears because it seemed that there was nobody who was worthy to open the scroll or look inside it. "},{"num":5,"verse":"One of the elders, however, spoke to me. ‘Don’t cry,’ he said. ‘Look! The lion from the tribe of Judah, the Root of David, has won the victory! He can open the scroll and its seven seals.’"},{"num":6,"verse":"Then I saw in the midst of the throne and of the four living creatures, and in the midst of the elders, a lamb. It was standing there as though it had been slaughtered; it had seven horns and seven eyes, which are the seven spirits of God sent out into all the earth. "},{"num":7,"verse":"The lamb came up and took the scroll from the right hand of the one who was sitting on the throne."},{"header":"Worthy Is the Lamb!"},{"num":8,"verse":"When he took the scroll, the four living creatures and the twenty-four elders fell down in front of the lamb. They each had a harp, and they each had golden bowls full of incense, which are the prayers of God’s holy people. "},{"num":9,"verse":"They sing a new song, which goes like this:"},{"num":11,"verse":"As I watched, I heard the voice of many angels around the throne, the living creatures and the elders. Their number was ten thousand times ten thousand, thousands upon thousands, "},{"num":12,"verse":"and they were saying in full voice,"},{"num":13,"verse":"Then I heard every creature in heaven, on the earth, under the earth, and in the sea, and everything that is in them, saying,"},{"num":14,"verse":"‘Amen!’ cried the four living creatures. As for the elders, they fell down and worshipped."}]