[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For the fitches are not threshed . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fennel seed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as before. The eye of the prophet passes from the beginning to the end of the husbandman’s work. He finds there also the varying methods of a like discrimination. A man would be thought mad who threshed his fennel seed and cummin with the same instrument that he uses for his barley and his wheat. It is enough to beat or tap them with the “rod,” or “staff,” which was, in fact, used in each case. Interpreting this parable, we may see in the fennel and the cummin the little ones of the earth, with whom God deals more gently than with the strong. “Tribulation,” as the etymology of the word (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tribulum, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a threshing instrument) tells us, is a threshing process. The lesson of the parable is that it comes to nations and individuals in season and in measure. The main idea is familiar enough in the language of the prophets (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The novelty of Isaiah’s treatment of it consists in his bringing in the minute details, and drawing this lesson from them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 28:27-29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:27-29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". “Four methods of thrashing are here mentioned, by different instruments: the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flail, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "drag, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "treading of cattle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "staff, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flail, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "was used for the grain that was too tender to be treated in the other methods. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "drag ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "consisted of a sort of frame of strong planks, made rough at the bottom, with hard stones or iron: it was drawn by horses or oxen over the corn-sheaves spread on the floor, the driver sitting upon it. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wain ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "was much like the former, but had wheels with iron teeth, or edges, like a saw. This not only forced out the grain, but cut the straw in pieces for fodder for the cattle; for in the eastern countries they have no hay. The last method is well known from the law of Moses, which forbids the ox to be muzzled when he treadeth out the corn, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” — Bishop Lowth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This also cometh from the Lord of hosts, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This part of the husbandman’s discretion expressed in these verses, as well as that expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These words contain the application of the similitude. The husbandman manages his affairs with common discretion; but God governs the world and his church with wonderful wisdom: he is great and marvellous, both in the contrivance of things, and in the execution of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:23-29 The husbandman applies to his calling with pains and prudence, in all the works of it according to their nature. Thus the Lord, who has given men this wisdom, is wonderful in counsel, and excellent in his working. As the occasion requires, he threatens, corrects, spares, shows mercy, or executes vengeance. Afflictions are God's threshing instruments, to loosen us from the world, to part between us and our chaff, and to prepare us for use. God will proportion them to our strength; they shall be no heavier than there is need. When his end is answered, the trials and sufferings of his people shall cease; his wheat shall be gathered into the garner, but the chaff shall be burned with unquenchable fire.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the fitches are not threshed with a threshing instrument - The word used here (חרוּץ  chârûts) denotes properly that which is pointed or sharp, and is joined with מורג  môrag in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - meaning there the threshing dray or sledge; a plank with iron or sharp stones that was drawn by oxen over the grain (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 24:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the passage before us, several methods of threshing are mentioned as adapted to different kinds of grain, all of which are at the present time common in the East. Those which are mentioned under the name of the 'threshing instrument,' and 'a cart wheel,' refer to instruments which are still in use in the East. Niebuhr, in his \"Travels in Arabia,\" says, (p. 299,) 'In threshing their grain, the Arabians lay the sheaves down in a certain order, and then lead over them two oxen dragging a large stone.' 'They use oxen, as the ancients did, to beat out their grain, by trampling on the sheaves, and dragging after them a clumsy machine.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This machine is not a stone cylinder; nor a plank with sharp stones, as in Syria; but a sort of sledge consisting of three rollers, fitted with irons, which turn upon axles. A farmer chooses out a level spot in his fields, and has his grain carried thither in sheaves, upon donkeys or dromedaries. Two oxen are then yoked in a sledge; a driver then gets upon it, and drives them backward and forward upon the sheaves; and fresh oxen succeed in the yoke from time to time. By this operation the chaff is very much cut down; it is then winnowed, and the grain thus separated.' 'This machine,' Niebuhr adds, 'is called Nauridj. It bas three rollers which turn on three axles; and each of them is furnished with some irons which are round and flat. Two oxen were made to draw over the grain again and again the sledge above mentioned, and this was done with the greatest convenience to the driver; for he was seated in a chair fixed on a sledge.' See the illustration in the book to get an idea of this mode of threshing, and of the instruments that were employed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither is a cart wheel - This instrument of threshing is described by Boehart (Hieraz. i. 2. 32. 311), as consisting of a cart or wagon fitted with wheels adapted to crush or thresh the grain. This, he says, was used by the Carthagenians who came from the vicinity of Canaan. It appears to have been made with serrated wheels, perhaps almost in the form of circular saws, by which the straw was cut fine at the same time that the grain was separated from the chaff.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But the fitches are beaten out with a staff - With a stick, or flail. That is, pulse in general, beans, pease, dill, cummin, etc., are easily beaten out with a stick or flail. This mode of threshing is common everywhere. It was also practiced, as with us, in regard to barley and other grain, where there was a small quantity, or where there was need of special haste (see Ruth 2:17; Judges 6:11). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But the fitches are beaten out with a staff - With a stick, or flail. That is, pulse in general, beans, pease, dill, cummin, etc., are easily beaten out with a stick or flail. This mode of threshing is common everywhere. It was also practiced, as with us, in regard to barley and other grain, where there was a small quantity, or where there was need of special haste (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. The husbandman uses the same discretion in threshing. The dill (\"fitches\") and cummin, leguminous and tender grains, are beaten out, not as wheat, &c., with the heavy corn-drag (\"threshing instrument\"), but with \"a staff\"; heavy instruments would crush and injure the seed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "cart wheel—two iron wheels armed with iron teeth, like a saw, joined together by a wooden axle. The \"corn-drag\" was made of three or four wooden cylinders, armed with iron teeth or flint stones fixed underneath, and joined like a sledge. Both instruments cut the straw for fodder as well as separated the corn.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "staff—used also where they had but a small quantity of corn; the flail (Ru 2:17).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A threshing instrument; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which then and there was made like a sled shod with iron, which was drawn by men or beasts over the sheafs of corn, to bruise them, and beat the grain out of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A cart wheel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a lesser and lower wheel than a cart wheel, but of the same form, upon which possibly the threshing instrument was drawn. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The fitches are beaten out with a staff, and the cummin with a rod, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as being unable to bear harder usage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the fitches are not threshed with a threshing instrument,.... A wooden sledge, dray, or cart, drawn on wheels; the bottom of which was stuck with iron teeth, and the top filled with stones, to press it down with the weight thereof, and was drawn by horses, or oxen, to and fro, over the sheaves of corn, laid in proper order, whereby the grain was separated from the husk: See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but fitches, the grain of them being more easily separated, such an instrument was not used in threshing them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither is a cart wheel turned about upon the cummin; the cart wheel of the above instrument was not turned upon the cummin, that being also more easily threshed, or beaten out, and therefore another method was used with these, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but the fitches are beaten out with a staff, and the cummin with a rod: in like manner as corn is with us threshed out with a flail; so the Lord proportions the chastisement, and corrections of his people to the grace and strength that he gives them; he afflicts them either more gently, or more severely, as they are able to bear it; with some he uses his staff and rod, and with others his threshing instrument and cart wheel; some being easier and others harder to be wrought upon by the afflictive dispensations of Providence; see 1 Corinthians 10:13 or this may point out the difference between the punishment of wicked men and the chastisement of the saints. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but the fitches are beaten out with a staff, and the cummin with a rod: in like manner as corn is with us threshed out with a flail; so the Lord proportions the chastisement, and corrections of his people to the grace and strength that he gives them; he afflicts them either more gently, or more severely, as they are able to bear it; with some he uses his staff and rod, and with others his threshing instrument and cart wheel; some being easier and others harder to be wrought upon by the afflictive dispensations of Providence; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or this may point out the difference between the punishment of wicked men and the chastisement of the saints. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For the fitches are not threshed with a threshing instrument, neither is a cart wheel turned about upon the cummin; but the fitches are beaten out with a staff, and the cummin with a rod.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with a threshing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " instrument] the sledge (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ḥârûç",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a cart wheel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] the wheel of a threshing wagon (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘ǎgâlâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "27–29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Threshing is not bruising. Three methods of threshing are alluded to. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Beating with a rod or flail (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 6:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ruth 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Treading with the feet of cattle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 28:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Drawing a heavy wooden sledge, with sharp stones or iron spikes fixed in its under surface (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ḥârûç",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or a wagon (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘ǎgâlâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with a great number of sharp-edged wheels, over the grain. The point of the illustration is that the method suitable to one kind of grain would be ruinous to another (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 28:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); and that even the rougher methods are applied with moderation (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 28:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the fitches are not threshed with a threshing-instrument.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Nigella sativa",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is too lender a plant to be subjected to the rude treatment of a threshing-instrument, or \"threshing-sledge.\" Such instruments are of the coarsest and clumsiest character in the East, and quite inapplicable to plants of a delicate fabric. Karsten Niebuhr thus describes the Arabian and Syrian practices: \"Quand le grain dolt etre battu, les Arabes de Yemen posent le bled par terre en deux tangles, epis center epis, apres quoi ils font trainer par-dessus ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "une grosse pierre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " tiree par deux boeufs. La machine dent on se sert en Syrie consiste en ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "quelques planches",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " garnies par-dessous d'une quantite de pierres a fusil\" ('Description de l'Arabie,' p. 140). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither is a cart wheel turned about upon the cummin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The allusion is to aim the coarse mode of threshing practiced in Palestine and elsewhere, by driving a cart with broad wheels over the grain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But the fitches are beaten out with a staff, and the cummin with a rod",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Canon Tristram says, \"While the cummin can easily be separated from its case by a slender rod, the harder pod of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Nigella",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " requires to be beaten by a stout staff\" ('Natural History of the Bible,' p. 445). Isaiah 28:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Again, the labour of the husbandman is just as manifold after the reaping has been done. \"For the black poppy is not threshed with a threshing sledge, nor is a cart wheel rolled over cummin; but black poppy is knocked out with a stick, and cummin with a staff. Is bread corn crushed? No; he does not go on threshing it for ever, and drive the wheel of his cart and his horses over it: he does not crush it. This also, it goeth forth from Jehovah of hosts: He gives wonderful intelligence, high understanding.\" Ki (for) introduces another proof that the husbandman is instructed by God, from what he still further does. He does not use the threshing machine (chârūts, syn. mōrag, Ar. naureg, nōreg), or the threshing cart (agâlâh: see Winer's Real-Wrterbuch, art. Dreschen), which would entirely destroy the more tender kinds of fruit, but knocks them out with a staff (baculo excutit: see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 27:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The sentence lechem yūdâq is to be accentuated as an interrogative: Is bread corn crushed? Oh no, he does not crush it. This would be the case if he were to cause the wheel (i.e., the wheels, gilgal, constr. to galgal) of the threshing cart with the horses harnessed in front to rattle over it with all their might (hâmam, to set in noisy violent motion). Lechem, like the Greek sitos, is corn from which bread is made (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). אדושׁ is metaplastic (as if from אדשׁ) for דושׁ (see Ewald, 312, b). Instead of וּפרשׁיו, the pointing ought to be וּפרשׁיו (from פרשׁ with kametz before the tone  equals  Arab. faras, as distinguished from פרשׁ with a fixed kametz, equivalent to farras, a rider): \"his horses,\" here the threshing horses, which were preferred to asses and oxen.Even in this treatment of the fruit when reaped, there is an evidence of the wonderful intelligence (הפלא), as written הפלא) and exalted understanding (on תּוּשׁהיה, from ושׁי, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 26:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") imparted by God. The expression is one of such grandeur, that we perceive at once that the prophet has in his mind the wisdom of God in a higher sphere. The wise, divinely inspired course adopted by the husbandman in the treatment of the field and fruit, is a type of the wise course adopted by the divine Teacher Himself in the treatment of His nation. Israel is Jehovah's field. The punishments and chastisements of Jehovah are the ploughshare and harrow, with which He forcibly breaks up, turns over, and furrows this field. But this does not last for ever. When the field has been thus loosened, smoothed, and rendered fertile once more, the painful process of ploughing is followed by a beneficent sowing and planting in a multiform and wisely ordered fulness of grace. Again, Israel is Jehovah's child of the threshing-floor (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 21:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He threshes it; but He does not thresh it only: He also knocks; and when He threshes, He does not continue threshing for ever, i.e., as Caspari has well explained it, \"He does not punish all the members of the nation with the same severity; and those whom He punishes with greater severity than others He does not punish incessantly, but as soon as His end is attained, and the husks of sin are separated from those that have been punished, and the punishment ceases, and only the worst in the nation, who are nothing but husks, and the husks on the nation itself, are swept away by the punishments\" (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This is the solemn lesson and affectionate consolation hidden behind the veil of the parable. Jehovah punishes, but it is in order that He may be able to bless. He sifts, but He does not destroy. He does not thresh His own people, but He knocks them; and even when He threshes, they may console themselves in the face of the approaching period of judgment, that they are never crushed or injured. ",
        "children": []
      }
    ]
  }
]