[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whom shall he teach knowledge?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The two verses that follow reproduce the language of the drunkards as they talk scornfully of the prophet. “To whom does he come with what he calls his ‘knowledge’ and his ‘doctrine?’ (better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "message, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Does he think that they are boys just weaned, who are to be taught the first elements of the religion of the infant school?” Then in their mockery they describe (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") his teaching, with what was to them its wearisome iteration, “Always precept upon precept, line upon line ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": ". . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "”—petty rebukes and puerile harping upon the same note, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "semper eandem canens cantilenam. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "We can scarcely doubt that Isaiah was indignantly reproducing, as St. Paul does in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Corinthians 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Corinthians 11:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the very words, almost the drunken accents, in which the priests and false prophets had spoken of him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 28:9-10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:9-10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whom shall he ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, God, or his prophet, or minister; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "teach knowledge? and whom shall he make to understand doctrine? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who is there among this people, that are capable and willing to be taught the good knowledge of God? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them that are wearied from the milk, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — A minister may as soon teach a young child as these men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For precept must be upon precept, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — They must be taught like little children, slowly, and with leisure, the same things being often repeated, because of their great dulness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Line upon line ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— One line of the book after another, as children are taught to read.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:5-15 The prophet next turns to Judah, whom he calls the residue of his people. Happy are those alone, who glory in the Lord of hosts himself. Hence his people get wisdom and strength for every service and every conflict. But it is only in Christ Jesus that the holy God communicates with sinful man. And whether those that teach are drunk with wine, or intoxicated with false doctrines and notions concerning the kingdom and salvation of the Messiah, they not only err themselves, but lead multitudes astray. All places where such persons have taught are filled with errors. For our instruction in the things of God, it is needful that the same precept and the same line should be often repeated to us, that we may the better understand them. God, by his word, calls us to what is really for our advantage; the service of God is the only true rest for those weary of the service of sin, and there is no refreshment but under the easy yoke of the Lord Jesus. All this had little effect upon the people. Those who will not understand what is plain, but scorn and despise it as mean and trifling, are justly punished. If we are at peace with God, we have, in effect, made a covenant with death; whenever it comes, it cannot do us any real damage, if we are Christ's. But to think of making death our friend, while by sin we are making God our enemy, is absurd. And do not they make lies their refuge who trust in their own righteousness, or to a death-bed repentance? which is a resolution to sin no more, when it is no longer in their power to do so.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "whom shall he teach knowledge? - This verse commences a statement respecting another form of sin that prevailed among the people of Judah. That sin was contempt for the manner in which God instructed them by the prophets, and a disregard for his communications as if they were suited to children and not to adults. That \"scoffing\" was the principal sin aimed at in these verses, is apparent from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Vitringa supposes that these words ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are designed to describe the manner of teaching by the priests and the prophets as being puerile and silly, and adapted to children. Michaelis supposes that the prophet means to signify that it would be a vain and fruitless labor to attempt to instruct these persons who were given to wine, because they were unaccustomed to sound and true doctrine. Others have supposed that he means that these persons who were thus given to wine and strong drink were disqualified to instruct others, since their teachings were senseless and incoherent, and resembled the talk of children. But the true sense of the passage has undoubtedly been suggested by Lowth. According to this interpretation, the prophet speaks of them as deriders of the manner in which God had spoken to them by his messengers. 'What!' say they, 'does God treat us as children? Does he deal with us as we deal with infants just weaned, perpetually repeating and inculcating the same elementary lessons, and teaching the mere rudiments of knowledge?' The expression, therefore, 'whom shall he teach knowledge?' or, 'whom does he teach?' is an expression of contempt supposed to be spoken by the intemperate priests and prophets - the leaders of the people. 'whom does God take us to be? Does he regard us as mere children? Why are we treated as children with an endless repetition of the same elementary instruction?'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To understand doctrine - Hebrew as Margin, 'Hearing,' or 'report' Isaiah 53:1. The sense is, For whom is that instruction intended? whom does he wish to be taught by it?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To understand doctrine - Hebrew as Margin, 'Hearing,' or 'report' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The sense is, For whom is that instruction intended? whom does he wish to be taught by it?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Them that are weaned from the milk ... - Does he regard and treat us as mere babes? ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Them that are weaned from the milk ... - Does he regard and treat us as mere babes? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9, 10. Here the drunkards are introduced as scoffingly commenting on Isaiah's warnings: \"Whom will he (does Isaiah presume to) teach knowledge? And whom will He make to understand instruction? Is it those (that is, does he take us to be) just weaned, &c.? For (he is constantly repeating, as if to little children) precept upon precept,\" &c.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "line—a rule or law. [Maurer]. The repetition of sounds in Hebrew tzav latzav, tzav latzav, qav laqav, qav laquav, expresses the scorn of the imitators of Isaiah's speaking; he spoke stammering (Isa 28:11). God's mode of teaching offends by its simplicity the pride of sinners (2Ki 5:11, 12; 1Co 1:23). Stammerers as they were by drunkenness, and children in knowledge of God, they needed to be spoken to in the language of children, and \"with stammering lips\" (compare Mt 13:13). A just and merciful retribution.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whom shall he, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the teacher",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is easily understood out of the following verb; either God, or his prophets, or ministers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "teach knowledge?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who is there among this people that are capable and willing to be taught the good knowledge of God? A minister may as soon teach a young child as these men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whom shall he teach knowledge?.... Not the drunken priest or prophet, who were both unfit for teaching men knowledge; but either the true and godly priest or prophet of the Lord, or the Lord himself, before spoken of as a spirit of judgment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " namely, by his prophets and ministers, the latter seem rather intended; whom may or can such an one teach the knowledge of God, and of themselves; the knowledge of the law, and of the Gospel; the knowledge of divine truths, of things necessary to salvation, and the conduct of human life; of Jesus Christ, and the way of salvation by him, and of him, as a foundation of the Lord's laying in Zion, hereafter mentioned in this chapter? who are capable of receiving such instructions? it intimates the stupidity and sottishness of the Jews, whose minds were so impaired by excessive drinking, that they were not able to take in the knowledge of these things: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and whom shall he make to understand doctrine? or \"hearing\"; the hearing of the word, or the word heard, the report of the Gospel; so the word is used in Isaiah 53:1 this will never be understood, believed, and received, unless the arm of the Lord is revealed, or his power be exerted; prophets and ministers may speak to the ears of men, but they cannot give them an understanding of divine things, God only can do that: here it designs, as before, the unteachableness of the people of the Jews, being in the circumstances they were, as appears by what follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and whom shall he make to understand doctrine? or \"hearing\"; the hearing of the word, or the word heard, the report of the Gospel; so the word is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this will never be understood, believed, and received, unless the arm of the Lord is revealed, or his power be exerted; prophets and ministers may speak to the ears of men, but they cannot give them an understanding of divine things, God only can do that: here it designs, as before, the unteachableness of the people of the Jews, being in the circumstances they were, as appears by what follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "them that are weaned from the milk, and drawn from the breasts; signifying, that one might as well take children from the breast, such as are just weaned, and instruct them, as to pretend to teach these people the knowledge of divine things, or cause them to understand sound doctrine, that which is agreeable to law and Gospel; so sottish were they become through excessive drinking. Some understand this as a serious answer to the questions, and of persons in a metaphorical sense, who desire and thirst after the sincere milk of the word, as children just taken from the breast, and deprived of it, do; and who are afflicted and distressed, and without the milk of divine comfort, and are like weaned children, humble, meek, and lowly; see Matthew 11:25. Jarchi makes mention of such an interpretation as this, \"them that are weaned from the milk\"; from the law, which is called milk: \"and drawn from the breasts\"; drawn from the disciples of the wise men. It may be understood of such who departed from the sincere milk of the word; and embraced the traditions of the elders. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "them that are weaned from the milk, and drawn from the breasts; signifying, that one might as well take children from the breast, such as are just weaned, and instruct them, as to pretend to teach these people the knowledge of divine things, or cause them to understand sound doctrine, that which is agreeable to law and Gospel; so sottish were they become through excessive drinking. Some understand this as a serious answer to the questions, and of persons in a metaphorical sense, who desire and thirst after the sincere milk of the word, as children just taken from the breast, and deprived of it, do; and who are afflicted and distressed, and without the milk of divine comfort, and are like weaned children, humble, meek, and lowly; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jarchi makes mention of such an interpretation as this, \"them that are weaned from the milk\"; from the law, which is called milk: \"and drawn from the breasts\"; drawn from the disciples of the wise men. It may be understood of such who departed from the sincere milk of the word; and embraced the traditions of the elders. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{h} Whom shall he teach knowledge? and whom shall he make to understand doctrine? them that are weaned from the milk, and drawn from the breasts.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Whom shall he teach knowledge? and whom shall he make to understand doctrine? ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "them that are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " weaned from the milk, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " drawn from the breasts.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) For there was no one that was able to understand any good doctrine: but were foolish and as unfit as young babes.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The retort of the revellers to Isaiah’s recriminations. The meaning is: “Who are we that we should thus be lectured by this man? Are we newly-weaned infants, &c.?” (cf. R.V.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whom will he teach knowledge?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " expresses the injured self-consciousness of the priests; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whom will he make to understand doctrine?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that of the prophets. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doctrine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " R.V. has ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the message;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the word commonly means “report,” but here it denotes “that which is heard” (by prophetic audition) from the Lord, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 28:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "9–13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The occasion of this remarkable encounter was probably a feast held to celebrate the renunciation of allegiance to Assyria. Isaiah has surprised the drunkards over their cups and administered some such rebuke as we read in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 28:7-8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:7-8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". (On the excesses that often accompanied sacrificial meals, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Whom shall he teach",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? A sudden and abrupt transition. The best explanation seems to be that suggested by Jerome, and followed by Bishop Lowth and most commentators, viz. that the prophet dramatically introduces his adversaries as replying to him with taunting speeches. \"Whom does he think he is teaching?\" they ask. \"Mere children, just weaned from their mother's milk, and taken away from the breast? Does he forget that we are grown men - nay, priests and prophets? And what poor teaching it is! What 'endless petty feazing'! (Delitzsch) - precept upon precept,\" etc. The intention is to throw ridicule upon the smallness and vexatious character of the prophet's interminable and uninterrupted chidings (Delitzsch). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Knowledge... doctrine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Technical terms in Isaiah's teaching, which his adversaries seem to have ridiculed as \"catch-words.\" The term translated \"doctrine\" means properly \"tidings,\" and involves the idea that the prophet obtained the teaching so designated by direct revelation from God. Isaiah 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Whom then would he teach knowledge? And to whom make preaching intelligible? To those weaned from the milk? To those removed from the breast? For precept upon precept, precept upon precept, line upon line, line upon line, a little here, a little there!\" They sneer at the prophet, that intolerable moralist. They are of age, and free; and he does not need to bring knowledge to them (da‛ath as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or make them understand the proclamation. They know of old to what he would lead. Are they little children that have just been weaned (on the constructives, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ges. 114, 1), and who must let themselves be tutored? For the things he preaches are nothing but endless petty teazings. The short words (tsâv, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), together with the diminutive זעיר (equivalent to the Arabic sugayyir, mean, from sagı̄r, small), are intended to throw ridicule upon the smallness and vexatious character of the prophet's interminable and uninterrupted chidings, as ל ( equals  על, אל; comp. יסף ל, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") implies that they are; just as the philosophers in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " call Paul a σπερμολόγος, a collector of seeds, i.e., a dealer in trifles. And in the repetition of the short words we may hear the heavy babbling language of the drunken scoffers. ",
        "children": []
      }
    ]
  }
]