[{"num":19,"verse":"Some time later, when Nachash the king of the people of ‘Amon died, his son became king in his place. "},{"num":2,"verse":"David said, “I will be kind to Hanun the son of Nachash, because his father showed grace to me.” So David sent messengers to comfort him about his father."},{"num":3,"verse":"but the leaders of the people of ‘Amon said to Hanun, “Do you really think David is honoring your father by sending people to comfort you? Haven’t his servants come to you in order to look the city over, overthrow it and reconnoiter the land?” "},{"num":4,"verse":"So Hanun took David’s servants, shaved them, cut off their clothes halfway up, at their hips, and then sent them away. "},{"num":5,"verse":"Some people reported to David how the men had been treated. He sent a delegation to meet them, because the men had been deeply humiliated. The king said, “Stay in Yericho until your beards have grown back, and then return.”"},{"num":6,"verse":"Aware that they had made themselves utterly abhorrent to David, Hanun and the people of ‘Amon sent thirty-three tons of silver to hire chariots and horsemen from Aram-Naharayim, Aram-Ma‘akhah and Tzovah. "},{"num":7,"verse":"They hired 32,000 chariots, as well as the king of Ma‘akhah with his people, who came and pitched their camp in front of Meidva. Then the people of ‘Amon assembled themselves from their cities and went out to fight. "},{"num":8,"verse":"When David heard of it, he sent Yo’av with his entire army of trained soldiers."},{"num":9,"verse":"The army of ‘Amon came out and went into battle formation at the city gate, while the kings who had come were alone in the countryside. "},{"num":10,"verse":"When Yo’av saw that he would be fighting on two fronts, ahead and behind, he chose the best troops of Isra’el to deploy against Aram; "},{"num":11,"verse":"while the rest of the army he put under the command of Avishai his brother to deploy against the army of ‘Amon. "},{"num":12,"verse":"He said, “If Aram is too strong for me, you help me; but if the army of ‘Amon is too strong for you, then I will help you. "},{"num":13,"verse":"Take courage, and let’s be strong for the sake of our people and the cities of our God. May Adonai do what seems good to him.”"},{"num":14,"verse":"So Yo’av and the people with him went to engage Aram in battle, and they fled before him. "},{"num":15,"verse":"When the people of ‘Amon saw that Aram had fled, they likewise fled before Avishai his brother and retreated into the city. Then Yo’av went to Yerushalayim."},{"num":16,"verse":"When Aram saw that Isra’el had gotten the better of them, they sent messengers and brought out the people of Aram who lived beyond the [Euphrates] River, with Shofakh the commander of Hadar‘ezer’s army at their head. "},{"num":17,"verse":"It was reported to David; so he gathered all Isra’el together and crossed the Yarden to engage them. David deployed his forces for battle against Aram; and after he had done so, fought them. "},{"num":18,"verse":"But Aram fled before Isra’el; David killed 7,000 chariot-drivers and 40,000 foot soldiers from Aram; and he killed Shofakh the commander of the army. "},{"num":19,"verse":"When all Hadar‘ezer’s servants saw that they had been defeated by Isra’el, they made peace with David and became his subjects; and Aram would no longer help the people of ‘Amon."}]