[{"num":19,"verse":"Now it came to pass after this, that Nachash Melech Bnei Ammon died, and bno reigned in his place."},{"num":2,"verse":"And Dovid said, I will show chesed unto Chanun Ben Nachash, because aviv (his father) showed chesed to me. And Dovid sent malachim to bring condolences to him concerning aviv. So the avadim of Dovid came into the eretz Bnei Ammon to Chanun, to console him."},{"num":3,"verse":"But the sarim of the Bnei Ammon said to Chanun, Thinkest thou that Dovid doth honor avicha, that he hath sent menachamim (comforters) unto thee? Are not his avadim come unto thee for to reconnoiter, and to overthrow, and to spy out ha’aretz?"},{"num":4,"verse":"Therefore Chanun arrested Dovid’s avadim, and shaved them, and cut off their garments in the middle at the buttocks, and sent them away."},{"num":5,"verse":"Then there went certain ones, and told Dovid about the anashim. And he sent to meet them, for the anashim were greatly humiliated. And HaMelech said, Tarry at Yericho until your zakan be grown, and then return."},{"num":6,"verse":"And when the Bnei Ammon saw that they had made themselves odious to Dovid, Chanun and the Bnei Ammon sent elef kikar (talents) kesef to hire them chariots and parashim out of Aram Naharayim, and out of Aram Ma’achah, and out of Tzovah."},{"num":7,"verse":"So they hired thirty and two elef chariots, and Melech Ma’achah and his troop, who came and encamped before Meidva. And the Bnei Ammon gathered themselves together from their towns, and moved out for milchamah."},{"num":8,"verse":"And when Dovid heard of it, he sent Yoav, and kol tzava hagibborim."},{"num":9,"verse":"And the Bnei Ammon came out, and drew up for milchamah before the gate of the Ir, and the melachim that were come were by themselves in the sadeh."},{"num":10,"verse":"Now when Yoav saw that the milchamah was set against him before and behind, he chose out of all the best of Yisroel, and deployed them to engage Aram (the Syrians)."},{"num":11,"verse":"And the rest of the people he delivered unto the yad of Avishai his brother, and they deployed to engage the Bnei Ammon."},{"num":12,"verse":"And he said, If the Syrians be too strong for me, then thou shalt save me, but if the Bnei Ammon be too strong for thee, then I will save thee."},{"num":13,"verse":"Chazak (Be strong)! And let us behave ourselves valiantly for our people, and for the towns of Eloheinu, and let Hashem do that which is hatov in His eyes."},{"num":14,"verse":"So Yoav and the troop that were with him drew near before the Syrians unto the milchamah; and they fled before him."},{"num":15,"verse":"And when the Bnei Ammon saw that the Syrians were fled, they likewise fled before Avishai his brother, and entered into the ir [Rabbah]. Then Yoav returned to Yerushalayim."},{"num":16,"verse":"And when the Syrians saw that they were routed before Yisroel, they sent malachim, and drew forth the Syrians that were beyond the River, and Shophach sar tzava Hadadezer went before them."},{"num":17,"verse":"And it was told Dovid; and he gathered kol Yisroel, and crossed over Yarden, and came upon them, and set the battle in array against them. So when Dovid had so deployed, they fought with him."},{"num":18,"verse":"But the Syrians fled before Yisroel; and Dovid slaughtered of the Syrians shivah alafim in chariots, and forty elef foot soldiers, and killed Shophach sar hatzava."},{"num":19,"verse":"And when avadim of Hadadezer saw that they were routed before Yisroel, they made shalom with Dovid, and became his avadim; neither would the Syrians help the Bnei Ammon any more. [T.N. 2Sm chp 11 is not repeated here, but the going of Dovid to Rabbah‖-see 2Sm 12:27-29‖is elucidated. In the hero lists, it is important to remember that some in their heroism were corruptible and some were incorruptible, Uriah being one of the latter]"}]