[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The nakedness of thy brother’s wife.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Though alliance with a brother’s wife is here forbidden—the prohibition, according to the administrators of the law during the second Temple, extending to illicit commerce or marriage in case she is divorced from her husband during the lifetime of her husband—and though the offenders are threatened with the curse of childlessness (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), yet the law on this point is by no means absolute. Under certain conditions the law enjoins it as a moral and civil duty for a man to marry his brother’s widow. If a brother dies without issue, it is incumbent upon each surviving brother in succession to marry the widow, and if the brother-in-law refused to perform the sacred duty, the widow made him pass through a ceremony in which she heaped upon him the greatest indignity. This clearly shows that the prohibition here could not be based upon the ground of incest, since that which is inherently incestuous the Divine law itself would under no circumstances have set aside. This duty the surviving brother-in-law had to perform to the widows of as many of his brothers as happened to die without issue. A striking illustration of this fact occurred whilst Jehudah the Holy was president of the Sanhedrin. Twelve widows appealed to their brother-in-law to perform the duty of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Levir. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He refused to marry them because he saw no prospect how to maintain such an additional number of wives, and possibly a large increase of children. The case came before the President of the Sanhedrin, who not only decided that he must marry them all, but promised that if he would do the duty enjoined upon him by the Law of Moses, he himself would maintain the family, and their children in case there should be any, every Sabbatical year, when no produce was got from the land, which was at rest. The offer was accepted by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Levir, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and he accordingly married his twelve sisters-in-law. After three years these twelve wives appeared with thirty-six children before Jehudah the Holy, to claim the promised alimony, as it was the Sabbatical year, and they actually obtained it. To this day this law is in force among the orthodox Jews. When a man dies without issue, the widow ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ipso facto ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "belongs to the surviving brother, and she is not allowed to marry any one else unless her brother-in-law has gone through the ceremony of publicly renouncing her, which is tantamount to a divorce. This will explain the rendering of the clause before us in the ancient Chaldee Version, “thou shalt not uncover the nakedness of thy brother’s wife in the lifetime of thy brother or after his death if he has children.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 18:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 18:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy brother’s wife — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Unless he died childless, for in that case God afterward commanded that a man should marry his brother’s widow, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the prohibiting of marriages in the more remote degrees of consanguinity, where other moral considerations are less obvious, there is this good reason to be assigned, namely, that marriage being one of the firmest bonds of friendship, it is proper, for the greater good of society, that men should seek to enlarge the ties of friendship and social affection, by uniting, not with those to whom they were before related, but with persons of different families.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-30 Unlawful marriages and fleshly lusts. - Here is a law against all conformity to the corrupt usages of the heathen. Also laws against incest, against brutal lusts, and barbarous idolatries; and the enforcement of these laws from the ruin of the Canaanites. God here gives moral precepts. Close and constant adherence to God's ordinances is the most effectual preservative from gross sin. The grace of God only will secure us; that grace is to be expected only in the use of the means of grace. Nor does He ever leave any to their hearts' lusts, till they have left him and his services.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy brother's wife - That is, if she had children. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The law here expressed was broken by Antipas in his connection with Herodias ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. None of you shall approach to any that is near of kin to him—Very great laxity prevailed amongst the Egyptians in their sentiments and practice about the conjugal relation, as they not only openly sanctioned marriages between brothers and sisters, but even between parents and children. Such incestuous alliances Moses wisely prohibited, and his laws form the basis upon which the marriage regulations of this and other Christian nations are chiefly founded. This verse contains a general summary of all the particular prohibitions; and the forbidden intercourse is pointed out by the phrase, \"to approach to.\" In the specified prohibitions that follow, all of which are included in this general summary, the prohibited familiarity is indicated by the phrases, to \"uncover the nakedness\" [Le 18:12-17], to \"take\" [Le 18:17, 18], and to \"lie with\" [Le 18:22, 23]. The phrase in this sixth verse, therefore, has the same identical meaning with each of the other three, and the marriages in reference to which it is used are those of consanguinity or too close affinity, amounting to incestuous connections.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Neither in his lifetime, nor after his death, and therefore a woman might not marry her husband’s brother, nor might a man marry his wife’s sister, either before or after his wife’s death, for so all the prohibitions are to be understood; which will give light to ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 18:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 18:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". But God, who can undoubtedly dispense with his own laws, did afterwards make one exception to this rule, of which see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 25:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 25:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thou shalt not uncover the nakedness of thy brother's wife,.... Neither debauch her nor after the death of the brother marry her, that is, unless he dies without issue; and then, by another law, he was obliged to marry her, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; hence the Targum of Jonathan adds; by way of explanation.\"in the life of thy brother, or after his death, if he has children,''but then that law was but an exception from this general rule, and so did not make it void in other respects, but bound it the more strongly; and besides, it was a special and peculiar law to the Jews, until the Messiah came to make it manifest of what tribe and family he came; and the reason of it ceasing, the law itself is ceased, and so neither binding on Jews nor Gentiles: hence John the Baptist boldly told Herod to his face, that it was not lawful for him to have his brother's wife ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and even such marriages were condemned by the very Heathens: Dionysius Halicarnassensis (n) relates, that Lucius Tarquinius, Superbus, his brother being removed by poison, took Tullia to wife, whom his brother Aruntus had before married; but the historian calls it , \"an unholy marriage\", and abominable both among Greeks and Barbarians: Plutarch also reports (o), that Marcus Crassus married the wife of his deceased brother; but such marriages are condemned by the same writer, as they are by the ancient Christians in their councils and canons (p); now by this same law, if it is not lawful for a man to have his brother's wife, then it is not lawful for her to have her sister's husband; or, in other words, if it is not lawful for a woman to marry two brothers, then it is not lawful for a man to marry two sisters: the case of Jacob will not countenance such a marriage, since he was imposed upon and deceived; and such marriages have also been disapproved of by the Heathens and Christians: Honorius the emperor married two daughters of Stilico, one after another, but the unhappy exit of both sisters showed that those marriages were not approved of by God, for they both died premature deaths, leaving no children (q): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it is thy brother's nakedness; that is, his wife is, being by marriage one flesh with him, and his brother being so to him, the relation is too near to intermarry, and more especially when there is issue by the first, which connects them strongly. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Hist. l. 4. (o) In Vita M. Crassi. (p) Canon Apostol. can. 19. Concil. Neocaesar. can. 2.((q) Zonaras, l. 3. apud Zanchium de Sponsalibus, l. 4. c. 1. p. 786. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Hist. l. 4. (o) In Vita M. Crassi. (p) Canon Apostol. can. 19. Concil. Neocaesar. can. 2.((q) Zonaras, l. 3. apud Zanchium de Sponsalibus, l. 4. c. 1. p. 786. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thou shalt not uncover the nakedness of thy {h} brother's wife: it is thy brother's nakedness.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thou shalt not uncover the nakedness of thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " brother's wife: it ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thy brother's nakedness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Because the idolaters, among whom God's people had dwelt and would dwell, were given to these horrible incests, God charges his own to beware of them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The eighth ease of incest is intercourse with a brother's wife. Yet this is commanded under certain circumstances in the Book of Deuteronomy, and was practiced in patriarchal times (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 38:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The following are the circumstances under which it is commanded. \"If brethren dwell together, and one of them die, and have no child, the wife of the dead shall not marry without unto a stranger: her husband's brother shall go in unto her, and take her to him to wife, and perform the duty of an husband's brother unto her\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It has been asked, \"How can the same thing be forbidden as immoral in Leviticus, and commanded as a duly in Deuteronomy?\" Bishop Wordsworth replies, \"In a special case, for a special reason applicable only to the Jews, God was pleased to dispense with that law, and in the plenitude of his omnipotence to change the prohibition into a command....  God cannot command anything that is sinful. For sin is 'transgression of the Law' (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and whatever he commands is right. But it would be presumptuous to say that ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may dispense with God's law concerning marriage, because he in one case dispensed with it; as it would be impious to affirm that murder is not immoral, and may be committed by us, bemuse God, who is the sole Arbiter of life and death, commanded Abraham to slay his son Isaac.\" The levirate marriage was not a concession to the desires of the second brother, but a duty enjoined for a family or tribal purpose, and it was plainly at all times must distasteful. Thus Onan refused to perform his duty to Er's wife (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 38:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the legislation in Deuteronomy anticipates objection on the part of the brother, and institutes an in-suiting ceremony to be gone through by him if he declines to do his duty to his dead brother (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:9, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which we see carried out in some of its details in the case of Ruth's kinsman (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ruth 4:7, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Indeed, in such a marriage, the second husband seems rather to have been regarded as the continuation of the first husband than as having a substantive existence of his own as a married man. He performed a function in order \"that the name of his brother which is dead may not be put out of Israel\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"to raise up the name of the dead upon his inheritance, that the name of the dead be not cut off from among his brethren\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ruth 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The second husband's position may be compared to that of the concubine presented by Rachel to her husband. \"Behold my maid Bilhah, go in unto her; and she shall bear upon my knees, that I may also have children by her\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The whole object of the rule was that, as the elder brother could not keep up the flintily by begetting an heir, the younger brother should do it for him after his death. Leviticus 18:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Marriage with a brother's wife was a sin against the brother's nakedness, a sexual defilement, which God would punish with barrenness. This prohibition, however, only refers to cases in which the deceased brother had left children; for if he had died childless, the brother not only might, but was required to marry his sister-in-law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]