[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sent messengers, and took her.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This does not imply the use of violence. Bath-sheba, however beautiful, appears from the narrative of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 2:13-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to have been a woman of little discretion, and now yielded to David’s will without resistance, perhaps flattered by the approach of the king.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For she was.—Read, and she was. Under the Law she was unclean until the evening. She therefore remained in David’s palace until that time, scrupulous in this detail while conscious of a capital crime and a high offence against God. David, nevertheless, was a far greater offender.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "For she was.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Read, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and she was. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Under the Law she was unclean until the evening. She therefore remained in David’s palace until that time, scrupulous in this detail while conscious of a capital crime and a high offence against God. David, nevertheless, was a far greater offender.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 11:4. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "David sent messengers and took her — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— From her own house into his palace, not by force, but by persuasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he lay with her — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See how all the way to sin is down hill! When men begin they cannot soon stop themselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And she returned unto her house — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "With a guilty conscience, and oppressed with terror, no doubt; for she had committed a sin for which the law condemned her to be stoned. She returned, it is probable, early in the morning, to prevent discovery. But how little did it avail to conceal from man a crime, of the commission of which the holy and sin-avenging God, who is no respecter of persons, had been a witness. Alas for poor Bath-sheba! Her confusion and distress were doubtless unutterable. But, in the mean time who can describe the wretched state of David’s mind, when the tumult of passion was subsided, Bath-sheba departed, and reason and reflection returned! “The calm reflections of a spirit truly religious,” says Dr. Delaney, “will best imagine the horrors of so complicated a guilt on the recoil of conscience; when all those passions whose blandishments, but a few moments before, deluded, seduced, and overset his reason, now resumed their full deformity, or rushed into their contrary extremes; desire, into distraction; the sweets of pleasure, into bitterness of soul; love, into self-detestation; and hope, almost into the horrors of despair. The wife of one of his own worthies, apparently an innocent and a valuable woman, abused, and tainted, and brought to the very brink of ruin and infamy! A brave man basely dishonoured! and a faithful subject irreparably injured! The laws of God trampled under foot, of that God who had so eminently distinguished, exalted, and honoured him! Well might he cry out, in the anguish of this distracted condition, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fearfulness and trembling are come upon me, and horror hath overwhelmed me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In one word, his condition was now so dreadful that it was not easy to bring himself to the presumption of even petitioning for mercy! And this I take to be the true reason why we find no psalm of David penned upon this occasion.” Here we may observe, that any other historian but the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sacred ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "would have endeavoured to draw a veil over the conduct of the admired hero of his story, that his reader might not see him falling into such crimes as would shock us even in the most abandoned of men. But the Scriptures are divine. They were written by persons whom divine inspiration had raised above the low thoughts of the mere human mind, and they therefore proceed in another manner. They give us a faithful account of things, without any false colouring, without partiality to any one, without concealing the blemishes or vices of the most favoured characters. For they were intended as well to instruct us by the sins of these persons as by their virtues, and therefore set forth their example in all its parts, that we may as well learn to shun the former as to imitate the latter. We have in this crime of David with Bath- sheba as strong a picture represented to us, as ever was set before the eyes of men, of the true nature and progress of vice, how it insinuates itself into the corrupt minds of men, how easily it overcomes them, if not resisted, and how it proceeds from bad to worse, till, it may be, it plunges them into the greatest depth of iniquity and misery, even, as we see here, into adultery and murder!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:1-5 Observe the occasions of David's sin; what led to it. 1. Neglect of his business. He tarried at Jerusalem. When we are out of the way of our duty, we are in temptation. 2. Love of ease: idleness gives great advantage to the tempter. 3. A wandering eye. He had not, like Job, made a covenant with his eyes, or, at this time, he had forgotten it. And observe the steps of the sin. See how the way of sin is down-hill; when men begin to do evil, they cannot soon stop. Observe the aggravations of the sin. How could David rebuke or punish that in others, of which he was conscious that he himself was guilty?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Eliam - Or Ammiel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the component words being placed in an inverse order. Bath-sheba was the granddaughter of Ahithophel ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. David sent messengers, and took her—The despotic kings of the East, when they take a fancy for a woman, send an officer to the house were she lives, who announces it to be the royal pleasure she should remove to the palace. An apartment is there assigned to her; and if she is made queen, the monarch orders the announcement to be made that he has made choice of her to be queen. Many instances in modern Oriental history show the ease and despatch with which such secondary marriages are contracted, and a new beauty added to the royal seraglio. But David had to make a promise, or rather an express stipulation, to Bath-sheba, before she complied with the royal will (1Ki 1:13, 15, 17, 28); for in addition to her transcendent beauty, she appears to have been a woman of superior talents and address in obtaining the object of her ambition; in her securing that her son should succeed on the throne; in her promptitude to give notice of her pregnancy; in her activity in defeating Adonijah's natural expectation of succeeding to the crown; in her dignity as the king's mother—in all this we see very strong indications of the ascendency she gained and maintained over David, who, perhaps, had ample leisure and opportunity to discover the punishment of this unhappy connection in more ways than one [Taylor, Calmet].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "David sent and took her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from her own house into his palace, not by force, but by persuasion, as desiring to speak with her. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "She came in unto him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into his palace and chamber, as he desired. For she was purified, to wit, from her menstruous pollution, according to the law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 18:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 18:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; which is here noted as the reason, either why David pursued his lustful desire, or why she so easily yielded to it, because she was not under that pollution which might alienate her from it; or rather, why she so readily conceived, that time being observed by Aristotle and others to be the most likely time for conception. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And David sent messengers,.... To invite her to his palace: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and took her; not by force, but through persuasion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and she came in unto him; into the apartment where he was: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he lay with her; she consenting to it, being prevailed upon, and drawn into it through the greatness and goodness of the man, which might make the sin appear the lesser to her. This is recorded to show what the best of men are, when left to themselves; how strong and prevalent corrupt nature is in regenerate persons, when grace is not in exercise; what need the saints stand in of fresh supplies of grace, to keep them from falling; what caution is necessary to everyone that stands, lest he fall; and that it becomes us to abstain from all appearance of sin, and whatever leads unto it, and to watch and pray that we enter not into temptation; and such a record as this is an argument for the integrity of the Scriptures, that they conceal not the faults of the greatest favourites mentioned in them, as well as it serves to prevent despair in truly penitent backsliders: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for she was purified from her uncleanness; this clause is added in a parenthesis, partly to show the reason of her washing herself, which was not for health and pleasure, and to cool herself in a hot day, but to purify herself from her menstruous pollution, according to the law in Leviticus 15:19; the term of her separation being expired; and partly to give a reason why she the more easily consented, and he was the more eager to enjoy her; and in this he sinned, not that he did not lie with an unclean person; but, then, as some observe, he did that which was much worse, he committed adultery; also this may be added to observe, that she was the more apt for conception, as Ben Gersom notes, and to account for the quickness of it, with which the philosopher (i) agrees: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for she was purified from her uncleanness; this clause is added in a parenthesis, partly to show the reason of her washing herself, which was not for health and pleasure, and to cool herself in a hot day, but to purify herself from her menstruous pollution, according to the law in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the term of her separation being expired; and partly to give a reason why she the more easily consented, and he was the more eager to enjoy her; and in this he sinned, not that he did not lie with an unclean person; but, then, as some observe, he did that which was much worse, he committed adultery; also this may be added to observe, that she was the more apt for conception, as Ben Gersom notes, and to account for the quickness of it, with which the philosopher (i) agrees: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and she returned unto her house; whether that evening, or next morning, or how long she stayed, is not said. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Aristot. Hist. Animal. l. 7. c. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) Aristot. Hist. Animal. l. 7. c. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And David sent messengers, and took her; and she came in unto him, and he lay with her; for she was purified from her uncleanness: and she returned unto her house.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "David sent messengers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Bath-sheba cannot be acquitted from blame, for it does not appear that she offered any resistance. Vanity and ambition prevailed over the voice of conscience. “Cupido dominandi cunctis affectibus flagrantior est.” “The lust of power burns more fiercely than any other passion” (Tac. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ann. XV.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 53).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "David sent messengers, and took",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". David's fall seems as sudden as it was complete; but we may feel sure that there had been gradual preparation for it during the previous period of great prosperity. David had always been a man of strong passions, and the large harem he had set up at Jerusalem, so far from satisfying him, only intensified his lust. And now he who had previously shown himself so chivalrous and noble stoops to robbing one of his own officers of his honour. And stern and terrible was the punishment. When he sent those messengers, who were some of the vile people who hang about great personages, ready to minister to their sins, he was preparing the way for his daughter's disgrace, for the murder of Amnon, for Absalom's rebellion and death, and for the death of Adonijah. From that day his own house was the scene of horrible crimes, feuds, scandals, and miseries of every kind; and the long interval after his repentance, between the birth of Solomon and David's death, is passed over in gloomy silence. No act of the penitent king after his restoration to the throne is deemed worthy of record. He was pardoned, but his place henceforward was not in the light of God's favour, but in shadow and retirement. Men who fall so grievously must be content to be removed into the outer court. Of Bathsheba it must be said that she remained a faithful wife, and bare David four sons besides the one who was the fruit of their adultery, and that she retained her influence over him to the last (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 1:15-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For she was purified from her uncleanness;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and she purified herself from her uncleanness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is, having committed an act of gross immorality, she nevertheless carefully observed the ceremonial enactment commanded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 15:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". She went home unrepentant, and with her conscience defiled, but was all the more scrupulous in performing the rite that purified her outwardly. 2 Samuel 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The information brought to him, that the beautiful woman was married, was not enough to stifle the sensual desires which arose in David's soul. \"When lust hath conceived, it bringeth forth sin\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). David sent for the woman, and lay with her. In the expression \"he took her, and she came to him,\" there is no intimation whatever that David brought Bathsheba into his palace through craft or violence, but rather that she came at his request without any hesitation, and offered no resistance to his desires. Consequently Bathsheba is not to be regarded as free from blame. The very act of bathing in the uncovered court of a house in the heart of the city, into which it was possible for any one to look down from the roofs of the houses on higher ground, does not say much for her feminine modesty, even if it was not done with an ulterior purpose, as some commentators suppose. Nevertheless in any case the greatest guilt rests upon David, that he, a man upon whom the Lord had bestowed such grace, did not resist the temptation to the lust of the flesh, but sent to fetch the woman. \"When she had sanctified herself from her uncleanness, she returned to her house.\" Defilement from sexual intercourse rendered unclean till the evening (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 15:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Bathsheba thought it her duty to observe this statute most scrupulously, though she did not shrink from committing the sin of adultery.",
        "children": []
      }
    ]
  }
]