[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And straightway the father of the child",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": ". . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The whole verse is peculiar to St. Mark. The better MSS. omit “with tears.” The answer of the father shows that the conflict between faith and unfaith was still continuing; but the relative position of the two had altered for the better, and the former was beginning to prevail.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "UNBELIEVING BELIEFMark 9:24",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "UNBELIEVING BELIEF",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We owe to Mark’s Gospel the fullest account of the pathetic incident of the healing of the demoniac boy. He alone gives us this part of the conversation between our Lord and the afflicted child’s father. The poor man had brought his child to the disciples, and found them unable to do anything with him. A torrent of appeal breaks from his lips as soon as the Lord gives him an opportunity of speaking. He dwells upon all the piteous details with that fondness for repetition which sorrow knows so well. Jesus gives him back his doubts. The father said, ‘If thou canst do anything, have compassion on us and help us.’ Christ’s answer, according to the true reading, is not as it stands in our Authorised Version, ‘If thou canst ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "believe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’-throwing, as it were, the responsibility on the man-but it is a quotation of the father’s own word, ‘If Thou ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "canst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ as if He waved it aside with superb recognition of its utter unfitness to the present case. ‘Say not, If Thou canst. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is certain. All things are possible to thee’ {not to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "do",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "get",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} ‘if’-which is the only ‘if’ in the case-’thou believest. I can, and if thy faith lays hold on My Omnipotence, all is done.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That majestic word is like the blow of steel upon flint; it strikes a little spark of faith which lights up the soul and turns the smoky pillar of doubt into clear flame of confidence. ‘Lord, I believe; help Thou mine unbelief.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I think in these wonderful words we have four things-the birth, the infancy, the cry, and the education, of faith. And to these four I turn now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, note here the birth of faith. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, then, note here the birth of faith.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There are many ways to the temple, and it matters little by which of them a man travels, if so be he gets there. There is no royal road to the Christian faith which saves the soul. And yet, though identity of experience is not to be expected, men are like each other in the depths, and only unlike on the surfaces, of their being. Therefore one man’s experience carefully analysed is very apt to give, at least, the rudiments of the experience of all others who have been in similar circumstances. So I think we can see here, without insisting on any pedantic repetition of the same details in every case, in broad outline, a sketch-map of the road. There are three elements here: eager desire, the sense of utter helplessness, and the acceptance of Christ’s calm assurances. Look at these three.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This man knew what he wanted, and he wanted it very sorely. Whosoever has any intensity and reality of desire for the great gifts which Jesus Christ comes to bestow, has taken at least one step on the way to faith. Conversely, the hindrances which block the path of a great many of us are simply that we do not care to possess the blessings which Jesus Christ in His Gospel offers. I am not talking now about the so-called intellectual hindrances to belief, though I think that a great many of these, if carefully examined, would be found, in the ultimate analysis, to repose upon this same stolid indifference to the blessings which Christianity offers. But what I wish to insist upon is that for large numbers of us, and no doubt for many men and women whom I address now, the real reason why they have not trust in Jesus Christ is because they do not care to possess the blessings which Jesus Christ brings. Do you desire to have your sins forgiven? Has purity any attraction for you? Do you care at all about the calm and pure blessings of communion with God? Would you like to live always in the light of His face? Do you want to be the masters of your own lusts and passions? I do not ask you, Do you want to go to Heaven or to escape Hell, when you die? but I ask, Has that future in any of its aspects any such power over you as that it stirs you to any earnestness and persistency of desire, or is it all shadowy and vain, ineffectual and dim? What we Christian teachers have to fight against is that we are charged to offer to men a blessing that they do not want, and have to create a demand before there can be any acceptance of the supply. ‘Give us the leeks and garlics of Egypt,’ said the Hebrews in the wilderness; ‘our soul loatheth this light bread.’ So it is with many of us; we do not want God, goodness, quietness of conscience, purity of life, self-consecration to a lofty ideal, one-thousandth part as much as we want success in our daily occupations, or some one or other of the delights that the world gives. I remember Luther, in his rough way, has a story-I think it is in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Table-talk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-about a herd of swine to whom their keeper offered some rich dainties, and the pigs said, ‘Give us grains.’ That is what so many men do when Jesus Christ comes with His gifts and His blessings. They turn away, but if they were offered some poor earthly good, all their desires would go out towards it, and their eager hands would be scrambling who should first possess it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh brethren, if we saw things as they are, and our needs as they are, nothing would kindle such intensity of longing in our hearts as that rejected or neglected promise of life eternal and divine which Jesus Christ brings. If I could only once wake in some indifferent heart this longing, that heart would have taken at least the initial step to a life of Christian godliness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Further, we have here the other element of a sense of utter helplessness. How often this poor father had looked at his boy in the grip of the fiend, and had wrung his hands in despair that he could not do anything for him! That same sense of absolute impotence is one which we all, if we rightly understand what we need, must cherish. Can you forgive your own sins? Can you cleanse your own nature? Can you make yourselves other than you are by any effort of volition, or by any painfulness of discipline? To a certain small extent you can. In regard to superficial culture and eradication, your careful husbandry of your own wills may do much, but you cannot deal with your deepest needs. If we understand what is required, in order to bring one soul into harmony and fellowship with God, we shall recognise that we ourselves can do nothing to save, and little to help ourselves. ‘Every man his own redeemer,’ which is the motto of some people nowadays, may do very well for fine weather and for superficial experience, but when the storm comes it proves a poor refuge, like the gay pavilions that they put up for festivals, which are all right whilst the sun is shining and the flags are fluttering, but are wretched shelters when the rain beats and the wind howls. We can do nothing for ourselves. The recognition of our own helplessness is the obverse, so to speak, and underside, of confidence in the divine help. The coin, as it were, has its two faces. On the one is written, ‘Trust in the Lord’; on the other is written, ‘Nothing in myself.’ A drowning man, if he tries to help himself, only encumbers his would-be rescuer, and may drown him too. The truest help he can give is to let the strong arm that has cleft the waters for his sake fling itself around him and bear him safe to land. So, eager desire after offered blessings and consciousness of my own impotence to secure them-these are the initial steps of faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And the last of the elements here is, listening to the calm assurance of Jesus Christ: ‘If Thou canst! Do not say that to Me; I can, and because I can, all things are possible for thee to receive.’ In like manner He stands at the door of each of our hearts and speaks to each of our needs, and says: ‘I can satisfy it. Rest for thy soul, cleansing for thy sins, satisfaction for thy desires, guidance for thy pilgrimage, power for thy duties, patience in thy sufferings-all these will come to thee, if thou layest hold of My hand.’ His assurance helps trembling confidence to be born, and out of doubt the great calm word of the Master smites the fire of trust. And we, dear brethren, if we will listen to Him, shall surely find in Him all that we need. Think how marvellous it is that this Jewish peasant should plant Himself in the front of humanity, over against the burdened, sinful race of men, and pledge Himself to forgive and to cleanse their sins, to bear all their sicknesses, to be their strength in weakness, their comfort in sorrow, the rest of their hearts, their heaven upon earth, their life in death, their glory in heaven, and their all in all; and not only should pledge Himself, but in the blessed experience of millions should have more than fulfilled all that He promised. ‘They trusted in Him, and were lightened, and their faces were not ashamed.’ Will you not answer His sovereign word of promise with your ‘Lord, I believe’?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Then, secondly, we have here the infancy of faith. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Then, secondly, we have here the infancy of faith.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As soon as the consciousness of belief dawned upon the father, and the effort to exercise it was put forth, there sprang up the consciousness of its imperfection. He would never have known that he did not believe unless he had tried to believe. So it is in regard to all excellences and graces of character. The desire of possessing some feeble degree of any virtue or excellence, and the effort to put it forth, is the surest way of discovering how little of it we have. On the other side, sorrow for the lack of some form of goodness is itself a proof of the partial possession, in some rudimentary and incipient form, of that goodness. The utterly lazy man never mourns over his idleness; it is only the one that would fain work harder than he does, and already works tolerably hard, who does so. So the little spark of faith in this man’s heart, like a taper in a cavern, showed the abysses of darkness that lay unillumined round about it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus, then, in its infancy, faith may and does coexist with much unfaith and doubt. The same state of mind, looked at from its two opposite ends, as it were, may be designated faith or unbelief; just as a piece of shot silk, according to the angle at which you hold it, may show you only the bright colours of its warp or the dark ones of its weft. When you are travelling in a railway train with the sun streaming in at the windows, if you look out on the one hand you will see the illumined face of every tree and blade of grass and house; and if you look out on the other, you will see their shadowed side. And so the same landscape may seem to be all lit up by the sunshine of belief, or to be darkened by the gloom of distrust. If we consider how great and how perfect ought to be our confidence, to bear any due proportion to the firmness of that upon which it is built, we shall not be slow to believe that through life there will always be the presence in us, more or less, of these two elements. There will be all degrees of progress between the two extremes of infantile and mature faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There follows from that thought this practical lesson, that the discovery of much unbelief should never make a man doubt the reality or genuineness of his little faith. We are all apt to write needlessly bitter things against ourselves when we get a glimpse of the incompleteness of our Christian life and character. But there is no reason why a man should fancy that he is a hypocrite because he finds out that he is not a perfect believer. But, on the other hand, let us remember that the main thing is not the maturity, but the progressive character, of faith. It was most natural that this man in our text, at the very first moment when he began to put his confidence in Jesus Christ as able to heal his child, should be aware of much tremulousness mingling with it. But is it not most unnatural that there should be the same relative proportion of faith and unbelief in the heart and experience of men who have long professed to be Christians? You do not expect the infant to have adult limbs, but you do expect it to grow. True, faith at its beginning may be like a grain of mustard seed, but if the grain of mustard seed be alive it will grow to a great tree, where all the fowls of the air can lodge in the branches. Oh! it is a crying shame and sin that in all Christian communities there should be so many grey-headed babies, men who have for years and years been professing to be Christ’s followers, and whose faith is but little, if at all, stronger-nay! perhaps is even obviously weaker-than it was in the first days of their profession. ‘Ye have need of milk, and not of strong meat,’ very many of you. And the vitality of your faith is made suspicious, not because it is feeble, but because it is not growing stronger.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Notice the cry of infant faith. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Notice the cry of infant faith.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Help Thou mine unbelief’ may have either of two meanings. The man’s desire was either that his faith should be increased and his unbelief ‘helped’ by being removed by Christ’s operation upon his spirit, or that Christ would ‘help’ him and his boy by healing the child, though the faith which asked the blessing was so feeble that it might be called unbelief. There is nothing in the language or in the context to determine which of these two meanings is intended; we must settle it by our own sense of what would be most likely under the circumstances. To me it seems extremely improbable that, when the father’s whole soul was absorbed in the healing of his son, he should turn aside to ask for the inward and spiritual process of having his faith strengthened. Rather he said, ‘Heal my child, though it is unbelief as much as faith that asks Thee to do it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The lesson is that, even when we are conscious of much tremulousness in our faith, we have a right to ask and expect that it shall be answered. Weak faith ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " faith. The tremulous hand ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "does",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " touch. The cord may be slender as a spider’s web that binds a heart to Jesus, but it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "does",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " bind. The poor woman in the other miracle who put out her wasted finger-tip, coming behind Him in the crowd, and stealthily touching the hem of His garment, though it was only the end of her finger-nail that was laid on the robe, carried away with her the blessing. And so the feeblest faith joins the soul, in the measure of its strength, to Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But let us remember that, whilst thus the cry of infant faith is heard, the stronger voice of stronger faith is more abundantly heard. Jesus Christ once for all laid down the law when He said to one of the suppliants at His feet, ‘According to your faith be it unto you.’ The measure of our belief is the measure of our blessing. The wider you open the door, the more angels will crowd into it, with their white wings and their calm faces. The bore of the pipe determines the amount of water that flows into the cistern. Every man gets, in the measure in which he desires. Though a tremulous hand may hold out a cup into which Jesus Christ will not refuse to pour the wine of the kingdom, yet the tremulous hand will spill much of the blessing; and he that would have the full enjoyment of the mercies promised, and possible, must ‘ask in faith, nothing wavering.’ The sensitive paper which records the hours of sunshine in a day has great gaps upon its line of light answering to the times when clouds have obscured the sun; and the communication of blessings from God is intermittent, if there be intermittency of faith. If you desire an unbroken line of mercy, joy, and peace, keep up an unbroken continuity of trustful confidence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. Lastly, we have here the education of faith. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. Lastly, we have here the education of faith.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Christ paid no heed in words to the man’s confession of unbelief, but proceeded to do the work which answered his prayer in both its possible meanings. He responded to imperfect confidence by His perfect work of cure, and, by that perfect work of cure, He strengthened the imperfect confidence which it had answered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus He educates us by His answers-His over-answers-to our poor desires; and the abundance of His gifts rebukes the poverty of our petitions more emphatically than any words of remonstrance beforehand could have done. He does not lecture us into faith, but He blesses us into it. When the Apostle was sinking in the flood, Jesus Christ said no word of reproach until He had grasped him with His strong hand and held him safe. And then, when the sustaining touch thrilled through all the frame, then, and not till then, He said-as we may fancy, with a smile on His face that the moonlight showed-as knowing how unanswerable His question was, ‘O thou of little faith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wherefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " didst thou doubt?’ That is how He will deal with us if we will; over-answering our tremulous petitions, and so teaching us to hope more abundantly that ‘we shall praise Him more and more.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The disappointments, the weaknesses, the shameful defeats which come when our confidence fails, are another page of His lesson-book. The same Apostle of whom I have been speaking got that lesson when, standing on the billows, and, instead of looking at Christ, looking at their wrath and foam, his heart failed him, and because his heart failed him he began to sink. If we turn away from Jesus Christ, and interrupt the continuity of our faith by calculating the height of the breakers and the weight of the water that is in them, and what will become of us when they topple over with their white crests upon our heads, then gravity will begin to work, and we shall begin to sink. And well for us if, when we have sunk as far as our knees, we look back again to the Master and say, ‘Lord, save me; I perish!’ The weakness which is our own when faith sleeps, and the rejoicing power which is ours because it is His, when faith wakes, are God’s education of it to fuller and ampler degrees and depth. We shall lose the meaning of life, and the best lesson that joy and sorrow, calm and storm, victory and defeat, can give us, unless all these make us ‘rooted and grounded in faith.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear friend, do you desire your truest good? Do you know that you cannot win it, or fight for it to gain it, or do anything to obtain it, in your own strength? Have you heard Jesus Christ saying to you, ‘Come . . . and I will give you rest’? Oh! I beseech you, do not turn away from Him, but like this agonised father in our story, fall at His feet with ‘Lord, I believe; help Thou mine unbelief,’ and He will confirm your feeble faith by His rich response.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:14-29 The father of the suffering youth reflected on the want of power in the disciples; but Christ will have him reckon the disappointment to the want of faith. Very much is promised to our believing. If thou canst believe, it is possible that thy hard heart may be softened, thy spiritual diseases may be cured; and, weak as thou art, thou mayest be able to hold out to the end. Those that complain of unbelief, must look up to Christ for grace to help them against it, and his grace will be sufficient for them. Whom Christ cures, he cures effectually. But Satan is unwilling to be driven from those that have been long his slaves, and, when he cannot deceive or destroy the sinner, he will cause him all the terror that he can. The disciples must not think to do their work always with the same ease; some services call for more than ordinary pains.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Said with tears - The man felt the implied rebuke in the Saviour's language; and feeling grieved that he should be thought to be destitute of faith, and feeling deeply for the welfare of his afflicted son, he wept. Nothing can be more touching or natural than this. An anxious father, distressed at the condition of his son, having applied to the disciples in vain, now coming to the Saviour; and not having full confidence that he had the proper qualification to be aided, he wept. Any man would have wept in his condition, nor would the Saviour turn the weeping suppliant away.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I believe - I have faith. I do put confidence in thee, though I know that my faith is not as strong as it should be.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lord - This word here signifies merely \"master,\" or \"sir,\" as it does often in the New Testament. We have no evidence that he had any knowledge of the divine nature of the Saviour, and he applied the word, probably, as he would have done to any other teacher or worker of miracles.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Help thou mine unbelief - Supply thou the defects of my faith. Give me strength and grace to put \"entire\" confidence in thee. Everyone who comes to the Saviour for help has need of offering this prayer. In our unbelief and our doubts we need his aid, nor shall we ever put sufficient reliance on him without his gracious help. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Help thou mine unbelief - Supply thou the defects of my faith. Give me strength and grace to put \"entire\" confidence in thee. Everyone who comes to the Saviour for help has need of offering this prayer. In our unbelief and our doubts we need his aid, nor shall we ever put sufficient reliance on him without his gracious help. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24. And straightway the father of the child cried out, and said with tears, Lord, I believe: help thou mine unbelief—that is, \"It is useless concealing from Thee, O Thou mysterious, mighty Healer, the unbelief that still struggles in this heart of mine; but that heart bears me witness that I do believe in Thee; and if distrust still remains, I disown it, I wrestle with it, I seek help from Thee against it.\" Two things are very remarkable here: First, The felt and owned presence of unbelief, which only the strength of the man's faith could have so revealed to his own consciousness. Second, His appeal to Christ for help against his felt unbelief—a feature in the case quite unparalleled, and showing, more than all protestations could have done, the insight he had attained into the existence of a power in Christ more glorious them any he had besought for his poor child. The work was done; and as the commotion and confusion in the crowd was now increasing, Jesus at once, as Lord of spirits, gives the word of command to the dumb and deaf spirit to be gone, never again to return to his victim.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 9:17\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And straightway the father of the child cried out,.... As soon as ever he found it was put upon his faith, and that the issue of things would be according to that, he expressed himself with much vehemency, being in great distress; partly with indignation at his unbelief, and partly through fear of missing a cure, by reason of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said with tears; repenting of his unbelief, and grieved at the present weakness of his faith; which he very ingenuously confesses, saying, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lord, I believe, help thou mine unbelief; not forward, but out of the way: he found in himself some small degree of faith in the power of Christ, but it was mixed with much unbelief, through the greatness of the child's disorder; and therefore desires it might be removed from him, and he might be helped against it: he saw it was not in his own power to believe; nor had he strength of himself to oppose his unbelief; but that both faith must be given him, and power against unbelief. The Syriac version renders it, \"help\", , \"the defect of my faith\": till up that which is lacking in it, it is very deficient, Lord, increase it; and the Arabic and Ethiopic translate thus, \"help the weakness of my faith\". He found his faith very weak, he desires it might be strengthened, that he might be strong in faith, and give glory to God; and in this way belief is helped, or men helped against it: every believer, more or less, at one time or another, finds himself in this man's case; and also that it is necessary to make use of the same petition; for faith is but imperfect in this life, and often very weak and defective in its exercise. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lord, I believe, help thou mine unbelief; not forward, but out of the way: he found in himself some small degree of faith in the power of Christ, but it was mixed with much unbelief, through the greatness of the child's disorder; and therefore desires it might be removed from him, and he might be helped against it: he saw it was not in his own power to believe; nor had he strength of himself to oppose his unbelief; but that both faith must be given him, and power against unbelief. The Syriac version renders it, \"help\", , \"the defect of my faith\": till up that which is lacking in it, it is very deficient, Lord, increase it; and the Arabic and Ethiopic translate thus, \"help the weakness of my faith\". He found his faith very weak, he desires it might be strengthened, that he might be strong in faith, and give glory to God; and in this way belief is helped, or men helped against it: every believer, more or less, at one time or another, finds himself in this man's case; and also that it is necessary to make use of the same petition; for faith is but imperfect in this life, and often very weak and defective in its exercise. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And straightway the father of the child cried out, and said with tears, Lord, I believe; help thou mine unbelief.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κράξας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": eager, fear-stricken cry; making the most of his little faith, to ensure the benefit, and adding a prayer for increase of faith (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βοήθει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) with the idea that it would help to make the cure complete. The father’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at least was above suspicion. Meyer and Weiss render “help me even if unbelieving,” arguing that the other, more common rendering is at variance with the meaning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βοήθησον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Βοήθει μου τῇ ἀπιστίᾳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "help Thou mine unbelief",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") by removing mine ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unbelief",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or else by healing my son, even though I have not sufficient faith. Comp. the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "help",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βοήθησον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Mark 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Cried out and said (κράξας - ἔλεγεν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The former denoting the inarticulate cry, the ejaculation, followed by the words, \"Lord, I believe,\" etc. ",
        "children": []
      }
    ]
  }
]