[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:41-50 It is repeatedly said of the wicked, Their worm dieth not, as well as, The fire is never quenched. Doubtless, remorse of conscience and keen self-reflection are this never-dying worm. Surely it is beyond compare better to undergo all possible pain, hardship, and self-denial here, and to be happy for ever hereafter, than to enjoy all kinds of worldly pleasure for a season, and to be miserable for ever. Like the sacrifices, we must be salted with salt; our corrupt affections must be subdued and mortified by the Holy Spirit. Those that have the salt of grace, must show they have a living principle of grace in their hearts, which works out corrupt dispositions in the soul that would offend God, or our own consciences.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Their worm - This figure is taken from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 66:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See the notes at that passage. In describing the great prosperity. of the kingdom of the Messiah, Isaiah says that the people of God \"shall go forth, and look upon the carcasses of the men who have transgressed against God.\" Their enemies would be overcome. They would be slain. The people of God would triumph. The figure is taken from heaps of the dead slain in battle; and the prophet says that the number would be so great that their worm - the worm feeding on the dead - would not die, would live long - as long as there were carcasses to be devoured; and that the fire which was used to burn the bodies of the dead would continue long to burn, and would not be extinguished until they were consumed. The figure, therefore, denotes great misery, and certain and terrible destruction. In these verses it is applied to the state beyond the grave, and is intended to denote that the destruction of the wicked will be awful, widespread, and eternal.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is not to be supposed that there will be any \"real\" worm in hell - perhaps no material fire; nor can it be told what was particularly intended by the undying worm. There is no authority for applying it, as is often done, to remorse of conscience, anymore than to any other of the pains and reflections of hell. It is a mere image of loathsome, dreadful, and \"eternal\" suffering. In what that suffering will consist it is probably beyond the power of any living mortal to imagine. The word their, in the phrase \"their worm,\" is used merely to keep up the \"image\" or \"figure.\" Dead bodies putrefying in that valley would be overrun with worms, while the \"fire\" would not be confined to them, but would spread to other objects kindled by combustibles through all the valley. It is \"not\" meant, therefore, that every particular sufferer has a special worm, or has particular sins that cause remorse of conscience. That is a truth, but it does not appear that it is intended to be taught here.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is not to be supposed that there will be any \"real\" worm in hell - perhaps no material fire; nor can it be told what was particularly intended by the undying worm. There is no authority for applying it, as is often done, to remorse of conscience, anymore than to any other of the pains and reflections of hell. It is a mere image of loathsome, dreadful, and \"eternal\" suffering. In what that suffering will consist it is probably beyond the power of any living mortal to imagine. The word their, in the phrase \"their worm,\" is used merely to keep up the \"image\" or \"figure.\" Dead bodies putrefying in that valley would be overrun with worms, while the \"fire\" would not be confined to them, but would spread to other objects kindled by combustibles through all the valley. It is \"not\" meant, therefore, that every particular sufferer has a special worm, or has particular sins that cause remorse of conscience. That is a truth, but it does not appear that it is intended to be taught here.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "43. And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell—See Mt 5:29, 30. The only difference between the words there and here is that there they refer to impure inclinations; here, to an ambitious disposition, an irascible or quarrelsome temper, and the like: and the injunction is to strike at the root of such dispositions and cut off the occasions of them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 9:43\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Where their worm dieth not, and the fire is not quenched. The Persic version renders it, \"because from thence there can be no deliverance\": which is rather an interpretation of these figurative expressions, and is a good one; since they design the eternity of hell torments, as well as point at the anguish and misery of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Where their worm dieth not, and the fire is not quenched.",
        "children": []
      }
    ]
  }
]