[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This is my beloved Son.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It will be noted that St. Mark omits the words “in whom I am well pleased.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "THE TRANSFIGURATION",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "‘THIS IS MY BELOVED SON: HEAR HIM’Mark 9:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘THIS IS MY BELOVED SON: HEAR HIM’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " With regard to the first part of these words spoken at the Transfiguration, they open far too large and wonderful a subject for me to do more than just touch with the tip of my finger, as it were, in passing, because the utterance of the divine words, ‘This is My beloved Son,’ in all the depth of their meaning and loftiness, is laid as the foundation of the two words that come after, which, for us, are the all-important things here. And so I would rather dwell upon them than upon the mysteries of the first part, but a sentence must be spared. If we accept this story before us as the divine attestation of the mystery of the person and nature of Jesus Christ, we must take the words to mean-as these disciples, no doubt, took them to mean-something pointing to a unique and solitary revelation which He bore to the Divine Majesty. We have to see in them the confirmation of the great truth that the manhood of Jesus Christ was the supernatural creation of a direct divine power. ‘Conceived of the Holy Ghost, born of the Virgin Mary’; therefore, ‘that Holy Thing which shall be born of thee shall be called the Son of God.’ And we have to go, as I take it, farther back than the earthly birth, and to say, ‘No man hath seen God at any time-the only begotten Son which is in the bosom of the Father.’ He was the Son here by human birth, and was in the bosom of the Father all through that human life. ‘He hath declared Him,’ and so not only is there here the testimony to the miraculous incarnation, and to the true and proper Divinity and Deity of Jesus Christ, but there is also the witness to the perfectness of His character in the great word, ‘This is My beloved Son,’ which points us to an unbroken communion of love between Him and the Father, which tells us that in the depths of that divine nature there has been a constant play of mutual love, which reveals to us that in His humanity there never was anything that came as the faintest film of separation between His will and the will of the Father, between His heart and the heart of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But this revelation of the mysterious personality of the divine Son, the perfect harmony between Him and God, is here given as the ground of the command that follows: ‘Hear Him.’ God’s voice bids you listen to Christ’s voice-God’s voice bids you listen to Christ’s voice as His voice. Listen to Him when He speaks to you about God-do not trust your own fancy, do not trust your own fear, do not trust the dictates of your conscience, do not consult man, do not listen to others, do not speculate about the mysteries of the earth and the heavens, but go to Him, and listen to the only begotten Son in the bosom of the Father. He declares unto us God; in Him alone we have certain knowledge of a loving Father in heaven. Hear Him when He tells us of God’s tenderness and patience and love. Hear Him above all when He says to us, ‘As Moses lifted up the serpent in the wilderness, even so must the Son of Man be lifted up.’ Hear Him when He says, ‘The Son of Man came to give His life a ransom for many.’ Hear Him when He speaks of Himself as Judge of you and me and all the world, and when He says, ‘The Son of Man shall come in His glory, and before Him shall be gathered all nations.’ Hear Him then. Hear Him when He calls you to Himself. Hear Him when He says to you, ‘Come unto Me all ye that labour and are heavy laden.’ Hear Him when He says, ‘If any man come unto Me he shall never thirst.’ Hear Him when He says, ‘Cast your burden upon Me, and I will sustain you.’ Hear Him when He commands. Hear Him when He says, ‘If ye love Me keep My commandments,’ and when He says, ‘Abide in Me and I in you,’ hear Him then. ‘In all time of our tribulation, in all time of our well-being, in the hour of death, and in the day of judgment,’ let us listen to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear friends there is no rest anywhere else; there is no peace, no pleasure, no satisfaction-except close at His side. ‘Speak Lord! for Thy servant heareth.’ ‘To whom shall we go but unto Thee? Thou hast the words of eternal life.’ Look how these disciples, grovelling there on their faces, were raised by the gentle hand laid upon their shoulder, and the blessed voice that brought them back to consciousness, and how, as they looked about them with dazed eyes, all was gone. The vision, the cloud, Moses and Elias-the lustre and radiance and the dread voice were past, and everything was as it used to be. Christ stood alone there like some solitary figure relieved against a clear daffodil sky upon some extended plain, and there was nothing else to meet the eye but He. Christ is there, and in Him is all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is a summing up of all Divine revelation. ‘God, who at sundry times and in divers manners spake in time past unto the fathers by the prophets, hath, in these last days, spoken unto us by His Son.’ Moses dies, Elijah fades, clouds and symbols and voices and all mortal things vanish, but Jesus Christ stands before us, the manifest God, for ever and ever, the sole illumination of the world, It is also a summing up of all earthly history. All other people go. The beach of time is strewed with wrecked reputations and forgotten glories. And I am not ashamed to say that I believe that, as the ages grow, and the world gets further away in time from the Cross upon Calvary, more and more everything else will sink beneath the horizon, and Christ alone be left to fill the past as He fills the present and the future.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We may make that scene the picture of our lives. Distractions and temptations that lie all round us are ever seeking to drag us away. There is no peace anywhere but in having Christ only-my only pattern, my only hope, my only salvation, my only guide, my only aim, my only friend. The solitary Christ is the sufficient Christ, and that for ever. Take Him for your only friend, and you need none other. Then at death there may be a brief spasm of darkness, a momentary fear, perchance, but then the touch of a Brother’s hand will be upon us as we lie there prone in the dust, and we shall lift up our eyes, and lo! life’s illusions are gone, and life’s noises are fallen dumb, and we ‘see no man any more, save Jesus only,’ with ourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:1-13 Here is a prediction of the near approach Christ's kingdom. A glimpse of that kingdom was given in the transfiguration of Christ. It is good to be away from the world, and alone with Christ: and how good to be with Christ glorified in heaven with all the saints! But when it is well with us, we are apt not to care for others, and in the fulness of our enjoyments, we forget the many wants of our brethren. God owns Jesus, and accepts him as his beloved Son, and is ready to accept us in him. Therefore we must own and accept him as our beloved Saviour, and must give up ourselves to be ruled by him. Christ does not leave the soul, when joys and comforts leave it. Jesus explained to the disciples the prophecy about Elias. This was very suitable to the ill usage of John Baptist.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He wist not - He \"knew not.\" He was desirous of saying something, and he knew not what would be proper. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 9",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mr 9:1-13. Jesus Is Transfigured—Conversation about Elias. ( = Mt 16:28-17:13; Lu 9:27-36).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on [1462]Lu 9:27-36.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 9:2\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there was a cloud that overshadowed them,.... Jesus, Moses, and Elias, and also the disciples; who, according to Luke, entered into it, and so were covered by it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And a voice came out the cloud, saying, this is my beloved Son, hear him. This was the voice of God the Father, bearing a testimony to the sonship of Christ; and was directed, not to Moses and Elias, but to the disciples, enjoining them to hear and obey him, who was the end of the law and prophets; was the great prophet Moses had spoken of, and was to be hearkened to, and whom all the prophets had testified of, and in whom they all centred; See Gill on Matthew 17:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And a voice came out the cloud, saying, this is my beloved Son, hear him. This was the voice of God the Father, bearing a testimony to the sonship of Christ; and was directed, not to Moses and Elias, but to the disciples, enjoining them to hear and obey him, who was the end of the law and prophets; was the great prophet Moses had spoken of, and was to be hearkened to, and whom all the prophets had testified of, and in whom they all centred; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And there was a cloud that overshadowed them: and a voice came out of the cloud, saying, This is my beloved Son: hear him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ἐγένετο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", before ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "νεφέλη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and again before ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φωνὴ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in each place instead of Mt.’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἰδοὺ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; in both cases pointing to something remarkable: an overshadowing cloud, and a mysterious voice from the cloud.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a cloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] not dark and murky, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bright",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), overshadowed the lawgiver and the prophet, and perhaps also the Lord. “Light in its utmost intensity performs the effects of darkness, hides as effectually as the darkness would do.” Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the words of Milton, “dark with excess of light,” and of Wordsworth, “a glorious privacy of light.” Trench’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Studies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 205, 206.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a voice came out of the cloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The same Voice which had been heard once before at the Baptism (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and which was to be heard again when He stood on the threshold of His Passion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), attesting His Divinity and Sonship at the beginning, at the middle, and at the close of His ministry. Looking back afterwards on the scene now vouchsafed to him and to the “sons of thunder,” St Peter speaks of himself and them as “eyewitnesses of His majesty” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 1:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i. e. literally, as men who had been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "admitted and initiated into secret and holy mysteries",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and says that the Voice “came from the excellent glory” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from Him, that is, Who dwelt in the cloud, which was the symbol and the vehicle of the Divine Presence. St John also clearly alludes to the scene in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This is my beloved Son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] “In the words themselves of this majestic installation there is a remarkable honouring of the Old Testament, and of it in all its parts, which can scarcely be regarded as accidental; for the three several clauses of that salutation are drawn severally from the Psalms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the Prophets (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the Law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and together they proclaim Him, concerning whom they are spoken, to be the King, the Priest, and the Prophet of the New Covenant.” Trench, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Studies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 207.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " [7. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Αὐτοῦ ἀκούετε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hear ye Him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": viz. Jesus. For Moses and Elias had by this time disappeared.—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "There came a cloud overshadowing them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The cloud enfolded them all, so that they could not be seen, it was so ample and dense, and yet so bright and shining. St. Matthew (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") says it was \"a ought cloud. The cloud was a symbol of the grandeur and unapproachable glory of God. The disciples were admitted within this cloud that they might have a foretaste of future glory, and that they might be witnesses of what took place under the cloud, and especially that they might be able to give evidence throughout all ages of the voice which they heard come out of the cloud from \"the excellent glory\" (the expression is equivalent to the Hebrew \"Shechinah,\" and St. Peter says (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it came from heaven), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "This is my beloved Son: hear ye him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But at the same time that this cloud was the symbol, it was also the veil of Deity, of the glory of Deity. \"He maketh the clouds his chariot,\" says the psalmist (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Moreover, the cloud abated and subdued the splendor of Christ's appearance, which otherwise the mortal eyes of the disciples could not have borne. It will be observed that St. Mark omits the words, found in St. Matthew (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "),\" in whom I am well pleased.\" So does St. Luke. But it is remarkable that they are found in St. Peter (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); from whence we might have expected to find them here. In St. Luke (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the most approved readings give, \"This is my Son, my chosen (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐκλελεγμένος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").\" The words, \"my beloved Son,\" are impressed upon us in order that epithets so sweet and endearing might kindle our love and devotion. \"Hear ye him\" - not Moses, who has now departed, but Christ himself, the new Author of a new Law. \"Hear ye him\" was not said when our Lord was baptized, because he was then only just proclaimed to the world. But now these words signify the abolition of the old dispensation, and the establishment of the new covenant in Christ. Mark 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sore afraid",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wyc., aghast by dread.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Beloved son",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wyc., most dearworthy. ",
        "children": []
      }
    ]
  }
]