[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:6-10 The enemies of God's people are often very confident of their own strength, and most secure when their day to fall draws nigh. But the pride and insolence of the Jebusites animated David, and the Lord God of hosts was with him. Thus in the day of God's power, Satan's strong-hold, the human heart, is changed into a habitation of God through the Spirit, and into a throne on which the Son of David rules, and brings every thought into obedience to himself. May He thus come, and claim, and cleanse, each of our hearts; and, destroying every idol, may he reign there for ever!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The stronghold of Zion - Or castle ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ancient Zion was the hill on which the temple stood, and the castle seems to have been immediately to the north of the temple. The modern Zion lies to the southwest of the temple.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The same is the city of David - The name afterward given to it 2 Samuel 5:9, and by which it was known in the writer's time. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The same is the city of David - The name afterward given to it ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 5:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and by which it was known in the writer's time. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. the stronghold of Zion—Whether Zion be the southwestern hill commonly so-called, or the peak now level on the north of the temple mount, it is the towering height which catches the eye from every quarter—\"the hill fort,\" \"the rocky hold\" of Jerusalem.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The strong hold of Zion; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. A very strong fort which fitly had built upon Mount Zion; which being taken, the city quickly yielded. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The city of Zion, which was very strongly fortified. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nevertheless, David took the strong hold of Zion,.... A fortress without the city, and separate from it, and which was very strong; and the taking it might facilitate the taking of the city, which yet as appears by what follows, was very difficult to do: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the same is the city of David; it was afterwards so called, where he built an house, and dwelt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the same is the city of David; it was afterwards so called, where he built an house, and dwelt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Nevertheless David took the strong hold of Zion: the same is the city of David.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nevertheless",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. simply, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the strong hold of Zion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See Additional Note VI. p. 239.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The stronghold of Zion: the same is the city of David.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Zion was the hill on the southwestern side of the city; but we learn from ver. 9 that the Jebusites had not occupied the whole of it, but a part only, which was their ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "stronghold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", round which there would be scattered dwellings, as the whole tribe dwelt there. The total area of the hill top was about sixty acres, and it was now quickly covered with houses, and called \"the city of David,\" after its captor. The view of Dr. Birch and others, that the stronghold of Zion was Ophel, is rendered untenable by the fact that this southern tongue of Mount Moriah is completely commanded by other parts of the hill. According to Gesenius, Zion means \"sunny;\" others render it \"the dry hill;\" others, \"lofty;\" and Furst, \"the castle.\" None of these derivations is of any real value, as the word is probably Hittite. 2 Samuel 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "However, David took the citadel Zion, i.e., \"the city of David.\" This explanatory remark anticipates the course of events, as David did not give this name to the conquered citadel, until he had chosen it as his residence and capital (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ציּון (Sion), from ציה, to be dry: the dry or arid mountain or hill. This was the name of the southern and loftiest mountain of Jerusalem. Upon this stood the fortress or citadel of the town, which had hitherto remained in the possession of the Jebusites; whereas the northern portion of the city of Jerusalem, which was upon lower ground, had been conquered by the Judaeans and Benjaminites very shortly after the death of Joshua (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we have one circumstance mentioned which occurred in connection with this conquest. On that day, i.e., when he had advanced to the attack of the citadel Zion, David said, \"Every one who smites the Jebusites, let him hurl into the waterfall (i.e., down the precipice) both the lame and blind, who are hateful to David's soul.\" This is most probably the proper interpretation of these obscure words of David, which have been very differently explained. Taking up the words of the Jebusites, David called all the defenders of the citadel of Zion \"lame and blind,\" and ordered them to be cast down the precipice without quarter. צנּור signifies a waterfall (catarracta) in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the only other passage in which it occurs, probably from צנר, to roar. This meaning may also be preserved here, if we assume that at the foot of the steep precipice of Zion there was a waterfall probably connected with the water of Siloah. It is true we cannot determine anything with certainty concerning it, as, notwithstanding the many recent researches in Jerusalem, the situation of the Jebusite fortress and the character of the mountain of Zion in ancient times are quite unknown to us. This explanation of the word zinnor is simpler than Ewald's assumption that the word signifies the steep side of a rock, which merely rests upon the fact that the Greek word καταρράκτης originally signifies a plunge.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The earliest translators have only resorted to guesses. The Seventy, with their ἁπτέσθω ἐν παραξιφιδι, have combined צנּור with צנּה, which they render now and then μάχαιρα or ῥομφαία. This is also done by the Syriac and Arabic. The Chaldee paraphrases in this manner: \"who begins to subjugate the citadel.\" Jerome, who probably followed the Rabbins, has et tetigisset domatum fistulas (and touched the water-pipes); and Luther, \"und erlanget die Dachrinnen\" (like the English version, \"whosoever getteth up to the gutter:\" Tr.). Hitzig's notion, that zinnor signifies ear (\"whosoever boxes the ears of the blind and lame\") needs no refutation; nor does that of Fr. Bttcher, who proposes to follow the Alexandrian rendering, and refer zinnor to a \"sword of honour or marshal's staff,\" which David promised to the victor.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ויגע should be pointed as a Hiphil ויגּע. The Masoretic pointing ויגּע arises from their mistaken interpretation of the whole sentence. The Chethibh שׂנאו might be the third pers. perf., \"who hate David's soul;\" only in that case the omission of עשׁר would be surprising, and consequently the Keri שׂנאי is to be preferred. \"From this,\" adds the writer, \"the proverb arose, 'The blind and lame shall not enter the house;' \" in which proverb the epithet \"blind and lame,\" which David applied to the Jebusites who were hated by him, has the general signification of \"repulsive persons,\" with whom one does not wish to have anything to do. In the Chronicles not only is the whole of 2 Samuel 5:7 omitted, with the proverb to which the occurrence gave rise, but also the allusion to the blind and lame in the words spoken by the Jebusites (2 Samuel 5:6); and another word of David's is substituted instead, namely, that David would make the man who first smote the Jebusites, i.e., who stormed their citadel, head and chief;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ויגע should be pointed as a Hiphil ויגּע. The Masoretic pointing ויגּע arises from their mistaken interpretation of the whole sentence. The Chethibh שׂנאו might be the third pers. perf., \"who hate David's soul;\" only in that case the omission of עשׁר would be surprising, and consequently the Keri שׂנאי is to be preferred. \"From this,\" adds the writer, \"the proverb arose, 'The blind and lame shall not enter the house;' \" in which proverb the epithet \"blind and lame,\" which David applied to the Jebusites who were hated by him, has the general signification of \"repulsive persons,\" with whom one does not wish to have anything to do. In the Chronicles not only is the whole of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " omitted, with the proverb to which the occurrence gave rise, but also the allusion to the blind and lame in the words spoken by the Jebusites (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and another word of David's is substituted instead, namely, that David would make the man who first smote the Jebusites, i.e., who stormed their citadel, head and chief;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: This is also inserted in the passage before us by the translators of the English version: \"he shall be chief and captain.\" - Tr.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and also the statement that Joab obtained the prize. The historical credibility of the statement cannot be disputed, as Thenius assumes, on the ground that Joab had already been chief (sar) for a long time, according to 2 Samuel 2:13 : for the passage referred to says nothing of the kind; and there is a very great difference between the commander of an army in the time of war, and a \"head and chief,\" i.e., a commander-in-chief. The statement in 2 Samuel 5:8 with regard to Joab's part, the fortification of Jerusalem, shows very clearly that the author of the Chronicles had other and more elaborate sources in his possession, which contained fuller accounts than the author of our books has communicated.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and also the statement that Joab obtained the prize. The historical credibility of the statement cannot be disputed, as Thenius assumes, on the ground that Joab had already been chief (sar) for a long time, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : for the passage referred to says nothing of the kind; and there is a very great difference between the commander of an army in the time of war, and a \"head and chief,\" i.e., a commander-in-chief. The statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with regard to Joab's part, the fortification of Jerusalem, shows very clearly that the author of the Chronicles had other and more elaborate sources in his possession, which contained fuller accounts than the author of our books has communicated.",
            "children": []
          }
        ]
      }
    ]
  }
]