[{"num":14,"verse":"A wise woman makes her home what it should be, but the home of a foolish woman is destroyed by her own actions."},{"num":2,"verse":"Those who live right respect the Lord, but dishonest people hate him."},{"num":3,"verse":"Foolish words cause you trouble; wise words protect you."},{"num":4,"verse":"A barn with no cattle might be clean, but strong bulls are needed for a good harvest."},{"num":5,"verse":"A good witness is one who does not lie. A bad witness is a liar who cannot be trusted."},{"num":6,"verse":"Anyone who makes fun of wisdom will never find it, but knowledge comes easily to those who understand its value."},{"num":7,"verse":"Stay away from fools, there is nothing they can teach you."},{"num":8,"verse":"Wisdom lets smart people know what they are doing, but stupid people only think they know."},{"num":9,"verse":"Fines are needed to make fools obey the law, but good people are happy to obey it."},{"num":10,"verse":"When you are sad, no one else feels the pain; and when you are happy, no one else can really feel the joy."},{"num":11,"verse":"An evil person’s house will be destroyed, but a good person’s family will do well."},{"num":12,"verse":"There is a way that people think is right, but it leads only to death."},{"num":13,"verse":"Laughter might hide your sadness. But when the laughter is gone, the sadness remains."},{"num":14,"verse":"Evil people will be paid back for the wrong they do, and good people will be rewarded for the good they do."},{"num":15,"verse":"Fools believe every word they hear, but wise people think carefully about everything."},{"num":16,"verse":"Wise people are careful and avoid trouble; fools are too confident and careless."},{"num":17,"verse":"A quick-tempered person does stupid things, but it is also true that people don’t like anyone who quietly plans evil."},{"num":18,"verse":"Fools are rewarded with more foolishness. Smart people are rewarded with knowledge."},{"num":19,"verse":"Good people will defeat those who are evil, and the wicked will be forced to show respect to those who live right."},{"num":20,"verse":"The poor have no friends, not even their neighbors, but the rich have many friends."},{"num":21,"verse":"It is wrong to say bad things about your neighbors. Be kind to the poor, and you will be blessed."},{"num":22,"verse":"Whoever works to do good will find love and loyalty. It is a mistake to work at doing evil."},{"num":23,"verse":"If you work hard, you will have plenty. If you do nothing but talk, you will not have enough."},{"num":24,"verse":"A wise person’s reward is wealth, but a fool’s reward is foolishness."},{"num":25,"verse":"A witness who tells the truth saves lives, but one who tells lies hurts others."},{"num":26,"verse":"People who respect the Lord will be safe, and they will make their children feel secure."},{"num":27,"verse":"Respect for the Lord gives true life and will save you from death’s trap."},{"num":28,"verse":"Kings of large nations have great honor. Rulers without a country have nothing."},{"num":29,"verse":"A patient person is very smart. A quick-tempered person makes stupid mistakes."},{"num":30,"verse":"Peace of mind makes the body healthy, but jealousy is like a cancer."},{"num":31,"verse":"Whoever takes advantage of the poor insults their Maker, but whoever is kind to them honors him."},{"num":32,"verse":"The wicked will be defeated by their evil, but good people are protected by their honesty."},{"num":33,"verse":"A wise person is always thinking wise thoughts, but a fool knows nothing about wisdom."},{"num":34,"verse":"Goodness makes a nation great, but sin is a shame to any people."},{"num":35,"verse":"Kings are pleased with intelligent officials, but they will punish shameful ones."}]