[{"num":20,"verse":"1 Zophar showeth, that the wicked and the covetous shall have a short end, 22 though for a time they flourish."},{"num":1,"verse":"Then answered Zophar the Naamathite, and said,"},{"num":2,"verse":"Doubtless my thoughts cause me to answer, and therefore I make haste."},{"num":3,"verse":"I have heard the correction of my reproach: therefore the spirit of mine understanding causeth me to answer."},{"num":4,"verse":"Knowest thou not this of old? and since God placed man upon the earth,"},{"num":5,"verse":"That the rejoicing of the wicked is short, and that the joy of the hypocrites is but a moment?"},{"num":6,"verse":"Though his excellency mount up to the heaven, and his head reach unto the clouds,"},{"num":7,"verse":"Yet shall he perish forever like his dung, and they which have seen him, shall say, Where is he?"},{"num":8,"verse":"He shall flee away as a dream, and they shall not find him, and shall pass away as a vision of the night."},{"num":9,"verse":"So that the eye which had seen him, shall do so no more, and his place shall see him no more."},{"num":10,"verse":"His children shall flatter the poor, and his hands shall restore his substance."},{"num":11,"verse":"His bones are full of the sin of his youth, and it shall lie down with him in the dust."},{"num":12,"verse":"When wickedness was sweet in his mouth, and he hid it under his tongue,"},{"num":13,"verse":"And favored it, and would not forsake it, but kept it close in his mouth,"},{"num":14,"verse":"Then his meat in his bowels was turned: the gall of Asps was in the midst of him."},{"num":15,"verse":"He hath devoured substance, and he shall vomit it: for God shall draw it out of his belly."},{"num":16,"verse":"He shall suck the gall of Asps, and the viper’s tongue shall slay him."},{"num":17,"verse":"He shall not see the rivers, nor the floods and streams of honey and butter."},{"num":18,"verse":"He shall restore the labor, and shall devour no more: even according to the substance shall be his exchange, and he shall enjoy it no more."},{"num":19,"verse":"For he hath undone many: he hath forsaken the poor, and hath spoiled houses which he built not."},{"num":20,"verse":"Surely he shall feel no quietness in his body, neither shall he reserve of that which he desired."},{"num":21,"verse":"There shall none of his meat be left: therefore none shall hope for his goods."},{"num":22,"verse":"When he shall be filled with his abundance, he shall be in pain, and the hand of all the wicked shall assail him."},{"num":23,"verse":"He shall be about to fill his belly, but God shall send upon him his fierce wrath, and shall cause to rain upon him, even upon his meat."},{"num":24,"verse":"He shall flee from the iron weapons, and the bow of steel shall strike him through."},{"num":25,"verse":"The arrow is drawn out, and cometh forth of the body, and shineth of his gall, so fear cometh upon him."},{"num":26,"verse":"All darkness shall be hid in his secret places: the fire that is not blown shall devour him, and that which remaineth in his tabernacle shall be destroyed."},{"num":27,"verse":"The heaven shall declare his wickedness, and the earth shall rise up against him."},{"num":28,"verse":"The increase of his house shall go away: it shall flow away in the day of his wrath."},{"num":29,"verse":"This is the portion of the wicked man from God, and the heritage that he shall have of God, for his words."}]