[{"num":15,"verse":"And the Lord said to Moses and Aaron,"},{"num":2,"verse":"Say to the Israelites, When any man has a running discharge from his body, because of his discharge he is unclean."},{"num":3,"verse":"This shall be [the law concerning] his uncleanness in his discharge: whether his body runs with his discharge or has stopped [running], it is uncleanness in him."},{"num":4,"verse":"Every bed on which the one who has the discharge lies is unclean, and everything on which he sits shall be unclean."},{"num":5,"verse":"Whoever touches that person’s bed shall wash his clothes, and bathe himself in water, and be unclean until the evening."},{"num":6,"verse":"And whoever sits on anything on which he who has the discharge has sat shall wash his clothes and bathe himself in water, and be unclean until the evening."},{"num":7,"verse":"And he who touches the flesh of him who has the discharge shall wash his clothes and bathe himself in water, and be unclean until the evening."},{"num":8,"verse":"And if he who has the discharge spits on him who is clean, then he shall wash his clothes and bathe himself in water, and be unclean until the evening."},{"num":9,"verse":"And any saddle on which he who has the discharge rides shall be unclean."},{"num":10,"verse":"Whoever touches anything that has been under him shall be unclean until evening; and he who carries those things shall wash his clothes and bathe himself in water, and be unclean until evening."},{"num":11,"verse":"Whomever he who has the discharge touches without rinsing his hands in water shall wash his clothes and bathe himself in water, and be unclean until evening."},{"num":12,"verse":"The earthen vessel that he with the discharge touches shall be broken, and every vessel of wood shall be rinsed in water."},{"num":13,"verse":"When he who has a discharge is cleansed of it, he shall count seven days for his purification, then wash his clothes, bathe in running water, and be clean."},{"num":14,"verse":"On the eighth day he shall take two turtledoves or two young pigeons and come before the Lord to the door of the Tent of Meeting and give them to the priest;"},{"num":15,"verse":"And the priest shall offer them, one for a sin offering and the other for a burnt offering; and [he] shall make atonement for the man before the Lord for his discharge."},{"num":16,"verse":"And if any man has a discharge of semen, he shall wash all his body in water, and be unclean until evening."},{"num":17,"verse":"And every garment and every skin on which the sperm comes shall be washed with water, and be unclean until evening."},{"num":18,"verse":"The woman also with whom a man with emission of semen shall lie, they shall both bathe themselves in water, and be unclean until evening."},{"num":19,"verse":"And if a woman has a discharge, her [regular] discharge of blood of her body, she shall be in her impurity or separation for seven days, and whoever touches her shall be unclean until evening."},{"num":20,"verse":"And everything that she lies on in her separation shall be unclean; everything also that she sits on shall be unclean."},{"num":21,"verse":"And whoever touches her bed shall wash his clothes and bathe himself in water, and be unclean until evening."},{"num":22,"verse":"Whoever touches anything she sat on shall wash his clothes and bathe himself in water, and be unclean until evening."},{"num":23,"verse":"And if her flow has stained her bed or anything on which she sat, when he touches it, he shall be unclean until evening."},{"num":24,"verse":"And if any man lie with her and her impurity be upon him, he shall be unclean seven days; and every bed on which he lies shall be unclean."},{"num":25,"verse":"And if a woman has an issue of blood for many days, not during the time of her separation, or if she has a discharge beyond the time of her [regular] impurity, all the days of the issue of her uncleanness she shall be as in the days of her impurity; she shall be unclean."},{"num":26,"verse":"Every bed on which she lies all the days of her discharge shall be as the bed of her impurity, and whatever she sits on shall be unclean, as in her impurity."},{"num":27,"verse":"And whoever touches those things shall be unclean, and shall wash his clothes and bathe himself in water, and be unclean until evening."},{"num":28,"verse":"But if she is cleansed of her discharge, then she shall wait seven days, and after that she shall be clean."},{"num":29,"verse":"And on the eighth day she shall take two turtledoves or two young pigeons and bring them to the priest at the door of the Tent of Meeting;"},{"num":30,"verse":"He shall offer one for a sin offering and the other for a burnt offering; and he shall make atonement for her before the Lord for her unclean discharge."},{"num":31,"verse":"Thus you shall separate the Israelites from their uncleanness, lest they die in their uncleanness by defiling My tabernacle that is in the midst of them."},{"num":32,"verse":"This is the law for him who has a discharge and for him who has emissions of sperm, being made unclean by it;"},{"num":33,"verse":"And for her who is sick with her impurity, and for any person who has a discharge, whether man or woman, and for him who lies with her who is unclean."}]