[{"num":15,"verse":"Adonai said to Moshe and Aharon, "},{"num":2,"verse":"“Tell the people of Isra’el, ‘When any man has a discharge from his body, the discharge is unclean. "},{"num":3,"verse":"The discharge is unclean no matter whether it continues flowing or has stopped; it is still his uncleanness. "},{"num":4,"verse":"Every bed which the person with the discharge lies on is unclean, and everything he sits on is unclean. "},{"num":5,"verse":"Whoever touches his bed is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":6,"verse":"Whoever sits on anything the person with the discharge sat on is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":7,"verse":"Anyone who touches the body of the person with the discharge is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":8,"verse":"If the person with the discharge spits on someone who is clean, the latter is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":9,"verse":"Any saddle that the person with the discharge rides on will be unclean. "},{"num":10,"verse":"Whoever touches anything that was under him will be unclean until evening; he who carries those things is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":11,"verse":"If the person with the discharge fails to rinse his hands in water before touching someone, that person is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":12,"verse":"If the person with the discharge touches a clay pot, it must be broken; if he touches a wooden utensil, it must be rinsed in water."},{"num":13,"verse":"“‘When a person with a discharge has become free of it, he is to count seven days for his purification. Then he is to wash his clothes and bathe his body in running water; after that, he will be clean. "},{"num":14,"verse":"On the eighth day, he is to take for himself two doves or two young pigeons, come before Adonai to the entrance of the tent of meeting and give them to the cohen. "},{"num":15,"verse":"The cohen is to offer them, the one as a sin offering and the other as a burnt offering; thus the cohen will make atonement for him on account of his discharge before Adonai."},{"num":16,"verse":"(RY: vii, LY: vi) “‘If a man has a seminal emission, he is to bathe his entire body in water; he will be unclean until evening. "},{"num":17,"verse":"Any clothing or leather on which there is any semen is to be washed with water; it will be unclean until evening. "},{"num":18,"verse":"If a man goes to bed with a woman and has sexual relations, both are to bathe themselves in water; they will be unclean until evening."},{"num":19,"verse":"“‘If a woman has a discharge, and the discharge from her body is blood, she will be in her state of niddah for seven days. Whoever touches her will be unclean until evening. "},{"num":20,"verse":"Everything she lies on or sits on in her state of niddah will be unclean. "},{"num":21,"verse":"Whoever touches her bed is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":22,"verse":"Whoever touches anything she sits on is to wash his clothes and bathe himself in water; he will be unclean until evening. "},{"num":23,"verse":"Whether he is on the bed or on something she sits on, when he touches it, he will be unclean until evening. "},{"num":24,"verse":"If a man goes to bed with her, and her menstrual flow touches him, he will be unclean seven days; and every bed he lies on will be unclean."},{"num":25,"verse":"“‘If a woman has a discharge of blood for many days not during her period, or if her discharge lasts beyond the normal end of her period, then throughout the time she is having an unclean discharge she will be as when she is in niddah — she is unclean. "},{"num":26,"verse":"Every bed she lies on at any time while she is having her discharge will be for her like the bed she uses during her time of niddah; and everything she sits on will be unclean with uncleanness like that of her time of niddah. "},{"num":27,"verse":"Whoever touches those things will be unclean; he is to wash his clothes and bathe himself in water; he will be unclean until evening."},{"num":28,"verse":"“‘If she has become free of her discharge, she is to count seven days; after that, she will be clean. "},{"num":29,"verse":"(LY: vii) On the eighth day, she is to take for herself two doves or two young pigeons and bring them to the cohen at the entrance to the tent of meeting. "},{"num":30,"verse":"The cohen is to offer the one as a sin offering and the other as a burnt offering; thus the cohen will make atonement for her before Adonai on account of her unclean discharge."},{"num":31,"verse":"(Maftir) “‘In this way you will separate the people of Isra’el from their uncleanness, so that they will not die in a state of uncleanness for defiling my tabernacle which is there with them."},{"num":32,"verse":"“‘Such is the law for the person who has a discharge; for the man who has a seminal emission that makes him unclean; "},{"num":33,"verse":"for the woman in niddah during her menstrual period; for the person, man or woman, with a discharge; and for the man who has sexual relations with a woman who is unclean."}]