[{"header":"Instructions About Bodily Discharges"},{"num":15,"verse":"Then Yahweh spoke to Moses and to Aaron, saying, "},{"num":2,"verse":"“Speak to the Israelites, and you shall say to them, ‘Any man when a fluid discharge occurs from his body, his fluid discharge is unclean. "},{"num":3,"verse":"And this becomes his uncleanness in his fluid discharge: whether his body secretes his fluid discharge or his body blocks his fluid discharge, it is his uncleanness. "},{"num":4,"verse":"Any bed upon which the person who discharges lies down becomes unclean, and any object upon which he sits becomes unclean. "},{"num":5,"verse":"And anyone who touches his bed must wash his garments and shall wash himself with water, and he shall be unclean until evening. "},{"num":6,"verse":"And the person who sits on the object upon which the person who discharges has sat must wash his garments, and he shall wash himself with water, and he shall be unclean until the evening. "},{"num":7,"verse":"And the person who touches the body of the person who discharges must wash his garments, and he shall wash himself with water, and he shall be unclean until the evening. "},{"num":8,"verse":"And if the person who discharges spits on one who is clean, then that one shall wash is garments, and he shall wash himself with water, and he shall be unclean until the evening. "},{"num":9,"verse":"And any saddle upon which the person who discharges rides becomes unclean. "},{"num":10,"verse":"And any person who touches anything that happened to be under him becomes unclean until the evening, and the person who carries them must wash his garments, and he shall wash himself with water, and he shall be unclean until the evening. "},{"num":11,"verse":"And anyone whom the person who discharges might touch without rinsing off his hands with water shall wash his garments, and he shall wash himself with water, and he shall be unclean until the evening. "},{"num":12,"verse":"But a clay vessel that the person who discharges touches must be broken, and any wood object must be rinsed with water."},{"num":13,"verse":"“‘And when the person who discharges becomes clean from his body fluid discharge, he shall count for himself seven days for his cleansing; then he shall wash his garments, and he shall wash his body with fresh water, and he shall be clean. "},{"num":14,"verse":"Then on the eighth day he shall take for himself two turtledoves or two young doves, and he shall come before Yahweh at the tent of assembly’s entrance, and he shall give them to the priest. "},{"num":15,"verse":"And the priest shall sacrifice one as a sin offering and the other as a burnt offering, and so the priest shall make atonement for him before Yahweh from his body fluid discharge."},{"num":16,"verse":"“‘And if an emission of semen goes out from anyone, then he shall wash all of his body with water, and he shall be unclean until the evening. "},{"num":17,"verse":"And any garment and anything leather on which is an emission of semen shall be washed with water, and it shall be unclean until the evening. "},{"num":18,"verse":"If there is a woman with whom a man lies down and there is an emission of semen, then they shall wash themselves with water, and they shall be unclean until the evening."},{"num":19,"verse":"“‘And when a woman is menstruating, her body fluid discharge occurs in her body; for seven days she shall be in her menstruation, and any person who touches her shall become unclean until the evening. "},{"num":20,"verse":"And anything upon which she lies down during her menstruation shall become unclean, and anything upon which she sits shall become unclean. "},{"num":21,"verse":"And any person who touches her bed must wash his garments, and he shall wash himself with water, and he shall be unclean until the evening. "},{"num":22,"verse":"And any person who touches any object on which she sat must wash his garments, and he shall wash himself with water, and he shall be unclean until the evening. "},{"num":23,"verse":"And if it is on the bed or on the object on which she sits, at his touching it he becomes unclean until the evening. "},{"num":24,"verse":"And if a man indeed lies with her and her menstruation occurs on him, then he shall be unclean for seven days, and any bed on which he lies down becomes unclean."},{"num":25,"verse":"“‘And when a woman discharges a body fluid consisting of her blood for many days, but not at the time of her menstruation, or when she discharges in addition to her menstruation, all the days of her unclean body fluid discharge she shall become unclean as in the days of her menstruation. "},{"num":26,"verse":"Any bed on which she lies during all the days of her body fluid discharge shall become for her as her bed of menstruation, and any object on which she sits becomes unclean as her menstruation’s uncleanness. "},{"num":27,"verse":"And any person who touches them becomes unclean, and he shall wash his garments, and he shall wash himself with water, and he shall be unclean until the evening."},{"num":28,"verse":"“‘And if she is clean from her body fluid discharge, then she shall count for herself seven days, and afterward she becomes clean. "},{"num":29,"verse":"And on the eighth day she shall take for herself two turtledoves or two young doves, and she shall bring them to the priest at the tent of assembly’s entrance. "},{"num":30,"verse":"And the priest shall sacrifice the one as a sin offering and the other as a burnt offering, and so the priest shall make atonement for her before Yahweh from her unclean body fluid discharge.’"},{"num":31,"verse":"“And you shall keep the Israelites separate from their uncleanness so that they might not die because of their uncleanness by their making my tabernacle, which is in their midst, unclean."},{"num":32,"verse":"“This is the regulation of the one with the body fluid discharge and the one from whom an emission of semen goes out so that he becomes unclean by it "},{"num":33,"verse":"and concerning the menstruating woman in her bleeding and the person who discharges his body fluid, for the male and for the female and for a man who lies with an unclean woman.”"}]