[{"num":15,"verse":"And the Lord spake to Moses and Aaron, saying,"},{"num":2,"verse":"Speak ye to the sons of Israel, and say ye to them, A man that suffereth the running out of seed, shall be unclean; (Say thou to the Israelites, When a man suffereth the running out of his seed, such an issue shall be unclean;)"},{"num":3,"verse":"and then he shall be deemed to be subject to this vice, when by all moments foul humour, either moisture, cleaveth to his flesh, and groweth (al)together (or runneth continually)."},{"num":4,"verse":"Each bed in which he sleepeth shall be unclean, and wherever he sitteth."},{"num":5,"verse":"If any man toucheth his bed, he shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":6,"verse":"If a man sitteth where he sat, also that man shall wash his clothes (that man shall wash his clothes), and he shall be washed in water, and shall be unclean till to eventide."},{"num":7,"verse":"He that toucheth his flesh, shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":8,"verse":"If such a man casteth out spittle upon him that is clean, he shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":9,"verse":"The saddle on which he sitteth, shall be unclean; and each man that toucheth whatever thing is under him that suffereth the flowing out of seed, shall be defouled, (or unclean), till to eventide."},{"num":10,"verse":"He that beareth any of these things, shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":11,"verse":"Each man, whom he that is such toucheth with hands not washed before (Anyone, whom he who suffereth such a passion, toucheth with his hands that have not been washed), shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":12,"verse":"An(y) earthen vessel that he toucheth, shall be broken; but a wooden vessel shall be washed in water."},{"num":13,"verse":"If he that suffereth such a passion, is healed, he shall number seven days after his cleansing, and when his clothes and all his body be washed in living waters, he shall be clean. (When he, who suffereth such a passion, is healed, he shall count seven days for his cleansing, and after his clothes and all his body be washed in fresh water, he shall be made clean.)"},{"num":14,"verse":"Forsooth in the eighth day he shall take two turtles, or two culver birds, and he shall come in the sight of the Lord at the door of the tabernacle of witnessing, and shall give those to the priest; (Then on the eighth day, he shall take two turtledoves, or two young pigeons, and he shall come before the Lord at the entrance to the Tabernacle of the Witnessing, and shall give them to the priest;)"},{"num":15,"verse":"and the priest shall make, or offer, one of them for the man’s sin, and the tother into burnt sacrifice (and the priest shall offer one for a sin offering, and the other for a burnt sacrifice); and the priest shall pray for him before the Lord, that he be cleansed from the flowing out of his seed."},{"num":16,"verse":"A man from whom the seed of lechery, either of fleshly coupling, goeth out, shall wash in water all his body (shall wash all his body in water), and he shall be unclean till to eventide."},{"num":17,"verse":"He shall wash in water the cloak and (the) skin, or (the) pilch, that he hath used, (or worn, at) that time, and it shall be unclean till to eventide."},{"num":18,"verse":"The woman with which he is coupled fleshly (The woman with whom he is fleshly coupled), shall be washed in water, and shall be unclean till to eventide."},{"num":19,"verse":"A woman that suffereth the flowing out of blood, when the month cometh again, she shall be separated by seven days (she shall be set apart for seven days); each man that toucheth her shall be unclean till to eventide,"},{"num":20,"verse":"and the place in which she sleepeth either sitteth in the days of her separating, shall be defouled, (or unclean)."},{"num":21,"verse":"He that toucheth her bed shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":22,"verse":"Whoever toucheth any vessel, or thing, upon which she sitteth, he shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":23,"verse":"(See verse 22 above.)"},{"num":24,"verse":"If a man is coupled fleshly with her in the time of blood that cometh, or runneth, from her by (the) months, he shall be unclean by seven days, and each bed in which he sleepeth shall be unclean. (If a man is fleshly coupled with her at the time of blood that runneth out from her by the month, he shall be unclean for seven days, and each bed in which he sleepeth shall be unclean.)"},{"num":25,"verse":"A woman that suffereth in many days the flowing out of blood, not in the time of [the] months, either which woman ceaseth not to flow out blood after the blood of [the] months, shall be unclean as long as she shall be subject to this passion, as if she is in the time of [the] months. (A woman who suffereth for many days the flowing out of blood, but not at the time of the month, or which woman ceaseth not to flow out blood after the blood of the month, shall be unclean for as long as she is subject to this passion, just as she is at the time of the month.)"},{"num":26,"verse":"Each bed in which she sleepeth, and whatever thing she sitteth upon, shall be unclean."},{"num":27,"verse":"Whoever toucheth her shall wash his clothes, and he shall be washed in water, and shall be unclean till to eventide."},{"num":28,"verse":"If her blood standeth, and ceaseth to flow out, she shall number seven days of her cleansing, (But when her blood standeth, and ceaseth to flow out, she shall count seven days for her cleansing,)"},{"num":29,"verse":"and in the eighth day she shall offer for herself to the priest two turtles, either culver birds, at the door of the tabernacle of witnessing; (and on the eighth day she shall bring her offering of two turtledoves, or two young pigeons, to the priest, at the entrance to the Tabernacle of the Witnessing;)"},{"num":30,"verse":"and the priest shall offer one for her sin, and the tother into burnt sacrifice (and the priest shall offer one for a sin offering, and the other for a burnt sacrifice); and the priest shall pray for her before the Lord, and for the flowing out of her uncleanness."},{"num":31,"verse":"Therefore ye shall teach the sons of Israel, that they eschew uncleannesses, and that they die not for their filths, when they defoul my tabernacle that is among them. (And so ye shall teach the Israelites, that they must shun uncleannesses, and not bring in their filths to defile my Tabernacle that is among them, and so be put to death because of that.)"},{"num":32,"verse":"This is the law of him that suffereth the flowing out of seed, and (of him) that is defouled with fleshly coupling, (This is the law for him who suffereth the flowing out of seed, and for him who is defiled with fleshly coupling,)"},{"num":33,"verse":"and also of the woman that is separated in the time of (the) months, either that floweth out in continual blood, and of the man that sleepeth with her. (and also of the woman who is set apart at the time of the month, or who floweth out with continual blood, and of the man who sleepeth with her.)"}]