[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-4 The Scriptures of the Old and New Testament are rolls, in which God has written the great things of his law and gospel; they are flying rolls. God's word runs very swiftly, Ps 147:15. This flying roll contains a declaration of the righteous wrath of God against sinners. Oh that we saw with an eye of faith the flying roll of God's curse hanging over the guilty world as a thick cloud, not only keeping off the sunbeams of God's favour, but big with thunders, lightnings, and storms, ready to destroy them! How welcome then would the tidings of a Saviour be, who came to redeem us from the curse of the law, being himself made a curse for us! Sin is the ruin of houses and families; especially the doing hurt to others and false witness. Who knows the power of God's anger? God's curse cannot be kept out by bars or locks. While one part of the curse of God ruins the substance of the sinner, another part will rest on the soul, and sink it to everlasting punishment. All are transgressors of the law, so we cannot escape this wrath of God, except we flee for refuge to lay hold on the hope set before us in the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will bring it forth - Out of the treasure-house, as it were; as he says, \"He bringeth forth the wind out of His treasures\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and, \"Is not this laid up in store with Me, sealed up among My treasures?\" To Me belongeth \"vengeance and recompense\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:34-35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it shall remain, literally, \"lodge for the night,\" until it has accomplished that for which it was sent, its utter destruction. Lap.: \"So we have seen and see at this day powerful families, which attained to splendor by rapine or ill-gotten goods, destroyed by the just judgment of God, that those who see it are amazed, how such wealth perceptibly yet insensibly disappeared.\" Chrys. on the statues 15. n. 13. p. 259. Oxford Translation: \"Why doth it overthrow the stones and the wood of the swearer's house? In order that the ruin may be a correction to all. For since the earth must hide the swearer, when dead, his house, overturned and become a heap, will by the very sight be an admonition to all who pass by and see it, not to venture on the like, lest they suffer the like, and it will be a lasting witness against the sin of the departed.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Paganism was impressed  with the doom of him who consulted the oracle, whether he should foreswear himself for gain.  \"Swear,\" was the answer, \"since death awaits too the man, who keeps the oath; yet Oath hath a son, nameless, handless, footless; but swift he pursueth, until he grasp together and destroy the whole race and house.\"  \"In the third generation, there was nought descended from him,\" who had consulted about this perjury, \"nor hearthstone reputed to be his. It had been uprooted and effaced.\" A pagan orator  relates, as well known, that \"the perjurer escapes not the vengeance of the gods, and if not himself, yet the sons and whole race of the foresworn fall into great misfortunes.\" God left not Himself without witness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lap.: \"The prophet speaks of the curse inflicted on the thieves and false swearers of his own day; but a fortiori he includes that which came upon them for slaying Christ. For this was the greatest of all, which utterly overthrew and consumed Jerusalem, the temple and polity, so that that ancient and glorious Jerusalem exists no longer, as Christ threatened. \"They shall lay thee even with the ground, and they shall not leave in thee one stone upon another\" Luke 19:44. This resteth upon them these\" 1800 \"years.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lap.: \"The prophet speaks of the curse inflicted on the thieves and false swearers of his own day; but a fortiori he includes that which came upon them for slaying Christ. For this was the greatest of all, which utterly overthrew and consumed Jerusalem, the temple and polity, so that that ancient and glorious Jerusalem exists no longer, as Christ threatened. \"They shall lay thee even with the ground, and they shall not leave in thee one stone upon another\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 19:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This resteth upon them these\" 1800 \"years.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. The \"theft\" immediately meant is similar sacrilege to that complained of in Ne 13:10; Mal 3:8. They robbed God by neglecting to give Him His due in building His house, while they built their own houses, forswearing their obligations to Him; therefore, the \"houses\" they build shall be \"consumed\" with God's \"curse.\" Probably literal theft and perjury accompanied their virtual theft and perjury as to the temple of God (Mal 3:5). Stealing and perjury go together; for the covetous and fraudulent perjure themselves by God's name without scruple (see Pr 30:9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "enter … the house—In vain they guard and shut themselves up who incur the curse; it will inevitably enter even when they think themselves most secure.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "consume … timber … stones—not leaving a vestige of it. So the \"stones\" and \"timber\" of the house of a leper (type of the sinner) were to be utterly removed (Le 14:15; compare 1Ki 18:38).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will bring it forth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so exemplarily will I execute this judgment, that it shall appear I do it, my hand, saith God, shall be seen in it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It shall enter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " none shall be able to keep it out, this curse shall come with commission from me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "into the house of the thief, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where he laid up that he got by theft, and thought to rejoice in it; or by house understand all his estate and goods, with his family and posterity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The thief",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the robbers of God and of their neighbours, and every other notorious transgressor of the precepts of the second table. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And into the house of him that sweareth falsely by my name:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this doth explain that of the third verse, and it is plain that the perjured person is here threatened, every one that dares call God to witness to a falsehood, and imprecate themselves if they speak not truth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It shall remain; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this curse shall be a long curse, it shall stick close to them and theirs, like Gehazi’s leprosy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the midst of his house; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as in the heart and centre of their house, like a sword in the midst of the bowels, or like a disease that seizeth the heart. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall consume it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though it do not destroy suddenly, it shall destroy surely. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With the timber thereof, and the stones thereof; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the strength of it, nothing shall remain, as when both timber and stones of a house are consumed and wasted. Such execution shall be done on those, whose name and place shall be blotted out. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will bring it forth, saith the Lord of hosts,.... The roll was come forth, and was flying abroad; but the curse and wrath of God, signified by it, is what God would bring forth out of his treasures, according to his purposes and declarations, and execute upon sinners; which shows the certainty of it, and that there is no escaping it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and it shall enter into the house of the thief, and into the house of him that sweareth falsely by my name; and it shall remain in the midst of his house, and shall consume it with the timber thereof, and the stones thereof; when wrath is gone forth from the Lord, there is no stopping it; and where it takes place it will remain, there is no getting rid of it; it makes an utter desolation of goods and estates, and entirely destroys both body and soul in hell: there seems to be an allusion to the plague of the leprosy, Leviticus 14:45. So the son of Sirach says, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and it shall enter into the house of the thief, and into the house of him that sweareth falsely by my name; and it shall remain in the midst of his house, and shall consume it with the timber thereof, and the stones thereof; when wrath is gone forth from the Lord, there is no stopping it; and where it takes place it will remain, there is no getting rid of it; it makes an utter desolation of goods and estates, and entirely destroys both body and soul in hell: there seems to be an allusion to the plague of the leprosy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 14:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". So the son of Sirach says, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"a man that swears much shall be full of iniquity, and the plague shall not depart from his house:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and again, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"if a man swears in vain, he shall not be innocent or justified, for his house shall be full of calamities (y).'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So the oracle in Herodotus (z), which Grotius has observed, makes an utter destruction of a man's house and family, to be the punishment of the sin of perjury. Moreover, by the house of the thief and swearer may be meant the temple, as in the times of Christ, which was become a den of thieves and perjurers, and for their sins, became desolate, Matthew 21:13. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So the oracle in Herodotus (z), which Grotius has observed, makes an utter destruction of a man's house and family, to be the punishment of the sin of perjury. Moreover, by the house of the thief and swearer may be meant the temple, as in the times of Christ, which was become a den of thieves and perjurers, and for their sins, became desolate, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) Ecclesiasticus xxiii. 11. (z) Erato, sive l. 6. c. 86. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) Ecclesiasticus xxiii. 11. (z) Erato, sive l. 6. c. 86. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I will bring it forth, saith the LORD of hosts, and it shall enter into the house of the thief, and into the house of him that sweareth falsely by my name: and it shall remain in the midst of his house, and shall consume it with the timber thereof and the stones thereof.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it shall remain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R. V., “until it has accomplished that for which it was sent, its utter destruction.” Pusey.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Mr Wright in his commentary quotes, in illustration of the curse abiding till it has accomplished its mission, the story of Glaucus (Herod. vi. 86), who consulted the oracle as to whether he were at liberty to perjure himself, and retain for his own use a sum of money which had been committed to his trust. The response was that though such a course would be for his present gain, “yet an oath hath a nameless son, handless and footless, yet swift in pursuit till he seize and destroy the whole race and house.” And accordingly, though Glaucus restored the money and asked forgiveness for the thought of his heart, it was observed that, since to design the evil was to incur the guilt of executing it, his family became extinct.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Seventh Vision. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Woman in the Ephah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:5-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Invited again by the Interpreting Angel to contemplate what was coming into view, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Zechariah sees an Ephah, or large measure, appearing on the scene, which he is taught to regard as a representation of the wicked and their doom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From the mouth of the ephah a circular lid or cover of lead is temporarily lifted up, and a woman is seen sitting in the midst of the ephah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This woman, the Angel explains, is a personification of wickedness; and he proceeds to cast her down again into the ephah, from which she had attempted to rise, and to press down the weighty leaden cover on the mouth of the ephah, so as to confine her securely within it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As the prophet gazes again, two women, furnished with stork-like wings, lift up the ephah and bear it swiftly through the air with the woman shut up in it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On his enquiring its destination, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he learns from the Angel that it is to be carried into the land of Shinar, and there to find an abiding dwelling-place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - I will bring it forth. God will not keep the curse confined and inoperative (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), but it shall enter into the house of the thief. The curse shall not fall lightly and pass quickly by, but shall fix its abode with the sinner till it has worked out its fell purpose. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It shall remain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "it shall pass the night",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - take up its lodging; LXX., ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καταλύσει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "With the timber thereof,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. A hyperbolical expression of the terrible effects of Divine vengeance, which consumes utterly like a devouring fire - an adumbration of the destruction at the day of judgment (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Zechariah 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And I lifted up my eyes again, and saw, and behold a flying roll. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And he said to me, What seest thou? And I said, I see a flying roll; its length twenty cubits, and its breadth ten cubits. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And he said to me, This is the curse that goeth forth over the whole land: for every one that stealeth will be cleansed away from this side, according to it; and every one that sweareth will be cleansed away from that side, according to it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I have caused it to go forth, is the saying of Jehovah of hosts, and it will come into the house of the thief, and into the house of him that sweareth by my name for deceit: and it will pass the night in the midst of his house, and consume both its beams and its stones.\" The person calling the prophet's attention to the vision, and interpreting it, is the angelus interpres. This is not specially mentioned here, as being obvious from what goes before. The roll (book-scroll, megillâh  equals  megillath sēpher, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is seen flying over the earth unrolled, so that its length and breadth can be seen. The statement as to its size is not to be regarded as \"an approximative estimate,\" so that the roll would be simply described as of considerable size (Koehler), but is unquestionably significant. It corresponds both to the size of the porch of Solomon's temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and also to the dimensions of the holy place in the tabernacle, which was twenty cubits long and ten cubits broad. Hengstenberg, Hofmann, and Umbreit, following the example of Kimchi, assume that the reference is to the porch of the temple, and suppose that the roll has the same dimensions as this porch, to indicate that the judgment is \"a consequence of the theocracy\" or was to issue from the sanctuary of Israel, where the people assembled before the Lord. But the porch of the temple was neither a symbol of the theocracy, nor the place where the people assembled before the Lord, but a mere architectural ornament, which had no significance whatever in relation to the worship. The people assembled before the Lord in the court, to have reconciliation made for them with God by sacrifice; or they entered the holy place in the person of their sanctified mediators, the priests, as cleansed from sin, there to appear before God and engage in His spotless worship. The dimensions of the roll are taken from the holy place of the tabernacle, just as in the previous vision the candlestick was the mosaic candlestick of the tabernacle. Through the similarity of the dimensions of the roll to those of the holy place in the tabernacle, there is no intention to indicate that the curse proceeds from the holy place of the tabernacle or of the temple; for the roll would have issued from the sanctuary, if it had been intended to indicate this. Moreover, the curse or judgment does indeed begin at the house of God, but it does not issue or come from the house of God. Kliefoth has pointed to the true meaning in the following explanation which he gives: \"The fact that the writing, which brings the curse upon all the sinners of the earth, has the same dimensions as the tabernacle, signifies that the measure will be meted out according to the measure of the holy place;\" and again, \"the measure by which this curse upon sinners will be meted out, will be the measure of the holy place.\" With this measure would all sinners be measured, that they might be cut off from the congregation of the Lord, which appeared before God in the holy place.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The flight of the roll symbolized the going forth of the curse over the whole land. כּל־הארץ is rendered by Hofmann, Neumann, and Kliefoth \"the whole earth,\" because \"it evidently signifies the whole earth in v. Zechariah 4:10, Zechariah 4:14, and Zechariah 6:5\" (Kliefoth). But these passages, in which the Lord of the whole earth is spoken of, do not prove anything in relation to our vision, in which כּל־הארץ is unmistakeably limited to the land of Canaan (Judah) by the antithesis in Zechariah 5:11, \"the land of Shinar.\" If the sinners who are smitten by the curse proceeding over כּל־הארץ are to be carried into the land of Sinar, the former must be a definite land, and not the earth as the sum of all lands. It cannot be argued in opposition to this, that the sin of the land in which the true house of God and the true priesthood were, was wiped away by expiation, whereas the sin of the whole world would be brought into the land of judgment, when its measure was concluded by God; for this antithesis is foreign not only to this vision, but to the Scriptures universally. The Scriptures know nothing of any distribution or punishment of sins according to different lands, but simply according to the character of the sinners, viz., whether they are penitent or hardened. At the same time, the fact that כּל־הארץ denotes the whole of the land of Israel, by no means proves that our vision either treats of the \"carrying away of Israel into exile,\" which had already occurred (Ros.), or \"sets before them a fresh carrying away into exile, and one still in the future\" (Hengstenberg), or that on the coming of the millennial kingdom the sin and the sinners will be exterminated from the whole of the holy land, and the sin thrown back upon the rest of the earth, which is still under the power of the world (Hofmann). The vision certainly refers to the remote future of the kingdom of God; and therefore \"the whole land\" cannot be restricted to the extent and boundaries of Judaea or Palestine, but reaches as far as the spiritual Israel or church of Christ is spread over the earth; but there is no allusion in our vision to the millennial kingdom, and its establishment within the limits of the earthly Canaan. The curse falls upon all thieves and false swearers. הנּשׁבּע in Zechariah 5:3 is defined more precisely in Zechariah 5:4, as swearing in the name of Jehovah for deceit, and therefore refers to perjury in the broadest sense of the word, or to all abuse of the name of God for false, deceitful swearing. Thieves are mentioned for the sake of individualizing, as sinners against the second table of the decalogue; false swearers, as sinners against the first table. The repetition of מזּה כּמוה points to this; for mizzeh, repeated in correlative clauses, signifies hinc et illinc, hence and thence, i.e., on one side and the other (Exodus 17:12; Numbers 22:24; Ezekiel 47:7), and can only refer here to the fact that the roll was written upon on both sides, so that it is to be taken in close connection with כּמוה: \"on this side ... and on that, according to it\" (the roll), i.e., according to the curse written upon this side and that side of the roll. We have therefore to picture the roll to ourselves as having the curse against the thieves written upon the one side, and that against the perjurers upon the other. The supposition that mizzeh refers to כּל־הארץ is precluded most decidedly, by the fact that mizzeh does not mean \"thence,\" i.e., from the whole land, but when used adverbially of any place, invariably signifies \"hence,\" and refers to the place where the speaker himself is standing. Moreover, the double use of mizzeh is at variance with any allusion to hâ'ârets, as well as the fact that if it belonged to the verb, it would stand after כּמוה, whether before or after the verb. Niqqâh, the niphal, signifies here to be cleaned out, like καθαρίζεσωαι in Mark 7:19 (cf. 1 Kings 14:10; Deuteronomy 17:12). This is explained in Zechariah 5:4 thus: Jehovah causes the curse to go forth and enter into the house of the thief and perjurer, so that it will pass the night there, i.e., stay there (lâneh third pers. perf. of lūn, from lânâh, to be blunted, like zûreh in Isaiah 59:5, and other verbal formations); it will not remain idle, however, but work therein, destroying both the house and sinners therein, so that beams and stones will be consumed (cf. 1 Kings 18:38). The suffix in כּלּתּוּ (for כּלּתהוּ, cf. Ges. 75, Anm. 19) refers to the house, of course including the inhabitants. The following nouns introduced with ואת are in explanatory apposition: both its beams and its stones. The roll therefore symbolizes the curse which will fall upon sinners throughout the whole land, consuming them with their houses, and thus sweeping them out of the nation of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The flight of the roll symbolized the going forth of the curse over the whole land. כּל־הארץ is rendered by Hofmann, Neumann, and Kliefoth \"the whole earth,\" because \"it evidently signifies the whole earth in v. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 6:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\" (Kliefoth). But these passages, in which the Lord of the whole earth is spoken of, do not prove anything in relation to our vision, in which כּל־הארץ is unmistakeably limited to the land of Canaan (Judah) by the antithesis in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"the land of Shinar.\" If the sinners who are smitten by the curse proceeding over כּל־הארץ are to be carried into the land of Sinar, the former must be a definite land, and not the earth as the sum of all lands. It cannot be argued in opposition to this, that the sin of the land in which the true house of God and the true priesthood were, was wiped away by expiation, whereas the sin of the whole world would be brought into the land of judgment, when its measure was concluded by God; for this antithesis is foreign not only to this vision, but to the Scriptures universally. The Scriptures know nothing of any distribution or punishment of sins according to different lands, but simply according to the character of the sinners, viz., whether they are penitent or hardened. At the same time, the fact that כּל־הארץ denotes the whole of the land of Israel, by no means proves that our vision either treats of the \"carrying away of Israel into exile,\" which had already occurred (Ros.), or \"sets before them a fresh carrying away into exile, and one still in the future\" (Hengstenberg), or that on the coming of the millennial kingdom the sin and the sinners will be exterminated from the whole of the holy land, and the sin thrown back upon the rest of the earth, which is still under the power of the world (Hofmann). The vision certainly refers to the remote future of the kingdom of God; and therefore \"the whole land\" cannot be restricted to the extent and boundaries of Judaea or Palestine, but reaches as far as the spiritual Israel or church of Christ is spread over the earth; but there is no allusion in our vision to the millennial kingdom, and its establishment within the limits of the earthly Canaan. The curse falls upon all thieves and false swearers. הנּשׁבּע in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 5:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is defined more precisely in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as swearing in the name of Jehovah for deceit, and therefore refers to perjury in the broadest sense of the word, or to all abuse of the name of God for false, deceitful swearing. Thieves are mentioned for the sake of individualizing, as sinners against the second table of the decalogue; false swearers, as sinners against the first table. The repetition of מזּה כּמוה points to this; for mizzeh, repeated in correlative clauses, signifies hinc et illinc, hence and thence, i.e., on one side and the other (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 22:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 47:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and can only refer here to the fact that the roll was written upon on both sides, so that it is to be taken in close connection with כּמוה: \"on this side ... and on that, according to it\" (the roll), i.e., according to the curse written upon this side and that side of the roll. We have therefore to picture the roll to ourselves as having the curse against the thieves written upon the one side, and that against the perjurers upon the other. The supposition that mizzeh refers to כּל־הארץ is precluded most decidedly, by the fact that mizzeh does not mean \"thence,\" i.e., from the whole land, but when used adverbially of any place, invariably signifies \"hence,\" and refers to the place where the speaker himself is standing. Moreover, the double use of mizzeh is at variance with any allusion to hâ'ârets, as well as the fact that if it belonged to the verb, it would stand after כּמוה, whether before or after the verb. Niqqâh, the niphal, signifies here to be cleaned out, like καθαρίζεσωαι in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 14:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 17:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This is explained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thus: Jehovah causes the curse to go forth and enter into the house of the thief and perjurer, so that it will pass the night there, i.e., stay there (lâneh third pers. perf. of lūn, from lânâh, to be blunted, like zûreh in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and other verbal formations); it will not remain idle, however, but work therein, destroying both the house and sinners therein, so that beams and stones will be consumed (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The suffix in כּלּתּוּ (for כּלּתהוּ, cf. Ges. 75, Anm. 19) refers to the house, of course including the inhabitants. The following nouns introduced with ואת are in explanatory apposition: both its beams and its stones. The roll therefore symbolizes the curse which will fall upon sinners throughout the whole land, consuming them with their houses, and thus sweeping them out of the nation of God. ",
            "children": []
          }
        ]
      }
    ]
  }
]