[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Zechariah 5:9-11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 5:9-11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then lifted I up mine eyes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Great difficulties attend the interpretation of this part of the vision, and commentators are much divided upon it. According to Calmet, the woman enclosed in the ephah denoted the iniquity of Babylon; the mass of lead which fell down upon her was the vengeance of the Lord; and the two women who lifted her up into the air were the Medes and Persians, who destroyed the empire of Babylon. Houbigant, however, observes, “that nobody has yet found out, nor ever will find out, why these women should carry the ephah into the land of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shinar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or of the Chaldees, if Shinar be understood literally, and not metaphorically. The Jews were not again carried captive into the land of the Chaldeans, after the rebuilding of the temple by Zerubbabel; nor can the Chaldeans be understood by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ephah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which is carried into the land of Shinar with the woman, who abused it to fraudulent purposes; for the ephah is a Hebrew measure; and this woman, who is kept shut up in the ephah, is carried into a land not her own. Shinar will be more properly understood, as spoken metaphorically of the last captivity, under which the Jews now live; being, in the several kingdoms of the world, in the same state of servitude as they lived in under, the kings of the Chaldeans; having their dwelling everywhere, with the deceitful ephah, to denote their usury and fraud. There is no necessity to be anxious about explaining why the ephah was to be carried by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two women, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and not by one only, or more, for the empire of the Greeks and Romans is not denoted hereby, but two women pertain only to the parable; as it might have seemed too much for one to have carried into a distant country an ephah burdened with lead, and with a woman shut up in it.” Archbishop Newcome understands the words in this sense: considering the two women as “mere agents in the symbolical vision;” the meaning of which, he says, seems to be, “that the Babylonish captivity had happened on account of the wickedness committed by the Jews; and that a like dispersion would befall them, if they relapsed into like crimes. Thus the whole chapter would be an awful admonition that multiplied curses, and particularly that dispersion and captivity, would be the punishment of national guilt.” Blayney interprets the vision in a similar way. “These, [namely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two women,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] and the other circumstances mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", seem to indicate nothing more particular, than that Providence would make use of quick and forcible means to effect its purpose.” Hence these women are said to have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "had wings like the wings of a stork; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the stork, like other birds of passage, being provided with strong wings. Though ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the land of Shinar ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies, as he observes, the land of Babylon, (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) yet “this does not necessarily imply that Babylon would be the scene of the next captivity; but only that the people, in case of fresh transgression, might expect another severe captivity, like that in Babylon, but of still longer duration. In this manner Egypt is used proverbially for any grievous calamity, inflicted by the judgment of God: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:68",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:5-11 In this vision the prophet sees an ephah, something in the shape of a corn measure. This betokened the Jewish nation. They are filling the measure of their iniquity; and when it is full, they shall be delivered into the hands of those to whom God sold them for their sins. The woman sitting in the midst of the ephah represents the sinful church and nation of the Jews, in their latter and corrupt age. Guilt is upon the sinner as a weight of lead, to sink him to the lowest hell. This seems to mean the condemnation of the Jews, after they filled the measure of their iniquities by crucifying Christ and rejecting his gospel. Zechariah sees the ephah, with the woman thus pressed in it, carried away to some far country. This intimates that the Jews should be hurried out of their own land, and forced to dwell in far countries, as they had been in Babylon. There the ephah shall be firmly placed, and their sufferings shall continue far longer than in their late captivity. Blindness is happened unto Israel, and they are settled upon their own unbelief. Let sinners fear to treasure up wrath against the day of wrath; for the more they multiply crimes, the faster the measure fills.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There came out two women - It may be that there may be no symbol herein, but that he names women because it was a woman who was so carried; yet their wings were the wings of an unclean bird, strong, powerful, borne by a force not their own; with their will, since they flew; beyond their will, since the wind was in their wings; rapidly, inexorably, irresistibly, they flew and bore the Ephah between heaven and earth. No earthly power could reach or rescue it. God would not. It may be that evil spirits are symbolized, as being like to this personified human wickedness, such as snatch away the souls of the damned, who, by serving them, have become as they. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. The agents to carry away the \"woman\" are, consistently with the image, \"women.\" God makes the wicked themselves the agents of punishing and removing wickedness. \"Two\" are employed, as one is not enough to carry such a load [Maurer]. Or, the Assyrians and Babylonians, who carried away idolatry in the persons, respectively, of Israel and Judah [Henderson]. As two \"anointed ones\" (Zec 4:14) stand by the Lord as His ministers, so two winged women execute His purpose here in removing the embodiment of \"wickedness\": answering to the \"mystery of iniquity\" (the Septuagint here in Zechariah uses the same words as Paul and \"the man of sin,\" whom the Lord shall destroy with the spirit of His mouth and the brightness of His coming, 2Th 2:3, 7, 8). Their \"wings\" express velocity. The \"stork\" has long and wide wings, for which reason it is specified; also it is a migratory bird. The \"wind\" helps the rapid motion of the wings. The being \"lifted up between heaven and earth\" implies open execution of the judgment before the eyes of all. As the \"woman\" here is removed to Babylon as her own dwelling, so the woman in the Apocalypse of St. John is Babylon (Re 17:3-5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then lifted I up mine eyes, and looked:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Zechariah 5:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 5:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There came out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the same place whence the ephah came, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "two women:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the sinful nation was resembled to a woman, and now, to keep a decorum in the vision, they who are to be God’s executioners, to punish that wicked woman, are called women: it is like enough to be meant of the Romans, a warlike and stout nation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The wind was in their wings:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they are set forth as having wings like the wings of storks, large and strong, and as flying before the wind with great swiftness; so should Divine vengeance swiftly follow and certainly overtake the Jewish nation, when, after their return out of captivity, they shall corrupt themselves, and fill up the measure of their sins. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They lifted up the ephah between the earth and the heaven; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the judgments came thus flying, and so bare away with them those that are to be punished: it is a secret intimation of a future deportation or carrying the Jews into captivity again for sin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then lifted I up mine eyes, and looked,.... This is not a new vision, but a continuation of the former, as appears from the \"ephah\" seen in it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, behold, there came out two women; out of the same place the \"ephah\" did. The Targum explains these \"two women\" by two provinces; and Kimchi interprets them of the two tribes of Judah and Benjamin, who had been carried captive into Babylon; and others of the two kings, Jehoiakim and Zedekiah, who were the cause of the captivity; but Jarchi understands by them the Babylonians and Chaldeans, two nations as one, joined in Nebuchadnezzar's armies, which carried them captive: others think the two reformers, Ezra and Nehemiah, are meant, who were instruments of purging the Jews, returned from captivity, though but weak ones, and therefore are compared to \"women\"; yet what they did they did swiftly, and therefore are said to have \"wings\", and under the influence of the Spirit of God; hence the \"wind\", or \"spirit\" (f), is said to be in their wings; and they acted from a tender regard to the glory of God and the good of their country; and therefore their wings were like the \"wings of a stork\"; a bird of passage, as appears from Jeremiah 8:7 and so a fit emblem to be used in the transportation of the \"ephah\"; of whom Pliny (g) says, from whence they come, and whither they betake themselves, is yet unknown; and adds, there is no doubt that they come from afar; as it is plain they must, if that relation be true, which seems to have good authority, that one of these creatures, upon its return to Germany, brought a green root of ginger with it; which must come from the eastern part of the world; from Arabia, or Ethiopia, or the East Indies, where it grows (h): and as it is a bird that takes such long flights, it must have wings fitted for such a purpose; and which are taken notice of in Job 39:13 to which the wings and feather of the ostrich are compared; for so Bochart (i) there renders the word, \"the wing of the ostriches rejoices, truly the wing\" as of \"a stork, and the feather\"; or, as others, \"who gave wings to the stork and ostrich?\" both remarkable for their wings: and Vatablus renders the word here an \"ostrich\"; which, according to Pliny (k), is the largest of birds, and almost as big as a beast. In Ethiopia and Africa they are taller than a horse and his rider, and exceed the horse in swiftness; and their wings seem to be given them to help them in running; but which are not sufficient to lift them much above the earth, and so can not be meant here; but rather the stork, whose wings are black and white; and when they fly, they stretch out their necks forwards, and their feet backwards, and with these direct their course; when a tempest rises, standing on both feet, they spread their wings, lay their bill upon their breast, and turn their face that way the storm comes (l). The Targum renders it an eagle, which is the swiftest of birds, and whose wings are very strong to bear anything upon them, as they do their young, to which the allusion is, Deuteronomy 32:11 and so, if meant here, to lift up and bear away the ephah between the earth and the heaven; but the word is never used of that bird. The Harpies or Furies, with the Heathens, are represented, as women having wings (m) as these women are said to have; but these are very different women from them. Though some think the Romans, under Vespasian and Titus, are intended; but it may be that the two, perfections of God, his power and justice, in punishing men for their sins, are meant, particularly in the last times, and at the day of judgment. The power of God will be seen in raising the dead; in bringing all to judgment; in separating the wicked from the righteous, and in the execution of the sentence denounced on them: and the justice of God will be very conspicuous in the judgment and destruction of them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and, behold, there came out two women; out of the same place the \"ephah\" did. The Targum explains these \"two women\" by two provinces; and Kimchi interprets them of the two tribes of Judah and Benjamin, who had been carried captive into Babylon; and others of the two kings, Jehoiakim and Zedekiah, who were the cause of the captivity; but Jarchi understands by them the Babylonians and Chaldeans, two nations as one, joined in Nebuchadnezzar's armies, which carried them captive: others think the two reformers, Ezra and Nehemiah, are meant, who were instruments of purging the Jews, returned from captivity, though but weak ones, and therefore are compared to \"women\"; yet what they did they did swiftly, and therefore are said to have \"wings\", and under the influence of the Spirit of God; hence the \"wind\", or \"spirit\" (f), is said to be in their wings; and they acted from a tender regard to the glory of God and the good of their country; and therefore their wings were like the \"wings of a stork\"; a bird of passage, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and so a fit emblem to be used in the transportation of the \"ephah\"; of whom Pliny (g) says, from whence they come, and whither they betake themselves, is yet unknown; and adds, there is no doubt that they come from afar; as it is plain they must, if that relation be true, which seems to have good authority, that one of these creatures, upon its return to Germany, brought a green root of ginger with it; which must come from the eastern part of the world; from Arabia, or Ethiopia, or the East Indies, where it grows (h): and as it is a bird that takes such long flights, it must have wings fitted for such a purpose; and which are taken notice of in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to which the wings and feather of the ostrich are compared; for so Bochart (i) there renders the word, \"the wing of the ostriches rejoices, truly the wing\" as of \"a stork, and the feather\"; or, as others, \"who gave wings to the stork and ostrich?\" both remarkable for their wings: and Vatablus renders the word here an \"ostrich\"; which, according to Pliny (k), is the largest of birds, and almost as big as a beast. In Ethiopia and Africa they are taller than a horse and his rider, and exceed the horse in swiftness; and their wings seem to be given them to help them in running; but which are not sufficient to lift them much above the earth, and so can not be meant here; but rather the stork, whose wings are black and white; and when they fly, they stretch out their necks forwards, and their feet backwards, and with these direct their course; when a tempest rises, standing on both feet, they spread their wings, lay their bill upon their breast, and turn their face that way the storm comes (l). The Targum renders it an eagle, which is the swiftest of birds, and whose wings are very strong to bear anything upon them, as they do their young, to which the allusion is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and so, if meant here, to lift up and bear away the ephah between the earth and the heaven; but the word is never used of that bird. The Harpies or Furies, with the Heathens, are represented, as women having wings (m) as these women are said to have; but these are very different women from them. Though some think the Romans, under Vespasian and Titus, are intended; but it may be that the two, perfections of God, his power and justice, in punishing men for their sins, are meant, particularly in the last times, and at the day of judgment. The power of God will be seen in raising the dead; in bringing all to judgment; in separating the wicked from the righteous, and in the execution of the sentence denounced on them: and the justice of God will be very conspicuous in the judgment and destruction of them. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And the wind was in their wings; they had wings, as denoting swiftness, as angels are said to have; hence Maimonides, as Kimchi observes, thought that angels are here meant; but this denotes, that though God is longsuffering, and may seem to defer judgment, which is sometimes a stumbling to the righteous, and a hardening to the wicked; yet, as this is only for the salvation of his elect, so when once the time is up, and the commission given forth, power and justice will speedily execute the sentence: and the \"wind\" being in their wings shows the greater swiftness and speed in the dispatch of business, and the great strength and force with which they performed it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they had wings like the wings of a stork; which, being a creature kind and tender, show that there is no cruelty in the displays of the power and justice of God in punishing sinners: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they lifted up the ephah between the earth and the heaven; which denotes the visibility of the whole measure of the sins of wicked men; they will all be made manifest, and brought into judgment: and also the visibility of their punishment; they will go into everlasting punishment, in the sight of angels and men; and which will be the case of the antichristian beast, Revelation 17:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they lifted up the ephah between the earth and the heaven; which denotes the visibility of the whole measure of the sins of wicked men; they will all be made manifest, and brought into judgment: and also the visibility of their punishment; they will go into everlasting punishment, in the sight of angels and men; and which will be the case of the antichristian beast, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 17:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) \"spiritus\", V. L. Pagninus, Montanus, Calvin, Burkius. (g) Nat. Hist. l. 10. c. 23. (h) Vid. Bochart. Hierozoic. par. 2. l. 2. c. 29. col. 328, 332. (i) Ibid. c. 16. col. 247, 248. (k) Nat. Hist. l. 10. c. 1.((l) Schotti Physica Curiosa, par. 2. l. 9. c. 26. p. 1162. (m) \"Harpyiae et magnis quatiunt clangoribus alas.\" Virgil. Aeneid. l. 3. ver. 223. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) \"spiritus\", V. L. Pagninus, Montanus, Calvin, Burkius. (g) Nat. Hist. l. 10. c. 23. (h) Vid. Bochart. Hierozoic. par. 2. l. 2. c. 29. col. 328, 332. (i) Ibid. c. 16. col. 247, 248. (k) Nat. Hist. l. 10. c. 1.((l) Schotti Physica Curiosa, par. 2. l. 9. c. 26. p. 1162. (m) \"Harpyiae et magnis quatiunt clangoribus alas.\" Virgil. Aeneid. l. 3. ver. 223. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then I lifted up my eyes, and looked, and, behold, there came out two {k} women, and the wind was in their wings; for they had wings like the wings of a stork: and they lifted up the ephah between the earth and the heaven.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then I lifted up my eyes, and looked, and, behold, there came out two ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " women, and the wind ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in their wings; for they had wings like the wings of a stork: and they lifted up the ephah between the earth and the heaven.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Which declared that God would execute his judgment by the means of the weak and infirm.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "looked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "saw.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "came out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "came forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from the surrounding darkness upon the stage or scene of the vision.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "No meaning need be sought for the details of this verse. They merely convey the fact, clothed in imagery in keeping with the vision, that wickedness was borne swiftly from the land. “Pertinent haec ad colorem imaginis.” Maurer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then lifted I up mine eyes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is the conclusion of the vision. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And looked;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and saw. There came out",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and saw. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "There came out",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "two women.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These two women who now come in sight have been supposed to represent the Assyrians and Babylonians, who wore the agents in the deportation of Israel; or else are considered abettors of the woman in the ephah, who for a time save her from destruction. This latter supposition proceeds on the erroneous idea that wickedness is herein rescued from punishment, whereas the notion that underlies the whole vision is that the Holy Land is purged of wickedness. That the two nations hostile to Israel are represented is an untenable suggestion; for why should they carry off iniquity from Jerusalem and fix it in their own land? Probably by the two women carrying away the evil woman is signified (if the details are capable of explanation) that iniquity brings with it its own destruction and works out its own removal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The wind was in their wings.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They were borne  along so quickly that they seemed to be carried by the wind; or the wind helped their flight. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A stork;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἔποπος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the hoopoe;\" Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "milvi.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Authorized Version is certainly correct. The stork is common enough in Palestine, and is reckoned among unclean birds in the Pentateuch (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), for which cause some have thought it is here introduced as bearing the sin laden ephah. But its introduction more probably has reference to its migratory habits, the power and rapidity of its flight, and, as some think, to its skill in constructing its nest. Zechariah 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And I lifted up my eyes, and saw, and behold there came forth two women, and wind in their wings, and they had wings like a stork's wings; and they carried the ephah between earth and heaven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I said to the angel that talked with me, Whither are these taking the ephah? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And he said to me, To build it a dwelling in the land of Shinar: and it will be placed and set up there upon its stand.\" The meaning of this new scene may easily be discovered. The ephah with the woman in it is carried away between earth and heaven, i.e., through the air. Women carry it because there is a woman inside; and two women, because two persons are required to carry so large and heavy a measure, that they may lay hold of it on both sides (תּשּׂנה with the א dropped; cf. Ges. 74, Anm. 4). These women have wings, because it passes through the air; and a stork's wings, because these birds have broad pinions, and not because the stork is a bird of passage or an unclean bird. The wings are filled with wind, that they may be able to carry their burden with greater velocity through the air. The women denote the instruments or powers employed by God to carry away the sinners out of His congregation, without any special allusion to this or the other historical nation. This is all that we have to seek for in these features, which only serve to give distinctness to the picture. But the statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is significant: \"to build it a house in the land of Shinar.\" The pronoun לה with the suffix softened instead of לּהּ, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. Ewald, 247, d), refers grammatically to האיפה; but so far as the sense is concerned, it refers to the woman sitting in the ephah, since a house is not built for a measure, but only for men to dwell in. This also applies to the feminine form הנּתחה, and to the suffix in מכנתהּ. The building of a house indicates that the woman is to dwell there permanently, as is still more clearly expressed in the second hemistich.  הוּכן  refers to  בּית , and is not to be taken hypothetically, in the sense of \"as soon as the house shall be restored,\" but is a perfect with Vav consec.; and hūkhan, the hophal of kūn, is not to be taken in the sense of restoring, but, in correspondence with mekhunâh, in the sense of establishing or building on firm foundations. Mekhunâh: the firmly established house. In this the woman of sin is brought to rest. The land in which the woman of sin carried away out of the holy land is permanently to dwell, is the land of Shinar. This name is not to be identified with Babel, so as to support the conclusion that it refers to a fresh removal of the people of Israel into exile; but according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Shinar is the land in which Nimrod founded the first empire, and where the human race built the tower of Babel which was to reach to the sky. The name is not to be taken geographically here as an epithet applied to Mesopotamia, but is a notional or real definition, which affirms that the ungodliness carried away out of the sphere of the people of God will have its permanent settlement in the sphere of the imperial power that is hostile to God. The double vision of this chapter, therefore, shows the separation of the wicked from the congregation of the Lord, and their banishment into and concentration within the ungodly kingdom of the world. This distinction and separation commenced with the coming of the Messiah, and runs through all the ages of the spread and development of the Christian church, until at the time of the end they will come more and more into outward manifestation; and the evil, having been sifted out by the judicial power of God and His Spirit, will form itself into a Babel of the last days, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and 39 clearly show, and attempt a last struggle with the kingdom of God, in which it will be overcome and destroyed by the last judgment. ",
        "children": []
      }
    ]
  }
]