[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1-4) Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:9-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where a similar choral arrangement is found.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 118:1-4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:1-4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O give thanks unto the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "All sorts of persons, which are expressed particularly in the next three verses, as they are mentioned in like manner and order ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where see the notes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let Israel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "After the flesh, all the tribes and people of Israel, except the Levites. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let the house of Aaron — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The priests and Levites, who were greatly discouraged and oppressed in Saul’s time, but received great benefits under David’s government. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let them that fear the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Gentile proselytes, of whom there were greater numbers in David’s time than formerly had been, and were likely to be still more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Say, that his mercy endureth for ever — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not only in the everlasting fountain thereof, God himself, but in its never failing streams, which shall run parallel with the longest lines of eternity; and in the vessels of mercy, who will be for ever monuments of it. Israel, and the house of Aaron, and all that fear God, were called upon, Psalms 115., to trust in him. Here they are called upon to acknowledge his goodness, and join in the same thankful song, thus encouraging themselves to trust in him. Priests and people, Jews and proselytes, must all confess that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his mercy endureth for ever; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that they have had experience of it all their days, and that they confide in it for good things that shall last to all eternity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "118:1-18 The account the psalmist here gives of his troubles is very applicable to Christ: many hated him without a cause; nay, the Lord himself chastened him sorely, bruised him, and put him to grief, that by his stripes we might be healed. God is sometimes the strength of his people, when he is not their song; they have spiritual supports, though they want spiritual delights. Whether the believer traces back his comfort to the everlasting goodness and mercy of God, or whether he looks forward to the blessing secured to him, he will find abundant cause for joy and praise. Every answer to our prayers is an evidence that the Lord is on our side; and then we need not fear what man can do unto us; we should conscientiously do our duty to all, and trust in him alone to accept and bless us. Let us seek to live to declare the works of God, and to encourage others to serve him and trust in him. Such were the triumphs of the Son of David, in the assurance that the good pleasure of the Lord should prosper in his hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O give thanks unto the Lord ... - Let others unite with me in giving thanks to the Lord; let them see, from what has occurred in my case, what occasion there is for praise. Every instance of a particular favor shown to anyone is to others an occasion for praise, inasmuch as it is an illustration of the general character of God. On this verse compare the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The language is nearly the same. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 118",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 118:1-29. After invoking others to unite in praise, the writer celebrates God's protecting and delivering care towards him, and then represents himself and the people of God as entering the sanctuary and uniting in solemn praise, with prayer for a continued blessing. Whether composed by David on his accession to power, or by some later writer in memory of the restoration from Babylon, its tone is joyful and trusting, and, in describing the fortune and destiny of the Jewish Church and its visible head, it is typically prophetical of the Christian Church and her greater and invisible Head.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-4. The trine repetitions are emphatic (compare Ps 118:10-12, 15, 16; 115:12, 13).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Let … say—Oh! that Israel may say.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "now—as in Ps 115:2; so in Ps 118:3, 4. After \"now say\" supply \"give thanks.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that his mercy—or, \"for His mercy.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that his mercy—or, \"for His mercy.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 O Give thanks unto the Lord; for he is good: because his mercy endureth for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Let Israel now say, that his mercy endureth for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 Let the house of Aaron now say, that his mercy endureth for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 Let them now that fear the Lord say, that his mercy endureth for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 118:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O give thanks unto the Lord.\" The grateful hero feels that he cannot himself alone sufficiently express his thankfulness, and therefore he calls in the aid of others. Grateful hearts are greedy of men's tongues, mid would monopolize them all for God's glory. The whole nation was concerned in David's triumphant accession, and therefore it was right that they should unite in his adoring song of praise. The thanks were to be rendered unto Jehovah alone, and not to the patience or valour of the hero himself. It is always well to trace our mercies to him who bestows them, and if we cannot give him anything else, let us at any rate give him our thanks. We must not stop short at the second agent, but rise at once to the first cause, and render all our praises unto the Lord himself. Have we been of a forgetful or murmuring spirit? Let us hear the lively language of the text, and allow it to speak to our hearts: \"Cease your complainings, cease from all self-glorification, and give thanks unto the Lord.\" \"For he is good.\" This is reason enough for giving him thanks; goodness is his essence and nature, and therefore he is always to be praised whether we are receiving anything from him or not. Those who only praise God because he does them good should rise to a higher note and give thanks to him because he is good. In the truest sense he alone is good, \"There is none good but one, that is God\"; therefore in all gratitude the Lord should have the royal portion. If others seem to be good, he is good. If others are good in a measure, he is good beyond measure. When others behave badly to us, it should only stir us up the more heartily to give thanks unto the Lord, because h is good; and when we ourselves are conscious that we are far from being good, we should only the more reverently bless him that \"he is good.\" We must never tolerate an instant's unbelief as to the goodness of the Lord; whatever else may be questionable, this is absolutely certain, that Jehovah is good; his dispensations may vary, but his nature is always the same, and always good. It is not only that he was good, and will be good, but he is good, let his providence be what it may. Therefore let us even at this present moment, though the skies be dark with clouds, yet give thanks unto his name.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Because his mercy endureth for ever.\" Mercy is a great part of his goodness, and one which more concerns us than any other, for we are sinners and have need of his mercy. Angels may say that he is good, but they need not his mercy and cannot therefore take an equal delight in it; inanimate creation declares that he is good, but it cannot feel his mercy, for it has never transgressed; but man, deeply guilty and graciously forgiven, beholds mercy as the very focus and centre of the goodness of the Lord. The endurance of the divine mercy is a special subject for song: notwithstanding our sins, our trials, our fears, his mercy endureth for ever. The best of earthly joys pass away, and even the world itself grows old and hastens to decay, but there is no change in the mercy of God; he was faithful to our forefathers, he is merciful to us, and will be gracious to our children and our children's children. It is to be hoped that the philosophical interpreters who endeavour to clip the word \"for ever\" into a mere period of time will have the goodness to let this passage alone. However, whether they do or not, we shall believe in endless mercy - mercy to eternity. The Lord Jesus Christ, who is the grand incarnation of the mercy of God, calls upon us at every remembrance of him to give thanks unto the Lord, for \"he is good.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 118:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Let Israel now say, that his mercy endureth for ever.\" God had made a covenant with their forefathers, a covenant of mercy and love, and to that covenant he was faithful evermore. Israel sinned in Egypt, provoked the Lord in the wilderness, went astray again and again under the judges, and transgressed at all times; and yet the Lord continued to regard them as his people, to favour them with his oracles, and to forgive their sins. He speedily ceased from the chastisements which they so richly deserved, because he had a favour towards them. He put his rod away the moment they repented, because his heart was full of compassion. \"His mercy endureth for ever\" was Israel's national hymn, which, as a people, they had been called upon to sing upon many former occasions; and now their leader, who had at last gained the place for which Jehovah had destined him, calls upon the whole nation to join with him in extolling, in this particular instance of the divine goodness, the eternal mercy of the Lord. David's success was mercy to Israel, as well as mercy to himself. If Israel does not sing, who will? If Israel does not sing of mercy, who can? If Israel does not sing when the Son of David ascends the throne, the very stones will cry out.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 118:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Let the house of Aaron now say, that his mercy endureth for ever.\" The sons of Aaron were specially set apart to come nearest to God, and it was only because of his mercy that they were enabled to live in the presence of the thrice holy Jehovah, who is a consuming fire. Every time the morning and evening lamb was sacrificed, the priests saw the continual mercy of the Lord, and in all the holy vessels of the sanctuary, and all its services from hour to hour, they had renewed witness of the goodness of the Most High. When the high priest went in unto the holy place and came forth accepted, he might, above all men, sing of the eternal mercy. If this Psalm refers to David, the priests had special reason for thankfulness on his coming to the throne, for Saul had made a great slaughter among them, and had at various times interfered with their sacred office. A man had now come to the throne who for their Master's sake would esteem them, give them their dues, and preserve them safe from all harm. Our Lord Jesus, having made all his people priests unto God, may well call upon them in that capacity to magnify the everlasting mercy of the Most High. Can any one of the royal priesthood be silent?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 118:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Let them now that fear the Lord say, that his mercy endureth for ever.\" If there were any throughout the world who did not belong to Israel after the flesh, but nevertheless had a holy fear and lowly reverence of God, the Psalmist calls upon them to unite with him in his thanksgiving, and to do it especially on the occasion of his exaltation to the throne; and this is no more than they would cheerfully agree to do, since every good man in the world is benefited when a true servant of God is placed in a position of honour and influence. The prosperity of Israel through the reign of David was a blessing to all who feared Jehovah. A truly God-fearing man will have his eye much upon God's mercy, because he is deeply conscious of his need of it, and because that attribute excites in him a deep feeling of reverential awe. \"There is forgiveness with thee that thou mayest be feared.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the three exhortations, to Israel, to the house of Aaron, and to them that fear the Lord, there is a repetition of the exhortation to say, \"that his mercy endureth for ever.\" We are not only to believe, but to declare the goodness of God; truth is not to be hushed up, but proclaimed. God would have his people act as witnesses, and not stand silent in the day when his honour is impugned. Specially is it our joy to speak out to the honour and glory of God when we think upon the exaltation of his dear Son. We should shout \"Hosannah,\" and sing loud \"Hallelujahs\" when we behold the stone which the builders rejected lifted into its proper place.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...THE ARGUMENT This Psalm most probably was composed by David, when the civil wars between the houses of Saul and David were ended, and David was newly settled in the kingdom of all Israel, and had newly brought up the ark of God to his royal city, But though this was the occasion, yet David, or at least the Spirit of God, which indited this Psalm, had a further reach and higher design in it, and especially in the latter part of it, which was to carry the reader’s thoughts beyond the type to the antitype, the Messias and his kingdom, who was chiefly intended in it; which is apparent both from the testimonies produced out of it to that purpose in the New Testament, as Matthew 21:9,42 Mr 12:10,11 Ac 4:11, &c.; and from the consent of the Hebrew doctors, both ancient and modern; one evidence whereof is, that in their prayers for their Messiah they use some part of this Psalm; and from the matter itself, as we shall see hereafter. The form of this Psalm may seem to be dramatical, and several parts of it are spoken in the name of several persons, yet so that the distinction of the persons and their several passages is not expressed, but left to the observation of the intelligent and diligent reader, as it is in the book of the Song of Solomon, and in some part of Ecclesiastes, and in many profane writers. David speaks in his own name from the beginning to verse 22, and from thence to verse 25 in the name of the people, and thence to verse 27 in the name of the priests, and then concludes in his own name. The psalmist exhorteth all the godly to praise the Lord, who had been merciful to them, Psalm 118:1-4. By his own experience showeth how good it is to trust in the Lord, who had delivered him from his enemies, Psalm 118:5-18. Under the type of the psalmist, the coming of Christ, whom the chief of the people refuse, is expressed and blessed, Psalm 118:19-29.  O give thanks;  all sorts of persons, which are particularly expressed in the three next verses, as they are mentioned in like manner and order Psalm 115:9-11, See Poole \"Psalm 115:9\", See Poole \"Psalm 115:10\", See Poole \"Psalm 115:11\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This Psalm most probably was composed by David, when the civil wars between the houses of Saul and David were ended, and David was newly settled in the kingdom of all Israel, and had newly brought up the ark of God to his royal city, But though this was the occasion, yet David, or at least the Spirit of God, which indited this Psalm, had a further reach and higher design in it, and especially in the latter part of it, which was to carry the reader’s thoughts beyond the type to the antitype, the Messias and his kingdom, who was chiefly intended in it; which is apparent both from the testimonies produced out of it to that purpose in the New Testament, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Matthew 21:9,42 Mr 12:10,11 Ac 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c.; and from the consent of the Hebrew doctors, both ancient and modern; one evidence whereof is, that in their prayers for their Messiah they use some part of this Psalm; and from the matter itself, as we shall see hereafter. The form of this Psalm may seem to be dramatical, and several parts of it are spoken in the name of several persons, yet so that the distinction of the persons and their several passages is not expressed, but left to the observation of the intelligent and diligent reader, as it is in the book of the Song of Solomon, and in some part of Ecclesiastes, and in many profane writers. David speaks in his own name from the beginning to verse 22, and from thence to verse 25 in the name of the people, and thence to verse 27 in the name of the priests, and then concludes in his own name. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The psalmist exhorteth all the godly to praise the Lord, who had been merciful to them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 118:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". By his own experience showeth how good it is to trust in the Lord, who had delivered him from his enemies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 118:5-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Under the type of the psalmist, the coming of Christ, whom the chief of the people refuse, is expressed and blessed, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 118:19-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "O give thanks; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all sorts of persons, which are particularly expressed in the three next verses, as they are mentioned in like manner and order ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 115:9-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "See Poole \"Psalm 115:9\"",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "See Poole \"Psalm 115:10\"",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "See Poole \"Psalm 115:11\"",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O give thanks unto the Lord,.... For all his mercies, temporal and spiritual; as all should, who are partakers of them: this should be done always, and for all things, in the name of Christ; it is but reasonable service; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for he is good; in himself, and to others: is essentially and diffusively good; the fountain of all goodness, and the author of all good things; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because his mercy endureth for ever; in his own heart, and in his covenant; his grace and lovingkindness displayed in Christ; the blessings and promises of it, which are the sure mercies of David: these always remain, notwithstanding the unworthiness of his people; and though he hides his face sometimes from them, and chastises them; see Psalm 106:1; the goodness and mercy of God were seen in setting David on the throne; and abundantly more in giving Christ to be the Saviour of his people; for both which thanks should be given, and the kindness acknowledged, by the persons mentioned in the following verses. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because his mercy endureth for ever; in his own heart, and in his covenant; his grace and lovingkindness displayed in Christ; the blessings and promises of it, which are the sure mercies of David: these always remain, notwithstanding the unworthiness of his people; and though he hides his face sometimes from them, and chastises them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 106:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the goodness and mercy of God were seen in setting David on the throne; and abundantly more in giving Christ to be the Saviour of his people; for both which thanks should be given, and the kindness acknowledged, by the persons mentioned in the following verses. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O {a} give thanks unto the LORD; for he is good: because his mercy endureth for ever.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " give thanks unto the LORD; for ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "he is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " good: because his mercy ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "endureth",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for ever.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Because God by creating David king, showed his mercy toward his afflicted Church, the prophet not only thanks God himself, but exhorts all the people to do the same.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see notes); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because his mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] For his lovingkindness &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. For the threefold division ‘Israel,’ ‘house of Aaron,’ ‘fearers of Jehovah,’ cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:9-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and notes there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The LXX as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reads ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the house of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and adds after ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 118:2-4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:2-4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that he is good",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hence P.B.V. with the Vulg. in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 118:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘Let Israel now confess, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that he is gracious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". An introductory call to all Israel to join in praising Jehovah for His unfailing goodness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O give thanks unto the Lord; for he is good because his mercy endureth for ever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the comment ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ad loc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Psalm 118:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Hodu-cry is addressed first of all and every one; then the whole body of the laity of Israel and the priests, and at last (as it appears) the proselytes (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") who fear the God of revelation, are urgently admonished to echo it back; for \"yea, His mercy endureth for ever,\" is the required hypophon. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Israel too then begins as one man to praise the ever-gracious goodness of God. יהּ, the Jod of which might easily become inaudible after קראתי, has an emphatic Dagesh as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and המּצר has the orthophonic stroke beside צר (the so-called מקּל), which points to the correct tone-syllable of the word that has Dechמ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Baer's Thorath Emeth, p. 7 note, and p. 21, end of note 1.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Instead of ענני it is here pointed ענני, which also occurs in other instances not only with distinctive, but also (though not uniformly) with conjunctive accents.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Hitzig on Proverbs 8:22 considers the pointing קנני to be occasioned by Dech, and in fact ענני in the passage before us has Tarcha, and in 1 Samuel 28:15 Munach; but in the passage before us, if we read במרחביה as one word according to the Masora, ענני is rather to be accented with Mugrash; and in 1 Samuel 28:15 the reading ענני is found side by side with ענני (e.g., in Bibl. Bomberg. 1521). Nevertheless צרפתני Psalm 17:3, and הרני Job 30:19 (according to Kimchi's Michlol, 30a), beside Mercha, show that the pointing beside conjunctive as beside disjunctive accents wavers between a& and a4, although a4 is properly only justified beside disjunctive accents, and צוּני also really only occurs in pause.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Hitzig on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 8:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " considers the pointing קנני to be occasioned by Dech, and in fact ענני in the passage before us has Tarcha, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 28:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Munach; but in the passage before us, if we read במרחביה as one word according to the Masora, ענני is rather to be accented with Mugrash; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 28:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the reading ענני is found side by side with ענני (e.g., in Bibl. Bomberg. 1521). Nevertheless צרפתני ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 17:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and הרני ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (according to Kimchi's Michlol, 30a), beside Mercha, show that the pointing beside conjunctive as beside disjunctive accents wavers between a& and a4, although a4 is properly only justified beside disjunctive accents, and צוּני also really only occurs in pause.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The constructions is a pregnant one (as in Psalm 22:22; Psalm 28:1; Psalm 74:7; 2 Samuel 18:19; Ezra 2:62; 2 Chronicles 32:1): He answered me by removing me to a free space (Psalm 18:20). Both lines end with יהּ; nevertheless the reading במּרחביה is attested by the Masora (vid., Baer's Psalterium, pp. 132f.), instead of בּמּרחב יהּ. It has its advocates even in the Talmud (B. Pesachim 117a), and signifies a boundless extent, יה expressing the highest degree of comparison, like מאפּליה in Jeremiah 2:31, the deepest darkness. Even the lxx appears to have read מרחביה thus as one word (εἰς πλατυσμόν, Symmachus εἰς εὐρυχωρίαν). The Targum and Jerome, however, render it as we do; it is highly improbable that in one and the same verse the divine name should not be intended to be used in the same force of meaning. Psalm 56:1-13 (Psalm 56:10; Psalm 56:5, Psalm 56:12) echoes in Psalm 118:6; and in Psalm 118:7 Psalm 54:1-7 (Psalm 54:6) is in the mind of the later poet. In that passage it is still more clear than in the passage before us that by the Beth of בּעזרי Jahve is not meant to be designated as unus e multis, but as a helper who outweighs the greatest multitude of helpers. The Jewish people had experienced this helpful succour of Jahve in opposition to the persecutions of the Samaritans and the satraps during the building of the Temple; and had at the same time learned what is expressed in Psalm 118:7-8 (cf. Psalm 146:3), that trust in Jahve (for which חסה ב is the proper word) proves true, and trust in men, on the contrary, and especially in princes, is deceptive; for under Pseudo-Smerdis the work, begun under Cyrus, and represented as open to suspicion even in the reign of Cambyses, was interdicted. But in the reign of Darius it again became free: Jahve showed that He disposes events and the hearts of men in favour of His people, so that out of this has grown up in the minds of His people the confident expectation of a world-subduing supremacy expressed in Psalm 118:10.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The constructions is a pregnant one (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 28:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 74:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 18:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 2:62",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): He answered me by removing me to a free space (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Both lines end with יהּ; nevertheless the reading במּרחביה is attested by the Masora (vid., Baer's Psalterium, pp. 132f.), instead of בּמּרחב יהּ. It has its advocates even in the Talmud (B. Pesachim 117a), and signifies a boundless extent, יה expressing the highest degree of comparison, like מאפּליה in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the deepest darkness. Even the lxx appears to have read מרחביה thus as one word (εἰς πλατυσμόν, Symmachus εἰς εὐρυχωρίαν). The Targum and Jerome, however, render it as we do; it is highly improbable that in one and the same verse the divine name should not be intended to be used in the same force of meaning. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:1-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") echoes in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is in the mind of the later poet. In that passage it is still more clear than in the passage before us that by the Beth of בּעזרי Jahve is not meant to be designated as unus e multis, but as a helper who outweighs the greatest multitude of helpers. The Jewish people had experienced this helpful succour of Jahve in opposition to the persecutions of the Samaritans and the satraps during the building of the Temple; and had at the same time learned what is expressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 146:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that trust in Jahve (for which חסה ב is the proper word) proves true, and trust in men, on the contrary, and especially in princes, is deceptive; for under Pseudo-Smerdis the work, begun under Cyrus, and represented as open to suspicion even in the reign of Cambyses, was interdicted. But in the reign of Darius it again became free: Jahve showed that He disposes events and the hearts of men in favour of His people, so that out of this has grown up in the minds of His people the confident expectation of a world-subduing supremacy expressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The clauses Psalm 118:10, Psalm 118:11, and Psalm 118:12, expressed in the perfect form, are intended more hypothetically than as describing facts. The perfect is here set out in relief as a hypothetical tense by the following future. כּל־גּוים signifies, as in Psalm 117:1, the heathen of every kind. דּברים (in the Aramaic and Arabic with )ז are both bees and wasps, which make themselves especially troublesome in harvest time. The suffix of אמילם (from מוּל  equals  מלל, to hew down, cut in pieces) is the same as in Exodus 29:30; Exodus 2:17, and also beside a conjunctive accent in Psalm 74:8. Yet the reading אמילם, like יחיתן Habakkuk 2:17, is here the better supported (vid., Gesenius, Lehrgebude, S. 177), and it has been adopted by Norzi, Heidenheim, and Baer. The כּי is that which states the ground or reason, and then becomes directly confirmatory and assuring (Psalm 128:2, Psalm 128:4), which here, after the \"in the name of Jahve\" that precedes it, is applied and placed just as in the oath in 1 Samuel 14:44. And in general, as Redslob has demonstrated, כּי has not originally a relative, but a positive (determining) signification, כ being just as much a demonstrative sound as ד, ז, שׁ, and ת (cf. ἐκεῖ, ἐκεῖνος, κει'νος, ecce, hic, illic, with the Doric τηνεί, τῆνος). The notion of compassing round about is heightened in Psalm 118:11 by the juxtaposition of two forms of the same verb (Ges. 67, rem. 10), as in Hosea 4:18; Habakkuk 1:5; Zephaniah 2:1, and frequently. The figure of the bees is taken from Deuteronomy 1:44. The perfect דּעכוּ (cf. Isaiah 43:17) describes their destruction, which takes place instantly and unexpectedly. The Pual points to the punishing power that comes upon them: they are extinguished (exstinguuntur) like a fire of thorns, the crackling flame of which expires as quickly as it has blazed up (Psalm 58:10). In Psalm 118:13 the language of Israel is addressed to the hostile worldly power, as the antithesis shows. It thrust, yea thrust (inf. intens.) Israel, that it might fall (לנפּל; with reference to the pointing, vid., on Psalm 40:15); but Jahve's help would not suffer it to come to that pass. Therefore the song at the Red Sea is revived in the heart and mouth of Israel. Psalm 118:14 (like Isaiah 12:2) is taken from Exodus 15:2. עזּי (in MSS also written עזּי) is a collateral form of עזּי (Ew. 255, a), and here signifies the lofty self-consciousness which is united with the possession of power: pride and its expression an exclamation of joy. Concerning זמרת vid., on Psalm 16:6. As at that time, the cry of exultation and of salvation (i.e., of deliverance and of victory) is in the tabernacles of the righteous: the right hand of Jahve - they sing - עשׂה חיל (Numbers 24:18), practises valour, proves itself energetic, gains (maintains) the victory. רוממה is Milra, and therefore an adjective: victoriosa (Ew. 120 d), from רמם  equals  רוּם like שׁומם from שׁמם. It is not the part. Pil. (cf. Hosea 11:7), since the rejection of the participial Mem occurs in connection with Poal and Pual, but not elsewhere with Pilel (רומם  equals  מרומם from רוּם). The word yields a simpler sense, too, as adject. participle Kal; romēmā́h is only the fuller form for ramā́h, Exodus 14:8 (cf. rā́mah, Isaiah 26:11). It is not its own strength that avails for Israel's exultation of victory, but the energy of the right hand of Jahve. Being come to the brink of the abyss, Israel is become anew sure of its immortality through Him. God has, it is true, most severely chastened it (יסּרנּי with the suffix anni as in Genesis 30:6, and יהּ with the emphatic Dagesh, which neither reduplicates nor connects, cf. Psalm 118:5, Psalm 94:12), but still with moderation (Isaiah 27:7.). He has not suffered Israel to fall a prey to death, but reserved it for its high vocation, that it may see the mighty deeds of God and proclaim them to all the world. Amidst such celebration of Jahve the festive procession of the dedication of the Temple has arrived at the enclosure wall of the Temple. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The clauses ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", expressed in the perfect form, are intended more hypothetically than as describing facts. The perfect is here set out in relief as a hypothetical tense by the following future. כּל־גּוים signifies, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 117:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the heathen of every kind. דּברים (in the Aramaic and Arabic with )ז are both bees and wasps, which make themselves especially troublesome in harvest time. The suffix of אמילם (from מוּל  equals  מלל, to hew down, cut in pieces) is the same as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 29:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and also beside a conjunctive accent in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 74:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Yet the reading אמילם, like יחיתן ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is here the better supported (vid., Gesenius, Lehrgebude, S. 177), and it has been adopted by Norzi, Heidenheim, and Baer. The כּי is that which states the ground or reason, and then becomes directly confirmatory and assuring (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 128:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 128:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which here, after the \"in the name of Jahve\" that precedes it, is applied and placed just as in the oath in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And in general, as Redslob has demonstrated, כּי has not originally a relative, but a positive (determining) signification, כ being just as much a demonstrative sound as ד, ז, שׁ, and ת (cf. ἐκεῖ, ἐκεῖνος, κει'νος, ecce, hic, illic, with the Doric τηνεί, τῆνος). The notion of compassing round about is heightened in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by the juxtaposition of two forms of the same verb (Ges. 67, rem. 10), as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and frequently. The figure of the bees is taken from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The perfect דּעכוּ (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") describes their destruction, which takes place instantly and unexpectedly. The Pual points to the punishing power that comes upon them: they are extinguished (exstinguuntur) like a fire of thorns, the crackling flame of which expires as quickly as it has blazed up (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 58:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the language of Israel is addressed to the hostile worldly power, as the antithesis shows. It thrust, yea thrust (inf. intens.) Israel, that it might fall (לנפּל; with reference to the pointing, vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 40:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but Jahve's help would not suffer it to come to that pass. Therefore the song at the Red Sea is revived in the heart and mouth of Israel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is taken from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". עזּי (in MSS also written עזּי) is a collateral form of עזּי (Ew. 255, a), and here signifies the lofty self-consciousness which is united with the possession of power: pride and its expression an exclamation of joy. Concerning זמרת vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 16:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". As at that time, the cry of exultation and of salvation (i.e., of deliverance and of victory) is in the tabernacles of the righteous: the right hand of Jahve - they sing - עשׂה חיל (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 24:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), practises valour, proves itself energetic, gains (maintains) the victory. רוממה is Milra, and therefore an adjective: victoriosa (Ew. 120 d), from רמם  equals  רוּם like שׁומם from שׁמם. It is not the part. Pil. (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), since the rejection of the participial Mem occurs in connection with Poal and Pual, but not elsewhere with Pilel (רומם  equals  מרומם from רוּם). The word yields a simpler sense, too, as adject. participle Kal; romēmā́h is only the fuller form for ramā́h, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. rā́mah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is not its own strength that avails for Israel's exultation of victory, but the energy of the right hand of Jahve. Being come to the brink of the abyss, Israel is become anew sure of its immortality through Him. God has, it is true, most severely chastened it (יסּרנּי with the suffix anni as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 30:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and יהּ with the emphatic Dagesh, which neither reduplicates nor connects, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 118:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but still with moderation (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 27:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). He has not suffered Israel to fall a prey to death, but reserved it for its high vocation, that it may see the mighty deeds of God and proclaim them to all the world. Amidst such celebration of Jahve the festive procession of the dedication of the Temple has arrived at the enclosure wall of the Temple. ",
            "children": []
          }
        ]
      }
    ]
  }
]