[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Cease not to cry unto the Lord our God for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The fear on the part of Israel was very natural Unarmed—or, at least, very poorly armed and equipped—the assembled Israelites saw from the heights the advancing Philistine army. What hope was there for their ill-disciplined masses when they joined battle with that trained host of fighting men? But they remembered the days of old, and how, when Moses prayed, “the Angel of His presence” saved them. Had they not then with them there a seer equal to Moses, greater than Joshua, one with whom the Eternal of Hosts was wont to speak, as friend speaketh with friend? So in that supreme hour of danger they turned to Samuel the seer. We are just going, they said, all unarmed to meet that armed host; “cease not to cry unto the Lord our God for us,” And Samuel, we read in the brief and graphic account before us, hurriedly—for the time was short, and the foe close at hand—and with rites somewhat different from those enjoined in the Law—for the occasion was indeed a critical one—offered up a sacrifice, and raised that weird piercing cry which many in Israel had heard before when Samuel the seer prayed; and while the prophet-statesman was sustaining that loud imploring cry, while the smoke of the slain lamb was still ascending, the first line of the Philistine army appeared on the topmost slope of Mizpeh. Once more, as in old days, the glorious Arm fought with no earthly weapons for the people; an awful thunderstorm burst over the combatant hosts, the storm probably beating in the faces of the advancing Philistines. The tribes welcomed it as the answer to their prophet’s prayer, and with a wild enthusiasm charged down and broke the serried ranks of their oppressors. Josephus tells us of an earthquake, which added fresh horrors to the scene of battle. Each crash of thunder, each wild and furious gust of hail and rain, the men of Israel welcomed as a fresh onslaught on the part of an unseen army fighting by their side. The dismayed Philistines fled, and the rout was complete; the defeated army hurried panic-stricken over the same ground in the neighbourhood of Aphek illustrious twenty years before for their signal victory. The scene of carnage now received the significant name of Eben-ezer, or The Stone of Help.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 7:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 7:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cease not to cry unto the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — We are afraid to look God in the face, because of our great wickedness: do thou therefore intercede for us, as Moses did for his generation. They had reason to expect this, because he had promised to pray for them, had promised them deliverance from the Philistines, and they had been observant of him, in all that he had spoken to them from the Lord. Thus they who receive Christ as their lawgiver and judge, need not doubt of their interest in his intercession. O what a comfort it is to all believers, that he never ceaseth, is never silent, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "always appears in the presence ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of God for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:7-12 The Philistines invaded Israel. When sinners begin to repent and reform, they must expect that Satan will muster all his force against them, and set his instruments at work to the utmost, to oppose and discourage them. The Israelites earnestly beg Samuel to pray for them. Oh what a comfort it is to all believers, that our great Intercessor above never ceases, is never silent! for he always appears in the presence of God for us. Samuel's sacrifice, without his prayer, had been an empty shadow. God gave a gracious answer. And Samuel erected a memorial of this victory, to the glory of God, and to encourage Israel. Through successive generations, the church of God has had cause to set up Eben-ezers for renewed deliverances; neither outward persecutions nor inward corruptions have prevailed against her, because hitherto the Lord hath helped her: and he will help, even to the end of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This implies a united invasion by the whole Philistine force. Hence, the terror of the Israelites. (Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 7:7-14. While Samuel Prays, the Philistines Are Discomfited.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7-11. when the Philistines heard, &c.—The character and importance of the national convention at Mizpeh were fully appreciated by the Philistines. They discerned in it the rising spirit of religious patriotism among the Israelites that was prepared to throw off the yoke of their domination. Anxious to crush it at the first, they made a sudden incursion while the Israelites were in the midst of their solemn celebration. Unprepared for resistance, they besought Samuel to supplicate the divine interposition to save them from their enemies. The prophet's prayers and sacrifice were answered by such a tremendous storm of thunder and lightning that the assailants, panic-struck, were disordered and fled. The Israelites, recognizing the hand of God, rushed courageously on the foe they had so much dreaded and committed such immense havoc, that the Philistines did not for long recover from this disastrous blow. This brilliant victory secured peace and independence to Israel for twenty years, as well as the restitution of the usurped territory.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " We are ashamed and afraid to look God in the face, because of our great wickedness this day remembered and acknowledged; do thou therefore intercede for us, as Moses did for his generation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the children of Israel said to Samuel,.... To whom they applied, not as the general of their forces, but as the prophet of the Lord; believing his prayers for them would be of more avail to them than an army of men ever so numerous, or so well accoutred: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "cease not to cry unto the Lord our God for us: he had been praying for them that day, and they desired he would continue praying for them, well knowing that the effectual fervent prayer of a righteous man avails much; they knew their salvation was of the Lord, and that he only could save them, and that he must be sought unto for it; and as Samuel had an interest in him, they beg he would continue to make use of it on their behalf; in which they expressed their trust in God, their regard to means, the duty of prayer, and the high esteem they had of the prophet of the Lord, whom they entreat to pray for them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that he will save us out of the hands of the Philistines; who were now coming up against them, and who had for a long time tyrannised over them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that he will save us out of the hands of the Philistines; who were now coming up against them, and who had for a long time tyrannised over them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the children of Israel said to Samuel, Cease not to {e} cry unto the LORD our God for us, that he will save us out of the hand of the Philistines.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the children of Israel said to Samuel, Cease not to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cry unto the LORD our God for us, that he will save us out of the hand of the Philistines.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Signifying that in the prayers of the godly, there should be a vehement zeal.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When they had assembled together here, \"they drew water and poured it out before Jehovah, and fasted on that day, and said there, We have sinned against the Lord.\" Drawing water and pouring it out before Jehovah was a symbolical act, which has been thus correctly explained by the Chaldee, on the whole: \"They poured out their heart like water in penitence before the Lord.\" This is evident from the figurative expressions, \"poured out like water,\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and \"pour out thy heart like water,\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which are used to denote inward dissolution through pain, misery, and distress (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 14:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Hence the pouring out of water before God was a symbolical representation of the temporal and spiritual distress in which they were at the time, - a practical confession before God, \"Behold, we are before Thee like water that has been poured out;\" and as it was their own sin and rebellion against God that had brought this distress upon them, it was at the same time a confession of their misery, and an act of the deepest humiliation before the Lord. They gave a still further practical expression to this humiliation by fasting (צוּם), as a sign of their inward distress of mind on account of their sin, and an oral confession of their sin against the Lord. By the word שׁם, which is added to ויּאמרוּ, \"they said \"there,\" i.e., at Mizpeh, the oral confession of their sin is formally separated from the two symbolical acts of humiliation before God, though by this very separation it is practically placed on a par with them. What they did symbolically by the pouring out of water and fasting, they explained and confirmed by their verbal confession. שׁם is never an adverb of time signifying \"then;\" neither in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", nor ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And thus Samuel judged the children of Israel at Mizpeh.\" ויּשׁפּט does not mean \"he became judge\" (Mich. and others), any more than \"he punished every one according to his iniquity\" (Thenius, after David Kimchi). Judging the people neither consisted in a censure pronounced by Samuel afterwards, nor in absolution granted to the penitent after they had made a confession of their sin, but in the fact that Samuel summoned the nation to Mizpeh to humble itself before Jehovah, and there secured for it, through his intercession, the forgiveness of its sin, and a renewal of the favour of its God, and thus restored the proper relation between Israel and its God, so that the Lord could proceed to vindicate His people's rights against their foes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When the Philistines heard of the gathering of the Israelites at Mizpeh (1 Samuel 7:7, 1 Samuel 7:8), their princes went up against Israel to make war upon it; and the Israelites, in their fear of the Philistines, entreated Samuel, \"Do not cease to cry for us to the Lord our God, that He may save us out of the hand of the Philistines.\" 1 Samuel 7:9. \"And Samuel took a milk-lamb (a lamb that was still sucking, probably, according to Leviticus 22:27, a lamb seven days old), and offered it whole as a burnt-offering to the Lord.\" כּליל is used adverbially, according to its original meaning as an adverb, \"whole.\" The Chaldee has not given the word at all, probably because the translators regarded it as pleonastic, since every burnt-offering was consumed upon the altar whole, and consequently the word כּליל was sometimes used in a substantive sense, as synonymous with עולה (Deuteronomy 33:10; Psalm 51:21). But in the passage before us, כּליל is not synonymous with עולה, but simply affirms that the lamb was offered upon the altar without being cut up or divided. Samuel selected a young lamb for the burnt-offering, not \"as being the purest and most innocent kind of sacrificial animal,\" - for it cannot possibly be shown that very young animals were regarded as purer than those that were full-grown, - but as being the most suitable to represent the nation that had wakened up to new life through its conversion to the Lord, and was, as it were, new-born. For the burnt-offering represented the man, who consecrated therein his life and labour to the Lord. The sacrifice was the substratum for prayer. When Samuel offered it, he cried to the Lord for the children of Israel; and the Lord \"answered,\" i.e., granted, his prayer.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When the Philistines heard of the gathering of the Israelites at Mizpeh (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 7:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 7:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), their princes went up against Israel to make war upon it; and the Israelites, in their fear of the Philistines, entreated Samuel, \"Do not cease to cry for us to the Lord our God, that He may save us out of the hand of the Philistines.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 7:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"And Samuel took a milk-lamb (a lamb that was still sucking, probably, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 22:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", a lamb seven days old), and offered it whole as a burnt-offering to the Lord.\" כּליל is used adverbially, according to its original meaning as an adverb, \"whole.\" The Chaldee has not given the word at all, probably because the translators regarded it as pleonastic, since every burnt-offering was consumed upon the altar whole, and consequently the word כּליל was sometimes used in a substantive sense, as synonymous with עולה (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But in the passage before us, כּליל is not synonymous with עולה, but simply affirms that the lamb was offered upon the altar without being cut up or divided. Samuel selected a young lamb for the burnt-offering, not \"as being the purest and most innocent kind of sacrificial animal,\" - for it cannot possibly be shown that very young animals were regarded as purer than those that were full-grown, - but as being the most suitable to represent the nation that had wakened up to new life through its conversion to the Lord, and was, as it were, new-born. For the burnt-offering represented the man, who consecrated therein his life and labour to the Lord. The sacrifice was the substratum for prayer. When Samuel offered it, he cried to the Lord for the children of Israel; and the Lord \"answered,\" i.e., granted, his prayer.",
            "children": []
          }
        ]
      }
    ]
  }
]