[{"num":30,"verse":"The word that came to Jeremiah from the Lord:"},{"num":2,"verse":"Thus says the Lord, the God of Israel: Write all the words that I have spoken to you in a book."},{"num":3,"verse":"For, note well, the days are coming, says the Lord, when I will release from captivity My people Israel and Judah, says the Lord, and I will cause them to return to the land that I gave to their fathers, and they will possess it."},{"num":4,"verse":"And these are the words the Lord spoke concerning Israel and Judah:"},{"num":5,"verse":"Thus says the Lord: We have heard a voice of trembling and panic—of terror, and not peace."},{"num":6,"verse":"Ask now and see whether a man can give birth to a child? Why then do I see every man with his hands on his loins like a woman in labor? Why are all faces turned pale?"},{"num":7,"verse":"Alas! for that day will be great, so that none will be like it; it will be the time of Jacob’s [unequaled] trouble, but he will be saved out of it."},{"num":8,"verse":"For it will come to pass in that day, says the Lord of hosts, that I will break [the oppressor’s] yoke from your neck, and I will burst your bonds; and strangers will no more make slaves of [the people of Israel]."},{"num":9,"verse":"But they will serve the Lord their God and David’s [descendant] their King, Whom I will raise up for them."},{"num":10,"verse":"Therefore fear not, O My servant Jacob, says the Lord, nor be dismayed or cast down, O Israel; for behold, I will save you out of a distant land [of exile] and your posterity from the land of their captivity. Jacob will return and will be quiet and at ease, and none will make him afraid or cause him to be terrorized and to tremble."},{"num":11,"verse":"For I am with you, says the Lord, to save you; for I will make a full and complete end of all the nations to which I have scattered you, but I will not make a full and complete end of you. But I will correct you in measure and with judgment and will in no sense hold you guiltless or leave you unpunished."},{"num":12,"verse":"For thus says the Lord: Your hurt is incurable and your wound is grievous."},{"num":13,"verse":"There is none to plead your cause; for [the pressing together of] your wound you have no healing [device], no binding plaster."},{"num":14,"verse":"All your lovers (allies) have forgotten you; they neither seek, inquire of, or require you. For I have hurt you with the wound of an enemy, with the chastisement of a cruel and merciless foe, because of the greatness of your perversity and guilt, because your sins are glaring and innumerable."},{"num":15,"verse":"Why do you cry out because of your hurt [the natural result of your sins]? Your pain is deadly (incurable). Because of the greatness of your perversity and guilt, because your sins are glaring and innumerable, I have done these things to you."},{"num":16,"verse":"Therefore all who devour you will be devoured; and all your adversaries, every one of them, will go into captivity. And they who despoil you will become a spoil, and all who prey upon you will I give for a prey."},{"num":17,"verse":"For I will restore health to you, and I will heal your wounds, says the Lord, because they have called you an outcast, saying, This is Zion, whom no one seeks after and for whom no one cares!"},{"num":18,"verse":"Thus says the Lord: Behold, I will release from captivity the tents of Jacob and have mercy on his dwelling places; the city will be rebuilt on its own [old] moundlike site, and the palace will be dwelt in after its former fashion."},{"num":19,"verse":"Out of them [city and palace] will come songs of thanksgiving and the voices of those who make merry. And I will multiply them, and they will not be few; I will also glorify them, and they will not be small."},{"num":20,"verse":"Their children too shall be as in former times, and their congregation shall be established before Me, and I will punish all who oppress them."},{"num":21,"verse":"And their prince will be one of them, and their ruler will come from the midst of them. I will cause him to draw near and he will approach Me, for who is he who would have the boldness and would dare [on his own initiative] to approach Me? says the Lord."},{"num":22,"verse":"Then you will be My people, and I will be your God."},{"num":23,"verse":"Behold, the tempest of the Lord has gone forth with wrath, a sweeping and gathering tempest; it shall whirl and burst upon the heads of the wicked."},{"num":24,"verse":"The fierce anger and indignation of the Lord shall not turn back until He has executed and accomplished the thoughts and intents of His mind and heart. In the latter days you shall understand this."}]