[{"num":30,"verse":"The word that came to Jeremiah from Jehovah, saying, "},{"num":2,"verse":"Thus speaketh Jehovah, the God of Israel, saying, Write thee all the words that I have spoken unto thee in a book. "},{"num":3,"verse":"For, lo, the days come, saith Jehovah, that I will turn again the captivity of my people Israel and Judah, saith Jehovah; and I will cause them to return to the land that I gave to their fathers, and they shall possess it."},{"num":4,"verse":"And these are the words that Jehovah spake concerning Israel and concerning Judah. "},{"num":5,"verse":"For thus saith Jehovah: We have heard a voice of trembling, of fear, and not of peace. "},{"num":6,"verse":"Ask ye now, and see whether a man doth travail with child: wherefore do I see every man with his hands on his loins, as a woman in travail, and all faces are turned into paleness? "},{"num":7,"verse":"Alas! for that day is great, so that none is like it: it is even the time of Jacob’s trouble; but he shall be saved out of it. "},{"num":8,"verse":"And it shall come to pass in that day, saith Jehovah of hosts, that I will break his yoke from off thy neck, and will burst thy bonds; and strangers shall no more make him their bondman; "},{"num":9,"verse":"but they shall serve Jehovah their God, and David their king, whom I will raise up unto them. "},{"num":10,"verse":"Therefore fear thou not, O Jacob my servant, saith Jehovah; neither be dismayed, O Israel: for, lo, I will save thee from afar, and thy seed from the land of their captivity; and Jacob shall return, and shall be quiet and at ease, and none shall make him afraid. "},{"num":11,"verse":"For I am with thee, saith Jehovah, to save thee: for I will make a full end of all the nations whither I have scattered thee, but I will not make a full end of thee; but I will correct thee in measure, and will in no wise leave thee unpunished. "},{"num":12,"verse":"For thus saith Jehovah, Thy hurt is incurable, and thy wound grievous. "},{"num":13,"verse":"There is none to plead thy cause, that thou mayest be bound up: thou hast no healing medicines. "},{"num":14,"verse":"All thy lovers have forgotten thee; they seek thee not: for I have wounded thee with the wound of an enemy, with the chastisement of a cruel one, for the greatness of thine iniquity, because thy sins were increased. "},{"num":15,"verse":"Why criest thou for thy hurt? thy pain is incurable: for the greatness of thine iniquity, because thy sins were increased, I have done these things unto thee. "},{"num":16,"verse":"Therefore all they that devour thee shall be devoured; and all thine adversaries, every one of them, shall go into captivity; and they that despoil thee shall be a spoil, and all that prey upon thee will I give for a prey. "},{"num":17,"verse":"For I will restore health unto thee, and I will heal thee of thy wounds, saith Jehovah; because they have called thee an outcast, saying, It is Zion, whom no man seeketh after."},{"num":18,"verse":"Thus saith Jehovah: Behold, I will turn again the captivity of Jacob’s tents, and have compassion on his dwelling-places; and the city shall be builded upon its own hill, and the palace shall be inhabited after its own manner. "},{"num":19,"verse":"And out of them shall proceed thanksgiving and the voice of them that make merry: and I will multiply them, and they shall not be few; I will also glorify them, and they shall not be small. "},{"num":20,"verse":"Their children also shall be as aforetime, and their congregation shall be established before me; and I will punish all that oppress them. "},{"num":21,"verse":"And their prince shall be of themselves, and their ruler shall proceed from the midst of them; and I will cause him to draw near, and he shall approach unto me: for who is he that hath had boldness to approach unto me? saith Jehovah. "},{"num":22,"verse":"And ye shall be my people, and I will be your God."},{"num":23,"verse":"Behold, the tempest of Jehovah, even his wrath, is gone forth, a sweeping tempest: it shall burst upon the head of the wicked. "},{"num":24,"verse":"The fierce anger of Jehovah shall not return, until he have executed, and till he have performed the intents of his heart: in the latter days ye shall understand it."}]