[{"num":30,"verse":"This is another of the Lord’s messages to Jeremiah:"},{"num":2,"verse":"The Lord God of Israel says: Write down for the record all that I have said to you. "},{"num":3,"verse":"For the time is coming when I will restore the fortunes of my people, Israel and Judah, and I will bring them home to this land that I gave to their fathers; they shall possess it and live here again."},{"num":4,"verse":"And write this also concerning Israel and Judah:"},{"num":5,"verse":"“Where shall we find peace?” they cry. “There is only fear and trembling. "},{"num":6,"verse":"Do men give birth? Then why do they stand there, ashen-faced, hands pressed against their sides like women in labor?”"},{"num":7,"verse":"Alas, in all history when has there ever been a time of terror such as in that coming day? It is a time of trouble for my people—for Jacob—such as they have never known before. Yet God will rescue them! "},{"num":8,"verse":"For on that day, says the Lord Almighty, I will break the yoke from their necks and snap their chains, and foreigners shall no longer be their masters! "},{"num":9,"verse":"For they shall serve the Lord their God, and David their King, whom I will raise up for them, says the Lord."},{"num":10,"verse":"So don’t be afraid, O Jacob my servant; don’t be dismayed, O Israel; for I will bring you home again from distant lands, and your children from their exile. They shall have rest and quiet in their own land, and no one shall make them afraid. "},{"num":11,"verse":"For I am with you and I will save you, says the Lord. Even if I utterly destroy the nations where I scatter you, I will not exterminate you; I will punish you, yes—you will not go unpunished."},{"num":12,"verse":"For your sin is an incurable bruise, a terrible wound. "},{"num":13,"verse":"There is no one to help you or to bind up your wound, and no medicine does any good. "},{"num":14,"verse":"All your lovers have left you and don’t care anything about you anymore; for I have wounded you cruelly, as though I were your enemy; mercilessly, as though I were an implacable foe; for your sins are so many, your guilt is so great."},{"num":15,"verse":"Why do you protest your punishment? Your sin is so scandalous that your sorrow should never end! It is because your guilt is great that I have had to punish you so much."},{"num":16,"verse":"But in that coming day, all who are destroying you shall be destroyed, and all your enemies shall be slaves. Those who rob you shall be robbed; and those attacking you shall be attacked. "},{"num":17,"verse":"I will give you back your health again and heal your wounds. Now you are called “The Outcast” and “Jerusalem, the Place Nobody Wants.”"},{"num":18,"verse":"But, says the Lord, when I bring you home again from your captivity and restore your fortunes, Jerusalem will be rebuilt upon her ruins; the palace will be reconstructed as it was before. "},{"num":19,"verse":"The cities will be filled with joy and great thanksgiving, and I will multiply my people and make of them a great and honored nation. "},{"num":20,"verse":"Their children shall prosper as in David’s reign; their nations shall be established before me, and I will punish anyone who hurts them. "},{"num":21,"verse":"They will have their own ruler again. He will not be a foreigner. And I will invite him to be a priest at my altars, and he shall approach me, for who would dare to come unless invited. "},{"num":22,"verse":"And you shall be my people, and I will be your God."},{"num":23,"verse":"Suddenly the devastating whirlwind of the Lord roars with fury; it shall burst upon the heads of the wicked. "},{"num":24,"verse":"The Lord will not call off the fierceness of his wrath until it has finished all the terrible destruction he has planned. Later on you will understand what I am telling you."}]