[{"header":"The Offering for Cleansing"},{"num":19,"verse":"The Lord said to Moses and Aaron, "},{"num":2,"verse":"“These are the teachings that the Lord commanded. Tell the Israelites to get a young red cow. It must not have anything wrong with it. It must not have been worked. "},{"num":3,"verse":"Give the cow to Eleazar the priest. He will take it outside the camp and kill it. "},{"num":4,"verse":"Then Eleazar the priest must put some of the blood on his finger. He must sprinkle it seven times toward the front of the Meeting Tent. "},{"num":5,"verse":"Then the whole cow must be burned while he watches. The skin, the meat, the blood and the intestines must all be burned. "},{"num":6,"verse":"Then the priest must take a cedar stick, a hyssop branch and a red string. He must throw them onto the burning cow. "},{"num":7,"verse":"Then the priest must wash himself and his clothes with water. After that, he may come back into the camp. But he will be unclean until evening. "},{"num":8,"verse":"The man who burns the cow must wash himself and his clothes in water. He will be unclean until evening."},{"num":9,"verse":"“Then someone who is clean will collect the ashes from the cow. He will put them in a clean place outside the camp. The Israelites will use these ashes in a special ceremony to cleanse away sin. "},{"num":10,"verse":"The man who collected the cow’s ashes must wash his clothes. He will be unclean until evening. This is a lasting rule. It is for the Israelites and for the foreigners among them."},{"num":11,"verse":"“Whoever touches a dead body will be unclean for seven days. "},{"num":12,"verse":"He must wash himself with this water. He must do this on the third day and on the seventh day. Then he will be clean. But if he does not wash himself on the third day and the seventh day, he cannot be clean. "},{"num":13,"verse":"Whoever touches a dead body is unclean. If he stays unclean and goes to the Lord’s Holy Tent, it becomes unclean. So he must be separated from Israel. If the cleansing water is not sprinkled on him, he will stay unclean."},{"num":14,"verse":"“This is the teaching about someone who dies in his tent. Anyone in the tent or who enters it will be unclean for seven days. "},{"num":15,"verse":"And every open jar or pot without a cover becomes unclean. "},{"num":16,"verse":"If anyone touches someone who was killed by a sword or who died a natural death, he is unclean. If he touches a human bone or a grave, he is unclean. He will be unclean for seven days."},{"num":17,"verse":"“So you must use the ashes from the burnt offering to make that person clean again. Pour fresh water over the ashes into a jar. "},{"num":18,"verse":"A clean person must take a hyssop branch and dip it into the water. Then he must sprinkle it over the tent and its objects. And he must sprinkle the people who were there. He must sprinkle anyone who touched a bone or the body of someone who was killed. He must sprinkle anyone who touched a dead person or a grave. "},{"num":19,"verse":"Then someone who is clean must sprinkle this water on the unclean person. He must do this on the third day and on the seventh day. On the seventh day that person becomes clean. He must wash his clothes and take a bath. He will be clean that evening. "},{"num":20,"verse":"If anyone who is unclean does not become clean, he must be separated from the community. He was not sprinkled with the cleansing water. He stays unclean. He could make the Holy Tent unclean. "},{"num":21,"verse":"This is a lasting rule. Whoever sprinkles the cleansing water must also wash his clothes. Anyone who touches the water will be unclean until evening. "},{"num":22,"verse":"Anyone the unclean person touches becomes unclean. And whoever touches him will be unclean until evening.”"}]