[{"header":"Ordinance of the Red Heifer"},{"num":19,"verse":"Then the Lord spoke to Moses and Aaron, saying,"},{"num":2,"verse":"“This is the statute of the law which the Lord has commanded, saying, ‘Speak to the sons of Israel that they bring you an unblemished red heifer in which there is no defect and on which a yoke has never been mounted."},{"num":3,"verse":"And you shall give it to Eleazar the priest, and it shall be brought outside the camp and be slaughtered in his presence."},{"num":4,"verse":"And Eleazar the priest shall take some of its blood with his finger and sprinkle some of its blood toward the front of the tent of meeting seven times."},{"num":5,"verse":"Then the heifer shall be burned in his sight; its hide, its flesh, and its blood, with its refuse, shall be burned."},{"num":6,"verse":"And the priest shall take cedar wood, hyssop, and scarlet material, and throw it into the midst of the burning heifer."},{"num":7,"verse":"The priest shall then wash his clothes and bathe his body in water, and afterward come into the camp; but the priest will be unclean until evening."},{"num":8,"verse":"The one who burns the heifer shall also wash his clothes in water and bathe his body in water, and will be unclean until evening."},{"num":9,"verse":"Now a man who is clean shall gather up the ashes of the heifer and put them outside the camp in a clean place, and the congregation of the sons of Israel shall keep them for water to remove impurity; it is purification from sin."},{"num":10,"verse":"And the one who gathers the ashes of the heifer shall wash his clothes and will be unclean until evening; and it shall be a permanent statute for the sons of Israel and for the stranger who resides among them."},{"num":11,"verse":"‘The one who touches the dead body of any person will also be unclean for seven days."},{"num":12,"verse":"That one shall purify himself with the water on the third day and on the seventh day, and then he will be clean; but if he does not purify himself on the third day and on the seventh day, he will not be clean."},{"num":13,"verse":"Anyone who touches a dead body, the body of a person who has died, and does not purify himself, defiles the tabernacle of the Lord; and that person shall be cut off from Israel. Since the water for impurity was not sprinkled on him, he will be unclean; his uncleanness is still on him."},{"num":14,"verse":"‘This is the law when a person dies in a tent: everyone who comes into the tent and everyone who is in the tent will be unclean for seven days."},{"num":15,"verse":"And every open container, which has no cover tied down on it, will be unclean."},{"num":16,"verse":"Also, anyone who in the open field touches one who has been killed with a sword or one who has died naturally, or touches a human bone or a grave, will be unclean for seven days."},{"num":17,"verse":"Then for the unclean person they shall take some of the ashes of the burnt purification from sin and running water shall be added to them in a container."},{"num":18,"verse":"And a clean person shall take hyssop and dip it in the water, and sprinkle it on the tent, on all the furnishings, on the persons who were there, and on the one who touched the bone or the one who was killed or the one who died naturally, or the grave."},{"num":19,"verse":"Then the clean person shall sprinkle on the unclean on the third day and on the seventh day; and on the seventh day he shall purify him, and he shall wash his clothes and bathe himself in water and will be clean by evening."},{"num":20,"verse":"‘But the person who is unclean and does not purify himself, that person shall be cut off from the midst of the assembly, because he has defiled the sanctuary of the Lord; the water for impurity has not been sprinkled on him, so he is unclean."},{"num":21,"verse":"So it shall be a permanent statute for them. And the one who sprinkles the water for impurity shall wash his clothes, and the one who touches the water for impurity will be unclean until evening."},{"num":22,"verse":"Furthermore, anything that the unclean person touches will be unclean; and the person who touches it will be unclean until evening.’”"}]