[{"header":"Psalm 27"},{"num":1,"verse":"The Lord is my Light and my Salvation—whom shall I fear or dread? The Lord is the Refuge and Stronghold of my life—of whom shall I be afraid?"},{"num":2,"verse":"When the wicked, even my enemies and my foes, came upon me to eat up my flesh, they stumbled and fell."},{"num":3,"verse":"Though a host encamp against me, my heart shall not fear; though war arise against me, [even then] in this will I be confident."},{"num":4,"verse":"One thing have I asked of the Lord, that will I seek, inquire for, and [insistently] require: that I may dwell in the house of the Lord [in His presence] all the days of my life, to behold and gaze upon the beauty [the sweet attractiveness and the delightful loveliness] of the Lord and to meditate, consider, and inquire in His temple."},{"num":5,"verse":"For in the day of trouble He will hide me in His shelter; in the secret place of His tent will He hide me; He will set me high upon a rock."},{"num":6,"verse":"And now shall my head be lifted up above my enemies round about me; in His tent I will offer sacrifices and shouting of joy; I will sing, yes, I will sing praises to the Lord."},{"num":7,"verse":"Hear, O Lord, when I cry aloud; have mercy and be gracious to me and answer me!"},{"num":8,"verse":"You have said, Seek My face [inquire for and require My presence as your vital need]. My heart says to You, Your face (Your presence), Lord, will I seek, inquire for, and require [of necessity and on the authority of Your Word]."},{"num":9,"verse":"Hide not Your face from me; turn not Your servant away in anger, You Who have been my help! Cast me not off, neither forsake me, O God of my salvation!"},{"num":10,"verse":"Although my father and my mother have forsaken me, yet the Lord will take me up [adopt me as His child]."},{"num":11,"verse":"Teach me Your way, O Lord, and lead me in a plain and even path because of my enemies [those who lie in wait for me]."},{"num":12,"verse":"Give me not up to the will of my adversaries, for false witnesses have risen up against me; they breathe out cruelty and violence."},{"num":13,"verse":"[What, what would have become of me] had I not believed that I would see the Lord’s goodness in the land of the living!"},{"num":14,"verse":"Wait and hope for and expect the Lord; be brave and of good courage and let your heart be stout and enduring. Yes, wait for and hope for and expect the Lord."}]