[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Said (spake) unto them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—LXX. and Syriac, “unto him,” which seems original.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The fire of God.—“The” is not in the Hebrew. The LXX., Vulgate, Arabic, and Targum, with some MSS., omit “of God.” The phrase occurs in the sense of lightning (Job 1:16).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The fire of God.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—“The” is not in the Hebrew. The LXX., Vulgate, Arabic, and Targum, with some MSS., omit “of God.” The phrase occurs in the sense of lightning (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Consumed him and his fifty.—According to Thenius, the story of the destruction of the captains And their companies emphasises (1) the authority properly belonging to the prophet; (2) the help and protection which Jehovah bestows on His prophets. The captains and their men are simply conceived as instruments of a will opposing itself to Jehovah, and are accordingly annihilated. These considerations, he thinks, render irrelevant all questions about the moral justice of their fate, and comparative degrees of guilt. (Comp. 2Kings 2:23, seq., 2Kings 6:17.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Consumed him and his fifty.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—According to Thenius, the story of the destruction of the captains And their companies emphasises (1) the authority properly belonging to the prophet; (2) the help and protection which Jehovah bestows on His prophets. The captains and their men are simply conceived as ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "instruments of a will opposing itself to Jehovah",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and are accordingly annihilated. These considerations, he thinks, render irrelevant all questions about the moral justice of their fate, and comparative degrees of guilt. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "seq",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 6:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:9-18 Elijah called for fire from heaven, to consume the haughty, daring sinners; not to secure himself, but to prove his mission, and to reveal the wrath of God from heaven, against the ungodliness and unrighteousness of men. Elijah did this by a Divine impulse, yet our Saviour would not allow the disciples to do the like, Lu 9:54. The dispensation of the Spirit and of grace by no means allowed it. Elijah was concerned for God's glory, those for their own reputation. The Lord judges men's practices by their principles, and his judgment is according to truth. The third captain humbled himself, and cast himself upon the mercy of God and Elijah. There is nothing to be got by contending with God; and those are wise for themselves, who learn submission from the fatal end of obstinacy in others. The courage of faith has often struck terror into the heart of the proudest sinner. So thunderstruck is Ahaziah with the prophet's words, that neither he, nor any about him, offer him violence. Who can harm those whom God shelters? Many who think to prosper in sin, are called hence like Ahaziah, when they do not expect it. All warns us to seek the Lord while he may be found.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The charge of cruelty made against Elijah makes it needful to consider the question: What was Elijah's motive? And the answer is: Sharply to make a signal example, to vindicate God's honor in a striking way. Ahaziah had, as it were, challenged Yahweh to a trial of strength by sending a band of fifty to arrest one man. Elijah was not Jesus Christ, able to reconcile mercy with truth, the vindication of God's honor with the utmost tenderness for erring men, and awe them merely by His presence (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In Elijah the spirit of the Law was embodied in its full severity. His zeal was fierce; he was not shocked by blood; he had no softness and no relenting. He did not permanently profit by the warning at Horeb (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 19:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note). He continued the uncompromising avenger of sin, the wielder of the terrors of the Lord, such exactly as he had shown himself at Carmel. He is, consequently, no pattern for Christian men ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but his character is the perfection of the purely legal type. No true Christian after Pentecost would have done what Elijah did. But what he did, when he did it, was not sinful. It was but executing strict, stern justice. Elijah asked that fire should fall - God made it fall; and, by so doing, both vindicated His own honor, and justified the prayer of His prophet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. let fire come down—rather, \"fire shall come down.\" Not to avenge a personal insult of Elijah, but an insult upon God in the person of His prophet; and the punishment was inflicted, not by the prophet, but by the direct hand of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Elijah answered and said unto them,.... The same as he had to the first captain, and made the same request of fire from heaven; which accordingly came down, and destroyed this captain and his fifty also. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Elijah answered and said unto them, {i} If I be a man of God, let fire come down from heaven, and consume thee and thy fifty. And the fire of God came down from heaven, and consumed him and his fifty.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Elijah answered and said unto them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " If I ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a man of God, let fire come down from heaven, and consume thee and thy fifty. And the fire of God came down from heaven, and consumed him and his fifty.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Meaning, that God would show by effect whether he was a true prophet or not.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The same fate befell a second captain, whom the king sent after the death of the first. He was more insolent than the first, \"both because he was not brought to his senses by hearing of his punishment, and because he increased his impudence by adding make haste (מהרה).\" - C. a Lap. For וידבּר ויּען the lxx (Cod. Alex.) have καὶ ἀνέβη καὶ ἐλάλησε, so that they read ויּעל. The correctness of this reading, according to which ויּען would be an error of the pen, is favoured not only by ויּעל in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but also by וידבּר which follows; for, as a general rule, ויּען would be followed by ויּאמר. The repetition of this judicial miracle was meant to show in the most striking manner not only the authority which rightfully belonged to the prophet, but also the help and protection which the Lord gave to His servants. At the same time, the question as to the \"morality of the miracle,\" about which some have had grave doubts, is not set at rest by the remark of Thenius, that \"the soldiers who were sent come into consideration here purely as instruments of a will acting in opposition to Jehovah.\" The third captain also carried out he ungodly command of the king, and he was not slain (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The first two must therefore have been guilty of some crime, which they and their people had to expiate with their death. This crime did not consist merely in their addressing him as \"man of God,\" for the third addressed Elijah in the same way (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but in their saying \"Man of God, come down.\" This summons to the prophet, to allow himself to be led as a prisoner before the king, involved a contempt not only of the prophetic office in the person of Elijah, but also of the Lord, who had accredited him by miracles as His servant. The two captains who were first sent not only did what they were bound to do as servants of the king, but participated in the ungodly disposition of their lord (συμβαίνοντες τῷ σκοπῷ τοῦ πεπομφότος - Theodoret); they attacked the Lord with reckless daring in the person of the prophet, and the second captain, with his \"Come down quickly,\" did it even more strongly than the first. This sin was punished, and that not by the prophet, but by the Lord Himself, who fulfilled the word of His servant.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Οἱ τοῦ προφήτου κατηγοροῦντες κατὰ τοῦ Θεοῦ τοῦ προφήτου κινοῦσι τὰς γλώττας, as Theodoret very aptly observes.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What Elijah here did was an act of holy zeal for the honour of the Lord, in the spirit of the old covenant, under which God destroyed the insolent despisers of His name with fire and sword, to manifest the energy of His holy majesty by the side of the dead idols of the heathen. But this act cannot be transferred to the times of the new covenant, as is clearly shown in Luke 9:54-55, where Christ does not blame Elijah for what he did, but admonishes His disciples, who overlooked the difference between the economy of the law and that of the gospel, and in their carnal zeal wanted to imitate what Elijah had done in divine zeal for the honour of the Lord, which had been injured in his own person. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "What Elijah here did was an act of holy zeal for the honour of the Lord, in the spirit of the old covenant, under which God destroyed the insolent despisers of His name with fire and sword, to manifest the energy of His holy majesty by the side of the dead idols of the heathen. But this act cannot be transferred to the times of the new covenant, as is clearly shown in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:54-55",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where Christ does not blame Elijah for what he did, but admonishes His disciples, who overlooked the difference between the economy of the law and that of the gospel, and in their carnal zeal wanted to imitate what Elijah had done in divine zeal for the honour of the Lord, which had been injured in his own person. ",
            "children": []
          }
        ]
      }
    ]
  }
]