[[],[{"type":"header","content":"Results of Justification"},{"type":"prose","content":"Therefore, since we have been justified [that is, acquitted of sin, declared blameless before God] by faith, [let us grasp the fact that] we have peace with God [and the joy of reconciliation with Him] through our Lord Jesus Christ (the Messiah, the Anointed). "}],[{"type":"prose","content":"Through Him we also have access by faith into this [remarkable state of] grace in which we [firmly and safely and securely] stand. Let us rejoice in our hope  the confident assurance of [experiencing and enjoying] the glory of [our great] God [the manifestation of His excellence and power]. "}],[{"type":"prose","content":"And not only , but [with joy] let us exult in our sufferings  rejoice in our hardships, knowing that hardship (distress, pressure, trouble) produces patient endurance; "}],[{"type":"prose","content":"and endurance, proven character (spiritual maturity); and proven character, hope  confident assurance [of eternal salvation]. "}],[{"type":"prose","content":"Such hope [in God’s promises] never disappoints , because God’s love has been abundantly poured out within our hearts through the Holy Spirit who was given to us."}],[{"type":"prose","content":"While we were still helpless [powerless to provide for our salvation], at the right time Christ died [as a substitute] for the ungodly. "}],[{"type":"prose","content":"Now it is an extraordinary thing for one to willingly give his life even for an upright man, though perhaps for a good man [one who is noble and selfless and worthy] someone might even dare to die. "}],[{"type":"prose","content":"But God clearly shows  proves His own love for us, by the fact that while we were still sinners, Christ died for us. "}],[{"type":"prose","content":"Therefore, since we have now been justified [declared free of the guilt of sin] by His blood, [how much more certain is it that] we will be saved from the wrath  through Him. "}],[{"type":"prose","content":"For if while we were enemies we were reconciled to God through the death of His Son,  much more , having been reconciled, that we will be saved [from the consequences of sin] by His life [that is, we will be saved because Christ lives today]. "}],[{"type":"prose","content":"Not only that, but we also rejoice in God [rejoicing in His love and perfection] through our Lord Jesus Christ, through whom we have now received  enjoy our reconciliation [with God]."}],[{"type":"prose","content":"Therefore, just as sin came into the world through one man, and death through sin, so death spread to all people [no one being able to stop it or escape its power], because they all sinned. "}],[{"type":"prose","content":"Sin was [committed] in the world before the Law [was given], but sin is not charged [against anyone] when there is no law [against it]. "}],[{"type":"prose","content":"Yet death ruled [over mankind] from Adam to Moses [the Lawgiver], even over those who had not sinned as Adam did. Adam is a type of Him (Christ) who was to come [but in reverse—Adam brought destruction, Christ brought salvation]."}],[{"type":"prose","content":"But the free gift [of God] is not like the trespass [because the gift of grace overwhelms the fall of man]. For if many died by one man’s trespass [Adam’s sin], much more [abundantly] did God’s grace and the gift [that comes] by the grace of the one Man, Jesus Christ, overflow to [benefit] the many. "}],[{"type":"prose","content":"Nor is the gift [of grace] like  through the one who sinned. For on the one hand the judgment [following the sin]  from one trespass and brought condemnation, but on the other hand the free gift  from many trespasses and brought justification [the release from sin’s penalty for those who believe]. "}],[{"type":"prose","content":"For if by the trespass of the one (Adam), death reigned through the one (Adam), much more  will those who receive the abundance of grace and the free gift of righteousness reign in [eternal] life through the One, Jesus Christ."}],[{"type":"prose","content":"So then as through one trespass [Adam’s sin] there resulted condemnation for all men, even so through one act of righteousness there resulted justification of life to all men. "}],[{"type":"prose","content":"For just as through one man’s disobedience [his failure to hear, his carelessness] the many were made sinners, so through the obedience of the one Man the many will be made righteous  acceptable to God  brought into right standing with Him. "}],[{"type":"prose","content":"But the Law came to increase  expand [the awareness of] the trespass [by defining and unmasking sin]. But where sin increased, [God’s remarkable, gracious gift of] grace [His unmerited favor] has surpassed it  increased all the more, "}],[{"type":"prose","content":"so that, as sin reigned in death, so also grace would reign through righteousness which brings eternal life through Jesus Christ our Lord."}]]