[{"num":5,"verse":"Therefore, having been acquitted and declared not guilty, declared to be YITZDAK IM HASHEM (IYOV 25:4) on the yesod (basis) of our emunah (faith), we have shalom (peace) in relation to Hashem though Rebbe, Melech HaMoshiach Yehoshua Adoneinu,"},{"num":2,"verse":"Through whom also we have HaSha’ar laHashem (gate to appoach G-d’s presence, access of the Tzaddikim TEHILLIM 118:20) by emunah into this unmerited Chen v’Chesed in which we stand and glory in tikvah of the kavod Eloheinu."},{"num":3,"verse":"Not only so, but we also glory in tzoros (troubles, afflictions), knowing that tzarah (trouble) produces zitzfleisch (patience),"},{"num":4,"verse":"Zitzfleisch produces tested character and midos, and tested character and midos produce tikvah."},{"num":5,"verse":"And tikvah does not in the end lead to our being meyayesh (despairing) in disillusionment and bushah (shame) (TEHILLIM 25:3), because the Ahavas Hashem (G-d’s love) has been poured out in our levavot through the Ruach Hakodesh given to us."},{"num":6,"verse":"For while we were still helpless, Moshiach died for the resha’im (the unrighteous persons, the wicked), doing so at the appointed time [DANIEL 9:24-26]!"},{"num":7,"verse":"For only rarely will someone die for a tzaddik (righteous man); though efsher (perhaps) it is shayach (conceivable) that someone will dare to die for the tzaddik."},{"num":8,"verse":"But Hashem demonstrates His ahavah for us in that while we were still chote’im, Moshiach died for us."},{"num":9,"verse":"How much more then, having now been acquitted and pronounced to be YITZDAK IM HASHEM (IYOV 25:4) on the basis of the Moshiach’s DAHM (blood) and sacrificial death (YESHAYAH 53:11-12), how much more then shall we be delivered through him from the eschatological Charon Af Hashem (burning anger of G-d)!"},{"num":10,"verse":"For if when we were [G-d’s] oyevim (enemies) we were reconciled to Hashem through the histalkus (passing), the mavet (death, YESHAYAH 53:12; DANIEL 9:26) of the Ben HaElohim [Moshiach], how much more, having been reconciled and no longer oyevim, shall we be delivered by his [Techiyah (Resurrection)] Chayyim!"},{"num":11,"verse":"Not only so, but we also glory in Hashem though Rebbe, Melech HaMoshiach Yehoshua Adoneinu, through whom we have now received the ritztzuy (reconciliation, cessation of enmity, hostility between a wrathful holy G-d and sinful men)."},{"num":12,"verse":"Therefore, just as through one Adam (one man, humanity, Adam), Chet (Sin) entered into the Olam Hazeh and, through Chet (Sin), entered Mavet (Death); and so Mavet (Death) passed through to kol B’nei Adam (all Mankind, all the sons of Adam), because all sinned."},{"num":13,"verse":"For before (the epoch of) the Torah (Law), Chet (Sin, Chet Kadmon, original sin) was in HaOlam (HaZeh, the world). But Chet (Sin) is not accounted, recorded [to make charges for death penalties] in the absence of Torah [i.e., no Law, no violation, death penalty]."},{"num":14,"verse":"Nevertheless, Mavet (Death) reigned supreme from (the epoch of) Adam until (the epoch of) Moshe Rabbeinu, even over those who did not sin in the very same manner of Adam’s averah (transgression, disobedience, commandment rebelled against and recorded for death penalty)‖that is, Adam who is a tipus (pattern, prophetic type), a demut he’atid (a future figure) of Hu HaBah (\"He who comes,\" Moshiach the Coming One, the Coming Go’el Redeemer) [YESHAYAH 59:20; IYOV 19:25]."},{"num":15,"verse":"But the averah (transgression) was not like the effect of unmerited chesed (grace). For if by the averah of the one, the rabbim (many) died, how much more the unmerited Chen v’Chesed Hashem (grace of G-d) and the matnat hachesed (free gift of grace) of the Adam HaEchad (one Man) Rebbe Melech HaMoshiach Yehoshua have overflowed LARABBIM (to the many, YESHAYAH 53:11)."},{"num":16,"verse":"And the mattanah (free gift) is not like the effect of that one Adam’s averah (BERESHIS 3:6). For the mishpat (judgment) is from one averah (transgression) to the gezar din (verdict) of ashem (guilty), to harsha’ah (condemnation as guilty); but the effect of the unmerited Chen v’Chesed Hashem is from rabbim (many) averot (transgressions) to zikkuy (acquittal), to that of being YITZDAK IM HASHEM (\"justified with G-d\" IYOV 25:4, i.e., acquittal, justification with Hashem of the Many, YESHAYAH 53:11)."},{"num":17,"verse":"For if by the averah (transgression) of the one, Mavet (Death) reigned supreme through the one Adam, how much more those, who receive the abundance of unmerited Chen v’Chesed Hashem (grace) and of the Matnat HaTzedakah (the gift of righteousness), shall reign in life through the one Adam, Rebbe, Melech HaMoshiach Yehoshua."},{"num":18,"verse":"So, then, as through one Averah (transgression) [of Adam] to kol Bnei Adam to harsha’ah (condemnation as guilty), so also through one Mitzvah (righteous or worthy deed) [of Moshiach] to kol Bnei Adam to justification unto Chayei [Olam]."},{"num":19,"verse":"For as through the disobedience of the one Adam, the many were made chote’im (sinners), so also through the mishma’at (obedience) of the one Adam [Moshiach], the many will be made tzaddikim (righteous ones) [YESHAYAH 53:11]."},{"num":20,"verse":"The (epoch of the) Torah came to increase the averah (transgression); but where Chet (Sin, Chet Kadmon) increased, unmerited Chen v’Chesed Hashem overflowed in abundance,"},{"num":21,"verse":"In order that as Chet (Sin) reigned in Mavet (Death), so also Chesed might reign through Tzedek Olamim to Chayyei Olam through Rebbe, Melech HaMoshiach Yehoshua Adoneinu [DANIEL 9:24]."}]