[{"num":7,"verse":"Early in the morning Jerub-Baal (also called Gideon) and all his men set up their camp at the spring of Harod. The Midianites were camped north of them in the valley at the bottom of the hill called Moreh. "},{"num":2,"verse":"Then the Lord said to Gideon, “You have too many men to defeat the Midianites. I don’t want the Israelites to brag that they saved themselves. "},{"num":3,"verse":"So now, announce to the people, ‘Anyone who is afraid may leave Mount Gilead and go back home.’” So twenty-two thousand men returned home, but ten thousand remained."},{"num":4,"verse":"Then the Lord said to Gideon, “There are still too many men. Take the men down to the water, and I will test them for you there. If I say, ‘This man will go with you, he will go. But if I say, ‘That one will not go with you,’ he will not go.”"},{"num":5,"verse":"So Gideon led the men down to the water. There the Lord said to him, “Separate them into those who drink water by lapping it up like a dog and those who bend down to drink.” "},{"num":6,"verse":"There were three hundred men who used their hands to bring water to their mouths, lapping it as a dog does. All the rest got down on their knees to drink."},{"num":7,"verse":"Then the Lord said to Gideon, “Using the three hundred men who lapped the water, I will save you and hand Midian over to you. Let all the others go home.” "},{"num":8,"verse":"So Gideon sent the rest of Israel to their homes. But he kept three hundred men and took the jars and the trumpets of those who left."},{"num":9,"verse":"That night the Lord said to Gideon, “Get up. Go down and attack the camp of the Midianites, because I will give them to you. "},{"num":10,"verse":"But if you are afraid to go down, take your servant Purah with you. "},{"num":11,"verse":"When you come to the camp of Midian, you will hear what they are saying. Then you will not be afraid to attack the camp.”"},{"header":"Gideon Is Encouraged"},{"num":12,"verse":"The Midianites, the Amalekites, and all the peoples from the east were camped in that valley. There were so many of them they seemed like locusts. Their camels could not be counted because they were as many as the grains of sand on the seashore!"},{"num":13,"verse":"When Gideon came to the enemy camp, he heard a man telling his friend about a dream. He was saying, “I dreamed that a loaf of barley bread rolled into the camp of Midian. It hit the tent so hard that the tent turned over and fell flat!”"},{"num":14,"verse":"The man’s friend said, “Your dream is about the sword of Gideon son of Joash, a man of Israel. God will hand Midian and the whole army over to him!”"},{"num":15,"verse":"When Gideon heard about the dream and what it meant, he worshiped God. Then Gideon went back to the camp of Israel and called out to them, “Get up! The Lord has handed the army of Midian over to you!” "},{"num":16,"verse":"Gideon divided the three hundred men into three groups. He gave each man a trumpet and an empty jar with a burning torch inside."},{"num":17,"verse":"Gideon told the men, “Watch me and do what I do. When I get to the edge of the camp, do what I do. "},{"num":18,"verse":"Surround the enemy camp. When I and everyone with me blow our trumpets, you blow your trumpets, too. Then shout, ‘For the Lord and for Gideon!’”"},{"header":"Midian Is Defeated"},{"num":19,"verse":"So Gideon and the one hundred men with him came to the edge of the enemy camp just after they had changed guards. It was during the middle watch of the night. Then Gideon and his men blew their trumpets and smashed their jars. "},{"num":20,"verse":"All three groups of Gideon’s men blew their trumpets and smashed their jars. They held the torches in their left hands and the trumpets in their right hands. Then they shouted, “A sword for the Lord and for Gideon!” "},{"num":21,"verse":"Each of Gideon’s men stayed in his place around the camp, but the Midianites began shouting and running to escape."},{"num":22,"verse":"When Gideon’s three hundred men blew their trumpets, the Lord made all the Midianites fight each other with their swords! The enemy army ran away to the city of Beth Shittah toward Zererah. They ran as far as the border of Abel Meholah, near the city of Tabbath. "},{"num":23,"verse":"Then men of Israel from Naphtali, Asher, and all of Manasseh were called out to chase the Midianites. "},{"num":24,"verse":"Gideon sent messengers through all the mountains of Ephraim, saying, “Come down and attack the Midianites. Take control of the Jordan River as far as Beth Barah before the Midianites can get to it.”"},{"num":25,"verse":"The men of Ephraim captured two princes of Midian named Oreb and Zeeb. They killed Oreb at the rock of Oreb and Zeeb at the winepress of Zeeb, and they continued chasing the Midianites. They brought the heads of Oreb and Zeeb to Gideon, who was east of the Jordan River."}]