[{"header":"Gideon Surprises and Routs the Midianites"},{"num":7,"verse":"Then Jerubbaal (that is, Gideon) and all the troops that were with him rose early and encamped beside the spring of Harod; and the camp of Midian was north of them, below the hill of Moreh, in the valley."},{"num":2,"verse":"The Lord said to Gideon, ‘The troops with you are too many for me to give the Midianites into their hand. Israel would only take the credit away from me, saying, “My own hand has delivered me.” "},{"num":3,"verse":"Now therefore proclaim this in the hearing of the troops, “Whoever is fearful and trembling, let him return home.”’ Thus Gideon sifted them out; twenty-two thousand returned, and ten thousand remained."},{"num":4,"verse":"Then the Lord said to Gideon, ‘The troops are still too many; take them down to the water and I will sift them out for you there. When I say, “This one shall go with you”, he shall go with you; and when I say, “This one shall not go with you”, he shall not go.’ "},{"num":5,"verse":"So he brought the troops down to the water; and the Lord said to Gideon, ‘All those who lap the water with their tongues, as a dog laps, you shall put to one side; all those who kneel down to drink, putting their hands to their mouths, you shall put to the other side.’ "},{"num":6,"verse":"The number of those that lapped was three hundred; but all the rest of the troops knelt down to drink water. "},{"num":7,"verse":"Then the Lord said to Gideon, ‘With the three hundred that lapped I will deliver you, and give the Midianites into your hand. Let all the others go to their homes.’ "},{"num":8,"verse":"So he took the jars of the troops from their hands, and their trumpets; and he sent all the rest of Israel back to their own tents, but retained the three hundred. The camp of Midian was below him in the valley."},{"num":9,"verse":"That same night the Lord said to him, ‘Get up, attack the camp; for I have given it into your hand. "},{"num":10,"verse":"But if you fear to attack, go down to the camp with your servant Purah; "},{"num":11,"verse":"and you shall hear what they say, and afterwards your hands shall be strengthened to attack the camp.’ Then he went down with his servant Purah to the outposts of the armed men that were in the camp. "},{"num":12,"verse":"The Midianites and the Amalekites and all the people of the east lay along the valley as thick as locusts; and their camels were without number, countless as the sand on the seashore. "},{"num":13,"verse":"When Gideon arrived, there was a man telling a dream to his comrade; and he said, ‘I had a dream, and in it a cake of barley bread tumbled into the camp of Midian, and came to the tent, and struck it so that it fell; it turned upside down, and the tent collapsed.’ "},{"num":14,"verse":"And his comrade answered, ‘This is no other than the sword of Gideon son of Joash, a man of Israel; into his hand God has given Midian and all the army.’"},{"num":15,"verse":"When Gideon heard the telling of the dream and its interpretation, he worshipped; and he returned to the camp of Israel, and said, ‘Get up; for the Lord has given the army of Midian into your hand.’ "},{"num":16,"verse":"After he divided the three hundred men into three companies, and put trumpets into the hands of all of them, and empty jars, with torches inside the jars, "},{"num":17,"verse":"he said to them, ‘Look at me, and do the same; when I come to the outskirts of the camp, do as I do. "},{"num":18,"verse":"When I blow the trumpet, I and all who are with me, then you also blow the trumpets around the whole camp, and shout, “For the Lord and for Gideon!”’"},{"num":19,"verse":"So Gideon and the hundred who were with him came to the outskirts of the camp at the beginning of the middle watch, when they had just set the watch; and they blew the trumpets and smashed the jars that were in their hands. "},{"num":20,"verse":"So the three companies blew the trumpets and broke the jars, holding in their left hands the torches, and in their right hands the trumpets to blow; and they cried, ‘A sword for the Lord and for Gideon!’ "},{"num":21,"verse":"Every man stood in his place all around the camp, and all the men in camp ran; they cried out and fled. "},{"num":22,"verse":"When they blew the three hundred trumpets, the Lord set every man’s sword against his fellow and against all the army; and the army fled as far as Beth-shittah towards Zererah, as far as the border of Abel-meholah, by Tabbath. "},{"num":23,"verse":"And the men of Israel were called out from Naphtali and from Asher and from all Manasseh, and they pursued after the Midianites."},{"num":24,"verse":"Then Gideon sent messengers throughout all the hill country of Ephraim, saying, ‘Come down against the Midianites and seize the waters against them, as far as Beth-barah, and also the Jordan.’ So all the men of Ephraim were called out, and they seized the waters as far as Beth-barah, and also the Jordan. "},{"num":25,"verse":"They captured the two captains of Midian, Oreb and Zeeb; they killed Oreb at the rock of Oreb, and Zeeb they killed at the wine press of Zeeb, as they pursued the Midianites. They brought the heads of Oreb and Zeeb to Gideon beyond the Jordan."}]