[{"num":33,"verse":"The Lord said to Moses, Depart, go up from here, you and the people whom you have brought from the land of Egypt, to the land which I swore to Abraham, Isaac, and Jacob, saying, To your descendants I will give it."},{"num":2,"verse":"I will send an Angel before you, and I will drive out the Canaanite, Amorite, Hittite, Perizzite, Hivite, and Jebusite."},{"num":3,"verse":"Go up to a land flowing with milk and honey; but I will not go up among you, for you are a stiff-necked people, lest I destroy you on the way."},{"num":4,"verse":"When the people heard these evil tidings, they mourned and no man put on his ornaments."},{"num":5,"verse":"For the Lord had said to Moses, Say to the Israelites, You are a stiff-necked people! If I should come among you for one moment, I would consume and destroy you. Now therefore [penitently] leave off your ornaments, that I may know what to do with you."},{"num":6,"verse":"And the Israelites left off all their ornaments, from Mount Horeb onward."},{"num":7,"verse":"Now Moses used to take [his own] tent and pitch it outside the camp, far off from the camp, and he called it the tent of meeting [of God with His own people]. And everyone who sought the Lord went out to [that temporary] tent of meeting which was outside the camp."},{"num":8,"verse":"When Moses went out to the tent of meeting, all the people rose and stood, every man at his tent door, and looked after Moses until he had gone into the tent."},{"num":9,"verse":"When Moses entered the tent, the pillar of cloud would descend and stand at the door of the tent, and the Lord would talk with Moses."},{"num":10,"verse":"And all the people saw the pillar of cloud stand at the tent door, and all the people rose up and worshiped, every man at his tent door."},{"num":11,"verse":"And the Lord spoke to Moses face to face, as a man speaks to his friend. Moses returned to the camp, but his minister Joshua son of Nun, a young man, did not depart from the [temporary prayer] tent."},{"num":12,"verse":"Moses said to the Lord, See, You say to me, Bring up this people, but You have not let me know whom You will send with me. Yet You said, I know you by name and you have also found favor in My sight."},{"num":13,"verse":"Now therefore, I pray You, if I have found favor in Your sight, show me now Your way, that I may know You [progressively become more deeply and intimately acquainted with You, perceiving and recognizing and understanding more strongly and clearly] and that I may find favor in Your sight. And [Lord, do] consider that this nation is Your people."},{"num":14,"verse":"And the Lord said, My Presence shall go with you, and I will give you rest."},{"num":15,"verse":"And Moses said to the Lord, If Your Presence does not go with me, do not carry us up from here!"},{"num":16,"verse":"For by what shall it be known that I and Your people have found favor in Your sight? Is it not in Your going with us so that we are distinguished, I and Your people, from all the other people upon the face of the earth?"},{"num":17,"verse":"And the Lord said to Moses, I will do this thing also that you have asked, for you have found favor, loving-kindness, and mercy in My sight and I know you personally and by name."},{"num":18,"verse":"And Moses said, I beseech You, show me Your glory."},{"num":19,"verse":"And God said, I will make all My goodness pass before you, and I will proclaim My name, The Lord, before you; for I will be gracious to whom I will be gracious, and will show mercy and loving-kindness on whom I will show mercy and loving-kindness."},{"num":20,"verse":"But, He said, You can not see My face, for no man shall see Me and live."},{"num":21,"verse":"And the Lord said, Behold, there is a place beside Me, and you shall stand upon the rock,"},{"num":22,"verse":"And while My glory passes by, I will put you in a cleft of the rock and cover you with My hand until I have passed by."},{"num":23,"verse":"Then I will take away My hand and you shall see My back; but My face shall not be seen."}]