[{"num":2,"verse":"When David’s time to die was near, he charged Solomon his son, saying,"},{"num":2,"verse":"I go the way of all the earth. Be strong and show yourself a man;"},{"num":3,"verse":"Keep the charge of the Lord your God, walk in His ways, keep His statutes, His commandments, His precepts, and His testimonies, as it is written in the Law of Moses, that you may do wisely and prosper in all that you do and wherever you turn,"},{"num":4,"verse":"That the Lord may fulfill His promise to me, saying, If your sons take heed to their way, to walk before Me in truth with all their heart and mind and with all their soul, there shall not fail you [to have] a man on the throne of Israel."},{"num":5,"verse":"You know also what Joab son of Zeruiah did to me, and what he did to the two captains of the hosts of Israel, Abner son of Ner and Amasa son of Jether, whom he murdered, avenging in time of peace blood shed in war, and putting innocent blood of war on the girdle on his loins and on the sandals of his feet."},{"num":6,"verse":"Do therefore according to your wisdom, but let not his hoary head go down to Sheol (the place of the dead) in peace."},{"num":7,"verse":"But show kindness to the sons of Barzillai the Gileadite and let them be among those who eat at your table; for with such kindness they met me when I fled because of Absalom your brother."},{"num":8,"verse":"And you have with you Shimei son of Gera, the Benjamite of Bahurim, who cursed me with a grievous curse in the day when I went to Mahanaim. But he came down to meet me at the Jordan [on my return], and I swore to him by the Lord, saying, I will not put you to death with the sword."},{"num":9,"verse":"So do not hold him guiltless; for you are a wise man and know what you should do to him. His hoary head bring down to the grave with blood."},{"num":10,"verse":"So David slept with his fathers and was buried in the City of David."},{"num":11,"verse":"David reigned over Israel forty years—seven years in Hebron and thirty-three years in Jerusalem."},{"num":12,"verse":"Then Solomon sat on the throne of David his father, and his kingdom was firmly established."},{"num":13,"verse":"Adonijah, the son of [David and] Haggith, came to Bathsheba, the mother of Solomon. She said, Do you come peaceably? And he said, Peaceably."},{"num":14,"verse":"He said, I have something to say to you. And she said, Say on."},{"num":15,"verse":"He said, You know that the kingdom belonged to me [as the eldest living son], and all Israel looked to me to reign. However, the kingdom has passed from me to my brother; for it was his from the Lord."},{"num":16,"verse":"Now I make one request of you; do not deny me. And she said, Say on."},{"num":17,"verse":"He said, I pray you, ask King Solomon, for he will not refuse you, to give me Abishag the Shunammite to be my wife."},{"num":18,"verse":"And Bathsheba said, Very well; I will speak for you to the king."},{"num":19,"verse":"So Bathsheba went to King Solomon to speak to him for Adonijah. The king rose to meet her, bowed to her, sat down on his throne, and caused a seat to be set at his right hand for her, the king’s mother."},{"num":20,"verse":"Then she said, I have one small request to make of you; do not refuse me. The king said to her, Ask on, my mother, for I will not refuse you."},{"num":21,"verse":"She said, Give Abishag the Shunammite to Adonijah your brother to be his wife."},{"num":22,"verse":"King Solomon answered his mother, And why do you ask Abishag the Shunammite for Adonijah? Ask for him the kingdom also—for he is my elder brother—[ask it] even for him and for [his supporters] Abiathar the priest and Joab son of Zeruiah."},{"num":23,"verse":"Then King Solomon swore by the Lord, saying, May God do so to me, and more also, if Adonijah has not requested this against his own life."},{"num":24,"verse":"Therefore, as the Lord lives, Who has established me and set me on the throne of David my father and Who has made me a house as He promised, Adonijah shall be put to death this day."},{"num":25,"verse":"So King Solomon sent Benaiah son of Jehoiada, who attacked [Adonijah] and he died."},{"num":26,"verse":"And to Abiathar the priest the king said, Get to Anathoth to your own estate; for you deserve death, but I will not put you to death now, because you bore the ark of the Lord God before my father David and were afflicted in all my father endured."},{"num":27,"verse":"So Solomon expelled Abiathar [descendant of Eli] from being priest to the Lord, fulfilling the word of the Lord which He spoke concerning the house of Eli in Shiloh."},{"num":28,"verse":"When the news came to Joab, for Joab had followed Adonijah though he had not followed Absalom, [he] fled to the tent (tabernacle) of the Lord and caught hold of the horns of the altar [before it]."},{"num":29,"verse":"King Solomon was told that Joab had fled to the tent of the Lord and was at the altar. Then Solomon sent Benaiah son of Jehoiada, saying, Go, strike him down."},{"num":30,"verse":"So Benaiah came to the tent of the Lord and told Joab, The king commands, Come forth. But Joab said, No, I will die here. Then Benaiah brought the king word again, Thus said Joab, and thus he answered me."},{"num":31,"verse":"The king said to him, Do as he has said. Strike him down and bury him, that you may take away from [me and from] my father’s house the innocent blood which Joab shed."},{"num":32,"verse":"The Lord shall return his bloody deeds upon his own head, for he fell upon two men more [uncompromisingly] righteous and honorable than he and slew them with the sword, without my father knowing of it: Abner son of Ner, captain of the host of Israel, and Amasa son of Jether, captain of the host of Judah."},{"num":33,"verse":"So shall their blood return upon the head of Joab and of his descendants forever. But upon David, his descendants, his house, and his throne, there shall be peace from the Lord forever."},{"num":34,"verse":"So Benaiah son of Jehoiada went up and struck and killed Joab, and he was buried at his own house in the wilderness."},{"num":35,"verse":"The king put Benaiah son of Jehoiada in Joab’s place over the army and put Zadok the priest in place of Abiathar."},{"num":36,"verse":"The king sent for Shimei and said to him, Build yourself a house in Jerusalem and dwell there, and do not leave there."},{"num":37,"verse":"For on the day you go out and pass over the brook Kidron, know with certainty that you shall die; your blood shall be upon your own head."},{"num":38,"verse":"And Shimei said to the king, The saying is good. As my lord the king has said, so your servant will do. And Shimei dwelt in Jerusalem many days."},{"num":39,"verse":"But after three years, two of Shimei’s servants ran away to Achish son of Maacah, king of Gath. And Shimei was told, Behold, your [runaway] servants are in Gath."},{"num":40,"verse":"So Shimei arose, saddled his donkey, and went to Gath to King Achish to seek his servants, and brought them from Gath."},{"num":41,"verse":"It was told Solomon that Shimei went from Jerusalem to Gath and had returned."},{"num":42,"verse":"And the king sent for Shimei and said to him, Did I not make you swear by the Lord and warn you, saying, Know with certainty, on the day you go out and walk abroad anywhere, you shall surely die? And you said to me, I have heard your word. It is accepted."},{"num":43,"verse":"Why then have you not kept the oath of the Lord and the command with which I have charged you?"},{"num":44,"verse":"The king also said to Shimei, You are aware in your own heart of all the evil you did to my father David; so the Lord will return your evil upon your own head."},{"num":45,"verse":"But King Solomon shall be blessed, and the throne of David shall be established before the Lord forever."},{"num":46,"verse":"So the king commanded Benaiah son of Jehoiada, who went out and struck down Shimei, and he died. And the kingdom was established in the hands of Solomon."}]