[{"header":"King David Dies"},{"num":2,"verse":"The time came for David to die, so he gave these commands to Solomon,"},{"num":2,"verse":"“I am about to die, like all men must. But you are growing stronger and becoming a man."},{"num":3,"verse":"Now, carefully obey all the commands of the Lord your God. Carefully obey all his laws, commands, decisions, and agreements. Obey everything that is written in the Law of Moses. If you do this, you will be successful at whatever you do and wherever you go."},{"num":4,"verse":"And if you obey the Lord, he will keep his promise about me. He said, ‘If your sons carefully live the way I tell them, sincerely, with all their heart, the king of Israel will always be a man from your family.’”"},{"num":5,"verse":"David also said, “You remember what Joab son of Zeruiah did to me. He killed two of the commanders of Israel’s army, Abner son of Ner and Amasa son of Jether. Remember, it was during a time of peace when he spilled the blood that splattered onto his sword belt and army boots. I should have punished him then."},{"num":6,"verse":"Use your wisdom, but don’t let him die peacefully of old age."},{"num":7,"verse":"“Also, be kind to the children of Barzillai from Gilead. Be friends with them, and let them eat at your table, because they helped me when I ran away from your brother Absalom."},{"num":8,"verse":"“And remember, Shimei son of Gera is still around. He is the Benjamite from Bahurim who cursed me when I ran away to Mahanaim. But when he came down to meet me at the Jordan River, I made a promise to him before the Lord that I would not kill him."},{"num":9,"verse":"Now, don’t leave him unpunished. You are a wise man. You will know what you must do, but don’t let him die peacefully of old age.”"},{"num":10,"verse":"Then David died and was buried in the City of David."},{"num":11,"verse":"David ruled Israel 40 years. He ruled seven years in Hebron and 33 years in Jerusalem."},{"header":"Solomon and Adonijah"},{"num":12,"verse":"Now Solomon was king. He sat on the throne of his father David and was in complete control of his kingdom."},{"num":13,"verse":"One day Adonijah, the son of Haggith, went to Solomon’s mother, Bathsheba. She asked him, “Do you come in peace?”"},{"num":14,"verse":"I have something to ask you.”"},{"num":15,"verse":"Adonijah said, “You know that at one time the kingdom was mine. All the people of Israel wanted me to be their king. But things have changed, and now my brother is the king. The Lord chose him to be king."},{"num":16,"verse":"But now I have one thing to ask you. Please don’t refuse me.”"},{"num":17,"verse":"Adonijah said, “I know that King Solomon will do whatever you ask. So please ask him to let me marry Abishag, the woman from Shunem.”"},{"num":18,"verse":"Then Bathsheba said, “Very well, I will speak to the king for you.”"},{"num":19,"verse":"So Bathsheba went to King Solomon to talk with him. When the king saw her, he stood up, bowed before her, and then sat back down. He told some servants to bring another throne for his mother, and she sat down at his right side."},{"num":20,"verse":"Bathsheba said to him, “I have one small thing to ask you. Please don’t refuse me.”"},{"num":21,"verse":"So Bathsheba said, “Let your brother Adonijah marry Abishag, the woman from Shunem.”"},{"num":22,"verse":"King Solomon answered his mother, “Why are you asking me to give Abishag to Adonijah? Why don’t you just ask me to give him the whole kingdom! After all, he is my older brother, and both Abiathar the priest and Joab support him!”"},{"num":23,"verse":"Then Solomon said, “By the Lord, I swear I’ll make Adonijah pay for this with his life!"},{"num":24,"verse":"The Lord made me the king of Israel. He gave me the throne of my father David. The Lord kept his promise and gave the kingdom to me and my family. Now, as surely as the Lord lives, I swear Adonijah will die today!”"},{"num":25,"verse":"King Solomon gave the command to Benaiah, and Benaiah went out and killed Adonijah."},{"num":26,"verse":"Then King Solomon said to Abiathar the priest, “I should kill you, but I will let you go back to your home in Anathoth. I will not kill you now because you helped carry the Holy Box of the Lord God while marching with my father David. And I know that you shared in the hard times with my father.”"},{"num":27,"verse":"So Solomon told Abiathar that he could not continue to serve as a priest of the Lord. This happened as the Lord said it would when he told Eli the priest what would happen to him and his family."},{"num":28,"verse":"Joab had supported Adonijah, but not Absalom. But when Joab heard what happened to Abiathar, he was frightened and ran to the tent of the Lord to hold onto the horns of the altar."},{"num":29,"verse":"Someone told King Solomon that Joab was at the altar in the Lord’s Tent. So Solomon ordered Benaiah to go and kill him."},{"num":30,"verse":"Benaiah went into the Lord’s Tent and said to Joab, “The king says, ‘Come out!’”"},{"num":31,"verse":"The king commanded Benaiah, “Do as he says! Kill him there and take him out to bury him. Then my family and I will be free of Joab’s guilt from killing innocent people."},{"num":32,"verse":"Joab killed two men who were much better than he was. He killed Abner son of Ner, the commander of the army of Israel, and Amasa son of Jether, the commander of the army of Judah. He did this without my father’s knowledge. But now the Lord will punish Joab for the men he killed."},{"num":33,"verse":"He and his family will always be guilty for their deaths. But the Lord will bring peace to David, his descendants, his family of kings, and his kingdom forever.”"},{"num":34,"verse":"So Benaiah son of Jehoiada killed Joab, and he was buried near his home in the desert."},{"num":35,"verse":"Solomon then made Benaiah son of Jehoiada the commander of the army in Joab’s place. Solomon also made Zadok the new high priest in Abiathar’s place."},{"num":36,"verse":"Next, the king sent for Shimei and said to him, “Build yourself a house here in Jerusalem to live in and don’t leave the city."},{"num":37,"verse":"If you leave the city and go any further than Kidron Brook, you will be killed, and it will be your own fault.”"},{"num":38,"verse":"Shimei answered, “Yes, my king. I will obey you.” So Shimei lived in Jerusalem for a long time."},{"num":39,"verse":"But three years later, two of Shimei’s slaves ran away. They went to King Achish of Gath, who was the son of Maacah. Shimei heard that his slaves were in Gath,"},{"num":40,"verse":"so he saddled his donkey and went to King Achish at Gath to find them. He found them there and brought them back home."},{"num":41,"verse":"But someone told Solomon that Shimei had left Jerusalem and gone to Gath and back."},{"num":42,"verse":"So Solomon sent for him and said, “I made you promise in the Lord’s name not to leave Jerusalem. And I warned you that if you went anywhere, you would die. And you agreed to what I said. You said that you would obey me."},{"num":43,"verse":"So why didn’t you obey me? Why did you break your promise to the Lord?"},{"num":44,"verse":"You know all the bad things you did to my father David. Now the Lord will punish you for it."},{"num":45,"verse":"But the Lord will bless me and keep David’s throne before him forever.”"},{"num":46,"verse":"Then the king ordered Benaiah to kill Shimei, and he did. So Solomon had full control of his kingdom."}]