[{"num":2,"verse":"David was close to dying, so he gave direction to his son, Solomon."},{"num":10,"verse":"After he spoke these words to his son, Solomon, David left this world to sleep with his fathers. His body was laid to rest in the city of David. "},{"num":11,"verse":"David ruled Israel 40 years. He ruled in Hebron 7 years and in Jerusalem 33 years. "},{"num":12,"verse":"Solomon inherited David’s throne, and his kingdom was strong and healthy."},{"num":13,"verse":"Adonijah (Haggith’s son) approached Bathsheba (Solomon’s mother)."},{"num":19,"verse":"Bathsheba approached King Solomon about Adonijah’s request. When she entered the king’s presence, he stood up and bowed to her, then sat on his throne. He arranged for a throne to be brought for his mother, so she sat to the right of him in a place of honor and authority."},{"num":25,"verse":"King Solomon dispatched Benaiah (Jehoiada’s son), who met up with Adonijah and executed him."},{"num":27,"verse":"Solomon stripped Abiathar of his priesthood to the Eternal One. He did this so that the Eternal’s word in Shiloh would be honored: the house of Eli would not be able to atone for their wickedness through sacrifices and offerings."},{"num":28,"verse":"News of all this arrived to Joab, who had been a follower of Adonijah but not of Absalom. Joab rushed to the altar in the tent of the Eternal and gripped the horns, hoping for sanctuary as Adonijah had. "},{"num":29,"verse":"King Solomon received word that Joab had rushed to the tent of the Eternal and that he was at the altar that very moment. Solomon again dispatched Benaiah (Jehoiada’s son) with the instructions, “Execute Joab.”"},{"num":30,"verse":"Benaiah arrived at the tent of the Eternal, but he could not enter to kill Joab."},{"num":34,"verse":"Benaiah (Jehoiada’s son) killed Joab and buried him on his own land in the wilderness."},{"num":35,"verse":"King Solomon then designated Benaiah (Jehoiada’s son) to lead the army in Joab’s stead, and the king designated Zadok the priest to take on Abiathar’s responsibilities."},{"num":36,"verse":"The king summoned Shimei, intending to fulfill his promise to David and subdue this political enemy."},{"num":39,"verse":"After three years, two of Shimei’s servants fled west to their home in Philistia to find Achish (son of Maacah, Gath’s king). They sent word to Shimei: “We, your servants, are in Gath.” "},{"num":40,"verse":"Shimei prepared his donkey and traveled to Gath to find Achish with hopes of finding his servants. Shimei found his servants and took them away from Gath."},{"num":41,"verse":"Solomon received word that Shimei had traveled from Jerusalem to Gath and was back in Jerusalem. "},{"num":42,"verse":"King Solomon had Shimei brought to him and questioned him."},{"num":46,"verse":"King Solomon instructed Benaiah (Jehoiada’s son) to execute Shimei, and Benaiah did what Solomon asked him to do."}]