[{"num":2,"verse":"Forsooth the days of David nighed, that he should die; and he commanded to Solomon, his son, and said,"},{"num":2,"verse":"Lo! I enter into the way of all (the) earth; be thou strengthened (take thou courage), and be thou a strong man."},{"num":3,"verse":"And keep thou the keepings and the behests of thy Lord God, that thou go in his ways, and keep his ceremonies, and his behests, and his dooms, and (his) witnessings, as it is written in the law of Moses; that thou understand all things which thou doest, and whither ever thou shalt turn thee. (And obey thou the orders and the commands of the Lord thy God, so that thou go in his ways, and keep his statutes, and his commands, and his laws, or his judgements, and his testimonies, as it is written in the Law of Moses; so that thou understand all the things that thou doest, and wherever thou shalt turn thyself.)"},{"num":4,"verse":"That the Lord confirm his words, which the Lord spake of me, and said, If thy sons keep my ways, and go before me in truth, in all their heart, and in all their soul, a man shall not be taken away of thee from the throne of Israel. (So that the Lord shall establish his words, which the Lord spoke about me, saying, If thy sons follow my ways, and go before me in truth, with all their heart, and with all their soul, a man of thee shall not be taken away from the throne of Israel.)"},{"num":5,"verse":"Also thou knowest what things Joab, the son of Zeruiah, did to me; (and) what things he did to [the] two princes of the host of Israel, to Abner, the son of Ner, and to Amasa, the son of Jether, which he killed, and shedded the blood of battle in peace; and putted the blood of battle in his girdle, that was about his loins, and in his shoe(s), that was in his feet (and put the blood of battle upon his girdle, that was about his loins, and in his shoes, that were upon his feet)."},{"num":6,"verse":"Therefore thou shalt do by thy wisdom, and thou shalt not lead forth his hoariness peaceably to hells, either (the) sepulchre. (And so do thou by thy wisdom, and do not let his hoar hairs go down peacefully to Sheol, or into the grave, or into the tomb.)"},{"num":7,"verse":"But also thou shalt yield grace to the sons of Barzillai of Gilead, and they shall be eating in thy board (and they shall eat at thy table); for they met me, when I fled from the face of Absalom, thy brother."},{"num":8,"verse":"Also thou hast with thee Shimei, the son of Gera, the son of Benjamin, of Bahurim, the which Shimei cursed me by the worst cursing, when I went to the defensible places; but for-thy he came down to me into my meeting, when I passed (the) Jordan, and I swore to him by the Lord, and said, I shall not slay thee with sword, (Also thou hast with thee Shimei, the son of Gera, the son of Benjamin, of Bahurim, the which Shimei cursed me by the worst cursing, when I went to Mahanaim; but he came down to meet me when I crossed over the Jordan River, and I swore to him by the Lord, and said, I shall not kill thee with the sword,)"},{"num":9,"verse":"do not thou suffer him to be unpunished; forsooth thou art a wise man, and thou shalt know what thou shalt do to him, and thou shalt lead forth his hoar hairs with blood to hells. (but now do not thou allow him to go unpunished; thou art a wise man, and thou knowest what thou shalt do to him, and that is, thou shalt lead forth his hoar hairs in blood down to Sheol, or into the grave!)"},{"num":10,"verse":"And (then) David slept with his fathers, and was buried in the city of David."},{"num":11,"verse":"And the days, in which David reigned upon Israel, be forty years; in Hebron he reigned seven years, and in Jerusalem three and thirty years."},{"num":12,"verse":"Forsooth Solomon sat upon the throne of David, his father, and his realm was made steadfast greatly (and his reign was firmly established)."},{"num":13,"verse":"And Adonijah, the son of Haggith, entered to Bathsheba, the mother of Solomon; and she said to him, Whether thine entering is peaceable? And he answered, It is peaceable (and she said to him, Cometh thou here in peace? And he answered, I have come in peace)."},{"num":14,"verse":"And he added, A word of me is to thee (And he added, I have a word to say to thee). And she said, Speak thou."},{"num":15,"verse":"And he said, Thou knowest that the realm was mine, and all Israel purposed to make me into king to them; but the realm is translated, and is made my brother’s; for of the Lord it is ordained to him. (And he said, Thou knowest that the kingdom was mine, and all Israel purposed to make me king over them; but the kingdom was taken away from me, and made my brother’s; for the Lord ordained it to him.)"},{"num":16,"verse":"Now therefore I pray of thee one asking; shame thou not my face. And she said to him, Speak thou."},{"num":17,"verse":"And he said, I pray, that thou say to Solomon the king; for he may not deny anything to thee; that he give me Abishag of Shunem to wife (that he give me Abishag of Shunem for a wife)."},{"num":18,"verse":"And Bathsheba said, Well, I shall speak for thee to the king."},{"num":19,"verse":"Therefore Bathsheba came to king Solomon, to speak to him for Adonijah; and the king rose against the coming of her, and worshipped her, and sat on his throne; and a throne was set to the mother of the king, and she sat at his right side. (And so Bathsheba went to King Solomon, to speak to him for Adonijah; and the king rose up to greet her, and honoured her, and then sat down on his throne; and a throne was put in place for the king’s mother, and she sat at his right side.)"},{"num":20,"verse":"And she said to him, I pray of thee one little asking; shame thou not my face. And the king said to her, My mother, ask thou; for it is not leaveful that I turn away thy face (for it would not be right for me to refuse thee)."},{"num":21,"verse":"And she said, (Let) Abishag of Shunem be given (for a) wife to Adonijah, thy brother."},{"num":22,"verse":"And king Solomon answered, and said to his mother, Why askest thou (only for) Abishag of Shunem to Adonijah? Ask thou to him also the realm (Why askest thou only for Abishag of Shunem for Adonijah? Why not ask thou also for the kingdom for him?); certainly he is mine elder brother, and he hath Abiathar, (the) priest, and Joab, the son of Zeruiah."},{"num":23,"verse":"Therefore king Solomon swore by the Lord, and said, God do to me these things, and add these things too, for Adonijah hath spoken this word against his (own) life."},{"num":24,"verse":"And now the Lord liveth, that hath confirmed me, and hath set me on the throne of [David,] my father, and that hath made to me an house, as he spake, for Adonijah shall be slain today. (And now as the Lord liveth, who hath firmly established me, and hath put me on the throne of my father David, and who hath made a house for me, as he promised, let Adonijah be killed today!)"},{"num":25,"verse":"And king Solomon sent by the hand of Benaiah, the son of Jehoiada; and Benaiah slew Adonijah, and he was dead (and so he died)."},{"num":26,"verse":"Also the king said to Abiathar, the priest, Go thou into Anathoth, to thy field; and soothly thou art a man of death, that is, worthy of death, for conspiring against me, and David, my father; but today I shall not slay thee, for thou barest the ark of the Lord God before David, my father, and thou sufferedest travail in all things, in which my father travailed."},{"num":27,"verse":"Therefore Solomon putted out Abiathar, that he should not be priest of the Lord (And so Solomon put out Abiathar, so that he would no longer be the Lord’s priest), (so) that the word of the Lord were [ful]filled, which he spake on the house of Eli in Shiloh."},{"num":28,"verse":"And a messenger came to Solomon, and said that Joab had bowed after Adonijah, and that he had not bowed after Solomon. Therefore Joab fled into the tabernacle of the Lord, and took the horn of the altar. (And a message concerning all of this came to Joab; for he had sided with Adonijah, but not with Absalom. And so Joab fled into the Tabernacle, or the Tent, of the Lord, and took hold of the horns of the altar.)"},{"num":29,"verse":"And it was told to king Solomon, that Joab had fled into the tabernacle of the Lord, and was beside the altar; and Solomon sent Benaiah, the son of Jehoiada, and said, Go thou, and slay him."},{"num":30,"verse":"And Benaiah came to the tabernacle of the Lord, and said to Joab, The king saith these things, Go thou out. And he said, I shall not go out, but I shall die here. Benaiah told the word to the king (Benaiah told this to the king), and said, Joab spake these things, and answered these things to me."},{"num":31,"verse":"And the king said to Benaiah, Do thou as he hath spoken, and slay thou him, and (then) bury him; and thou shalt remove the innocent blood, that was shed out of Joab, from me, and from the house of my father (and so thou shalt remove the innocent blood that was shed by Joab, from me, and from my father’s house)."},{"num":32,"verse":"And the Lord yield on(to) his (own) head his (own) blood, for he killed two just men, and better than himself, and he killed them by (the) sword, while David, my father, knew not, Abner the son of Ner, the prince of the chivalry of Israel, and Amasa, the son of Jether, the prince of the host of Judah (that is, Abner the son of Ner, the leader of Israel’s cavalry, or army, and Amasa, the son of Jether, the leader of Judah’s army)."},{"num":33,"verse":"And the blood of them shall turn again into the head of Joab, and into the head of his seed without end; but peace be of the Lord till into without end to David, and to his seed, and to the house, and [the] throne of him. (And their blood shall return onto Joab’s head, and onto the head of his descendants forevermore; but let peace, or prosperity, be from the Lord forevermore for David, and for his descendants, and for his house, and his throne.)"},{"num":34,"verse":"Therefore Benaiah, the son of Jehoiada, went up, and assailed Joab, and killed him; and Joab was buried in his house in (the) desert."},{"num":35,"verse":"And the king ordained Benaiah, the son of Jehoiada, upon the host for Joab; and the king put Zadok the priest (in place) for Abiathar. (And the king ordained Benaiah, the son of Jehoiada, over the army in place of Joab; and he made Zadok the priest in place of Abiathar.)"},{"num":36,"verse":"Also the king sent, and called (for) Shimei, and said to him, Build to thee an house in Jerusalem, and dwell thou there (Build a house for thyself in Jerusalem, and live thou in it), and thou shalt not go out from thence hither and thither;"},{"num":37,"verse":"for in whatever day thou goest out, and passest [over] the strand of Kidron, know thou thee worthy to be slain; thy blood shall be on thine head. (for in whatever day thou goest out, and passest over the Kidron Stream/and passest over the Kidron Gorge, know thou that thou shalt be killed; thy blood shall be upon thy own head.)"},{"num":38,"verse":"And Shimei said to the king, The word of the king is good; as my lord the king spake, so thy servant shall do. And so Shimei dwelled in Jerusalem many days."},{"num":39,"verse":"But it was done after three years, that the servants of Shimei fled to Achish, the son of Maachah, king of Gath; and it was told to Shimei, that his servants had gone into Gath."},{"num":40,"verse":"And Shimei rose up, and saddled his ass (and saddled up his donkey), and went to Achish, into Gath, to seek his servants; and he brought them (back) again from Gath."},{"num":41,"verse":"And it was told to king Solomon, that Shimei had gone to Gath from Jerusalem, and had come (back) again."},{"num":42,"verse":"And Solomon sent, and called him, and said to him, Whether I witnessed not to thee by the Lord, and before-said to thee, In whatever day thou shalt go out hither and thither, know thou that thou shalt die; and thou answeredest to me, The word is good, which I heard? (And Solomon sent, and called for him, and said to him, Did I not make thee swear by the Lord? and did I not say to thee, On whatever day that thou shalt go out here and there, know thou that thou shalt die? and didest thou not answer to me, The word, which I heard, is good?)"},{"num":43,"verse":"Why therefore keptest thou not the oath of the Lord, and the commandment which I commanded to thee?"},{"num":44,"verse":"And the king said to Shimei, Thou knowest all the evil, of which thine heart is guilty to thee, which evil thou didest to [David] my father; the Lord hath yielded thy malice into thine head. (And the king said to Shimei, Thou knowest all the evil which thy heart is guilty of, which evil thou didest to my father David; and now the Lord shall yield thy malice onto thy own head.)"},{"num":45,"verse":"And king Solomon shall be blessed; and the throne of David shall be stable before the Lord till into without end."},{"num":46,"verse":"Therefore the king commanded to Benaiah, the son of Jehoiada; and he assailed Shimei, and smote him, and he was dead. Therefore the realm was confirmed into the hands of Solomon; (And so the king commanded to Benaiah, the son of Jehoiada; and he assailed Shimei, and struck him down there, and he died. And so the kingdom was firmly established in Solomon’s hands;)"}]