[[],[{"type":"header","content":"Mourning the Lost Tribe"},{"type":"prose","content":"Now the men of Israel had sworn [an oath] at Mizpah, “None of us shall give his daughter in marriage to [a man of] Benjamin.” "}],[{"type":"prose","content":"So the people came to Bethel and sat there before God until evening, and lifted up their voices and wept bitterly. "}],[{"type":"prose","content":"They said, “O LORD, God of Israel, why has this come about in Israel, that there should be today one tribe missing from Israel?” "}],[{"type":"prose","content":"And the next day the people got up early and built an altar there and offered burnt offerings and peace offerings."}],[{"type":"prose","content":"Then the sons of Israel said, “Which one from all the tribes of Israel did not come up in the assembly to the LORD?” For they had taken a great oath concerning him who did not come up to the LORD at Mizpah, saying, “He shall certainly be put to death.” "}],[{"type":"prose","content":"And the sons of Israel felt sorry [and had compassion] for their brother Benjamin and said, “One tribe has been cut off from Israel today. "}],[{"type":"prose","content":"What shall we do for wives for those who are left, since we have sworn [an oath] by the LORD that we will not give them any of our daughters as wives?”"}],[{"type":"header","content":"Provision for Their Survival"},{"type":"prose","content":"And they said, “Which one is there of the tribes from Israel that did not come up to Mizpah to the LORD?” And behold, [it was discovered that] no one had come to the camp from Jabesh-gilead, to the assembly. "}],[{"type":"prose","content":"For when the people were assembled, behold, there was not one of the inhabitants of Jabesh-gilead there. "}],[{"type":"prose","content":"And the congregation sent twelve thousand of the most courageous men there, and commanded them saying, “Go and strike the inhabitants of Jabesh-gilead with the sword, including the women and the children. "}],[{"type":"prose","content":"And this is the thing that you shall do; you shall utterly destroy every male and every woman who is not a virgin.” "}],[{"type":"prose","content":"And they found among the inhabitants of Jabesh-gilead four hundred young virgins who had not known a man intimately; and they brought them to the camp at Shiloh, which is in the land of Canaan."}],[{"type":"prose","content":"Then the whole congregation sent  to the [surviving] sons of Benjamin who were at the rock of Rimmon, and proclaimed peace to them. "}],[{"type":"prose","content":"So [the survivors of] Benjamin returned at that time, and they gave them the women whom they had kept alive from the women of Jabesh-gilead; but there were not enough [to provide wives] for them. "}],[{"type":"prose","content":"And the people were sorry [and had compassion] for [the survivors of the tribe of] Benjamin because the LORD had made a gap in the tribes of Israel."}],[{"type":"prose","content":"Then the elders of the congregation said, “What shall we do for wives for those [men] who are left, since the women of Benjamin have been destroyed?” "}],[{"type":"prose","content":"They said, “ an inheritance for the survivors of Benjamin, so that a tribe will not be wiped out from Israel. "}],[{"type":"prose","content":"But we cannot give them wives from our daughters.” For the sons of Israel had sworn [an oath], “Cursed is he who gives a wife to [a man from the tribe of] Benjamin.”"}],[{"type":"prose","content":"So they said, “Listen, there is the yearly feast of the LORD at Shiloh, which is on the north side of Bethel, on the east side of the highway that goes up from Bethel to Shechem, and on the south side of Lebonah.” "}],[{"type":"prose","content":"So they instructed the sons of Benjamin, saying, “Go, set an ambush in the vineyards, "}],[{"type":"prose","content":"and watch; if the daughters of Shiloh come out to dance in the dances, then you shall come out of the vineyards and each of you shall catch his wife from the daughters of Shiloh, and go to the land of [the tribe of] Benjamin. "}],[{"type":"prose","content":"When their fathers or their brothers come to complain to us, we shall say to them, ‘Give them to us voluntarily, because we did not take a wife for each man  in battle, nor did you give  to them, for that would have made you guilty [of breaking your oath].’” "}],[{"type":"prose","content":"So the sons of [the tribe of] Benjamin did as instructed and took wives according to their number, from the dancers whom they carried away. Then they went and returned to their inheritance, and rebuilt the towns and lived in them. "}],[{"type":"prose","content":"The sons of Israel departed from there at that time, each man to his tribe and family, and each man went from there to his inheritance."}],[{"type":"prose","content":"In those days [when the judges governed] there was no king in Israel; every man did what was right in his own eyes."}]]