[{"header":"Wives for the Men of Benjamin"},{"num":21,"verse":"At Mizpah the men of Israel had made a promise. This was their promise: “Not one of us will let his daughter marry a man from the tribe of Benjamin.”"},{"num":2,"verse":"The people went to the city of Bethel. There they sat before God until evening, crying loudly. "},{"num":3,"verse":"They said, “Lord, you are the God of Israel. Why has this terrible thing happened to us? Why has one tribe of Israel been taken away?”"},{"num":4,"verse":"Early the next day the people built an altar. They put burnt offerings and fellowship offerings to God on it."},{"num":5,"verse":"Then the Israelites asked, “Did any tribe of Israel not come here to meet with us before the Lord?” They asked this question because they had made a great promise. They had promised that anyone who did not meet with them at Mizpah would be killed."},{"num":6,"verse":"The Israelites felt sorry for their relatives, the Benjaminites. They said, “Today one tribe has been separated from Israel. "},{"num":7,"verse":"We made a promise before the Lord. We will not allow our daughters to marry a Benjaminite. How can we make sure that the men of Benjamin will have wives?” "},{"num":8,"verse":"Then they asked, “Which one of the tribes of Israel did not come here to Mizpah?” They found that no one from the city of Jabesh Gilead was there. "},{"num":9,"verse":"The people of Israel counted everyone, but no one from Jabesh Gilead was there."},{"num":10,"verse":"So the whole group of Israelites sent 12,000 soldiers to Jabesh Gilead. They told the soldiers to kill the people in Jabesh Gilead with their swords. Even the women and children were to be killed."},{"num":11,"verse":"“This is what you must do: Kill every man in Jabesh Gilead. Also kill every woman who is not a virgin.” "},{"num":12,"verse":"The soldiers found 400 young women in Jabesh Gilead who were virgins. They brought these women to the camp at Shiloh in Canaan."},{"num":13,"verse":"Then the whole group of Israelites sent a message to the men of Benjamin. They offered to make peace with them. The men of Benjamin were at the rock of Rimmon. "},{"num":14,"verse":"So the men of Benjamin came back at that time. The Israelites gave them the women from Jabesh Gilead who had not been killed. But there were not enough women for all of them."},{"num":15,"verse":"The people of Israel felt sorry for the Benjaminites. This was because the Lord had separated the tribes of Israel. "},{"num":16,"verse":"The elders of the Israelites spoke. They said, “The women of Benjamin have been killed. Where can we get wives for the men of Benjamin who are still alive? "},{"num":17,"verse":"These men must have children to continue their families. This is so a tribe in Israel will not die out. "},{"num":18,"verse":"But we cannot allow our daughters to marry them. We have made this promise: ‘Anyone who gives a wife to a man of Benjamin is cursed.’ "},{"num":19,"verse":"We have an idea! There is a yearly festival of the Lord at Shiloh. Shiloh is north of the city of Bethel. It is east of the road that goes from Bethel to Shechem. And it is south of the city of Lebonah.”"},{"num":20,"verse":"So the elders told the men of Benjamin about their idea. They said, “Go and hide in the vineyards. "},{"num":21,"verse":"Watch for the young women from Shiloh to come out. They will come to join the dancing. Then run out from the vineyards. Each of you take one of the young Shiloh women and go to the land of Benjamin. "},{"num":22,"verse":"The fathers or brothers of those young women will come to us. They will complain, but we will say: ‘Be kind to the men of Benjamin. We did not get wives for Benjamin during the war. And you did not give the women to the men from Benjamin. So you are not guilty.’”"},{"num":23,"verse":"So that is what the Benjaminites did. While the young women were dancing, each man caught one of them. They took them away and married them. Then they went back to the land God had given them. They rebuilt their cities and lived there."},{"num":24,"verse":"Then the Israelites went home. They went to their own tribes and family groups. They went to their own land that God had given them."},{"num":25,"verse":"In those days the Israelites did not have a king. Everyone did what he thought was right."}]