[{"header":"Wives for the Benjamites"},{"num":21,"verse":"In Mizpah the men of Israel had taken an oath: “No one among us will give his daughter to a Benjamite as his wife.”"},{"num":2,"verse":"So the people came to Bethel and sat there before God until evening. They raised their voices and wept, sobbing loudly. "},{"num":3,"verse":"They said, “Why, Lord God of Israel, has this happened in Israel, that today a tribe is missing from Israel?”"},{"num":4,"verse":"In the morning the people got up early and built an altar there. They offered burnt offerings and peace offerings."},{"num":5,"verse":"The children of Israel said, “Who from all the tribes of Israel did not go up with the assembly to the Lord?” For they vowed a solemn oath regarding whoever did not go up to the Lord at Mizpah stating, “He must be killed.”"},{"num":6,"verse":"The children of Israel lamented for Benjamin their brother, and said, “One tribe is cut off from Israel today. "},{"num":7,"verse":"What can we do to find wives for those who are left? For we swore by the Lord not to give them our daughters as wives.” "},{"num":8,"verse":"So they said, “Is there anyone from among the tribes of Israel who did not go up to the Lord at Mizpah?” Then they learned that no one from the camp of Jabesh Gilead had come to the assembly. "},{"num":9,"verse":"When the people were counted, indeed, there was not a man there from among the inhabitants of Jabesh Gilead."},{"num":10,"verse":"So the assembly sent twelve thousand valorous men there and commanded them, “Go and strike down the inhabitants of Jabesh Gilead with the edge of the sword, including women and children. "},{"num":11,"verse":"This is what you will do: You will kill every man and every woman who has slept with a man.” "},{"num":12,"verse":"So among the inhabitants of Jabesh Gilead they found four hundred young virgins who had never slept with a man, and they brought them to the camp at Shiloh in the land of Canaan."},{"num":13,"verse":"Then the whole assembly sent someone to speak to the Benjamites who were at Rimmon Rock, and they declared peace. "},{"num":14,"verse":"So the Benjamites returned at that time, and they gave to them the women who were still alive from among the women of Jabesh Gilead. Yet they did not find enough for them."},{"num":15,"verse":"The people felt sorry for Benjamin, for the Lord had made a gap among the tribes of Israel. "},{"num":16,"verse":"The elders of the assembly said, “What can we do to find wives for those who are left? The Benjamite women were destroyed.” "},{"num":17,"verse":"They said, “There must be an inheritance for the remnant of Benjamin, so that a tribe will not be wiped out from Israel. "},{"num":18,"verse":"Yet we cannot give them our daughters for wives, for the children of Israel swore, ‘Cursed be anyone who gives a wife to Benjamin.’ ” "},{"num":19,"verse":"They said, “Wait! There is an annual festival of the Lord in Shiloh, which is north of Bethel, east of the main road that goes up from Bethel to Shechem, and south of Lebonah.”"},{"num":20,"verse":"So they commanded the Benjamites, “Go and hide in the vineyards. "},{"num":21,"verse":"Watch, and then when the daughters of Shiloh come out to dance in the dances, come out from the vineyards and have every man grab a wife for himself from among the daughters of Shiloh. Then go to the land of Benjamin. "},{"num":22,"verse":"When their fathers or their brothers come to us to complain, we will say to them, ‘Be favorable to them for our sakes, because we did not take for each man a wife in the battle; for you have not given women to them at the time, thereby making yourselves guilty.’ ”"},{"num":23,"verse":"So the Benjamites did this. They carried away wives for each man from among the dancers that they caught. Then they returned to their inheritance, rebuilt the cities, and lived in them."},{"num":24,"verse":"At that time, the children of Israel departed from there each man to his tribe and to his family. They went out from there to their own inheritance."},{"num":25,"verse":"In those days there was no king in Israel; everyone did what was right in his own eyes."}]