[{"num":21,"verse":"Now the Ish Yisroel had taken an oath in Mitzpah, saying, There shall not any of us give his bat unto Binyamin as isha."},{"num":2,"verse":"And HaAm went to Beit-El, and abode there till erev before HaElohim, and lifted up their voices, and wept gadol;"},{"num":3,"verse":"And said, Hashem Elohei Yisroel, why is this come to pass in Yisroel, that there should be today shevet echad lacking in Yisroel?"},{"num":4,"verse":"And it came to pass on the next day, that HaAm rose early, and built there a Mizbe’ach, and offered olot and shelamim."},{"num":5,"verse":"And the Bnei Yisroel said, Who is there among kol Shivtei Yisroel that came not up with the Kahal unto Hashem? For they had made the shevuah hagedolah concerning him that came not up before Hashem to Mitzpah, saying, He shall surely be put to death."},{"num":6,"verse":"And the Bnei Yisroel had compassion for Binyamin their brother, and said, There is shevet echad cut off from Yisroel this day."},{"num":7,"verse":"How shall we do for nashim for them that remain, seeing we have taken an oath by Hashem that we will not give them of our banot as nashim?"},{"num":8,"verse":"And they said, What one is there of the Shivtei Yisroel that came not up to Mitzpah to Hashem? And, hinei, there came none to the machaneh from Yavesh-Gilead to the Kahal."},{"num":9,"verse":"For HaAm were numbered, and, hinei, there were none of the inhabitants of Yavesh-Gilead there."},{"num":10,"verse":"And HaEdah sent thither 12,000 ish of the Bnei HeChayil, and commanded them, saying, Go and strike the inhabitants of Yavesh-Gilead with the edge of the cherev, with the women and the children."},{"num":11,"verse":"And this is the thing that ye shall do, Ye shall utterly destroy every zakhar, and every isha that hath da’as of lying with man."},{"num":12,"verse":"And they found among the inhabitants of Yavesh-Gilead four hundred na’arah betulah, that had known no man by lying with any zakhar; and they brought them unto the machaneh at Shiloh, which is in Eretz Kena’an."},{"num":13,"verse":"And the kol HaEdah sent some to speak to the Bnei Binyamin that were at the Rock of Rimmon, and to proclaim shalom unto them."},{"num":14,"verse":"And Binyamin came again at that time; and they gave them nashim which they had saved alive of the women of Yavesh-Gilead; but they sufficed not for them."},{"num":15,"verse":"And HaAm had compassion for Binyamin, because Hashem had made a breach in the Shivtei Yisroel."},{"num":16,"verse":"Then the Ziknei HaEdah (Elders of the Congregation) said, How shall we do for nashim for them that remain, seeing the isha are destroyed out of Binyamin?"},{"num":17,"verse":"And they said, There must be yerushah (heir) for them that be survivor of Binyamin, that a shevet be not destroyed out of Yisroel."},{"num":18,"verse":"Howbeit we may not give them nashim of our banot; for the Bnei Yisroel have sworn, saying, Cursed be he that giveth an isha to Binyamin."},{"num":19,"verse":"Then they said, Hinei, there is chag Hashem (feast of Hashem) in Shiloh yearly in a place which is on the north side of Beit El, on the east side of the road that goeth up from Beit El to Shechem, and on the south of Levonah."},{"num":20,"verse":"Therefore they commanded the Bnei Binyamin, saying, Go and lie in wait in the kramim (vineyards);"},{"num":21,"verse":"And watch, and, hinei, if the Banot Shiloh come out to join in dances, then come ye out of the kramim (vineyards), and catch you every ish his isha of the Banot Shiloh, and go to Eretz Binyamin."},{"num":22,"verse":"And it shall be, when their avot or their achim come unto us for riv (to complain), we [the Ziknei HaEdah] will say unto them, Give them to us, for we did not receive every ish his isha through the war; for ye have not given them unto them at this time; now would ye be guilty."},{"num":23,"verse":"And the Bnei Binyamin did so and took them nashim, according to their number, of them that danced, whom they caught; and they went and returned unto their nachalah, and repaired the towns, and dwelt in them."},{"num":24,"verse":"And the Bnei Yisroel departed from there at that time, every ish to his shevet and to his mishpakhah, and they went out from thence every ish to his nachalah."},{"num":25,"verse":"In those days there was no melech in Yisroel; every man did that which was yashar (right) in his own eyes."}]