[{"header":"David’s Instructions to Solomon"},{"num":2,"verse":"Not long before David died, he told Solomon:"},{"header":"David Dies"},{"num":10,"verse":"David was king of Israel forty years. He ruled seven years from Hebron and thirty-three years from Jerusalem. Then he died and was buried in Jerusalem. "},{"num":12,"verse":"His son Solomon became king and took control of David’s kingdom."},{"header":"Adonijah Is Killed"},{"num":13,"verse":"One day, Adonijah went to see Bathsheba, Solomon’s mother, and she asked, “Is this a friendly visit?”"},{"num":14,"verse":"I just want to talk with you.”"},{"num":15,"verse":"“You know that I was king for a little while,” Adonijah replied. “And everyone in Israel accepted me as their ruler. But the Lord wanted my brother to be king, so now things have changed. "},{"num":16,"verse":"Would you do me a favor?”"},{"num":17,"verse":"“Please ask Solomon to let me marry Abishag. He won’t say no to you.”"},{"num":18,"verse":"“All right,” she said. “I’ll ask him.”"},{"num":19,"verse":"When Bathsheba went to see Solomon, he stood up to meet her, then bowed low. He sat back down and had another throne brought in, so his mother could sit at his right side. "},{"num":20,"verse":"Bathsheba sat down and then asked, “Would you do me a small favor?”"},{"num":21,"verse":"“Allow your brother Adonijah to marry Abishag,” she answered."},{"num":22,"verse":"Solomon said:"},{"num":25,"verse":"“Benaiah,” Solomon shouted, “go kill Adonijah.” So Adonijah died."},{"header":"Abiathar Is Sent Back Home"},{"num":26,"verse":"Solomon sent for Abiathar the priest and said:"},{"header":"Joab Is Killed"},{"num":28,"verse":"Joab had not helped Absalom try to become king, but he had helped Adonijah. So when Joab learned that Adonijah had been killed, he ran to the sacred tent and grabbed hold of the corners of the altar for protection. "},{"num":29,"verse":"When Solomon heard about this, he sent someone to ask Joab, “Why did you run to the altar?”"},{"num":30,"verse":"Benaiah went to the sacred tent and yelled, “Joab, the king orders you to come out!”"},{"num":31,"verse":"Solomon replied:"},{"num":34,"verse":"Benaiah went back and killed Joab. His body was taken away and buried near his home in the desert."},{"num":35,"verse":"Solomon put Benaiah in Joab’s place as army commander, and he put Zadok in Abiathar’s place as priest."},{"header":"Shimei Is Killed"},{"num":36,"verse":"Solomon sent for Shimei and said, “Build a house here in Jerusalem and live in it. But whatever you do, don’t leave the city! "},{"num":37,"verse":"If you ever cross Kidron Valley and leave Jerusalem, you will be killed. And it will be your own fault.”"},{"num":38,"verse":"“That’s fair, Your Majesty,” Shimei answered. “I’ll do that.” So Shimei lived in Jerusalem from then on."},{"num":39,"verse":"About three years later, two of Shimei’s servants ran off to King Achish in Gath. When Shimei found out where they were, "},{"num":40,"verse":"he saddled his donkey and went after them. He found them and brought them back to Jerusalem."},{"num":41,"verse":"Someone told Solomon that Shimei had gone to Gath and was back. "},{"num":42,"verse":"Solomon sent for him and said:"},{"num":46,"verse":"“Benaiah,” Solomon shouted, “kill Shimei.” So Shimei died."}]