[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XXXVIII.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) In those days.—On any supposition, the narrative of Hezekiah’s illness throws us back to a time fifteen years before his death, and therefore to an earlier date than the destruction of the Assyrian army, which it here follows. So in Isaiah 38:6, the deliverance of the city is spoken of as still future. Assuming the rectified chronology given above, we are carried to a time ten or eleven years before the invasion, which was probably in part caused by the ambitious schemes indicated in Isaiah 39. It follows from either view that we have no ground for assuming, as some commentators have done, (1) that the illness was an attack of the plague that destroyed the Assyrian army, or (2) that the treasures which Hezekiah showed to the Babylonian ambassadors were in part the spoil of that army.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "In those days.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—On any supposition, the narrative of Hezekiah’s illness throws us back to a time fifteen years before his death, and therefore to an earlier date than the destruction of the Assyrian army, which it here follows. So in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the deliverance of the city is spoken of as still future. Assuming the rectified chronology given above, we are carried to a time ten or eleven years before the invasion, which was probably in part caused by the ambitious schemes indicated in Isaiah 39. It follows from either view that we have no ground for assuming, as some commentators have done, (1) that the illness was an attack of the plague that destroyed the Assyrian army, or (2) that the treasures which Hezekiah showed to the Babylonian ambassadors were in part the spoil of that army.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Set thine house in order.—Literally, Give orders to thy house, euphemistic for “make thy will.” The words are a striking illustration, like Jonah’s announcement that Nineveh should be destroyed in three days (Jonah 3:4), of the conditional character of prophecy. It would seem as if Isaiah had been consulted half as prophet and half as physician as to the nature of the disease. It seemed to him fatal; it was necessary to prepare for death. The words may possibly imply a certain sense of disappointment at the result of Hezekiah’s reign. In the midst of the king’s magnificence and prosperity there was that in the inner house of the soul, as well as in that of the outer life, which required ordering.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Set thine house in order.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Give orders to thy house, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "euphemistic for “make thy will.” The words are a striking illustration, like Jonah’s announcement that Nineveh should be destroyed in three days (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), of the conditional character of prophecy. It would seem as if Isaiah had been consulted half as prophet and half as physician as to the nature of the disease. It seemed to him fatal; it was necessary to prepare for death. The words may possibly imply a certain sense of disappointment at the result of Hezekiah’s reign. In the midst of the king’s magnificence and prosperity there was that in the inner house of the soul, as well as in that of the outer life, which required ordering.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 38:1-8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:1-8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In those days was Hezekiah sick — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "38:1-8 When we pray in our sickness, though God send not to us such an answer as he here sent to Hezekiah, yet, if by his Spirit he bids us be of good cheer, assures us that our sins are forgiven, and that, whether we live or die, we shall be his, we do not pray in vain. See 2Ki 20:1-11.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In those days - That is, his sickness commenced about the period in which the army of Sennacherib was destroyed. It has been made a question whether the sickness of Hezekiah was before or after the invasion of Sennacherib. The most natural interpretation certainly is, that it occurred after that invasion, and probably at no distant period. The only objection to this view is the statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that God would deliver him out of the hand of the king of Assyria, which has been understood by many as implying that he was then threatened with the invasion. But this may mean simply that he would be perpetually and finally delivered from his hand; that he would be secure in that independence from a foreign yoke which he had long sought ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 18:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that the Assyrian should not be able again to bring the Jews into subjection (see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:30-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; compare the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jerome supposes that it was brought upon him lest his heart should be elated with the signal triumph, and in order that, in his circumstances, he might be kept humble. Josephus (Ant. x. 2. 1) says that the sickness occurred soon after the destruction of the army of Sennacherib. Prideaux (Connection, vol. i. p. 137) places his sickness before the invasion of the Assyrians.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Was sick - What was the exact nature of this sickness is not certainly known. In Isaiah 38:21 it is said that it was 'a boil,' and probably it was a pestilential boil. The pestilence or plague is attended with an eruption or boil. 'No one,' says Jahn, 'ever recovered from the pestilence unless the boil of the pestilence came out upon him, and even then he could not always be cured' (Biblical Antiquities, Section 190). The pestilence was, and is still, rapid in its progress. It terminates the life of those who are affected with it almost immediately, and at the furthest within three or four days. Hence, we see one ground of the alarm of Hezekiah. Another cause of his anxiety was, that he had at this time no children, and consequently he had reason to apprehend that his kingdom would be thrown into contention by conflicting strifes for the crown.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Was sick - What was the exact nature of this sickness is not certainly known. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is said that it was 'a boil,' and probably it was a pestilential boil. The pestilence or plague is attended with an eruption or boil. 'No one,' says Jahn, 'ever recovered from the pestilence unless the boil of the pestilence came out upon him, and even then he could not always be cured' (Biblical Antiquities, Section 190). The pestilence was, and is still, rapid in its progress. It terminates the life of those who are affected with it almost immediately, and at the furthest within three or four days. Hence, we see one ground of the alarm of Hezekiah. Another cause of his anxiety was, that he had at this time no children, and consequently he had reason to apprehend that his kingdom would be thrown into contention by conflicting strifes for the crown.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Unto death - Ready to die; with a sickness which in the ordinary course would terminate his life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Set thine house in order - Hebrew, 'Give command (צו  tsâv) to thy house,' that is, to thy family. If you have any directions to give in regard to the succession to the crown, or in regard to domestic and private arrangements, let it be done soon. Hezekiah was yet in middle life. He came to the throne when he was twenty-five years old 2 Kings 18:2, and he had now reigned about fourteen years. It is possible that he had as yet made no arrangements in regard to the succession, and as this was very important to the peace of the nation, Isaiah was sent to him to apprize him of the necessity of leaving the affairs of his kingdom so that there should not be anarchy when he should die. The direction, also, may be understood in a more general sense as denoting that he was to make whatever arrangements might be necessary as preparatory to his death. We see here - ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Set thine house in order - Hebrew, 'Give command (צו  tsâv) to thy house,' that is, to thy family. If you have any directions to give in regard to the succession to the crown, or in regard to domestic and private arrangements, let it be done soon. Hezekiah was yet in middle life. He came to the throne when he was twenty-five years old ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and he had now reigned about fourteen years. It is possible that he had as yet made no arrangements in regard to the succession, and as this was very important to the peace of the nation, Isaiah was sent to him to apprize him of the necessity of leaving the affairs of his kingdom so that there should not be anarchy when he should die. The direction, also, may be understood in a more general sense as denoting that he was to make whatever arrangements might be necessary as preparatory to his death. We see here - ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "1. The boldness and fidelity of a man of God. Isaiah was not afraid to go in and freely tell even a monarch that he must die. The subsequent part of the narrative would lead us to suppose that until this announcement Hezekiah did not regard himself as in immediate danger. It is evident here, that the physician of Hezekiah had not informed him of it - perhaps from the apprehension that his disease would be aggravated by the agitation of his mind on the subject. The duty was, therefore, left, as it is often, to a minister of religion - a duty which even many ministers are slow to perform, and which many physicians are reluctant to have performed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. No danger is to be apprehended commonly from announcing to those who are sick their true condition. Friends and relatives are often reluctant to do it, for fear of agitating and alarming them. Physicians often prohibit them from knowing their true condition, under the apprehension that their disease may be aggravated. Yet here was a case in which pre-eminently there might be danger from announcing the danger of death. The disease was deeply seated. It was making rapid progress. It was usually incurable. Nay, there was here a moral certainty that the monarch would die. And this was a case, therefore, which particularly demanded, it would seem, that the patient should be kept quiet, and free from alarms. But God regarded it as of great importance that he should know His true condition, and the prophet was directed to go to him and faithfully to state it. Physicians and friends often err in this.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There is no species of cruelty greater than to suffer a friend to lie on a dying bed under a delusion. There is no sin more aggravated than that of designedly deceiving a dying man, and flattering him with the hope of recovery when there is a moral certainty that he will not, and cannot recover. And there is evidently no danger to be apprehended from communicating to the sick their true condition. It should be done tenderly, and with affection; but it should be done faithfully. I have had many opportunities of witnessing the effect of apprizing the sick of their situation, and of the moral certainty that they must die. And I cannot now recall an instance in which the announcement has had any unhappy effect on the disease. Often, on the contrary, the effect is to calm the mind, and to lead the dying to look up to God, and peacefully to repose on him. And the effect of that is always salutary. Nothing is more favorable for a recovery than a peaceful, calm, heavenly submission to God; and the repose and quiet which physicians so much desire their patients to possess, is often best obtained by securing confidence in God, and a calm resignation to his will.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. Every man with the prospect of death before him should set his house in order. Death is an event which demands preparation - a preparation which should not be deferred to the dying moment. In view of it, whether it comes sooner or later, our peace should be made with God and our worldly affairs so arranged that we can leave them without distraction, and without regret.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For thou shalt die, and not live - Thy disease is incurable. It is a mortal, fatal disease. The Hebrew is, 'for thou art dead' (מת  mēth); that is, you are a dead man. A similar expression occurs in Genesis 20:3, in the address which God made to Abimelech: 'Behold thou art a dead man, on account of the woman which thou hast taken.' We have a similar phrase in our language, when a man is wounded, and when he says, 'I am a dead man.' This is all that we are required to understand here, that, according to the usual course of the disease, he must die. It is evident that Isaiah was not acquainted himself with the secret intention of God; nor did he know that Hezekiah would humble himself, and plead with God; nor that God would by a miracle lengthen out his life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For thou shalt die, and not live - Thy disease is incurable. It is a mortal, fatal disease. The Hebrew is, 'for thou art dead' (מת  mēth); that is, you are a dead man. A similar expression occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in the address which God made to Abimelech: 'Behold thou art a dead man, on account of the woman which thou hast taken.' We have a similar phrase in our language, when a man is wounded, and when he says, 'I am a dead man.' This is all that we are required to understand here, that, according to the usual course of the disease, he must die. It is evident that Isaiah was not acquainted himself with the secret intention of God; nor did he know that Hezekiah would humble himself, and plead with God; nor that God would by a miracle lengthen out his life. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 38",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isa 38:1-22. Hezekiah's Sickness; Perhaps Connected with the Plague or Blast Whereby the Assyrian Army Had Been Destroyed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Set … house in order—Make arrangement as to the succession to the throne; for he had then no son; and as to thy other concerns.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou shall die—speaking according to the ordinary course of the disease. His being spared fifteen years was not a change in God's mind, but an illustration of God's dealings being unchangeably regulated by the state of man in relation to Him.Hezekiah in his sickness receiveth from Isaiah a message of death, Isaiah 38:1. By prayer, Isaiah 38:2,3, hath his life lengthened: the sun goeth backward for a sign thereof, Isaiah 38:4-8. His song of praise to God, Isaiah 38:9-20.  No text from Poole on this verse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou shall die—speaking according to the ordinary course of the disease. His being spared fifteen years was not a change in God's mind, but an illustration of God's dealings being unchangeably regulated by the state of man in relation to Him.Hezekiah in his sickness receiveth from Isaiah a message of death, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 38:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". By prayer, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 38:2,3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", hath his life lengthened: the sun goeth backward for a sign thereof, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 38:4-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His song of praise to God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 38:9-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " No text from Poole on this verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In those days was Hezekiah sick unto death,.... This was about the time that Sennacherib invaded Judea, threatened Jerusalem with a siege, and his army was destroyed by an angel from heaven; but, whether it was before or after the destruction of his army, interpreters are not agreed. Some of the Jewish writers, as Jarchi upon the place, and others (a), say, it was three days before the ruin of Sennacherib's army; and that it was on the third day that Hezekiah recovered, and went up to the temple, that the destruction was; and that it was the first day of the passover; and that this was before the city of Jerusalem was delivered from him; and the fears of him seem clear from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and some are of opinion that his sickness was occasioned by the consternation and terror he was thrown into, by reason of the Assyrian army, which threatened ruin to him and his kingdom. Though Josephus (b) says, that it was after his deliverance from it, and when he had given thanks to God for it; however, it is certain it was in the same year, since it was in the fourteenth year of Hezekiah's reign that Sennacherib invaded Judea, and from this his sickness and recovery fifteen years were added to his days, and he reigned no more than twenty nine years, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what this sickness was cannot be said with certainty; some have conjectured it to be the plague, since he had a malignant ulcer, of which he was cured by a plaster of figs; but, be it what it will, it was a deadly one in its own nature, it was a sickness unto death, a mortal one; though it was not eventually so, through the interposition of divine power, which prevented it. The reason of this sickness, which Jarchi gives, that it was because he did not take to himself a wife, is without foundation; more likely the reason of it was, to keep him humble, and that he might not be lifted up with the deliverance, or be more thankful for it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Isaiah the prophet, the son of Amoz, came unto him: not of his own accord to visit him, but was sent by the Lord with a message to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said unto him, thus saith the Lord, set thine house in order; or, \"give orders to thine house\" (c): to the men of thine house, as the Targum; his domestics, his counsellors and courtiers, what they should do after his death; how his personal estate should be disposed of; how the throne should be filled up; who should succeed him, since he had no son: the family and secular affairs of men should be put in order, and direction given for the management of them, and their substance and estates should be disposed of by will before their death; and much more a concern should be shown for the setting in order their spiritual affairs, or that they may be habitually ready for death and eternity; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for thou shall die, and not live: or not recover of thy sickness, as the Targum adds: \"for thou art a dead man\", as it may be rendered, in all human appearance; the disease being deadly, and of which he could not recover by the help of any medicine; nothing but almighty power could save him; and this is said, to observe to him his danger, to give him the sentence of death in himself, and to set him a praying, as it did. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Seder Olam Rabba, c. 23. p. 65. (b) Antiqu. l. 10. c. 2. sect. 1.((c)  \"praecipe domui tuae\", Musculus, Vatablus, Pagniaus, Montanus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Seder Olam Rabba, c. 23. p. 65. (b) Antiqu. l. 10. c. 2. sect. 1.((c)  \"praecipe domui tuae\", Musculus, Vatablus, Pagniaus, Montanus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "In those {a} days was Hezekiah sick and near death. And Isaiah the prophet the son of Amoz came to him, and said to him, Thus saith the LORD, Set thy house in order: for thou shalt die, and not live.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In those ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " days was Hezekiah sick and near death. And Isaiah the prophet the son of Amoz came to him, and said to him, Thus saith the LORD, Set thy house in order: for thou shalt die, and not live.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Soon after that the Assyrians were slain: so that God will have the exercise of his children continually, that they may learn only to depend on God and aspire to the heavens.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In those days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The incident must have preceded by some months the embassy of Merodach-Baladan, the probable date of which will be considered in the Introduction to ch. 39. The order of the chapters cannot be chronological, and the vague expression “in those days” need not perhaps mean more than “in the time of Hezekiah.” If, as Delitzsch and others have supposed, ch. 38 f. stood before 36 f. in the original document, the note of time would naturally refer to some other events in Isaiah’s biography which had been previously narrated. The best justification of this hypothesis is the solution it furnishes of the chronological difficulties presented by this group of chapters.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Set thine house in order",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. “Give commandment to thy house,” the last duty of a dying man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 17:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). An example of what is meant may be found in David’s elaborate death-bed charge to Solomon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 2:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In those days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The illness of Hezekiah is fixed by ver. 5 (and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the fourteenth year of his reign, or  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 714",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The entire narrative of this chapter and the next is therefore thirteen or fourteen years earlier than that of ch. 36, 37, which belongs to Hezekiah's closing years,  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 701-698",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the comment on Isaiah 26:l, 2). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Sick unto death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " attacked by a malady which, if it had run its natural course, would have been fatal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Isaiah the prophet the son of Amoz",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This double designation of Isaiah, by his office and by his descent, marks the original independence of this narrative, which was not intended for a continuation of ch. 37. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou shalt die, and not live",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Prophecies were often threats, and, when such, were conditional, announcing results which would follow unless averted by prayer or repentance (compare Jonah's prophecy, \"Yet forty days, and Nineveh shall be overthrown,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Isaiah 38:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There is nothing to surprise us in the fact that we are carried back to the time when Jerusalem was still threatened by the Assyrian, since the closing vv. of chapter 37 merely contain an anticipatory announcement, introduced for the purpose of completing the picture of the last Assyrian troubles, by adding the fulfilment of Isaiah's prediction of their termination. It is within this period, and indeed in the year of the Assyrian invasion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 36:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), since Hezekiah reigned twenty-nine years, and fifteen of these are promised here, that the event described by Isaiah falls - an event not merely of private interest, but one of importance in connection with the history of the nation also. \"In those days Hizkiyahu became dangerously ill. And Isaiah son of Amoz, the prophet, came to him, and said to him, Thus saith Jehovah, Set thine house in order: for thou wilt die, and not recover. Then Hizkiyahu turned (K. om.) his face to the wall, and prayed to Jehovah, and said (K. saying), O Jehovah, remember this, I pray, that I have walked before thee in truth, and with the whole heart, and have done what was good in Thine eyes! And Hizkiyahu wept with loud weeping.\" \"Give command to thy house\" (ל, cf., אל,   ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 17:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is equivalent to, \"Make known thy last will to thy family\" (compare the rabbinical tsavvâ'âh, the last will and testament); for though tsivvâh is generally construed with the accusative of the person, it is also construed with Lamed (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 1:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf., אל, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). חיה in such a connection as this signifies to revive or recover. The announcement of his death is unconditional and absolute. As Vitringa observes, \"the condition was not expressed, because God would draw it from him as a voluntary act.\" The sick man turned his face towards the wall (פּניו הסב, hence the usual fut. cons. ויּסּב as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to retire into himself and to God. The supplicatory אנּה (here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in all six times, with ה) always has the principal tone upon the last syllable before יהוה  equals  אדני (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The metheg has sometimes passed into a conjunctive accent (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 50:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). אשׁר את does not signify that which, but this, that, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. \"In truth,\" i.e., without wavering or hypocrisy. שׁלם בלב, with a complete or whole heart, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:61",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. He wept aloud, because it was a dreadful thing to him to have to die without an heir to the throne, in the full strength of his manhood (in the thirty-ninth year of his age), and with the nation in so unsettled a state. ",
        "children": []
      }
    ]
  }
]