[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Take now.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is not an adverb of time, but an interjection of entreaty, usually coupled with requests, and intended to soften them. It thus makes the words more an exhortation than a command.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thine only son Isaac.—The words in the original are more emphatic, being, “Take, I pray, thy son, thine only son, whom thou lovest, even Isaac.” If childlessness was so unendurable in old time to Abraham (Genesis 15:2), what would it be now, after so many years of enjoyment of a son, and after giving up Ishmael for his sake (Genesis 17:18)?",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Thine only son Isaac.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The words in the original are more emphatic, being, “Take, I pray, thy son, thine only son, whom thou lovest, even Isaac.” If childlessness was so unendurable in old time to Abraham (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), what would it be now, after so many years of enjoyment of a son, and after giving up Ishmael for his sake (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 17:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The land of Moriah.—Moriah may either mean Jah is teacher (see Note on Genesis 12:6), or Jah is provider. The first is supported by Isaiah 2:3, where the verb is rendered will teach; but the second agrees best with Genesis 22:8; Genesis 22:14. If this be the meaning, the name would be derived from this event, and would signify the place where “Jehovah will Himself provide the sacrifice.” It has been suggested by many able commentators, that the place meant was Moreh in Sichem, and that the site of the sacrifice was, as the Samaritans affirmed, the natural altar upon the summit of Mount Gerizim. But as Abraham and Isaac reached the spot on the third day, and evidently at an early hour, Gerizim is too remote from Beer-sheba for this to be possible Even Jerusalem is distant enough, as the journey from Beer-sheba takes twenty and a half hours; and travellers in those days had to cook their own food, and prepare their own sleeping accommodation. We may notice also, that Moriah is described as “a land,” in some part of which Abraham was to be shown the special mountain intended for the sacrifice; Moreh, on the contrary, was a place where Abraham had lived, and which was therefore well known to him.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The land of Moriah.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Moriah may either mean ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Jah is teacher ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(see Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Jah is provider. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The first is supported by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the verb is rendered ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "will teach; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "but the second agrees best with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". If this be the meaning, the name would be derived from this event, and would signify the place where “Jehovah will Himself provide the sacrifice.” It has been suggested by many able commentators, that the place meant was Moreh in Sichem, and that the site of the sacrifice was, as the Samaritans affirmed, the natural altar upon the summit of Mount Gerizim. But as Abraham and Isaac reached the spot on the third day, and evidently at an early hour, Gerizim is too remote from Beer-sheba for this to be possible Even Jerusalem is distant enough, as the journey from Beer-sheba takes twenty and a half hours; and travellers in those days had to cook their own food, and prepare their own sleeping accommodation. We may notice also, that Moriah is described as “a land,” in some part of which Abraham was to be shown the special mountain intended for the sacrifice; Moreh, on the contrary, was a place where Abraham had lived, and which was therefore well known to him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Offer him there for a burnt offering.—Hengstenberg and others have argued that Abraham was not to kill Isaac, but to surrender him spiritually to God, and sanctify him by a burnt offering. But this is contradicted by the narrative itself (Genesis 22:10), and by the passage in the Epistle to the Hebrews referred to above, where the victory of Abraham’s faith is described as consisting in the belief, that even though Isaac were killed, nevertheless the promise would still in some Divine manner be fulfilled in him.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Offer him there for a burnt offering.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Hengstenberg and others have argued that Abraham was not to kill Isaac, but to surrender him spiritually to God, and sanctify him by a burnt offering. But this is contradicted by the narrative itself (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and by the passage in the Epistle to the Hebrews referred to above, where the victory of Abraham’s faith is described as consisting in the belief, that even though Isaac were killed, nevertheless the promise would still in some Divine manner be fulfilled in him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 22:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he said, Take thy son ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Not thy bullocks and thy lambs; how willingly would Abraham have parted with them by thousands to redeem Isaac! Not thy servant, no, not the steward of thy house. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thine only son — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thine only son by Sarah. Ishmael was lately cast out, to the grief of Abraham, and now Isaac only was left; and must he go too? Yes: take Isaac, him by name, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy laughter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Song of Solomon indeed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Yea, that son ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whom thou lovest — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The trial was of Abraham’s love to God, and therefore it must be in a beloved son: in the Hebrew it is expressed more emphatically, and might very well be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Take now that son of thine, that only son of thine, whom thou lovest, that Isaac. And get thee into the land of Moriah — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Distant three days’ journey, that he might have time to consider it, and if he do it, might do it deliberately. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And offer him for a burnt- offering — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He must not only slay his son, but slay him as a sacrifice, with all that sedateness and composedness of mind, with which he used to offer his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "burnt-offering.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:1,2 We never are secure from trials In Hebrew, to tempt, and to try, or to prove, are expressed by the same word. Every trial is indeed a temptation, and tends to show the dispositions of the heart, whether holy or unholy. But God proved Abraham, not to draw him to sin, as Satan tempts. Strong faith is often exercised with strong trials, and put upon hard services. The command to offer up his son, is given in such language as makes the trial more grievous; every word here is a sword. Observe, 1. The person to be offered: Take thy son; not thy bullocks and thy lambs. How willingly would Abraham have parted with them all to redeem Isaac! Thy son; not thy servant. Thine only son; thine only son by Sarah. Take Isaac, that son whom thou lovest. 2. The place: three days' journey off; so that Abraham might have time to consider, and might deliberately obey. 3. The manner: Offer him fro a burnt-offering; not only kill his son, his Isaac, but kill him as a sacrifice; kill him with all that solemn pomp and ceremony, with which he used to offer his burnt-offerings.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Returned unto the land of the Philistines. - Beer-sheba was on the borders of the land of the Philistines. Going therefore to Gerar, they returned into that land. In the transactions with Hagar and with Abimelek, the name God is employed, because the relation of the Supreme Being with these parties is more general or less intimate than with the heir of promise. The same name, however, is used in reference to Abraham and Sarah, who stand in a twofold relation to him as the Eternal Potentate, and the Author of being and blessing. Hence, the chapter begins and ends with Yahweh, the proper name of God in communion with man. \"Eshel is a field under tillage\" in the Septuagint, and a tree in Onkelos. It is therefore well translated a grove in the King James Version, though it is rendered \"the tamarisk\" by many. The planting of a grove implies that Abraham now felt he had a resting-place in the land, in consequence of his treaty with Abimelek. He calls upon the name of the Lord with the significant surname of the God of perpetuity, the eternal, unchangeable God. This marks him as the \"sure and able\" performer of his promise, as the everlasting vindicator of the faith of treaties, and as the infallible source of the believer's rest and peace. Accordingly, Abraham sojourned in the land of the Philistines many days. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - Abraham Was Tested",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. מריה  morı̂yâh, \"Moriah\"; Samaritan: מוראה  môr'âh; \"Septuagint,\" ὑψηλή  hupsēlē, Onkelos, \"worship.\" Some take the word to be a simple derivative, as the Septuagint and Onkelos, meaning \"vision, high, worship.\" It might mean \"rebellious.\" Others regard it as a compound of יה  yâh, \"Jah, a name of God,\" and מראה  mı̂r'eh, \"shown,\" מורה  môreh, \"teacher,\" or מורא  môrā', \"fear.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14. יראה  yı̂r'ēh, \"Jireh, will provide.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16, נאם  ne'um, ῥῆμα  rēma, \"dictum, oracle; related: speak low.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21. בוּז  bûz, \"Buz, scoffing.\" קמוּאל  qemû'ēl, \"Qemuel, gathered of God.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22. חזו  chăzô, \"Chazo, vision.\" פלדשׁ  pı̂ldâsh, \"Pildash, steelman? wanderer?\" ידלף  yı̂dlâp, \"Jidlaph; related: trickle, weep.\" בתוּאל  betû'ēl, \"Bethuel, dwelling of God.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23. רבקה  rı̂bqâh, \"Ribqah, noose.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24. ראוּמה  re'ûmâh, \"Reumah, exalted.\" טבה  ṭebach, \"Tebach, slaughter.\" גחם  gacham, \"Gacham, brand.\" תחשׁ  tachash, \"Tachash, badger or seal.\" <מעכה  ma‛ăkâh, \"Ma'akah; related: press, crush.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The grand crisis, the crowning event in the history of Abraham, now takes place. Every needful preparation has been made for it. He has been called to a high and singular destiny. With expectant acquiescence he has obeyed the call. By the delay in the fulfillment of the promise, he has been taught to believe in the Lord on his simple word. Hence, as one born again, he has been taken into covenant with God. He has been commanded to walk in holiness, and circumcised in token of his possessing the faith which purifieth the heart. He has become the intercessor and the prophet. And he has at length become the parent of the child of promise. He has now something of unspeakable worth, by which his spiritual character may be thoroughly tested. Since the hour in which he believed in the Lord, the features of his resemblance to God have been shining more and more through the darkness of his fallen nature - freedom of resolve, holiness of walk, interposing benevolence, and paternal affection. The last prepares the way for the highest point of moral likeness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Verse 1-19",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God tests Abraham's unreserved obedience to his will. \"The God.\" The true, eternal, and only God, not any tempter to evil, such as the serpent or his own thoughts. \"Tempted Abraham.\" To tempt is originally to try, prove, put to the test. It belongs to the dignity of a moral being to be put to a moral probation. Such assaying of the will and conscience is worthy both of God the assayer, and of man the assayed. \"Thine only one.\" The only one born of Sarah, and heir of the promise. \"Whom thou lovest.\" An only child gathers round it all the affections of the parent's heart. \"The land of Moriah.\" This term, though applied in 2 Chronicles 3:1 to the mount on which the temple of Solomon was built, is here the name of a country, containing, it may be, a range of mountains or other notable place to which it was especially appropriated. Its formation and meaning are very doubtful, and there is nothing in the context to lend us any aid in its explanation. It was evidently known to Abraham before he set out on his present journey. It is not to be identified with Moreh in Genesis 12:6, as the two names occur in the same document, and, being different in form, they naturally denote different things. Moreh is probably the name of a man. Moriah probably refers to some event that had occurred in the land, or some characteristic of its inhabitants. If a derivative, like בריה  porı̂yâh, \"fruitful,\" it may mean the land of the rebellious, a name not inapposite to any district inhabited by the Kenaanites, who were disposed to rebellion themselves Genesis 14:4, or met with rebellion from the previous inhabitants. If a compound of the divine name, Jah, whatever be the other element, it affords an interesting trace of the manifestation and worship of the true God under the name of Jab at some antecedent period. The land of Moriah comprehended within its range the population to which Melkizedec ministered as priest.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God tests Abraham's unreserved obedience to his will. \"The God.\" The true, eternal, and only God, not any tempter to evil, such as the serpent or his own thoughts. \"Tempted Abraham.\" To tempt is originally to try, prove, put to the test. It belongs to the dignity of a moral being to be put to a moral probation. Such assaying of the will and conscience is worthy both of God the assayer, and of man the assayed. \"Thine only one.\" The only one born of Sarah, and heir of the promise. \"Whom thou lovest.\" An only child gathers round it all the affections of the parent's heart. \"The land of Moriah.\" This term, though applied in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the mount on which the temple of Solomon was built, is here the name of a country, containing, it may be, a range of mountains or other notable place to which it was especially appropriated. Its formation and meaning are very doubtful, and there is nothing in the context to lend us any aid in its explanation. It was evidently known to Abraham before he set out on his present journey. It is not to be identified with Moreh in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as the two names occur in the same document, and, being different in form, they naturally denote different things. Moreh is probably the name of a man. Moriah probably refers to some event that had occurred in the land, or some characteristic of its inhabitants. If a derivative, like בריה  porı̂yâh, \"fruitful,\" it may mean the land of the rebellious, a name not inapposite to any district inhabited by the Kenaanites, who were disposed to rebellion themselves ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or met with rebellion from the previous inhabitants. If a compound of the divine name, Jah, whatever be the other element, it affords an interesting trace of the manifestation and worship of the true God under the name of Jab at some antecedent period. The land of Moriah comprehended within its range the population to which Melkizedec ministered as priest.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And offer him for a burnt-offering. - Abraham must have felt the outward inconsistency between the sacrifice of his son, and the promise that in him should his seed be called. But in the triumph of faith he accounted that God was able to raise him up, even from the dead. On no other principle can the prompt, mute, unquestioning obedience of Abraham be explained. Human sacrifice may have been not unknown; but this in no way met the special difficulty of the promise. The existence of such a custom might seem to have smoothed away the difficulty of a parent offering the sacrifice of a son. But the moral difficulty of human sacrifice is not so removed. The only solution of this, is what the ease itself actually presents; namely, the divine command. It is evident that the absolute Creator has by right entire control over his creatures. He is no doubt bound by his eternal rectitude to do no wrong to his moral creatures. But the creature in the present case has forfeited the life that was given, by sin. And, moreover, we cannot deny that the Almighty may, for a fit moral purpose, direct the sacrifice of a holy being, who should eventually receive a due recompense for such a degree of voluntary obedience. This takes away the moral difficulty, either as to God who commands, or Abraham who obeys. Without the divine command, it is needless to say that it was not lawful for Abraham to slay his son.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon one of the hills of which I will tell thee. - This form of expression dearly shows that Moriah was not at that time the name of the particular hill on which the sacrifice was to be offered. It was the general designation of the country in which was the range of hills on one of which the solemn transaction was to take place. \"And Abraham rose up early in the morning.\" There is no hesitation or lingering in the patriarch. If this has to be done, let it be done at once.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Upon one of the hills of which I will tell thee. - This form of expression dearly shows that Moriah was not at that time the name of the particular hill on which the sacrifice was to be offered. It was the general designation of the country in which was the range of hills on one of which the solemn transaction was to take place. \"And Abraham rose up early in the morning.\" There is no hesitation or lingering in the patriarch. If this has to be done, let it be done at once.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. Take now thy son, &c.—Every circumstance mentioned was calculated to give a deeper stab to the parental bosom. To lose his only son, and by an act of his own hand, too!—what a host of conflicting feelings must the order have raised! But he heard and obeyed without a murmur (Ga 1:16; Lu 14:26).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Not a word here but might pierce a heart of stone, much more so tender a father as Abraham was. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Take now, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " without demurring or delay, I allow thee no time for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " consideration, own proper ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "son; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not a beast, not an enemy, not a stranger, though that had been very difficult to one so kind to all strangers; not a dear servant, not a friend or familiar: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thine only son, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not by birth, for so he had another, Ishmael; but this was his only son by Sarah, his first and legitimate wife; who only had the right of succession both to his inheritance, and to his covenant and promises; and this only was now left to him, for Ishmael was abandoned and gone from him: and this must be such a son as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaac, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " once matter of laughter and great joy, now cause of inexpressible sorrow; thy Benoni; a son of the promise, of so great hopes, and such pregnant virtue and piety as this story shows; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "whom thou lovest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " peculiarly and superlatively, even as thy own soul: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and get thee into the land of Moriah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a place at a great distance, and to which thou shalt go but leisurely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 22:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that thou mayst have thy mind all that while fixed upon that bloody act, which other men’s minds can scarce once think of without horror; and so thou mayst offer him in a sort ten thousand times over before thou givest the fatal blow; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and offer him there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with thine own hands, and cruelly take away the life which thou hast in some sort given him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "for a burnt-offering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " wherein by the law of the burnt-offering then known to Abraham, afterwards published to all Israel, his throat was to be cut, his body dissected into quarters, his bowels taken out, as if he had been some notorious traitor, and vile malefactor and miscreant, and afterwards he was to be burnt to ashes, that if possible there might be nothing left of him: and this must be done ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "upon one of the mountains, which I shall tell thee of; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not secretly in a corner, as if it were a work of darkness, and thou wert ashamed or afraid to own it; but in a public and open place, in the view of heaven, earth, God, angels, and men. Which horrid and stupendous act it may be easily conjectured what reproach and blasphemy it would have occasioned against the name and worship of God and the true religion, and what shame and torment to Abraham, from his own self-accusing mind, from the clamours of his wife, and all his friends and allies, and what a dangerous and mischievous example this would have been to all future generations. That faith that could surmount these and many more difficulties, and could readily and cheerfully rest upon God in the discharge of such a duty, no wonder it is so honoured by God, and celebrated by all men, yea, even by the heathens, who have translated this history into their fables. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moriah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the vision of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the place where God would be seen and manifested. And so it is here called by way of anticipation, because it was so called afterwards, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 22:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", in regard of God’s eminent appearance there for Isaac’s deliverance; though it may also have a further respect unto Christ, because in that place ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "manifested in the flesh.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There were divers mountains there, as is evident from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 125:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 125:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and particularly there were two eminent hills, or rather tops or parts of the same mountain; Sion, where David’s palace was; and Moriah, where the temple was built, and whence the adjoining country afterwards received its name. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which I will tell thee of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by some visible sign, or secret admonition which I shall give thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said, take now thy son,.... Directly, immediately; not thine ox, nor thy sheep, nor thy ram, nor thy lamb, nor thy servant, but thy son: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thine only son Isaac; for, though Ishmael was his son, he was a son by his maid, by his concubine, and not by his wife; Isaac was his only legitimate son, his only son by his lawful wife Sarah; the only son of the promise, his only son, in whom his seed was to be called: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whom thou lovest; on whom his affections were strongly set, being a lovely youth, a dutiful son, and the child of promise; on whom all his hope and expectation of a numerous offspring promised him was built, and in whose line the Messiah was to spring from him; even Isaac, which stands last in the original text: so that, if what had been said was not sufficient to describe him, he is expressed by name, and the description is gradually given, and the name of his son reserved to the last, that he might be by degrees prepared to receive the shocking order; every word is emphatic and striking, and enough to pierce any tender heart, and especially when told what was to be done to him. The Jews (i) represent God and Abraham in a discourse together upon this head: God said, take now thy son; says Abraham, I have two sons; take thine only son; says he, they are both only sons to their mothers; take him whom thou lovest; I love them both, replied he; then take Isaac; thus ended the debate: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and get thee into the land of Moriah; so called by anticipation, from a mountain of that name in it; the Septuagint render it, \"the high land\", the hill country of the land of Canaan, particularly that part of it where Jerusalem afterwards stood, which was surrounded with hills: hence Aquila, another Greek interpreter, renders it, \"conspicuous\", as hills and mountains are, and a mountainous country is; Onkelos and Jonathan paraphrase it, \"a land of worship\", of religious worship; for in this country afterwards the people of God dwelt, the city of the living God was built, and in it the temple for divine service, and that upon Mount Moriah; and the Targum of Jerusalem has it here,\"to Mount Moriah;''the Jews are divided about the reason of this name, some deriving it from a word (k) which signifies to \"teach\", and think it is so called, because doctrine or instruction came forth from thence to Israel; others from a word (l) which signifies \"fear\", and so had its name because fear or terror went from thence to the nations of the world (m); but its derivation is from another word (n), which signifies to \"see\", and which is confirmed by what is said Genesis 22:14, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and get thee into the land of Moriah; so called by anticipation, from a mountain of that name in it; the Septuagint render it, \"the high land\", the hill country of the land of Canaan, particularly that part of it where Jerusalem afterwards stood, which was surrounded with hills: hence Aquila, another Greek interpreter, renders it, \"conspicuous\", as hills and mountains are, and a mountainous country is; Onkelos and Jonathan paraphrase it, \"a land of worship\", of religious worship; for in this country afterwards the people of God dwelt, the city of the living God was built, and in it the temple for divine service, and that upon Mount Moriah; and the Targum of Jerusalem has it here,\"to Mount Moriah;''the Jews are divided about the reason of this name, some deriving it from a word (k) which signifies to \"teach\", and think it is so called, because doctrine or instruction came forth from thence to Israel; others from a word (l) which signifies \"fear\", and so had its name because fear or terror went from thence to the nations of the world (m); but its derivation is from another word (n), which signifies to \"see\", and which is confirmed by what is said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and offer him there for a burnt offering; this was dreadful work he was called to, and must be exceeding trying to him as a man, and much more as a parent, and a professor of the true religion, to commit such an action; for by this order he was to cut the throat of his son, then to rip him up, and cut up his quarters, and then to lay every piece in order upon the wood, and then burn all to ashes; and this he was to do as a religious action, with deliberation, seriousness, and devotion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "upon one of the mountains which I will tell thee of; for there were several of them adjoining to, or pretty near each other, which afterwards went by different names, as Mount Sion, Deuteronomy 4:48; the hill Acra; Mount Calvary, Luke 23:33; and Mount Moriah, 2 Chronicles 3:1; supposed to be the mount intended; and so Aben Ezra says it was the place where the temple was built, and where was the threshing floor of Araunah, 2 Chronicles 3:1. Some learned men are of opinion, that the account which Sanchoniatho (o) gives of Cronus or Saturn sacrificing his own son, refers to this affair of Abraham's; his words are,\"there being a pestilence and a mortality, Cronus offered up his only son a whole burnt offering to his father Ouranus;''which Porphyry (p), from the same historian, thus relates; Cronus, whom the Phoenicians call Israel, (a grandson of Abraham's, thought, through mistake, to be put for Abraham himself,) having an only son of a nymph of that country called Anobret, (which according to Bochart (q) signifies one that conceived by grace, see Hebrews 11:11;) whom therefore they called Jeoud (the same with Jehid here, an only once); so an only one is called by the Phoenicians; when the country was in great danger through war, this son, dressed in a royal habit, he offered up on an altar he had prepared. But others (r) are of a different sentiment, and cannot perceive any likeness between the two cases: however, Isaac may well be thought, in the whole of this, to be a type of the Messiah, the true and proper Son of God, his only begotten Son, the dear Son of his love, in whom all the promises are yea and amen; whom God out of his great love to men gave to be an offering and a sacrifice for their sins, and who suffered near Jerusalem, on Mount Calvary, which very probably was a part of Mount Moriah; and which, with other mountains joining in their root, though having different tops, went by that common name. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "upon one of the mountains which I will tell thee of; for there were several of them adjoining to, or pretty near each other, which afterwards went by different names, as Mount Sion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the hill Acra; Mount Calvary, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Mount Moriah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; supposed to be the mount intended; and so Aben Ezra says it was the place where the temple was built, and where was the threshing floor of Araunah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Some learned men are of opinion, that the account which Sanchoniatho (o) gives of Cronus or Saturn sacrificing his own son, refers to this affair of Abraham's; his words are,\"there being a pestilence and a mortality, Cronus offered up his only son a whole burnt offering to his father Ouranus;''which Porphyry (p), from the same historian, thus relates; Cronus, whom the Phoenicians call Israel, (a grandson of Abraham's, thought, through mistake, to be put for Abraham himself,) having an only son of a nymph of that country called Anobret, (which according to Bochart (q) signifies one that conceived by grace, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ";) whom therefore they called Jeoud (the same with Jehid here, an only once); so an only one is called by the Phoenicians; when the country was in great danger through war, this son, dressed in a royal habit, he offered up on an altar he had prepared. But others (r) are of a different sentiment, and cannot perceive any likeness between the two cases: however, Isaac may well be thought, in the whole of this, to be a type of the Messiah, the true and proper Son of God, his only begotten Son, the dear Son of his love, in whom all the promises are yea and amen; whom God out of his great love to men gave to be an offering and a sacrifice for their sins, and who suffered near Jerusalem, on Mount Calvary, which very probably was a part of Mount Moriah; and which, with other mountains joining in their root, though having different tops, went by that common name. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) T. Bab. Sanhedrin, fol. 89. 2. Pirke Eliezer, c. 31. Jarchi in loc. (k) \"docuit\". (l) \"timuit\". (m) T. Bab. Taanith, fol. 16. 1.((n) \"vidit\". (o) Apud Euseb. Evangel. Praeparat. p. 38. (p) Apud ib. p. 40. & l. 4. c. 15. p. 156. (q) Canaan, l. 2. c. 2. col. 711, 712. (r) See Cumberland's Sanchoniatho, p. 37, 38, 134, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) T. Bab. Sanhedrin, fol. 89. 2. Pirke Eliezer, c. 31. Jarchi in loc. (k) \"docuit\". (l) \"timuit\". (m) T. Bab. Taanith, fol. 16. 1.((n) \"vidit\". (o) Apud Euseb. Evangel. Praeparat. p. 38. (p) Apud ib. p. 40. & l. 4. c. 15. p. 156. (q) Canaan, l. 2. c. 2. col. 711, 712. (r) See Cumberland's Sanchoniatho, p. 37, 38, 134, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said, Take now thy son, thine only son Isaac, whom thou lovest, and get thee into the land of {a} Moriah; and {b} offer him there for a burnt offering upon one of the mountains which I will tell thee of.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he said, Take now thy son, thine only ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "son",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Isaac, whom thou lovest, and get thee into the land of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Moriah; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " offer him there for a burnt offering upon one of the mountains which I will tell thee of.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Signifying the fear of God, in which place he was also honoured, Solomon later building the temple there.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) This was the main point of his temptation, seeing that he was commanded to offer up him in whom God had promised to bless all the nations of the world.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Observe the cumulative force of the successive words, “thy son,” “only son,” “whom thou lovest,” “Isaac,” indicating the severity of the test about to be applied to Abraham’s faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "only son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Ishmael is here disregarded, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 22:12; Genesis 22:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". He is no longer considered one of the true family. The LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν ἀγαπητόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unigenitum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is, however, perhaps due to the thought of Ishmael.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "into the land of Moriah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Moriah is here the name of a country, containing mountains on one of which Abraham is to offer Isaac. The proper name “Moriah” is found elsewhere only in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “in Mount Moriah,” i.e. the hill in Jerusalem, on which was the threshing-floor of Ornan, the Jebusite, where the Angel appeared to David. This was the site of the Temple of Solomon. Obviously the expression, “the land of Moriah,” and the reference to the mountains in it, cannot here denote Jerusalem. Jerusalem was a town in the days of the patriarchs (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). More probably the Chronicler, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", has recorded the popular tradition of his own time, according to which the scene of the appearance to David and the site of the temple at Jerusalem were identified with the place of Isaac’s sacrifice; and the name “Moriah,” occurring in this passage of Genesis was therefore popularly, although inaccurately, assigned to the Temple hill.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "What “the land of Moriah” was, we can no longer determine. Possibly the word “Moriah” is the Heb. adaptation of some earlier name, which was lost in the transmission of the story. The name Moriah probably contains a play upon the words meaning “to see” and “Jehovah,” cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 22:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". It provided a puzzle to the versions. Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "terra visionis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Sym. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γῆ ὀπτασίας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Aq. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν γῆν τὴν καταφανῆ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν γῆν τὴν ὑψηλήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Syriac Peshitto renders, “the land of the Amorites,” with which agrees the conjecture of Dillmann and Ball. Tuch and Bleek conjectured “the land of Moreh,” cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the Hebron district of “the land of Moreh” would be much too close to Beer-sheba to suit the description in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 22:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hence Wellhausen’s conjecture “the land of the Hamorites” (i.e. Shechem: cf. Genesis 34 and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Probably the name is irrecoverable by conjecture. Rabbinic interpretations called it “the place of fear,” or “of worship.” Joseph. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". i. § 13, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ Μόριον ὅρος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for a burnt offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A whole burnt-offering, viz. an offering of complete dedication to God. It was wholly consumed in the fire, as distinct from an offering in which the offerers themselves participated: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was a propitiatory offering: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he said, Take",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " now - \"the ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נַא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " modifies the command, and seems to express that Elohim wished to receive the sacrifice as a free-will offering\" (Lange) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "thy son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (not a lamb, but thy child), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "thine only son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἁγαπητὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX.), but ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "unigenitum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Vulgate), meaning the only son of Sarah, the only legitimate offspring he possessed, the only heir of the promise, the only child that remained to him after Ishmael's departure (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὁ μονογενὴς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Isaac, whom thou lovest,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "whom thou lovest, Isaac",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the order and accumulation of the terms being calculated to excite the parental affection of the patriarch to the highest pitch, and to render compliance with the Divine demand a trial of the utmost severity - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and get thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "go for thyself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "into the land of Moriah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Moriah -  vision (Vulgate, Symmachus, Samaritan), worship (Onkelos, Jonathan), high (LXX.), rebellious (Murphy); but rather a compound of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מֹרִי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", meaning God is my instructor, alluding to the temple from which the law should afterwards proceed (Kalisch), or, better, of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ראה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and signifying \"the shown of Jehovah,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the revelation or manifestation of Jehovah (Hengstenberg, Kurtz, Keil, &e.); or \"the chosen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"pointed out of God,\" with reference to its selection as the site of the Divine sanctuary (Gesenius), or rather because there God provided and pointed out the sacrifice which he elected to accept (Lange). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And offer him there for a burnt offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - not make a spiritual surrender of him in and through a burnt offering (Hengstenberg, Lange), but actually present him as a holocaust. That Abraham did not stagger on receiving this astounding injunction may be accounted for by remembering that the practice of offering human sacrifices prevailed among the early Chaldaeans and Canaanites, and that as yet no formal prohibition, like that of the Mosaic code, had been issued against them - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "upon one of the mountains",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - not Moreh in Sicbem (Tuch, Michaelis, Stanley, Grove, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et alii",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which was too distant, but Moriah at Jerusalem (Hengstenberg, Kurtz, Keil, Kalisch), where subsequently God appeared to David (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 24:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the temple of Solomon was built (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "which I will tell thee of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " -  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " point out (probably by secret inspiration) as thou proceedest. Genesis 22:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Offering Up of Isaac. - For many years had Abraham waited to be fulfilled. At length the Lord had given him the desired heir of his body by his wife Sarah, and directed him to send away the son of the maid. And now that this son had grown into a young man, the word of God came to Abraham to offer up this very son, who had been given to him as the heir of the promise, for a burnt-offering, upon one of the mountains which should be shown him. This word did not come from his own heart, - was not a thought suggested by the sight of the human sacrifices of the Canaanites, that he would offer a similar sacrifice to his God; nor did it originate with the tempter to evil. The word came from Ha-Elohim, the personal, true God, who tried him (נסּה), i.e., demanded the sacrifice of the only, beloved son, as a proof and attestation of his faith. The issue shows, that God did not desire the sacrifice of Isaac by slaying and burning him upon the altar, but his complete surrender, and a willingness to offer him up to God even by death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nevertheless the divine command was given in such a form, that Abraham could not understand it in any other way than as requiring an outward burnt-offering, because there was no other way in which Abraham could accomplish the complete surrender of Isaac, than by an actual preparation for really offering the desired sacrifice. This constituted the trial, which necessarily produced a severe internal conflict in his mind. Ratio humana simpliciter concluderet aut mentiri promissionem aut mandatum non esse Dei sed Diaboli; est enim contradictio manifesta. Si enim debet occidi Isaac, irrita est promissio; sin rata est promissio, impossibile est hoc esse Dei mandatum (Luther). But Abraham brought his reason into captivity to the obedience of faith. He did not question the truth of the word of God, which had been addressed to him in a mode that was to his mind perfectly infallible (not in a vision of the night, however, of which there is not a syllable in the text), but he stood firm in his faith, \"accounting that god was able to raise him up, even from the dead\" Hebrews 11:19). Without taking counsel with flesh and blood, Abraham started early in the morning (Genesis 22:3, Genesis 22:4), with his son Isaac and two servants, to obey the divine command; and on the third day (for the distance from Beersheba to Jerusalem is about 20 1/2 hours; Rob. Pal. iii. App. 66, 67) he saw in the distance the place mentioned by God, the land of Moriah, i.e., the mountainous country round about Jerusalem. The name מריּה, composed of the Hophal partic. of ראה and the divine name יה, an abbreviation of יהוה (lit., \"the shown of Jehovah,\" equivalent to the manifestation of Jehovah), is no doubt used proleptically in Genesis 22:2, and given to the mountain upon which the sacrifice was to be made, with direct reference to this event and the appearance of Jehovah to Abraham there. This is confirmed by Genesis 22:14, where the name is connected with the event, and explained in the fuller expression Jehovah-jireh. On the ground of this passage the mountain upon which Solomon built the temple is called המּריּה with reference to the appearance of the angel of the Lord to David on that mountain at the threshing-floor of Araunah (2 Samuel 24:16-17), the old name being revived by this appearance. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Nevertheless the divine command was given in such a form, that Abraham could not understand it in any other way than as requiring an outward burnt-offering, because there was no other way in which Abraham could accomplish the complete surrender of Isaac, than by an actual preparation for really offering the desired sacrifice. This constituted the trial, which necessarily produced a severe internal conflict in his mind. Ratio humana simpliciter concluderet aut mentiri promissionem aut mandatum non esse Dei sed Diaboli; est enim contradictio manifesta. Si enim debet occidi Isaac, irrita est promissio; sin rata est promissio, impossibile est hoc esse Dei mandatum (Luther). But Abraham brought his reason into captivity to the obedience of faith. He did not question the truth of the word of God, which had been addressed to him in a mode that was to his mind perfectly infallible (not in a vision of the night, however, of which there is not a syllable in the text), but he stood firm in his faith, \"accounting that god was able to raise him up, even from the dead\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Without taking counsel with flesh and blood, Abraham started early in the morning (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), with his son Isaac and two servants, to obey the divine command; and on the third day (for the distance from Beersheba to Jerusalem is about 20 1/2 hours; Rob. Pal. iii. App. 66, 67) he saw in the distance the place mentioned by God, the land of Moriah, i.e., the mountainous country round about Jerusalem. The name מריּה, composed of the Hophal partic. of ראה and the divine name יה, an abbreviation of יהוה (lit., \"the shown of Jehovah,\" equivalent to the manifestation of Jehovah), is no doubt used proleptically in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and given to the mountain upon which the sacrifice was to be made, with direct reference to this event and the appearance of Jehovah to Abraham there. This is confirmed by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the name is connected with the event, and explained in the fuller expression Jehovah-jireh. On the ground of this passage the mountain upon which Solomon built the temple is called המּריּה with reference to the appearance of the angel of the Lord to David on that mountain at the threshing-floor of Araunah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 24:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the old name being revived by this appearance. ",
            "children": []
          }
        ]
      }
    ]
  }
]