[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Faint.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That fair virgins and strong brave youths should faint by reason of their raging thirst suggests that the less vigorous would suffer even more keenly. It is sad when old men stumble into the darkness of unbelief amid the shining of the noon-day sun, seeing that they can remember the brightness of their morning, but there is always hope that their child-like spirit may return to them, and that at the evening time it may be light; but if fair virgins and strong youths are covered with the inward veil, what will become of them in their westering days? and where will the elders be if they have had no youth?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:11-14 Here was a token of God's highest displeasure. At any time, and most in a time of trouble, a famine of the word of God is the heaviest judgment. To many this is no affliction, yet some will feel it very much, and will travel far to hear a good sermon; they feel the loss of the mercies others foolishly sin away. But when God visits a backsliding church, their own plans and endeavours to find out a way of salvation, will stand them in no stead. And the most amiable and zealous would perish, for want of the water of life, which Christ only can bestow. Let us value our advantages, seek to profit by them, and fear sinning them away.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In this hopelessness as to all relief, those too shall fail and sink under their sufferings, in whom life is freshest and strongest and hope most buoyant. Hope mitigates any sufferings. When hope is gone, the powers of life, which it sustains, give way. \"They shall faint for thirst,\" literally, \"shall be mantled over, covered\" , as, in fact, one fainting seems to feel as if a veil came over his brow and eyes. \"Thirst,\" as it is an intenser suffering than bodily hunger, includes sufferings of body and mind. If even over those, whose life was firmest, a veil came, and they fainted for thirst, what of the rest? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. faint for thirst—namely, thirst for hearing the words of the Lord, being destitute of all other comfort. If even the young and strong faint, how much more the infirm (Isa 40:30, 31)!",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It is probable these in their strength and rigour would seek earnestly to know what end they might expect, whether they should outlive this famine of the word, and the famine of bread and water, but both should faint with thirst and hunger; neither finding the word of the Lord for their comfort, they should faint with despair, nor finding bread and water, should faint and die with weakness: so Israel should be extinguished. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In that day shall the fair virgins and young men faint for thirst. After the word, for want of that grain and wine, which make young men and maids cheerful, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but, being destitute of them, should be covered with sorrow, overwhelmed with grief, and ready to sink and die away. These, according to some, design the congregation of Israel; who are like to beautiful virgins, as the Targum paraphrases it; and the principal men of it, the masters of the assemblies: or, as others, such who were trusting to their own righteousness, and seeking after that which they could never attain justification by, and did not hunger and thirst after the righteousness of Christ, and so perished. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "In that day shall the fair virgins and young men faint for thirst.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the day of agony and distress then coming upon Israel, the young men and fair maidens, the strength and pride of the population, will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "faint for thirsty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", exhausted by the privations of a siege, or the sufferings involved in the sack of a city by the foe (cf. especially ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 2:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - This verse is parallel to the preceding. The thirst, spiritual and physical, shall affect ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the fair virgins and young men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - those in all the freshness, beauty, and vigour of youth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall faint;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall be veiled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", covered, expressive of the feeling of faintness, when the sight grows dim and a mantle of darkness drops over one (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If the strongest thus fail, much more will the rest succumb to the threatened calamity. Amos 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"In that day will the fair virgins and the young men faint for thirst. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They who swear by the guilt of Samaria, and say, By the life of thy God, O Dan! and by the life of the way to Beersheba; and will fall, and not rise again.\" Those who now stand in all the fullest and freshest vigour of life, will succumb to this hunger and thirst. The virgins and young men are individualized, as comprising that portion of the nation which possessed the vigorous fulness of youth. עלף, to be enveloped in night, to sink into a swoon, hithp. to hide one's self, to faint away. הנּשׁבּעים refers to the young men and virgins; and inasmuch as they represent the most vigorous portion of the nation, to the nation as a whole. If the strongest succumb to the thirst, how much more the weak! 'Ashmath Shōmerōn, the guilt of Samaria, is the golden calf at Bethel, the principal idol of the kingdom of Israel, which is named after the capital Samaria (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the sin of Israel\"), not the Asherah which was still standing in Samaria in the reign of Jehoahaz (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for apart from the question whether it was there in the time of Jeroboam, this is at variance with the second clause, in which the manner of their swearing is given, - namely, by the life of the god at Dan, that is to say, the golden calf that was there; so that the guilt of Samaria can only have been the golden calf at Bethel, the national sanctuary of the ten tribes (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The way to Beersheba is mentioned, instead of the worship, for the sake of which the pilgrimage to Beersheba was made. This worship, again, was not a purely heathen worship, but an idolatrous worship of Jehovah (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The fulfilment of these threats commenced with the destruction of the kingdom of Israel, and the carrying away of the ten tribes into exile in Assyria, and continues to this day in the case of that portion of the Israelitish nation which is still looking for the Messiah, the prophet promised by Moses, and looking in vain, because they will not hearken to the preaching of the gospel concerning the Messiah, who appeared as Jesus. ",
        "children": []
      }
    ]
  }
]