[{"header":"David in Old Age"},{"num":1,"verse":"Now King David was old, advanced in years; they covered him with clothes, but he could not get warm. "},{"num":2,"verse":"So his servants said to him, “Let a young virgin be found for my lord the king and let her attend him and become his nurse; let her lie against your chest, so that my lord the king may feel warm.” "},{"num":3,"verse":"So they searched for a beautiful girl throughout the territory of Israel, and found Abishag the Shunammite, and brought her to the king. "},{"num":4,"verse":"The girl was very beautiful; and she became the king’s nurse and served him, but the king was not intimate with her."},{"num":5,"verse":"Then Adonijah the son of [David’s wife] Haggith exalted himself, saying, “I [the eldest living son] will be king.” So [following Absalom’s example] he prepared for himself chariots and horsemen, and fifty men to run before him. "},{"num":6,"verse":"His father [David] had never rebuked him at any time by asking, “Why have you done this?” Adonijah was also a very handsome man, and he was born after Absalom. "},{"num":7,"verse":"He had conferred with Joab the son of Zeruiah [David’s half sister] and with Abiathar the priest; and they followed Adonijah and helped him. "},{"num":8,"verse":"But Zadok the priest, Benaiah the son of Jehoiada, Nathan the prophet, Shimei, Rei, and David’s most formidable warriors did not side with Adonijah [in his desire to become king]."},{"num":9,"verse":"Adonijah sacrificed sheep and oxen and fattened steers by the Stone of Zoheleth, which is beside [the well] En-rogel; and he invited all his brothers, the king’s sons, and all the men of Judah, the king’s servants [to this feast]. "},{"num":10,"verse":"But he did not invite Nathan the prophet, Benaiah, the most formidable warriors, or his brother Solomon."},{"header":"Nathan and Bathsheba"},{"num":11,"verse":"Then Nathan spoke to Bathsheba the mother of Solomon, “Have you not heard that Adonijah the son of Haggith has become king, and David our lord does not know about it? "},{"num":12,"verse":"Come now, please let me advise you and save your life and the life of your son Solomon. "},{"num":13,"verse":"Go at once to King David and say to him, ‘Did you not, my lord, O king, swear to your maidservant, saying, “Solomon your son shall certainly be king after me, and he shall sit on my throne”? Why then has Adonijah become king?’ "},{"num":14,"verse":"Behold, while you are still there speaking with the king, I will come in after you and confirm your words.”"},{"num":15,"verse":"So Bathsheba went to the king in his bedroom. Now the king was very old and weak, and Abishag the Shunammite was attending the king. "},{"num":16,"verse":"So Bathsheba bowed down and paid respect to the king. And the king said, “What do you wish?” "},{"num":17,"verse":"She said to him, “My lord, you swore by the Lord your God to your maidservant, saying, ‘Solomon your son shall certainly be king after me and he shall sit on my throne.’ "},{"num":18,"verse":"But now, behold, Adonijah is [acting as] king; and now [as things stand], my lord the king, you do not know it. "},{"num":19,"verse":"He has sacrificed oxen and fattened steers and sheep in abundance, and has invited all the king’s sons and Abiathar the priest and Joab the commander of the army [to a feast], but he did not invite your servant Solomon. "},{"num":20,"verse":"Now as for you, my lord the king, the eyes of all Israel are on you [waiting for you] to tell them who shall sit on the throne of my lord the king after him. "},{"num":21,"verse":"Otherwise it will come about when my lord the king lies down [in death] with his fathers, that I and my son Solomon will be considered political enemies.”"},{"num":22,"verse":"While she was still speaking with the king, Nathan the prophet came in. "},{"num":23,"verse":"The king was told, “Here is Nathan the prophet.” And when he came before the king, he bowed before the king with his face to the ground. "},{"num":24,"verse":"Then Nathan said, “My lord the king, have you said, ‘Adonijah shall be king after me, and he shall sit on my throne’? "},{"num":25,"verse":"Because he has gone down today [to En-Rogel] and has sacrificed oxen and fattened steers and sheep in abundance, and has invited all the king’s sons, the commanders of the army and Abiathar the priest [to this feast]; and [right now] they are eating and drinking in his presence; and they say, ‘Long live King Adonijah!’ "},{"num":26,"verse":"But he has not invited me, your servant, nor Zadok the priest, nor Benaiah the son of Jehoiada, nor your servant Solomon. "},{"num":27,"verse":"If this thing has been done by my lord the king, why have you not shown your servants who shall sit on the throne of my lord the king after him?”"},{"num":28,"verse":"King David answered, “Call Bathsheba to me.” And she came into the king’s presence and stood before him. "},{"num":29,"verse":"Then the king swore an oath and said, “As the Lord lives, who has redeemed my soul from all distress, "},{"num":30,"verse":"even as I swore to you by the Lord, the God of Israel, saying, ‘Solomon your son shall certainly be king after me, and he shall sit on my throne in my place’; I will indeed do so this very day.” "},{"num":31,"verse":"Bathsheba bowed down with her face to the ground, and laid herself face down before the king and said, “May my lord King David live forever!”"},{"num":32,"verse":"Then King David said, “Call Zadok the priest, Nathan the prophet, and Benaiah the son of Jehoiada to me.” And they came before the king. "},{"num":33,"verse":"The king told them, “Take the servants of your lord with you and have Solomon my son ride on my own mule, and bring him down to [the spring at] Gihon [in the Kidron Valley]. "},{"num":34,"verse":"Let Zadok the priest and Nathan the prophet anoint him there as king over Israel. Then blow the trumpet and say, ‘Long live King Solomon!’ "},{"num":35,"verse":"Then you shall come up [to Jerusalem] after him, and he shall come and sit on my throne and he shall reign as king in my place; for I have appointed him to be ruler over Israel and Judah.” "},{"num":36,"verse":"Benaiah [the overseer of the king’s bodyguards], the son of Jehoiada answered the king and said, “Amen! (So be it!) May the Lord, the God of my lord the king, say so too. "},{"num":37,"verse":"Just as the Lord has been with my lord the king, so may He be with Solomon, and make his throne greater than the throne of my lord King David!”"},{"header":"Solomon Anointed King"},{"num":38,"verse":"So Zadok the priest, Nathan the prophet, Benaiah the son of Jehoiada, the Cherethites, and the Pelethites [the king’s bodyguards] went down [from Jerusalem] and had Solomon ride on King David’s mule, and brought him to [the spring at] Gihon. "},{"num":39,"verse":"Zadok the priest took a horn of [olive] oil from the [sacred] tent and anointed Solomon. They blew the trumpet, and all the people said, “Long live King Solomon!” "},{"num":40,"verse":"All the people went up after him, and they were playing on flutes and rejoicing with great joy, so that the earth shook and seemed to burst open with their [joyful] sound."},{"num":41,"verse":"Now Adonijah and all the guests who were with him heard it as they finished eating. When Joab heard the trumpet sound, he said, “Why is the city in such an uproar?” "},{"num":42,"verse":"While he was still speaking, behold, Jonathan the son of Abiathar the priest arrived. And Adonijah said, “Come in, for you are a valiant and trustworthy man and you bring good news.” "},{"num":43,"verse":"But Jonathan replied to Adonijah, “No, on the contrary, our lord King David has made Solomon king! "},{"num":44,"verse":"The king has sent him with Zadok the priest, Nathan the prophet, Benaiah the son of Jehoiada, the Cherethites, and the Pelethites; and they have had him ride on the king’s [own royal] mule. "},{"num":45,"verse":"Also, Zadok the priest and Nathan the prophet have anointed him king in Gihon, and they have come up from there celebrating, so the city is in an uproar. This is the noise which you have heard. "},{"num":46,"verse":"Besides, Solomon has taken his seat on the throne of the kingdom. "},{"num":47,"verse":"Moreover, the king’s servants came to bless (congratulate) our lord King David, saying, ‘May your God make the name of Solomon better (more famous) than your name and make his throne greater than your throne.’ And the king bowed himself [before God] upon the bed. "},{"num":48,"verse":"The king has also said this: ‘Blessed be the Lord, the God of Israel, who has granted one [of my descendants] to sit on my throne today and allowed my eyes to see it.’”"},{"num":49,"verse":"Then all Adonijah’s guests were terrified [of being branded as traitors] and stood up and left the feast, and each one went on his way. "},{"num":50,"verse":"And Adonijah feared Solomon, and he got up and went [to the tabernacle on Mt. Zion] and took hold of the horns of the altar [seeking asylum]. "},{"num":51,"verse":"Now Solomon was told, “Behold, Adonijah is afraid of King Solomon, and behold, he has grasped the horns of the altar [seeking God’s protection], saying, ‘King Solomon must swear to me today that he will not kill his servant with the sword.’” "},{"num":52,"verse":"Solomon said, “If he [proves he] is a worthy man, not even one of his hairs shall fall to the ground; but if wickedness is found in him, he shall die.” "},{"num":53,"verse":"So King Solomon sent [soldiers], and they brought Adonijah down from the altar [that was in front of the tabernacle]. And he came and bowed down to King Solomon, and Solomon said to him, “Go to your house.”"}]