[{"num":1,"verse":"And King David was old and advanced in years; they covered him with [bed]clothes, but he could not get warm."},{"num":2,"verse":"So his servants [the physicians] said to him, Let there be sought for my lord the king a young virgin, and let her wait on and be useful to the king; let her lie in your bosom, that my lord the king may get warm."},{"num":3,"verse":"So they sought a fair maiden through all the territory of Israel and found Abishag the Shunammite, and brought her to the king."},{"num":4,"verse":"The maiden was beautiful; and she waited on and nursed him. But the king had no intercourse with her."},{"num":5,"verse":"Then Adonijah son of [David’s wife] Haggith exalted himself, saying, I [the eldest living son] will be king. And he prepared for himself chariots and horsemen, with fifty men to run before him."},{"num":6,"verse":"David his father had never in his life displeased him by asking, Why have you done so? He was also a very attractive man and was born after Absalom."},{"num":7,"verse":"He conferred with Joab son of Zeruiah [David’s half sister] and with Abiathar the priest, and they followed Adonijah and helped him."},{"num":8,"verse":"But Zadok the priest, Benaiah son of Jehoiada, Nathan the prophet, Shimei, Rei, and David’s mighty men did not side with Adonijah."},{"num":9,"verse":"Adonijah sacrificed sheep, oxen, and fatlings by the Stone of Zoheleth, which is beside [the well] En-rogel; and he invited all his brothers, the king’s sons, and all the royal officials of Judah."},{"num":10,"verse":"But Nathan the prophet, Benaiah, the mighty men, and Solomon his brother he did not invite."},{"num":11,"verse":"Then Nathan said to Bathsheba the mother of Solomon, Have you not heard that Adonijah, the son of Haggith, reigns and David our lord does not know it?"},{"num":12,"verse":"Come now, let me advise you how to save your own life and your son Solomon’s."},{"num":13,"verse":"Go to King David and say, Did you not, my lord, O king, swear to your handmaid, saying, Assuredly Solomon your son shall reign after me, and he shall sit upon my throne? Why then does Adonijah reign?"},{"num":14,"verse":"Behold, while you are still talking there with the king, I also will come in after you and confirm your words."},{"num":15,"verse":"So Bathsheba went in to the king in his chamber. Now the king was very old and feeble, and Abishag the Shunammite was ministering to [him]."},{"num":16,"verse":"Bathsheba bowed and did obeisance to the king. The king said, What do you wish?"},{"num":17,"verse":"And she said to him, My lord, you swore by the Lord your God to your handmaid, saying, Assuredly Solomon your son shall reign after me and sit upon my throne."},{"num":18,"verse":"And now, behold, Adonijah is reigning, and, my lord the king, you do not know it."},{"num":19,"verse":"He has sacrificed oxen and fatlings and sheep in abundance, and has invited all the king’s sons and Abiathar the priest and Joab the commander of the army. But he did not invite Solomon your servant."},{"num":20,"verse":"Now, my lord O king, the eyes of all Israel are on you, to tell who shall sit on the throne of my lord the king after you."},{"num":21,"verse":"Otherwise, when my lord the king shall sleep with his fathers, I and my son Solomon shall be counted as offenders."},{"num":22,"verse":"While she was still talking with the king, Nathan the prophet also came in."},{"num":23,"verse":"The king was told, Here is Nathan the prophet. And when he came before the king, he bowed himself before him with his face to the ground."},{"num":24,"verse":"And Nathan said, My lord the king, have you said, Adonijah shall reign after me, and he shall sit on my throne?"},{"num":25,"verse":"He has gone this day and sacrificed oxen, fatlings, and sheep in abundance, and has invited all the king’s sons, the captains of the host, and Abiathar the priest; and they eat and drink before him and say, Long live King Adonijah!"},{"num":26,"verse":"But me your servant, and Zadok the priest, and Benaiah son of Jehoiada, and your servant Solomon he has not invited."},{"num":27,"verse":"Is this done by my lord the king and you have not shown your servants who shall succeed my lord the king?"},{"num":28,"verse":"Then King David answered, Call Bathsheba. And she came into the king’s presence and stood before him."},{"num":29,"verse":"And the king took an oath and said, As the Lord lives, Who has redeemed my soul out of all distress,"},{"num":30,"verse":"Even as I swore to you by the Lord, the God of Israel, saying, Assuredly Solomon your son shall reign after me, and he shall sit upon my throne in my stead—even so will I certainly do this day."},{"num":31,"verse":"Bathsheba bowed with her face to the ground and did obeisance to the king and said, Let my lord King David live forever!"},{"num":32,"verse":"King David said, Call Zadok the priest, Nathan the prophet, and Benaiah son of Jehoiada. And they came before the king."},{"num":33,"verse":"The king told them, Take the servants of your lord and cause Solomon my son to ride on my own mule and bring him down to Gihon [in the Kidron Valley]."},{"num":34,"verse":"And let Zadok the priest and Nathan the prophet anoint him there king over Israel. Then blow the trumpet and say, Long live King Solomon!"},{"num":35,"verse":"Then you shall come up after him, and he shall come and sit on my throne, for he shall be king in my stead; I have appointed him ruler over Israel and Judah."},{"num":36,"verse":"And Benaiah son of Jehoiada answered the king and said, Amen! May the Lord, the God of my lord the king, say so too."},{"num":37,"verse":"As the Lord has been with my lord the king, even so may He be with Solomon and make his throne greater than the throne of my lord King David."},{"num":38,"verse":"So Zadok the priest, Nathan the prophet, Benaiah son of Jehoiada, the Cherethites, and the Pelethites [the king’s bodyguards] went down and caused Solomon to ride upon King David’s mule and brought him to Gihon."},{"num":39,"verse":"Zadok the priest took a horn of oil out of the tent and anointed Solomon. They blew the trumpet and all the people said, Long live King Solomon!"},{"num":40,"verse":"All the people followed him; they played on pipes and rejoiced greatly, so that the earth [resounded] with the joyful sound."},{"num":41,"verse":"And Adonijah and all the guests with him heard it as they finished feasting. When Joab heard the trumpet sound, he said, What does this uproar in the city mean?"},{"num":42,"verse":"While he was still speaking, behold, Jonathan son of Abiathar the priest came. And Adonijah said, Come in, for you are a trustworthy man and bring good news."},{"num":43,"verse":"Jonathan replied, Adonijah, truly our lord King David has made Solomon king!"},{"num":44,"verse":"The king has sent him with Zadok the priest, Nathan the prophet, Benaiah son of Jehoiada, the Cherethites and the Pelethites, and they have caused him to ride upon the king’s mule."},{"num":45,"verse":"Zadok the priest and Nathan the prophet have anointed him king in Gihon; they have come up from there rejoicing, so the city resounds. This is the noise you heard."},{"num":46,"verse":"Solomon sits on the royal throne."},{"num":47,"verse":"Moreover, the king’s servants came to congratulate our lord King David, saying, May God make the name of Solomon better than your name and make his throne greater than your throne. And the king bowed himself upon the bed"},{"num":48,"verse":"And said, Blessed be the Lord, the God of Israel, Who has granted me to see one of my offspring sitting on my throne this day."},{"num":49,"verse":"And all the guests that were with Adonijah were afraid and rose up and went every man his way."},{"num":50,"verse":"And Adonijah feared because of Solomon, and arose and went [to the tabernacle tent on Mt. Zion] and caught hold of the horns of the altar [as a fugitive’s refuge]."},{"num":51,"verse":"And it was told Solomon, Behold, Adonijah fears King Solomon, for behold, he has caught hold of the horns of the altar, saying, Let King Solomon swear to me first that he will not slay his servant with the sword."},{"num":52,"verse":"Solomon said, If he will show himself to be a worthy man, not a hair of him shall fall to the ground; but if wickedness is found in him, he shall die."},{"num":53,"verse":"So King Solomon sent, and they brought Adonijah down from the altar [in front of the tabernacle]. He came and bowed himself to King Solomon, and Solomon said to him, Go to your house."}]