[{"header":"Adonijah’s Attempted Coup"},{"num":1,"verse":"When David had grown very old, they covered him with blankets, but he could not keep warm, "},{"num":2,"verse":"so his servants suggested to him, “Let’s look for a young virgin woman to take care of you, your majesty. She will be of use to you if you have her lie down near you so that your majesty may keep warm.” "},{"num":3,"verse":"So they conducted a search throughout the territory of Israel for a beautiful young woman, and Abishag the Shunammite was located and brought to the king. "},{"num":4,"verse":"The young woman was absolutely beautiful. She served the king and was very useful to him. The king was not sexually involved with her."},{"num":5,"verse":"Meanwhile, about this time Haggith’s son Adonijah began to seek a reputation for himself and decided, “I’m going to be king!” So he prepared chariots, cavalry, and 50 soldiers to serve as a security detail to guard him. "},{"num":6,"verse":"His father had never challenged him at any time during his life by asking him, “Why are you acting like this?” Adonijah was very handsome and had been born after Absalom. "},{"num":7,"verse":"He had the support of Zeruiah’s son Joab and of Abiathar the priest, who followed Adonijah and assisted him, "},{"num":8,"verse":"but Zadok the priest, Jehoiada’s son Benaiah, Nathan the prophet, Shimei, Rei, and David’s personal elite forces would have nothing to do with Adonijah."},{"num":9,"verse":"Adonijah sacrificed sheep, oxen, and fatted cattle by the Serpent Stone near En-rogel, inviting all of his relatives, the king’s sons, and all of the men of Judah who worked for the king, "},{"num":10,"verse":"but he did not invite Nathan the prophet, Benaiah, David’s personal elite forces, or his brother Solomon."},{"header":"Nathan and Bathsheba Confer about Adonijah"},{"num":11,"verse":"“Haven’t you heard?” Nathan asked Solomon’s mother Bathsheba. “Haggith’s son Adonijah has become king and David, our true king, isn’t aware of it. "},{"num":12,"verse":"If you listen to me, you’ll save your life and the life of your son Solomon. "},{"num":13,"verse":"Go right now to King David and ask him, ‘Your majesty, you promised your servant that “Your son Solomon will certainly become king after me and will sit on my throne,” didn’t you? So why has Adonijah become king?’ "},{"num":14,"verse":"Then, while you are still talking to the king, I’ll come in after you and verify your statement.”"},{"num":15,"verse":"So Bathsheba went to the king in his private room. Now the king was very old, and Abishag the Shunammite was attending to him. "},{"num":16,"verse":"Bathsheba knelt and bowed down to the king, and the king asked her, “What do you wish?”"},{"num":17,"verse":"“Your majesty,” she replied, “you promised your servant in the name of the Lord your God, ‘Your son Solomon will certainly become king after me and will sit on my throne.’ "},{"num":18,"verse":"Now look, Adonijah has become king, and your majesty is not aware of it. "},{"num":19,"verse":"Adonijah has sacrificed myriads of oxen, fattened cattle, and sheep, and he has invited all of the king’s sons, Abiathar the priest, and Joab the commander of the army, but he has not invited your servant Solomon. "},{"num":20,"verse":"And as for you, your majesty, everyone in Israel is looking to you to tell them who will sit on your majesty’s throne after you. "},{"num":21,"verse":"Otherwise, as soon as your majesty is laid to rest with his ancestors, my son Solomon and I will be branded as traitors.”"},{"num":22,"verse":"While she was still talking to the king, Nathan the prophet arrived. "},{"num":23,"verse":"They informed the king, “Nathan the prophet is here.”"},{"num":24,"verse":"and asked, “Your majesty, did you say ‘Adonijah will be king after me and will sit on my throne’? "},{"num":25,"verse":"Well now, he went down today and sacrificed lots of oxen, fattened cattle, and sheep, and has invited all the king’s sons, the army commanders, and Abiathar the priest. They’re having a party together and saying, ‘Long live King Adonijah!’ "},{"num":26,"verse":"Of course, he never invited me, Zadok the priest, Jehoiada’s son Benaiah, nor your servant Solomon. "},{"num":27,"verse":"Were you behind this, your majesty, without letting your servants know who would sit on your majesty’s throne after him?”"},{"header":"David Affirms Solomon as King"},{"num":28,"verse":"“Call Bathsheba for me,” King David replied. So she came in and stood in front of the king. "},{"num":29,"verse":"“As the Lord lives,” the king said with an oath, “who has redeemed me from all sorts of troubles, "},{"num":30,"verse":"I certainly did tell you in the name of the Lord God of Israel, ‘Your son Solomon will be king after me and will sit on my throne in my place.’ I’m certainly going to make this happen today!”"},{"num":31,"verse":"“King David,” Bathsheba said as she bowed low in front of the king with her face to the ground, “your majesty, may you live forever.”"},{"num":32,"verse":"“Get me Zadok the priest,” King David said, “along with Nathan the prophet, and Jehoiada’s son Benaiah.” So they were ushered into the king’s presence "},{"num":33,"verse":"and David addressed them. “Take your lord’s servants, have my son Solomon ride on my own mule, and take him down to Gihon. "},{"num":34,"verse":"Have Zadok the priest and Nathan the prophet anoint him there as king over Israel. Then sound a trumpet and declare ‘Long live King Solomon!’ "},{"num":35,"verse":"After this, you are to follow him back here, and he is to come and sit on my throne and take my place as king, because I’ve appointed him to be Commander-in-Chief over Israel and Judah.”"},{"num":36,"verse":"“Amen!” replied Jehoiada’s son Benaiah to the king. “May the Lord God of your majesty make this happen! "},{"num":37,"verse":"As the Lord has been with your majesty the king, so may he be with Solomon. May he make his throne greater than the throne of your majesty, King David.”"},{"header":"Solomon is Anointed King"},{"num":38,"verse":"So Zadok the priest, Nathan the prophet, Jehoiada’s son Benaiah, and the special forces and mercenaries went out and had Solomon ride the king’s mule all the way to Gihon. "},{"num":39,"verse":"Zadok the priest brought from his tent a horn filled with oil and anointed Solomon, a trumpet was sounded, and everybody yelled out, “Long live King Solomon!” "},{"num":40,"verse":"All the people followed after him, playing on wind pipes and so full of joy that the earth shook because of all the noise!"},{"num":41,"verse":"Right about then, Adonijah and all of his guests were just finishing their meal when they heard all the noise. “Why is the city in such an uproar?” Joab asked as he heard the trumpet sounds."},{"num":42,"verse":"While he was still asking that question, Jonathan, the son of Abiathar the priest arrived, so Adonijah told him, “Come on in, since you’re a worthy man and are bringing us good news!”"},{"num":43,"verse":"“No,” Jonathan answered. “Our lord King David has installed Solomon as king. "},{"num":44,"verse":"The king has sent Zadok the priest, Nathan the prophet, Jehoiada’s son Benaiah, and the special forces and mercenaries, along with Solomon, who is riding the king’s personal mule. "},{"num":45,"verse":"Zadok the priest and Nathan the prophet have anointed him in Gihon, and they just left from there rejoicing, and that’s why the city is all in an uproar. That’s the noise that you’ve been hearing! "},{"num":46,"verse":"Solomon now sits on the royal throne. "},{"num":47,"verse":"In addition to all of this, the king’s servants have come along to congratulate our lord King David. They’ve been telling David ‘May your God make Solomon’s reputation even more famous than yours, and may he make his throne greater than yours!’ The king has himself bowed in worship on his own bed "},{"num":48,"verse":"and said ‘Blessed be the Lord God of Israel, who has provided someone to sit on my throne today. I’ve seen it with my own eyes!’”"},{"num":49,"verse":"Terrified, all of Adonijah’s guests jumped up and ran away. "},{"num":50,"verse":"Afraid of Solomon, Adonijah also jumped up and headed straight for the horns of the altar."},{"num":51,"verse":"“Hey look!” somebody informed Solomon. “Adonijah is terrified of King Solomon! He’s gone out, grabbed hold of the horns of the altar, and now he’s begging King Solomon, ‘Swear to me that you won’t put your servant to death with a sword!’”"},{"num":52,"verse":"“If he’s done nothing wrong, not a hair of his head will be harmed,” Solomon replied. “But if we find evil in him, he’s a dead man.”"},{"num":53,"verse":"So King Solomon sent for him, and he was brought down from the altar. When he had arrived, he fell on his face in front of King Solomon, so Solomon told him, “Go home!”"}]