[{"header":"Adonijah Tries to Become King"},{"num":1,"verse":"At this time King David was very old, and although his servants covered him with blankets, he could not keep warm. "},{"num":2,"verse":"They said to him, “We will look for a young woman to care for you. She will lie close to you and keep you warm.” "},{"num":3,"verse":"After searching everywhere in Israel for a beautiful young woman, they found a girl named Abishag from Shunam and brought her to the king. "},{"num":4,"verse":"The girl was very beautiful, and she cared for the king and served him. But the king did not have sexual relations with her."},{"num":5,"verse":"Adonijah was the son of King David and Haggith, and he was very proud. “I will be the king,” he said. So he got chariots and horses for himself and fifty men for his personal bodyguard. "},{"num":6,"verse":"Now David had never interfered with Adonijah by questioning what he did. Born next after Absalom, Adonijah was a very handsome man."},{"num":7,"verse":"Adonijah spoke with Joab son of Zeruiah and Abiathar the priest, and they agreed to help him. "},{"num":8,"verse":"But Zadok the priest, Benaiah son of Jehoiada, Nathan the prophet, Shimei, Rei, and King David’s special guard did not join Adonijah."},{"num":9,"verse":"Then Adonijah killed some sheep, cows, and fat calves for sacrifices at the Stone of Zoheleth near the spring of Rogel. He invited all his brothers, the other sons of King David, to come, as well as all the men of Judah. "},{"num":10,"verse":"But Adonijah did not invite Nathan the prophet, Benaiah, his father’s special guard, or his brother Solomon."},{"num":11,"verse":"When Nathan heard about this, he went to Bathsheba, Solomon’s mother. “Have you heard that Adonijah, Haggith’s son, has made himself king?” Nathan asked. “Our real king, David, does not know it. "},{"num":12,"verse":"I strongly advise you to save yourself and your sons. "},{"num":13,"verse":"Go to King David and tell him, ‘My master and king, you promised that my son Solomon would be king and would rule on your throne after you. Why then has Adonijah become king?’ "},{"num":14,"verse":"While you are still talking to the king, I will come in and tell him that what you have said about Adonijah is true.”"},{"num":15,"verse":"So Bathsheba went in to see the aged king in his bedroom, where Abishag, the girl from Shunam, was caring for him. "},{"num":16,"verse":"Bathsheba bowed and knelt before the king. He asked, “What do you want?”"},{"num":17,"verse":"She answered, “My master, you made a promise to me in the name of the Lord your God. You said, ‘Your son Solomon will become king after me, and he will rule on my throne.’ "},{"num":18,"verse":"But now, unknown to you, Adonijah has become king. "},{"num":19,"verse":"He has killed many cows, fat calves, and sheep for sacrifices. And he has invited all your sons, as well as Abiathar the priest and Joab the commander of the army, but he did not invite Solomon, who serves you. "},{"num":20,"verse":"My master and king, all the Israelites are watching you, waiting for you to decide who will be king after you. "},{"num":21,"verse":"As soon as you die, Solomon and I will be treated as criminals.”"},{"num":22,"verse":"While Bathsheba was still talking with the king, Nathan the prophet arrived. "},{"num":23,"verse":"The servants told the king, “Nathan the prophet is here.” So Nathan went to the king and bowed facedown on the ground before him."},{"num":24,"verse":"Nathan said, “My master and king, have you said that Adonijah will be the king after you and that he will rule on your throne? "},{"num":25,"verse":"Today he has sacrificed many cows, fat calves, and sheep, and he has invited all your other sons, the commanders of the army, and Abiathar the priest. Right now they are eating and drinking with him. They are saying, ‘Long live King Adonijah!’ "},{"num":26,"verse":"But he did not invite me, your own servant, or Zadok the priest, or Benaiah son of Jehoiada, or your son Solomon. "},{"num":27,"verse":"Did you do this? Since we are your servants, why didn’t you tell us who should be king after you?”"},{"header":"David Makes Solomon King"},{"num":28,"verse":"Then the king said, “Tell Bathsheba to come in!” So she came in and stood before the king."},{"num":29,"verse":"Then the king made this promise, “The Lord has saved me from all trouble. As surely as he lives, "},{"num":30,"verse":"I will do today what I have promised you in the name of the Lord, the God of Israel. I promised that your son Solomon would be king after me and rule on my throne in my place.”"},{"num":31,"verse":"Then Bathsheba bowed facedown on the ground and knelt before the king and said, “Long live my master King David!”"},{"num":32,"verse":"Then King David said, “Tell Zadok the priest, Nathan the prophet, and Benaiah son of Jehoiada to come in.” When they came before the king, "},{"num":33,"verse":"he said to them, “Take my servants with you and put my son Solomon on my own mule. Take him down to the spring called Gihon. "},{"num":34,"verse":"There Zadok the priest and Nathan the prophet should pour olive oil on him and make him king over Israel. Blow the trumpet and shout, ‘Long live King Solomon!’ "},{"num":35,"verse":"Then come back up here with him. He will sit on my throne and rule in my place, because he is the one I have chosen to be the ruler over Israel and Judah.”"},{"num":36,"verse":"Benaiah son of Jehoiada answered the king, “Amen! This is what the Lord, the God of my master, has declared! "},{"num":37,"verse":"The Lord has always helped you, our king. May he also help Solomon and make King Solomon’s throne an even greater throne than yours.”"},{"num":38,"verse":"So Zadok the priest, Nathan the prophet, and Benaiah son of Jehoiada left with the Kerethites and Pelethites. They put Solomon on King David’s mule and took him to the spring called Gihon. "},{"num":39,"verse":"Zadok the priest took the container of olive oil from the Holy Tent and poured the oil on Solomon’s head to show he was the king. Then they blew the trumpet, and all the people shouted, “Long live King Solomon!” "},{"num":40,"verse":"All the people followed Solomon into the city. Playing flutes and shouting for joy, they made so much noise the ground shook."},{"num":41,"verse":"At this time Adonijah and all the guests with him were finishing their meal. When he heard the sound from the trumpet, Joab asked, “What does all that noise from the city mean?”"},{"num":42,"verse":"While Joab was speaking, Jonathan son of Abiathar the priest arrived. Adonijah said, “Come in! You are an important man, so you must be bringing good news.”"},{"num":43,"verse":"But Jonathan answered, “No! Our master King David has made Solomon the new king. "},{"num":44,"verse":"King David sent Zadok the priest, Nathan the prophet, Benaiah son of Jehoiada, and all the king’s bodyguards with him, and they have put Solomon on the king’s own mule. "},{"num":45,"verse":"Then Zadok the priest and Nathan the prophet poured olive oil on Solomon at Gihon to make him king. After that they went into the city, shouting with joy. Now the whole city is excited, and that is the noise you hear. "},{"num":46,"verse":"Solomon has now become the king. "},{"num":47,"verse":"All the king’s officers have come to tell King David that he has done a good thing. They are saying, ‘May your God make Solomon even more famous than you and an even greater king than you.’” Jonathan continued, “And King David bowed down on his bed to worship God, "},{"num":48,"verse":"saying, ‘Bless the Lord, the God of Israel. Today he has made one of my sons the king and allowed me to see it.’”"},{"num":49,"verse":"Then all of Adonijah’s guests were afraid, and they left quickly and scattered. "},{"num":50,"verse":"Adonijah was also afraid of Solomon, so he went and took hold of the corners of the altar. "},{"num":51,"verse":"Then someone told Solomon, “Adonijah is afraid of you, so he is at the altar, holding on to its corners. He says, ‘Tell King Solomon to promise me today that he will not kill me.’”"},{"num":52,"verse":"So Solomon answered, “Adonijah must show that he is a man of honor. If he does that, I promise he will not lose even a single hair from his head. But if he does anything wrong, he will die.” "},{"num":53,"verse":"Then King Solomon sent some men to get Adonijah. When he was brought from the altar, he came before King Solomon and bowed down. Solomon told him, “Go home.”"}]