[{"num":1,"verse":"In his old age King David was confined to his bed; but no matter how many blankets were heaped upon him, he was always cold."},{"num":2,"verse":"“The cure for this,” his aides told him, “is to find a young virgin to be your concubine and nurse. She will lie in your arms and keep you warm.”"},{"num":3,"verse":"So they searched the country from one end to the other to find the most beautiful girl in all the land. Abishag, from Shunam, was finally selected. They brought her to the king, and she lay in his arms to warm him (but he had no sexual relations with her)."},{"num":5,"verse":"At about that time, David’s son Adonijah (his mother was Haggith) decided to crown himself king in place of his aged father. So he hired chariots and drivers and recruited fifty men to run down the streets before him as royal footmen. "},{"num":6,"verse":"Now his father, King David, had never disciplined him at any time—not so much as by a single scolding! He was a very handsome man and was Absalom’s younger brother. "},{"num":7,"verse":"He took General Joab and Abiathar the priest into his confidence, and they agreed to help him become king. "},{"num":8,"verse":"But among those who remained loyal to King David and refused to endorse Adonijah were the priests Zadok and Benaiah, the prophet Nathan, Shimei, Rei, and David’s army chiefs."},{"num":9,"verse":"Adonijah went to En-rogel where he sacrificed sheep, oxen, and fat young goats at the Serpent’s Stone. Then he summoned all of his brothers—the other sons of King David—and all the royal officials of Judah, requesting that they come to his coronation. "},{"num":10,"verse":"But he didn’t invite Nathan the prophet, Benaiah, the loyal army officers, or his brother Solomon."},{"num":11,"verse":"Then Nathan the prophet went to Bathsheba, Solomon’s mother, and asked her, “Do you realize that Haggith’s son, Adonijah, is now the king and that our lord David doesn’t even know about it? "},{"num":12,"verse":"If you want to save your own life and the life of your son Solomon—do exactly as I say! "},{"num":13,"verse":"Go at once to King David and ask him, ‘My lord, didn’t you promise me that my son Solomon would be the next king and would sit upon your throne? Then why is Adonijah reigning?’ "},{"num":14,"verse":"And while you are still talking with him, I’ll come and confirm everything you’ve said.”"},{"num":15,"verse":"So Bathsheba went into the king’s bedroom. He was an old, old man now, and Abishag was caring for him. "},{"num":16,"verse":"Bathsheba bowed low before him."},{"num":17,"verse":"She replied, “My lord, you vowed to me by the Lord your God that my son Solomon would be the next king and would sit upon your throne. "},{"num":18,"verse":"But instead, Adonijah is the new king, and you don’t even know about it. "},{"num":19,"verse":"He has celebrated his coronation by sacrificing oxen, fat goats, and many sheep and has invited all your sons and Abiathar the priest and General Joab. But he didn’t invite Solomon. "},{"num":20,"verse":"And now, my lord the king, all Israel is waiting for your decision as to whether Adonijah is the one you have chosen to succeed you. "},{"num":21,"verse":"If you don’t act, my son Solomon and I will be arrested and executed as criminals as soon as you are dead.”"},{"num":22,"verse":"While she was speaking, the king’s aides told him, “Nathan the prophet is here to see you.”"},{"num":24,"verse":"and asked, “My lord, have you appointed Adonijah to be the next king? Is he the one you have selected to sit upon your throne? "},{"num":25,"verse":"Today he celebrated his coronation by sacrificing oxen, fat goats, and many sheep, and has invited your sons to attend the festivities. He also invited General Joab and Abiathar the priest; and they are feasting and drinking with him and shouting, ‘Long live King Adonijah!’ "},{"num":26,"verse":"But Zadok the priest and Benaiah and Solomon and I weren’t invited. "},{"num":27,"verse":"Has this been done with your knowledge? For you haven’t said a word as to which of your sons you have chosen to be the next king.”"},{"num":28,"verse":"“Call Bathsheba,” David said. So she came back in and stood before the king."},{"num":29,"verse":"And the king vowed, “As the Lord lives who has rescued me from every danger, "},{"num":30,"verse":"I decree that your son Solomon shall be the next king and shall sit upon my throne, just as I swore to you before by the Lord God of Israel.”"},{"num":31,"verse":"Then Bathsheba bowed low before him again and exclaimed, “Oh, thank you, sir. May my lord the king live forever!”"},{"num":32,"verse":"“Call Zadok the priest,” the king ordered, “and Nathan the prophet, and Benaiah.”"},{"num":33,"verse":"he said to them, “Take Solomon and my officers to Gihon. Solomon is to ride on my personal mule, "},{"num":34,"verse":"and Zadok the priest and Nathan the prophet are to anoint him there as king of Israel. Then blow the trumpets and shout, ‘Long live King Solomon!’ "},{"num":35,"verse":"When you bring him back here, place him upon my throne as the new king; for I have appointed him king of Israel and Judah.”"},{"num":36,"verse":"“Amen! Praise God!” replied Benaiah, and added, "},{"num":37,"verse":"“May the Lord be with Solomon as he has been with you, and may God make Solomon’s reign even greater than yours!”"},{"num":38,"verse":"So Zadok the priest, Nathan the prophet, Benaiah, and David’s bodyguard took Solomon to Gihon, riding on King David’s own mule. "},{"num":39,"verse":"At Gihon, Zadok took a flask of sacred oil from the Tabernacle and poured it over Solomon; and the trumpets were blown and all the people shouted, “Long live King Solomon!”"},{"num":40,"verse":"Then they all returned with him to Jerusalem, making a joyous and noisy celebration all along the way."},{"num":41,"verse":"Adonijah and his guests heard the commotion and shouting just as they were finishing their banquet."},{"num":42,"verse":"And while he was still speaking, Jonathan, the son of Abiathar the priest, rushed in."},{"num":43,"verse":"“Our lord King David has declared Solomon as king!” Jonathan shouted. "},{"num":44,"verse":"“The king sent him to Gihon with Zadok the priest and Nathan the prophet and Benaiah, protected by the king’s own bodyguard; and he rode on the king’s own mule. And Zadok and Nathan have anointed him as the new king! They have just returned, and the whole city is celebrating and rejoicing. That’s what all the noise is. "},{"num":46,"verse":"Solomon is sitting on the throne, and all the people are congratulating King David, saying, ‘May God bless you even more through Solomon than he has blessed you personally! May God make Solomon’s reign even greater than yours!’ And the king is lying in bed, acknowledging their blessings. "},{"num":48,"verse":"He is saying, ‘Blessed be the Lord God of Israel who has selected one of my sons to sit upon my throne while I am still alive to see it.’”"},{"num":49,"verse":"Then Adonijah and his guests jumped up from the banquet table and fled in panic; for they were fearful for their lives. Adonijah rushed into the Tabernacle and caught hold of the horns of the sacred altar. "},{"num":51,"verse":"When word reached Solomon that Adonijah was claiming sanctuary in the Tabernacle, and pleading for clemency, "},{"num":52,"verse":"Solomon replied, “If he behaves himself, he will not be harmed; but if he does not, he shall die.” "},{"num":53,"verse":"So King Solomon summoned him, and they brought him down from the altar. He came to bow low before the king; and then Solomon curtly dismissed him."}]