[[],[{"type":"header","content":"The Fourfold Hallelujah"},{"type":"prose","content":"After these things I heard  like a loud voice of a great multitude in heaven, saying,“Hallelujah! Salvation, glory, and power belong to our God,"}],[{"type":"prose","content":"BECAUSE HIS JUDGMENTS ARE TRUE AND RIGHTEOUS; for He has judged the great prostitute who was corrupting the earth with her sexual immorality, and HE HAS AVENGED THE BLOOD OF HIS BOND-SERVANTS ON HER.”"}],[{"type":"prose","content":"And a second time they said, “Hallelujah! HER SMOKE RISES FOREVER AND EVER.”"}],[{"type":"prose","content":"And the twenty-four elders and the four living creatures fell down and worshiped God who sits on the throne, saying, “Amen. Hallelujah!”"}],[{"type":"prose","content":"And a voice came from the throne, saying,“Give praise to our God, all you His bond-servants, you who fear Him, the small and the great.”"}],[{"type":"prose","content":"Then I heard  like the voice of a great multitude and like the sound of many waters, and like the sound of mighty peals of thunder, saying,“Hallelujah! For the Lord our God, the Almighty, reigns."}],[{"type":"header","content":"Marriage of the Lamb"},{"type":"prose","content":"Let’s rejoice and be glad and give the glory to Him, because the marriage of the Lamb has come, and His bride has prepared herself.”"}],[{"type":"prose","content":"It was given to her to clothe herself in fine linen, bright  clean; for the fine linen is the righteous acts of the saints."}],[{"type":"prose","content":"Then he *said to me, “Write: ‘Blessed are those who are invited to the wedding feast of the Lamb.’” And he *said to me, “These are the true words of God.”"}],[{"type":"prose","content":"Then I fell at his feet to worship him. But he *said to me, “Do not do that; I am a fellow servant of yours and your brothers  who hold the testimony of Jesus; worship God! For the testimony of Jesus is the spirit of prophecy.”"}],[{"type":"header","content":"The Coming of Christ"},{"type":"prose","content":"And I saw heaven opened, and behold, a white horse, and He who sat on it  called Faithful and True, and in righteousness He judges and wages war."}],[{"type":"prose","content":"His eyes  a flame of fire, and on His head  many crowns; and He has a name written  which no one knows except Himself."}],[{"type":"prose","content":" clothed with a robe dipped in blood, and His name is called The Word of God."}],[{"type":"prose","content":"And the armies which are in heaven, clothed in fine linen, white  clean, were following Him on white horses."}],[{"type":"prose","content":"From His mouth comes a sharp sword, so that with it He may strike down the nations, and He will rule them with a rod of iron; and He treads the wine press of the fierce wrath of God, the Almighty."}],[{"type":"prose","content":"And on His robe and on His thigh He has a name written: “KING OF KINGS, AND LORD OF LORDS.”"}],[{"type":"prose","content":"Then I saw an angel standing in the sun, and he cried out with a loud voice, saying to all the birds that fly in midheaven, “Come, assemble for the great feast of God,"}],[{"type":"prose","content":"so that you may eat the flesh of kings and the flesh of commanders, the flesh of mighty men, the flesh of horses and of those who sit on them, and the flesh of all people, both free and slaves, and small and great.”"}],[{"type":"prose","content":"And I saw the beast and the kings of the earth and their armies, assembled to make war against Him who sat on the horse, and against His army."}],[{"type":"header","content":"Doom of the Beast and False Prophet"},{"type":"prose","content":"And the beast was seized, and with him the false prophet who performed the signs in his presence, by which he deceived those who had received the mark of the beast and those who worshiped his image; these two were thrown alive into the lake of fire, which burns with brimstone."}],[{"type":"prose","content":"And the rest were killed with the sword which came from the mouth of Him who sat on the horse, and all the birds were filled with their flesh."}]]