[{"header":"Giving Thanks in Heaven"},{"num":19,"verse":"After this I heard what sounded like the voices of many people in heaven, saying, “Thanks to our God, the One Who saves. Honor and power belong to Him. "},{"num":2,"verse":"For the way He punishes people is right and true. He has punished the powerful woman who sold the use of her body. She was making the earth sinful with her sex sins. She killed those who worked for God. He has punished her for it.” "},{"num":3,"verse":"Again they said, “Thanks to our God. The smoke from her burning goes up forever.” "},{"num":4,"verse":"The twenty-four leaders and the four living beings got down and worshiped God Who was sitting on the throne. They said, “Let it be so. Thanks to our God!”"},{"num":5,"verse":"A voice came from the throne, saying, “Give thanks to our God, you servants who are owned by Him. Give thanks to our God, you who honor Him with love and fear, both small and great.”"},{"header":"The Wedding Supper of the Lamb"},{"num":6,"verse":"Then I heard what sounded like the voices of many people. It was like the sound of powerful rushing water. And it was like loud thunder. It said, “Thanks to our God. For the Lord our God is King. He is the All-powerful One. "},{"num":7,"verse":"Let us be full of joy and be glad. Let us honor Him, for the time has come for the wedding supper of the Lamb. His bride has made herself ready. "},{"num":8,"verse":"She was given clean, white, fine linen clothes to wear. The fine linen is the right living of God’s people.”"},{"num":9,"verse":"The angel said to me, “Write this: ‘Those who are asked to the wedding supper of the Lamb are happy.’” And he said, “These are the true words of God.” "},{"num":10,"verse":"Then I fell at his feet to worship him. But he said to me, “No! Do not worship me. I am a servant together with you and your Christian brothers who tell of their trust in Christ. Worship God. For those who speak for Jesus are led in what to say as the early preachers were led.”"},{"header":"The King of Kings on the White Horse"},{"num":11,"verse":"Then I saw heaven opened. A white horse was standing there. The One Who was sitting on the horse is called Faithful and True. He is the One Who punishes in the right way. He makes war. "},{"num":12,"verse":"His eyes are a flame of fire. He has many crowns on His head. His name is written on Him but He is the only One Who knows what it says. "},{"num":13,"verse":"The coat He wears has been put in blood. His name is The Word of God. "},{"num":14,"verse":"The armies in heaven were dressed in clean, white, fine linen. They were following Him on white horses. "},{"num":15,"verse":"Out of His mouth comes a sharp sword to punish the nations. He will be the Leader over them using a piece of iron. He walks on the grapes where wine is made, pressing out the anger of God, the All-powerful One. "},{"num":16,"verse":"On His coat and on His leg is the name written, “KING OF KINGS AND LORD OF LORDS.”"},{"num":17,"verse":"Then I saw an angel standing in the sun. He cried out with a loud voice to all the birds flying in the sky, “Come and gather together for the great supper of God! "},{"num":18,"verse":"Come and eat the flesh of kings and of captains of soldiers and of strong men and of the flesh of horses and of those sitting on them. Come and eat the flesh of all men, small and great. Some are free and some are not free.”"},{"num":19,"verse":"Then I saw the wild animal and the kings of the earth and their armies gather together. They were ready to fight against the One Who is sitting on the white horse and against His army. "},{"num":20,"verse":"The wild animal was taken. The false preacher was taken with it. It was the false preacher who had done powerful works in front of the wild animal. In this way, he fooled those who had received the mark of the wild animal and those who worshiped his false god. These two were thrown alive into the lake of fire that burns with sulphur. "},{"num":21,"verse":"The rest were killed with the sword that came out of the mouth of the One Who sat on the horse. All the birds were filled by eating the flesh of these who were killed."}]