[{"header":"Chapter 3"},{"num":1,"verse":"Commission to Preach God’s Plan. Because of this, I, Paul, a prisoner of Christ [Jesus] for you Gentiles— "},{"num":2,"verse":"if, as I suppose, you have heard of the stewardship of God’s grace that was given to me for your benefit, "},{"num":3,"verse":"[namely, that] the mystery was made known to me by revelation, as I have written briefly earlier. "},{"num":4,"verse":"When you read this you can understand my insight into the mystery of Christ, "},{"num":5,"verse":"which was not made known to human beings in other generations as it has now been revealed to his holy apostles and prophets by the Spirit, "},{"num":6,"verse":"that the Gentiles are coheirs, members of the same body, and copartners in the promise in Christ Jesus through the gospel."},{"num":7,"verse":"Of this I became a minister by the gift of God’s grace that was granted me in accord with the exercise of his power. "},{"num":8,"verse":"To me, the very least of all the holy ones, this grace was given, to preach to the Gentiles the inscrutable riches of Christ, "},{"num":9,"verse":"and to bring to light [for all] what is the plan of the mystery hidden from ages past in God who created all things, "},{"num":10,"verse":"so that the manifold wisdom of God might now be made known through the church to the principalities and authorities in the heavens. "},{"num":11,"verse":"This was according to the eternal purpose that he accomplished in Christ Jesus our Lord, "},{"num":12,"verse":"in whom we have boldness of speech and confidence of access through faith in him. "},{"num":13,"verse":"So I ask you not to lose heart over my afflictions for you; this is your glory."},{"num":14,"verse":"For this reason I kneel before the Father, "},{"num":15,"verse":"from whom every family in heaven and on earth is named, "},{"num":16,"verse":"that he may grant you in accord with the riches of his glory to be strengthened with power through his Spirit in the inner self, "},{"num":17,"verse":"and that Christ may dwell in your hearts through faith; that you, rooted and grounded in love, "},{"num":18,"verse":"may have strength to comprehend with all the holy ones what is the breadth and length and height and depth, "},{"num":19,"verse":"and to know the love of Christ that surpasses knowledge, so that you may be filled with all the fullness of God."},{"num":20,"verse":"Now to him who is able to accomplish far more than all we ask or imagine, by the power at work within us, "},{"num":21,"verse":"to him be glory in the church and in Christ Jesus to all generations, forever and ever. Amen."}]