[{"header":"Solomon Brings the Sacred Chest to the Temple"},{"num":1,"verse":"The sacred chest had been kept on Mount Zion, also known as the city of David. But Solomon decided to have the chest moved to the temple while everyone was in Jerusalem, celebrating the Festival of Shelters during Ethanim, the seventh month of the year."},{"num":3,"verse":"Then the priests and the Levites carried to the temple the sacred chest, the sacred tent, and the objects used for worship. "},{"num":5,"verse":"Solomon and a crowd of people walked in front of the chest, and along the way they sacrificed more sheep and cattle than could be counted."},{"num":6,"verse":"The priests carried the chest into the most holy place and put it under the winged creatures, "},{"num":7,"verse":"whose wings covered the chest and the poles used for carrying it. "},{"num":8,"verse":"The poles were so long that they could be seen from right outside the most holy place, but not from anywhere else. And they stayed there from then on."},{"num":9,"verse":"The only things kept in the chest were the two flat stones Moses had put there when the Lord made his agreement with the people of Israel at Mount Sinai, after bringing them out of Egypt."},{"num":10,"verse":"Suddenly a cloud filled the temple as the priests were leaving the most holy place. "},{"num":11,"verse":"The Lord’s glory was in the cloud, and the light from it was so bright that the priests could not stay inside to do their work. "},{"num":12,"verse":"Then Solomon prayed:"},{"header":"Solomon Speaks to the People"},{"num":14,"verse":"Solomon turned toward the people standing there. Then he blessed them "},{"num":15,"verse":"and said:"},{"header":"Solomon Prays at the Temple"},{"num":22,"verse":"Solomon stood facing the altar with everyone standing behind him. Then he lifted his arms toward heaven "},{"num":23,"verse":"and prayed:"},{"header":"Solomon Blesses the People"},{"num":54,"verse":"When Solomon finished his prayer at the altar, he was kneeling with his arms lifted toward heaven. He stood up, "},{"num":55,"verse":"turned toward the people, blessed them, and said loudly:"},{"header":"Solomon Dedicates the Temple"},{"num":62,"verse":"Solomon and the people dedicated the temple to the Lord by offering twenty-two thousand cattle and one hundred twenty thousand sheep as sacrifices to ask the Lord’s blessing. "},{"num":64,"verse":"On that day, Solomon dedicated the courtyard in front of the temple and made it acceptable for worship. He offered the sacrifices there because the bronze altar in front of the temple was too small."},{"num":65,"verse":"Solomon and the huge crowd celebrated the Festival of Shelters at the temple for seven days. There were people from as far away as the Egyptian Gorge in the south and Lebo-Hamath in the north. "},{"num":66,"verse":"Then on the eighth day, he sent everyone home. They said good-by and left, very happy, because of all the good things the Lord had done for his servant David and his people Israel."}]