[{"num":8,"verse":"4 The Ark is borne into the Temple. 10 A cloud filleth the Temple. 14 The king blesseth the people."},{"num":1,"verse":"Then King Solomon assembled the Elders of Israel, even all the heads of the tribes, the chief fathers of the children of Israel unto him in Jerusalem, for to bring up the Ark of the covenant of the Lord from the city of David, which is Zion."},{"num":2,"verse":"And all the men of Israel assembled unto King Solomon at the feast in the month of Ethanim, which is the seventh month."},{"num":3,"verse":"And all the Elders of Israel came, and the Priests took the Ark."},{"num":4,"verse":"They bare the Ark of the Lord, and they bare the Tabernacle of the Congregation, and all the holy vessels that were in the Tabernacle: those did the Priests and Levites bring up."},{"num":5,"verse":"And King Solomon and all the Congregation of Israel that were assembled unto him, were with him before the Ark, offering sheep and beeves, which could not be told, nor numbered for multitude."},{"num":6,"verse":"So the Priests brought the Ark of the Covenant of the Lord unto his place, into the oracle of the house into the most holy place, even under the wings of the Cherubims."},{"num":7,"verse":"For the Cherubims stretched out their wings over the place of the Ark, and the Cherubims covered the Ark, and the bars thereof above."},{"num":8,"verse":"And they drew out the bars, that the ends of the bars might appear out of the Sanctuary before the oracle, but they were not seen without: and there they are unto this day."},{"num":9,"verse":"Nothing was in the Ark save the two tables of stone which Moses had put there at Horeb, where the Lord made a covenant with the children of Israel, when he brought them out of the land of Egypt."},{"num":10,"verse":"And when the Priests were come out of the Sanctuary, the cloud filled the house of the Lord,"},{"num":11,"verse":"So that the Priests could not stand to minister, because of the cloud: for the glory of the Lord had filled the house of the Lord."},{"num":12,"verse":"Then spake Solomon, The Lord said, that he would dwell in the dark cloud."},{"num":13,"verse":"I have built thee an house to dwell in, an habitation for thee to abide in for ever."},{"num":14,"verse":"¶ And the King turned his face and blessed all the Congregation of Israel: for all the Congregation of Israel stood there."},{"num":15,"verse":"And he said, Blessed be the Lord God of Israel, who spake with his mouth unto David my father, and hath with his hand fulfilled it, saying,"},{"num":16,"verse":"Since the day that I brought my people Israel out of Egypt, I chose no city of all the tribes of Israel, to build an house that my Name might be there: but I have chosen David to be over my people Israel."},{"num":17,"verse":"And it was in the heart of David my father, to build an house to the Name of the Lord God of Israel."},{"num":18,"verse":"And the Lord said unto David my father, Whereas it was in thine heart to build an house unto my Name, thou didst well, that thou wast so minded:"},{"num":19,"verse":"Nevertheless thou shalt not build the house, but thy son that shall come out of thy loins, he shall build the house unto my Name."},{"num":20,"verse":"And the Lord hath made good his word that he spake: and I am risen up in the room of David my father, and sit on the throne of Israel, as the Lord promised, and have built the house for the Name of the Lord God of Israel."},{"num":21,"verse":"And I have prepared therein a place for the Ark, wherein is the covenant of the Lord which he made with our fathers, when he brought them out of the land of Egypt."},{"num":22,"verse":"¶ Then Solomon stood before the altar of the Lord in the sight of all the Congregation of Israel, and stretched out his hands toward heaven,"},{"num":23,"verse":"And said, O Lord God of Israel, there is no God like thee in heaven above, or in the earth beneath, thou that keepest covenant and mercy with thy servants that walk before thee, with all their heart,"},{"num":24,"verse":"Thou that hast kept with thy servant David my father, that thou hast promised him: for thou spakest with thy mouth, and hast fulfilled it with thine hand, as appeareth this day."},{"num":25,"verse":"Therefore, now Lord God of Israel, keep with thy servant David my father that thou hast promised him, saying,  Thou shalt not want a man in my sight to sit upon the throne of Israel: so that thy children take heed to their way, that they walk before me, as thou hast walked in my sight."},{"num":26,"verse":"And now, O God of Israel, I pray thee, let thy word be verified, which thou spakest unto thy servant David my father."},{"num":27,"verse":"Is it true indeed that God will dwell on the earth? behold, the heavens, and the heavens of heavens are not able to contain thee: how much more unable is this house that I have built?"},{"num":28,"verse":"But have thou respect unto the prayer of thy servant, and to his supplication, O Lord my God, to hear the cry and prayer which thy servant prayeth before thee this day:"},{"num":29,"verse":"That thine eyes may be open toward this house, night and day, even toward the place whereof thou hast said, My Name shall be there: that thou mayest hearken unto the prayer which thy servant prayeth in this place."},{"num":30,"verse":"Hear thou therefore the supplication of thy servant, and of thy people Israel which pray in this place, and hear thou in the place of thine habitation, even in heaven, and when thou hearest, have mercy."},{"num":31,"verse":"¶ When a man shall trespass against his neighbor, and he lay upon him an oath to cause him to swear, and the swearer shall come before thine altar into this house,"},{"num":32,"verse":"Then hear thou in heaven, and do and judge thy servants, that thou condemn the wicked to bring his way upon his head, and justify the righteous, to give him according to his righteousness."},{"num":33,"verse":"¶ When thy people Israel shall be overthrown before the enemy, because they have sinned against thee, and turn again to thee, and confess thy Name, and pray and make supplication unto thee in this house,"},{"num":34,"verse":"Then hear thou in heaven, and be merciful unto the sin of thy people Israel, and bring them again unto the land, which thou gavest unto their fathers."},{"num":35,"verse":"¶ When heaven shall be shut up, and there shall be no rain because they have sinned against thee, and shall pray in this place, and confess thy Name, and turn from their sin, when thou dost afflict them,"},{"num":36,"verse":"Then hear thou in heaven, and pardon the sin of thy servants and of thy people Israel (when thou hast taught them the good way wherein they may walk) and give rain upon the land that thou hast given thy people to inherit."},{"num":37,"verse":"When there shall be famine in the land, when there shall be pestilence, when there shall be blasting, mildew, grasshopper or caterpillar, when their enemies shall besiege them in the cities of their land, or any plague, or any sickness,"},{"num":38,"verse":"Then what prayer, and supplication soever shall be made of any man or of all thy people Israel, when everyone shall know the plague in his own heart, and stretch forth his hands in this house,"},{"num":39,"verse":"Hear thou then in heaven, in thy dwelling place, and be merciful, and do, and give every man according to all his ways, as thou knowest his heart, (for thou only knowest the hearts of all the children of men)"},{"num":40,"verse":"That they may fear thee as long as they live in the land, which thou gavest unto our fathers."},{"num":41,"verse":"Moreover as touching the stranger that is not of thy people Israel, who shall come out of a far country for thy Name’s sake,"},{"num":42,"verse":"(When they shall hear of thy great Name, and of thy mighty hand, and of thy stretched out arm) and shall come and pray in this house,"},{"num":43,"verse":"Hear thou in heaven thy dwelling place, and do according to all that the stranger calleth for unto thee: that all the people of the earth may know thy Name, and fear thee, as do thy people Israel: and that they may know that thy Name is called upon in this house which I have built."},{"num":44,"verse":"¶ When thy people shall go out to battle against their enemy by the way that thou shalt send them, and shall pray unto the Lord toward the way of the city which thou hast chosen, and toward the house that I have built for thy Name,"},{"num":45,"verse":"Hear thou then in heaven their prayer and their supplication, and judge their cause."},{"num":46,"verse":"If they sin against thee, (for there is no man that sinneth not) and thou be angry with them, and deliver them unto the enemies, so that they carry them away prisoners unto the land of the enemies, either far or near,"},{"num":47,"verse":"Yet if they turn again unto their heart in the land (to the which they be carried away captives) and return and pray unto thee in the land of them that carried them away captives, saying, We have sinned, we have transgressed, and done wickedly,"},{"num":48,"verse":"If they turn again unto thee with all their heart, and with all their soul in the land of their enemies, which led them away captives, and pray unto thee toward the way of their land, which thou gavest unto their fathers, and toward the city which thou hast chosen, and the house which I have built for thy Name,"},{"num":49,"verse":"Then hear thou their prayer and their supplication in heaven thy dwelling place, and judge their cause,"},{"num":50,"verse":"And be merciful unto thy people that have sinned against thee, and unto all their iniquities (wherein they have transgressed against thee) and cause that they which led them away captives, may have pity and compassion on them."},{"num":51,"verse":"For they be thy people, and thine inheritance, which thou broughtest out of Egypt from the midst of the iron furnace."},{"num":52,"verse":"Let thine eyes be open unto the prayer of thy servant, and unto the prayer of thy people Israel, to hearken unto them, in all that they call for unto thee."},{"num":53,"verse":"For thou didst separate them to thee from among all people of the earth for an inheritance, as thou saidest by the hand of Moses thy servant, when thou broughtest our fathers out of Egypt, O Lord God."},{"num":54,"verse":"And when Solomon had made an end of praying all this prayer and supplication unto the Lord, he rose from before the altar of the Lord, from kneeling on his knees, and stretching of his hands to heaven,"},{"num":55,"verse":"And stood and blessed all the Congregation of Israel, with a loud voice, saying,"},{"num":56,"verse":"Blessed be the Lord that hath given rest unto his people Israel, according to all that he promised: there hath not failed one word of all his good promise which he promised by the hand of Moses his servant."},{"num":57,"verse":"The Lord our God be with us, as he was with our fathers, that he forsake us not, neither leave us,"},{"num":58,"verse":"That he may bow our hearts unto him, that we may walk in all his ways, and keep his commandments, and his statutes, and his laws, which he commanded our fathers."},{"num":59,"verse":"And these my words, which I have prayed before the Lord, be near unto the Lord our God day and night, that he defend the cause of his servant, and the cause of his people Israel always as the matter requireth,"},{"num":60,"verse":"That all the people of the earth may know, that the Lord is God, and none other."},{"num":61,"verse":"Let your heart therefore be perfect with the Lord our God, to walk in his statutes, and to keep his commandments, as this day."},{"num":62,"verse":"¶ Then the king and all Israel with him offered sacrifice before the Lord."},{"num":63,"verse":"And Solomon offered a sacrifice of peace offerings which he offered unto the Lord, to wit, two and twenty thousand beeves, and an hundred and twenty thousand sheep: so the King and all the children of Israel dedicated the house of the Lord."},{"num":64,"verse":"The same day did the King hallow the middle of the court, that was before the house of the Lord: for there he made burnt offerings, and the meat offerings, and the fat of the peace offerings, because the brazen altar that was before the Lord, was too little to receive the burnt offerings, and the meat offerings, and the fat of the peace offerings."},{"num":65,"verse":"And Solomon made at that time a feast and all Israel with him, a very great Congregation, even from the entering in of Hamath unto the river of Egypt, before the Lord our God, seven days and seven days, even fourteen days."},{"num":66,"verse":"And the eighth day he sent the people away: and they thanked the King, and went unto their tents joyous, and with glad heart, because of all the goodness that the Lord had done for David his servant, and for Israel his people."}]