[{"header":"The parable of the wedding banquet"},{"num":22,"verse":"Jesus spoke to them again in parables, saying: "},{"num":2,"verse":"‘The kingdom of heaven is like a king who prepared a wedding banquet for his son. "},{"num":3,"verse":"He sent his servants to those who had been invited to the banquet to tell them to come, but they refused to come."},{"num":4,"verse":"‘Then he sent some more servants and said, “Tell those who have been invited that I have prepared my dinner: my oxen and fattened cattle have been slaughtered, and everything is ready. Come to the wedding banquet.”"},{"num":5,"verse":"‘But they paid no attention and went off – one to his field, another to his business. "},{"num":6,"verse":"The rest seized his servants, ill-treated them and killed them. "},{"num":7,"verse":"The king was enraged. He sent his army and destroyed those murderers and burned their city."},{"num":8,"verse":"‘Then he said to his servants, “The wedding banquet is ready, but those I invited did not deserve to come. "},{"num":9,"verse":"So go to the street corners and invite to the banquet anyone you find.” "},{"num":10,"verse":"So the servants went out into the streets and gathered all the people they could find, the bad as well as the good, and the wedding hall was filled with guests."},{"num":11,"verse":"‘But when the king came in to see the guests, he noticed a man there who was not wearing wedding clothes. "},{"num":12,"verse":"He asked, “How did you get in here without wedding clothes, friend?” The man was speechless."},{"num":13,"verse":"‘Then the king told the attendants, “Tie him hand and foot, and throw him outside, into the darkness, where there will be weeping and gnashing of teeth.”"},{"num":14,"verse":"‘For many are invited, but few are chosen.’"},{"header":"Paying the poll-tax to Caesar"},{"num":15,"verse":"Then the Pharisees went out and laid plans to trap him in his words. "},{"num":16,"verse":"They sent their disciples to him along with the Herodians. ‘Teacher,’ they said, ‘we know that you are a man of integrity and that you teach the way of God in accordance with the truth. You aren’t swayed by others, because you pay no attention to who they are. "},{"num":17,"verse":"Tell us then, what is your opinion? Is it right to pay the poll-tax to Caesar or not?’"},{"num":18,"verse":"But Jesus, knowing their evil intent, said, ‘You hypocrites, why are you trying to trap me? "},{"num":19,"verse":"Show me the coin used for paying the tax.’ They brought him a denarius, "},{"num":20,"verse":"and he asked them, ‘Whose image is this? And whose inscription?’"},{"num":21,"verse":"‘Caesar’s,’ they replied."},{"num":22,"verse":"When they heard this, they were amazed. So they left him and went away."},{"header":"Marriage at the resurrection"},{"num":23,"verse":"That same day the Sadducees, who say there is no resurrection, came to him with a question. "},{"num":24,"verse":"‘Teacher,’ they said, ‘Moses told us that if a man dies without having children, his brother must marry the widow and raise up offspring for him. "},{"num":25,"verse":"Now there were seven brothers among us. The first one married and died, and since he had no children, he left his wife to his brother. "},{"num":26,"verse":"The same thing happened to the second and third brother, right on down to the seventh. "},{"num":27,"verse":"Finally, the woman died. "},{"num":28,"verse":"Now then, at the resurrection, whose wife will she be of the seven, since all of them were married to her?’"},{"num":29,"verse":"Jesus replied, ‘You are in error because you do not know the Scriptures or the power of God. "},{"num":30,"verse":"At the resurrection people will neither marry nor be given in marriage; they will be like the angels in heaven. "},{"num":31,"verse":"But about the resurrection of the dead – have you not read what God said to you, "},{"num":32,"verse":"“I am the God of Abraham, the God of Isaac, and the God of Jacob”? He is not the God of the dead but of the living.’"},{"num":33,"verse":"When the crowds heard this, they were astonished at his teaching."},{"header":"The greatest commandment"},{"num":34,"verse":"Hearing that Jesus had silenced the Sadducees, the Pharisees got together. "},{"num":35,"verse":"One of them, an expert in the law, tested him with this question: "},{"num":36,"verse":"‘Teacher, which is the greatest commandment in the Law?’"},{"num":37,"verse":"Jesus replied: ‘“Love the Lord your God with all your heart and with all your soul and with all your mind.” "},{"num":38,"verse":"This is the first and greatest commandment. "},{"num":39,"verse":"And the second is like it: “Love your neighbour as yourself.” "},{"num":40,"verse":"All the Law and the Prophets hang on these two commandments.’"},{"header":"Whose son is the Messiah?"},{"num":41,"verse":"While the Pharisees were gathered together, Jesus asked them, "},{"num":42,"verse":"‘What do you think about the Messiah? Whose son is he?’"},{"num":43,"verse":"He said to them, ‘How is it then that David, speaking by the Spirit, calls him “Lord”? For he says,"},{"num":45,"verse":"If then David calls him “Lord”, how can he be his son?’ "},{"num":46,"verse":"No one could say a word in reply, and from that day on no one dared to ask him any more questions."}]