[{"header":"A Story about a Wedding Reception"},{"num":22,"verse":"Again Yeshua used stories as illustrations when he spoke to them. He said, "},{"num":2,"verse":"“The kingdom of heaven is like a king who planned a wedding for his son. "},{"num":3,"verse":"He sent his servants to those who had been invited to the wedding, but they refused to come. "},{"num":4,"verse":"He sent other servants to tell the people who had been invited, ‘I’ve prepared dinner. My bulls and fattened calves have been butchered. Everything is ready. Come to the wedding!’"},{"num":5,"verse":"“But they paid no attention and went away. Some went to work in their own fields, and others went to their businesses. "},{"num":6,"verse":"The rest grabbed the king’s servants, mistreated them, and then killed them."},{"num":7,"verse":"“The king became angry. He sent his soldiers, killed those murderers, and burned their city."},{"num":8,"verse":"“Then the king said to his servants, ‘The wedding is ready, but those who were invited don’t deserve the honor. "},{"num":9,"verse":"Go where the roads leave the city. Invite everyone you find to the wedding.’ "},{"num":10,"verse":"The servants went into the streets and brought in all the good people and all the evil people they found. And the wedding hall was filled with guests."},{"num":11,"verse":"“When the king came to see the guests, he saw a person who was not dressed in the wedding clothes provided for the guests. "},{"num":12,"verse":"He said to him, ‘Friend, how did you get in here without proper wedding clothes?’"},{"num":13,"verse":"Then the king told his servants, ‘Tie his hands and feet, and throw him outside into the darkness. People will cry and be in extreme pain there.’"},{"num":14,"verse":"“Therefore, many are invited, but few of those are chosen to stay.”"},{"header":"A Question about Taxes(A)"},{"num":15,"verse":"Then the Pharisees went away and planned to trap Yeshua into saying the wrong thing. "},{"num":16,"verse":"They sent their disciples to him along with Herod’s followers. They said to him, “Teacher, we know that you tell the truth and that you teach the truth about the way of God. You don’t favor individuals because of who they are. "},{"num":17,"verse":"So tell us what you think. Is it right to pay taxes to the emperor or not?”"},{"num":18,"verse":"Yeshua recognized their evil plan, so he asked, “Why do you test me, you hypocrites? "},{"num":19,"verse":"Show me a coin used to pay taxes.”"},{"num":20,"verse":"He said to them, “Whose face and name is this?”"},{"num":21,"verse":"They replied, “The emperor’s.”"},{"num":22,"verse":"They were surprised to hear this. Then they left him alone and went away."},{"header":"The Dead Come Back to Life(B)"},{"num":23,"verse":"On that day some Sadducees, who say that people will never come back to life, came to Yeshua. They asked him, "},{"num":24,"verse":"“Teacher, Moses said, ‘If a man dies childless, his brother should marry his widow and have children for his brother.’ "},{"num":25,"verse":"There were seven brothers among us. The first married and died. Since he had no children, he left his widow to his brother. "},{"num":26,"verse":"The second brother also died, as well as the third, and the rest of the seven brothers. "},{"num":27,"verse":"At last the woman died. "},{"num":28,"verse":"Now, when the dead come back to life, whose wife will she be? All seven brothers had been married to her.”"},{"num":29,"verse":"Yeshua answered, “You’re mistaken because you don’t know the Scriptures or God’s power. "},{"num":30,"verse":"When people come back to life, they don’t marry. Rather, they are like the angels in heaven. "},{"num":31,"verse":"Haven’t you read what God told you about the dead coming back to life? He said, "},{"num":32,"verse":"‘I am the God of Abraham, Isaac, and Jacob.’ He’s not the God of the dead but of the living.”"},{"num":33,"verse":"He amazed the crowds who heard his teaching."},{"header":"Love God and Your Neighbor(C)"},{"num":34,"verse":"When the Pharisees heard that Yeshua had silenced the Sadducees, they gathered together. "},{"num":35,"verse":"One of them, an expert in Moses’ Teachings, tested Yeshua by asking, "},{"num":36,"verse":"“Teacher, which commandment is the greatest in Moses’ Teachings?”"},{"num":37,"verse":"Yeshua answered him, “‘Love the Lord your God with all your heart, with all your soul, and with all your mind.’ "},{"num":38,"verse":"This is the greatest and most important commandment. "},{"num":39,"verse":"The second is like it: ‘Love your neighbor as you love yourself.’ "},{"num":40,"verse":"All of Moses’ Teachings and the Prophets depend on these two commandments.”"},{"header":"How Can David’s Son Be David’s Lord?(D)"},{"num":41,"verse":"While the Pharisees were still gathered, Yeshua asked them, "},{"num":42,"verse":"“What do you think about the Messiah? Whose son is he?”"},{"num":43,"verse":"He said to them, “Then how can David, guided by the Spirit, call him Lord? David says,"},{"num":45,"verse":"If David calls him Lord, how can he be his son?”"},{"num":46,"verse":"No one could answer him, and from that time on no one dared to ask him another question."}]