[{"num":22,"verse":"Jesus told them other stories."},{"num":2,"verse":"He said, `The kingdom of heaven is like this. A king made a wedding for his son."},{"num":3,"verse":"The king sent his servants to call the people who had been asked to the wedding. But they would not come."},{"num":4,"verse":"`He sent other servants to call them. He said, \"Tell those who were asked to the wedding that my dinner is cooked. The cows and bullocks have been killed. Everything is ready. Come now to the wedding.\""},{"num":5,"verse":"`The people did not listen, but went away. One went to his farm. One went to his business."},{"num":6,"verse":"The others caught his servants, treated them very badly, and killed them."},{"num":7,"verse":"`The king was very angry. He sent his soldiers to kill the men who had killed his servants. And he burned their city."},{"num":8,"verse":"Then he said to his servants, \"The wedding is ready. But those who were asked to come were not good enough."},{"num":9,"verse":"Go out on the roads. Call all the people you find to come to the wedding.\""},{"num":10,"verse":"`So those servants went out on the roads. They brought all the people they could find, both bad and good people. Then the room was full of people for the wedding."},{"num":11,"verse":"`The king came in to look at the people. He saw one man there who was not wearing the right clothes for a wedding."},{"num":12,"verse":"The king said to him, \"My friend, why did you come here without putting on the right clothes for a wedding?\" The man did not answer."},{"num":13,"verse":"Then the king said to his servants, \"Tie his hands and his feet. Put him in a dark place outside. People there will cry and grind [make a noise with] their teeth.\""},{"num":14,"verse":"`Many people are asked to come, but only a few are chosen.'"},{"num":15,"verse":"Then the Pharisees went away. They planned how to make Jesus say something wrong."},{"num":16,"verse":"They sent their disciples to him with some of Herod's people. They said, `Teacher, we know that you are true. We know that you teach the true way of God. You do not fear any person, or care how great he is."},{"num":17,"verse":"So tell us. What do you think? Is it right to pay taxes to Caesar or is it not?'"},{"num":18,"verse":"Jesus knew they were trying to get him into trouble. So he said to them, `Why are you trying to get me to do wrong? You are not true to yourselves!"},{"num":19,"verse":"Show me a piece of money used for tax.' They brought him a piece of money."},{"num":20,"verse":"`Whose picture and name is this?' he asked."},{"num":21,"verse":"They said, `Caesar's'. Then he said to them, `Give to Caesar what belongs to Caesar. And give to God what belongs to God.'"},{"num":22,"verse":"When they heard that, they were surprised. They left him and went away."},{"num":23,"verse":"The same day some of the Sadducees came to Jesus. They say that people do not rise from death."},{"num":24,"verse":"They came to ask him a question. They said, `Teacher, Moses gave us this law: \"If a man dies and has no children, then his brother must marry the wife and raise a family for his brother.\""},{"num":25,"verse":"There were seven brothers among us. The first one married. He died and left no children. So his brother married the wife."},{"num":26,"verse":"The same thing happened to the second brother, and the third one, and all seven of them."},{"num":27,"verse":"Last of all, the woman died."},{"num":28,"verse":"Now then, when people rise from death, which of the seven brothers will have her for his wife? They all married her.'"},{"num":29,"verse":"Jesus answered, `You are wrong! You do not know what the holy writings say. And you do not know what power God has."},{"num":30,"verse":"When people rise from death, men and women do not marry. But they are like angels in heaven."},{"num":31,"verse":"People do rise from death! Have you never read what God said to you?"},{"num":32,"verse":"He said, \"I am the God of Abraham, the God of Isaac, and the God of Jacob.\" He is not the God of dead people, but of living people.'"},{"num":33,"verse":"When the people heard this, they were surprised at his teaching."},{"num":34,"verse":"The Pharisees heard that the Sadducees could not answer Jesus. So they got together."},{"num":35,"verse":"One of them was a man who taught God's law. He asked Jesus a question to try him out."},{"num":36,"verse":"`Teacher,' he said, `which law is the greatest law of all?'"},{"num":37,"verse":"Jesus said, ` \"Love the Lord your God with all your heart. Love him with all your soul, and love him with all your mind.\""},{"num":38,"verse":"This is the first and greatest law."},{"num":39,"verse":"The second law of God is like it. \"Love your neighbour as you love yourself.\""},{"num":40,"verse":"All that is written in the books of the law and the books of the prophets is about these two laws.'"},{"num":41,"verse":"While the Pharisees were still there, Jesus asked them a question."},{"num":42,"verse":"He said, `What do you think about Christ? Whose son is he?' They said, `He is David's son.'"},{"num":43,"verse":"Jesus asked, `Then how can David call him \"Lord\"? He said, by the Spirit,"},{"num":44,"verse":"\"The Lord said to my Lord, `Sit beside me until I make you master over your enemies.' \""},{"num":45,"verse":"David calls Christ his Lord. How can Christ be David's son?'"},{"num":46,"verse":"No one could answer him a word. And after that day, everyone feared to ask him any more questions."}]