[{"num":3,"verse":"These sons of David were born to him in Hebron: the firstborn was Amnon, of Ahinoam the Jezreelitess; second, Daniel (Chileab), of Abigail the Carmelitess;"},{"num":2,"verse":"Third, Absalom the son of Maacah daughter of Talmai king of Geshur; fourth, Adonijah, of Haggith;"},{"num":3,"verse":"Fifth, Shephatiah, of Abital; sixth, Ithream, of his wife Eglah."},{"num":4,"verse":"These six were born to David in Hebron; there he reigned seven years and six months, and in Jerusalem he reigned thirty-three years."},{"num":5,"verse":"These were born to [David] in Jerusalem: Shimea, Shobab, Nathan, Solomon—four of Bathshua (Bathsheba) daughter of Ammiel (Eliam);"},{"num":6,"verse":"Then Ibhar, Elishama, Eliphelet,"},{"num":7,"verse":"Nogah, Nepheg, Japhia,"},{"num":8,"verse":"Elishama, Eliada, and Eliphelet—nine in all."},{"num":9,"verse":"These were all the sons of David, besides the sons of the concubines. And Tamar was their sister."},{"num":10,"verse":"Solomon’s descendants [omitting nonreigning offspring] were: his son Rehoboam. Abijah was his son, Asa his son, Jehoshaphat his son,"},{"num":11,"verse":"Jehoram (Joram) his son, Ahaziah his son, Joash his son,"},{"num":12,"verse":"Amaziah his son, Azariah his son, Jotham his son,"},{"num":13,"verse":"Ahaz his son, Hezekiah his son, Manasseh his son,"},{"num":14,"verse":"Amon his son, Josiah his son."},{"num":15,"verse":"The descendants of Josiah: firstborn, Johanan; second, Jehoiakim; third, Zedekiah; fourth, Shallum."},{"num":16,"verse":"The descendants of Jehoiakim: Jehoiachin (Jeconiah) his son, Zedekiah his son."},{"num":17,"verse":"The descendants of Jehoiachin the captive: Shealtiel his son,"},{"num":18,"verse":"Malchiram, Pedaiah, Shenazzar, Jekamiah, Hoshama, and Nedabiah."},{"num":19,"verse":"The sons of Pedaiah: Zerubbabel and Shimei. The sons of Zerubbabel: Meshullam, Hananiah. And Shelomith was their sister;"},{"num":20,"verse":"And Hashubah, Ohel, Berechiah, Hasadiah, [and] Jushab-hesed—five [the sons of Meshullam?]."},{"num":21,"verse":"The sons of Hananiah: Pelatiah and Jeshaiah, whose son was Rephaiah, his son Arnan, his son Obadiah, his son Shecaniah."},{"num":22,"verse":"The son of Shecaniah: Shemaiah. The sons of Shemaiah: Hattush, Igal, Bariah, Neariah, and Shaphat—six in all."},{"num":23,"verse":"The sons of Neariah: Elioenai, Hizkiah, and Azrikam—three in all."},{"num":24,"verse":"The sons of Elioenai: Hodaviah, Eliashib, Pelaiah, Akkub, Johanan, Delaiah, and Anani—seven in all."}]