[{"num":3,"verse":"Now these were the Bnei Dovid, which were born unto him in Chevron; the bechor Amnon, of Achinoam of Yizre’el; the second Daniel, of Aviga’il of Carmel;"},{"num":2,"verse":"The third, Avshalom Ben Ma’achah Bat Talmai Melech Geshur; the fourth, Adoniyah Ben Chaggit;"},{"num":3,"verse":"The fifth, Shephatyah of Avital; the sixth, Yitream by Eglah his isha."},{"num":4,"verse":"These six were born unto him in Chevron; and there he reigned sheva shanim and shishah chodashim; and in Yerushalayim he reigned shloshim and shalosh shanah."},{"num":5,"verse":"And these were born unto him in Yerushalayim: Shimea, and Shovav, and Natan, and Sh’lomo, four, by Bat-Shu’a Bat Ammiel;"},{"num":6,"verse":"Yivchar also, and Elishama, and Eliphelet,"},{"num":7,"verse":"And Nogah, and Nepheg, and Yaphia,"},{"num":8,"verse":"And Elishama, and Elyada, and Eliphelet, nine."},{"num":9,"verse":"These were all the Bnei Dovid, besides the Bnei Pilagshim (concubines), and Tamar their achot."},{"num":10,"verse":"And Ben Sh’lomo was Rechav’am, Aviyah bno, Asa bno, Yehoshaphat bno,"},{"num":11,"verse":"Yoram bno, Achazyahu bno, Yoash bno,"},{"num":12,"verse":"Amatzyahu bno, Azaryah bno, Yotam bno,"},{"num":13,"verse":"Achaz bno, Chizkiyahu bno, Menasheh bno,"},{"num":14,"verse":"Amon bno, Yoshiyahu bno."},{"num":15,"verse":"And the Bnei Yoshiyahu were, the bechor Yochanan, the second Y’hoyakim, the third Tzidkiyahu, the fourth Shallum."},{"num":16,"verse":"And the Bnei Y’hoyakim; Yechanyah bno, Tzidkiyah bno."},{"num":17,"verse":"And the Bnei Yechanyah: Assir, She’alti’el bno,"},{"num":18,"verse":"Malkiram also, and Pedayah, Shenatzar, Yekamuyah, Hoshama, and Nedavyah."},{"num":19,"verse":"And the Ben Pedayah were: Zerubavel and Shimei. And Bnei Zerubavel: Meshullam, and Chananyah, and Shlomit their achot;"},{"num":20,"verse":"And Chashuvah, Ohel, Berechyah, Chasadyah, Yushav-chesed, 5."},{"num":21,"verse":"And the Ben Chananyah: Pelatyah, and Yeshayah, the Bnei Refayah, the Bnei Arnan, the Bnei Ovadyah, the Bnei Shechanyah."},{"num":22,"verse":"And the Bnei Shechanyah: Shema’yah; and the Bnei Shema’yah: Chattush, Igeal, Bariach, Nearyah, Shaphat, 6."},{"num":23,"verse":"The Ben Nearyah: Elyoenai, Chizkiyah, Azrikam, 3."},{"num":24,"verse":"And the Bnei Elyoenai were Hodavahu, and Elyashiv, and Pelayah, and Akuv, and Yochanan, and Delayah, and Anani, 7."}]