[{"header":"The Samaritans Stop the Work"},{"num":4,"verse":"When the enemies of Judah and Benjamin heard that the people who returned from exile were building a temple for the Lord God of Israel, "},{"num":2,"verse":"they approached Zerubbabel and the heads of the families. They told them, “We want to help you build because we worship the same God you worship. We have been sacrificing to him  since the time of King Esarhaddon of Assyria, who brought us here.”"},{"num":3,"verse":"But Zerubbabel, Jeshua, and the rest of the heads of Israel’s families told them, “It isn’t right for your people and our people to build a temple for our God together. We must build it alone for the Lord God of Israel, as King Cyrus of Persia ordered us to do.”"},{"num":4,"verse":"Then the people of that region discouraged the people of Judah and made them afraid to continue building. "},{"num":5,"verse":"They bribed officials to keep the people of Judah from carrying out their plans throughout the reign of King Cyrus of Persia until the reign of King Darius of Persia."},{"num":6,"verse":"When Xerxes began to rule, the enemies of Judah and Jerusalem wrote a letter in which they made an accusation against the inhabitants of Judah and Jerusalem."},{"num":7,"verse":"Bishlam, Mithredath, Tabeel, and the rest of their group wrote to him when Artaxerxes was king of Persia. The letter was written with the Aramaic script and translated into the Aramaic language."},{"num":8,"verse":"Rehum the commander and Shimshai the scribe wrote another letter against ⌞the people of⌟ Jerusalem to King Artaxerxes. "},{"num":9,"verse":"At that time, Rehum the commander and Shimshai the scribe were with the others of their group—the people from Denya, Partakka, Tarpel, Persia, Erech, Babylon, Susa, (that is, those of Elam), "},{"num":10,"verse":"and the rest of the people whom the great and noble Assurbanipal deported. (Assurbanipal settled them in the cities of Samaria and the rest of the lands west of the Euphrates River.) "},{"num":11,"verse":"This is the copy of the letter they sent to him:"},{"num":12,"verse":"Your Majesty, you should know that the Jews who came to us from you are now in Jerusalem. They are rebuilding that rebellious and wicked city. They are close to finishing the walls. The foundations are already in place. "},{"num":13,"verse":"You should also know that if this city is rebuilt and its walls are finished, the Jews will no longer pay taxes, fees, and tolls."},{"num":14,"verse":"Now, because we are paid by your palace, it isn’t right for us to watch something happen that will dishonor the king. So we are sending this letter to inform you "},{"num":15,"verse":"that you should search the official records of your predecessors. You will find in those official records that this city has been rebellious and has been a threat to kings and provinces. This city has a history of rebelliousness. That’s why this city was destroyed. "},{"num":16,"verse":"We want the king to know that if this city is rebuilt and its walls are finished, you will have nothing left ⌞of your province⌟ west of the Euphrates River."},{"num":17,"verse":"Then the king sent this reply:"},{"num":18,"verse":"The letter you sent me has been read word for word in my presence. "},{"num":19,"verse":"I gave the order, and a search was made. I discovered that this city has a long history of uprisings against kings. Its inhabitants are guilty of treason and rebellion. "},{"num":20,"verse":"Jerusalem has had powerful kings who have ruled the whole ⌞province⌟ west of the Euphrates. Taxes, fees, and tolls were paid to them. "},{"num":21,"verse":"So order these men to stop rebuilding. Keep this city from being rebuilt until I give the order. "},{"num":22,"verse":"Be careful not to neglect your duty in this matter. Why should I, the king, suffer any more harm?"},{"num":23,"verse":"Rehum the commander, Shimshai the scribe, and their group hurried to Jerusalem after hearing a copy of King Artaxerxes’ letter. They forced the Jews to stop rebuilding."},{"num":24,"verse":"Then the work on God’s temple in Jerusalem was stopped. Nothing more was done until Darius’ second year as king of Persia."}]