[{"header":"Enemies Oppose the Rebuilding of the Temple"},{"num":4,"verse":"The people who had returned from Babylon were building a temple to honor the Lord. He is the God of Israel. The enemies of Judah and Benjamin heard about it. "},{"num":2,"verse":"Then those enemies came to Zerubbabel. The family leaders of Israel were with him. The enemies said, “We want to help you build. We’re just like you. We worship your God. We offer sacrifices to him. We’ve been doing that ever since the time of Esarhaddon. He was king of Assyria. He brought our people here.”"},{"num":3,"verse":"Zerubbabel and Joshua answered them. So did the rest of the family leaders of Israel. They said, “You can’t help us build a temple to honor our God. You aren’t part of us. We’ll build it ourselves. We’ll do it to honor the Lord, the God of Israel. Cyrus, the king of Persia, commanded us to build it.”"},{"num":4,"verse":"Then the nations around Judah tried to make its people lose hope. They wanted to make them afraid to go on building. "},{"num":5,"verse":"So those nations paid some of the Jewish officials to work against the people of Judah. They wanted their plans to fail. They did it during the whole time Cyrus was king of Persia. They kept doing it until Darius became king."},{"header":"Later Enemies Also Oppose the Jews"},{"num":6,"verse":"The enemies of the Jews brought charges against the people of Judah and Jerusalem. It happened when Xerxes began to rule over Persia."},{"num":7,"verse":"Then Artaxerxes became king of Persia. During his rule, Bishlam, Mithredath, Tabeel and their friends wrote a letter to Artaxerxes. It was written in the Aramaic language. And it used the Aramaic alphabet."},{"num":8,"verse":"Rehum and Shimshai also wrote a letter to King Artaxerxes. Rehum was the commanding officer. Shimshai was the secretary. Their letter was against the people of Jerusalem. It said,"},{"num":11,"verse":"Here is a copy of the letter sent to Artaxerxes."},{"num":17,"verse":"The king replied,"},{"num":23,"verse":"The copy of the letter of King Artaxerxes was read to Rehum and Shimshai the secretary. It was also read to their friends. Right away they went to the Jews in Jerusalem. They forced them to stop their work."},{"num":24,"verse":"And so the work on the house of God in Jerusalem came to a stop. No more work was done on it until the second year that Darius was king of Persia."}]