[{"header":"Resistance Weakens the People"},{"num":4,"verse":"When the enemies of Judah and Benjamin heard that the returned exiles were building a temple for Adonai the God of Israel, "},{"num":2,"verse":"they approached Zerubbabel and the leading patriarchs and said to them, “Let us build with you, for like you we seek your God and have been sacrificing to Him since the days of Esarhaddon, king of Assyria, who brought us here.”"},{"num":3,"verse":"But Zerubbabel, Jeshua and the rest of the prominent patriarchs of Israel said to them, “It is not for you and us to build a House for our God—but we alone will build it for Adonai the God of Israel, just as Cyrus—king of Persia—has commanded us.”"},{"num":4,"verse":"Then the people of the land began discouraging the people of Judah and making them afraid to build. "},{"num":5,"verse":"They bribed advisors in order to thwart their plans all the days of King Cyrus of Persia and until the reign of Darius king of Persia."},{"num":6,"verse":"During the reign of Ahasuerus at the beginning of his reign, they wrote an accusation against the inhabitants of Judah and Jerusalem. "},{"num":7,"verse":"Also during the days of Artaxerxes, Bishlam, Mithredath, Tabeel and the rest of his associates wrote to Artaxerxes king of Persia. The letter was written in Aramaic and translated. "},{"num":8,"verse":"Rehum the commander and Shimshai the scribe wrote a letter concerning Jerusalem to King Artaxerxes as follows:"},{"num":9,"verse":"From Rehum the commander, Shimshai the scribe, and the rest of their associates—the judges and the officials, the magistrates, and governors over the Erechites, the Babylonians, the people of Susa (that is, the Elamites) "},{"num":10,"verse":"and the rest of the peoples whom the great and noble Ashurbanipal deported and settled in the city of Samaria and the rest of Trans-Euphrates."},{"num":11,"verse":"this is a copy of the letter they sent to him.)"},{"num":12,"verse":"let it be known to the king that the Jews who came up to us from you have gone to Jerusalem and are rebuilding the rebellious and wicked city. They are completing the walls and repairing the foundations."},{"num":13,"verse":"“Furthermore, let it be known to the king, that if this city is rebuilt and its walls are completed, no more tribute, taxes or duty will be paid and the royal revenue will suffer. "},{"num":14,"verse":"Now since we eat the salt of the palace, and it is not proper for us to see the king dishonored, we are sending this message to inform the king "},{"num":15,"verse":"so that a search may be made in the book of records of your fathers and you will discover in the records and know that this city is a rebellious city, harmful to kings and provinces, inciting internal revolts from ancient times. That is why this city was destroyed. "},{"num":16,"verse":"We are informing the king that if this city is rebuilt and its walls completed, you will no longer have any possession in Trans-Euphrates.”"},{"num":17,"verse":"The king sent this reply:"},{"num":18,"verse":"“The letter that you sent to us has been translated and read in my presence. "},{"num":19,"verse":"At my order a search was made and it was found that this city has from earliest times revolted against kings and that rebellion and sedition continually occur in it. "},{"num":20,"verse":"Mighty kings have ruled over Jerusalem governing all the Trans-Euphrates, and tribute, taxes, and duty were paid to them."},{"num":21,"verse":"“So now, issue a decree to stop these men—this city is not to be rebuilt until I issue a decree. "},{"num":22,"verse":"Be careful not to be negligent in this matter. Why should damage increase to the detriment of the kings?”"},{"num":23,"verse":"Then, as soon as the copy of the letter from King Artaxerxes was read in the presence of Rehum, Shimshai the scribe and their associates, they hurried off to the Jews in Jerusalem and by force and power compelled them to stop. "},{"num":24,"verse":"Thus the work on the House of God in Jerusalem ceased. It remained at a standstill until the second year of the reign of Darius king of Persia."}]