[{"num":1,"verse":"From Paul, who was called by the will of God to be an apostle of Christ Jesus, and from our brother Sosthenes—"},{"num":2,"verse":"To the church of God which is in Corinth, to all who are called to be God's holy people, who belong to him in union with Christ Jesus, together with all people everywhere who worship our Lord Jesus Christ, their Lord and ours:"},{"num":3,"verse":"May God our Father and the Lord Jesus Christ give you grace and peace."},{"header":"Blessings in Christ"},{"num":4,"verse":"I always give thanks to my God for you because of the grace he has given you through Christ Jesus. "},{"num":5,"verse":"For in union with Christ you have become rich in all things, including all speech and all knowledge. "},{"num":6,"verse":"The message about Christ has become so firmly established in you "},{"num":7,"verse":"that you have not failed to receive a single blessing, as you wait for our Lord Jesus Christ to be revealed. "},{"num":8,"verse":"He will also keep you firm to the end, so that you will be faultless on the Day of our Lord Jesus Christ. "},{"num":9,"verse":"God is to be trusted, the God who called you to have fellowship with his Son Jesus Christ, our Lord."},{"header":"Divisions in the Church"},{"num":10,"verse":"By the authority of our Lord Jesus Christ I appeal to all of you, my friends, to agree in what you say, so that there will be no divisions among you. Be completely united, with only one thought and one purpose. "},{"num":11,"verse":"For some people from Chloe's family have told me quite plainly, my friends, that there are quarrels among you. "},{"num":12,"verse":"Let me put it this way: each one of you says something different. One says, “I follow Paul”; another, “I follow Apollos”; another, “I follow Peter”; and another, “I follow Christ.” "},{"num":13,"verse":"Christ has been divided into groups! Was it Paul who died on the cross for you? Were you baptized as Paul's disciples?"},{"num":14,"verse":"I thank God that I did not baptize any of you except Crispus and Gaius. "},{"num":15,"verse":"No one can say, then, that you were baptized as my disciples. "},{"num":16,"verse":"(Oh yes, I also baptized Stephanas and his family; but I can't remember whether I baptized anyone else.) "},{"num":17,"verse":"Christ did not send me to baptize. He sent me to tell the Good News, and to tell it without using the language of human wisdom, in order to make sure that Christ's death on the cross is not robbed of its power."},{"header":"Christ the Power and the Wisdom of God"},{"num":18,"verse":"For the message about Christ's death on the cross is nonsense to those who are being lost; but for us who are being saved it is God's power. "},{"num":19,"verse":"The scripture says,"},{"num":20,"verse":"So then, where does that leave the wise? or the scholars? or the skillful debaters of this world? God has shown that this world's wisdom is foolishness!"},{"num":21,"verse":"For God in his wisdom made it impossible for people to know him by means of their own wisdom. Instead, by means of the so-called “foolish” message we preach, God decided to save those who believe. "},{"num":22,"verse":"Jews want miracles for proof, and Greeks look for wisdom. "},{"num":23,"verse":"As for us, we proclaim the crucified Christ, a message that is offensive to the Jews and nonsense to the Gentiles; "},{"num":24,"verse":"but for those whom God has called, both Jews and Gentiles, this message is Christ, who is the power of God and the wisdom of God. "},{"num":25,"verse":"For what seems to be God's foolishness is wiser than human wisdom, and what seems to be God's weakness is stronger than human strength."},{"num":26,"verse":"Now remember what you were, my friends, when God called you. From the human point of view few of you were wise or powerful or of high social standing. "},{"num":27,"verse":"God purposely chose what the world considers nonsense in order to shame the wise, and he chose what the world considers weak in order to shame the powerful. "},{"num":28,"verse":"He chose what the world looks down on and despises and thinks is nothing, in order to destroy what the world thinks is important. "},{"num":29,"verse":"This means that no one can boast in God's presence. "},{"num":30,"verse":"But God has brought you into union with Christ Jesus, and God has made Christ to be our wisdom. By him we are put right with God; we become God's holy people and are set free. "},{"num":31,"verse":"So then, as the scripture says, “Whoever wants to boast must boast of what the Lord has done.”"}]