[{"num":1,"verse":"I, Paul, am writing this letter. I have been chosen to be an apostle of Christ Jesus just as God planned. Our brother Sosthenes joins me in writing."},{"num":2,"verse":"We are sending this letter to you, the members of God’s church in Corinth. You have been made holy because you belong to Christ Jesus. God has chosen you to be his holy people. He has done the same for all people everywhere who pray to our Lord Jesus Christ. Jesus is their Lord and ours."},{"num":3,"verse":"May God our Father and the Lord Jesus Christ give you grace and peace."},{"header":"Paul Gives Thanks"},{"num":4,"verse":"I always thank my God for you. I thank him because of the grace he has given to you who belong to Christ Jesus. "},{"num":5,"verse":"You have been blessed in every way because of him. You have been blessed in all your speech and knowledge. "},{"num":6,"verse":"God has shown that what we have spoken to you about Christ is true. "},{"num":7,"verse":"There is no gift of the Holy Spirit that you don’t have. You are full of hope as you wait for our Lord Jesus Christ to come again. "},{"num":8,"verse":"God will also keep you strong in faith to the very end. Then you will be without blame on the day our Lord Jesus Christ returns. "},{"num":9,"verse":"God is faithful. He has chosen you to share life with his Son, Jesus Christ our Lord."},{"header":"Taking Sides in the Church"},{"num":10,"verse":"Brothers and sisters, I make my appeal to you. I do this in the name of our Lord Jesus Christ. I ask that all of you agree with one another in what you say. I ask that you don’t take sides. I ask that you are in complete agreement in all that you think. "},{"num":11,"verse":"My brothers and sisters, I have been told you are arguing with one another. Some people from Chloe’s house have told me this. "},{"num":12,"verse":"Here is what I mean. One of you says, “I follow Paul.” Another says, “I follow Apollos.” Another says, “I follow Peter.” And still another says, “I follow Christ.”"},{"num":13,"verse":"Does Christ take sides? Did Paul die on the cross for you? Were you baptized in the name of Paul? "},{"num":14,"verse":"I thank God that I didn’t baptize any of you except Crispus and Gaius. "},{"num":15,"verse":"No one can say that you were baptized in my name. "},{"num":16,"verse":"It’s true that I also baptized those who live in the house of Stephanas. Besides that, I don’t remember if I baptized anyone else. "},{"num":17,"verse":"Christ did not send me to baptize. He sent me to preach the good news. He commanded me not to preach with wisdom and fancy words. That would take all the power away from the cross of Christ."},{"header":"Christ Is God’s Power and Wisdom"},{"num":18,"verse":"The message of the cross seems foolish to those who are lost and dying. But it is God’s power to us who are being saved. "},{"num":19,"verse":"It is written,"},{"num":20,"verse":"Where is the wise person? Where is the teacher of the law? Where are the great thinkers of our time? Hasn’t God made the wisdom of the world foolish? "},{"num":21,"verse":"God wisely planned that the world would not know him through its own wisdom. It pleased God to use the foolish things we preach to save those who believe. "},{"num":22,"verse":"Jews require signs. Greeks look for wisdom. "},{"num":23,"verse":"But we preach about Christ and his death on the cross. That is very hard for Jews to accept. And everyone else thinks it’s foolish. "},{"num":24,"verse":"But there are those God has chosen, both Jews and Greeks. To them Christ is God’s power and God’s wisdom. "},{"num":25,"verse":"The foolish things of God are wiser than human wisdom. The weakness of God is stronger than human strength."},{"num":26,"verse":"Brothers and sisters, think of what you were when God chose you. Not many of you were considered wise by human standards. Not many of you were powerful. Not many of you belonged to important families. "},{"num":27,"verse":"But God chose the foolish things of the world to shame the wise. God chose the weak things of the world to shame the strong. "},{"num":28,"verse":"God chose the things of this world that are common and looked down on. God chose things considered unimportant to do away with things considered important. "},{"num":29,"verse":"So no one can boast to God. "},{"num":30,"verse":"Because of what God has done, you belong to Christ Jesus. He has become God’s wisdom for us. He makes us right with God. He makes us holy and sets us free. "},{"num":31,"verse":"It is written, “The one who boasts should boast about what the Lord has done.” (Jeremiah 9:24)"}]