[{"header":"Greetings"},{"num":1,"verse":"Paul, called as an emissary of Messiah Yeshua by the will of God, and Sosthenes our brother,"},{"num":2,"verse":"To God’s community in Corinth—having been made holy in Messiah Yeshua, called as kedoshim—with all who everywhere call on the name of our Lord Yeshua the Messiah, both theirs and ours:"},{"num":3,"verse":"Grace to you and shalom from God our Father, and the Lord Yeshua the Messiah!"},{"header":"Thanksgiving"},{"num":4,"verse":"I always thank my God for you because of God’s grace that was given to you in Messiah Yeshua. "},{"num":5,"verse":"For in Him you were made rich in every way—in all speaking and all knowledge—"},{"num":6,"verse":"just as the evidence of Messiah was confirmed among you. "},{"num":7,"verse":"So you are not lacking in any spiritual gift, as you eagerly wait for the revealing of our Lord Yeshua the Messiah. "},{"num":8,"verse":"He will also strengthen you until the end—blameless in the Day of our Lord Yeshua the Messiah. "},{"num":9,"verse":"God is faithful, through whom you were called into the fellowship of His Son, Yeshua the Messiah our Lord."},{"header":"Concern about Disunity"},{"num":10,"verse":"Now I urge you, brothers and sisters, through the name of our Lord Yeshua the Messiah, that you all speak the same thing and that there be no divisions among you, but that you be united in the same mind and in the same purpose. "},{"num":11,"verse":"For it has been reported to me concerning you, my brothers and sisters, by those who are from Chloe’s household, that there are rivalries among you. "},{"num":12,"verse":"I say this because you are each saying, “I follow Paul,” or “I follow Apollos,” or “I follow Kefa,” or “I follow Messiah.” "},{"num":13,"verse":"Has Messiah been divided? Paul wasn’t crucified for you, was he? Or were you immersed into the name of Paul? "},{"num":14,"verse":"I thank God that I immersed none of you, except Crispus and Gaius, "},{"num":15,"verse":"so that no one should say that I had immersed you into my own name. "},{"num":16,"verse":"(I also immersed the household of Stephanas; besides them, I don’t recall if I immersed anyone else.) "},{"num":17,"verse":"For Messiah sent me not to immerse, but to proclaim the Good News—not with cleverness of speech, so that the cross of Messiah would not be made of no effect."},{"header":"Whose Wisdom Is Foolish?"},{"num":18,"verse":"For the message of the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God. "},{"num":19,"verse":"For it is written,"},{"num":20,"verse":"Where is the wise one? Where is the Torah scholar? Where is the debater of this age? Hasn’t God made foolish the wisdom of the world?"},{"num":21,"verse":" For seeing that—in God’s wisdom—the world through its wisdom did not know God, God was pleased—through the foolishness of the message proclaimed—to save those who believe. "},{"num":22,"verse":"For Jewish people ask for signs and Greek people seek after wisdom, "},{"num":23,"verse":"but we proclaim Messiah crucified—a stumbling block to Jewish people and foolishness to Gentile people, "},{"num":24,"verse":"but to those who are called (both Jewish and Greek people), Messiah, the power of God and the wisdom of God. "},{"num":25,"verse":"For the foolishness of God is wiser than men, and the weakness of God is stronger than men."},{"num":26,"verse":"For you see your calling, brothers and sisters, that not many are wise according to human standards, not many are powerful, and not many are born well. "},{"num":27,"verse":"Yet God chose the foolish things of the world so He might put to shame the wise; and God chose the weak things of the world so He might put to shame the strong; "},{"num":28,"verse":"and God chose the lowly and despised things of the world, the things that are as nothing, so He might bring to nothing the things that are—"},{"num":29,"verse":"so that no human might boast before God. "},{"num":30,"verse":"But because of Him you are in Messiah Yeshua, who became to us wisdom from God and righteousness and holiness and redemption—"},{"num":31,"verse":"so that, just as it is written, “Let him who boasts, boast in Adonai.”"}]