[{"header":"A Plot To Kill Jesus"},{"num":22,"verse":"The Festival of Thin Bread, also called Passover, was near. "},{"num":2,"verse":"The chief priests and the teachers of the Law of Moses were looking for a way to get rid of Jesus, because they were afraid of what the people might do. "},{"num":3,"verse":"Then Satan entered the heart of Judas Iscariot, who was one of the twelve apostles."},{"num":4,"verse":"Judas went to talk with the chief priests and the officers of the temple police about how he could help them arrest Jesus. "},{"num":5,"verse":"They were very pleased and offered to pay Judas some money. "},{"num":6,"verse":"He agreed and started looking for a good chance to betray Jesus when the crowds were not around."},{"header":"Jesus Eats with His Disciples"},{"num":7,"verse":"The day had come for the Festival of Thin Bread, and it was time to kill the Passover lambs. "},{"num":8,"verse":"So Jesus said to Peter and John, “Go and prepare the Passover meal for us to eat.”"},{"num":9,"verse":"But they asked, “Where do you want us to prepare it?”"},{"num":10,"verse":"Jesus told them, “As you go into the city, you will meet a man carrying a jar of water. Follow him into the house "},{"num":11,"verse":"and say to the owner, ‘Our teacher wants to know where he can eat the Passover meal with his disciples.’ "},{"num":12,"verse":"The owner will take you upstairs and show you a large room ready for you to use. Prepare the meal there.”"},{"num":13,"verse":"Peter and John left. They found everything just as Jesus had told them, and they prepared the Passover meal."},{"header":"The Lord’s Supper"},{"num":14,"verse":"When the time came for Jesus and the apostles to eat, "},{"num":15,"verse":"he said to them, “I have very much wanted to eat this Passover meal with you before I suffer. "},{"num":16,"verse":"I tell you that I will not eat another Passover meal until it is finally eaten in God’s kingdom.”"},{"num":17,"verse":"Jesus took a cup of wine in his hands and gave thanks to God. Then he told the apostles, “Take this wine and share it with each other. "},{"num":18,"verse":"I tell you that I will not drink any more wine until God’s kingdom comes.”"},{"num":19,"verse":"Jesus took some bread in his hands and gave thanks for it. He broke the bread and handed it to his apostles. Then he said, “This is my body, which is given for you. Eat this as a way of remembering me!”"},{"num":20,"verse":"After the meal he took another cup of wine in his hands. Then he said, “This is my blood. It is poured out for you, and with it God makes his new agreement. "},{"num":21,"verse":"The one who will betray me is here at the table with me! "},{"num":22,"verse":"The Son of Man will die in the way that has been decided for him, but it will be terrible for the one who betrays him!”"},{"num":23,"verse":"Then the apostles started arguing about who would ever do such a thing."},{"header":"An Argument about Greatness"},{"num":24,"verse":"The apostles got into an argument about which one of them was the greatest. "},{"num":25,"verse":"So Jesus told them:"},{"header":"Jesus' Disciples Will Be Tested"},{"num":31,"verse":"Jesus said, “Simon, listen to me! Satan has demanded the right to test each one of you, as a farmer does when he separates wheat from the husks. "},{"num":32,"verse":"But Simon, I have prayed that your faith will be strong. And when you have come back to me, help the others.”"},{"num":33,"verse":"Peter said, “Lord, I am ready to go with you to jail and even to die with you.”"},{"num":34,"verse":"Jesus replied, “Peter, I tell you that before a rooster crows tomorrow morning, you will say three times that you don’t know me.”"},{"header":"Moneybags, Traveling Bags, and Swords"},{"num":35,"verse":"Jesus asked his disciples, “When I sent you out without a moneybag or a traveling bag or sandals, did you need anything?”"},{"num":36,"verse":"Jesus told them, “But now, if you have a moneybag, take it with you. Also take a traveling bag, and if you don’t have a sword, sell some of your clothes and buy one. "},{"num":37,"verse":"Do this because the Scriptures say, ‘He was considered a criminal.’ This was written about me, and it will soon come true.”"},{"num":38,"verse":"The disciples said, “Lord, here are two swords!”"},{"header":"Jesus Prays"},{"num":39,"verse":"Jesus went out to the Mount of Olives, as he often did, and his disciples went with him. "},{"num":40,"verse":"When they got there, he told them, “Pray that you won’t be tested.”"},{"num":41,"verse":"Jesus walked on a little way before he knelt down and prayed, "},{"num":42,"verse":"“Father, if you will, please don’t make me suffer by having me drink from this cup. But do what you want, and not what I want.”"},{"num":43,"verse":"Then an angel from heaven came to help him. "},{"num":44,"verse":"Jesus was in great pain and prayed so sincerely that his sweat fell to the ground like drops of blood."},{"num":45,"verse":"Jesus got up from praying and went over to his disciples. They were asleep and worn out from being so sad. "},{"num":46,"verse":"He said to them, “Why are you asleep? Wake up and pray that you won’t be tested.”"},{"header":"Jesus Is Arrested"},{"num":47,"verse":"While Jesus was still speaking, a crowd came up. It was led by Judas, one of the twelve apostles. He went over to Jesus and greeted him with a kiss."},{"num":48,"verse":"Jesus asked Judas, “Are you betraying the Son of Man with a kiss?”"},{"num":49,"verse":"When Jesus' disciples saw what was about to happen, they asked, “Lord, should we attack them with a sword?” "},{"num":50,"verse":"One of the disciples even struck at the high priest’s servant with his sword and cut off the servant’s right ear."},{"num":51,"verse":"“Enough of that!” Jesus said. Then he touched the servant’s ear and healed it."},{"num":52,"verse":"Jesus spoke to the chief priests, the temple police, and the leaders who had come to arrest him. He said, “Why do you come out with swords and clubs and treat me like a criminal? "},{"num":53,"verse":"I was with you every day in the temple, and you didn’t arrest me. But this is your time, and darkness is in control.”"},{"header":"Peter Says He Doesn’t Know Jesus"},{"num":54,"verse":"Jesus was arrested and led away to the house of the high priest, while Peter followed at a distance. "},{"num":55,"verse":"Some people built a fire in the middle of the courtyard and were sitting around it. Peter sat there with them, "},{"num":56,"verse":"and a servant girl saw him. Then after she had looked at him carefully, she said, “This man was with Jesus!”"},{"num":57,"verse":"Peter said, “Woman, I don’t even know that man!”"},{"num":58,"verse":"A little later someone else saw Peter and said, “You are one of them!”"},{"num":59,"verse":"About an hour later another man insisted, “This man must have been with Jesus. They both come from Galilee.”"},{"num":60,"verse":"Peter replied, “I don’t know what you are talking about!” Right then, while Peter was still speaking, a rooster crowed."},{"num":61,"verse":"The Lord turned and looked at Peter. And Peter remembered that the Lord had said, “Before a rooster crows tomorrow morning, you will say three times that you don’t know me.” "},{"num":62,"verse":"Then Peter went out and cried hard."},{"num":63,"verse":"The men who were guarding Jesus made fun of him and beat him. "},{"num":64,"verse":"They put a blindfold on him and said, “Tell us who struck you!” "},{"num":65,"verse":"They kept on insulting Jesus in many other ways."},{"header":"Jesus Is Questioned by the Council"},{"num":66,"verse":"At daybreak the nation’s leaders, the chief priests, and the teachers of the Law of Moses got together and brought Jesus before their council. "},{"num":67,"verse":"They said, “Tell us! Are you the Messiah?”"},{"num":68,"verse":"And if I asked you a question, you wouldn’t answer. "},{"num":69,"verse":"But from now on, the Son of Man will be seated at the right side of God All-Powerful.”"},{"num":70,"verse":"Then they asked, “Are you the Son of God?”"},{"num":71,"verse":"They replied, “Why do we need more witnesses? He said it himself!”"}]