[[],[{"type":"header","content":"Judas Agrees to Betray Jesus"},{"type":"prose","content":"The Festival of Unleavened Bread, which is also called Passover, was approaching."}],[{"type":"prose","content":"The leading priests and teachers of religious law were plotting how to kill Jesus, but they were afraid of the people’s reaction."}],[{"type":"prose","content":"Then Satan entered into Judas Iscariot, who was one of the twelve disciples,"}],[{"type":"prose","content":"and he went to the leading priests and captains of the Temple guard to discuss the best way to betray Jesus to them."}],[{"type":"prose","content":"They were delighted, and they promised to give him money."}],[{"type":"prose","content":"So he agreed and began looking for an opportunity to betray Jesus so they could arrest him when the crowds weren’t around."}],[{"type":"header","content":"The Last Supper"},{"type":"prose","content":"Now the Festival of Unleavened Bread arrived, when the Passover lamb is sacrificed."}],[{"type":"prose","content":"Jesus sent Peter and John ahead and said, "}],[{"type":"prose","content":"“Where do you want us to prepare it?” they asked him."}],[{"type":"prose","content":"He replied, "}],[],[],[{"type":"prose","content":"They went off to the city and found everything just as Jesus had said, and they prepared the Passover meal there."}],[{"type":"prose","content":"When the time came, Jesus and the apostles sat down together at the table."}],[{"type":"prose","content":"Jesus said, "}],[],[{"type":"prose","content":"Then he took a cup of wine and gave thanks to God for it. Then he said, "}],[],[{"type":"prose","content":"He took some bread and gave thanks to God for it. Then he broke it in pieces and gave it to the disciples, saying, "}],[{"type":"prose","content":"After supper he took another cup of wine and said, "}],[],[],[{"type":"prose","content":"The disciples began to ask each other which of them would ever do such a thing."}],[{"type":"prose","content":"Then they began to argue among themselves about who would be the greatest among them."}],[{"type":"prose","content":"Jesus told them, "}],[],[],[],[],[],[],[],[{"type":"header","content":"Jesus Predicts Peter’s Denial"},{"type":"prose","content":"Peter said, “Lord, I am ready to go to prison with you, and even to die with you.”"}],[{"type":"prose","content":"But Jesus said, "}],[{"type":"prose","content":"Then Jesus asked them, “No,” they replied."}],[{"type":"prose","content":" he said, "}],[],[{"type":"prose","content":"“Look, Lord,” they replied, “we have two swords among us.” he said."}],[{"type":"header","content":"Jesus Prays on the Mount of Olives"},{"type":"prose","content":"Then, accompanied by the disciples, Jesus left the upstairs room and went as usual to the Mount of Olives."}],[{"type":"prose","content":"There he told them, "}],[{"type":"prose","content":"He walked away, about a stone’s throw, and knelt down and prayed,"}],[],[{"type":"prose","content":"Then an angel from heaven appeared and strengthened him."}],[{"type":"prose","content":"He prayed more fervently, and he was in such agony of spirit that his sweat fell to the ground like great drops of blood."}],[{"type":"prose","content":"At last he stood up again and returned to the disciples, only to find them asleep, exhausted from grief."}],[{"type":"prose","content":" he asked them. "}],[{"type":"header","content":"Jesus Is Betrayed and Arrested"},{"type":"prose","content":"But even as Jesus said this, a crowd approached, led by Judas, one of the twelve disciples. Judas walked over to Jesus to greet him with a kiss."}],[{"type":"prose","content":"But Jesus said, "}],[{"type":"prose","content":"When the other disciples saw what was about to happen, they exclaimed, “Lord, should we fight? We brought the swords!”"}],[{"type":"prose","content":"And one of them struck at the high priest’s slave, slashing off his right ear."}],[{"type":"prose","content":"But Jesus said,  And he touched the man’s ear and healed him."}],[{"type":"prose","content":"Then Jesus spoke to the leading priests, the captains of the Temple guard, and the elders who had come for him.  he asked, "}],[],[{"type":"header","content":"Peter Denies Jesus"},{"type":"prose","content":"So they arrested him and led him to the high priest’s home. And Peter followed at a distance."}],[{"type":"prose","content":"The guards lit a fire in the middle of the courtyard and sat around it, and Peter joined them there."}],[{"type":"prose","content":"A servant girl noticed him in the firelight and began staring at him. Finally she said, “This man was one of Jesus’ followers!”"}],[{"type":"prose","content":"But Peter denied it. “Woman,” he said, “I don’t even know him!”"}],[{"type":"prose","content":"After a while someone else looked at him and said, “You must be one of them!”“No, man, I’m not!” Peter retorted."}],[{"type":"prose","content":"About an hour later someone else insisted, “This must be one of them, because he is a Galilean, too.”"}],[{"type":"prose","content":"But Peter said, “Man, I don’t know what you are talking about.” And immediately, while he was still speaking, the rooster crowed."}],[{"type":"prose","content":"At that moment the Lord turned and looked at Peter. Suddenly, the Lord’s words flashed through Peter’s mind: "}],[{"type":"prose","content":"And Peter left the courtyard, weeping bitterly."}],[{"type":"prose","content":"The guards in charge of Jesus began mocking and beating him."}],[{"type":"prose","content":"They blindfolded him and said, “Prophesy to us! Who hit you that time?”"}],[{"type":"prose","content":"And they hurled all sorts of terrible insults at him."}],[{"type":"header","content":"Jesus before the Council"},{"type":"prose","content":"At daybreak all the elders of the people assembled, including the leading priests and the teachers of religious law. Jesus was led before this high council,"}],[{"type":"prose","content":"and they said, “Tell us, are you the Messiah?”But he replied, "}],[],[],[{"type":"prose","content":"They all shouted, “So, are you claiming to be the Son of God?”And he replied, "}],[{"type":"prose","content":"“Why do we need other witnesses?” they said. “We ourselves heard him say it.”"}]]