[{"header":"Cities of Safety"},{"num":19,"verse":"The Lord your God is giving you land that belongs to other nations. He will destroy those nations. You will force them out and live in their cities and houses. "},{"num":2,"verse":"Then choose three cities. They must be in the middle of the land the Lord your God is giving you to own. "},{"num":3,"verse":"Build roads to those cities. And divide the land the Lord is giving you into three parts. Then someone who kills another person may run to these cities."},{"num":4,"verse":"This is the rule for someone who kills another person. He may run to one of these cities to save his life. But he must have killed his neighbor without meaning to kill him. He did not hate his neighbor. "},{"num":5,"verse":"A man might go into the forest with his neighbor to cut wood. The man swings his ax to cut down a tree. But the ax head flies off the handle. It hits his neighbor and kills him. The man who killed him may run to one of these cities to save his life. "},{"num":6,"verse":"Otherwise, the dead man’s relative who has the duty of punishing a murderer might be angry and chase him. And the relative might catch him if the city is far away. The relative might kill the man. But the man should not be killed because he did not mean to kill his neighbor. "},{"num":7,"verse":"This is why I command you to choose these three cities."},{"num":8,"verse":"Carefully obey all these laws I’m giving you today. Love the Lord your God. Always do what he wants you to do. Then the Lord your God will enlarge your land as he promised your ancestors. He will give you the whole land he promised to them. After that, choose three more cities of safety. "},{"num":10,"verse":"This is so that innocent people will not be killed in your land. The Lord your God is giving it to you to own. By doing this you will not be guilty of murder."},{"num":11,"verse":"But a person might hate his neighbor. And he might hide and wait for him. He might attack and kill him and then run to one of these cities for safety. "},{"num":12,"verse":"The elders of his own city should send for him. They should bring him back from the city of safety. And they should hand him over to the relative who has the duty of punishing the murderer. "},{"num":13,"verse":"Give him no mercy. You must remove from Israel the guilt of murdering innocent people. Then things will go well for you."},{"num":14,"verse":"Do not move the stone that marks the border of your neighbor’s land. People long ago set them in place. They mark what you inherit in the land the Lord your God is giving you to own."},{"header":"Rules About Witnesses"},{"num":15,"verse":"One witness is not enough to accuse a man of a crime or sin. A case must be proved by two or three witnesses."},{"num":16,"verse":"A witness might lie and accuse a person of a crime. "},{"num":17,"verse":"The two people who are arguing must stand before the Lord. They must stand before the priests and judges who are on duty. "},{"num":18,"verse":"The judges must check the matter carefully. The witness might be a liar. He might be lying about his fellow Israelite. "},{"num":19,"verse":"If so, he must be punished as he wanted his brother punished. You must get rid of the evil among you. "},{"num":20,"verse":"The rest of the people will hear about this and be afraid. No one among you will ever do such an evil thing again. "},{"num":21,"verse":"Give him no mercy. A life must be paid for a life. It must be an eye for an eye, a tooth for a tooth, a hand for a hand, a foot for a foot."}]