[{"header":"The Temporal and Eternal"},{"num":5,"verse":"For we know that if the earthly tent [our physical body] which is our house is torn down [through death], we have a building from God, a house not made with hands, eternal in the heavens. "},{"num":2,"verse":"For indeed in this house we groan, longing to be clothed with our [immortal, eternal] celestial dwelling, "},{"num":3,"verse":"so that by putting it on we will not be found naked. "},{"num":4,"verse":"For while we are in this tent, we groan, being burdened [often weighed down, oppressed], not that we want to be unclothed [separated by death from the body], but to be clothed, so that what is mortal [the body] will be swallowed up by life [after the resurrection]. "},{"num":5,"verse":"Now He who has made us and prepared us for this very purpose is God, who gave us the [Holy] Spirit as a pledge [a guarantee, a down payment on the fulfillment of His promise]."},{"num":6,"verse":"So then, being always filled with good courage and confident hope, and knowing that while we are at home in the body we are absent from the Lord— "},{"num":7,"verse":"for we walk by faith, not by sight [living our lives in a manner consistent with our confident belief in God’s promises]— "},{"num":8,"verse":"we are [as I was saying] of good courage and confident hope, and prefer rather to be absent from the body and to be at home with the Lord. "},{"num":9,"verse":"Therefore, whether we are at home [on earth] or away from home [and with Him], it is our [constant] ambition to be pleasing to Him. "},{"num":10,"verse":"For we [believers will be called to account and] must all appear before the judgment seat of Christ, so that each one may be repaid for what has been done in the body, whether good or bad [that is, each will be held responsible for his actions, purposes, goals, motives—the use or misuse of his time, opportunities and abilities]."},{"num":11,"verse":"Therefore, since we know the fear of the Lord [and understand the importance of obedience and worship], we persuade people [to be reconciled to Him]. But we are plainly known to God [He knows everything about us]; and I hope that we are plainly known also in your consciences [your God-given discernment]. "},{"num":12,"verse":"We are not commending ourselves to you again, but are giving you an occasion to be [rightfully] proud of us, so that you will have an answer for those who take pride in [outward] appearances [the virtues they pretend to have] rather than what is [actually] in heart. "},{"num":13,"verse":"If we are out of our mind [just unstable fanatics as some critics say], it is for God; if we are in our right mind, it is for your benefit. "},{"num":14,"verse":"For the love of Christ controls and compels us, because we have concluded this, that One died for all, therefore all died; "},{"num":15,"verse":"and He died for all, so that all those who live would no longer live for themselves, but for Him who died and was raised for their sake."},{"num":16,"verse":"So from now on we regard no one from a human point of view [according to worldly standards and values]. Though we have known Christ from a human point of view, now we no longer know Him in this way. "},{"num":17,"verse":"Therefore if anyone is in Christ [that is, grafted in, joined to Him by faith in Him as Savior], he is a new creature [reborn and renewed by the Holy Spirit]; the old things [the previous moral and spiritual condition] have passed away. Behold, new things have come [because spiritual awakening brings a new life]. "},{"num":18,"verse":"But all these things are from God, who reconciled us to Himself through Christ [making us acceptable to Him] and gave us the ministry of reconciliation [so that by our example we might bring others to Him], "},{"num":19,"verse":"that is, that God was in Christ reconciling the world to Himself, not counting people’s sins against them [but canceling them]. And He has committed to us the message of reconciliation [that is, restoration to favor with God]."},{"num":20,"verse":"So we are ambassadors for Christ, as though God were making His appeal through us; we [as Christ’s representatives] plead with you on behalf of Christ to be reconciled to God. "},{"num":21,"verse":"He made Christ who knew no sin to [judicially] be sin on our behalf, so that in Him we would become the righteousness of God [that is, we would be made acceptable to Him and placed in a right relationship with Him by His gracious lovingkindness]."}]