[{"num":5,"verse":"We know that our body—the tent we live in here on earth—will be destroyed. But when that happens, God will have a home for us to live in. It will not be the kind of home people build here. It will be a home in heaven that will continue forever."},{"num":2,"verse":"But now we are tired of this body. We want God to give us our heavenly home."},{"num":3,"verse":"It will clothe us and we will not be naked."},{"num":4,"verse":"While we live in this tent, we have burdens and so we complain. I don’t mean that we want to remove this tent, but we want to be clothed with our heavenly home. Then this body that dies will be covered with life."},{"num":5,"verse":"This is what God himself made us for. And he has given us the Spirit as the first payment to guarantee the life to come."},{"num":6,"verse":"So we always have confidence. We know that while we live in this body, we are away from the Lord."},{"num":7,"verse":"We live by what we believe will happen, not by what we can see."},{"num":8,"verse":"So I say that we have confidence. And we really want to be away from this body and be at home with the Lord."},{"num":9,"verse":"Our only goal is to always please the Lord, whether we are living here in this body or there with him."},{"num":10,"verse":"We must all stand before Christ to be judged. Everyone will get what they should. They will be paid for whatever they did—good or bad—when they lived in this earthly body."},{"header":"Helping People Become God’s Friends"},{"num":11,"verse":"We know what it means to fear the Lord, so we try to help people accept the truth. God knows what we really are, and I hope that in your hearts you know us too."},{"num":12,"verse":"We are not trying to prove ourselves to you again. But we are telling you about ourselves. We are giving you reasons to be proud of us. Then you will have an answer for those who are proud about what can be seen. They don’t care about what is in a person’s heart."},{"num":13,"verse":"If we are crazy, it is for God. If we have our right mind, it is for you."},{"num":14,"verse":"The love of Christ controls us, because we know that one person died for everyone. So all have died."},{"num":15,"verse":"He died for all so that those who live would not continue to live for themselves. He died for them and was raised from death so that they would live for him."},{"num":16,"verse":"From this time on we don’t think of anyone as the world thinks of people. It is true that in the past we thought of Christ as the world thinks. But we don’t think that way now."},{"num":17,"verse":"When anyone is in Christ, it is a whole new world. The old things are gone; suddenly, everything is new!"},{"num":18,"verse":"All this is from God. Through Christ, God made peace between himself and us. And God gave us the work of bringing people into peace with him."},{"num":19,"verse":"I mean that God was in Christ, making peace between the world and himself. In Christ, God did not hold people guilty for their sins. And he gave us this message of peace to tell people."},{"num":20,"verse":"So we have been sent to speak for Christ. It is like God is calling to people through us. We speak for Christ when we beg you to be at peace with God."},{"num":21,"verse":"Christ had no sin, but God made him become sin so that in Christ we could be right with God."}]