[{"num":5,"verse":"We know that if the earthly tent we live in is torn down, we have a building in heaven that comes from God, an eternal house not built by human hands. "},{"num":2,"verse":"For in this one we sigh, since we long to put on our heavenly dwelling. "},{"num":3,"verse":"Of course, if we do put it on, we will not be found without a body. "},{"num":4,"verse":"So while we are still in this tent, we sigh under our burdens, because we do not want to put it off but to put it on, so that our dying bodies may be swallowed up by life. "},{"num":5,"verse":"God has prepared us for this and has given us his Spirit as a guarantee."},{"num":6,"verse":"Therefore, we are always confident, and we know that as long as we are at home in this body we are away from the Lord. "},{"num":7,"verse":"For we live by faith, not by sight. "},{"num":8,"verse":"We are confident, then, and would prefer to be away from this body and to live with the Lord. "},{"num":9,"verse":"So whether we are at home or away from home, our goal is to be pleasing to him. "},{"num":10,"verse":"For all of us must appear before the judgment seat of the Messiah, so that each of us may receive what he deserves for what he has done in his body, whether good or worthless."},{"header":"The Messiah’s Love Controls Us"},{"num":11,"verse":"Therefore, since we know what it means to fear the Lord, we try to persuade people. We ourselves are perfectly known to God. I hope we are also really known to your consciences. "},{"num":12,"verse":"We are not recommending ourselves to you again but are giving you a reason to be proud of us, so that you can answer those who are proud of outward things rather than inward character. "},{"num":13,"verse":"So if we were crazy, it was for God; if we are sane, it is for you. "},{"num":14,"verse":"The love of the Messiah controls us, for we are convinced of this: that one person died for all people; therefore, all people have died. "},{"num":15,"verse":"He died for all people, so that those who live should no longer live for themselves but for the one who died and rose for them."},{"num":16,"verse":"So then, from now on we do not think of anyone from a human point of view. Even if we did think of the Messiah from a human point of view, we don’t think of him that way anymore. "},{"num":17,"verse":"Therefore, if anyone is in the Messiah, he is a new creation. Old things have disappeared, and—look!—all things have become new!"},{"num":18,"verse":"All of this comes from God, who has reconciled us to himself through the Messiah and has given us the ministry of reconciliation, "},{"num":19,"verse":"for through the Messiah, God was reconciling the world to himself by not counting their sins against them. He has committed his message of reconciliation to us. "},{"num":20,"verse":"Therefore, we are the Messiah’s representatives, as though God were pleading through us. We plead on the Messiah’s behalf: “Be reconciled to God!” "},{"num":21,"verse":"God made the one who did not know sin to be sin for us, so that God’s righteousness would be produced in us."}]