[{"header":"Waiting for Our New Bodies"},{"num":5,"verse":"We know that the earthly tent we live in will be destroyed. But we have a building made by God. It is a house in heaven that lasts forever. Human hands did not build it. "},{"num":2,"verse":"During our time on earth we groan. We long to put on our house in heaven as if it were clothing. "},{"num":3,"verse":"Then we will not be naked. "},{"num":4,"verse":"While we live in this tent of ours, we groan under our heavy load. We don’t want to be naked. Instead, we want to be fully dressed with our house in heaven. What must die will be swallowed up by life. "},{"num":5,"verse":"God has formed us for that very purpose. He has given us the Holy Spirit as a down payment. The Spirit makes us sure of what is still to come."},{"num":6,"verse":"So here is what we can always be certain about. As long as we are at home in our bodies, we are away from the Lord. "},{"num":7,"verse":"We live by believing, not by seeing. "},{"num":8,"verse":"We are certain about that. We would rather be away from our bodies and at home with the Lord. "},{"num":9,"verse":"So we try our best to please him. We want to please him whether we are at home in our bodies or away from them. "},{"num":10,"verse":"We must all stand in front of Christ to be judged. Each one of us will be judged for what we do while in our bodies. We’ll be judged for the good things and the bad things. Then each of us will receive what we are supposed to get."},{"header":"Christ Brings Us Back to God"},{"num":11,"verse":"We know what it means to have respect for the Lord. So we try to help other people to understand it. What we are is plain to God. I hope it is also plain to your way of thinking. "},{"num":12,"verse":"We are not trying to make an appeal to you again. But we are giving you a chance to take pride in us. Some people take pride in their looks rather than what’s in their hearts. If you take pride in us, you will be able to answer them. "},{"num":13,"verse":"Are we “out of our minds,” as some people say? If so, it is because we want to serve God. Does what we say make sense? If so, it is because we want to serve you. "},{"num":14,"verse":"Christ’s love controls us. We are sure that one person died for everyone. And so everyone died. "},{"num":15,"verse":"Christ died for everyone. He died so that those who live should not live for themselves anymore. They should live for Christ. He died for them and was raised again."},{"num":16,"verse":"So from now on we don’t look at anyone the way the world does. At one time we looked at Christ in that way. But we don’t anymore. "},{"num":17,"verse":"When anyone lives in Christ, the new creation has come. The old is gone! The new is here! "},{"num":18,"verse":"All this is from God. He brought us back to himself through Christ’s death on the cross. And he has given us the task of bringing others back to him through Christ. "},{"num":19,"verse":"God was bringing the world back to himself through Christ. He did not hold people’s sins against them. God has trusted us with the message that people may be brought back to him. "},{"num":20,"verse":"So we are Christ’s official messengers. It is as if God were making his appeal through us. Here is what Christ wants us to beg you to do. Come back to God! "},{"num":21,"verse":"Christ didn’t have any sin. But God made him become sin for us. So we can be made right with God because of what Christ has done for us."}]