[{"num":5,"verse":"For we know that if the earthly tent we live in is destroyed, we have a building from God, a house not made with hands, eternal in the heavens. "},{"num":2,"verse":"For in this tent we groan, longing to be clothed with our heavenly dwelling— "},{"num":3,"verse":"if indeed, when we have taken it off we will not be found naked. "},{"num":4,"verse":"For while we are still in this tent, we groan under our burden, because we wish not to be unclothed but to be further clothed, so that what is mortal may be swallowed up by life. "},{"num":5,"verse":"He who has prepared us for this very thing is God, who has given us the Spirit as a guarantee."},{"num":6,"verse":"So we are always confident; even though we know that while we are at home in the body we are away from the Lord— "},{"num":7,"verse":"for we walk by faith, not by sight. "},{"num":8,"verse":"Yes, we do have confidence, and we would rather be away from the body and at home with the Lord. "},{"num":9,"verse":"So whether we are at home or away, we make it our aim to please him. "},{"num":10,"verse":"For all of us must appear before the judgement seat of Christ, so that each may receive recompense for what has been done in the body, whether good or evil."},{"header":"The Ministry of Reconciliation"},{"num":11,"verse":"Therefore, knowing the fear of the Lord, we try to persuade others; but we ourselves are well known to God, and I hope that we are also well known to your consciences. "},{"num":12,"verse":"We are not commending ourselves to you again, but giving you an opportunity to boast about us, so that you may be able to answer those who boast in outward appearance and not in the heart. "},{"num":13,"verse":"For if we are beside ourselves, it is for God; if we are in our right mind, it is for you. "},{"num":14,"verse":"For the love of Christ urges us on, because we are convinced that one has died for all; therefore all have died. "},{"num":15,"verse":"And he died for all, so that those who live might live no longer for themselves, but for him who died and was raised for them."},{"num":16,"verse":"From now on, therefore, we regard no one from a human point of view; even though we once knew Christ from a human point of view, we know him no longer in that way. "},{"num":17,"verse":"So if anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! "},{"num":18,"verse":"All this is from God, who reconciled us to himself through Christ, and has given us the ministry of reconciliation; "},{"num":19,"verse":"that is, in Christ God was reconciling the world to himself, not counting their trespasses against them, and entrusting the message of reconciliation to us. "},{"num":20,"verse":"So we are ambassadors for Christ, since God is making his appeal through us; we entreat you on behalf of Christ, be reconciled to God. "},{"num":21,"verse":"For our sake he made him to be sin who knew no sin, so that in him we might become the righteousness of God."}]