[{"header":"Living by Faith"},{"num":5,"verse":"We are convinced that even if these bodies we live in are folded up at death like tents, we will still have a God-built home that no human hands have built, which will last forever in the heavenly realm. "},{"num":2,"verse":"We inwardly sigh as we live in these physical “tents,” longing to put on a new body for our life in heaven, "},{"num":3,"verse":"in the belief that once we put on our new “clothing” we won’t find ourselves “naked.” "},{"num":4,"verse":"So, while living in this “tent,” we groan under its burden, not because we want to die but because we want these new bodies. We crave for all that is mortal to be swallowed up by eternal life. "},{"num":5,"verse":"And this is no empty hope, for God himself is the one who has prepared us for this wonderful destiny. And to confirm this promise, he has given us the Holy Spirit, like an engagement ring, as a guarantee."},{"num":6,"verse":"That’s why we’re always full of courage. Even while we’re at home in the body, we’re homesick to be with the Master—"},{"num":7,"verse":"for we live by faith, not by what we see with our eyes. "},{"num":8,"verse":"We live with a joyful confidence, yet at the same time we take delight in the thought of leaving our bodies behind to be at home with the Lord. "},{"num":9,"verse":"So whether we live or die we make it our life’s passion to live our lives pleasing to him. "},{"num":10,"verse":"For one day we will all be openly revealed before Christ on his throne so that each of us will be duly recompensed for our actions done in life, whether good or worthless."},{"header":"The Message of Reconciliation"},{"num":11,"verse":"Since we are those who stand in holy awe of the Lord, we make it our passion to persuade others to turn to him. We know that our lives are transparent before the God who knows us fully, and I hope that we are also well known to your consciences. "},{"num":12,"verse":"Again, we are not taking an opportunity to brag, but giving you information that will enable you to be proud of us, and to answer those who esteem outward appearances while overlooking what is in the heart."},{"num":13,"verse":"If we are out of our minds in a blissful, divine ecstasy, it is for God, but if we are in our right minds, it is for your benefit. "},{"num":14,"verse":"For it is Christ’s love that fuels our passion and holds us tightly, because we are convinced that he has given his life for all of us. This means all died with him, "},{"num":15,"verse":"so that those who live should no longer live self-absorbed lives but lives that are poured out for him—the one who died for us and now lives again. "},{"num":16,"verse":"So, from now on, we refuse to evaluate people merely by their outward appearances. For that’s how we once viewed the Anointed One, but no longer do we see him with limited human insight."},{"num":17,"verse":"Now, if anyone is enfolded into Christ, he has become an entirely new person. All that is related to the old order has vanished. Behold, everything is fresh and new. "},{"num":18,"verse":"And God has made all things new, and reconciled us to himself, and given us the ministry of reconciling others to God. "},{"num":19,"verse":"In other words, it was through the Anointed One that God was shepherding the world, not even keeping records of their transgressions, and he has entrusted to us the ministry of opening the door of reconciliation to God. "},{"num":20,"verse":"We are ambassadors of the Anointed One who carry the message of Christ to the world, as though God were tenderly pleading with them directly through our lips. So we tenderly plead with you on Christ’s behalf, “Turn back to God and be reconciled to him.” "},{"num":21,"verse":"For God made the only one who did not know sin to become sin for us, so that we might become the righteousness of God through our union with him."}]