[{"header":"The Lord Will Punish the Earth"},{"num":24,"verse":"The Lord is going to devastate the earth and leave it desolate. He will twist the earth's surface and scatter its people. "},{"num":2,"verse":"Everyone will meet the same fate—the priests and the people, slaves and masters, buyers and sellers, lenders and borrowers, rich and poor. "},{"num":3,"verse":"The earth will lie shattered and ruined. The Lord has spoken and it will be done."},{"num":4,"verse":"The earth dries up and withers; the whole world grows weak; both earth and sky decay. "},{"num":5,"verse":"The people have defiled the earth by breaking God's laws and by violating the covenant he made to last forever. "},{"num":6,"verse":"So God has pronounced a curse on the earth. Its people are paying for what they have done. Fewer and fewer remain alive. "},{"num":7,"verse":"The grapevines wither, and wine is becoming scarce. Everyone who was once happy is now sad, "},{"num":8,"verse":"and the joyful music of their harps and drums has ceased. "},{"num":9,"verse":"There is no more happy singing over wine; no one enjoys its taste any more. "},{"num":10,"verse":"In the city everything is in chaos, and people lock themselves in their houses for safety. "},{"num":11,"verse":"People shout in the streets because there is no more wine. Happiness is gone forever; it has been banished from the land. "},{"num":12,"verse":"The city is in ruins, and its gates have been broken down. "},{"num":13,"verse":"This is what will happen in every nation all over the world. It will be like the end of harvest, when the olives have been beaten off every tree and the last grapes picked from the vines."},{"num":14,"verse":"Those who survive will sing for joy. Those in the West will tell how great the Lord is, "},{"num":15,"verse":"and those in the East will praise him. The people who live along the sea will praise the Lord, the God of Israel. "},{"num":16,"verse":"From the most distant parts of the world we will hear songs in praise of Israel, the righteous nation."},{"num":17,"verse":"Listen to me, everyone! There are terrors, pits, and traps waiting for you. "},{"num":18,"verse":"Anyone who tries to escape from the terror will fall in a pit, and anyone who escapes from the pit will be caught in a trap. Torrents of rain will pour from the sky, and earth's foundations will shake. "},{"num":19,"verse":"The earth will crack and shatter and split open. "},{"num":20,"verse":"The earth itself will stagger like a drunk, sway like a hut in a storm. The world is weighed down by its sins; it will collapse and never rise again."},{"num":21,"verse":"A time is coming when the Lord will punish the powers above and the rulers of the earth. "},{"num":22,"verse":"God will crowd kings together like prisoners in a pit. He will shut them in prison until the time of their punishment comes. "},{"num":23,"verse":"The moon will grow dark, and the sun will no longer shine, for the Lord Almighty will be king. He will rule in Jerusalem on Mount Zion, and the leaders of the people will see his glory."}]