[{"num":1,"verse":"The burden which Habakkuk the prophet did see."},{"num":2,"verse":"Jehovah, how long shall I cry and thou wilt not hear? I cry out unto thee, Violence! and thou dost not save."},{"num":3,"verse":"Why dost thou cause me to see iniquity, and lookest thou upon grievance? For spoiling and violence are before me; and there is strife, and contention riseth up."},{"num":4,"verse":"Therefore the law is powerless, and justice doth never go forth; for the wicked encompasseth the righteous; therefore judgment goeth forth perverted."},{"num":5,"verse":"See ye among the nations, and behold, and wonder marvellously; for [I] work a work in your days, which ye will not believe, though it be declared [to you]."},{"num":6,"verse":"For behold, I raise up the Chaldeans, that bitter and impetuous nation, which marcheth through the breadth of the earth, to possess dwelling-places that are not theirs."},{"num":7,"verse":"They are terrible and dreadful: their judgment and their dignity proceed from themselves."},{"num":8,"verse":"And their horses are swifter than the leopards, and are more agile than the evening wolves; and their horsemen prance proudly, and their horsemen come from afar: they fly as an eagle that hasteth to devour."},{"num":9,"verse":"They come all of them for violence: the crowd of their faces is forwards, and they gather captives as the sand."},{"num":10,"verse":"Yea, he scoffeth at kings, and princes are a scorn unto him; he derideth every stronghold: for he heapeth up dust, and taketh it."},{"num":11,"verse":"Then will his mind change, and he will pass on, and become guilty: this his power is become his +god."},{"num":12,"verse":"—Art thou not from everlasting, Jehovah my God, my Holy One? We shall not die. Jehovah, thou hast ordained him for judgment; and thou, O Rock, hast appointed him for correction."},{"num":13,"verse":"[Thou art] of purer eyes than to behold evil, and canst not look on mischief: wherefore lookest thou upon them that deal treacherously, [and] keepest silence when the wicked swalloweth up a [man] more righteous than he?"},{"num":14,"verse":"And thou makest men as the fishes of the sea, as the creeping things, that have no ruler over them."},{"num":15,"verse":"He taketh up all of them with the hook, he catcheth them in his net, and gathereth them into his drag; therefore he rejoiceth and is glad:"},{"num":16,"verse":"therefore he sacrificeth unto his net, and burneth incense unto his drag; for by them his portion is become fat, and his meat dainty."},{"num":17,"verse":"Shall he therefore empty his net, and not spare to slay the nations continually?"}]