[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He hath settled on his lees.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The image, found also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is drawn from the practice of pouring wine from one vessel into another to clarify it and improve its flavour. Wine not so treated retained its first crude bitterness. So, the prophet says, it is with nations. It is not good for them to remain too long in a prosperity which does but strengthen their natural arrogance. There is a wholesome discipline in defeat, even in exile. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we have the hope of the prophet that the discipline will do its work. The “vessels” and “bottles” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are, of course, the cities and villages of Moab. (Comp. the imagery of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 48:11-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 48:11-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moab hath been at ease ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath been opulent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the Chaldee renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "שׁאנן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from his youth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Moab was an ancient kingdom, and had enjoyed great tranquillity, though a small country and surrounded with potent neighbours. It had now been in a state of peace and prosperity since the time of Shalmaneser, having experienced no particular calamity since the judgment foretold by Isaiah, and inflicted by that prince; so that there were forty years between that affliction and this here spoken of. The comparison between the state of the Moabites and that of wine is elegant, and is kept up with great propriety. All wines, it is said, ought to be kept for some time upon their lees, in order to preserve their strength and flavour; on which account ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the lees ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are expressed by a word that signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the preservers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Wine is apt to be damaged by being drawn off too soon into other vessels. By this allegory, therefore, Moab is represented as having enjoyed singular advantages from having constantly remained in his own country ever since he became a people. And the prophet’s words imply, that the Moabites had increased in pride and insolence in proportion to the duration of their national tranquillity and prosperity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, saith the Lord, I will send unto him wanderers ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The Chaldean soldiers, that come out of a foreign country. These shall make a prey of him, and carry off as much of his wealth as they can, and spoil the rest. Blaney thinks the allegory begun in the preceding verse, is here continued and accordingly renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "וצעים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tilters, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "observing, that the Chaldeans, who are here designed, “should lower the vessels of Moab, namely, the cities, and empty them; and also break to pieces their bottles or pitchers, that is, destroy the lesser towns and villages, dependant on the cities; to which the bottles, or pitchers, answer, being filled with the redundancy of the larger vessels.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "48:1-13. The Chaldeans are to destroy the Moabites. We should be thankful that we are required to seek the salvation of men's lives, and the salvation of their souls, not to shed their blood; but we shall be the more without excuse if we do this pleasant work deceitfully. The cities shall be laid in ruins, and the country shall be wasted. There will be great sorrow. There will be great hurry. If any could give wings to sinners, still they could not fly out of the reach of Divine indignation. There are many who persist in unrepented iniquity, yet long enjoy outward prosperity. They had been long corrupt and unreformed, secure and sensual in prosperity. They have no changes of their peace and prosperity, therefore their hearts and lives are unchanged, Ps 55:19.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Moab from the time it conquered the Emims ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 2:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so became a nation, had retained quiet possession of its land, and enjoyed comparative prosperity. From the Moabite Stone we gather that King Mesha, after the death of Ahab threw off the yoke of Israel; nor except for a short time under Jeroboam II was Israel able to bring the Moabites back into subjection. They gradually drove the Reubenites back, and recovered most of the territory taken from the Amorites by Moses, and which originally had belonged to them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He hath settled on his lees - Good wine was thought to be the better for being left to stand upon its sediment Isaiah 25:6, and in all cases its flavor was rendered thereby stronger (marginal reference). \"By being emptied from vessel to vessel\" it became vapid and tasteless. So a nation by going into captivity is rendered tame and feeble. By his taste is meant the flavor of the wine, and so Moab's national character. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He hath settled on his lees - Good wine was thought to be the better for being left to stand upon its sediment ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and in all cases its flavor was rendered thereby stronger (marginal reference). \"By being emptied from vessel to vessel\" it became vapid and tasteless. So a nation by going into captivity is rendered tame and feeble. By his taste is meant the flavor of the wine, and so Moab's national character. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. settled on … lees—(See on [978]Isa 25:6; Zep 1:12). As wine left to settle on its own lees retains its flavor and strength (which it would lose by being poured from one vessel into another), so Moab, owing to its never having been dislodged from its settlements, retains its pride of strength unimpaired.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "emptied from vessel, &c.—To make it fit for use, it used to be filtered from vessel to vessel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "scent—retaining the image: the bouquet or perfume of the wine.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Moab hath been at ease from his youth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Moabites ever since they began to be a people have been a quiet people, not exercised with wars, and enemies making inroads upon them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He hath settled on his lees; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " like to a cask of wine, that hath not been racked, but hath continued in the same state. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And hath not been emptied from vessel to vessel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he follows the metaphor of wine, which is drawn out from vessel to vessel, when it is drawn off the lees. It is expounded by the next words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "neither hath he gone into captivity.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " And this is the reason why they retain their old sins, pride, presumption, luxury, and old wickednesses, as wine while it remaineth in the lees retains more its nature, strength, and colour than when it is once racked. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Moab hath been at ease from his youth,.... Lived in great peace and prosperity from the time they became a kingdom; being very little disturbed with wars by their neighbours, or very rarely; so that they were in very prosperous and flourishing circumstances, which occasioned that pride and haughtiness they were notorious for. This is an emblem of unregenerate men; who, though sinners from their birth, and liable to the curse of the law, subject to the stroke of death, and must come to judgment; yet stupid and quite at ease, having no sight of sin, nor feeling of the burden of its guilt, nor grief or trouble for it; no sense of danger, or fear of hell; but in the utmost security: all which arise from ignorance, hardness of heart, profaneness, and infidelity; thoughtlessness about their immortal souls; putting the evil day far from them; and being under the influence of Satan, who keeps his goods in peace: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he hath settled on his lees; a metaphor taken from wine; which, the longer it remains on the lees, the better body it has, and the richer and stronger it is; and denotes the great tranquillity of the Moabites; the riches they were possessed of, and in which they trusted. The Targum renders it, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"quiet in their substance;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "herein they were an emblem of unconverted sinners, who are settled and hardened in the corruptions of their nature; and not at all disturbed at the evil of sin; the wrath of God; his judgments on men; the last and awful judgment; or at the terrors of hell; and likewise of such who trust in their own righteousness, and depend upon that for salvation: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and hath not been emptied from vessel to vessel; like wine that has never been racked off from the vessel or vessels it was first put into: they were never removed from place to place, but always continued in their land; in which they were an emblem of such who have never seen their own emptiness, and their want of the grace of God, and have never been emptied of sin, nor of self-righteousness: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither hath he gone into captivity; this explains in proper words the metaphor in the preceding clause: the Moabites had never been carried captive out of their own land into others; an emblem of such who have never seen their captive state to sin and Satan; or ever brought to complain of it, or become the captives of Christ; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore his taste remained in him, and his scent is not changed; his wealth, riches, and prosperity, continued without any change and alteration; and also his sins and vices, idolatry, pride, luxury, and which were the cause of his ruin; and for that reason are here mentioned; an emblem of unregenerate men, whose taste is vitiated by sin, and continues as it was originally; they relish sin, and disrelish everything that is good; and savour the things that be of man, and not the things of God; and so are in a most dangerous condition. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "therefore his taste remained in him, and his scent is not changed; his wealth, riches, and prosperity, continued without any change and alteration; and also his sins and vices, idolatry, pride, luxury, and which were the cause of his ruin; and for that reason are here mentioned; an emblem of unregenerate men, whose taste is vitiated by sin, and continues as it was originally; they relish sin, and disrelish everything that is good; and savour the things that be of man, and not the things of God; and so are in a most dangerous condition. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Moab hath been at ease from his youth, and he hath settled on his lees, and hath not been {i} emptied from vessel to vessel, neither hath he gone into captivity: therefore his taste remained in him, and his scent is not changed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Moab hath been at ease from his youth, and he hath settled on his lees, and hath not been ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " emptied from vessel to vessel, neither hath he gone into captivity: therefore his taste remained in him, and his scent is not changed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Has not been removed as the Jews have, but have lived at ease, and as a wine that feeds itself on his lees.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moab hath been at ease from his youth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] He hath not been driven from his land hitherto. The feeling of horror at suffering expatriation, as compared with the consequences of a more ordinary defeat in battle such as the nation had often suffered in past time, is well exhibited by these verses.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "settled on his lees",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Wine improved by being allowed to rest upon its sediment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but contrast the use of the figure in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Its “taste” and “scent” were unimpaired. If emptied from vessel to vessel it would become vapid, without fragrance and tasteless. Something like this was now to happen to the nation by being taken captives.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "11–19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See introd. summary to the ch.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Moab hath been at ease from his youth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The \"youth\" of Moab dates from its subjugation of the aboriginal Emim (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")' Since that event, though often at war, sometimes tributary and sometimes expelled from a part of the territory claimed by them (see the inscription on the Moabite Stone), yet they had  never been disturbed in their ancestral homes to the south of the river Amen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath settled on his less.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It was the custom to leave wine for a time on its lees or sediment, in order to heighten its strength and flavour (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Emptied from vessel to vessel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Thevenot, an old traveller in Persia, remarks of the Shiraz wine that, after it is separated from the lees, it is apt to grow sour. \"The wine is put into large earthen jars, each holding from ten or twelve to fourteen ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "carabas",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but when a jar has been opened, it must be emptied as soon as possible, and the wine put into bottles or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "carabas",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", otherwise it spoils and becomes sour\" ('Voyages,' 2:245, quoted by Lowth on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the application of the figure, the \"taste\" of Moab means obviously the national character. Jeremiah 48:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The devastation is a work of the Lord, and those who execute it must carry out the divine decree, so that they may not bring the curse upon themselves. The first clause is taken quite generally: the more exact specification of the work of the Lord follows in the second clause; it is the employment of the sword against Moab. \"His sword\" does not mean Jahveh's, but the sword carried by the devastator. רמיּה is used adverbially, but not in the sense of \"deceitfully,\" rather \"carelessly, negligently;\" cf. כּף רמיּה, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 12:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows the reason why the judgment has necessarily come on Moab. Moab is compared to old wine that has lain long on its lees, and thereby preserved its flavour and smell unchanged. The taste and odour of Moab signify his disposition towards other nations, particularly towards Israel, the people of God. Good wine becomes stronger and more juicy by lying pretty long on its lees (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); inferior wine, however, becomes thereby more harsh and thick. The figure is used here in the latter sense, after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Moab's disposition towards Israel was harsh and bitter; the people were arrogant and proud (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and so hostile towards Israel, that they sought every opportunity of injuring them (see above, p. 385f., and the comments on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). From his youth, i.e., from the time when Moab, after subduing the Emims (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), had established himself in his own land, or had become enrolled among the nations of history, - from that time forward had he remained undisturbed in his own land, i.e., without being driven out of it, had not gone into captivity (as is shown by the figure of the wine poured from one vessel into another). In this way there is a qualification made of the general statement that he remains at rest on his lees, and undisturbed. For Moab has often carried on wars, and even suffered many defeats, but has never yet been driven from his own land; nor had the temporary dependence on Israel exercised any transforming influence on the ordinary life of the people, for they were simply made tributary. This quiet continuance in the country is to cease. The God of Israel \"will send to them cellarmen (Germ. Schrter), who shall bring them out of the cellar\" (Germ. ausschroten), as Luther translates ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Schrter\" are men who bring the wine-casks out of the cellar; for \"schroten\" means to bring out heavy burdens, especially full casks on a strong kind of hand-barrow (Germ. Hebewerkzeug), like a ladder in appearance. צעים (from צעה, to bend, incline) are those who incline a barrel or vessel for the purpose or pouring out its contents. These will not merely empty the vessels, but also break the pitchers; i.e., not merely carry away the Moabites, but also break down their political organization, and destroy their social arrangements.",
        "children": []
      }
    ]
  }
]