[{"header":"Chapter 15"},{"num":1,"verse":"Debts and the Poor. At the end of every seven-year period you shall have a remission of debts, "},{"num":2,"verse":"and this is the manner of the remission. Creditors shall remit all claims on loans made to a neighbor, not pressing the neighbor, one who is kin, because the Lord’s remission has been proclaimed. "},{"num":3,"verse":"You may press a foreigner, but you shall remit the claim on what your kin owes to you. "},{"num":4,"verse":"However, since the Lord, your God, will bless you abundantly in the land the Lord, your God, will give you to possess as a heritage, there shall be no one of you in need "},{"num":5,"verse":"if you but listen to the voice of the Lord, your God, and carefully observe this entire commandment which I enjoin on you today. "},{"num":6,"verse":"Since the Lord, your God, will bless you as he promised, you will lend to many nations, and borrow from none; you will rule over many nations, and none will rule over you."},{"num":7,"verse":"If one of your kindred is in need in any community in the land which the Lord, your God, is giving you, you shall not harden your heart nor close your hand against your kin who is in need. "},{"num":8,"verse":"Instead, you shall freely open your hand and generously lend what suffices to meet that need. "},{"num":9,"verse":"Be careful not to entertain the mean thought, “The seventh year, the year of remission, is near,” so that you would begrudge your kin who is in need and give nothing, and your kin would cry to the Lord against you and you would be held guilty. "},{"num":10,"verse":"When you give, give generously and not with a stingy heart; for that, the Lord, your God, will bless you in all your works and undertakings. "},{"num":11,"verse":"The land will never lack for needy persons; that is why I command you: “Open your hand freely to your poor and to your needy kin in your land.”"},{"num":12,"verse":"Hebrew Slaves. If your kin, a Hebrew man or woman, sells himself or herself to you, he or she is to serve you for six years, but in the seventh year you shall release him or her as a free person. "},{"num":13,"verse":"When you release a male from your service, as a free person, you shall not send him away empty-handed, "},{"num":14,"verse":"but shall weigh him down with gifts from your flock and threshing floor and wine press; as the Lord, your God, has blessed you, so you shall give to him. "},{"num":15,"verse":"For remember that you too were slaves in the land of Egypt, and the Lord, your God, redeemed you. That is why I am giving you this command today. "},{"num":16,"verse":"But if he says to you, “I do not wish to leave you,” because he loves you and your household, since he is well off with you, "},{"num":17,"verse":"you shall take an awl and put it through his ear into the door, and he shall be your slave forever. Your female slave, also, you shall treat in the same way. "},{"num":18,"verse":"Do not be reluctant when you let them go free, since the service they have given you for six years was worth twice a hired laborer’s salary; and the Lord, your God, will bless you in everything you do."},{"num":19,"verse":"Firstlings. You shall consecrate to the Lord, your God, every male firstling born in your herd and in your flock. You shall not work the firstlings of your cattle, nor shear the firstlings of your flock. "},{"num":20,"verse":"In the presence of the Lord, your God, you shall eat them year after year, you and your household, in the place that the Lord will choose. "},{"num":21,"verse":"But if a firstling has any defect, lameness or blindness, any such serious defect, you shall not sacrifice it to the Lord, your God, "},{"num":22,"verse":"but in your own communities you may eat it, the unclean and the clean eating it together, as you would a gazelle or a deer. "},{"num":23,"verse":"Only, you must not eat of its blood; you shall pour it out on the ground like water."}]