[{"num":20,"verse":"1 Hezekiah is sick, and receiveth the sign of his health, 12 He receiveth rewards of Berodach,  13 Showeth his treasures, and is reprehended of Isaiah.  21 He dieth, and Manasseh his son reigneth in his stead."},{"num":1,"verse":"About that time was Hezekiah sick unto death: and the Prophet Isaiah the son of Amoz came to him, and said unto him, Thus saith the Lord, Put thine house in an order: for thou shalt die, and not live."},{"num":2,"verse":"Then he turned his face to the wall, and prayed to the Lord, saying,"},{"num":3,"verse":"I beseech thee, O lord, remember now, how I have walked before thee in truth and with a perfect heart, and have done that which is good in thy sight: and Hezekiah wept sore."},{"num":4,"verse":"¶ And afore Isaiah was gone out into the middle of the court, the word of the Lord came to him, saying,"},{"num":5,"verse":"Turn again, and tell Hezekiah the captain of my people, Thus saith the Lord God of David thy father, I have heard thy prayer, and seen thy tears: behold, I have healed thee, and the third day thou shalt go up to the house of the Lord,"},{"num":6,"verse":"And I will add unto thy days fifteen years, and will deliver thee and this city out of the hand of the king of Assyria, and will defend this city for mine own sake, and for David my servant’s sake."},{"num":7,"verse":"Then Isaiah said, Take a lump of dry figs. And they took it, and laid it on the boil, and he recovered."},{"num":8,"verse":"¶ For Hezekiah had said unto Isaiah, What shall be the sign that the Lord will heal me, and that I shall go up into the house of the Lord the third day?"},{"num":9,"verse":"And Isaiah answered, This sign shalt thou have of the Lord, that the Lord will do that he hath spoken, Wilt thou that the shadow go forward ten degrees, or go back ten degrees?"},{"num":10,"verse":"And Hezekiah answered, It is a light thing for the shadow to pass forward ten degrees: not so then, but let the shadow go back ten degrees."},{"num":11,"verse":"And Isaiah the Prophet called unto the Lord, and he brought again the shadow ten degrees back by the degrees whereby it had gone down in the dial of Ahaz."},{"num":12,"verse":"The same season Berodach-Baladan the son of Baladan king of Babylon sent letters and a present to Hezekiah: for he had heard how that Hezekiah was sick."},{"num":13,"verse":"And Hezekiah heard them, and showed them all his treasure house, to wit, the silver, and the gold, and the spices, and the precious ointment, and all the house of his armor, and all that was found in his treasures: there was nothing in his house, and in all his realm, that Hezekiah showed them not."},{"num":14,"verse":"Then Isaiah the Prophet came unto King Hezekiah, and said unto him, What said these men? and from whence came they to thee? And Hezekiah said, They be come from a far country, even from Babylon."},{"num":15,"verse":"Then said he, What have they seen in thine house? And Hezekiah answered, All that is in mine house have they seen: there is nothing among my treasures, that I have not showed them."},{"num":16,"verse":"And Isaiah said unto Hezekiah, Hear the word of the Lord."},{"num":17,"verse":"Behold, the days come, that all that is in thine house, and whatsoever thy fathers have laid up in store unto this day, shall be carried into Babylon: Nothing shall be left, saith the Lord."},{"num":18,"verse":"And of thy sons, that shall proceed out of thee, and which thou shalt beget, shall they take away, and they shall be eunuchs in the palace of the king of Babylon."},{"num":19,"verse":"Then Hezekiah said unto Isaiah, The word of the Lord, which thou hast spoken, is good: for said he, Shall it not be good if peace and truth be in my days?"},{"num":20,"verse":"Concerning the rest of the acts of Hezekiah, and all his valiant deeds, and how he made a pool and a conduit, and brought water into the city, are they not written in the book of the Chronicles of the kings of Judah?"},{"num":21,"verse":"And Hezekiah slept with his fathers: and Manasseh his son reigned in his stead."}]