[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 39:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 39:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He knew not aught he had — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Persuaded of Joseph’s faithfulness and diligence, and relying on his care, he took no part in the management of his own affairs, but left them wholly to this young but trusty Hebrew. The servant had all the care and trouble of the estate, and the master only the enjoyment of it. In this Potiphar is an example not to be imitated by any master, unless he could be sure that he had one like Joseph for a servant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39:1-6 Our enemies may strip us of outward distinctions and ornaments; but wisdom and grace cannot be taken from us. They may separate us from friends, relatives, and country; but they cannot take from us the presence of the Lord. They may shut us from outward blessings, rob us of liberty, and confine us in dungeons; but they cannot shut us out from communion with God, from the throne of grace, or take from us the blessings of salvation. Joseph was blessed, wonderfully blessed, even in the house where he was a slave. God's presence with us, makes all we do prosperous. Good men are the blessings of the place where they live; good servants may be so, though mean and lightly esteemed. The prosperity of the wicked is, one way or other, for the sake of the godly. Here was a wicked family blessed for the sake of one good servant in it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph fares well with his first master. \"Potiphar.\" This is a racapitulation of the narrative in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ":\"The Lord;\" the God of covenant is with Joseph. \"In the house.\" Joseph was a domestic servant. \"And his master saw.\" The prosperity that attended all Joseph's doings was so striking as to show that the Lord was with him. \"Set him over\" - made him overseer of all that was in his house. \"The Lord blessed the Mizrite's house.\" He blesses those who bless his own ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Beautiful in form and look\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This prepares the way for the following occurrence.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. the Lord blessed the Egyptian's house for Joseph's sake, &c.—It might be—it probably was—that a special, a miraculous blessing was poured out on a youth who so faithfully and zealously served God amid all the disadvantages of his place. But it may be useful to remark that such a blessing usually follows in the ordinary course of things; and the most worldly, unprincipled masters always admire and respect religion in a servant when they see that profession supported by conscientious principle and a consistent life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "made him overseer in his house—We do not know in what capacity Joseph entered into the service of Potiphar; but the observant eye of his master soon discovered his superior qualities and made him his chief, his confidential servant (compare Eph 6:7; Col 3:23). The advancement of domestic slaves is not uncommon, and it is considered a great disgrace not to raise one who has been a year or two in the family. But this extraordinary advancement of Joseph was the doing of the Lord, though on the part of Potiphar it was the consequence of observing the astonishing prosperity that attended him in all that he did.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He took care for nothing, but that he might eat, and drink, and fare deliciously. Nor did he indeed take any care for that, it being provided for him by other hands. Others thus, He took care for nothing, but committed all to Joseph, except his bread, which he would not have provided by a Hebrew hand, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "because the Egyptians might not eat bread with the Hebrews, Genesis 43:32",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because the Egyptians might not eat bread with the Hebrews, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 43:32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". But that was no impediment, for neither did Joseph eat with his master, nor was he the cook to dress it for him. But he might provide food for him, as afterwards he did for all the Egyptians without any scruple on their side. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he left all he had in Joseph's hand;.... His master took no care of anything, but committed all to him, trusted him with his money and with his accounts, and with the management of all his affairs; such confidence did he put in him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he knew not aught he had, save the bread which he did eat; some understand this of Joseph, that though he had all his master's substance in his hands, yet he made no use of it for himself, enjoyed nothing of it but the bread he ate; and it is the observation of a Jewish writer (p), that he ate nothing but dry bread, and yet, like Daniel and his companions, was well favoured and of a goodly countenance, as in the next clause: but it is better to interpret it of Joseph's master, who was so satisfied with Joseph's good management and fidelity, that he never concerned himself about his affairs, how they stood or what money he had in his house, or what effects he was possessed of; all that he regarded was his food, and perhaps he knew not what that would be till it came to his table; though some take the expression in this light, that he gave himself unto a luxurious life, regarding nothing but eating and drinking, and taking his pleasure, having so good and faithful a servant: but according to Aben Ezra the sense is, that Joseph had all committed to his care, excepting the bread, or making provision of that for him and his family, which he might not touch being an Hebrew, and had all things common with him but that, see Genesis 43:32; which is a much better sense than what the Targum of Jonathan and Jarchi give, who interpret bread of his wife, whom only he reserved for himself of all things in his house: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he knew not aught he had, save the bread which he did eat; some understand this of Joseph, that though he had all his master's substance in his hands, yet he made no use of it for himself, enjoyed nothing of it but the bread he ate; and it is the observation of a Jewish writer (p), that he ate nothing but dry bread, and yet, like Daniel and his companions, was well favoured and of a goodly countenance, as in the next clause: but it is better to interpret it of Joseph's master, who was so satisfied with Joseph's good management and fidelity, that he never concerned himself about his affairs, how they stood or what money he had in his house, or what effects he was possessed of; all that he regarded was his food, and perhaps he knew not what that would be till it came to his table; though some take the expression in this light, that he gave himself unto a luxurious life, regarding nothing but eating and drinking, and taking his pleasure, having so good and faithful a servant: but according to Aben Ezra the sense is, that Joseph had all committed to his care, excepting the bread, or making provision of that for him and his family, which he might not touch being an Hebrew, and had all things common with him but that, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 43:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which is a much better sense than what the Targum of Jonathan and Jarchi give, who interpret bread of his wife, whom only he reserved for himself of all things in his house: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and Joseph was a goodly person, and well favoured; being like his mother, as Aben Ezra observes, see Genesis 29:17; this is remarked for the sake of what follows, and as leading on to that. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Joseph was a goodly person, and well favoured; being like his mother, as Aben Ezra observes, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 29:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; this is remarked for the sake of what follows, and as leading on to that. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) R. Abraham Sepharadi apud Munster. in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) R. Abraham Sepharadi apud Munster. in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he left all that he had in Joseph's hand; {e} and he knew not ought he had, save the bread which he did eat. And Joseph was a goodly person, and well favoured.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he left all that he had in Joseph's hand; ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and he knew not ought he had, save the bread which he did eat. And Joseph was ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "a",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " goodly ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "person",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and well favoured.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) For he was sure that everything would prosper: therefore he ate and drank and did not worry.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he knew not … him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The R.V. marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with him he knew not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", gives the correct meaning. Joseph’s master trusted everything to him. Everything went on smoothly; and with Joseph as manager he had no need to think of a thing, except as regards food. It is also just possible that “save the bread, &c.,” implies that food, owing to the strictness of Egyptian scruples (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 43:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), could not be committed to the care of a foreigner. Joseph was controller, or steward, of the household.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 39:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph was handsome in form and feature; and Potiphar's wife set her eyes upon the handsome young man, and tried to persuade him to lie with her. But Joseph resisted the adulterous proposal, referring to the unlimited confidence which his master had placed in him. He (Potiphar) was not greater in that house than he, and had given everything over to him except her, because she was his wife. \"How could he so abuse this confidence, as to do this great wickedness and sin against God!\" ",
        "children": []
      }
    ]
  }
]