[{"header":"Balaam and the King of Moab"},{"num":22,"verse":"Then the Israelites traveled to the Jordan Valley in Moab. They camped near the Jordan River across from Jericho."},{"num":2,"verse":"Balak son of Zippor saw everything the Israelites had done to the Amorites. The king of Moab was very frightened of the Israelites because there were so many of them. He was very afraid."},{"num":4,"verse":"The king of Moab said to the leaders of Midian, “This large group of people will destroy everything around us, the way an ox eats all the grass in a field.”"},{"num":5,"verse":"He sent some men to Balaam son of Beor. Balaam was at Pethor, near the Euphrates River. This was where Balaam’s people lived. This was Balak’s message:"},{"num":6,"verse":"Come and help me. These people are too powerful for me. I know that you have great power. If you bless people, good things happen to them. And if you curse people, bad things happen to them. So come and curse these people. Maybe then I will be able to defeat them and force them to leave my country.”"},{"num":7,"verse":"The leaders of Moab and Midian left. They went to talk to Balaam. They carried with them money to pay him for his service. Then they told him what Balak had said."},{"num":8,"verse":"Balaam said to them, “Stay here for the night. I will talk to the Lord and tell you the answer he gives me.” So the leaders of Moab stayed there with Balaam that night."},{"num":9,"verse":"God came to Balaam and asked, “Who are these men with you?”"},{"num":10,"verse":"Balaam said to God, “The king of Moab, Balak son of Zippor, sent them to give me a message."},{"num":11,"verse":"This is the message: A new nation of people has come out of Egypt. There are so many people that they cover the land. So come and curse these people. Then maybe I will be able to fight them and force them to leave my land.”"},{"num":12,"verse":"But God said to Balaam, “Don’t go with them. You must not curse those people. They are my people.”"},{"num":13,"verse":"The next morning Balaam got up and said to leaders from Balak, “Go back to your own country. The Lord will not let me go with you.”"},{"num":14,"verse":"So the leaders of Moab went back to Balak and told him this. They said, “Balaam refused to come with us.”"},{"num":15,"verse":"So Balak sent other leaders to Balaam. This time he sent many more than the first time. And these leaders were much more important than the first ones he sent."},{"num":16,"verse":"They went to Balaam and said, “This is what Balak son of Zippor says to you: Please don’t let anything stop you from coming."},{"num":17,"verse":"I will pay you very much, and I will do whatever you ask. Come and curse these people for me.”"},{"num":18,"verse":"Balaam gave Balak’s officials his answer. He said, “I must obey the Lord my God. I cannot do anything, great or small, against his command. Even if King Balak gives me his beautiful home filled with silver and gold, I will not do anything against the Lord’s command."},{"num":19,"verse":"But you can stay here tonight like the other men did, and during the night I will learn what the Lord wants to tell me.”"},{"num":20,"verse":"That night, God came to Balaam. God said, “These men have come again to ask you to go with them. So you can go with them. But do only what I tell you to do.”"},{"header":"Balaam and His Donkey"},{"num":21,"verse":"The next morning, Balaam got up, put a saddle on his donkey, and went with the Moabite leaders."},{"num":22,"verse":"Balaam was riding on his donkey. Two of his servants were with him. While Balaam was traveling, God became angry. So the Lord’s angel stood in the road in front of Balaam to stop him."},{"num":23,"verse":"When Balaam’s donkey saw the Lord’s angel standing in the road with a sword in his hand, the donkey turned from the road and went into the field. Balaam could not see the angel, so he was very angry at the donkey. He hit the donkey and forced it to go back on the road."},{"num":24,"verse":"Later, the Lord’s angel stood at a place where the road became narrow. This was between two vineyards. There were walls on both sides of the road."},{"num":25,"verse":"Again the donkey saw the Lord’s angel. So the donkey walked very close to one wall. This crushed Balaam’s foot against the wall. So Balaam hit his donkey again."},{"num":26,"verse":"Later, the Lord’s angel stood at another place where the road became narrow. There was no place where the donkey could go around him. It could not turn to the left or to the right."},{"num":27,"verse":"The donkey saw the Lord’s angel. So the donkey lay down with Balaam sitting on top of it. Balaam was very angry at the donkey. So he hit it with his walking stick."},{"num":28,"verse":"Then the Lord caused the donkey to speak. The donkey said to Balaam, “Why are you angry at me? What have I done to you? You have hit me three times!”"},{"num":29,"verse":"Balaam answered the donkey, “You have made me look foolish. If I had a sword in my hand, I would kill you right now!”"},{"num":30,"verse":"But the donkey said to Balaam, “Look, I am your donkey. You have ridden me for so many years. And you know that I have never done this to you before!”"},{"num":31,"verse":"Then the Lord allowed Balaam to see the angel. The Lord’s angel was standing in the road, holding a sword in his hand. Balaam bowed low to the ground."},{"num":32,"verse":"Then the Lord’s angel asked Balaam, “Why did you hit your donkey three times? I am the one who came to stop you. But just in time,"},{"num":33,"verse":"your donkey saw me and turned away from me. That happened three times. If the donkey had not turned away, I probably would have killed you already. And I would have let your donkey live.”"},{"num":34,"verse":"Then Balaam said to the Lord’s angel, “I have sinned. I did not know that you were standing in the road. If I am doing wrong, I will go back home.”"},{"num":35,"verse":"Then the Lord’s angel said to Balaam, “No, you can go with these men. But be careful. Speak only the words that I will tell you to say.” So Balaam went with the leaders that Balak had sent."},{"num":36,"verse":"Balak heard that Balaam was coming. So Balak went out to meet him at the Moabite town near the Arnon River. This was at the northern border of his country."},{"num":37,"verse":"When Balak saw Balaam, he said to him, “I asked you before to come. I told you it was very important. Why didn’t you come to me? Did you think I might not be able to pay you?”"},{"num":38,"verse":"Balaam answered, “Well, I am here now. I came, but I might not be able to do what you asked. I can only say the words God tells me to say.”"},{"num":39,"verse":"Then Balaam went with Balak to Kiriath Huzoth."},{"num":40,"verse":"Balak killed some cattle and some sheep as his sacrifice. He gave some of the meat to Balaam and some to the leaders who were with him."},{"num":41,"verse":"The next morning Balak took Balaam to the town of Bamoth Baal. From there they could see part of the Israelite camp."}]