[{"header":"Balak Sends for Balaam"},{"num":22,"verse":"Then the people of Israel traveled on and set up their tents in the plains of Moab on the other side of the Jordan beside Jericho. "},{"num":2,"verse":"Now Balak the son of Zippor saw all that Israel had done to the Amorites. "},{"num":3,"verse":"So Moab was filled with much fear because of the people, for they were many. Moab was very afraid of the people of Israel. "},{"num":4,"verse":"And Moab said to the leaders of Midian, “Now these people will take away everything around us like the bull eats up the grass of the field.” Balak the son of Zippor was king of Moab at that time. "},{"num":5,"verse":"So he sent men to Balaam the son of Beor, at Pethor, which is near the River in the land of the children of his people. They said to him, “See, a people came out of Egypt. See, they cover the land, and they are living beside me. "},{"num":6,"verse":"Now come, I beg you. Curse this people for me, because they are too strong for me. Then I may be able to win the battle against them and send them out of the land. For I know that good will come to the one you pray for, and trouble will come to the one you curse.”"},{"num":7,"verse":"So the leaders of Moab and the leaders of Midian left with the pay in their hand for the one who tells what will happen in the future. When they came to Balaam, they told him Balak’s words. "},{"num":8,"verse":"Balaam said to them, “Stay here tonight. I will bring word to you as the Lord may speak to me.” So the leaders of Moab stayed with Balaam. "},{"num":9,"verse":"Then God came to Balaam and said, “Who are these men with you?” "},{"num":10,"verse":"Balaam said to God, “Balak the son of Zippor, king of Moab, has sent word to me, saying, "},{"num":11,"verse":"‘See, the people who came out of Egypt cover the land. Now come, curse them for me. Then I may be able to fight against them and send them away.’” "},{"num":12,"verse":"God said to Balaam, “Do not go with them. Do not curse the people, for I have decided that good would come to them.” "},{"num":13,"verse":"So Balaam got up in the morning and said to Balak’s leaders, “Return to your land. For the Lord will not let me go with you.” "},{"num":14,"verse":"So the leaders of Moab got up and went to Balak, and said, “Balaam would not come with us.”"},{"num":15,"verse":"Balak sent leaders again, more than were sent before, and men who were more important. "},{"num":16,"verse":"They came to Balaam and said to him, “Balak the son of Zippor says, ‘I beg you, let nothing keep you from coming to me. "},{"num":17,"verse":"I will give you much honor. I will do whatever you tell me. I beg you to come and curse these people for me.’” "},{"num":18,"verse":"Balaam answered and said to Balak’s men, “Balak could give me his house full of silver and gold. But I could not do anything, small or big, against the Word of the Lord my God. "},{"num":19,"verse":"Now I ask you to stay here tonight. I will find out what else the Lord will say to me.” "},{"num":20,"verse":"God came to Balaam at night and said to him, “If the men have come to call you, get up and go with them. But do only what I tell you.”"},{"header":"Balaam’s Donkey and the Angel"},{"num":21,"verse":"So Balaam got up in the morning and got his donkey ready, and went with the leaders of Moab. "},{"num":22,"verse":"But God was angry because he was going. The angel of the Lord stood in the way against him. Balaam was sitting on his donkey, and his two servants were with him. "},{"num":23,"verse":"When the donkey saw the angel of the Lord standing in the way with his sword in his hand, the donkey turned off the road and went into the field. But Balaam hit the donkey to turn her on the road again. "},{"num":24,"verse":"Then the angel of the Lord stood in a narrow path in the grape-field, with a wall on each side. "},{"num":25,"verse":"The donkey saw the angel of the Lord. So she pushed herself against the wall and crushed Balaam’s foot against it, so he hit her again. "},{"num":26,"verse":"Then the angel of the Lord went farther. He stood in a narrow place where there was no way to turn to the right or the left. "},{"num":27,"verse":"When the donkey saw the angel of the Lord, she lay down under Balaam. So Balaam was angry and hit the donkey with his stick. "},{"num":28,"verse":"And the Lord opened the mouth of the donkey, and she said to Balaam, “What have I done to you? Why have you hit me these three times?” "},{"num":29,"verse":"Balaam said to the donkey, “Because you have made a fool of me! If there had been a sword in my hand, I would have killed you by now!” "},{"num":30,"verse":"The donkey said to Balaam, “Am I not your donkey on which you have traveled all your life to this day? Have I ever done this to you before?” And Balaam said, “No.”"},{"num":31,"verse":"Then the Lord opened Balaam’s eyes, and he saw the angel of the Lord standing in the way with his sword in his hand. And he bowed to the ground. "},{"num":32,"verse":"The angel of the Lord said to him, “Why have you hit your donkey these three times? See, I have come out against you, because your way was against me. "},{"num":33,"verse":"But the donkey saw me and turned from me these three times. If she had not turned from me, for sure I would have killed you, and let her live.” "},{"num":34,"verse":"Balaam said to the angel of the Lord, “I have sinned. For I did not know that you were standing in the way against me. But now, if it does not please you, I will turn back.” "},{"num":35,"verse":"The angel of the Lord said to Balaam, “Go with the men. But speak only what I tell you.” So Balaam went with the leaders of Balak."},{"num":36,"verse":"Balak heard that Balaam was coming. He went out to meet him at the city of Moab, on the Arnon, at the far side of the country. "},{"num":37,"verse":"Balak said to Balaam, “Did I not send men to tell you to come? Why did you not come to me? Am I not able to honor you?” "},{"num":38,"verse":"Balaam said to Balak, “See, I have come to you! Am I able to speak anything at all? The Word that God puts in my mouth is what I must speak.” "},{"num":39,"verse":"Then Balaam went with Balak, and they came to Kiriathhuzoth. "},{"num":40,"verse":"Balak killed bulls and sheep on the altar in worship, and sent some to Balaam and the leaders who were with him."},{"num":41,"verse":"The next morning Balak took Balaam and brought him up to the high places of Baal. From there he saw part of the people of Israel."}]