[{"header":"Prophesy Against the Mountains"},{"num":36,"verse":"Now you, son of man, prophesy to the mountains of Israel and say this."},{"header":"The Lord Will Sprinkle His People"},{"num":16,"verse":"The word of the Lord came to me."},{"num":17,"verse":"Son of man, when the house of Israel was living on their own soil, they defiled it by their conduct and by their actions. To me their conduct was as unclean as the blood of a woman’s period. "},{"num":18,"verse":"So I poured out my wrath on them because of the blood they had poured on the ground and because of the filthy idols with which they had defiled it, "},{"num":19,"verse":"and I scattered them among the nations so that they were dispersed among the countries. On the basis of their conduct and their actions I judged them. "},{"num":20,"verse":"Then when they came to the various nations, they profaned my holy name when people said about them, “These are the people of the Lord, but they had to leave his land.” "},{"num":21,"verse":"So I was concerned about my holy name, which the house of Israel had profaned among the various nations to which they had come."},{"num":22,"verse":"Therefore, say this to the house of Israel. This is what the Lord God says. I am about to act, O house of Israel, not for your sake, but for the sake of my holy name, which you have profaned among the nations to which you have gone. "},{"num":23,"verse":"I will sanctify my great name, which has been profaned among the nations, which you profaned among them. Then the nations will know that I am the Lord, declares the Lord God, when I reveal myself as holy in front of their eyes through you. "},{"num":24,"verse":"I will take you from among the nations. I will gather you from all the lands, and I will bring you to your own soil. "},{"num":25,"verse":"I will sprinkle purifying water on you, and you will be clean. I will cleanse you from all your impurity and from all your filthy idols."},{"header":"The Lord Will Give His People a New Heart"},{"num":26,"verse":"Then I will give you a new heart and put a new spirit inside you. I will remove the heart of stone from your body and give you a heart of flesh. "},{"num":27,"verse":"I will put my Spirit within you and will cause you to walk in my statutes, and you will carefully observe my ordinances. "},{"num":28,"verse":"Then you will live in the land I gave your fathers. You will be my people, and I will be your God. "},{"num":29,"verse":"I will save you from all your impurity. I will summon the grain and make it plentiful. I will not bring famine upon you. "},{"num":30,"verse":"I will increase the fruit on the trees and the produce in the fields, so that you will never again suffer disgrace among the nations because of famine. "},{"num":31,"verse":"Then you will remember your evil ways and your deeds that were not good, and you will loathe yourselves on account of your guilty deeds and your abominations. "},{"num":32,"verse":"It is not for your sake that I am about to act, declares the Lord God. Let this be known to you! Be ashamed and embarrassed because of your ways, O house of Israel."},{"num":33,"verse":"This is what the Lord God says. On the day that I cleanse you from all your guilty deeds, I will resettle your cities, and the ruins will be rebuilt. "},{"num":34,"verse":"The desolate land will be cultivated instead of remaining desolate in the sight of every passerby. "},{"num":35,"verse":"People will say, “This land that was devastated has become like the Garden of Eden, and the cities that were ruined, desolate, and destroyed are now fortified and inhabited.” "},{"num":36,"verse":"Then the nations that remain around you will know that I, the Lord, have rebuilt the places that were destroyed and have replanted what was desolate. I, the Lord, have spoken, and I will do it."},{"num":37,"verse":"This is what the Lord God says. I will also allow the house of Israel to ask me to do this for them. I will multiply them so their people are like flocks. "},{"num":38,"verse":"Like flocks consecrated for sacrifice, like the flocks of Jerusalem on its festival days, so the ruined cities will be filled with flocks of people. Then they will know that I am the Lord."}]