[{"header":"Chapter 36"},{"num":1,"verse":"Regeneration of the Land. As for you, son of man, prophesy to the mountains of Israel and say: Mountains of Israel, hear the word of the Lord! "},{"num":2,"verse":"Thus says the Lord God: Because the enemy said about you, “Ha! the ancient heights have become our possession,” "},{"num":3,"verse":"therefore prophesy and say: Thus says the Lord God: because you have been ridiculed and hounded on all sides for becoming a possession for the remaining nations and have become a byword and a popular jeer, "},{"num":4,"verse":"therefore, mountains of Israel, hear the word of the Lord God: Thus says the Lord God to the mountains and hills, to the ravines and valleys, to the desolate ruins and abandoned cities, plundered and mocked by the nations remaining around you: "},{"num":5,"verse":"therefore thus says the Lord God: Truly, with burning jealousy I speak against the remaining nations and against Edom; they all took possession of my land for plunder with wholehearted joy and utter contempt. "},{"num":6,"verse":"Therefore, prophesy concerning the land of Israel and say to the mountains and hills, to the ravines and valleys: Thus says the Lord God: See! in my jealous fury I speak, because you endured the reproach of the nations. "},{"num":7,"verse":"Therefore, thus says the Lord God: I raise my hand and swear: the nations around you shall bear their own reproach."},{"num":8,"verse":"But you, mountains of Israel, you will sprout branches and bear fruit for my people Israel, for they are coming soon. "},{"num":9,"verse":"Look! I am for you! I will turn my face toward you; you will be plowed and planted. "},{"num":10,"verse":"Upon you I will multiply the whole house of Israel; cities shall be resettled and ruins rebuilt. "},{"num":11,"verse":"Upon you I will multiply people and animals so they can multiply and be fruitful. I will resettle you as in the past, and make you more prosperous than at your beginning; then you shall know that I am the Lord."},{"num":12,"verse":"Upon you I will have them walk, my people Israel. They shall possess you, and you shall be their heritage. Never again shall you rob them of their children."},{"num":13,"verse":"Thus says the Lord God: Because they say of you, “You devour your own people, you rob your nation of its children,” "},{"num":14,"verse":"therefore, you shall never again devour your people or rob your nation of its children—oracle of the Lord God. "},{"num":15,"verse":"I will no longer make you listen to the reproach of nations. You will never again endure insults from the peoples. Never again shall you rob your nation of its children—oracle of the Lord God."},{"num":16,"verse":"Regeneration of the People. The word of the Lord came to me: "},{"num":17,"verse":"Son of man, when the house of Israel lived in its land, they defiled it with their behavior and their deeds. In my sight their behavior was like the impurity of a woman in menstruation. "},{"num":18,"verse":"So I poured out my fury upon them for the blood they poured out on the ground and for the idols with which they defiled it. "},{"num":19,"verse":"I scattered them among the nations, and they were dispersed through other lands; according to their behavior and their deeds I carried out judgment against them. "},{"num":20,"verse":"But when they came to the nations, where they went, they desecrated my holy name, for people said of them: “These are the people of the Lord, yet they had to leave their land.” "},{"num":21,"verse":"So I relented because of my holy name which the house of Israel desecrated among the nations to which they came. "},{"num":22,"verse":"Therefore say to the house of Israel: Thus says the Lord God: Not for your sake do I act, house of Israel, but for the sake of my holy name, which you desecrated among the nations to which you came. "},{"num":23,"verse":"But I will show the holiness of my great name, desecrated among the nations, in whose midst you desecrated it. Then the nations shall know that I am the Lord—oracle of the Lord God—when through you I show my holiness before their very eyes. "},{"num":24,"verse":"I will take you away from among the nations, gather you from all the lands, and bring you back to your own soil. "},{"num":25,"verse":"I will sprinkle clean water over you to make you clean; from all your impurities and from all your idols I will cleanse you. "},{"num":26,"verse":"I will give you a new heart, and a new spirit I will put within you. I will remove the heart of stone from your flesh and give you a heart of flesh. "},{"num":27,"verse":"I will put my spirit within you so that you walk in my statutes, observe my ordinances, and keep them. "},{"num":28,"verse":"You will live in the land I gave to your ancestors; you will be my people, and I will be your God. "},{"num":29,"verse":"I will deliver you from all your impurities. I will summon the grain and make it plentiful; I will not send famine against you. "},{"num":30,"verse":"I will increase the fruit on your trees and the crops in your fields so that you no longer endure reproach from the nations because of famine. "},{"num":31,"verse":"Then you will remember your evil behavior and your deeds that were not good; you will loathe yourselves for your sins and your abominations. "},{"num":32,"verse":"Not for your sake do I act—oracle of the Lord God. Let this be known to you! Be ashamed and humbled because of your behavior, house of Israel."},{"num":33,"verse":"Thus says the Lord God: When I cleanse you of all your guilt, I will resettle the cities and the ruins will be rebuilt. "},{"num":34,"verse":"The desolate land will be tilled—once a wasteland in the eyes of every passerby. "},{"num":35,"verse":"They will say, “This once-desolate land has become like the garden of Eden. The cities once ruined, laid waste and destroyed, are now resettled and fortified.” "},{"num":36,"verse":"Then the surrounding nations that remain shall know that I, the Lord, have rebuilt what was destroyed and replanted what was desolate. I, the Lord, have spoken: I will do it. "},{"num":37,"verse":"Thus says the Lord God: This also I will be persuaded to do for the house of Israel: to multiply them like sheep. "},{"num":38,"verse":"Like sheep for sacrifice, like the sheep of Jerusalem on its feast days, the ruined cities shall be filled with flocks of people; then they shall know that I am the Lord."}]