[{"num":1,"verse":"¶ Adam, Seth, Enosh,"},{"num":2,"verse":"Kenan, Mahalaleel, Jered,"},{"num":3,"verse":"Enoch, Methuselah, Lamech,"},{"num":4,"verse":"Noah, Shem, Ham, and Japheth."},{"num":5,"verse":"The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras."},{"num":6,"verse":"And the sons of Gomer: Ashchenaz, Riphath, and Togarmah."},{"num":7,"verse":"And the sons of Javan: Elishah, Tarshish, Kittim, and Dodanim."},{"num":8,"verse":"The sons of Ham: Cush, Mizraim, Put, and Canaan."},{"num":9,"verse":"And the sons of Cush: Seba, Havilah, Sabta, Raamah, and Sabtecha. And the sons of Raamah: Sheba and Dedan."},{"num":10,"verse":"And Cush begat Nimrod; he began to be mighty upon the earth."},{"num":11,"verse":"And Mizraim begat Ludim, Anamim, Lehabim, Naphtuhim,"},{"num":12,"verse":"Pathrusim and Casluhim of whom came the Philistines and the Caphthorim."},{"num":13,"verse":"And Canaan begat Zidon his firstborn and the Hitite,"},{"num":14,"verse":"the Jebusite, the Amorite, the Girgashite,"},{"num":15,"verse":"the Hivite, the Arkite, the Sinite,"},{"num":16,"verse":"the Arvadite, the Zemarite, and the Hamathite."},{"num":17,"verse":"The sons of Shem: Elam, Asshur, Arphaxad, Lud, Aram, Uz, Hul, Gether, and Meshech."},{"num":18,"verse":"And Arphaxad begat Shelah, and Shelah begat Eber."},{"num":19,"verse":"And unto Eber were born two sons; the name of the one was Peleg because in his days the earth was divided, and his brother’s name was Joktan."},{"num":20,"verse":"And Joktan begat Almodad, Sheleph, Hazarmaveth, Jerah,"},{"num":21,"verse":"Hadoram, Uzal, Diklah,"},{"num":22,"verse":"Ebal, Abimael, Sheba,"},{"num":23,"verse":"Ophir, Havilah, and Jobab. All these were the sons of Joktan."},{"num":24,"verse":"Shem, Arphaxad, Shelah,"},{"num":25,"verse":"Eber, Peleg, Reu,"},{"num":26,"verse":"Serug, Nahor, Terah,"},{"num":27,"verse":"and Abram, who is Abraham."},{"num":28,"verse":"¶ The sons of Abraham: Isaac and Ishmael."},{"num":29,"verse":"These are their generations: The firstborn of Ishmael, Nebaioth, then Kedar, Adbeel, Mibsam,"},{"num":30,"verse":"Mishma, Dumah, Massa, Hadad, Tema,"},{"num":31,"verse":"Jetur, Naphish, and Kedemah. These are the sons of Ishmael."},{"num":32,"verse":"Now the sons of Keturah, Abraham’s concubine: she gave birth to Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan."},{"num":33,"verse":"The sons of Midian: Ephah, Epher, Enoch, Abida, and Eldaah. All these are the sons of Keturah."},{"num":34,"verse":"And Abraham begat Isaac. The sons of Isaac: Esau and Israel."},{"num":35,"verse":"The sons of Esau: Eliphaz, Reuel, Jeush, Jaalam, and Korah."},{"num":36,"verse":"The sons of Eliphaz: Teman, Omar, Zephi, Gatam, Kenaz, Timna, and Amalek."},{"num":37,"verse":"The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."},{"num":38,"verse":"The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan."},{"num":39,"verse":"The sons of Lotan: Hori and Homam, and Timna was Lotan’s sister."},{"num":40,"verse":"The sons of Shobal: Alian, Manahath, Ebal, Shephi, and Onam. And the sons of Zibeon: Aiah and Anah."},{"num":41,"verse":"Dishon was the son of Anah. The sons of Dishon: Amram, Eshban, Ithran, and Cheran."},{"num":42,"verse":"The sons of Ezer: Bilhan, Zavan, and Jakan. The sons of Dishan: Uz and Aran."},{"num":43,"verse":"Now these are the kings that reigned in the land of Edom before any king reigned over the sons of Israel. Bela, the son of Beor, and the name of his city was Dinhabah."},{"num":44,"verse":"And when Bela was dead, Jobab, the son of Zerah of Bozrah, reigned in his stead."},{"num":45,"verse":"And when Jobab was dead, Husham of the land of the Temanites reigned in his stead."},{"num":46,"verse":"And when Husham was dead, Hadad, the son of Bedad, who smote Midian in the field of Moab, reigned in his stead; and the name of his city was Avith."},{"num":47,"verse":"And when Hadad was dead, Samlah of Masrekah reigned in his stead."},{"num":48,"verse":"And when Samlah was dead, Saul of Rehoboth by the river reigned in his stead."},{"num":49,"verse":"And when Saul was dead, Baalhanan, the son of Achbor, reigned in his stead."},{"num":50,"verse":"And when Baalhanan was dead, Hadad reigned in his stead. The name of his city was Pai, and his wife’s name was Mehetabel, the daughter of Matred, the daughter of Mezahab."},{"num":51,"verse":"When Hadad was dead, the dukes came forth in Edom: Duke Timnah, Duke Aliah, Duke Jetheth,"},{"num":52,"verse":"Duke Aholibamah, Duke Elah, Duke Pinon,"},{"num":53,"verse":"Duke Kenaz, Duke Teman, Duke Mibzar,"},{"num":54,"verse":"Duke Magdiel, Duke Iram. These were the dukes of Edom."}]