[{"num":24,"verse":"1 A prophecy of the curse of God for the sins of the people. 13 A remnant reserved shall praise the Lord."},{"num":1,"verse":"Behold, the Lord maketh the earth empty, and he maketh it waste: he turneth it upside down, and scattereth abroad the inhabitants thereof."},{"num":2,"verse":"And there shall be like people, like Priest, and like servant, like master, like maid, like mistress, like buyer, like seller, like lender, like borrower, like giver, like taker to usury."},{"num":3,"verse":"The earth shall be clean emptied, and utterly spoiled: for the Lord hath spoken this word."},{"num":4,"verse":"The earth lamenteth and fadeth away, the world is feebled and decayed: the proud people of the earth are weakened."},{"num":5,"verse":"The earth also deceiveth, because of the inhabitants thereof: for they transgressed the laws: they changed the ordinances, and brake the everlasting Covenant."},{"num":6,"verse":"Therefore hath the curse devoured the earth, and the inhabitants thereof are desolate. Wherefore the inhabitants of the land are burned up, and few men are left."},{"num":7,"verse":"The wine faileth, the vine hath no might: all that were of merry heart, do mourn."},{"num":8,"verse":"The mirth of tabrets ceaseth: the noise of them that rejoice, endeth: the joy of the harp ceaseth."},{"num":9,"verse":"They shall not drink wine with mirth: strong drink shall be bitter to them that drink it."},{"num":10,"verse":"The city of vanity is broken down: every house is shut up, that no man may come in."},{"num":11,"verse":"There is a crying for wine in the streets: all joy is darkened: the mirth of the world is gone away."},{"num":12,"verse":"In the cities is left desolation, and the gate is smitten with destruction."},{"num":13,"verse":"¶ Surely thus shall it be in the midst of the earth, among the people, as the shaking of an olive tree, and as the grapes when the vintage is ended."},{"num":14,"verse":"They shall lift up their voice: they shall shout for the magnificence of the Lord: they shall rejoice from the sea."},{"num":15,"verse":"Wherefore praise ye the Lord in the valleys, even the Name of the Lord God of Israel, in the isles of the sea."},{"num":16,"verse":"From the uttermost part of the earth we have heard praises, even glory to the just, and I said, My leanness, my leanness, woe is me: the transgressors have offended: yea, the transgressors have grievously offended."},{"num":17,"verse":"Fear, and the pit, and the snare are upon thee, O inhabitant of the earth."},{"num":18,"verse":"And he that fleeth from the noise of the fear, shall fall into the pit: and he that cometh up out of the pit, shall be taken in the snare: for the windows from on high are open, and the foundations of the earth do shake."},{"num":19,"verse":"The earth is utterly broken down: the earth is clean dissolved: the earth is moved exceedingly."},{"num":20,"verse":"The earth shall reel to and fro like a drunken man, and shall be removed like a tent, and the iniquity thereof shall be heavy upon it: so that it shall fall, and rise no more."},{"num":21,"verse":"¶ And in that day shall the Lord visit the host above that is on high, even the kings of the world that are upon the earth."},{"num":22,"verse":"And they shall be gathered together as the prisoners in the pit: and they shall be shut up in the prison, and after many days shall they be visited."},{"num":23,"verse":"Then the moon shall be abashed, and the sun ashamed, when the Lord of hosts shall reign in mount Zion and in Jerusalem: and glory shall be before his ancient men."}]