[{"num":3,"verse":"“See, I am going to send My messenger, and he will clear the way before Me. Then the Lord you seek will suddenly come to His temple, the Messenger of the covenant you desire—see, He is coming,” says the Lord of Hosts. "},{"num":2,"verse":"But who can endure the day of His coming? And who will be able to stand when He appears? For He will be like a refiner’s fire and like cleansing lye. "},{"num":3,"verse":"He will be like a refiner and purifier of silver; He will purify the sons of Levi and refine them like gold and silver. Then they will present offerings to the Lord in righteousness. "},{"num":4,"verse":"And the offerings of Judah and Jerusalem will please the Lord as in days of old and years gone by."},{"num":5,"verse":"“I will come to you in judgment, and I will be ready to witness against sorcerers and adulterers; against those who swear falsely; against those who oppress the widow and the fatherless, and cheat the wage earner; and against those who deny justice to the foreigner. They do not fear Me,” says the Lord of Hosts. "},{"num":6,"verse":"“Because I, Yahweh, have not changed, you descendants of Jacob have not been destroyed."},{"header":"Robbing God"},{"num":7,"verse":"“Since the days of your fathers, you have turned from My statutes; you have not kept them. Return to Me, and I will return to you,” says the Lord of Hosts."},{"num":8,"verse":"“Will a man rob God? Yet you are robbing Me!”"},{"num":9,"verse":"You are suffering under a curse, yet you—the whole nation—are still robbing Me. "},{"num":10,"verse":"Bring the full tenth into the storehouse so that there may be food in My house. Test Me in this way,” says the Lord of Hosts. “See if I will not open the floodgates of heaven and pour out a blessing for you without measure. "},{"num":11,"verse":"I will rebuke the devourer for you, so that it will not ruin the produce of your land and your vine in your field will not fail to produce fruit,” says the Lord of Hosts. "},{"num":12,"verse":"“Then all the nations will consider you fortunate, for you will be a delightful land,” says the Lord of Hosts."},{"header":"The Righteous and the Wicked"},{"num":13,"verse":"“Your words against Me are harsh,” says the Lord."},{"num":14,"verse":"You have said: “It is useless to serve God. What have we gained by keeping His requirements and walking mournfully before the Lord of Hosts? "},{"num":15,"verse":"So now we consider the arrogant to be fortunate. Not only do those who commit wickedness prosper, they even test God and escape.”"},{"num":16,"verse":"At that time those who feared the Lord spoke to one another. The Lord took notice and listened. So a book of remembrance was written before Him for those who feared Yahweh and had high regard for His name. "},{"num":17,"verse":"“They will be Mine,” says the Lord of Hosts, “a special possession on the day I am preparing. I will have compassion on them as a man has compassion on his son who serves him. "},{"num":18,"verse":"So you will again see the difference between the righteous and the wicked, between one who serves God and one who does not serve Him."}]