[{"header":"Samuel Dies"},{"num":25,"verse":"Samuel died, and all Israel gathered to mourn for him. They buried him at his home in Ramah. Then David went to the desert of Paran."},{"header":"David, Nabal, and Abigail"},{"num":2,"verse":"Now, there was a man in Maon whose business was in Carmel. He was a very rich man. He had 3,000 sheep and 1,000 goats. And he was shearing his sheep in Carmel. "},{"num":3,"verse":"This man’s name was Nabal, and his wife’s name was Abigail. She was sensible and beautiful, but he was harsh and mean. He was a descendant of Caleb."},{"num":4,"verse":"While David was in the desert, he heard that Nabal was shearing his sheep. "},{"num":5,"verse":"So David sent ten young men and told them, “Go to Carmel, visit Nabal, and greet him for me. "},{"num":6,"verse":"Say to him, ‘May you live ⌞long⌟! May you, your home, and all you have prosper! "},{"num":7,"verse":"I hear that your sheepshearers are with you. Your shepherds have been with us, ⌞and⌟ we have not mistreated them. Nothing of theirs has been missing as long as they’ve been in Carmel. "},{"num":8,"verse":"Ask your young men, and let them tell you. Be kind to my young men, since we have come on a special occasion. Please give us and your son David anything you can ⌞spare⌟.’ ”"},{"num":9,"verse":"When David’s young men came to Nabal, they repeated all of this to him for David, and then they waited."},{"num":10,"verse":"“Who is David?” Nabal answered David’s servants. “Who is Jesse’s son? So many servants nowadays are leaving their masters. "},{"num":11,"verse":"Should I take my bread, my water, and my meat that I butchered for my shearers and give them to men coming from who knows where?”"},{"num":12,"verse":"David’s young men returned and told him all this."},{"num":13,"verse":"“Each of you put on your swords!” David told his men. And everyone, including David, put on his sword. About four hundred men went with David, while two hundred men stayed with the supplies."},{"num":14,"verse":"One of the young men told Abigail, Nabal’s wife, “David sent messengers from the desert to greet our master, who yelled at them. "},{"num":15,"verse":"Those men were very good to us. They didn’t mistreat us, and we found that nothing was missing wherever we went with them when we were in the fields. "},{"num":16,"verse":"They were a wall protecting us day and night as long as we were watching the sheep near them. "},{"num":17,"verse":"Now, consider what you should do because our master and his whole household are doomed. And he’s such a worthless man that it’s useless to talk to him.”"},{"num":18,"verse":"So Abigail quickly took 200 loaves of bread, 2 full wineskins, 5 butchered sheep, a bushel of roasted grain, 100 bunches of raisins, and 200 fig cakes and loaded them on donkeys. "},{"num":19,"verse":"“Go on ahead,” she told her young men, “and I’ll follow you.” But she didn’t tell her husband Nabal about it."},{"num":20,"verse":"She was riding on her donkey down a hidden mountain path when she met David and his men coming toward her. "},{"num":21,"verse":"David had thought, “I guarded this man’s stuff in the desert for nothing! Not one of his possessions was missing. Yet, he has paid me back with evil when I was good to him. "},{"num":22,"verse":"May God punish me  if I leave even one of his men  alive in the morning.”"},{"num":23,"verse":"When Abigail saw David, she quickly got down from her donkey. She immediately bowed down in front of David with her face touching the ground. "},{"num":24,"verse":"After she bowed at his feet, she said, “Sir, let me be held responsible for this wrong. Please let me speak with you. Please listen to my words. "},{"num":25,"verse":"You shouldn’t take this worthless person Nabal seriously. He is like his name. His name is Nabal [Godless Fool], and he’s foolish. But I didn’t see the young men you sent."},{"num":26,"verse":"“The Lord has kept you from spilling innocent blood and from getting a victory by your own efforts. Now, sir, I solemnly swear, as the Lord and you live, may your enemies and those who are trying to harm you end up like Nabal. "},{"num":27,"verse":"Here is a gift I am bringing to you. May it be given to the young men who are in your service. "},{"num":28,"verse":"Please forgive my offense. The Lord will certainly give you, sir, a lasting dynasty, because you are fighting the Lord’s battles. May evil never be found in you as long as you live. "},{"num":29,"verse":"Even though someone pursued you and sought your life, your life is wrapped in the bundle of life which comes from the Lord your God. But he will dispose of the lives of your enemies like stones thrown from a sling. "},{"num":30,"verse":"When the Lord does all the good he promised and makes you ruler of Israel, "},{"num":31,"verse":"you shouldn’t have a troubled conscience because you spilled blood for no good reason and claimed your own victory. When the Lord has given you success, remember me.”"},{"num":32,"verse":"David said to Abigail, “Blessed be the Lord God of Israel, who sent you today to meet me. "},{"num":33,"verse":"May your good judgment be blessed. Also, may you be blessed for keeping me from slaughtering people today and from getting a victory by my own efforts. "},{"num":34,"verse":"But I solemnly swear—as the Lord God of Israel, who has kept me from harming you, lives—if you hadn’t come to meet me quickly, Nabal certainly wouldn’t have had one of his men left at dawn.”"},{"num":35,"verse":"Then David accepted what she brought him and told her, “Go home in peace. I’ve listened to what you’ve said and granted your request.”"},{"num":36,"verse":"When Abigail came to Nabal, he was holding a banquet in his home. It was like a king’s banquet. He was in a good mood and very drunk, so she didn’t tell him anything until dawn. "},{"num":37,"verse":"But in the morning, when the effects of the wine had worn off, his wife told him what had happened. Nabal’s heart failed, and he could not move. "},{"num":38,"verse":"About ten days later the Lord made him even more sick, and Nabal died."},{"num":39,"verse":"When David heard Nabal was dead, he said, “Blessed be the Lord, who defended me against the insults of Nabal and kept me from doing wrong. The Lord has turned Nabal’s own wickedness back on him.”"},{"num":40,"verse":"When David’s servants came to Abigail at Carmel, they told her, “David has sent us to you so that we can take you to him to be his wife.”"},{"num":41,"verse":"She bowed down with her face touching the ground. “I am ready to serve,” she said. “I am ready to wash the feet of my master’s servants.” "},{"num":42,"verse":"Then Abigail quickly got up and rode on a donkey with five of her female servants following her. So she went with David’s messengers and became his wife."},{"num":43,"verse":"David also married Ahinoam of Jezreel. Both she and Abigail were his wives. "},{"num":44,"verse":"Saul had given his daughter Michal, David’s wife, to Palti, Laish’s son, who was from Gallim."}]