[{"num":47,"verse":"The destruction of Babylon, and the causes wherefore."},{"num":1,"verse":"Come down and sit in the dust: O virgin, daughter Babel, sit on the ground: there is no throne, O daughter of the Chaldeans; for thou shalt no more be called, Tender and delicate."},{"num":2,"verse":"Take the millstones, and grind meal; loose thy locks: make bare the feet: uncover the leg, and pass through the floods."},{"num":3,"verse":"Thy filthiness shall be discovered, and thy shame shall be seen: I will take vengeance, and I will not meet thee as a man."},{"num":4,"verse":"Our redeemer, the Lord of hosts is his Name, the holy One of Israel."},{"num":5,"verse":"Sit still, and get thee into darkness, O daughter of the Chaldeans; for thou shalt no more be called, The lady of kingdoms."},{"num":6,"verse":"I was wroth with my people: I have polluted mine inheritance, and given them into thine hand, thou didst show them no mercy, but thou didst lay thy very heavy yoke upon the ancient."},{"num":7,"verse":"And thou saidest, I shall be a lady forever, so that thou didst not set thy mind to these things, neither didst thou remember the latter end thereof."},{"num":8,"verse":"Therefore now hear, thou that art given to pleasures, and dwellest careless, She saith in her heart, I am and none else: I shall not sit as a widow, neither shall know the loss of children."},{"num":9,"verse":"But these two things shall come to thee suddenly on one day, the loss of children and widowhood; they shall come upon thee in their perfection, for the multitude of thy divinations, and for the great abundance of thine enchanters."},{"num":10,"verse":"For thou hast trusted in thy wickedness; thou hast said, None seeth me. Thy wisdom and thy knowledge, they have caused thee to rebel, and thou hast said in thine heart, I am, and none else."},{"num":11,"verse":"Therefore shall evil come upon thee, and thou shalt not know the morning thereof; destruction shall fall upon thee, which thou shalt not be able to put away: destruction shall come upon thee suddenly, or thou beware."},{"num":12,"verse":"Stand now among thine enchanters, and in the multitude of thy soothsayers (with whom thou hast wearied thyself from thy youth) if so be thou mayest have profit, or if so be thou mayest have strength."},{"num":13,"verse":"Thou art wearied in the multitude of thy counsels: let now the astrologers, the stargazers, and prognosticators stand up, and save thee from these things that shall come upon thee."},{"num":14,"verse":"Behold, they shall be as stubble: the fire shall burn them; they shall not deliver their own lives from the power of the flame: there shall be no coals to warm at, nor light to sit by."},{"num":15,"verse":"Thus shall they serve thee, with whom thou hast wearied thee, even thy merchants from thy youth; every one shall wander to his own quarters: none shall save thee."}]