[{"header":"Babylon Is Punished"},{"num":47,"verse":"“Come down and sit in the dust, O pure daughter of Babylon. Sit on the ground without a throne, O people of the Babylonians. For you will no longer be called soft and gentle. "},{"num":2,"verse":"Take the heavy stones and grind grain. Take off your face-covering and your clothing. Take the covering off your legs, and cross the rivers. "},{"num":3,"verse":"Your body will not be covered, and your shame will be seen. I will punish, and will not show pity to any man.” "},{"num":4,"verse":"The One Who bought us and saves us, the Lord of All is His name, the Holy One of Israel. "},{"num":5,"verse":"“Sit and be quiet, and go into darkness, O people of the Babylonians. For you will no more be called the queen of nations. "},{"num":6,"verse":"I was angry with My people. I made My chosen nation unclean, and gave them into your hand. You did not show loving-kindness to them. On the older people you made your load very heavy. "},{"num":7,"verse":"You said, ‘I will be a queen forever.’ So you did not think about these things, or remember what might happen."},{"num":8,"verse":"“So now hear this, you who love the desires of the body, who live without fear of danger. You say in your heart, ‘I am, and there is no one besides me. I will not sit as a woman whose husband has died, and I will not lose my children.’ "},{"num":9,"verse":"But these two things will come upon you all at once in one day. You will lose your children and your husband. All this trouble will come to you, even with all your witchcraft and the strong power of your sinful secret ways. "},{"num":10,"verse":"You trusted in your sin and said, ‘No one sees me.’ Your wisdom and learning have led you the wrong way, for you have said in your heart, ‘I am, and there is no one besides me.’ "},{"num":11,"verse":"Much trouble will come upon you, and you will not know how to get away from it. Trouble will fall on you, and there will be no way for you to pay that it might go away. You will not know it but all at once you will be destroyed."},{"num":12,"verse":"“Keep on with your sinful secret ways and all your witchcraft that you have used since you were young. It might be that you will get something from it. Maybe you can cause fear. "},{"num":13,"verse":"You are tired with your many wise men. Now call the star watchers, those who tell by the stars what will happen in the future, those who tell the future by the new moons. Have them stand up and save you from what will come upon you. "},{"num":14,"verse":"See, they have become like dry grass. Fire burns them. They cannot take themselves away from the power of the fire. This is no fire for making one warm, or fire to sit by! "},{"num":15,"verse":"This is how those are to you, with whom you have worked since you were young. Each one has gone on in his own wrong way. There is no one who can save you."}]