[{"num":47,"verse":"Go down, and sit in the aphar, O Betulat Bat Bavel, sit on the ground; there is no kisse, O Bat Kasdim (Chaldeans); for thou shalt no more be called tender and delicate."},{"num":2,"verse":"Take the millstones, and grind meal; uncover thy tzammah (hair, tresses) lift up thy shohvel (train, skirt), bare the thigh, pass over the neharot."},{"num":3,"verse":"Thy ervat (nakedness) shall be exposed, yes, thy cherpah (shame, reproach) shall be seen; I will take nakam (vengeance) and I will not be as adam when I meet thee."},{"num":4,"verse":"Go’aleinu, Hashem Tzva’os Shmo, Kadosh Yisroel."},{"num":5,"verse":"Sit thou silent, and get thee into choshech, O Bat Kasdim (Chaldeans); for thou shalt no more be called, Geveret Mamlachot (The Lady of Kingdoms)."},{"num":6,"verse":"I was angry with My people, I have profaned Mine nachalah, and given them into thine yad; thou didst show them no rachamim (mercy); upon the zaken (ancient, old) hast thou very heavily laid thy ol (yoke)."},{"num":7,"verse":"And thou saidst, I shall be a Geveret ad l’olahm (Lady forever): so that thou didst not lay these things to thy lev, neither didst remember her [Babylon’s] acharit (latter end, i.e. future destruction)."},{"num":8,"verse":"Therefore hear now this, O adinah (voluptuous, wanton one) that dwellest lavetach (carelessly, in security), that sayest in her lev, I am, and none else besides me; I shall not live as an almanah, neither shall I know shechol (the loss of children, bereavement);"},{"num":9,"verse":"But these two things shall overtake thee in a rega (moment), in yom echad, shechol (the loss of children), and almon (widowhood); they shall come upon thee in their perfection for the multitude of thy kashefanut (sorceries, witchcraft) and for the otzmah (great abundance) of thine khavarim (spells, magic, enchantments)."},{"num":10,"verse":"For thou hast trusted in thy ra’ah (wickedness); thou hast said, None seeth me. Thy chochmah and thy da’as, it hath perverted thee; and thou hast said in thine lev, I am, and none else beside me."},{"num":11,"verse":"Therefore shall ra’ah come upon thee; thou shalt not know its shachar (dawn, from whence it riseth); and tragedy will befall thee; thou shalt not be able to make kofer (ransom) to ward it off; and sho’ah (catastrophe) shall come upon thee pitom (suddenly), which thou shalt not foresee or know."},{"num":12,"verse":"Stand now with thine khavarim (spells, magic, enchantments), and with the multitude of thy kashefanut (sorceries, witchcraft) wherein thou hast toiled from thy neurim; perhaps thou shalt be able to succeed, perhaps thou mayest cause terror."},{"num":13,"verse":"Thou art wearied in the multitude of thy etzot (counsels). Let now stand up the hovrev Shomayim (the dissectors of the heavens, astrologers), the chozim bakochavim (stargazers), the ones that predict the future by Rosh Chodesh, and save thee from these things that shall come upon thee."},{"num":14,"verse":"Hinei, they shall be as kash (stubble, straw); the eish shall burn them; they shall not save their nefesh from the power of the flame; there shall not be a hot coal to warm them, nor eish to sit before."},{"num":15,"verse":"Thus unto thee are they with whom thou hast toiled, who have been thy socharim (traffickers, i.e., religious practitioners) from thy neurim (youth); they shall wander about in their random exits; none shall act as Moshi’a to thee."}]