[[],[{"type":"header","content":"David Made King over All Israel"},{"type":"prose","content":"Then all Israel gathered to David at Hebron, saying, “Behold, we are your bone and your flesh. "}],[{"type":"prose","content":"In times past, even when Saul was king, it was you who led out and brought in Israel; and the  your God said to you, ‘You shall shepherd My people Israel, and you shall be prince  leader over My people Israel.’” "}],[{"type":"prose","content":"So all the elders of Israel came to the king at Hebron, and David made a covenant (solemn agreement) with them there before the ; and they anointed him king over Israel, in accordance with the word of the  through Samuel."},{"type":"header","content":"Jerusalem, Capital City"}],[{"type":"prose","content":"Then David and all Israel went to Jerusalem that is Jebus; and the Jebusites, the inhabitants of the land, were there. "}],[{"type":"prose","content":"Then the Jebusites said to David, “You shall not come in here.” But David captured the stronghold of Zion that is, the City of David. "}],[{"type":"prose","content":"Now David said, “Whoever strikes down a Jebusite first shall be chief and commander.” Joab the son of Zeruiah [David’s half sister] went up first, and so he was made chief. "}],[{"type":"prose","content":"Then David lived in the stronghold; so it was called the City of David. "}],[{"type":"prose","content":"He built the city around it, from the Millo (fortification) to the surrounding area; and Joab repaired the rest of the [old Jebusite] city. "}],[{"type":"prose","content":"David became greater and greater, for the  of hosts was with him."},{"type":"header","content":"David’s Mighty Men"}],[{"type":"prose","content":"Now these are the chiefs of David’s mighty men, who strongly supported him in his kingdom, together with all Israel, to make him king, in accordance with the word of the  concerning Israel. "}],[{"type":"prose","content":"This is the list of David’s mighty men: Jashobeam, the son of a Hachmonite, the chief of the thirty [heroes]. He lifted up his spear against three hundred whom he killed at one time."}],[{"type":"prose","content":"Next to him [in rank] was Eleazar the son of Dodo the Ahohite, who was one of the three mighty men. "}],[{"type":"prose","content":"He was with David at Pasdammim [where David had killed Goliath] and there the Philistines were gathered together for battle, and there was a plot of ground full of barley; and the people [of Israel] fled before the Philistines. "}],[{"type":"prose","content":"But they took their stand in the midst of that plot and defended it, and killed the Philistines; and the  rescued them by a great victory."}],[{"type":"prose","content":"Three of the thirty chief men went down to the rock to David, into the cave of Adullam, while the army of the Philistines was camped in the Valley of Rephaim. "}],[{"type":"prose","content":"David was then in the stronghold, while the garrison of the Philistines was in Bethlehem. "}],[{"type":"prose","content":"David had a craving and said, “Oh that someone would give me a drink of water from the well of Bethlehem, which is next to the gate!” "}],[{"type":"prose","content":"Then the three [mighty men] broke through the camp of the Philistines and drew water out of the well of Bethlehem which was next to the gate, and brought it to David. But David would not drink it; he poured it out to the  [as an offering]; "}],[{"type":"prose","content":"and he said, “Far be it from me before my God that I would do this thing! Shall I drink the blood of these men who have put their lives in jeopardy? For they brought it at the risk of their lives.” So he would not drink it. These things the three mighty men did."}],[{"type":"prose","content":"Abishai the brother of Joab was chief of the [other] three, and he lifted up his spear against three hundred and killed them, and he had a name as well as the three. "}],[{"type":"prose","content":"Of the three in the second [rank] he was the most honored and became their captain; however, he did not attain to the  three [Jashobeam, Eleazar, and Shammah]."}],[{"type":"prose","content":"Benaiah the son of Jehoiada, the son of a courageous man of Kabzeel who had done great things, killed the two  Ariel of Moab. Also he went down and killed a lion in a pit on a snowy day. "}],[{"type":"prose","content":"He killed an Egyptian also, a man of  stature, five cubits tall. In the Egyptian’s hand was a spear like a weaver’s beam, and Benaiah went down to him with [only] a staff (rod) and grabbed the spear from the Egyptian’s hand and killed him with his own spear. "}],[{"type":"prose","content":"Benaiah the son of Jehoiada did these , and had a name as well as the three mighty men. "}],[{"type":"prose","content":"He was honored among the thirty, but he did not attain to [the rank of] the [first] three. David appointed him over his bodyguard."}],[{"type":"prose","content":"Now the mighty men of the armies were: Asahel the brother of Joab, Elhanan the son of Dodo of Bethlehem, "}],[{"type":"prose","content":"Shammoth the Harorite, Helez the Pelonite, "}],[{"type":"prose","content":"Ira the son of Ikkesh of Tekoa, Abiezer of Anathoth, "}],[{"type":"prose","content":"Sibbecai the Hushathite, Ilai the Ahohite, "}],[{"type":"prose","content":"Maharai the Netophathite, Heled the son of Baanah the Netophathite, "}],[{"type":"prose","content":"Ithai the son of Ribai of Gibeah of the Benjamites, Benaiah the Pirathonite, "}],[{"type":"prose","content":"Hurai of the brooks of Gaash, Abiel the Arbathite, "}],[{"type":"prose","content":"Azmaveth the Baharumite, Eliahba the Shaalbonite, "}],[{"type":"prose","content":"the sons of Hashem the Gizonite, Jonathan the son of Shagee the Hararite, "}],[{"type":"prose","content":"Ahiam the son of Sacar the Hararite, Eliphal the son of Ur, "}],[{"type":"prose","content":"Hepher the Mecherathite, Ahijah the Pelonite, "}],[{"type":"prose","content":"Hezro the Carmelite, Naarai the son of Ezbai, "}],[{"type":"prose","content":"Joel the brother of Nathan, Mibhar the son of Hagri, "}],[{"type":"prose","content":"Zelek the Ammonite, Naharai the Berothite, the armor bearer of Joab the son of Zeruiah [David’s half sister], "}],[{"type":"prose","content":"Ira the Ithrite, Gareb the Ithrite, "}],[{"type":"prose","content":"Uriah the Hittite [Bathsheba’s husband], Zabad the son of Ahlai, "}],[{"type":"prose","content":"Adina the son of Shiza the Reubenite, a chief of the Reubenites, and thirty [heroes] with him, "}],[{"type":"prose","content":"Hanan the son of Maacah, and Joshaphat the Mithnite, "}],[{"type":"prose","content":"Uzzia the Ashterathite, Shama and Jeiel the sons of Hotham the Aroerite, "}],[{"type":"prose","content":"Jediael the son of Shimri, and his brother Joha, the Tizite, "}],[{"type":"prose","content":"Eliel the Mahavite, Jeribai and Joshaviah the sons of Elnaam, Ithmah the Moabite, "}],[{"type":"prose","content":"Eliel and Obed and Jaasiel the Mezobaite."}]]