[{"header":"David is Anointed King(A)"},{"num":11,"verse":"Later on, all of Israel gathered together at Hebron in order to tell David, “Look, we’re your own flesh and blood! "},{"num":2,"verse":"Even back when Saul was ruling as king, you kept on leading the army of Israel out to battle and bringing them in again. The Lord your God told you, ‘You yourself will shepherd my people Israel and will be Commander-in-Chief over my people Israel.’” "},{"num":3,"verse":"So all the elders of Israel approached the king at Hebron, where David entered into a covenant in the presence of the Lord. Then they anointed David to be king over Israel, just as the Lord had sent word through Samuel."},{"header":"David Captures Jerusalem"},{"num":4,"verse":"Later, David and all of Israel marched to Jerusalem (then known as Jebus, where the Jebusites lived when they inhabited the land). "},{"num":5,"verse":"The inhabitants of Jebus told David, “You’re not coming in here!” Nevertheless, David captured the fortress of Zion, now known as the City of David."},{"num":6,"verse":"David had announced, “Whoever first attacks the Jebusites will be appointed chief and commander.” When Zeruiah’s son Joab went up first, he became chief. "},{"num":7,"verse":"David occupied the fortress, so it was named the City of David after him. "},{"num":8,"verse":"He built up the walls surrounding the city in a complete circle from the terrace ramparts, and Joab repaired the rest of the city. "},{"num":9,"verse":"David became more and more prestigious because the Lord of the Heavenly Armies was with him."},{"header":"David’s Elite Soldiers(B)"},{"num":10,"verse":"These are the leaders of the elite warriors who were strong supporters of David in his kingdom, along with all of Israel, in keeping with the message from the Lord concerning Israel. "},{"num":11,"verse":"This record of the warriors who were for David included Hachmoni’s son Jashobeam, leader of the platoons, who killed 300 with his spear in a single encounter."},{"num":12,"verse":"Next to him among the Three Warriors was Dodo the Ahohite’s son Eleazar. "},{"num":13,"verse":"He was with David at Pas-dammim when the Philistines were there to engage them in battle. There was a field planted with barley, and the army had run away from the Philistines, "},{"num":14,"verse":"but they took a defensive stand in the middle of the field and killed the Philistines while the Lord saved them by means of a great victory."},{"num":15,"verse":"Later, the Three Warriors went down to David’s hideout at the cave of Adullam when the Philistine army was camping in the valley of giants. "},{"num":16,"verse":"David was living in that stronghold at the time, while a Philistine garrison was then at Bethlehem. "},{"num":17,"verse":"David expressed a longing, “Oh, how I wish someone would get me a drink of water from the Bethlehem well that’s by the city gate!” "},{"num":18,"verse":"So the Three Warriors broke through the Philistine ranks, drew some water from the Bethlehem well that was next to the city gate, and brought it back to David. But David refused to drink it, poured it out in the Lord’s presence, and "},{"num":19,"verse":"said in response, “May God forbid me to do this! I won’t drink the blood of these men, will I? After all, they risked their lives to bring it to me.” That’s why he wouldn’t drink it. The Three Warriors did these things."},{"header":"David’s Other Valiant Soldiers(C)"},{"num":20,"verse":"Joab’s brother Abishai was the lieutenant in charge of the platoons. He used his spear to fight and kill 300 men, gaining a reputation distinct from the Three. "},{"num":21,"verse":"He was more well-known than the Three, but he never attained the stature of the Three."},{"num":22,"verse":"Jehoiada’s son Benaiah, who was a valiant man, accomplished great things. He was from Kabzeel. He killed two men named Ariel from Moab and then he also went down into a pit and struck down a lion during a snow storm one day. "},{"num":23,"verse":"He also killed a soldier from Egypt of enormous height—five cubits tall. The Egyptian carried a spear comparable in size to a weaver’s beam, but Benaiah attacked him with a staff, snatched the spear out of the Egyptian’s hand and killed him with his own spear. "},{"num":24,"verse":"Benaiah did things like this and gained a reputation comparable to the Three Warriors. "},{"num":25,"verse":"He was well known among the platoons, but he didn’t measure up to the Three Warriors. David placed him in charge of his security detail."},{"num":26,"verse":"The elite forces included Asahel (Joab’s brother), Dodo’s son Elhanan from Bethlehem, "},{"num":27,"verse":"Shammoth from Haror, Helez the Pelonite, "},{"num":28,"verse":"Ikkesh’s son Ira from Tekoa, Abiezer from Anathoth, "},{"num":29,"verse":"Sibbecai the Hushathite, Ilai the Ahohite, "},{"num":30,"verse":"Maharai from Netophah, Baanah’s son Heled from Netophah, "},{"num":31,"verse":"Ribai’s son Ithai from Gibeah, controlled by the descendants of Benjamin, Benaiah of Pirathon, "},{"num":32,"verse":"Hurai from the wadis of Gaash, Abiel the Arbathite, "},{"num":33,"verse":"Azmaveth from Baharum, Eliahba from Shaalbon, "},{"num":34,"verse":"Hashem the Gizonite, Shagee the Hararite’s son Jonathan, "},{"num":35,"verse":"Sachar the Hararite’s son Ahiam, Ur’s son Eliphal, "},{"num":36,"verse":"Hepher the Mecherathite, Ahijah the Pelonite, "},{"num":37,"verse":"Hezro from Carmel, Ezbai’s son Naarai, "},{"num":38,"verse":"Joel (Nathan’s brother), Hagri’s son Mibhar, "},{"num":39,"verse":"Zelek the Ammonite, Naharai from Beeroth, who was the armor-bearer for Zeruiah’s son Joab, "},{"num":40,"verse":"Ira the Ithrite, Gareb the Ithrite, "},{"num":41,"verse":"Uriah the Hittite, Ahlai’s son Zabad, "},{"num":42,"verse":"Shiza the Reubenite’s son Adina, a leader of the descendants of Reuben, along with thirty others with him, "},{"num":43,"verse":"Maacah’s son Hanan, Joshaphat the Mithnite, "},{"num":44,"verse":"Uzzia the Ashterathite, Hotham the Aroerite’s sons Shama and Jeiel, "},{"num":45,"verse":"Shimri’s son Jediael and his brother Joha the Tizite, "},{"num":46,"verse":"Eliel the Mahavite, Elnaam’s sons Jeribai and Joshaviah, Ithmah the Moabite, "},{"num":47,"verse":"Eliel, Obed, and Jaasiel the Mezobaite."}]