[[],[{"type":"header","content":"David Made King over All Israel(A)"},{"type":"prose","content":"Then all Israel came together to David at Hebron, saying, “Indeed we  your bone and your flesh. "}],[{"type":"prose","content":"Also, in time past, even when Saul was king, you  the one who led Israel out and brought them in; and the  your God said to you, ‘You shall shepherd My people Israel, and be ruler over My people Israel.’ ” "}],[{"type":"prose","content":"Therefore all the elders of Israel came to the king at Hebron, and David made a covenant with them at Hebron before the . And they anointed David king over Israel, according to the word of the  by Samuel."}],[{"type":"header","content":"The City of David(G)"},{"type":"prose","content":"And David and all Israel went to Jerusalem, which is Jebus, where the Jebusites  the inhabitants of the land. "}],[{"type":"prose","content":"But the inhabitants of Jebus said to David, “You shall not come in here!” Nevertheless David took the stronghold of Zion (that is, the City of David). "}],[{"type":"prose","content":"Now David said, “Whoever attacks the Jebusites first shall be chief and captain.” And Joab the son of Zeruiah went up first, and became chief. "}],[{"type":"prose","content":"Then David dwelt in the stronghold; therefore they called it the City of David. "}],[{"type":"prose","content":"And he built the city around it, from the Millo to the surrounding area. Joab repaired the rest of the city. "}],[{"type":"prose","content":"So David went on and became great, and the  of hosts  with him."}],[{"type":"header","content":"The Mighty Men of David(L)"},{"type":"prose","content":"Now these  the heads of the mighty men whom David had, who strengthened themselves with him in his kingdom, with all Israel, to make him king, according to the word of the  concerning Israel."}],[{"type":"prose","content":"And this  the number of the mighty men whom David had: Jashobeam the son of a Hachmonite, chief of the captains; he had lifted up his spear against three hundred, killed  at one time."}],[{"type":"prose","content":"After him  Eleazar the son of Dodo, the Ahohite, who  of the three mighty men. "}],[{"type":"prose","content":"He was with David at Pasdammim. Now there the Philistines were gathered for battle, and there was a piece of ground full of barley. So the people fled from the Philistines. "}],[{"type":"prose","content":"But they stationed themselves in the middle of  field, defended it, and killed the Philistines. So the  brought about a great victory."}],[{"type":"prose","content":"Now three of the thirty chief men went down to the rock to David, into the cave of Adullam; and the army of the Philistines encamped in the Valley of Rephaim. "}],[{"type":"prose","content":"David  then in the stronghold, and the garrison of the Philistines  then in Bethlehem. "}],[{"type":"prose","content":"And David said with longing, “Oh, that someone would give me a drink of water from the well of Bethlehem, which is by the gate!” "}],[{"type":"prose","content":"So the three broke through the camp of the Philistines, drew water from the well of Bethlehem that  by the gate, and took  and brought  to David. Nevertheless David would not drink it, but poured it out to the . "}],[{"type":"prose","content":"And he said, “Far be it from me, O my God, that I should do this! Shall I drink the blood of these men  their lives  For at the risk of their lives they brought it.” Therefore he would not drink it. These things were done by the three mighty men."}],[{"type":"prose","content":"Abishai the brother of Joab was chief of  three. He had lifted up his spear against three hundred  killed  and won a name among  three. "}],[{"type":"prose","content":"Of the three he was more honored than the other two men. Therefore he became their captain. However he did not attain to the  three."}],[{"type":"prose","content":"Benaiah was the son of Jehoiada, the son of a valiant man from Kabzeel, who had done many deeds. He had killed two lion-like heroes of Moab. He also had gone down and killed a lion in the midst of a pit on a snowy day. "}],[{"type":"prose","content":"And he killed an Egyptian, a man of  height, five cubits tall. In the Egyptian’s hand  a spear like a weaver’s beam; and he went down to him with a staff, wrested the spear out of the Egyptian’s hand, and killed him with his own spear. "}],[{"type":"prose","content":"These  Benaiah the son of Jehoiada did, and won a name among three mighty men. "}],[{"type":"prose","content":"Indeed he was more honored than the thirty, but he did not attain to the  three. And David appointed him over his guard."}],[{"type":"prose","content":"Also the mighty warriors  Asahel the brother of Joab, Elhanan the son of Dodo of Bethlehem, "}],[{"type":"prose","content":"Shammoth the Harorite, Helez the Pelonite, "}],[{"type":"prose","content":"Ira the son of Ikkesh the Tekoite, Abiezer the Anathothite, "}],[{"type":"prose","content":"Sibbechai the Hushathite, Ilai the Ahohite, "}],[{"type":"prose","content":"Maharai the Netophathite, Heled the son of Baanah the Netophathite, "}],[{"type":"prose","content":"Ithai the son of Ribai of Gibeah, of the sons of Benjamin, Benaiah the Pirathonite, "}],[{"type":"prose","content":"Hurai of the brooks of Gaash, Abiel the Arbathite, "}],[{"type":"prose","content":"Azmaveth the Baharumite, Eliahba the Shaalbonite, "}],[{"type":"prose","content":"the sons of Hashem the Gizonite, Jonathan the son of Shageh the Hararite, "}],[{"type":"prose","content":"Ahiam the son of Sacar the Hararite, Eliphal the son of Ur, "}],[{"type":"prose","content":"Hepher the Mecherathite, Ahijah the Pelonite, "}],[{"type":"prose","content":"Hezro the Carmelite, Naarai the son of Ezbai, "}],[{"type":"prose","content":"Joel the brother of Nathan, Mibhar the son of Hagri, "}],[{"type":"prose","content":"Zelek the Ammonite, Naharai the Berothite (the armorbearer of Joab the son of Zeruiah), "}],[{"type":"prose","content":"Ira the Ithrite, Gareb the Ithrite, "}],[{"type":"prose","content":"Uriah the Hittite, Zabad the son of Ahlai, "}],[{"type":"prose","content":"Adina the son of Shiza the Reubenite (a chief of the Reubenites) and thirty with him, "}],[{"type":"prose","content":"Hanan the son of Maachah, Joshaphat the Mithnite, "}],[{"type":"prose","content":"Uzzia the Ashterathite, Shama and Jeiel the sons of Hotham the Aroerite, "}],[{"type":"prose","content":"Jediael the son of Shimri, and Joha his brother, the Tizite, "}],[{"type":"prose","content":"Eliel the Mahavite, Jeribai and Joshaviah the sons of Elnaam, Ithmah the Moabite, "}],[{"type":"prose","content":"Eliel, Obed, and Jaasiel the Mezobaite."}]]