[{"header":"David’s Rise and Capture of Zion"},{"num":11,"verse":"Then all Israel gathered to David at Hebron, saying: “Behold, we are your own flesh and blood. "},{"num":2,"verse":"In the past, even when Saul was king, you were the one that led out and brought in Israel. Adonai your God also said to you, ‘You shall shepherd My people Israel and you shall be ruler over My people Israel.’”"},{"num":3,"verse":"When all the elders of Israel came to the king at Hebron, David made a covenant with them in Hebron before Adonai. They anointed David king over Israel, in keeping with the word of Adonai by the hand of Samuel."},{"num":4,"verse":"Then David and all Israel went to Jerusalem—that is Jebus, where the Jebusite inhabitants of the land lived. "},{"num":5,"verse":"Now the residents of Jebus said to David, “You cannot get in here!” Nevertheless David captured the stronghold of Zion, which is now the city of David."},{"num":6,"verse":"David had said, “Whoever strikes down the Jebusites first will be commander-in-chief.” So Joab son of Zeruiah went up first, so he became commander. "},{"num":7,"verse":"David lived in the stronghold; for this reason it is called the city of David. "},{"num":8,"verse":"He fortified the city all around, from the Millo to the surrounding walls, and Joab repaired the rest of the city. "},{"num":9,"verse":"David grew more and more powerful because Adonai-Tzva’ot was with him."},{"header":"David’s Mighty Men"},{"num":10,"verse":"Now these were chiefs of David’s mighty men, who strongly supported him in his kingdom, together with all Israel to make him king, according to the word of Adonai, over Israel. "},{"num":11,"verse":"This is the list of David’s mighty men: Jashobeam the son of Hachmoni, was the chief of the 30; he wielded his spear against 300 and slew them all at one time. "},{"num":12,"verse":"After him was Eleazar son of Dodo the Ahohite, who was one of the three mighty men. "},{"num":13,"verse":"He was with David at Pas Dammim, when the Philistines assembled there for battle. There was a plot of ground full of barley where the army retreated from before the Philistines, "},{"num":14,"verse":"but they took a stand in the middle of the plot; they defended it and struck down the Philistines. Adonai delivered a great victory."},{"num":15,"verse":"Three of the 30 leaders went down to David at the rock at the cave of Adullam, while a band of the Philistines was encamped in the valley of Rephaim. "},{"num":16,"verse":"At that time, David was in the stronghold, while the garrison of the Philistines was in Bethlehem. "},{"num":17,"verse":"David had a craving and said, “If only someone would give me water to drink from the cistern by the gate in Bethlehem!” "},{"num":18,"verse":"So the three broke through the Philistine camp and drew water from the cistern by the gate in Bethlehem and carried it back to David. But David refused to drink it. He poured it out to Adonai "},{"num":19,"verse":"and said: “Far be it for me that I should do this before my God! Can I drink the blood of these men who risked their lives?”—for they brought it at the risk of their lives and he would not drink it. Such were the exploits of the Three mighty men."},{"num":20,"verse":"Abishai, Joab’s brother, was chief of the Three. He once wielded his spear against 300 and slew them. Thus he won a name among the Three. "},{"num":21,"verse":"Of the Three, he was more highly esteemed than the other two and became their commander, even though he was not one of the three."},{"num":22,"verse":"Beniah son of Jehoiada was a valiant man from Kabzeel who had done mighty deeds. He killed the two sons of Ariel of Moab, and went down and killed a lion inside a pit on a snowy day. "},{"num":23,"verse":"He also killed the giant Egyptian man who was five cubits tall. In his hand the Egyptian had a spear like a weaver’s beam, yet Beniah attacked him with a club. He snatched the spear out of the Egyptian’s hand and killed him with his own spear. "},{"num":24,"verse":"These were the exploits of Beniah son of Jehoiada, who gained renown among the three mighty men. "},{"num":25,"verse":"Behold, he was more honorable than the 30, yet he was not one of the Three. Nevertheless, David set him over his bodyguard."},{"num":26,"verse":"The mighty men were:"},{"num":27,"verse":"Shammoth the Harorite,"},{"num":28,"verse":"Ira son of Ikkesh the Tekoite,"},{"num":29,"verse":"Sibbecai the Hushathite,"},{"num":30,"verse":"Mahrai the Netophathite,"},{"num":31,"verse":"Ithai son of Ribai from Gibeah of the children of Benjamin,"},{"num":32,"verse":"Hurai of Nahale-gaash,"},{"num":33,"verse":"Azmaveth the Baharumite,"},{"num":34,"verse":"the sons of Hashem the Gizonite,"},{"num":35,"verse":"Ahiam son of Sacar the Hararite,"},{"num":36,"verse":"Hepher the Meherathite,"},{"num":37,"verse":"Hezro the Carmelite,"},{"num":38,"verse":"Joel the brother of Nathan,"},{"num":39,"verse":"Zelek the Ammonite,"},{"num":40,"verse":"Ira the Ithrite,"},{"num":41,"verse":"Uriah the Hittite,"},{"num":42,"verse":"Adina son of Shiza the Reubenite, a chief of the Reubenites, and 30 with him,"},{"num":43,"verse":"Hanan son of Maacah, and Joshaphat the Mithnite,"},{"num":44,"verse":"Uzzijah the Ashterathite,"},{"num":45,"verse":"Jedaiael son of Shimri and Joha his brother the Tizite,"},{"num":46,"verse":"Eliel the Mahavite,"},{"num":47,"verse":"Eliel, Obed, and Jaasiel the Mezobaite."}]