[{"num":55,"verse":"Listen to my prayer, O God; don’t hide yourself when I cry to you. "},{"num":2,"verse":"Hear me, Lord! Listen to me! For I groan and weep beneath my burden of woe."},{"num":3,"verse":"My enemies shout against me and threaten me with death. They surround me with terror and plot to kill me. Their fury and hatred rise to engulf me. "},{"num":4,"verse":"My heart is in anguish within me. Stark fear overpowers me. "},{"num":5,"verse":"Trembling and horror overwhelm me. "},{"num":6,"verse":"Oh, for wings like a dove, to fly away and rest! "},{"num":7,"verse":"I would fly to the far-off deserts and stay there. "},{"num":8,"verse":"I would flee to some refuge from all this storm."},{"num":9,"verse":"O Lord, make these enemies begin to quarrel among themselves—destroy them with their own violence and strife. "},{"num":10,"verse":"Though they patrol their walls night and day against invaders, their real problem is internal—wickedness and dishonesty are entrenched in the heart of the city. "},{"num":11,"verse":"There is murder and robbery there, and cheating in the markets and wherever you look."},{"num":12,"verse":"It was not an enemy who taunted me—then I could have borne it; I could have hidden and escaped. "},{"num":13,"verse":"But it was you, a man like myself, my companion and my friend. "},{"num":14,"verse":"What fellowship we had, what wonderful discussions as we walked together to the Temple of the Lord on holy days."},{"num":15,"verse":"Let death seize them and cut them down in their prime, for there is sin in their homes, and they are polluted to the depths of their souls."},{"num":16,"verse":"But I will call upon the Lord to save me—and he will. "},{"num":17,"verse":"I will pray morning, noon, and night, pleading aloud with God; and he will hear and answer. "},{"num":18,"verse":"Though the tide of battle runs strongly against me, for so many are fighting me, yet he will rescue me. "},{"num":19,"verse":"God himself—God from everlasting ages past—will answer them! For they refuse to fear him or even honor his commands."},{"num":20,"verse":"This friend of mine betrayed me—I who was at peace with him. He broke his promises. "},{"num":21,"verse":"His words were oily smooth, but in his heart was war. His words were sweet, but underneath were daggers."},{"num":22,"verse":"Give your burdens to the Lord. He will carry them. He will not permit the godly to slip or fall. "},{"num":23,"verse":"He will send my enemies to the pit of destruction. Murderers and liars will not live out half their days. But I am trusting you to save me."}]