[{"num":10,"verse":"Ask of the Lord rain in the time of the latter or spring rain. It is the Lord Who makes lightnings which usher in the rain and give men showers, and grass to everyone in the field."},{"num":2,"verse":"For the teraphim (household idols) have spoken vanity (emptiness, falsity, and futility) and the diviners have seen a lie and the dreamers have told false dreams; they comfort in vain. Therefore the people go their way like sheep; they are afflicted and hurt because there is no shepherd."},{"num":3,"verse":"My anger is kindled against the shepherds [who are not true shepherds] and I will punish the goat leaders, for the Lord of hosts has visited His flock, the house of Judah, and will make them as His beautiful and majestic horse in the battle."},{"num":4,"verse":"Out of him [Judah] shall come forth the Cornerstone, out of him the tent peg, out of him the battle bow; every ruler shall proceed from him."},{"num":5,"verse":"And they shall be like mighty men treading down their enemies in the mire of the streets in the battle, and they shall fight because the Lord is with them, and the [oppressor’s] riders on horses shall be confounded and put to shame."},{"num":6,"verse":"And I will strengthen the house of Judah and I will save the house of Joseph [Ephraim]. I will bring them back and cause them to dwell securely, for I have mercy, loving-kindness, and compassion for them. They shall be as though I had not cast them off, for I am the Lord their God, and I will hear them."},{"num":7,"verse":"Then Ephraim [the ten tribes] shall become like a mighty warrior, and their hearts shall rejoice as through wine; yes, their children shall see it and rejoice; their hearts shall feel great delight and glory triumphantly in the Lord!"},{"num":8,"verse":"I will hiss for them [as the keeper does for his bees] and gather them in, for I have redeemed them, and they shall increase [again] as they have increased [before, in Egypt]."},{"num":9,"verse":"And though I sow them among the nations, yet they shall [earnestly] remember Me in far countries, and with their children they shall live and shall return [to God and the land He gave them]."},{"num":10,"verse":"I will bring them [all Israel] home again from the land of Egypt and gather them out of Assyria, and I will bring them into the land [on the east and on the west of the Jordan, into] Gilead and Lebanon, and room enough shall not be found for them."},{"num":11,"verse":"And [the Lord] will pass through the sea of distress and affliction [at the head of His people, as He did at the Red Sea]; and He will smite down the waves of the sea, and all the depths of the [river] Nile shall be dried up and put to shame; and the pride of Assyria shall be brought down and the scepter or rod [of the taskmasters of Egypt] shall pass away."},{"num":12,"verse":"And I will strengthen [Israel] in the Lord, and they shall walk up and down and glory in His name, says the Lord."}]