[{"num":10,"verse":"1 The vanity of Idolatry. 3 The Lord promiseth to visit and comfort the house of Israel."},{"num":1,"verse":"Ask you of the Lord rain in the time of the latter rain: so shall the Lord make white clouds, and give you showers of rain, and to everyone grass in the field."},{"num":2,"verse":"Surely the idols have spoken vanity, and the soothsayers have seen a lie, and the dreamers have told a vain thing: they comfort in vain: therefore they went away as sheep: they were troubled, because there was no shepherd."},{"num":3,"verse":"My wrath was kindled against the shepherds, and I did visit the goats: but the Lord of hosts will visit his flock the house of Judah, and will make them as his beautiful horse in the battle."},{"num":4,"verse":"Out of him shall the corner come forth: out of him the nail, out of him ye bow of battle, and out of him every appointer of tribute also."},{"num":5,"verse":"And they shall be as the mighty men, which tread down their enemies in the mire of the streets in the battle, and they shall fight, because the Lord is with them, and the riders on horses shall be confounded."},{"num":6,"verse":"And I will strengthen the house of Judah, and I will preserve the house of Joseph, and I will bring them again, for I pity them: and they shall be as though I had not cast them off: for I am the Lord their God, and will hear them."},{"num":7,"verse":"And they of Ephraim shall be as a giant: and their heart shall rejoice as through wine: yea, their children shall see it, and be glad: and their heart shall rejoice in the Lord."},{"num":8,"verse":"I will hiss for them: and gather them: for I have redeemed them: and they shall increase, as they have increased."},{"num":9,"verse":"And I will sow them among the people, and they shall remember me in far countries: and they shall live with their children and turn again."},{"num":10,"verse":"I will bring them again also out of the land of Egypt, and gather them out of Assyria: and I will bring them into the land of Gilead, and Lebanon, and place shall not be found for them."},{"num":11,"verse":"And he shall go into the sea with affliction, and shall smite the waves in the sea, and all the depths of the river shall dry up: and the pride of Assyria shall be cast down, and the scepter of Egypt shall depart away."},{"num":12,"verse":"And I will strengthen them in the Lord, and they shall walk in his Name, saith the Lord."}]