[{"num":10,"verse":"Brethren, [with all] my heart’s desire and goodwill for [Israel], I long and pray to God that they may be saved."},{"num":2,"verse":"I bear them witness that they have a [certain] zeal and enthusiasm for God, but it is not enlightened and according to [correct and vital] knowledge."},{"num":3,"verse":"For being ignorant of the righteousness that God ascribes [which makes one acceptable to Him in word, thought, and deed] and seeking to establish a righteousness (a means of salvation) of their own, they did not obey or submit themselves to God’s righteousness."},{"num":4,"verse":"For Christ is the end of the Law [the limit at which it ceases to be, for the Law leads up to Him Who is the fulfillment of its types, and in Him the purpose which it was designed to accomplish is fulfilled. That is, the purpose of the Law is fulfilled in Him] as the means of righteousness (right relationship to God) for everyone who trusts in and adheres to and relies on Him."},{"num":5,"verse":"For Moses writes that the man who [can] practice the righteousness (perfect conformity to God’s will) which is based on the Law [with all its intricate demands] shall live by it."},{"num":6,"verse":"But the righteousness based on faith [imputed by God and bringing right relationship with Him] says, Do not say in your heart, Who will ascend into Heaven? that is, to bring Christ down;"},{"num":7,"verse":"Or who will descend into the abyss? that is, to bring Christ up from the dead [as if we could be saved by our own efforts]."},{"num":8,"verse":"But what does it say? The Word (God’s message in Christ) is near you, on your lips and in your heart; that is, the Word (the message, the basis and object) of faith which we preach,"},{"num":9,"verse":"Because if you acknowledge and confess with your lips that Jesus is Lord and in your heart believe (adhere to, trust in, and rely on the truth) that God raised Him from the dead, you will be saved."},{"num":10,"verse":"For with the heart a person believes (adheres to, trusts in, and relies on Christ) and so is justified (declared righteous, acceptable to God), and with the mouth he confesses (declares openly and speaks out freely his faith) and confirms [his] salvation."},{"num":11,"verse":"The Scripture says, No man who believes in Him [who adheres to, relies on, and trusts in Him] will [ever] be put to shame or be disappointed."},{"num":12,"verse":"[No one] for there is no distinction between Jew and Greek. The same Lord is Lord over all [of us] and He generously bestows His riches upon all who call upon Him [in faith]."},{"num":13,"verse":"For everyone who calls upon the name of the Lord [invoking Him as Lord] will be saved."},{"num":14,"verse":"But how are people to call upon Him Whom they have not believed [in Whom they have no faith, on Whom they have no reliance]? And how are they to believe in Him [adhere to, trust in, and rely upon Him] of Whom they have never heard? And how are they to hear without a preacher?"},{"num":15,"verse":"And how can men [be expected to] preach unless they are sent? As it is written, How beautiful are the feet of those who bring glad tidings! [How welcome is the coming of those who preach the good news of His good things!]"},{"num":16,"verse":"But they have not all heeded the Gospel; for Isaiah says, Lord, who has believed (had faith in) what he has heard from us?"},{"num":17,"verse":"So faith comes by hearing [what is told], and what is heard comes by the preaching [of the message that came from the lips] of Christ (the Messiah Himself)."},{"num":18,"verse":"But I ask, Have they not heard? Indeed they have; [for the Scripture says] Their voice [that of nature bearing God’s message] has gone out to all the earth, and their words to the far bounds of the world."},{"num":19,"verse":"Again I ask, Did Israel not understand? [Did the Jews have no warning that the Gospel was to go forth to the Gentiles, to all the earth?] First, there is Moses who says, I will make you jealous of those who are not a nation; with a foolish nation I will make you angry."},{"num":20,"verse":"Then Isaiah is so bold as to say, I have been found by those who did not seek Me; I have shown (revealed) Myself to those who did not [consciously] ask for Me."},{"num":21,"verse":"But of Israel he says, All day long I have stretched out My hands to a people unyielding and disobedient and self-willed [to a faultfinding, contrary, and contradicting people]."}]