[[],[{"type":"header","content":"The Potter and the Clay"},{"type":"prose","content":"The word which came to Jeremiah from the LORD: "}],[{"type":"prose","content":"“Arise and go down to the potter’s house, and there I will make you hear My words.” "}],[{"type":"prose","content":"Then I went down to the potter’s house, and saw that he was working at the wheel. "}],[{"type":"prose","content":"But the vessel that he was making from clay was spoiled by the potter’s hand; so he made it over, reworking it and making it into another pot that seemed good to him."}],[{"type":"prose","content":"Then the word of the LORD came to me: "}],[{"type":"prose","content":"“O house of Israel, can I not do with you as this potter does?” says the LORD. “Look carefully, as the clay is in the potter’s hand, so are you in My hand, O house of Israel. "}],[{"type":"prose","content":"At one moment I might [suddenly] speak concerning a nation or kingdom, that I will uproot and break down and destroy; "}],[{"type":"prose","content":"if that nation against which I have spoken turns from its evil, I will relent  reverse My decision concerning the devastation that I intended to do. "}],[{"type":"prose","content":"Or at another time I might [suddenly] speak about a nation or kingdom that I will build up or establish; "}],[{"type":"prose","content":"and if they do evil in My sight by not obeying My voice, then I will reverse My decision concerning the good with which I had promised to bless them. "}],[{"type":"prose","content":"Now then, say to the men of Judah and to the citizens of Jerusalem, ‘Thus says the LORD, “Behold, I am shaping a disaster and working out a plan against you. Turn back, each of you from his evil way; correct your habits and change your actions for the better.”’ "}],[{"type":"prose","content":"But they will say, ‘That is hopeless! For we are going to follow our own plans, and each of us will act in accordance with the stubbornness of his evil heart.’"}],[{"type":"prose","content":"Then [my enemies] said, “Come and let us work out schemes against Jeremiah. Surely the law is not going to be lost to the priest [as Jeremiah predicts], nor the counsel from the wise, nor the word from the prophet. Come and let us strike him with our tongue [by making charges against him before the king], and let us ignore anything he says.”"}]]