[{"header":"The Plan to Kill Jesus"},{"num":26,"verse":"Jesus finished saying all these things. Then he said to his disciples, "},{"num":2,"verse":"“As you know, the Passover Feast is two days away. The Son of Man will be handed over to be nailed to a cross.”"},{"num":3,"verse":"Then the chief priests met with the elders of the people. They met in the palace of Caiaphas, the high priest. "},{"num":4,"verse":"They made plans to arrest Jesus secretly. They wanted to kill him. "},{"num":5,"verse":"“But not during the feast,” they said. “The people may stir up trouble.”"},{"header":"A Woman Pours Perfume on Jesus"},{"num":6,"verse":"Jesus was in Bethany. He was in the home of Simon, who had a skin disease. "},{"num":7,"verse":"A woman came to Jesus with a special sealed jar of very expensive perfume. She poured the perfume on his head while he was at the table."},{"num":8,"verse":"When the disciples saw this, they became angry. “Why this waste?” they asked. "},{"num":9,"verse":"“The perfume could have been sold at a high price. The money could have been given to poor people.”"},{"num":10,"verse":"Jesus was aware of this. So he said to them, “Why are you bothering this woman? She has done a beautiful thing to me. "},{"num":11,"verse":"You will always have poor people with you. But you will not always have me. "},{"num":12,"verse":"She poured the perfume on my body to prepare me to be buried. "},{"num":13,"verse":"What I’m about to tell you is true. What she has done will be told anywhere this good news is preached all over the world. It will be told in memory of her.”"},{"header":"Judas Agrees to Hand Jesus Over"},{"num":14,"verse":"One of the 12 disciples went to the chief priests. His name was Judas Iscariot. "},{"num":15,"verse":"He asked, “What will you give me if I hand Jesus over to you?” So they counted out 30 silver coins for him. "},{"num":16,"verse":"From then on, Judas watched for the right time to hand Jesus over to them."},{"header":"The Lord’s Supper"},{"num":17,"verse":"It was the first day of the Feast of Unleavened Bread. The disciples came to Jesus. They asked, “Where do you want us to prepare for you to eat the Passover meal?”"},{"num":18,"verse":"He replied, “Go into the city to a certain man. Tell him, ‘The Teacher says, “My time is near. I am going to celebrate the Passover at your house with my disciples.” ’ ” "},{"num":19,"verse":"So the disciples did what Jesus had told them to do. They prepared the Passover meal."},{"num":20,"verse":"When evening came, Jesus was at the table with his 12 disciples. "},{"num":21,"verse":"While they were eating, he said, “What I’m about to tell you is true. One of you will hand me over to my enemies.”"},{"num":22,"verse":"The disciples became very sad. One after the other, they began to say to him, “Surely you don’t mean me, Lord, do you?”"},{"num":23,"verse":"Jesus replied, “The one who has dipped his hand into the bowl with me will hand me over. "},{"num":24,"verse":"The Son of Man will go just as it is written about him. But how terrible it will be for the one who hands over the Son of Man! It would be better for him if he had not been born.”"},{"num":25,"verse":"Judas was the one who was going to hand him over. He said, “Surely you don’t mean me, Teacher, do you?”"},{"num":26,"verse":"While they were eating, Jesus took bread. He gave thanks and broke it. He handed it to his disciples and said, “Take this and eat it. This is my body.”"},{"num":27,"verse":"Then he took a cup. He gave thanks and handed it to them. He said, “All of you drink from it. "},{"num":28,"verse":"This is my blood of the covenant. It is poured out to forgive the sins of many people. "},{"num":29,"verse":"Here is what I tell you. From now on, I won’t drink wine with you again until the day I drink it with you in my Father’s kingdom.”"},{"num":30,"verse":"Then they sang a hymn and went out to the Mount of Olives."},{"header":"Jesus Says That the Disciples Will Turn Away"},{"num":31,"verse":"Jesus told them, “This very night you will all turn away because of me. It is written that the Lord said,"},{"num":32,"verse":"But after I rise from the dead, I will go ahead of you into Galilee.”"},{"num":33,"verse":"Peter replied, “All the others may turn away because of you. But I never will.”"},{"num":34,"verse":"“What I’m about to tell you is true,” Jesus answered. “It will happen tonight. Before the rooster crows, you will say three times that you don’t know me.”"},{"num":35,"verse":"But Peter said, “I may have to die with you. But I will never say I don’t know you.” And all the other disciples said the same thing."},{"header":"Jesus Prays in Gethsemane"},{"num":36,"verse":"Then Jesus went with his disciples to a place called Gethsemane. He said to them, “Sit here while I go over there and pray.” "},{"num":37,"verse":"He took Peter and the two sons of Zebedee along with him. He began to be sad and troubled. "},{"num":38,"verse":"Then he said to them, “My soul is very sad. I feel close to death. Stay here. Keep watch with me.”"},{"num":39,"verse":"He went a little farther. Then he fell with his face to the ground. He prayed, “My Father, if it is possible, take this cup of suffering away from me. But let what you want be done, not what I want.”"},{"num":40,"verse":"Then he returned to his disciples and found them sleeping. “Couldn’t you men keep watch with me for one hour?” he asked Peter. "},{"num":41,"verse":"“Watch and pray. Then you won’t fall into sin when you are tempted. The spirit is willing, but the body is weak.”"},{"num":42,"verse":"Jesus went away a second time. He prayed, “My Father, is it possible for this cup to be taken away? But if I must drink it, may what you want be done.”"},{"num":43,"verse":"Then he came back. Again he found them sleeping. They couldn’t keep their eyes open. "},{"num":44,"verse":"So he left them and went away once more. For the third time he prayed the same thing."},{"num":45,"verse":"Then he returned to the disciples. He said to them, “Are you still sleeping and resting? Look! The hour has come. The Son of Man is about to be handed over to sinners. "},{"num":46,"verse":"Get up! Let us go! Here comes the one who is handing me over to them!”"},{"header":"Jesus Is Arrested"},{"num":47,"verse":"While Jesus was still speaking, Judas arrived. He was one of the 12 disciples. A large crowd was with him. They were carrying swords and clubs. The chief priests and the elders of the people had sent them. "},{"num":48,"verse":"Judas, who was going to hand Jesus over, had arranged a signal with them. “The one I kiss is the man,” he said. “Arrest him.” "},{"num":49,"verse":"So Judas went to Jesus at once. He said, “Greetings, Rabbi!” And he kissed him."},{"num":50,"verse":"Jesus replied, “Friend, do what you came to do.”"},{"num":51,"verse":"At that moment, one of Jesus’ companions reached for his sword. He pulled it out and struck the slave of the high priest with it. He cut off the slave’s ear."},{"num":52,"verse":"“Put your sword back in its place,” Jesus said to him. “All who use the sword will die by the sword. "},{"num":53,"verse":"Do you think I can’t ask my Father for help? He would send an army of more than 70,000 angels right away. "},{"num":54,"verse":"But then how would the Scriptures come true? They say it must happen in this way.”"},{"num":55,"verse":"At that time Jesus spoke to the crowd. “Am I leading a band of armed men against you?” he asked. “Do you have to come out with swords and clubs to capture me? Every day I sat in the temple courtyard teaching. And you didn’t arrest me. "},{"num":56,"verse":"But all this has happened so that the words of the prophets would come true.” Then all the disciples left him and ran away."},{"header":"Jesus Is Taken to the Sanhedrin"},{"num":57,"verse":"Those who had arrested Jesus took him to Caiaphas, the high priest. The teachers of the law and the elders had come together there. "},{"num":58,"verse":"Not too far away, Peter followed Jesus. He went right up to the courtyard of the high priest. He entered and sat down with the guards to see what would happen."},{"num":59,"verse":"The chief priests and the whole Sanhedrin were looking for something to use against Jesus. They wanted to put him to death. "},{"num":60,"verse":"But they did not find any proof, even though many false witnesses came forward."},{"num":61,"verse":"They said, “This fellow claimed, ‘I am able to destroy the temple of God. I can build it again in three days.’ ”"},{"num":62,"verse":"Then the high priest stood up. He asked Jesus, “Aren’t you going to answer? What are these charges that these men are bringing against you?” "},{"num":63,"verse":"But Jesus remained silent."},{"num":64,"verse":"“You have said so,” Jesus replied. “But here is what I say to all of you. From now on, you will see the Son of Man sitting at the right hand of the Mighty One. You will see the Son of Man coming on the clouds of heaven.”"},{"num":65,"verse":"Then the high priest tore his clothes. He said, “He has spoken a very evil thing against God! Why do we need any more witnesses? You have heard him say this evil thing. "},{"num":66,"verse":"What do you think?”"},{"num":67,"verse":"Then they spit in his face. They hit him with their fists. Others slapped him. "},{"num":68,"verse":"They said, “Prophesy to us, Messiah! Who hit you?”"},{"header":"Peter Says He Does Not Know Jesus"},{"num":69,"verse":"Peter was sitting out in the courtyard. A female servant came to him. “You also were with Jesus of Galilee,” she said."},{"num":70,"verse":"But in front of all of them, Peter said he was not. “I don’t know what you’re talking about,” he said."},{"num":71,"verse":"Then he went out to the gate leading into the courtyard. There another servant saw him. She said to the people, “This fellow was with Jesus of Nazareth.”"},{"num":72,"verse":"Again he said he was not. With a curse he said, “I don’t know the man!”"},{"num":73,"verse":"After a little while, those standing there went up to Peter. “You must be one of them,” they said. “The way you talk gives you away.”"},{"num":74,"verse":"Then Peter began to curse and said to them, “I don’t know the man!”"},{"num":75,"verse":"Then Peter remembered what Jesus had said. “The rooster will crow,” Jesus had told him. “Before it does, you will say three times that you don’t know me.” Peter went outside. He broke down and cried."}]