[[],[{"type":"header","content":"The Plot to Kill Jesus(A)"},{"type":"prose","content":"Now it came to pass, when Jesus had finished all these sayings,  He said to His disciples, "}],[],[{"type":"prose","content":"Then the chief priests, the scribes, and the elders of the people assembled at the palace of the high priest, who was called Caiaphas, "}],[{"type":"prose","content":"and plotted to take Jesus by trickery and kill  "}],[{"type":"prose","content":"But they said, “Not during the feast, lest there be an uproar among the people.”"},{"type":"header","content":"The Anointing at Bethany(F)"}],[{"type":"prose","content":"And when Jesus was in Bethany at the house of Simon the leper, "}],[{"type":"prose","content":"a woman came to Him having an alabaster flask of very costly fragrant oil, and she poured  on His head as He sat  "}],[{"type":"prose","content":"But when His disciples saw  they were indignant, saying, “Why this waste? "}],[{"type":"prose","content":"For this fragrant oil might have been sold for much and given to  poor.”"}],[{"type":"prose","content":"But when Jesus was aware of  He said to them,  "}],[{"type":"prose","content":"  "}],[{"type":"prose","content":"  "}],[{"type":"header","content":"Judas Agrees to Betray Jesus(L)"}],[{"type":"prose","content":"Then one of the twelve, called Judas Iscariot, went to the chief priests "}],[{"type":"prose","content":"and said, “What are you willing to give me if I deliver Him to you?” And they counted out to him thirty pieces of silver. "}],[{"type":"prose","content":"So from that time he sought opportunity to betray Him."},{"type":"header","content":"Jesus Celebrates Passover with His Disciples(P)"}],[{"type":"prose","content":"Now on the first  of the Unleavened Bread the disciples came to Jesus, saying to Him, “Where do You want us to prepare for You to eat the Passover?”"}],[{"type":"prose","content":"And He said,  "}],[{"type":"prose","content":"So the disciples did as Jesus had directed them; and they prepared the Passover."}],[{"type":"prose","content":"When evening had come, He sat down with the twelve. "}],[{"type":"prose","content":"Now as they were eating, He said,  "}],[{"type":"prose","content":"And they were exceedingly sorrowful, and each of them began to say to Him, “Lord, is it I?”"}],[{"type":"prose","content":"He answered and said,  "}],[{"type":"prose","content":"   "}],[{"type":"prose","content":"Then Judas, who was betraying Him, answered and said, “Rabbi, is it I?”He said to him, "},{"type":"header","content":"Jesus Institutes the Lord’s Supper(Y)"}],[{"type":"prose","content":"And as they were eating, Jesus took bread, blessed and broke  and gave  to the disciples and said,  "}],[{"type":"prose","content":"Then He took the cup, and gave thanks, and gave  to them, saying,  "}],[{"type":"prose","content":"      "}],[{"type":"prose","content":"  "}],[{"type":"prose","content":"And when they had sung a hymn, they went out to the Mount of Olives."},{"type":"header","content":"Jesus Predicts Peter’s Denial(AJ)"}],[{"type":"prose","content":"Then Jesus said to them,   "}],[{"type":"prose","content":" "}],[{"type":"prose","content":"Peter answered and said to Him, “Even if all are made to stumble because of You, I will never be made to stumble.”"}],[{"type":"prose","content":"Jesus said to him, "}],[{"type":"prose","content":"Peter said to Him, “Even if I have to die with You, I will not deny You!”And so said all the disciples."},{"type":"header","content":"The Prayer in the Garden(AP)"}],[{"type":"prose","content":"Then Jesus came with them to a place called Gethsemane, and said to the disciples,  "}],[{"type":"prose","content":"And He took with Him Peter and the two sons of Zebedee, and He began to be sorrowful and deeply distressed. "}],[{"type":"prose","content":"Then He said to them, "}],[{"type":"prose","content":"He went a little farther and fell on His face, and prayed, saying,   "}],[{"type":"prose","content":"Then He came to the disciples and found them sleeping, and said to Peter,  "}],[{"type":"prose","content":" "}],[{"type":"prose","content":"Again, a second time, He went away and prayed, saying,   "}],[{"type":"prose","content":"And He came and found them asleep again, for their eyes were heavy."}],[{"type":"prose","content":"So He left them, went away again, and prayed the third time, saying the same words. "}],[{"type":"prose","content":"Then He came to His disciples and said to them,    "}],[{"type":"header","content":"Betrayal and Arrest in Gethsemane(BA)"}],[{"type":"prose","content":"And while He was still speaking, behold, Judas, one of the twelve, with a great multitude with swords and clubs, came from the chief priests and elders of the people."}],[{"type":"prose","content":"Now His betrayer had given them a sign, saying, “Whomever I kiss, He is the One; seize Him.” "}],[{"type":"prose","content":"Immediately he went up to Jesus and said, “Greetings, Rabbi!” and kissed Him."}],[{"type":"prose","content":"But Jesus said to him, Then they came and laid hands on Jesus and took Him. "}],[{"type":"prose","content":"And suddenly, one of those  with Jesus stretched out  hand and drew his sword, struck the servant of the high priest, and cut off his ear."}],[{"type":"prose","content":"But Jesus said to him,    "}],[{"type":"prose","content":"  "}],[{"type":"prose","content":" "}],[{"type":"prose","content":"In that hour Jesus said to the multitudes,  "}],[{"type":"prose","content":" Then all the disciples forsook Him and fled."},{"type":"header","content":"Jesus Faces the Sanhedrin(BK)"}],[{"type":"prose","content":"And those who had laid hold of Jesus led  away to Caiaphas the high priest, where the scribes and the elders were assembled. "}],[{"type":"prose","content":"But Peter followed Him at a distance to the high priest’s courtyard. And he went in and sat with the servants to see the end."}],[{"type":"prose","content":"Now the chief priests, the elders, and all the council sought false testimony against Jesus to put Him to death, "}],[{"type":"prose","content":"but found none. Even though many false witnesses came forward, they found none. But at last two false witnesses came forward "}],[{"type":"prose","content":"and said, “This  said, ‘I am able to destroy the temple of God and to build it in three days.’ ”"}],[{"type":"prose","content":"And the high priest arose and said to Him, “Do You answer nothing? What  these men testify against You?” "}],[{"type":"prose","content":"But Jesus kept silent. And the high priest answered and said to Him, “I put You under oath by the living God: Tell us if You are the Christ, the Son of God!”"}],[{"type":"prose","content":"Jesus said to him,   "}],[{"type":"prose","content":"Then the high priest tore his clothes, saying, “He has spoken blasphemy! What further need do we have of witnesses? Look, now you have heard His blasphemy! "}],[{"type":"prose","content":"What do you think?”They answered and said, “He is deserving of death.”"}],[{"type":"prose","content":"Then they spat in His face and beat Him; and others struck  with the palms of their hands, "}],[{"type":"prose","content":"saying, “Prophesy to us, Christ! Who is the one who struck You?”"},{"type":"header","content":"Peter Denies Jesus, and Weeps Bitterly(CC)"}],[{"type":"prose","content":"Now Peter sat outside in the courtyard. And a servant girl came to him, saying, “You also were with Jesus of Galilee.”"}],[{"type":"prose","content":"But he denied it before  all, saying, “I do not know what you are saying.”"}],[{"type":"prose","content":"And when he had gone out to the gateway, another  saw him and said to those  there, “This  also was with Jesus of Nazareth.”"}],[{"type":"prose","content":"But again he denied with an oath, “I do not know the Man!”"}],[{"type":"prose","content":"And a little later those who stood by came up and said to Peter, “Surely you also are  of them, for your speech betrays you.”"}],[{"type":"prose","content":"Then he began to curse and swear,  “I do not know the Man!”Immediately a rooster crowed. "}],[{"type":"prose","content":"And Peter remembered the word of Jesus who had said to him,  So he went out and wept bitterly."}]]