[{"header":"Daniel Obeys God"},{"num":1,"verse":"In the third year that Jehoiakim was king of Judah, King Nebuchadnezzar of Babylon came against Jerusalem. His army was all around the city. "},{"num":2,"verse":"The Lord let him take King Jehoiakim of Judah, with some of the objects of the house of God. He brought them to the house of his god in the land of Shinar, and put the objects into the store-room of his god. "},{"num":3,"verse":"Then the king told Ashpenaz, his head ruler, to bring in some of the sons of Israel, both those of the king’s family and of the important leaders. "},{"num":4,"verse":"They were to be young men, perfect in body, good-looking, with wisdom, understanding, much learning, and able to serve in the king’s house. The king told Ashpenaz to teach them the writings and language of the Babylonians. "},{"num":5,"verse":"And the king gave them a share of his best food and wine every day. They were to be taught for three years, and after that they were to serve the king. "},{"num":6,"verse":"Among these were Daniel, Hananiah, Mishael, and Azariah from the sons of Judah. "},{"num":7,"verse":"The king’s head ruler gave them new names. To Daniel he gave the name Belteshazzar. To Hananiah he gave the name Shadrach. To Mishael he gave the name Meshach. And to Azariah he gave the name Abed-nego."},{"num":8,"verse":"But Daniel made up his mind that he would not make himself unclean with the king’s best food and wine. So he asked the head ruler to allow him not to make himself unclean. "},{"num":9,"verse":"Now God gave Daniel favor and pity in the eyes of the head ruler. "},{"num":10,"verse":"The head ruler said to him, “I am afraid of my lord the king, who has said you were to have so much and he would see that you were not looking as good as the other young men who are as old as you. The king would cut off my head because of you.” "},{"num":11,"verse":"Then Daniel said to the man whom the head ruler had chosen to watch over Daniel, Hananiah, Mishael, and Azariah, "},{"num":12,"verse":"“Test your servants for ten days. Give us only vegetables to eat and water to drink. "},{"num":13,"verse":"Then compare how we look with the young men who are eating the king’s best food. And do with us what you think is best by what you see.”"},{"num":14,"verse":"So he listened to them, and tested them for ten days. "},{"num":15,"verse":"At the end of ten days they looked even better. They were fatter than all the young men who had been eating the king’s best food. "},{"num":16,"verse":"So the man who watched over them took away the best food and the wine they were to drink, and kept giving them vegetables."},{"num":17,"verse":"God gave these four young men much learning and understanding in all kinds of writings and wisdom. Daniel even had understanding in all kinds of special dreams. "},{"num":18,"verse":"At the end of the time set by the king to bring them in, the head ruler brought them to Nebuchadnezzar. "},{"num":19,"verse":"The king talked with them, and found no one like Daniel, Hananiah, Mishael, and Azariah. So they became the king’s own helpers. "},{"num":20,"verse":"Every time the king asked them questions that needed wise and understanding answers, he found that they knew ten times more than all the wonder-workers under his rule who used their secret ways. "},{"num":21,"verse":"And Daniel was there until the first year of King Cyrus."}]