[{"header":"Don't Make Rash Promises"},{"num":5,"verse":"Be careful about going to the Temple. It is better to go there to learn than to offer sacrifices like foolish people who don't know right from wrong. "},{"num":2,"verse":"Think before you speak, and don't make any rash promises to God. He is in heaven and you are on earth, so don't say any more than you have to. "},{"num":3,"verse":"The more you worry, the more likely you are to have bad dreams, and the more you talk, the more likely you are to say something foolish. "},{"num":4,"verse":"So when you make a promise to God, keep it as quickly as possible. He has no use for a fool. Do what you promise to do. "},{"num":5,"verse":"Better not to promise at all than to make a promise and not keep it. "},{"num":6,"verse":"Don't let your own words lead you into sin, so that you have to tell God's priest that you didn't mean it. Why make God angry with you? Why let him destroy what you have worked for? "},{"num":7,"verse":"No matter how much you dream, how much useless work you do, or how much you talk, you must still stand in awe of God."},{"header":"Life Is Useless"},{"num":8,"verse":"Don't be surprised when you see that the government oppresses the poor and denies them justice and their rights. Every official is protected by someone higher, and both are protected by still higher officials."},{"num":9,"verse":"Even a king depends on the harvest."},{"num":10,"verse":"If you love money, you will never be satisfied; if you long to be rich, you will never get all you want. It is useless. "},{"num":11,"verse":"The richer you are, the more mouths you have to feed. All you gain is the knowledge that you are rich. "},{"num":12,"verse":"Workers may or may not have enough to eat, but at least they can get a good night's sleep. The rich, however, have so much that they stay awake worrying."},{"num":13,"verse":"Here is a terrible thing that I have seen in this world: people save up their money for a time when they may need it, "},{"num":14,"verse":"and then lose it all in some bad deal and end up with nothing left to pass on to their children. "},{"num":15,"verse":"We leave this world just as we entered it—with nothing. In spite of all our work there is nothing we can take with us. "},{"num":16,"verse":"It isn't right! We go just as we came. We labor, trying to catch the wind, and what do we get? "},{"num":17,"verse":"We get to live our lives in darkness and grief, worried, angry, and sick."},{"num":18,"verse":"Here is what I have found out: the best thing we can do is eat and drink and enjoy what we have worked for during the short life that God has given us; this is our fate. "},{"num":19,"verse":"If God gives us wealth and property and lets us enjoy them, we should be grateful and enjoy what we have worked for. It is a gift from God. "},{"num":20,"verse":"Since God has allowed us to be happy, we will not worry too much about how short life is."}]