[{"header":"Don’t Daydream or Speak Carelessly When You Worship"},{"num":5,"verse":"Watch your step when you go to the house of God. It is better to go there and listen than to bring the sacrifices fools bring. Fools are unaware that they are doing ⌞something⌟ evil."},{"num":2,"verse":"Don’t be in a hurry to talk. Don’t be eager to speak in the presence of God. Since God is in heaven and you are on earth, limit the number of your words."},{"num":3,"verse":"Daydreaming comes when there are too many worries."},{"num":4,"verse":"When you make a promise to God, don’t be slow to keep it because God doesn’t like fools. Keep your promise. "},{"num":5,"verse":"It is better not to make a promise than to make one and not keep it. "},{"num":6,"verse":"Don’t let your mouth talk you into committing a sin. Don’t say in the presence of a ⌞temple⌟ messenger, “My promise was a mistake!” Why should God become angry at your excuse and destroy what you’ve accomplished?"},{"num":7,"verse":"In spite of many daydreams, pointless actions, and empty words, you should still fear God."},{"header":"Corrupt Officials Have Corrupt Officials over Them"},{"num":8,"verse":"Don’t be surprised if you see poor people being oppressed, denied justice, or denied their rights in any district. One authority is watching over another, and they both have authorities watching over them. "},{"num":9,"verse":"Yet, a king is an advantage for a country with cultivated fields."},{"header":"The Value of Money"},{"num":10,"verse":"Whoever loves money will never be satisfied with money. Whoever loves wealth will never be satisfied with more income. Even this is pointless. "},{"num":11,"verse":"As the number of goods increase, so do the number of people who consume them. What do owners gain ⌞from all their goods⌟ except ⌞the opportunity⌟ to look at them?"},{"num":12,"verse":"The sleep of working people is sweet, whether they eat a little or a lot. But the full stomachs that rich people have will not allow them to sleep."},{"header":"Economic Ruin"},{"num":13,"verse":"There is a painful tragedy that I have seen under the sun: Riches lead to the downfall of those who hoard them. "},{"num":14,"verse":"These hoarded riches were then lost in bad business deals. The owners had children, but now they have nothing to give them. "},{"num":15,"verse":"They came from their mother’s womb naked. They will leave as naked as they came. They won’t even be able to take a handful of their earnings with them from all their hard work."},{"num":16,"verse":"This also is a painful tragedy: They leave exactly as they came. What advantage do they gain from working so hard for the wind? "},{"num":17,"verse":"They spend their entire lives in darkness, in constant frustration, sickness, and resentment."},{"header":"Conclusion: God Alone Gives Contentment"},{"num":18,"verse":"At last I have seen what is good and beautiful: It is to eat and drink and to enjoy the good in all our hard work under the sun during the brief lives God gives us. That is our lot ⌞in life⌟. "},{"num":19,"verse":"It is a gift from God when God gives some people wealth and possessions, the power to enjoy them, ⌞the ability⌟ to accept their lot in life, and ⌞the ability⌟ to rejoice in their own hard work. "},{"num":20,"verse":"These people won’t give much thought to their brief lives because God keeps them occupied with the joy in their hearts."}]