[{"num":4,"verse":"Keep thy footing when thou goest to the Bais HaElohim, and be more ready to listen than to give the zevach of kesilim, for they have no da’as that they do rah."},{"num":5,"verse":"Be not rash with thy mouth, and let not thine lev be hasty to utter any thing before HaElohim; for HaElohim is in Shomayim, and thou upon ha’aretz; therefore let thy dvarim be few."},{"num":5,"verse":"As by a multitude of cares cometh a chalom, so by a multitude of dvarim cometh the kol kesil (the voice of the fool)."},{"num":5,"verse":"When thou vowest a neder unto Elohim, defer not to pay it; for Hashem hath no pleasure in kesilim; pay that which thou hast vowed."},{"num":5,"verse":"Better it is that thou shouldest not make a neder, than that thou shouldest vow and not fulfill the neder."},{"num":5,"verse":"Suffer not thy mouth to lead thy basar into chet (sin); neither say thou before the Malach [of G-d], that it was a mistake. Wherefore should HaElohim be angry at thy voice, and destroy the work of thine hands?"},{"num":5,"verse":"For in the multitude of chalomot and many dvarim there are also divers havalim [see 1:2]; but fear thou HaElohim."},{"num":5,"verse":"If thou seest the oppression of the poor, and violent perverting of mishpat and tzedek in a province, marvel not at the matter; for he that is higher watches over him that is high; and there be higher than they."},{"num":5,"verse":"Moreover the profit of eretz is for all; Melech himself is served by the sadeh."},{"num":5,"verse":"He that loveth kesef shall never have enough kesef; nor shall he that loveth abundance have enough increase; this also is hevel."},{"num":5,"verse":"When hatovah (good things) increase, they are increased that consume them; and what kishron (useful result) is there to the ba’al (owner) thereof, except as an onlooker?"},{"num":5,"verse":"The sleep of the oved (working man) is sweet, whether he eat little or much; but the abundance of the oisher (rich man) will not permit him to sleep."},{"num":5,"verse":"There is a grievous ra’ah which I have seen under the shemesh; osher (riches) hoarded by the ba’al thereof to his hurt;"},{"num":5,"verse":"The same osher (riches) perish by an evil event and he begetteth a ben; thus this one hath nothing in his hand."},{"num":5,"verse":"As he came forth of the womb of his Em (mother), arom (naked) shall he return to go as he came, and shall take nothing of his amal (labor), which he may carry away in his hand."},{"num":5,"verse":"And this also is a grievous evil, that in every respect as he came, just so shall he go; and what profit hath he that hath toiled for the ruach (wind)?"},{"num":5,"verse":"All his yamim also he eateth in choshech, and he hath much ka’as (grief, vexation) and sickness and anger."},{"num":5,"verse":"Hinei I have seen it is tov and yafeh for one to eat and to drink, and to find tovah in all his amal (labor) that he toils under the shemesh all the few days of his life, which HaElohim giveth him; for it is his chelek."},{"num":5,"verse":"Also kol ha’adam to whom HaElohim hath given osher and possessions, and hath given him power to eat thereof, and to take his chelek, and to rejoice in his amal; this is the gift of Elohim."},{"num":5,"verse":"For he shall not much remember the days of his life; because HaElohim keeps him occupied with simchat libbo (gladness of his heart)."}]