[{"num":23,"verse":"“Don’t tell lies against other people. If you are a witness in court, don’t agree to help a bad person tell lies."},{"num":2,"verse":"“Don’t do something just because everyone else is doing it. If you see a group of people doing wrong, don’t join them. You must not let them persuade you to do wrong things—you must do what is right and fair."},{"num":3,"verse":"“In court, don’t treat a person in a special way simply because that person is poor."},{"num":4,"verse":"“If you see a lost bull or donkey, then you must return it to its owner—even if the owner is your enemy."},{"num":5,"verse":"“If you see an animal that cannot walk because it has too much to carry, you must stop and help that animal. You must help that animal even if it belongs to one of your enemies."},{"num":6,"verse":"“In court, don’t let anyone take advantage of a person simply because that person is poor."},{"num":7,"verse":"“Be very careful if you say that someone is guilty of something. Don’t make false charges against a person. Never allow innocent people to be killed as punishment for something they did not do. Whoever kills an innocent person is evil, and I will not treat a guilty person as innocent."},{"num":8,"verse":"“If someone tries to pay you to agree with them when they are wrong, don’t accept that payment. A payment like that can blind judges so that they cannot see the truth. It can make good people tell lies."},{"num":9,"verse":"“You must never do wrong things to a foreigner. Remember, you know what it is like to be a foreigner because at one time you were foreigners in the land of Egypt."},{"header":"The Special Festivals"},{"num":10,"verse":"“Plant seeds, harvest your crops, and work the ground for six years."},{"num":11,"verse":"But the seventh year must be a special time of rest for the land. Don’t plant anything in your fields. If any crops grow there, allow the poor to have it. And allow the wild animals to eat the food that is left. You should do the same with your vineyards and with your fields of olive trees."},{"num":12,"verse":"“Work for six days, but on the seventh day, rest! This will allow your slaves and other workers a time to rest and relax. And your bulls and donkeys will also have a time of rest."},{"num":13,"verse":"“Be sure that you obey all these laws. Don’t worship false gods. You should not even speak their names!"},{"num":14,"verse":"“You will have three special festivals each year. You must come to my special place to worship me during these festivals."},{"num":15,"verse":"The first festival is the Festival of Unleavened Bread. This is as I commanded you. During this time you will eat bread that is made without yeast. This will continue for seven days. You will do this during the month of Abib, because this is the time when you came out of Egypt. Everyone must bring a sacrifice to me at that time."},{"num":16,"verse":"“The second festival will be the Festival of Harvest. This festival will be during the early summer when you begin harvesting the first crops that you planted in your fields."},{"num":17,"verse":"“So three times each year all the men will come to the special place to be with the Lord God."},{"num":18,"verse":"“When you kill an animal and offer its blood as a sacrifice, you must not include anything that has yeast in it. And when you burn the fat from my sacrifice, don’t let any of it remain until morning."},{"num":19,"verse":"“When you gather your crops at harvest time, you should bring the first of everything you harvest to the house of the Lord your God."},{"header":"God Will Help Israel Take Their Land"},{"num":20,"verse":"“I am sending an angel before you to protect you along the way and to lead you to the place that I have prepared for you."},{"num":21,"verse":"Obey the angel and follow him. Be careful in his presence, and don’t rebel against him. The angel will not forgive the wrong things you do to him. He has my power in him."},{"num":22,"verse":"If you listen to what he says and do everything I tell you, then I will be an enemy to all of your enemies. I will be against everyone who is against you."},{"num":23,"verse":"“My angel will lead you through the land. He will lead you against many different people—the Amorites, Hittites, Perizzites, Canaanites, Hivites, and Jebusites. But I will defeat all of them."},{"num":24,"verse":"“Don’t worship their gods. Don’t ever bow down to those gods. You must never live the way those people live. You must destroy their idols. And you must break the stones that help them remember their gods."},{"num":25,"verse":"You must serve the Lord your God. If you do this, I will bless you with plenty of bread and water. I will take away all sickness from you."},{"num":26,"verse":"Your women will all be able to have babies. None of their babies will die at birth. And I will allow you to live long lives."},{"num":27,"verse":"“When you fight against your enemies, I will send my great power before you. I will help you defeat all your enemies. The people who are against you will become confused in battle and run away."},{"num":28,"verse":"I will send the hornet in front of you. He will force your enemies to leave. The Hivites, Canaanites, and Hittites will leave your country."},{"num":29,"verse":"But I will not force all of them out of your land quickly. I will not do this in only one year. The land will be empty if I force the people out too fast. Then all the wild animals would increase and control the land. And they would be much trouble for you."},{"num":30,"verse":"So I will force them out of your land very slowly. I will do this as you grow and eventually take the land to be your own."},{"num":31,"verse":"“I will give you all the land from the Red Sea to the Mediterranean Sea, and from the desert of Sinai to the Euphrates River. I will let you defeat the people living there and force them all to leave."},{"num":32,"verse":"“You must not make any agreements with any of those people or their gods."},{"num":33,"verse":"Don’t let them stay in your country. If you let them stay, they will be like a trap to you—they will cause you to sin against me. And you will begin worshiping their gods.”"}]