[{"header":"Justice and Fairness"},{"num":23,"verse":"“Do not spread false rumors, and do not help a guilty person by giving false testimony. "},{"num":2,"verse":"Do not follow the majority when they do wrong or when they give testimony that perverts justice. "},{"num":3,"verse":"Do not show partiality to a poor person at his trial."},{"num":4,"verse":"“If you happen to see your enemy's cow or donkey running loose, take it back to him. "},{"num":5,"verse":"If his donkey has fallen under its load, help him get the donkey to its feet again; don't just walk off."},{"num":6,"verse":"“Do not deny justice to a poor person when he appears in court. "},{"num":7,"verse":"Do not make false accusations, and do not put an innocent person to death, for I will condemn anyone who does such an evil thing. "},{"num":8,"verse":"Do not accept a bribe, for a bribe makes people blind to what is right and ruins the cause of those who are innocent."},{"num":9,"verse":"“Do not mistreat a foreigner; you know how it feels to be a foreigner, because you were foreigners in Egypt."},{"header":"The Seventh Year and the Seventh Day"},{"num":10,"verse":"“For six years plant your land and gather in what it produces. "},{"num":11,"verse":"But in the seventh year let it rest, and do not harvest anything that grows on it. The poor may eat what grows there, and the wild animals can have what is left. Do the same with your vineyards and your olive trees."},{"num":12,"verse":"“Work six days a week, but do no work on the seventh day, so that your slaves and the foreigners who work for you and even your animals can rest."},{"num":13,"verse":"“Listen to everything that I, the Lord, have said to you. Do not pray to other gods; do not even mention their names."},{"header":"The Three Great Festivals(H)"},{"num":14,"verse":"“Celebrate three festivals a year to honor me. "},{"num":15,"verse":"In the month of Abib, the month in which you left Egypt, celebrate the Festival of Unleavened Bread in the way that I commanded you. Do not eat any bread made with yeast during the seven days of this festival. Never come to worship me without bringing an offering."},{"num":16,"verse":"“Celebrate the Harvest Festival when you begin to harvest your crops."},{"num":17,"verse":"Every year at these three festivals all your men must come to worship me, the Lord your God."},{"num":18,"verse":"“Do not offer bread made with yeast when you sacrifice an animal to me. The fat of animals sacrificed to me during these festivals is not to be left until the following morning."},{"num":19,"verse":"“Each year bring to the house of the Lord your God the first grain that you harvest."},{"header":"Promises and Instructions"},{"num":20,"verse":"“I will send an angel ahead of you to protect you as you travel and to bring you to the place which I have prepared. "},{"num":21,"verse":"Pay attention to him and obey him. Do not rebel against him, for I have sent him, and he will not pardon such rebellion. "},{"num":22,"verse":"But if you obey him and do everything I command, I will fight against all your enemies. "},{"num":23,"verse":"My angel will go ahead of you and take you into the land of the Amorites, the Hittites, the Perizzites, the Canaanites, the Hivites, and the Jebusites, and I will destroy them. "},{"num":24,"verse":"Do not bow down to their gods or worship them, and do not adopt their religious practices. Destroy their gods and break down their sacred stone pillars. "},{"num":25,"verse":"If you worship me, the Lord your God, I will bless you with food and water and take away all your sicknesses. "},{"num":26,"verse":"In your land no woman will have a miscarriage or be without children. I will give you long lives."},{"num":27,"verse":"“I will make the people who oppose you afraid of me; I will bring confusion among the people against whom you fight, and I will make all your enemies turn and run from you. "},{"num":28,"verse":"I will throw your enemies into panic; I will drive out the Hivites, the Canaanites, and the Hittites as you advance. "},{"num":29,"verse":"I will not drive them out within a year's time; if I did, the land would become deserted, and the wild animals would be too many for you. "},{"num":30,"verse":"Instead, I will drive them out little by little, until there are enough of you to take possession of the land. "},{"num":31,"verse":"I will make the borders of your land extend from the Gulf of Aqaba to the Mediterranean Sea and from the desert to the Euphrates River. I will give you power over the inhabitants of the land, and you will drive them out as you advance. "},{"num":32,"verse":"Do not make any agreement with them or with their gods. "},{"num":33,"verse":"Do not let those people live in your country; if you do, they will make you sin against me. If you worship their gods, it will be a fatal trap for you.”"}]