[[],[{"type":"header","content":"Various Laws"},{"type":"prose","content":"“You shall not give a false report; do not join your hand with a wicked person to be a malicious witness."}],[{"type":"prose","content":"You shall not follow the crowd in doing evil, nor shall you testify in a dispute so as to join together with a crowd in order to pervert ;"}],[{"type":"prose","content":"nor shall you show favor to a poor person in his dispute."}],[{"type":"prose","content":"“If you encounter your enemy’s ox or his donkey wandering away, you must return it to him."}],[{"type":"prose","content":"If you see the donkey of one who hates you lying  under its load, you shall not leave it  for its owner; you must arrange  with him."}],[{"type":"prose","content":"“You shall not pervert the justice  to your needy  in his dispute."}],[{"type":"prose","content":"Keep far from a false charge, and do not kill the innocent or the righteous, for I will not acquit the guilty."}],[{"type":"prose","content":"“You shall not take a bribe, for a bribe blinds the clear-sighted and subverts the cause of the just."}],[{"type":"prose","content":"“You shall not oppress a stranger, since you yourselves know the feelings of a stranger, for you  were strangers in the land of Egypt."},{"type":"header","content":"The Sabbath and the Land"}],[{"type":"prose","content":"“Now you shall sow your land for six years and gather in its yield,"}],[{"type":"prose","content":"but  the seventh year you shall let it rest and lie uncultivated, so that the needy of your people may eat; and whatever they leave the animal of the field may eat. You are to do the same with your vineyard  your olive grove."}],[{"type":"prose","content":"“For six days you are to do your work, but on the seventh day you shall cease  so that your ox and your donkey may rest, and the son of your female slave, as well as the stranger  refresh themselves."}],[{"type":"prose","content":"Now concerning everything which I have said to you, be careful; and do not mention the name of other gods, nor let  be heard from your mouth."},{"type":"header","content":"Three National Feasts"}],[{"type":"prose","content":"“Three times a year you shall celebrate a feast to Me."}],[{"type":"prose","content":"You shall keep the Feast of Unleavened Bread; for seven days you are to eat unleavened bread, as I commanded you, at the appointed time in the month of Abib, for in that month you came out of Egypt. And no one is to appear before Me empty-handed."}],[{"type":"prose","content":"Also  the Feast of the Harvest  the first fruits of your labors  what you sow in the field; also the Feast of the Ingathering at the end of the year when you gather in  your labors from the field."}],[{"type":"prose","content":"Three times a year all your males shall appear before the Lord ."}],[{"type":"prose","content":"“You shall not offer the blood of My sacrifice with leavened bread; nor is the fat of My feast to remain overnight until morning."}],[{"type":"prose","content":"“You shall bring the choice first fruits of your soil into the house of the  your God.“You are not to boil a young goat in the milk of its mother."},{"type":"header","content":"Conquest of the Land"}],[{"type":"prose","content":"“Behold, I am going to send an angel before you to guard you along the way and to bring you into the place which I have prepared."}],[{"type":"prose","content":"Be attentive to him and obey his voice; do not be rebellious toward him, for he will not pardon your rebellion, since My name is in him."}],[{"type":"prose","content":"But if you truly obey his voice and do all that I say, then I will be an enemy to your enemies and an adversary to your adversaries."}],[{"type":"prose","content":"For My angel will go before you and bring you into  the Amorites, the Hittites, the Perizzites, the Canaanites, the Hivites, and the Jebusites; and I will completely destroy them."}],[{"type":"prose","content":"You shall not worship their gods, nor serve them, nor do according to their deeds; but you shall utterly overthrow them and break their memorial stones in pieces."}],[{"type":"prose","content":"And you shall serve the  your God, and He will bless your bread and your water; and I will remove sickness from your midst."}],[{"type":"prose","content":"There will be no one miscarrying or unable to have children in your land; I will fulfill the number of your days."}],[{"type":"prose","content":"I will send My terror ahead of you, and throw into confusion all the people among whom you come, and I will make all your enemies turn  backs to you."}],[{"type":"prose","content":"And I will send hornets ahead of you so that they will drive out the Hivites, the Canaanites, and the Hittites from you."}],[{"type":"prose","content":"I will not drive them out from you in a single year, so that the land will not become desolate and the animals of the field become too numerous for you."}],[{"type":"prose","content":"I will drive them out from you little by little, until you become fruitful and take possession of the land."}],[{"type":"prose","content":"I will set your boundary from the Red Sea to the sea of the Philistines, and from the wilderness to the  River; for I will hand over the inhabitants of the land to you, and you will drive them out from you."}],[{"type":"prose","content":"You shall make no covenant with them or with their gods."}],[{"type":"prose","content":"They shall not live in your land, otherwise they will make you sin against Me; for  you serve their gods, it is certain to be a snare to you.”"}]]