[{"num":6,"verse":"Then I saw as the Lamb broke open one of the seven seals, and as if in a voice of thunder I heard one of the four living creatures call out, Come!"},{"num":2,"verse":"And I looked, and saw there a white horse whose rider carried a bow. And a crown was given him, and he rode forth conquering and to conquer."},{"num":3,"verse":"And when He broke the second seal, I heard the second living creature call out, Come!"},{"num":4,"verse":"And another horse came out, flaming red. And its rider was empowered to take the peace from the earth, so that men slaughtered one another; and he was given a huge sword."},{"num":5,"verse":"When He broke open the third seal, I heard the third living creature call out, Come and look! And I saw, and behold, a black horse, and in his hand the rider had a pair of scales (a balance)."},{"num":6,"verse":"And I heard what seemed to be a voice from the midst of the four living creatures, saying, A quart of wheat for a denarius [a whole day’s wages], and three quarts of barley for a denarius; but do not harm the oil and the wine!"},{"num":7,"verse":"When the Lamb broke open the fourth seal, I heard the fourth living creature call out, Come!"},{"num":8,"verse":"So I looked, and behold, an ashy pale horse [black and blue as if made so by bruising], and its rider’s name was Death, and Hades (the realm of the dead) followed him closely. And they were given authority and power over a fourth part of the earth to kill with the sword and with famine and with plague (pestilence, disease) and with wild beasts of the earth."},{"num":9,"verse":"When the Lamb broke open the fifth seal, I saw at the foot of the altar the souls of those whose lives had been sacrificed for [adhering to] the Word of God and for the testimony they had borne."},{"num":10,"verse":"They cried in a loud voice, O [Sovereign] Lord, holy and true, how long now before You will sit in judgment and avenge our blood upon those who dwell on the earth?"},{"num":11,"verse":"Then they were each given a long and flowing and festive white robe and told to rest and wait patiently a little while longer, until the number should be complete of their fellow servants and their brethren who were to be killed as they themselves had been."},{"num":12,"verse":"When He [the Lamb] broke open the sixth seal, I looked, and there was a great earthquake; and the sun grew black as sackcloth of hair, [the full disc of] the moon became like blood."},{"num":13,"verse":"And the stars of the sky dropped to the earth like a fig tree shedding its unripe fruit out of season when shaken by a strong wind."},{"num":14,"verse":"And the sky rolled up like a scroll and vanished, and every mountain and island was dislodged from its place."},{"num":15,"verse":"Then the kings of the earth and their noblemen and their magnates and their military chiefs and the wealthy and the strong and [everyone, whether] slave or free hid themselves in the caves and among the rocks of the mountains,"},{"num":16,"verse":"And they called to the mountains and the rocks, Fall on (before) us and hide us from the face of Him Who sits on the throne and from the deep-seated indignation and wrath of the Lamb."},{"num":17,"verse":"For the great day of His wrath (vengeance, retribution, indignation) has come, and who is able to stand before it?"}]