[{"header":"The Lamb Opens the Scroll"},{"num":6,"verse":"Then I watched as the Lamb opened the first of the seven seals. Then I heard one of the four living beings speak with a voice like thunder. It said, “Come!”"},{"num":2,"verse":"I looked, and there before me was a white horse. The rider on the horse held a bow and was given a crown. He rode out to defeat the enemy and win the victory."},{"num":3,"verse":"The Lamb opened the second seal. Then I heard the second living being say, “Come!”"},{"num":4,"verse":"Then another horse came out, a red one. The rider on the horse was given power to take away peace from the earth so that people would kill each other. He was given a big sword."},{"num":5,"verse":"The Lamb opened the third seal. Then I heard the third living being say, “Come!” I looked, and there before me was a black horse. The rider on the horse held a pair of scales in his hand."},{"num":6,"verse":"Then I heard something that sounded like a voice. The voice came from where the four living beings were. It said, “A quart of wheat or three quarts of barley will cost a full day’s pay. But don’t harm the supply of olive oil and wine!”"},{"num":7,"verse":"The Lamb opened the fourth seal. Then I heard the voice of the fourth living being say, “Come!”"},{"num":8,"verse":"I looked, and there before me was a pale-colored horse. The rider on the horse was death, and Hades was following close behind him. They were given power over a fourth of the earth—power to kill people with the sword, by starving, by disease, and with the wild animals of the earth."},{"num":9,"verse":"The Lamb opened the fifth seal. Then I saw some souls under the altar. They were the souls of those who had been killed because they were faithful to God’s message and to the truth they had received."},{"num":10,"verse":"These souls shouted in a loud voice, “Holy and true Lord, how long until you judge the people of the earth and punish them for killing us?”"},{"num":11,"verse":"Then each one of them was given a white robe. They were told to wait a short time longer. There were still some of their brothers and sisters in the service of Christ who must be killed as they were. These souls were told to wait until all the killing was finished."},{"num":12,"verse":"Then I watched while the Lamb opened the sixth seal. There was a great earthquake, and the sun became as black as sackcloth. The full moon became red like blood."},{"num":13,"verse":"The stars in the sky fell to the earth like a fig tree dropping its figs when the wind blows."},{"num":14,"verse":"The sky was split in the middle and both sides rolled up like a scroll. And every mountain and island was moved from its place."},{"num":15,"verse":"Then all the people—the kings of the world, the rulers, the army commanders, the rich people, the powerful people, every slave, and every free person—hid themselves in caves and behind the rocks on the mountains."},{"num":16,"verse":"They said to the mountains and the rocks, “Fall on us. Hide us from the face of the one who sits on the throne. Hide us from the anger of the Lamb!"},{"num":17,"verse":"The great day for their anger has come. No one can stand against it.”"}]