[{"num":6,"verse":"And I saw when the Lamb opened one of the seals, and I heard one of the four living creatures say, as it were the noise of thunder, Come and see. "},{"num":2,"verse":"And I saw, and behold, there was a white horse, and he that sat on him had a bow, and a crown was given to him, and he went forth conquering, and to overcome."},{"num":3,"verse":"And when he opened the second seal, I heard the second creature say, Come and see. "},{"num":4,"verse":"And there went out another horse that was red. And power was given to him that sat thereon to take peace from the earth, and that people should kill one another. And there was given to him a great sword."},{"num":5,"verse":"And when he opened the third seal, I heard the third creature say, Come and see. And I looked, and lo, a black horse, and he that sat on him had a pair of balances in his hand. "},{"num":6,"verse":"And I heard a voice in the midst of the four creatures say, A measure of wheat for a denarius, and three measures of barley for a denarius; and oil and wine, see you do not harm."},{"num":7,"verse":"And when he opened the fourth seal, I heard the voice of the fourth creature say, Come and see. "},{"num":8,"verse":"And I looked, and behold, a green horse. And the name of him who sat on it was death, and hell followed after him, and power was given to them over the fourth part of the earth, to kill with sword, and with hunger, and with death that comes by the dangerous creatures of the earth."},{"num":9,"verse":"And when he opened the fifth seal, I saw under the altar the souls of those who were killed for the word of God and for the testimony that they had. "},{"num":10,"verse":"And they cried with a loud voice, saying, How long will you wait, O Lord holy and true, to judge, and to avenge our blood on them that dwell on the earth? "},{"num":11,"verse":"And long white garments were given to every one of them. And it was said to them that they should rest for a little season, until the number of their fellows and brethren, and of those who would be killed as they were, was fulfilled."},{"num":12,"verse":"And I looked when he opened the sixth seal, and lo, there was a great earthquake, and the sun was as black as sackcloth made of hair. And the moon became even as blood; "},{"num":13,"verse":"and the stars of heaven fell to the earth, even as a fig tree casts from her her figs when she is shaken by a mighty wind. "},{"num":14,"verse":"And heaven vanished away, like a scroll when it is rolled together. And all mountains and isles were moved out of their places."},{"num":15,"verse":"And the kings of the earth, and the great leaders, and the rich, and the high commanders, and the mighty, and every bondman, and every free man, hid themselves in dens and in the rocks of the hills, "},{"num":16,"verse":"and said to the hills and rocks, Fall on us, and hide us from the presence of him that sits on the seat, and from the wrath of the Lamb! "},{"num":17,"verse":"For the great day of his wrath is come, and who can endure it?"}]