[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(21) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For those priests.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For they indeed have been made priests without an oath.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By him that said unto him.—Better, by (or, through) Him that saith of Him. The last five words of the verse are absent from the best authorities: they were not needed for this part of the argument, and are therefore omitted from the quotation. All that has been said in chap. 6 (Hebrews 6:13-18) on confirmation by oath must be brought in here (see Notes on Hebrews 6:16-17): the words of the Psalm are really words of promise, and the “more abundant encouragement” is given us by means of the oath that shall never be reversed.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "By him that said unto him.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "by",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "through",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": " Him that saith of Him.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The last five words of the verse are absent from the best authorities: they were not needed for this part of the argument, and are therefore omitted from the quotation. All that has been said in chap. 6 (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:13-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") on confirmation by oath must be brought in here (see Notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): the words of the Psalm are really words of promise, and the “more abundant encouragement” is given us by means of the oath that shall never be reversed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:11-25 The priesthood and law by which perfection could not come, are done away; a Priest is risen, and a dispensation now set up, by which true believers may be made perfect. That there is such a change is plain. The law which made the Levitical priesthood, showed that the priests were frail, dying creatures, not able to save their own lives, much less could they save the souls of those who came to them. But the High Priest of our profession holds his office by the power of endless life in himself; not only to keep himself alive, but to give spiritual and eternal life to all who rely upon his sacrifice and intercession. The better covenant, of which Jesus was the Surety, is not here contrasted with the covenant of works, by which every transgressor is shut up under the curse. It is distinguished from the Sinai covenant with Israel, and the legal dispensation under which the church so long remained. The better covenant brought the church and every believer into clearer light, more perfect liberty, and more abundant privileges. In the order of Aaron there was a multitude of priests, of high priests one after another; but in the priesthood of Christ there is only one and the same. This is the believer's safety and happiness, that this everlasting High Priest is able to save to the uttermost, in all times, in all cases. Surely then it becomes us to desire a spirituality and holiness, as much beyond those of the Old Testament believers, as our advantages exceed theirs.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For those priests were made without an oath - The Levitical priests were set apart and consecrated without their office being confirmed to them by an oath on the part of God. They received it by regular descent, and when they arrived at a suitable age they entered on it of course. Jesus received his office by special appointment, and it was secured to him by an oath. The word rendered \"oath\" is in the margin \"swearing of an oath.\" This is the proper meaning of the Greek word, but the sense is not materially varied.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But this with an oath - This priest, the Lord Jesus, became a priest in virtue of an oath.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord sware - see the note at Hebrews 6:13. The reference here is to Psalm 110:4. \"The Lord hath sworn.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord sware - see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The reference here is to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"The Lord hath sworn.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And will not repent - That is, \"will not regret, or will not alter his mind through regret\" - for this is the meaning of the Greek word. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And will not repent - That is, \"will not regret, or will not alter his mind through regret\" - for this is the meaning of the Greek word. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21. Translate in the Greek order, \"For they indeed (the existing legal priests) without the (solemn) promise on oath (so the Greek [Tittmann]) are made priests.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "by him—God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "unto him—the Lord, the Son of God (Ps 110:1).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "not repent—never change His purpose.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "after the order of Melchisedec—omitted in some oldest manuscripts, contained in others.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For those priests were made without an oath; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those priests of Aaron’s order were selected, instituted, consecrated, without any oath mentioned by Moses, who did all exactly as the Lord commanded him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 40:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 40:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". God gave only command for it, and made their priesthood but a temporary and passing honour and office, which he might alter when he would. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But this with an oath by him that said unto him: The Lord sware and will not repent:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but he, or Jesus, was made a Priest after Melchisedec’s order, by an oath of God his Father, speaking to him, as is recorded by David, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 110:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Lord Jehovah the Father, sware unto his Son the Lord Messiah, lifting his hand, and saying: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I live for ever, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 32:40",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 32:40",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", when he ascended and sat down on the right hand of the Majesty in the heavens, solemnly by this oath ratifying and confirming him in this office; and that he would not repent, i.e. change, or alter, or retract what he swore to him, there being no need of any other, he so effectually performing the work of it, that all that God bestows upon his by him, are gifts not to be repented of even eternal life and salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou art a Priest for ever after the order of Melchisedec:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that which the oath ratified was, that Christ should be God’s only and eternal Priest, who was to have no sharer with him in the priesthood, and no end of it; taking away from himself by oath any power to make Christ no priest, or take away his office at will and pleasure, as he did Aaron’s; hereby honouring his Son, and highly gratifying sinners by giving them such a royal High Priest, who should effectually manage all their concernments with him for ever. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For these priests were made without an oath,.... The priests of the tribe of Levi, and of the order of Aaron, were installed into their office, and invested with it, without an oath; no mention is made of any when Aaron and his sons were put into it in Moses's time; nor was any used afterwards, neither by God, nor by the priests, nor by the people; it is true indeed that after the sect of the Sadducees arose, the high priest on the day of atonement, was obliged to take an oath that he would not change any of the customs of the day (t); but then this regarded not his investiture, but the execution of his office; and was an oath of his and not of the Lord's, which is here designed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but this with an oath; that is, Christ was made an high priest with an oath, even with an oath of God; which gives his priesthood the preference to the Levitical priesthood, which was without one: and this oath was made, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "by him that said unto him: the Syriac version reads, \"as he said to him by David\"; that is, in Psalm 110:4. David being the penman of that psalm, in which stand the following words of the Father to Christ: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "by him that said unto him: the Syriac version reads, \"as he said to him by David\"; that is, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". David being the penman of that psalm, in which stand the following words of the Father to Christ: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the Lord sware and will not repent, thou art a priest for ever after the order of Melchisedec; which proves that Jehovah swore that Christ should be a priest, and continue so: swearing, when ascribed to God, is after the manner of men, and is always by himself, and never upon any trivial account; but either to confirm his love to his people, or his covenant with them, or the mission of his Son to be the Redeemer, or, as here, his priestly office: and this oath was made not so much on Christ's account, as on account of the heirs of promise, for their consolation; and shows the dignity, validity, importance, and singularity of Christ's priesthood, as well as the durableness of it; and of this oath God will never repent: repentance cannot properly fall upon God, on any account; for it is contrary to his holiness and righteousness, and to his happiness, to his unchangeableness, omniscience, and omnipotence; it is indeed sometimes ascribed to him improperly, and after the manner of men; and only regards a change of his outward conduct according to his immutable will; and the change that is made is in the creature, and not in God himself: but God will not repent in any sense of the priesthood of Christ, nor of his oath, that it should continue for ever according to the order of Melchizedek; for he was every way qualified for it, and has faithfully performed it, not his investiture, but the execution of his office; and was an oath of his and not of the Lord's, which is here designed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but this with an oath; that is, Christ was made an high priest with an oath, even with an oath of God; which gives his priesthood the preference to the Levitical priesthood, which was without one: and this oath was made, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "by him that said unto him: the Syriac version reads, \"as he said to him by David\"; that is, in Psalm 110:4. David being the penman of that psalm, in which stand the following words of the Father to Christ: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "by him that said unto him: the Syriac version reads, \"as he said to him by David\"; that is, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". David being the penman of that psalm, in which stand the following words of the Father to Christ: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the Lord sware and will not repent, thou art a priest for ever after the order of Melchisedec; which proves that Jehovah swore that Christ should be a priest, and continue so: swearing, when ascribed to God, is after the manner of men, and is always by himself, and never upon any trivial account; but either to confirm his love to his people, or his covenant with them, or the mission of his Son to be the Redeemer, or, as here, his priestly office: and this oath was made not so much on Christ's account, as on account of the heirs of promise, for their consolation; and shows the dignity, validity, importance, and singularity of Christ's priesthood, as well as the durableness of it; and of this oath God will never repent: repentance cannot properly fall upon God, on any account; for it is contrary to his holiness and righteousness, and to his happiness, to his unchangeableness, omniscience, and omnipotence; it is indeed sometimes ascribed to him improperly, and after the manner of men; and only regards a change of his outward conduct according to his immutable will; and the change that is made is in the creature, and not in God himself: but God will not repent in any sense of the priesthood of Christ, nor of his oath, that it should continue for ever according to the order of Melchizedek; for he was every way qualified for it, and has faithfully performed it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Misn. Yoma, c. 1. sect. 5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Misn. Yoma, c. 1. sect. 5. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "(For those priests were made without an oath; but this with an oath by him that said unto him, The Lord sware and will not repent, Thou art a priest for ever after the order of Melchisedec:)",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "those priests were made without an oath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., “these men have been made priests without an oath.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Διὰ τοῦ λέγοντος πρὸς αὐτὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by Him that said to Him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") On other occasions, he who receives the office swears; here, He who conferred the priesthood swore. There is nothing about this oath in Moses, but in the psalm. See how great authority belongs even to the Psalms! ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 7:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὤμοσε Κύριος καὶ οὐ μεταμεληθήσεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord hath sworn and will not repent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") So LXX. It is intimated by the oath itself that the decree is one ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀμεταμέλητον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not to be disannulled by any repentance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrews 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For those priests were made (οἱ μὲν γὰρ - εἰσὶν ἱερεῖς γεγονότες)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rend. for they have been made priests. Lit. are priests, having become such.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Without an oath",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Without the taking of an oath by God. Scripture says nothing of an oath of God when he appointed Aaron and his posterity to the priesthood.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But this with an oath (ὁ δὲ μετὰ ὁρκωμοσίας)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rend. but he with the taking of an oath. The taking of the oath accompanied (μετὰ) the inauguration into the priesthood.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That said (λέγοντος)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Better, saith. Still says, since the promise is realized in Christ's priesthood. ",
        "children": []
      }
    ]
  }
]