[{"header":"Paul Defends His Work for Christ"},{"num":10,"verse":"Do you think I am a coward when I am with you and brave when I am far away? Well, I ask you to listen, because Christ himself was humble and gentle. "},{"num":2,"verse":"Some people have said that we act like the people of this world. So when I arrive, I expect I will have to be firm and forceful in what I say to them. Please don’t make me treat you that way. "},{"num":3,"verse":"We live in this world, but we don’t act like its people "},{"num":4,"verse":"or fight our battles with the weapons of this world. Instead, we use God’s power that can destroy fortresses. We destroy arguments "},{"num":5,"verse":"and every bit of pride that keeps anyone from knowing God. We capture people’s thoughts and make them obey Christ. "},{"num":6,"verse":"And when you completely obey him, we will punish anyone who refuses to obey."},{"num":7,"verse":"You judge by appearances. If any of you think you are the only ones who belong to Christ, then think again. We belong to Christ as much as you do. "},{"num":8,"verse":"Maybe I brag a little too much about the authority that the Lord gave me to help you and not to hurt you. Yet I am not embarrassed to brag. "},{"num":9,"verse":"And I am not trying to scare you with my letters. "},{"num":10,"verse":"Some of you are saying, “Paul’s letters are harsh and powerful. But in person, he is a weakling and has nothing worth saying.” "},{"num":11,"verse":"Those people had better understand that when I am with you, I will do exactly what I say in my letters."},{"num":12,"verse":"We won’t dare compare ourselves with those who think so much of themselves. But they are foolish to compare themselves with themselves. "},{"num":13,"verse":"We won’t brag about something we don’t have a right to brag about. We will only brag about the work that God has sent us to do, and you are part of that work. "},{"num":14,"verse":"We are not bragging more than we should. After all, we did bring the message about Christ to you."},{"num":15,"verse":"We don’t brag about what others have done, as if we had done those things ourselves. But I hope that as you become stronger in your faith, we will be able to reach many more of the people around you. That has always been our goal. "},{"num":16,"verse":"Then we will be able to preach the good news in other lands where we cannot take credit for work someone else has already done. "},{"num":17,"verse":"The Scriptures say, “If you want to brag, then brag about the Lord.” "},{"num":18,"verse":"You may brag about yourself, but the only approval that counts is the Lord’s approval."}]