[{"header":"Paul’s Authority to Speak Forcefully"},{"num":10,"verse":"Now I myself, Paul, plead with you with the gentleness and kindness of the Messiah—I who am humble when I am face to face with you but forceful toward you when I am away! "},{"num":2,"verse":"I beg you that when I come I will not need to be courageous by daring to oppose some people who think that we are living according to the flesh. "},{"num":3,"verse":"Of course, we are living in the world, but we do not wage war in a world-like way. "},{"num":4,"verse":"For the weapons of our warfare are not those of the world. Instead, they have the power of God to demolish fortresses. We tear down arguments "},{"num":5,"verse":"and every proud obstacle that is raised against the knowledge of God, taking every thought captive in order to obey the Messiah. "},{"num":6,"verse":"Once your obedience is complete, we will be ready to reprimand every type of disobedience."},{"num":7,"verse":"Look at the plain facts! If anyone is confident that he belongs to the Messiah, he should remind himself of this: Just as he belongs to the Messiah, so do we. "},{"num":8,"verse":"So if I boast a little too much about our authority, which the Lord gave us to build you up and not to tear you down, I will not be ashamed of it."},{"num":9,"verse":"I do not want you to think that I am trying to frighten you with my letters. "},{"num":10,"verse":"For someone is saying, “His letters are impressive and forceful, but his bodily presence is weak and his speech contemptible.” "},{"num":11,"verse":"Someone like this should take note of the following: What we say by letter when we are absent is what we will do when present!"},{"header":"Paul’s Reason for Boasting"},{"num":12,"verse":"We would not dare put ourselves in the same class with, or compare ourselves to, those who recommend themselves. Whenever they measure themselves by their own standards or compare themselves among themselves, they show how foolish they are. "},{"num":13,"verse":"We will not boast about what cannot be evaluated. Instead, we will stay within the field that God assigned us, so as to reach even you. "},{"num":14,"verse":"For it is not as though we were overstepping our limits when we came to you. We were the first to reach you with the gospel of the Messiah. "},{"num":15,"verse":"We are not boasting about work done by others that cannot be evaluated. On the contrary, we cherish the hope that your faith may continue to grow and enlarge our sphere of action among you until it overflows. "},{"num":16,"verse":"Then we can preach the gospel in the regions far beyond you without boasting about things already accomplished by someone else."},{"num":17,"verse":"“The person who boasts should boast in the Lord.” "},{"num":18,"verse":"It is not the person who commends himself who is approved, but the person whom the Lord commends."}]