[{"header":"Paul Defends His Ministry"},{"num":10,"verse":"I, Paul, am begging you with the gentleness and the kindness of Christ. Some people say that I am easy on you when I am with you and bold when I am away. "},{"num":2,"verse":"They think we live in a worldly way, and I plan to be very bold with them when I come. I beg you that when I come I will not need to use that same boldness with you. "},{"num":3,"verse":"We do live in the world, but we do not fight in the same way the world fights. "},{"num":4,"verse":"We fight with weapons that are different from those the world uses. Our weapons have power from God that can destroy the enemy’s strong places. We destroy people’s arguments "},{"num":5,"verse":"and every proud thing that raises itself against the knowledge of God. We capture every thought and make it give up and obey Christ. "},{"num":6,"verse":"We are ready to punish anyone there who does not obey, but first we want you to obey fully."},{"num":7,"verse":"You must look at the facts before you. If you feel sure that you belong to Christ, you must remember that we belong to Christ just as you do. "},{"num":8,"verse":"It is true that we brag freely about the authority the Lord gave us. But this authority is to build you up, not to tear you down. So I will not be ashamed. "},{"num":9,"verse":"I do not want you to think I am trying to scare you with my letters. "},{"num":10,"verse":"Some people say, “Paul’s letters are powerful and sound important, but when he is with us, he is weak. And his speaking is nothing.” "},{"num":11,"verse":"They should know this: We are not there with you now, so we say these things in letters. But when we are there with you, we will show the same authority that we show in our letters."},{"num":12,"verse":"We do not dare to compare ourselves with those who think they are very important. They use themselves to measure themselves, and they judge themselves by what they themselves are. This shows that they know nothing. "},{"num":13,"verse":"But we will not brag about things outside the work that was given us to do. We will limit our bragging to the work that God gave us, and this includes our work with you. "},{"num":14,"verse":"We are not bragging too much, as we would be if we had not already come to you. But we have come to you with the Good News of Christ. "},{"num":15,"verse":"We limit our bragging to the work that is ours, not what others have done. We hope that as your faith continues to grow, you will help our work to grow much larger. "},{"num":16,"verse":"We want to tell the Good News in the areas beyond your city. We do not want to brag about work that has already been done in another person’s area. "},{"num":17,"verse":"But, “If people want to brag, they should brag only about the Lord.” "},{"num":18,"verse":"It is not those who say they are good who are accepted but those the Lord thinks are good."}]