[{"num":10,"verse":"Now I, Paul, encourage you by the meekness and gentleness of Christ (I, who am lowly when present among you but bold when absent)."},{"num":2,"verse":"And I urge you that, when I am present, I need not be bold with the same confidence as that which I think to be bold against some, who think of us as though we walked according to the flesh."},{"num":3,"verse":"Nevertheless, though we walk in the flesh, yet we do not war according to the flesh."},{"num":4,"verse":"For the weapons of our warfare are not carnal, but mighty, through God, to cast down strongholds,"},{"num":5,"verse":"overthrowing arguments - and every high thing that is exalted against the knowledge of God - and bringing into captivity every thought to the obedience of Christ,"},{"num":6,"verse":"and being ready to avenge all disobedience, once your obedience is fulfilled."},{"num":7,"verse":"Do you perceive things by outward appearance? If anyone is persuaded in himself that he is Christ’s, let him further consider this in himself: that as he is Christ’s, even so are we Christ’s."},{"num":8,"verse":"For though I should boast somewhat more of our authority (which the Lord has given us for building up and not for pulling you down) I shall not be ashamed -"},{"num":9,"verse":"lest I might seem as if to frighten you away with letters."},{"num":10,"verse":"For indeed they say, “his letters are heavy and strong, but his bodily presence is weak, and his speech is of no value.”"},{"num":11,"verse":"Let such a one think this: that as such as we are in word by letters when we are absent, we will also be in deed when we are present."},{"num":12,"verse":"For we dare not reckon ourselves among, or compare ourselves to, those who praise themselves. But they do not understand that they measure themselves with themselves and compare themselves with themselves."},{"num":13,"verse":"But we will not boast of things which are not measurable, but according to the measure of the rule which God has distributed to us; a measure to reach even to you."},{"num":14,"verse":"For we do not stretch ourselves beyond measure, as though we had not reached you. For as far as you also we have come in the Gospel of Christ,"},{"num":15,"verse":"not boasting of things which are beyond measure (that is, of others’ labors). But we do hope, when your faith shall increase, to be magnified by you abundantly, according to our area,"},{"num":16,"verse":"and to preach the Gospel in those regions beyond you (not to rejoice in another’s area which has already been prepared)."},{"num":17,"verse":"But, “Let him who boasts, boast in the Lord”."},{"num":18,"verse":"For the one who praises himself is not approved, but the one whom the Lord praises."}]