[{"num":10,"verse":"Now I, Paul, beg you to do something since you know that Christ was kind and gentle. You say I am weak when I am face to face with you, but when I am not with you, then I speak to you with hard words."},{"num":2,"verse":"I beg you, do not force me to talk hard words when I come. I have made up my mind to talk hard words against some people. They think we are living for the things in this world."},{"num":3,"verse":"Of course we are living in bodies made for this world. But we are not fighting for the things in this world."},{"num":4,"verse":"We do not use the things of this world in our fighting, but we use the power of God. This power can break down the walls where the enemy hides."},{"num":5,"verse":"We can break down what people think and every big idea that tries to stop people from knowing God. And we can make every thought a prisoner to obey Christ."},{"num":6,"verse":"Only when you all obey, then we are ready to punish anyone who will not obey."},{"num":7,"verse":"Surely you can see this. If one person is sure that he belongs to Christ, then he should see that we too belong to Christ just as he does."},{"num":8,"verse":"The Lord gave us power to build you up, not to break you down. Maybe I talk about it too much. But I feel I am right in talking about it."},{"num":9,"verse":"I do not want you to think that I am trying to make you afraid by my letters."},{"num":10,"verse":"Some people say, `Paul's letters make us listen. They are strong. But he himself is weak and what he says is not worth listening to.'"},{"num":11,"verse":"People like that should know this. When we come we will do what we have said in our letters."},{"num":12,"verse":"We do not want to be like those people who praise themselves. They measure themselves by their own ideas, and look at themselves to see how good they are. When they do that, they are foolish!"},{"num":13,"verse":"We will not talk of things we did not do. No, we will only be proud of those things which God has given us to do. And he has sent us even as far as you."},{"num":14,"verse":"We are not going farther than we should when we come to you. We were the first to come all the way to you with the good news of Christ."},{"num":15,"verse":"We will not be proud of other men's work which we did not do. We hope that you will believe more strongly, so that we can do more work among you, as God gives it to us."},{"num":16,"verse":"Then we hope to tell the good news in places far beyond you. We will not be proud of the work given to someone else to do - work that was done before we got there."},{"num":17,"verse":"The holy writings say that the person who is proud should be proud only of the Lord."},{"num":18,"verse":"A man who praises himself is not a man who is good. The man who is really good is the man whom the Lord praises."}]