[[],[{"type":"header","content":"Jehoshaphat Succeeds Asa"},{"type":"prose","content":"Jehoshaphat his son then became king [of Judah] in Asa’s place, and strengthened his position over Israel. "}],[{"type":"prose","content":"He placed troops in all the fortified cities of Judah, and set garrisons in the land of Judah and in the cities of Ephraim which his father Asa had captured."}],[{"type":"header","content":"His Good Reign"},{"type":"prose","content":"The LORD was with Jehoshaphat because he followed the example of his father (ancestor) David. He did not seek [to follow] the Baals [the false gods], "}],[{"type":"prose","content":"but sought the God of his father, and walked in (obeyed) His commandments, and did not act as Israel did. "}],[{"type":"prose","content":"Therefore the LORD established the kingdom in his hand; and all Judah brought tribute to Jehoshaphat, and he had great wealth and honor. "}],[{"type":"prose","content":"His heart was encouraged  he took great pride in the ways of the LORD; moreover, he again removed the high places [of pagan worship] and the Asherim from Judah."}],[{"type":"prose","content":"Then in the third year of his reign he sent his officials, Ben-hail, Obadiah, Zechariah, Nethanel, and Micaiah, to teach in the cities of Judah; "}],[{"type":"prose","content":"and with them were the Levites—Shemaiah, Nethaniah, Zebadiah, Asahel, Shemiramoth, Jehonathan, Adonijah, Tobijah, and Tobadonijah; and with them the priests Elishama and Jehoram. "}],[{"type":"prose","content":"They taught in Judah  the Book of the Law of the LORD with them; they went throughout all the cities of Judah and taught among the people."}],[{"type":"prose","content":"Now the dread of the LORD was on all the kingdoms of the lands surrounding Judah, so that they did not make war against Jehoshaphat. "}],[{"type":"prose","content":"Some of the Philistines brought gifts and silver as tribute to Jehoshaphat; the Arabians also brought him flocks: 7,700 rams and 7,700 male goats. "}],[{"type":"prose","content":"So Jehoshaphat became greater and greater. He built fortresses and storage cities in Judah. "}],[{"type":"prose","content":"He had large supplies in the cities of Judah, and soldiers, courageous men, in Jerusalem. "}],[{"type":"prose","content":"This was the number of them by their fathers’ (ancestors’) households: of Judah, the commanders of thousands, Adnah the commander, and with him 300,000 courageous men; "}],[{"type":"prose","content":"and next to him was Jehohanan the commander, and with him 280,000; "}],[{"type":"prose","content":"and next to him Amasiah the son of Zichri, who volunteered for the LORD, and with him 200,000 courageous men; "}],[{"type":"prose","content":"and of Benjamin: Eliada, a brave man, and with him 200,000 men armed with bow and shield; "}],[{"type":"prose","content":"and next to him was Jehozabad, and with him 180,000 armed  ready for military service. "}],[{"type":"prose","content":"These are the ones who were in the service of the king, besides those he had placed in fortified cities throughout Judah."}]]