[[],[{"type":"header","content":"Jehoshaphat’s Reign"},{"type":"prose","content":"His son Jehoshaphat succeeded him, and strengthened himself against Israel. "}],[{"type":"prose","content":"He placed forces in all the fortified cities of Judah, and set garrisons in the land of Judah, and in the cities of Ephraim that his father Asa had taken. "}],[{"type":"prose","content":"The  was with Jehoshaphat, because he walked in the earlier ways of his father; he did not seek the Baals, "}],[{"type":"prose","content":"but sought the God of his father and walked in his commandments, and not according to the ways of Israel. "}],[{"type":"prose","content":"Therefore the  established the kingdom in his hand. All Judah brought tribute to Jehoshaphat, and he had great riches and honor. "}],[{"type":"prose","content":"His heart was courageous in the ways of the ; and furthermore he removed the high places and the sacred poles from Judah."}],[{"type":"prose","content":"In the third year of his reign he sent his officials, Ben-hail, Obadiah, Zechariah, Nethanel, and Micaiah, to teach in the cities of Judah. "}],[{"type":"prose","content":"With them were the Levites, Shemaiah, Nethaniah, Zebadiah, Asahel, Shemiramoth, Jehonathan, Adonijah, Tobijah, and Tob-adonijah; and with these Levites, the priests Elishama and Jehoram. "}],[{"type":"prose","content":"They taught in Judah, having the book of the law of the  with them; they went around through all the cities of Judah and taught among the people."}],[{"type":"prose","content":"The fear of the  fell on all the kingdoms of the lands around Judah, and they did not make war against Jehoshaphat. "}],[{"type":"prose","content":"Some of the Philistines brought Jehoshaphat presents, and silver for tribute; and the Arabs also brought him seven thousand seven hundred rams and seven thousand seven hundred male goats. "}],[{"type":"prose","content":"Jehoshaphat grew steadily greater. He built fortresses and storage cities in Judah. "}],[{"type":"prose","content":"He carried out great works in the cities of Judah. He had soldiers, mighty warriors, in Jerusalem. "}],[{"type":"prose","content":"This was the muster of them by ancestral houses: Of Judah, the commanders of the thousands: Adnah the commander, with three hundred thousand mighty warriors, "}],[{"type":"prose","content":"and next to him Jehohanan the commander, with two hundred eighty thousand, "}],[{"type":"prose","content":"and next to him Amasiah son of Zichri, a volunteer for the service of the , with two hundred thousand mighty warriors. "}],[{"type":"prose","content":"Of Benjamin: Eliada, a mighty warrior, with two hundred thousand armed with bow and shield, "}],[{"type":"prose","content":"and next to him Jehozabad with one hundred eighty thousand armed for war. "}],[{"type":"prose","content":"These were in the service of the king, besides those whom the king had placed in the fortified cities throughout all Judah."}]]