[{"header":"Some Things to Do"},{"num":4,"verse":"My dear brothers and sisters, I love you and want to see you. You bring me joy and make me proud of you. Continue following the Lord as I have told you."},{"num":2,"verse":"Euodia and Syntyche, you both belong to the Lord, so please agree with each other."},{"num":3,"verse":"For this I make a special request to my friend who has served with me so faithfully: Help these women. They worked hard with me in telling people the Good News, together with Clement and others who worked with me. Their names are written in the book of life."},{"num":4,"verse":"Always be filled with joy in the Lord. I will say it again. Be filled with joy."},{"num":5,"verse":"Let everyone see that you are gentle and kind. The Lord is coming soon."},{"num":6,"verse":"Don’t worry about anything, but pray and ask God for everything you need, always giving thanks for what you have."},{"num":7,"verse":"And because you belong to Christ Jesus, God’s peace will stand guard over all your thoughts and feelings. His peace can do this far better than our human minds."},{"num":8,"verse":"Brothers and sisters, continue to think about what is good and worthy of praise. Think about what is true and honorable and right and pure and beautiful and respected."},{"num":9,"verse":"And do what you learned and received from me—what I told you and what you saw me do. And the God who gives peace will be with you."},{"header":"Paul Thanks the Philippian Believers"},{"num":10,"verse":"I am so happy, and I thank the Lord that you have again shown your care for me. You continued to care about me, but there was no way for you to show it."},{"num":11,"verse":"I am telling you this, but not because I need something. I have learned to be satisfied with what I have and with whatever happens."},{"num":12,"verse":"I know how to live when I am poor and when I have plenty. I have learned the secret of how to live through any kind of situation—when I have enough to eat or when I am hungry, when I have everything I need or when I have nothing."},{"num":13,"verse":"Christ is the one who gives me the strength I need to do whatever I must do."},{"num":14,"verse":"But it was good that you helped me when I needed help."},{"num":15,"verse":"You people in Philippi remember when I first told the Good News there. When I left Macedonia, you were the only church that gave me help."},{"num":16,"verse":"Several times you sent me things I needed when I was in Thessalonica."},{"num":17,"verse":"Really, it is not that I want to get gifts from you. But I want you to have the benefit that comes from giving."},{"num":18,"verse":"I have everything I need. I have even more than I need. I have all I need because Epaphroditus brought your gift to me. Your gift is like a sweet-smelling sacrifice offered to God. God accepts that sacrifice and it pleases him."},{"num":19,"verse":"My God will use his glorious riches to give you everything you need. He will do this through Christ Jesus."},{"num":20,"verse":"Glory to our God and Father forever and ever. Amen."},{"num":21,"verse":"Give our greetings to God’s people there—to each one who belongs to Christ Jesus. Those in God’s family who are with me send you their greetings."},{"num":22,"verse":"And greetings to you from all of God’s people here, especially those who work in the service of the emperor."},{"num":23,"verse":"The grace of the Lord Jesus Christ be with you all."}]