[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Nehemiah 6:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 6:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am doing a great work — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He acquainted them that he thought the business which they might have with him could not be of such importance as that which he had in hand; and therefore he would not put a stop to it to come and confer with them. Thus he tells them one, but not the only, nor the principal reason of his refusal; for he properly judged that it would answer no good end to intimate to them his suspicions of their design to compass his death.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-9 Let those who are tempted to idle merry meetings by vain companions, thus answer the temptation, We have work to do, and must not neglect it. We must never suffer ourselves to be overcome, by repeated urgency, to do anything sinful or imprudent; but when attacked with the same temptation, must resist it with the same reason and resolution. It is common for that which is desired only by the malicious, to be falsely represented by them as desired by the many. But Nehemiah knew at what they aimed, he not only denied that such things were true, but that they were reported; he was better known than to be thus suspected. We must never omit any known duty for fear it should be misconstrued; but, while we keep a good conscience, let us trust God with our good name. God's people, though loaded with reproach, are not really fallen so low in reputation as some would have them thought to be. Nehemiah lifted up his heart to Heaven in a short prayer. When, in our Christian work and warfare, we enter upon any service or conflict, this is a good prayer, I have such a duty to do, such a temptation to grapple with; now, therefore, O God, strengthen my hands. Every temptation to draw us from duty, should quicken us the more to duty.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The choice made of Ono, on the skirts of Benjamin, 25 or 30 miles from Jerusalem, as the meeting-place, was, no doubt, in order to draw Nehemiah to a distance from his supporters, that so an attack might be made on him with a better chance of success. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2-4. Then Sanballat and Geshem sent unto me—The Samaritan leaders, convinced that they could not overcome Nehemiah by open arms, resolved to gain advantage over him by deceit and stratagem. With this in view, under pretext of terminating their differences in an amicable manner, they invited him to a conference. The place of rendezvous was fixed \"in some one of the villages in the plain of Ono.\" \"In the villages\" is, Hebrew, \"in Cephirim,\" or \"Chephirah,\" the name of a town in the territory of Benjamin (Jos 9:17; 18:26). Nehemiah, however, apprehensive of some intended mischief, prudently declined the invitation. Though it was repeated four times, [Nehemiah's] uniform answer was that his presence could not be dispensed with from the important work in which he was engaged. This was one, though not the only, reason. The principal ground of his refusal was that his seizure or death at their hands would certainly put a stop to the further progress of the fortifications.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am doing a great work:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he tells them one, but not the only, nor the principal, reason of his refusal, because his coming might cause the work to cease, not only by the neglect of it during his absence, but by his death, which they by this means might compass, though he thought it not fit to express so much to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I sent messengers unto them,.... He did not show any open contempt of them, nor did he even return answer by the messenger that came from them, but sent some of his own people to them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, I am doing a great work; was about an affair of great importance, very busy, and not at leisure to give them a meeting: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so that I cannot come down; Jerusalem being built on an eminence, and the place proposed to meet at in a plain, going thither is expressed by coming down: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "why should the work cease, while I leave it, and come down to you? signifying that it would cease if he left it; and it being of greater consequence than anything they could have to converse about, he argues it would be wrong to relinquish it on such an account; this was the reason he thought fit to give, but was not the only, nor the principal reason, which is suggested in the preceding verse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "why should the work cease, while I leave it, and come down to you? signifying that it would cease if he left it; and it being of greater consequence than anything they could have to converse about, he argues it would be wrong to relinquish it on such an account; this was the reason he thought fit to give, but was not the only, nor the principal reason, which is suggested in the preceding verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I sent messengers unto them, saying, I am doing a great work, so that I cannot come down: {b} why should the work cease, whilst I leave it, and come down to you?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I sent messengers unto them, saying, I ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " doing a great work, so that I cannot come down: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " why should the work cease, whilst I leave it, and come down to you?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Meaning, that if he obeyed their request, the work God had appointed would cease: showing by this that we should not commit ourselves to the hands of the wicked.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cease",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘The great work’ of rebuilding the walls was one for which Nehemiah was responsible; and it was no doubt literally true that if he quitted the city there would at once be a cessation in the prosecution of the work. The LXX. misunderstood the last clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς ἂν τελειώσω αὐτὸ καταβήσομαι πρὸς ὑμᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Nehemiah 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nehemiah sent messengers to them, saying: \"I am doing a great work, and I cannot come down thither. Why should the work cease whilst I leave it and come down to you?\" That is, he let them know that he could not undertake the journey, because his presence in Jerusalem was necessary for the uninterrupted prosecution of the work of building.",
        "children": []
      }
    ]
  }
]