[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The fifth time with an open letter in his hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Four times they strive to induce Nehemiah to meet them, under various pretexts, with the intention of doing him personal harm. Each time his reply was to the effect that he was finishing his own work, not without a touch of irony. This answer has an universal application, which preachers have known how to use. In the fifth letter the tactics are changed: the silken bag containing the missive was not sealed, and it was hoped that Nehemiah would be alarmed by the thought that its contents had been read by the people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Nehemiah 6:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 6:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With an open letter in his hand — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Before, the message was delivered by word of mouth, but now by letter; yet ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "open, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as speaking of a thing commonly known, or in order that every one might see of what he was accused. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is reported among the heathen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The neighbouring people, whom you proudly and disdainfully call heathen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Gashmu saith it ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Probably the same as Geshem, mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That thou and the Jews think to rebel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thus he endeavours to possess Nehemiah with an apprehension that his undertaking to build the walls of Jerusalem was generally considered as a factious and seditious proceeding, and would be resented accordingly at court. Some of the best men, even in their most innocent and excellent performances, have lain under a similar imputation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That thou mayest be king, according to these words — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, according to these reports; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "according to these things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, when these things, which thou art now doing, shall be finished.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-9 Let those who are tempted to idle merry meetings by vain companions, thus answer the temptation, We have work to do, and must not neglect it. We must never suffer ourselves to be overcome, by repeated urgency, to do anything sinful or imprudent; but when attacked with the same temptation, must resist it with the same reason and resolution. It is common for that which is desired only by the malicious, to be falsely represented by them as desired by the many. But Nehemiah knew at what they aimed, he not only denied that such things were true, but that they were reported; he was better known than to be thus suspected. We must never omit any known duty for fear it should be misconstrued; but, while we keep a good conscience, let us trust God with our good name. God's people, though loaded with reproach, are not really fallen so low in reputation as some would have them thought to be. Nehemiah lifted up his heart to Heaven in a short prayer. When, in our Christian work and warfare, we enter upon any service or conflict, this is a good prayer, I have such a duty to do, such a temptation to grapple with; now, therefore, O God, strengthen my hands. Every temptation to draw us from duty, should quicken us the more to duty.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The letter was \"open,\" in order that the contents might be generally known, and that the Jews, alarmed at the threats contained in it, might refuse to continue the work. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5-9. Then sent Sanballat his servant … the fifth time with an open letter in his hand—In Western Asia, letters, after being rolled up like a map, are flattened to the breadth of an inch; and instead of being sealed, they are pasted at the ends. In Eastern Asia, the Persians make up their letters in the form of a roll about six inches long, and a bit of paper is fastened round it with gum, and sealed with an impression of ink, which resembles our printers' ink, but it is not so thick. Letters were, and are still, sent to persons of distinction in a bag or purse, and even to equals they are enclosed—the tie being made with a colored ribbon. But to inferiors, or persons who are to be treated contemptuously, the letters were sent open—that is, not enclosed in a bag. Nehemiah, accustomed to the punctillious ceremonial of the Persian court, would at once notice the want of the usual formality and know that it was from designed disrespect. The strain of the letter was equally insolent. It was to this effect: The fortifications with which he was so busy were intended to strengthen his position in the view of a meditated revolt: he had engaged prophets to incite the people to enter into his design and support his claim to be their native king; and, to stop the circulation of such reports, which would soon reach the court, he was earnestly besought to come to the wished-for conference. Nehemiah, strong in the consciousness of his own integrity, and penetrating the purpose of this shallow artifice, replied that there were no rumors of the kind described, that the idea of a revolt and the stimulating addresses of hired demagogues were stories of the writer's own invention, and that he declined now, as formerly, to leave his work.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Thereby bidding open defiance to him, as before he had used secret practices; and intimating that he would do that by manifest force, which he had intended to do by sudden surprise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then sent Sanballat his servant unto me in like manner the fifth time,.... In his own name, neither Tobiah nor Geshem joining with him, he being more solicitous and anxious to get him into his hands than any of them; and it may be, as some think, pretending more friendship for him than the rest, and therefore writes alone, as if they knew nothing of his writing: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with an open letter in his hand: which having in it an intimation of Nehemiah being guilty of treason, anyone that would might read it, and so spread the defamation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "with an open letter in his hand: which having in it an intimation of Nehemiah being guilty of treason, anyone that would might read it, and so spread the defamation. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then sent Sanballat his servant unto me in like manner the fifth time with an open letter in his hand;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his servant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an open letter in his hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘Open,’ not sealed. The object of this is obvious. It was intended that the contents of the letter should become public property. The servant himself and the adherents of Sanballat within the walls of Jerusalem (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") would possess themselves of its contents long before it reached the hands of Nehemiah. (1) The charge of treason against Nehemiah and the Jews would terrify the timid from active co-operation in the work, and decide those who were wavering to desist altogether (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The dissemination of the contents of the letter was therefore an attempt to stay the rebuilding of the walls at the last moment. (2) The effect upon the people which the letter was calculated to produce might decide Nehemiah to concede the proposed interview. Sanballat’s challenge being made public, it was hoped that Nehemiah would find himself compelled to rebut the charges, and to meet his adversaries in the way which they proposed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Thus the opportunity would be obtained of seizing his person and of employing to their own advantage the interval of his absence from the city.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An open letter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Letters in the East are usually placed in silken bags, which are then tied up and carefully sealed. An \"open letter\" invited perusal; and the object of sending this one \"open' must have been to create alarm among the Jews, and to excite them against Nehemiah. Compare the conduct of Sennacherib's ambassadors (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 18:27-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Nehemiah 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Sanballat sent his servant in this manner, the fifth time, with an open letter, in which was written: \"It is reported (נשׁמע, it is heard) among the nations, and Gashmu saith, (that) thou and the Jews intend to rebel; for which cause thou buildest the wall, and thou wilt be their king, according to these words.\" \"The nations\" are naturally the nations dwelling in the land, in the neighbourhood of the Jewish community. On the form Gashmu, comp. rem. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". הוה, the particip., is used of that which any one intends or prepares to do: thou art intending to become their king. על־כּן, therefore, for no other reason than to rebel, dost thou build the wall.",
        "children": []
      }
    ]
  }
]