[{"header":"Chapter 29"},{"num":1,"verse":"The Philistines Reject David. The Philistines gathered all of their forces together at Aphek. The Israelites camped by the spring in Jezreel."},{"num":2,"verse":"The lords of the Philistines were marching along with their units of hundreds and thousands while David and his men were marching at the rear with Achish."},{"num":3,"verse":"The lords of the Philistines said, “What about these Hebrews?” Achish replied to the lords of the Philistines, “Is this not David, a servant of Saul, the king of the Israel? He has been with me these days, these years. I have found no fault in him since he came to me up until the present.”"},{"num":4,"verse":"The lords of the Philistines were angry with him, and the lords of the Philistines said to him, “Send that man back, let him go back to the place where you have assigned him. Do not let him go into battle with us, lest he turn against us during the battle. What other way could he reconcile to his master if not with the heads of these men?"},{"num":5,"verse":"Is this not the David of whom they sang while they were dancing, ‘Saul has killed his thousands, and David has killed his ten thousands.’ ”"},{"num":6,"verse":"So Achish summoned David and said, “As the Lord lives, you have been upright with me. You have done well in your going out and your coming back with your army. From the day you came to me up to the present, I have found nothing wrong in you. Nevertheless, the lords do not approve of you."},{"num":7,"verse":"Therefore, go back, and leave in peace, so that you not displease the lords of the Philistines.”"},{"num":8,"verse":"David said to Achish, “But what have I done? As long as I have been with you, up until now, have you found anything in your servant that would explain why I am not able to go to fight against the enemies of my lord, the king?”"},{"num":9,"verse":"Achish answered David, “I consider you to be as good as an angel of God. Nevertheless, the lords of the Philistines have said, ‘He will not go up with us into battle.’"},{"num":10,"verse":"Now, therefore, rise up early in the morning with your master’s servants who have come with you. Get up at daybreak and depart.”"},{"num":11,"verse":"David and his men arose in the morning, and they left for the land of the Philistines, and the Philistines went up to Jezreel."}]