[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Out of the camp of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It has been questioned whether this Amalekite had actually been in the army of Israel, and the expression in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “As I happened by chance upon Mount Gilboa,” has been cited to show that his presence there was merely accidental, but no one who is not concerned in the matter is likely to stray into the midst of a battle, and the expression “by chance” is better referred to his coming upon Saul when he was wounded. He certainly here claims to have been a part of the “camp of Israel.” He tells David the general facts of the defeat, and the death of Saul and Jonathan, as they really occurred.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-10 The blow which opened David's way to the throne was given about the time he had been sorely distressed. Those who commit their concerns to the Lord, will quietly abide his will. It shows that he desired not Saul's death, and he was not impatient to come to the throne.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now it came to pass ... - There is no break whatever between the two books of Samuel, the division being purely artificial. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2-12. a man came out of the camp from Saul—As the narrative of Saul's death, given in the last chapter, is inspired, it must be considered the true account, and the Amalekite's story a fiction of his own, invented to ingratiate himself with David, the presumptive successor to the throne. David's question, \"How went the matter?\" evinces the deep interest he took in the war, an interest that sprang from feelings of high and generous patriotism, not from views of ambition. The Amalekite, however, judging him to be actuated by a selfish principle, fabricated a story improbable and inconsistent, which he thought would procure him a reward. Having probably witnessed the suicidal act of Saul, he thought of turning it to his own account, and suffered the penalty of his grievously mistaken calculation (compare 2Sa 1:9 with 1Sa 31:4, 5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And David said unto him, from whence comest thou?.... It is very likely by his appearance and circumstances he suspected from whence he came: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he said unto him, out of the camp of Israel am I escaped; which plainly suggested that that was in danger, confusion, and distress. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he said unto him, out of the camp of Israel am I escaped; which plainly suggested that that was in danger, confusion, and distress. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And David said unto him, From whence comest thou? And he said unto him, Out of the camp of Israel am I escaped.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Out of the camp of Israel am I escaped.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Non-combatants would hang about the army, watching, as soon as the battle had begun, the fortunes of the day, and immediately that they saw the impending defeat of their own side, would think chiefly of their personal safety. But for an active young man the opportunity would then have come for booty. The Philistines, in pursuit of the enemy, would soon leave the battlefield in their rear, and multitudes would quickly prowl about it to plunder the dead. While so busied, the Amalekite falsely represents himself as having come by chance upon the wounded, but still living, Saul. 2 Samuel 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "David receives the news of Saul's death. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After the death of Saul, and David's return to Ziklag from his campaign against the Amalekites, there came a man to David on the third day, with his clothes torn and earth strewed upon his head (as a sign of deep mourning: see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), who informed him of the flight and overthrow of the Israelitish army, and the death of Saul and Jonathan.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Samuel 1:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 1:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Samuel 1:1 may be regarded as the protasis to 2 Samuel 1:2, so far as the contents are concerned, although formally it is rounded off, and ויּשׁב forms the apodosis to ויהי: \"It came to pass after the death of Saul, David had returned from the slaughter of the Amalekites (1 Samuel 30:1-26), that David remained at Ziklag two days. And it came to pass on the third day,\" etc. Both of these notices of the time refer to the day, on which David returned to Ziklag from the pursuit and defeat of the Amalekites. Whether the battle at Gilboa, in which Saul fell, occurred before or after the return of David, it is impossible to determine. All that follows from the juxtaposition of the two events in 2 Samuel 1:1, is that they were nearly contemporaneous. The man \"came from the army from with Saul,\" and therefore appears to have kept near to Saul during the battle.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " may be regarded as the protasis to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so far as the contents are concerned, although formally it is rounded off, and ויּשׁב forms the apodosis to ויהי: \"It came to pass after the death of Saul, David had returned from the slaughter of the Amalekites (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 30:1-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that David remained at Ziklag two days. And it came to pass on the third day,\" etc. Both of these notices of the time refer to the day, on which David returned to Ziklag from the pursuit and defeat of the Amalekites. Whether the battle at Gilboa, in which Saul fell, occurred before or after the return of David, it is impossible to determine. All that follows from the juxtaposition of the two events in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is that they were nearly contemporaneous. The man \"came from the army from with Saul,\" and therefore appears to have kept near to Saul during the battle.",
            "children": []
          }
        ]
      }
    ]
  }
]