[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-10 The blow which opened David's way to the throne was given about the time he had been sorely distressed. Those who commit their concerns to the Lord, will quietly abide his will. It shows that he desired not Saul's death, and he was not impatient to come to the throne.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now it came to pass ... - There is no break whatever between the two books of Samuel, the division being purely artificial. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2-12. a man came out of the camp from Saul—As the narrative of Saul's death, given in the last chapter, is inspired, it must be considered the true account, and the Amalekite's story a fiction of his own, invented to ingratiate himself with David, the presumptive successor to the throne. David's question, \"How went the matter?\" evinces the deep interest he took in the war, an interest that sprang from feelings of high and generous patriotism, not from views of ambition. The Amalekite, however, judging him to be actuated by a selfish principle, fabricated a story improbable and inconsistent, which he thought would procure him a reward. Having probably witnessed the suicidal act of Saul, he thought of turning it to his own account, and suffered the penalty of his grievously mistaken calculation (compare 2Sa 1:9 with 1Sa 31:4, 5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he looked behind him,.... To see how near the enemy was, and who were pursuing him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he saw me, and called unto me; by which it should rather seem that he belonged to the Philistines than to the Israelites, and as his being an Amalekite shows; for such an one would hardly be admitted among the latter, though it is most likely he was with neither, but happened to come that way just at that time: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I answered, here am I; ready to hear what thou hast to say, and do thy pleasure. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I answered, here am I; ready to hear what thou hast to say, and do thy pleasure. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when he looked behind him, he saw me, and called unto me. And I answered, Here am I.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To David's further inquiry how he knew this, the young man replied (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:6-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"I happened to come (נקרא  equals  נקרה) up to the mountains of Gilboa, and saw Saul leaning upon his spear; then the chariots (the war-chariots for the charioteers) and riders were pressing upon him, and he turned round and saw me, ... and asked me, Who art thou? and I said, An Amalekite; and he said to me, Come hither to me, and slay me, for the cramp (שׁבץ according to the Rabbins) hath seized me (sc., so that I cannot defend myself, and must fall into the hands of the Philistines); for my soul (my life) is still whole in me. Then I went to him, and slew him, because I knew that after his fall he would not live; and took the crown upon his head, and the bracelet upon his arm, and brought them to my lord\" (David). \"After his fall\" does not mean \"after he had fallen upon his sword or spear\" (Clericus), for this is neither implied in נפלו nor in על־חניתו נשׁען (\"supported, i.e., leaning upon his spear\"), nor are we at liberty to transfer it from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 31:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into this passage; but \"after his defeat,\" i.e., so that he would not survive this calamity. This statement is at variance with the account of the death of Saul in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 31:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; and even apart from this it has an air of improbability, or rather of untruth in it, particularly in the assertion that Saul was leaning upon his spear when the chariots and horsemen of the enemy came upon him, without having either an armour-bearer or any other Israelitish soldier by his side, so that he had to turn to an Amalekite who accidentally came by, and to ask him to inflict the fatal wound. The Amalekite invented this, in the hope of thereby obtaining the better recompense from David. The only part of his statement which is certainly true, is that he found the king lying dead upon the field of battle, and took off the crown and armlet; since he brought these to David. But it is by no means certain whether he was present when Saul expired, or merely found him after he was dead.",
        "children": []
      }
    ]
  }
]