[{"header":"Work Resumed on the Temple"},{"num":5,"verse":"The prophet Haggai and Zechariah, grandson of Iddo, prophesied to the Jews in Judah and Jerusalem in the name of Israel’s God, who was over them. "},{"num":2,"verse":"Then Zerubbabel, who was Shealtiel’s son, and Jeshua, who was Jozadak’s son, began to rebuild God’s temple in Jerusalem. God’s prophets were with them and supported them."},{"num":3,"verse":"At the same time, Governor Tattenai ⌞from the province⌟ west of the Euphrates River, Shethar Bozenai, and their group went to the Jews and asked them, “Who gave you permission to rebuild this temple and finish its walls?” "},{"num":4,"verse":"They also asked the Jews for the names of the men who were working on this building."},{"num":5,"verse":"But the leaders of the Jews were under God’s watchful eye. They couldn’t be stopped until Darius received a report and sent a reply to it."},{"header":"Permission Requested from Darius"},{"num":6,"verse":"Here is a copy of the letter Governor Tattenai ⌞from the province⌟ west of the Euphrates River, Shethar Bozenai and his group (the Persians west of that river) sent to King Darius. "},{"num":7,"verse":"They sent him the following report:"},{"num":8,"verse":"Your Majesty should know that we went to the province of Judah, to the temple of the great God. The temple is being built with large stones and with wooden beams laid in its walls. The builders are doing an excellent job and making rapid progress. "},{"num":9,"verse":"We asked their leaders the following question: “Who gave you permission to rebuild this temple and finish its walls?” "},{"num":10,"verse":"For your information, we also asked them for their names so that we would have a record of the men who were their leaders. "},{"num":11,"verse":"This was their reply to us:"},{"num":12,"verse":"But because our ancestors made the God of heaven angry, he handed them over to King Nebuchadnezzar of Babylon (a Chaldean). So Nebuchadnezzar destroyed this temple and deported its people to Babylon."},{"num":13,"verse":"“However, in the first year of the reign of King Cyrus of Babylon, Cyrus gave permission for God’s temple to be rebuilt. "},{"num":14,"verse":"In addition, Cyrus took out of a temple in Babylon the gold and silver utensils that belonged to God’s temple. (Nebuchadnezzar had taken them out of God’s temple in Jerusalem and brought them into a temple in Babylon.) Cyrus gave them to a man named Sheshbazzar, whom he had made governor. "},{"num":15,"verse":"Cyrus told him, ‘Take these utensils. Place them in the temple in Jerusalem. Rebuild God’s temple on its original site.’ "},{"num":16,"verse":"Then Sheshbazzar laid the foundation of God’s temple in Jerusalem. The temple has been under construction from that time until now, but it still isn’t finished.”"},{"num":17,"verse":"If it pleases Your Majesty, allow someone to search the king’s archives in Babylon to determine whether King Cyrus gave permission for the temple of God to be rebuilt in Jerusalem. Then please send us Your Majesty’s decision on this matter."}]