[{"header":"The Israelites Oppressed"},{"num":1,"verse":"These are the names of the sons of Israel who went to Egypt. Each man and his household went with Jacob: "},{"num":2,"verse":"Reuben, Simeon, Levi, and Judah, "},{"num":3,"verse":"Issachar, Zebulun, and Benjamin, "},{"num":4,"verse":"Dan and Naphtali, Gad and Asher. "},{"num":5,"verse":"The total number of Jacob’s descendants was seventy people. (Joseph was already in Egypt.)"},{"num":6,"verse":"Then Joseph died, as did all his brothers and that entire generation. "},{"num":7,"verse":"However, the Israelites were fruitful, multiplied quickly, increased in number, and became very numerous. So the land was filled with them."},{"num":8,"verse":"Then a new king arose over Egypt, who did not know Joseph. "},{"num":9,"verse":"He said to his people, “Look, the Israelites are more numerous and more powerful than we are. "},{"num":10,"verse":"Let’s come up with a wise plan to prevent them from increasing in number. Otherwise, if war breaks out, they would join with our enemies and fight against us. Then they would leave the land.” "},{"num":11,"verse":"So the Egyptians placed taskmasters over them to oppress them with forced labor. The Israelites built Pithom and Rameses as store cities for Pharaoh. "},{"num":12,"verse":"But the more the Egyptians oppressed the Israelites, the more they increased in number, and the more they spread out. The Egyptians were filled with dread because of them. "},{"num":13,"verse":"So the Egyptians oppressed the Israelites by forcing them to work very hard. "},{"num":14,"verse":"The Egyptians made the Israelites’ lives bitter with hard work, with brick and mortar, and with all kinds of work in the fields. The Egyptians were merciless in the way they imposed work on the Israelites."},{"num":15,"verse":"The king of Egypt also spoke to the Hebrew midwives. One of them was named Shiphrah and the other Puah. "},{"num":16,"verse":"He said, “When you help the Hebrew women give birth, while they are still on the delivery stool, if you see that the baby is a son, you are to kill him, but if you see that it is a daughter, let her live.” "},{"num":17,"verse":"The midwives, however, feared God, so they did not do what the king of Egypt told them to do, but they let the boys live."},{"num":18,"verse":"The king of Egypt called for the midwives and said to them, “Why did you do this and let the boys live?”"},{"num":19,"verse":"The midwives said to Pharaoh, “Because the Hebrew women are not like the Egyptian women. They are vigorous, so they give birth before the midwife comes to them.”"},{"num":20,"verse":"So God treated the midwives well. The people also increased in number and became very numerous. "},{"num":21,"verse":"Because the midwives feared God, he gave them families. "},{"num":22,"verse":"Pharaoh, however, commanded all his people, “Every son who is born you shall throw into the Nile, but every daughter you shall let live.”"}]