[{"header":"Israel Oppressed"},{"num":1,"verse":"Now these are the names of the sons of Israel, which came into Egypt (each man and his household came with Jacob): "},{"num":2,"verse":"Reuben, Simeon, Levi, and Judah; "},{"num":3,"verse":"Issachar, Zebulun, and Benjamin; "},{"num":4,"verse":"Dan, Naphtali, Gad, and Asher. "},{"num":5,"verse":"All the people who came from the seed of Jacob were seventy people, but Joseph was in Egypt already."},{"num":6,"verse":"Joseph died, as did all his brothers, and all that generation. "},{"num":7,"verse":"Nevertheless, the sons of Israel were fruitful, and increased abundantly, and multiplied, and became exceedingly mighty, so that the land was filled with them."},{"num":8,"verse":"Now there rose up a new king over Egypt, who did not know Joseph. "},{"num":9,"verse":"He said to his people, “Surely, the people of the sons of Israel are more numerous and powerful than we. "},{"num":10,"verse":"Come, let us deal wisely with them, lest they multiply, and it come to pass that when any war breaks out, they also join our enemies, and fight against us, and escape from the land.”"},{"num":11,"verse":"Therefore they set taskmasters over them to afflict them with their labor. They built for Pharaoh storage cities: Pithom and Rameses. "},{"num":12,"verse":"But the more they afflicted them, the more they multiplied and grew so that as a result they abhorred the sons of Israel. "},{"num":13,"verse":"The Egyptians made the children of Israel to serve with rigor, "},{"num":14,"verse":"and they made their lives bitter with hard service—in mortar and in brick, and in all manner of service in the field, all their service in which they made them serve was with rigor."},{"num":15,"verse":"The king of Egypt spoke to the Hebrew midwives, of which the name of one was Shiphrah, and the name of the other Puah, "},{"num":16,"verse":"and he said, “When you perform the office of a midwife to the Hebrew women and see them on the stools, if it is a son, then you must kill him, but if it is a daughter, then she may live.” "},{"num":17,"verse":"However, the midwives feared God, and did not do as the king of Egypt commanded them, but kept the male children alive. "},{"num":18,"verse":"The king of Egypt called for the midwives and said to them, “Why have you done this thing and preserved the male children’s lives?”"},{"num":19,"verse":"The midwives said to Pharaoh, “Because the Hebrew women are not like the Egyptian women, for they are vigorous and give birth before the midwives come to them.”"},{"num":20,"verse":"Therefore God dealt well with the midwives, and the people multiplied and grew very mighty. "},{"num":21,"verse":"So it happened that because the midwives feared God, He gave them families."},{"num":22,"verse":"Pharaoh charged all his people, saying, “You must cast every son that is born into the river, and you must preserve every daughter’s life.”"}]