[[],[],[{"type":"prose","content":"These are the names of the Israelites who went to Egypt with Jacob, each bringing his family members:Reuben, Simeon, Levi, and Judah,Issachar, Zebulun, and Benjamin,Dan and Naphtali, Gad and Asher.Seventy persons in all generated by Jacob’s seed. Joseph was already in Egypt."}],[{"type":"prose","content":"Then Joseph died, and all his brothers—that whole generation. But the children of Israel kept on reproducing. They were very prolific—a population explosion in their own right—and the land was filled with them."}],[{"type":"header","content":"“A New King . . . Who Didn’t Know Joseph”"},{"type":"prose","content":"A new king came to power in Egypt who didn’t know Joseph. He spoke to his people with alarm, “There are way too many of these Israelites for us to handle. We’ve got to do something: Let’s devise a plan to contain them, lest if there’s a war they should join our enemies, or just walk off and leave us.”"}],[{"type":"prose","content":"So they organized them into work-gangs and put them to hard labor under gang-foremen. They built the storage cities Pithom and Rameses for Pharaoh. But the harder the Egyptians worked them the more children the Israelites had—children everywhere! The Egyptians got so they couldn’t stand the Israelites and treated them worse than ever, crushing them with slave labor. They made them miserable with hard labor—making bricks and mortar and back-breaking work in the fields. They piled on the work, crushing them under the cruel workload."}],[{"type":"prose","content":"The king of Egypt had a talk with the two Hebrew midwives; one was named Shiphrah and the other Puah. He said, “When you deliver the Hebrew women, look at the sex of the baby. If it’s a boy, kill him; if it’s a girl, let her live.”"}],[{"type":"prose","content":"But the midwives had far too much respect for God and didn’t do what the king of Egypt ordered; they let the boy babies live. The king of Egypt called in the midwives. “Why didn’t you obey my orders? You’ve let those babies live!”"}],[{"type":"prose","content":"The midwives answered Pharaoh, “The Hebrew women aren’t like the Egyptian women; they’re vigorous. Before the midwife can get there, they’ve already had the baby.”"}],[{"type":"prose","content":"God was pleased with the midwives. The people continued to increase in number—a very strong people. And because the midwives honored God, God gave them families of their own."}],[{"type":"prose","content":"So Pharaoh issued a general order to all his people: “Every boy that is born, drown him in the Nile. But let the girls live.”"}]]