[{"num":1,"verse":"And these [are] the names of the sons of Israel who are coming into Egypt with Jacob; a man and his household have they come;"},{"num":2,"verse":"Reuben, Simeon, Levi, and Judah,"},{"num":3,"verse":"Issachar, Zebulun, and Benjamin,"},{"num":4,"verse":"Dan, and Naphtali, Gad, and Asher."},{"num":5,"verse":"And all the persons coming out of the thigh of Jacob are seventy persons; as to Joseph, he was in Egypt."},{"num":6,"verse":"And Joseph dieth, and all his brethren, and all that generation;"},{"num":7,"verse":"and the sons of Israel have been fruitful, and they teem, and multiply, and are very very mighty, and the land is filled with them."},{"num":8,"verse":"And there riseth a new king over Egypt, who hath not known Joseph,"},{"num":9,"verse":"and he saith unto his people, `Lo, the people of the sons of Israel [is] more numerous and mighty than we;"},{"num":10,"verse":"give help! let us act wisely concerning it, lest it multiply, and it hath come to pass, when war happeneth, that it hath been joined, even it, unto those hating us, and hath fought against us, and hath gone out up of the land.'"},{"num":11,"verse":"And they set over it princes of tribute, so as to afflict it with their burdens, and it buildeth store-cities for Pharaoh, Pithom and Raamses;"},{"num":12,"verse":"and as they afflict it, so it multiplieth, and so it breaketh forth, and they are vexed because of the sons of Israel;"},{"num":13,"verse":"and the Egyptians cause the sons of Israel to serve with rigour,"},{"num":14,"verse":"and make their lives bitter in hard service, in clay, and in brick, and in every [kind] of service in the field; all their service in which they have served [is] with rigour."},{"num":15,"verse":"And the king of Egypt speaketh to the midwives, the Hebrewesses, (of whom the name of the one [is] Shiphrah, and the name of the second Puah),"},{"num":16,"verse":"and saith, `When ye cause the Hebrew women to bear, and have looked on the children; if it [is] a son -- then ye have put him to death; and if it [is] a daughter -- then she hath lived.'"},{"num":17,"verse":"And the midwives fear God, and have not done as the king of Egypt hath spoken unto them, and keep the lads alive;"},{"num":18,"verse":"and the king of Egypt calleth for the midwives, and saith to them, `Wherefore have ye done this thing, and keep the lads alive?'"},{"num":19,"verse":"And the midwives say unto Pharaoh, `Because the Hebrew women [are] not as the Egyptian women, for they [are] lively; before the midwife cometh in unto them -- they have borne!'"},{"num":20,"verse":"And God doth good to the midwives, and the people multiply, and are very mighty;"},{"num":21,"verse":"and it cometh to pass, because the midwives have feared God, that He maketh for them households;"},{"num":22,"verse":"and Pharaoh layeth a charge on all his people, saying, `Every son who is born -- into the River ye do cast him, and every daughter ye do keep alive.'"}]