[{"header":"Moses Commissions Joshua"},{"num":31,"verse":"Moses went and explained these things to everyone in Israel. "},{"num":2,"verse":"Then he concluded, “I’m now 120 years old. I’m not able to get around anymore, "},{"num":3,"verse":"and the Lord told me, ‘You won’t be crossing the Jordan River.’ But the Lord your God is crossing over before you. He will destroy these nations in front of you and you will dispossess them. As for Joshua, he will cross over before you, just as the Lord promised. "},{"num":4,"verse":"The Lord will do to them just as he did to Sihon and Og, the kings of the Amorites, and to their land when he destroyed them. "},{"num":5,"verse":"The Lord will hand them over to you, so you can do to them what I’ve instructed you to do. "},{"num":6,"verse":"Be strong and courageous. Don’t fear or tremble before them, because the Lord your God will be the one who keeps on walking with you—he won’t leave you or abandon you.”"},{"num":7,"verse":"Then Moses called on Joshua and told him in the presence of everyone in Israel, “Be strong and courageous, because you’ll bring this people to the land that the Lord your God had promised to give your ancestors. You will be the one who causes them to possess it. "},{"num":8,"verse":"Indeed, the Lord is the one who will keep on walking in front of you. He’ll be with you and won’t leave you or abandon you, so never be afraid and never be dismayed.”"},{"header":"Moses Entrusts the Law to the Levitical Priests"},{"num":9,"verse":"Then Moses wrote down this Law and gave it to the Levitical priests who carry the Ark of the Covenant of the Lord and to all of Israel’s leaders. "},{"num":10,"verse":"Then he gave these orders: “At the end of seven years, the year designated for release, during the Festival of Tents, "},{"num":11,"verse":"when all of Israel comes to appear in the presence of the Lord your God at the place that he’ll choose, read this Law aloud to them. "},{"num":12,"verse":"Gather the people—the men, women, children, and the foreigners that live in your cities—so they may hear and fear the Lord your God, and so they may be careful to obey the words contained in this Law. "},{"num":13,"verse":"Their children who don’t know will hear and learn to fear the Lord your God as long as you live in the land that you are crossing the Jordan River to possess.”"},{"header":"Moses and Joshua Present Themselves to the Lord"},{"num":14,"verse":"Then the Lord told Moses: “Look! Because your time to die is approaching, call Joshua, present yourselves at the Tent of Meeting, and then I will commission him.” Moses and Joshua complied and presented themselves at the Tent of Meeting. "},{"num":15,"verse":"So the Lord appeared at the tent in a pillar of cloud that stood above the entrance."},{"num":16,"verse":"Then the Lord told Moses, “Look! You are about to join your ancestors. Afterwards, this people will rebel and commit prostitution with the foreign gods of the land that they are about to enter to possess. They will abandon me and break my covenant that I made with them. "},{"num":17,"verse":"When that happens, my anger will burn against them, because they will have abandoned me. I’ll hide my face from them, they will be consumed, and many evils and distresses will find them. When this happens, they will say, ‘These troubles have happened to us because God isn’t among us.’ "},{"num":18,"verse":"I’ll surely hide my face in that day on account of the evil that they will have done, because they will have turned to other gods.”"},{"header":"Moses Instructed to Teach a Song"},{"num":19,"verse":"“Now write this song and teach it to the Israelis. Put this song in their very mouths, so that it will be a witness for me against the Israelis, "},{"num":20,"verse":"because after I’ve brought them to the land flowing with milk and honey that I promised to their ancestors by an oath, they’ll eat, grow fat, and then they’ll turn to other gods and serve them, while despising me and breaking my covenant. "},{"num":21,"verse":"Then, when many evils and troubles will have come upon them, this song will serve as a witness against them, since their descendants won’t fail to sing it. I know the plan that they are devising even before I bring them into the land that I promised them by an oath.”"},{"num":22,"verse":"So Moses wrote the song that very day and taught it to the Israelis. "},{"num":23,"verse":"Then the Lord charged Nun’s son Joshua, “Be strong and courageous, because you’ll bring the Israelis to the land that I promised to them by an oath. I’ll be with you.”"},{"num":24,"verse":"When Moses had finished writing the words of this Law in a book, "},{"num":25,"verse":"he gave this charge to the descendants of Levi who carried the Ark of the Covenant of the Lord: "},{"num":26,"verse":"“Take the book of this Law and set it beside the Ark of the Covenant of the Lord your God. Let it remain there with you as a witness against you, "},{"num":27,"verse":"because indeed I know your rebellion and stubbornness. Note that even while I’m still alive, you’ve been rebelling against the Lord—how much more so after my death! "},{"num":28,"verse":"Gather together the leaders of your tribes and your foremen so I can speak these words in their hearing and call heaven and the earth as witnesses against them, "},{"num":29,"verse":"because I know that after my death, you’ll surely act wickedly and turn from the road that I’ve instructed you. As a result, evil will fall on you in days to come, because you’ll act wickedly in the sight of the Lord, causing him to become angry due to your behavior.” "},{"num":30,"verse":"So Moses spoke the words of this song—to the very end—in front of the entire assembly of Israel."}]