[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:14-20 Prudence, as well as justice, directs us to be fair and open in our dealings; cheating bargains will not bear the light. Abraham, without fraud or delay, pays the money. He pays it at once in full, without keeping any part back; and by weight, current money with the merchant, without deceit. See how anciently money was used for the help of trade, and how honestly it should be paid when it is due. Though all the land of Canaan was Abraham by promise, yet the time of his possessing it not being come, what he had occasion for he bought and paid for. Dominion is not founded in grace. The saints' title to an eternal inheritance does not entitle them to the possessions of this world, nor justify them in doing wrong. Ephron honestly and fairly makes a good title to the land. As that which is bought, must be honestly paid for, so that which is sold, must be honestly delivered and secured. Let us manage our concerns with punctuality and exactness, in order to avoid contention. Abraham buried Sarah in cave. or vault, which was in the purchased field. It would tend to endear the land to his posterity. And it is worth noting, that a burying-place was the only piece of the land which Abraham possessed in Canaan. Those who have least of this earth, find a grave in it. This sepulchre was at the end of the field; whatever our possessions are, there is a burial-place at the end of them. It was a token of his belief and expectation of the resurrection. Abraham is contented to be still a pilgrim while he lives, but secures a place where, when he dies, his flesh may rest in hope. After all, the chief concern is, with whom we shall rise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The transaction now comes to be between Abraham and Ephron. \"Was sitting.\" The sons of Heth were seated in council, and Ephron among them. Abraham seems to have been seated also; for he stood up to make his obeisance and request ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Before all that went in at the gate of his city.\" The conference was public. The place of session for judicial and other public business was the gate of the city, which was common ground, and where men were constantly going in and out. \"His city.\" This implies not that he was the king or chief, but simply that he was a respectable citizen. If Hebron was the city of the Hittites here intended, its chief at the time seems to have been Arba. \"The field give I thee.\" Literally, have I given thee - what was resolved upon was regarded as done. \"In the sight of the sons of my people.\" This was a public declaration or deed before many witnesses.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He offers the field as a gift, with the Eastern understanding that the receiver would make an ample recompense. This mode of dealing had its origin in a genuine good-will, that was prepared to gratify the wish of another as soon as it was made known, and as far as it was reasonable or practicable. The feeling seems to have been still somewhat fresh and unaffected in the time of Abraham, though it has degenerated into a mere form of courtesy. \"If thou wilt, hear me.\" The language is abrupt, being spoken in the haste of excitement. \"I give silver.\" \"I have given\" in the original; that is, I have determined to pay the full price. If the Eastern giver was liberal, the receiver was penetrated with an equal sense of the obligation conferred, and a like determination to make an equivalent return. \"The land is four hundred shekels.\" This is the familiar style for \"the land is worth so much.\" The shekel is here mentioned for the first time. It was originally a weight, not a coin. The weight at least was in common use before Abraham. If the shekel be nine pennyweights and three grains, the price of the field was about forty-five pounds sterling. \"And Abraham weighed.\" It appears that the money was uncoined silver, as it was weighed. \"Current with the merchant.\" The Kenaanites, of whom the Hittites were a tribe, were among the earliest traders in the world. The merchant, as the original imports, is the traveller who brings the wares to the purchasers in their own dwellings or towns. To him a fixed weight and measure were necessary.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He offers the field as a gift, with the Eastern understanding that the receiver would make an ample recompense. This mode of dealing had its origin in a genuine good-will, that was prepared to gratify the wish of another as soon as it was made known, and as far as it was reasonable or practicable. The feeling seems to have been still somewhat fresh and unaffected in the time of Abraham, though it has degenerated into a mere form of courtesy. \"If thou wilt, hear me.\" The language is abrupt, being spoken in the haste of excitement. \"I give silver.\" \"I have given\" in the original; that is, I have determined to pay the full price. If the Eastern giver was liberal, the receiver was penetrated with an equal sense of the obligation conferred, and a like determination to make an equivalent return. \"The land is four hundred shekels.\" This is the familiar style for \"the land is worth so much.\" The shekel is here mentioned for the first time. It was originally a weight, not a coin. The weight at least was in common use before Abraham. If the shekel be nine pennyweights and three grains, the price of the field was about forty-five pounds sterling. \"And Abraham weighed.\" It appears that the money was uncoined silver, as it was weighed. \"Current with the merchant.\" The Kenaanites, of whom the Hittites were a tribe, were among the earliest traders in the world. The merchant, as the original imports, is the traveller who brings the wares to the purchasers in their own dwellings or towns. To him a fixed weight and measure were necessary.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11-15. Ephron answered, Nay, my lord, &c.—Here is a great show of generosity, but it was only a show; for while Abraham wanted only the cave, he joins \"the field and the cave\"; and though he offered them both as free gifts, he, of course, expected some costly presents in return, without which, he would not have been satisfied. The patriarch, knowing this, wished to make a purchase and asked the terms.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Ephron answered Abraham, saying unto him. The following words: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Ephron answered Abraham, saying unto him,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 14, 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Ephron answered Abraham, saying unto him, My lord, hearken unto me: the land is worth four hundred shekels of silver.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word \"shekel,\" from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shakal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to weigh, here used for the first time, was not a stamped coin, but a piece of metal of definite weight, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equal to twenty gerahs, or beans, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "garar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to roll. Coined money was unknown to the Hebrews until after the captivity. In the time of the Maccabees (1 Macc. 15:6) silver coins were struck bearing the inscription ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "שקל ישראל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". According to Josephus (Ant., iii. 8, 2) the shekel in use in his day was equal to four Athenian drachmae;  and if, as is believed, these were one-fifth  larger than the old shekels coined by Simon  Maccabeus, the weight of the latter would  be equal to three and one-third drachms, or  two hundred grains, reckoning sixty grains  to a drachm. It is impossible to ascertain the weight of the shekel current with the merchant in the time of Abraham; but reckoning it at a little less than 2s. 6d. sterling, the price of Ephron's field must have  been somewhat under £50; a very consider able sum of money, which the Hittite merchant begins to depreciate by representing  as a trifle, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What is that betwixt  me and thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - words which are still heard  in the East on similar occasions (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ' Land  and Book,' p. 578) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "bury therefore thy dead.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 23:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He then went to the Hittites, the lords and possessors of the city and its vicinity at that time, to procure from them \"a possession of a burying-place.\" The negotiations were carried on in the most formal style, in a public assembly \"of the people of the land,\" i.e., of natives (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in the gate of the city (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As a foreigner and sojourner, Abraham presented his request in the most courteous manner to all the citizens (\"all that went in at the gate,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; a phrase interchangeable with \"all that went out at the gate,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 34:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and those who \"go out and in,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The citizens with the greatest readiness and respect offered \"the prince of God,\" i.e., the man exalted by God to the rank of a prince, \"the choice\" (מבחר, i.e., the most select) of their graves for his use (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But Abraham asked them to request Ephron, who, to judge from the expression \"his city\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was then ruler of the city, to give him for a possession the cave of Machpelah, at the end of his field, of which he was the owner, \"for full silver,\" i.e., for its full worth. Ephron thereupon offered to make him a present of both field and cave. This was a turn in the affair which is still customary in the East; the design, so far as it is seriously meant at all, being either to obtain a present in return which will abundantly compensate for the value of the gift, or, what is still more frequently the case, to preclude any abatement in the price to be asked. The same design is evident in the peculiar form in which Ephron stated the price, in reply to Abraham's repeated declaration that he was determined to buy the piece of land: \"a piece of land of 400 shekels of silver, what is that between me and thee\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? Abraham understood it so (ישׁמע ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and weighed him the price demanded. The shekel of silver \"current with the merchant,\" i.e., the shekel which passed in trade as of standard weight, was 274 Parisian grains, so that the price of the piece of land was 52, 10s.; a very considerable amount for that time. ",
        "children": []
      }
    ]
  }
]