[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:14-20 Prudence, as well as justice, directs us to be fair and open in our dealings; cheating bargains will not bear the light. Abraham, without fraud or delay, pays the money. He pays it at once in full, without keeping any part back; and by weight, current money with the merchant, without deceit. See how anciently money was used for the help of trade, and how honestly it should be paid when it is due. Though all the land of Canaan was Abraham by promise, yet the time of his possessing it not being come, what he had occasion for he bought and paid for. Dominion is not founded in grace. The saints' title to an eternal inheritance does not entitle them to the possessions of this world, nor justify them in doing wrong. Ephron honestly and fairly makes a good title to the land. As that which is bought, must be honestly paid for, so that which is sold, must be honestly delivered and secured. Let us manage our concerns with punctuality and exactness, in order to avoid contention. Abraham buried Sarah in cave. or vault, which was in the purchased field. It would tend to endear the land to his posterity. And it is worth noting, that a burying-place was the only piece of the land which Abraham possessed in Canaan. Those who have least of this earth, find a grave in it. This sepulchre was at the end of the field; whatever our possessions are, there is a burial-place at the end of them. It was a token of his belief and expectation of the resurrection. Abraham is contented to be still a pilgrim while he lives, but secures a place where, when he dies, his flesh may rest in hope. After all, the chief concern is, with whom we shall rise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The completion of the sale is stated with great formality. No mention is made of any written deed of sale. Yet Abraham, Isaac, and Jacob remained in undisturbed possession of this burial-ground. Undisputed tenure seems to have been acknowledged as a title. The burial of Sarah is then simply noted. The validity of Abraham's title is practically evinced by the actual burial of Sarah, and is recited again on account of the importance of the fact.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This chapter is interesting as containing the first record of mourning for the dead, of burial, of property in land, of purchase of land, of silver as a medium of purchase, and of a standard of weight. Mourning for the dead was, no doubt, natural on the first death. Burial was a matter of necessity, in order, as Abraham says, to remove the body out of sight, as soon as it was learned by experience that it would be devoured by beasts of prey, or become offensive by putrefaction. To bury or cover it with earth was a more easy and natural process than burning, and was therefore earlier and more general. Property in land was introduced where tribes became settled, formed towns, and began to practise tillage. Barter was the early mode of accommodating each party with the articles he needed or valued. This led gradually to the use of the precious metals as a \"current\" medium of exchange - first by weight, and then by coins of a fixed weight and known stamp.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The burial of Sarah is noted because she was the wife of Abraham and the mother of the promised seed. The purchase of the field is worthy of note, as it is the first property of the chosen race in the promised land. Hence, these two events are interwoven with the sacred narrative of the ways of God with man. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - The Marriage of Isaac",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "26. קרד  qādad, \"bow the head.\" השׁתחוה  shâchâh, \"bow the body.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "29. לבן  lābān, \"Laban, white.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In this circumstantial account of the marriage of Isaac, we have a beautiful picture of ancient manners in the East, the living original of which the present customs of that cradle of mankind are a striking copy.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In this circumstantial account of the marriage of Isaac, we have a beautiful picture of ancient manners in the East, the living original of which the present customs of that cradle of mankind are a striking copy.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Abraham buried Sarah—Thus he got possession of Machpelah and deposited the remains of his lamented partner in a family vault which was the only spot of ground he owned.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And after this,.... After this affair was over, the bargain struck, the money paid, and possession secured: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Abraham buried Sarah his wife in the cave of the field of Machpelah,  ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "before Mamre; and here he himself was buried, and also Isaac and Rebekah, and Jacob and Leah, Genesis 25:9. Benjamin of Tudela (h) says, in his time (who lived in the latter end of the twelfth century), in the field of Machpelah was a city or town, and in it a large temple called Saint Abraham, where were shown the sepulchres of the six persons before mentioned, and inscriptions over each of them, showing whose they were; and that at the end of the field was the house of Abraham, and before the house a fountain, and no other was suffered to be built there in honour to Abraham: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "before Mamre; and here he himself was buried, and also Isaac and Rebekah, and Jacob and Leah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Benjamin of Tudela (h) says, in his time (who lived in the latter end of the twelfth century), in the field of Machpelah was a city or town, and in it a large temple called Saint Abraham, where were shown the sepulchres of the six persons before mentioned, and inscriptions over each of them, showing whose they were; and that at the end of the field was the house of Abraham, and before the house a fountain, and no other was suffered to be built there in honour to Abraham: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the same is Hebron in the land of Canaan; that is, Mamre is the same place which afterwards was called Hebron, a city in the land of Canaan, in the tribe of Judah, about twenty two miles from Jerusalem to the south, and was one of the cities of refuge. Hebron has the title of Hhaleah, i.e. the chosen or beloved, among the Arabs, where the (Maggarel Mamra) cave of Mamre or Machpelah is still shown, and is always lighted up with lamps, and held in extraordinary veneration by the Mahometans (i). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Itinerarium, p. 48, 49. (i) Shaw's Travels, p. 339. Marg. Ed. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) Itinerarium, p. 48, 49. (i) Shaw's Travels, p. 339. Marg. Ed. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And after this, Abraham buried Sarah his wife in the cave of the field of Machpelah before Mamre: the same is Hebron in the land of Canaan.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And after this, Abraham buried Sarah his wife",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - with what funeral rites can only be conjectured. Monumental evidence attests that the practice of embalming the dead existed in Egypt in the reign of Amunophth I. ( ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 1500",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), though probably originating, earlier. (Sharpe's 'Egypt, vol. 1. p. 31); and an examination of the Mugheir vaults for burying the dead shows that among the early Chaldaeans it was customary to place the corpse upon a matting of reed spread upon a brick floor, the head being pillowed on a single sun-dried brick, and the body turned on its left side, the right arm falling towards the left, and the fingers resting on the edge of a copper bowl, usually placed on the palm of the left hand (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rawlinson s 'Ancient Monarchies,' vol. 1. p. 87) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in the cave of the field of Machpelah before: Mamre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In which also in succession his own remains and those of Isaac, Rebekah, Jacob, and Leah were deposited, Rachel alone of the great patriarchal family being absent. This last resting-place of Abraham and his sons, as of Sarah and her daughters, has been identified with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Ramet-el-Kalil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an hour's journey to the north of Hebron (which is too distant), where the foundations of an ancient heathen temple are still pointed out as Abraham's house; but is more probably to be sought for in the Mohammedan mosque ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Haram",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", built of colossal blocks, and situated on the mountain slope of Hebron towards the east (Robinson, Thomson, Stanley, Tristram), which, after having been for 600 years hermetically sealed against Europeans,  - only three during that period having gained access to it in disguise, - was visited in 1862 by the Prince of Wales and party (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Stanley, 'Lectures on Jewish Church,' App. 2.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The same is Hebron in the land of Canaan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ver. 2). Genesis 23:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Thus arose (ויּקם) the field...to Abraham for a possession;\" i.e., it was conveyed to him in all due legal form. The expression \"the field of Ephron which is at Machpelah\" may be explained, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from the fact that the cave of Machpelah was at the end of the field, the field, therefore, belonged to it. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the shorter form, \"cave of Machpelah,\" occurs; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the field is distinguished from the cave. The name Machpelah is translated by the lxx as a common noun, τὸ σπήλαιον τὸ διπλοῦν, from מכפּלה doubling; but it had evidently grown into a proper name, since it is sued not only of the cave, but of the adjoining field also (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 50:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), though it undoubtedly originated in the form of the cave. The cave was before, i.e., probably to the east of, the grove of Mamre, which was in the district of Hebron. This description cannot be reconciled with the tradition, which identifies Mamre and the cave with Ramet el Khalil, where the strong foundation-walls of an ancient heathen temple (according to Rosenmller's conjecture, an Idumaean one) are still pointed out as Abraham's house, and where a very old terebinth stood in the early Christian times; for this is an hour's journey to the north of modern Hebron, and even the ancient Hebron cannot have stretched so far over the mountains which separate the modern city from Rameh, but must also, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", have been situated in the valley (see Robinson's later Biblical Researches, pp. 365ff.). There is far greater probability in the Mohammedan tradition, that the Harem, built of colossal blocks with grooved edges, which stands on the western slope of the Beabireh mountain, in the north-western portion of the present town, contains hidden within it the cave of Machpelah with the tomb of the patriarchs (cf. Robinson, Pal. ii. 435ff.); and Rosen. is induced to look for Mamre on the eastern slope of the Rumeidi hill, near to the remarkable well Ain el Jedid. ",
        "children": []
      }
    ]
  }
]