[{"header":"Workers in a Vineyard"},{"num":20,"verse":"As Jesus was telling what the kingdom of heaven would be like, he said:"},{"num":16,"verse":"Jesus then said, “So it is. Everyone who is now first will be last, and everyone who is last will be first.”"},{"header":"Jesus Again Tells about His Death"},{"num":17,"verse":"As Jesus was on his way to Jerusalem, he took his twelve disciples aside and told them in private:"},{"header":"A Mother’s Request"},{"num":20,"verse":"The mother of James and John came to Jesus with her two sons. She knelt down and started begging him to do something for her. "},{"num":21,"verse":"Jesus asked her what she wanted, and she said, “When you come into your kingdom, please let one of my sons sit at your right side and the other at your left.”"},{"num":22,"verse":"Jesus answered, “Not one of you knows what you are asking. Are you able to drink from the cup that I must soon drink from?”"},{"num":23,"verse":"Jesus replied, “You certainly will drink from my cup! But it isn’t for me to say who will sit at my right side and at my left. That is for my Father to say.”"},{"num":24,"verse":"When the ten other disciples heard this, they were angry with the two brothers. "},{"num":25,"verse":"But Jesus called the disciples together and said:"},{"header":"Jesus Heals Two Blind Men"},{"num":29,"verse":"Jesus was followed by a large crowd as he and his disciples were leaving Jericho. "},{"num":30,"verse":"Two blind men were sitting beside the road. And when they heard that Jesus was coming their way, they shouted, “Lord and Son of David, have pity on us!”"},{"num":31,"verse":"The crowd told them to be quiet, but they shouted even louder, “Lord and Son of David, have pity on us!”"},{"num":32,"verse":"When Jesus heard them, he stopped and asked, “What do you want me to do for you?”"},{"num":33,"verse":"They answered, “Lord, we want to see!”"},{"num":34,"verse":"Jesus felt sorry for them and touched their eyes. Right away they could see, and they became his followers."}]