[{"num":20,"verse":"¶ For the kingdom of the heavens is like unto a man, the husband of a house, who went out early in the morning to hire labourers into his vineyard."},{"num":2,"verse":"And when he had agreed with the labourers for a denarius a day, he sent them into his vineyard."},{"num":3,"verse":"And he went out about the third hour and saw others standing idle in the marketplace"},{"num":4,"verse":"and said unto them, Go ye also into the vineyard, and whatever is right I will give you. And they went."},{"num":5,"verse":"Again he went out about the sixth and ninth hour and did likewise."},{"num":6,"verse":"And about the eleventh hour he went out and found others standing idle and said unto them, Why stand ye here all the day idle?"},{"num":7,"verse":"They say unto him, Because no one has hired us. He said unto them, Go ye also into the vineyard, and whatever is right, that shall ye receive."},{"num":8,"verse":"So when evening was come, the lord of the vineyard said unto his steward, Call the labourers and give them their hire, beginning from the last unto the first."},{"num":9,"verse":"And when those came that were hired about the eleventh hour, they received every man a denarius."},{"num":10,"verse":"But when the first came, they supposed that they should have received more but they likewise received each one a denarius."},{"num":11,"verse":"And when they had received it, they murmured against the husband of the house,"},{"num":12,"verse":"saying, These last have worked but one hour, and thou hast made them equal unto us who have borne the burden and heat of the day."},{"num":13,"verse":"But he answered one of them and said, Friend, I do thee no wrong; didst not thou agree with me for a denarius?"},{"num":14,"verse":"Take that which is thine and go, for I desire to give unto this last one, even as unto thee."},{"num":15,"verse":"Is it not lawful for me to do what I will with mine own? Is thine eye evil because I am good?"},{"num":16,"verse":"So the first shall be last, and the last first; for many are called, but few are chosen."},{"num":17,"verse":"¶ And Jesus going up to Jerusalem took the twelve disciples apart in the way and said unto them,"},{"num":18,"verse":"Behold, we go up to Jerusalem, and the Son of man shall be betrayed unto the princes of the priests and unto the scribes, and they shall condemn him to death"},{"num":19,"verse":"and shall deliver him to the Gentiles to mock and to scourge and to crucify; {Gr. stauroo – Hang on a stake} and the third day he shall rise again."},{"num":20,"verse":"¶ Then the mother of the sons of Zebedee came to him with her sons, worshipping him and desiring a certain thing of him."},{"num":21,"verse":"And he said unto her, What dost thou desire? She said unto him, Grant that these my two sons may sit the one on thy right hand and the other on the left in thy kingdom."},{"num":22,"verse":"But Jesus answered and said, Ye know not what ye ask. Are ye able to drink of the cup that I shall drink of and to be baptized with the baptism that I am baptized with? They say unto him, We are able."},{"num":23,"verse":"And he said unto them, Ye shall drink indeed of my cup and be baptized with the baptism that I am baptized with; but to sit on my right hand and on my left is not mine to give, but it shall be given to those for whom it is prepared of my Father."},{"num":24,"verse":"And when the ten heard it, they were moved with indignation against the two brothers."},{"num":25,"verse":"But Jesus called them unto him and said, Ye know that the princes of the Gentiles exercise dominion over them, and those that are great wield power over them."},{"num":26,"verse":"But it shall not be so among you, but whosoever will be great among you, let him be your minister;"},{"num":27,"verse":"and whosoever will be chief among you, let him be your slave,"},{"num":28,"verse":"even as the Son of man came not to be ministered unto, but to minister and to give his life a ransom for many."},{"num":29,"verse":"¶ And as they departed from Jericho, a great multitude followed him."},{"num":30,"verse":"And, behold, two blind men sitting by the way side, when they heard that Jesus passed by, cried out, saying, Lord, Son of David, have mercy on us."},{"num":31,"verse":"And the multitude rebuked them, that they should be silent; but they cried the more, saying, Lord, Son of David, have mercy on us."},{"num":32,"verse":"And Jesus stood still and called them and said, What desire ye that I shall do unto you?"},{"num":33,"verse":"They say unto him, Lord, that our eyes may be opened."},{"num":34,"verse":"Then Jesus, having mercy on them, touched their eyes; and immediately their eyes received sight, and they followed him."}]