[{"header":"The Shepherds of Israel"},{"num":34,"verse":"Then this message came to me from the Lord:"},{"num":2,"verse":"“Son of man, prophesy against the shepherds, the leaders of Israel. Give them this message from the Sovereign Lord: What sorrow awaits you shepherds who feed yourselves instead of your flocks. Shouldn’t shepherds feed their sheep?"},{"num":3,"verse":"You drink the milk, wear the wool, and butcher the best animals, but you let your flocks starve."},{"num":4,"verse":"You have not taken care of the weak. You have not tended the sick or bound up the injured. You have not gone looking for those who have wandered away and are lost. Instead, you have ruled them with harshness and cruelty."},{"num":5,"verse":"So my sheep have been scattered without a shepherd, and they are easy prey for any wild animal."},{"num":6,"verse":"They have wandered through all the mountains and all the hills, across the face of the earth, yet no one has gone to search for them."},{"num":7,"verse":"“Therefore, you shepherds, hear the word of the Lord:"},{"num":8,"verse":"As surely as I live, says the Sovereign Lord, you abandoned my flock and left them to be attacked by every wild animal. And though you were my shepherds, you didn’t search for my sheep when they were lost. You took care of yourselves and left the sheep to starve."},{"num":9,"verse":"Therefore, you shepherds, hear the word of the Lord."},{"num":10,"verse":"This is what the Sovereign Lord says: I now consider these shepherds my enemies, and I will hold them responsible for what has happened to my flock. I will take away their right to feed the flock, and I will stop them from feeding themselves. I will rescue my flock from their mouths; the sheep will no longer be their prey."},{"header":"The Good Shepherd"},{"num":11,"verse":"“For this is what the Sovereign Lord says: I myself will search and find my sheep."},{"num":12,"verse":"I will be like a shepherd looking for his scattered flock. I will find my sheep and rescue them from all the places where they were scattered on that dark and cloudy day."},{"num":13,"verse":"I will bring them back home to their own land of Israel from among the peoples and nations. I will feed them on the mountains of Israel and by the rivers and in all the places where people live."},{"num":14,"verse":"Yes, I will give them good pastureland on the high hills of Israel. There they will lie down in pleasant places and feed in the lush pastures of the hills."},{"num":15,"verse":"I myself will tend my sheep and give them a place to lie down in peace, says the Sovereign Lord."},{"num":16,"verse":"I will search for my lost ones who strayed away, and I will bring them safely home again. I will bandage the injured and strengthen the weak. But I will destroy those who are fat and powerful. I will feed them, yes—feed them justice!"},{"num":17,"verse":"“And as for you, my flock, this is what the Sovereign Lord says to his people: I will judge between one animal of the flock and another, separating the sheep from the goats."},{"num":18,"verse":"Isn’t it enough for you to keep the best of the pastures for yourselves? Must you also trample down the rest? Isn’t it enough for you to drink clear water for yourselves? Must you also muddy the rest with your feet?"},{"num":19,"verse":"Why must my flock eat what you have trampled down and drink water you have fouled?"},{"num":20,"verse":"“Therefore, this is what the Sovereign Lord says: I will surely judge between the fat sheep and the scrawny sheep."},{"num":21,"verse":"For you fat sheep pushed and butted and crowded my sick and hungry flock until you scattered them to distant lands."},{"num":22,"verse":"So I will rescue my flock, and they will no longer be abused. I will judge between one animal of the flock and another."},{"num":23,"verse":"And I will set over them one shepherd, my servant David. He will feed them and be a shepherd to them."},{"num":24,"verse":"And I, the Lord, will be their God, and my servant David will be a prince among my people. I, the Lord, have spoken!"},{"header":"The Lord’s Covenant of Peace"},{"num":25,"verse":"“I will make a covenant of peace with my people and drive away the dangerous animals from the land. Then they will be able to camp safely in the wildest places and sleep in the woods without fear."},{"num":26,"verse":"I will bless my people and their homes around my holy hill. And in the proper season I will send the showers they need. There will be showers of blessing."},{"num":27,"verse":"The orchards and fields of my people will yield bumper crops, and everyone will live in safety. When I have broken their chains of slavery and rescued them from those who enslaved them, then they will know that I am the Lord."},{"num":28,"verse":"They will no longer be prey for other nations, and wild animals will no longer devour them. They will live in safety, and no one will frighten them."},{"num":29,"verse":"“And I will make their land famous for its crops, so my people will never again suffer from famines or the insults of foreign nations."},{"num":30,"verse":"In this way, they will know that I, the Lord their God, am with them. And they will know that they, the people of Israel, are my people, says the Sovereign Lord."},{"num":31,"verse":"You are my flock, the sheep of my pasture. You are my people, and I am your God. I, the Sovereign Lord, have spoken!”"}]