[{"header":"Adonai, Our Shepherd"},{"num":34,"verse":"The word of Adonai came to me saying: "},{"num":2,"verse":"“Son of man, prophesy against the shepherds of Israel. Prophesy and say to those shepherds, thus says Adonai Elohim: “Oy, shepherds of Israel who only take care of themselves! Should shepherds not take care of the sheep? "},{"num":3,"verse":"You eat the fat. You clothe yourself with the wool. You kill the fat ones. But you do not take care of the sheep. "},{"num":4,"verse":"You do not strengthen the weak, heal the sick, bind up the broken, bring back the stray or seek the lost. Instead, you have ruled over them with force and cruelty. "},{"num":5,"verse":"They were scattered for lack of a shepherd. They became food for all the beasts of the field as they were scattered. "},{"num":6,"verse":"My sheep wandered through all the mountains and on every high hill. Over all the face of the earth My sheep were scattered. No one searched. No one sought.”"},{"num":7,"verse":"Therefore, shepherds, hear the word of Adonai: "},{"num":8,"verse":"“As I live”—it is a declaration of Adonai—“as surely as My sheep became prey and My sheep became food for all the beasts of the field, because there was no shepherd, nor did My shepherds search for My flock, but the shepherds fed themselves and did not feed My sheep,” "},{"num":9,"verse":"therefore, you shepherds, hear the word of Adonai, "},{"num":10,"verse":"thus says Adonai Elohim: “Behold, I am against the shepherds and I will demand My flock from their hand. I will dismiss them from tending the flock. The shepherds will no longer feed themselves. I will rescue My sheep from their mouth, so they will not be food for them.”"},{"num":11,"verse":"For thus says Adonai Elohim: “Here I am! I Myself will search for My sheep and seek them out. "},{"num":12,"verse":"As a shepherd seeks out his sheep on the day he is among his scattered flock, so I will seek out My sheep. I will rescue them out of all the places where they have been scattered, on a day of cloud and thick darkness. "},{"num":13,"verse":"I will bring them out from the peoples. I will gather them from the countries. I will bring them back to their own land. I will shepherd them upon the mountains of Israel, by the streams and in all the habitable places of the land. "},{"num":14,"verse":"I will shepherd them in a good pasture—their grazing place will be on the high mountains of Israel. There they will lie down on good grazing ground. They will feed in a rich pasture on the mountains of Israel. "},{"num":15,"verse":"I will tend My flock and make them lie down”—it is a declaration of Adonai."},{"num":16,"verse":"“I will seek the lost, bring back the stray, bind up the broken and strengthen the sick. But the fat and the strong I will destroy—I will tend them with justice. "},{"num":17,"verse":"As for you, My flock”—thus says Adonai Elohim—“behold, I will judge between sheep and sheep, between rams and male goats."},{"num":18,"verse":" Was it too little for you that you were feeding in the good pasture? Must you trample down the rest of your pastures with your feet? You were drinking clear water. Must you muddy the rest with your feet? "},{"num":19,"verse":"Yet My sheep must eat what you have trampled with your feet and drink what you have muddied with your feet!”"},{"num":20,"verse":"Therefore thus says Adonai Elohim to them: “Behold, I Myself will judge between the fat sheep and the lean sheep. "},{"num":21,"verse":"Because you thrust with your side and with shoulder and gore all the weak with your horns, until you have scattered them all over, "},{"num":22,"verse":"I will save My flock. They will no longer be prey. I will judge between sheep and sheep. "},{"num":23,"verse":"So I will set up One Shepherd over them, My servant David—He will tend them, He will feed them Himself and be their shepherd."},{"num":24,"verse":" I, Adonai, will be their God, and My servant David will be Prince among them. I, Adonai, have spoken."},{"num":25,"verse":"“I will make a covenant of shalom with them. I will remove the evil beasts from the land, so they may dwell safely in the wilderness and sleep in the forest. "},{"num":26,"verse":"I will make them and the places around My hill a blessing. I will cause the rain to come down in its season. There will be showers of blessing. "},{"num":27,"verse":"The tree of the field will yield its fruit. The ground will yield its produce. They will be secure in their land. Then they will know that I am Adonai, when I have broken the bars of their yoke and have delivered them from the hand of those who enslaved them. "},{"num":28,"verse":"They will no longer be prey to the nations. The beast of the earth will not devour them. They will live in security. No one will make them afraid. "},{"num":29,"verse":"I will make their agriculture renowned. They will no longer be consumed with hunger in the land. They will no longer bear the scorn of the nations. "},{"num":30,"verse":"They will know that I, Adonai their God, am with them. They, the house of Israel, are My people.” It is a declaration of Adonai. "},{"num":31,"verse":"“So you, My sheep, the sheep of My pasture, you are human, and I am your God.” It is a declaration of Adonai Elohim."}]