[{"num":34,"verse":"And the word of the Lord was made to me, and he said,"},{"num":2,"verse":"Son of man, prophesy thou of the shepherds of Israel, prophesy thou; and thou shalt say to the shepherds, The Lord God saith these things, Woe to the shepherds of Israel, that fed himself [that fed themselves]; whether flocks be not fed of shepherds? (Son of man, prophesy thou against the shepherds of Israel, prophesy thou; and thou shalt say to the shepherds, The Lord God saith these things, Woe to the shepherds of Israel, who only feed themselves; should not the shepherds feed the flock?)"},{"num":3,"verse":"Ye ate [the] milk, and were covered with [the] wools, and ye killed that that was fat (and ye killed what was fat); but ye fed not my flock."},{"num":4,"verse":"Ye made not firm that that was unsteadfast, and ye made not whole that that was sick; ye bound not (up) that that was broken, and ye brought not again that that was cast away, and ye sought not that that perished; but ye commanded to them with sternness, and with power."},{"num":5,"verse":"And my sheep were scattered, for no shepherd was; and they were made into devouring of all beasts of the field, and they were scattered. (And my sheep were scattered, for there was no shepherd; and they were made into food for all the beasts of the field, and they were scattered.)"},{"num":6,"verse":"My flocks erred in all mountains, and in each high hill, and my flocks were scattered on all the face of earth, and none was that sought. (My flock wandered on all the mountains, and on each high hill, yea, my flock was scattered over all the face of the earth, and there was no one who sought them.)"},{"num":7,"verse":"Therefore, shepherds, hear ye the word of the Lord;"},{"num":8,"verse":"I live, saith the Lord God, for why for that that my flocks be made into raven, and my sheep into devouring of all beasts of the field, for that that no shepherd was, for the shepherds sought not my flock(s), but the shepherds fed themselves, and fed not my flocks; (As I live, saith the Lord God, because my flock was made into spoils, and my sheep into food for all the beasts of the field, because there was no shepherd, for the shepherds sought not my flock, but the shepherds fed only themselves, and fed not my flock;)"},{"num":9,"verse":"therefore, shepherds, hear ye the word of the Lord,"},{"num":10,"verse":"The Lord God saith these things, Lo! I myself am over [the] shepherds; I shall seek my flock of the hand of them, and I shall make them to cease, that they feed no more my flock, and that the shepherds feed no more themselves. And I shall deliver my flock from the mouth of them, and it shall no more be into meat to them. (The Lord God saith these things, Lo! I am against the shepherds; I shall take my flock out of their hands, and I shall make them cease, that they do not feed my flock, but that these shepherds only feed only themselves. And I shall rescue my flock from their mouths, and they shall no more be their food.)"},{"num":11,"verse":"For the Lord God saith these things, Lo! I myself shall seek (out) my sheep, and I shall visit them (and I shall search for them)."},{"num":12,"verse":"As a shepherd visiteth his flock, in the day when he is in the midst of his sheep that be scattered, so I shall visit my sheep; and I shall deliver them from all places in which they were scattered, in the day of cloud, and of darkness. (Like a shepherd searcheth for his flock, on the day when he is in the midst of his sheep that be scattered, so I shall search for my sheep; and I shall rescue them from all the places in which they were scattered, on the day of cloud, and of darkness.)"},{"num":13,"verse":"And I shall lead them out of peoples, and I shall gather them from lands, and I shall bring them into their land, and I shall feed them in the hills of Israel, in rivers, and in all seats of earth (And I shall lead them out from the nations, and I shall gather them from other lands, and I shall bring them back to their own land, and I shall feed them on the hills of Israel, by the rivers, and on all the green fields.)"},{"num":14,"verse":"I shall feed them in most plenteous pastures, and the pastures of them shall be in the high hills of Israel; there they shall rest in green herbs, and in fat pastures they shall be fed on the hills of Israel. (I shall feed them in most plentiful pastures, and their pastures shall be on the high hills of Israel; they shall rest there on green grass, and they shall feed in plentiful pastures, on the hills of Israel.)"},{"num":15,"verse":"I shall feed my sheep, and I shall make them to lie (down, or to rest), saith the Lord God."},{"num":16,"verse":"I shall seek that that perished, and I shall bring again that that was cast away; and I shall bind (up) that that was broken, and I shall make strong that that was sick; and I shall keep that that is fat and strong; and I shall feed them in doom (and I shall feed them with justice);"},{"num":17,"verse":"forsooth ye be my flocks. The Lord God saith these things, Lo! I deem betwixt beast and beast, and a wether and a buck of goats. (for ye be my flock. The Lord God saith these things, Lo! I judge between beast and beast, and a ram and a goat-buck.)"},{"num":18,"verse":"Whether it was not enough to you to devour good pastures? Furthermore and ye defouled with your feet the remnants of your pastures, and when ye drank clearest water, ye disturbed the residue with your feet. (Was it not enough for some of you to devour the good pastures? But furthermore, ye defiled the remnants of your pastures with your feet, and after that ye drank of the clearest water, then ye disturbed the residue with your feet.)"},{"num":19,"verse":"And my sheep were fed with these things that were defouled with your feet; and they drank these things, that your feet had troubled."},{"num":20,"verse":"Therefore the Lord God saith these things to you, Lo! I myself deem betwixt a fat beast and a lean beast."},{"num":21,"verse":"For that that ye hurled with (your) sides, and shoulders, and winnowed with your horns all sick beasts (and winnowed all the sick, or all the weak, beasts with your horns), till those were scattered withoutforth,"},{"num":22,"verse":"I shall save my flock, and it shall no more be into raven. And I shall deem betwixt beast and beast; (I shall save my flock, and they shall no more be spoils. And I shall judge between beast and beast;)"},{"num":23,"verse":"and I shall raise on those one shepherd, my servant David, that shall feed those; he shall feed them, and he shall be a shepherd to them. (and I shall raise upon them one shepherd, my servant David, who shall feed them; yea, he shall feed them, and he shall be their shepherd.)"},{"num":24,"verse":"Forsooth I the Lord shall be into God to them, and my servant David shall be prince in the midst of them; I the Lord spake. (And I the Lord shall be their God, and my servant David shall be their leader in their midst; I the Lord spoke.)"},{"num":25,"verse":"And I shall make with them a covenant of peace, and I shall make [the] worst beasts to cease from [the] earth; and they that dwell in desert, shall sleep secure in forests. (And I shall make a covenant of peace with them, and I shall make evil, or wild, beasts to cease to exist in the land; and then my sheep shall live with security in the field, and shall sleep with peace in the forests.)"},{"num":26,"verse":"And I shall set them [a] blessing in the compass of my little hill, and I shall lead down rain in his time. And rains of blessing shall be, (And I shall place them all around my little hill for a blessing, and I shall lead down rain in its time. Yea, there shall be blessed rains/Yea, there shall be rains of blessing,)"},{"num":27,"verse":"and the tree of the field shall give his fruit, and the earth shall give his seed. And they shall be in their land without dread; and they shall know, that I am the Lord, when I shall all-break the chains of their yoke, and shall deliver them from the hand of them that command to them. (and the tree of the field shall give its fruit, and the earth shall give its seed. And they shall live in their land without any fear; and they shall know, that I am the Lord, when I shall all-break the chains of their yoke, and shall rescue them from the hands, or from the power, of those who commanded to them.)"},{"num":28,"verse":"And they shall no more be into raven into heathen men, neither the beasts of [the] earth shall devour them, but they shall dwell trustily without any dread. (And they shall no more be spoils for the heathen, nor shall the beasts of the field devour them, but they shall live with trust, and without any fear.)"},{"num":29,"verse":"And I shall raise to them a just burgeoning named; and they shall no more be made less for hunger in earth, and they shall no more bear the shame of heathen men. (And I shall raise up for them a burgeoning justly named; and they shall no more be made less because of famine in the land, and they shall no more bear the shame of the heathen.)"},{"num":30,"verse":"And they shall know, that I am their Lord God with them, and they be my people, the house of Israel, saith the Lord God. (And they shall know that I, the Lord their God, am with them, and that they, the house of Israel, be my people, saith the Lord God.)"},{"num":31,"verse":"Forsooth ye my flocks be men, the flocks of my pasture; and I am your Lord God, saith the Lord God. (For ye people be my flock, the flock of my pasture; and I am the Lord your God, saith the Lord God.)"}]