[{"num":8,"verse":"Now the main point of what we have to say is this: We have such a High Priest, One Who is seated at the right hand of the majestic [God] in heaven,"},{"num":2,"verse":"As officiating Priest, a Minister in the holy places and in the true tabernacle which is erected not by man but by the Lord."},{"num":3,"verse":"For every high priest is appointed to offer up gifts and sacrifices; so it is essential for this [High Priest] to have some offering to make also."},{"num":4,"verse":"If then He were still living on earth, He would not be a priest at all, for there are [already priests] who offer the gifts in accordance with the Law."},{"num":5,"verse":"[But these offer] service [merely] as a pattern and as a foreshadowing of [what has its true existence and reality in] the heavenly sanctuary. For when Moses was about to erect the tabernacle, he was warned by God, saying, See to it that you make it all [exactly] according to the copy (the model) which was shown to you on the mountain."},{"num":6,"verse":"But as it now is, He [Christ] has acquired a [priestly] ministry which is as much superior and more excellent [than the old] as the covenant (the agreement) of which He is the Mediator (the Arbiter, Agent) is superior and more excellent, [because] it is enacted and rests upon more important (sublimer, higher, and nobler) promises."},{"num":7,"verse":"For if that first covenant had been without defect, there would have been no room for another one or an attempt to institute another one."},{"num":8,"verse":"However, He finds fault with them [showing its inadequacy] when He says, Behold, the days will come, says the Lord, when I will make and ratify a new covenant or agreement with the house of Israel and with the house of Judah."},{"num":9,"verse":"It will not be like the covenant that I made with their forefathers on the day when I grasped them by the hand to help and relieve them and to lead them out from the land of Egypt, for they did not abide in My agreement with them, and so I withdrew My favor and disregarded them, says the Lord."},{"num":10,"verse":"For this is the covenant that I will make with the house of Israel after those days, says the Lord: I will imprint My laws upon their minds, even upon their innermost thoughts and understanding, and engrave them upon their hearts; and I will be their God, and they shall be My people."},{"num":11,"verse":"And it will nevermore be necessary for each one to teach his neighbor and his fellow citizen or each one his brother, saying, Know (perceive, have knowledge of, and get acquainted by experience with) the Lord, for all will know Me, from the smallest to the greatest of them."},{"num":12,"verse":"For I will be merciful and gracious toward their sins and I will remember their deeds of unrighteousness no more."},{"num":13,"verse":"When God speaks of a new [covenant or agreement], He makes the first one obsolete (out of use). And what is obsolete (out of use and annulled because of age) is ripe for disappearance and to be dispensed with altogether."}]