[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For whose cause",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—The Hebrew idiom is peculiar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on account of which to whom;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but in this verse, when addressed by the sailors to the prophet, it is expressed in a more elegant form than when used to each other in the preceding verse, one among many touches marking the artistic perfection of this narrative. It is true some MSS. omit this repetition of the question, and it is therefore by some commentators treated as a gloss. But the repetition is quite natural. The sailors seeing the lot fall on one whose appearance was so little suspicious, are anxious to have it confirmed by his confession. Not less natural is the rapid and excited leap from question to question. (Comp. Virg. Æ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "n.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 8:112, 113.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:8-12 Jonah gave an account of his religion, for that was his business. We may hope that he told with sorrow and shame, justifying God, condemning himself, and explaining to the mariners what a great God Jehovah is. They said to him, Why hast thou done this? If thou fearest the God that made the sea and the dry land, why wast thou such a fool as to think thou couldst flee from his presence? If the professors of religion do wrong, they will hear it from those who make no such profession. When sin has raised a storm, and laid us under the tokens of God's displeasure, we must consider what is to be done to the sin that raised the storm. Jonah uses the language of true penitents, who desire that none but themselves may fare the worse for their sins and follies. Jonah sees this to be the punishment of his iniquity, he accepts it, and justifies God in it. When conscience is awakened, and a storm raised, nothing will turn it into a calm but parting with the sin that caused the disturbance. Parting with our money will not pacify the conscience, the Jonah must be thrown overboard.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Tell us, for whose cause - Literally \"for what to whom.\" It may be that they thought that Jonah had been guilty toward some other. The lot had pointed him out. The mariners, still fearing to do wrong, ask him thronged questions, to know why the anger of God followed him; \"what\" hast thou done \"to whom?\" \"what thine occupation?\" i. e., either his ordinary occupation, whether it was displeasing to God? or this particular business in which he was engaged, and for which he had come on board. Questions so thronged have been admired in human poetry, Jerome says. For it is true to nature. They think that some one of them will draw forth the answer which they wish. It may be that they thought that his country, or people, or parents, were under the displeasure of God. But perhaps, more naturally, they wished to \"know all about him,\" as people say. These questions must have gone home to Jonah's conscience. \"What is thy business?\" The office of prophet which he had left. \"Whence comest thou?\" From standing before God, as His minister. \"What thy country? of what people art thou?\" The people of God, whom he had quitted for pagan; not to win them to God, as He commanded; but, not knowing what they did, to abet him in his flight.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What is thine occupation? - They should ask themselves, who have Jonah's office to speak in the name of God, and preach repentance . \"What should be thy business, who hast consecrated thyself wholly to God, whom God has loaded with daily benefits? who approachest to Him as to a Friend? \"What is thy business?\" To live for God, to despise the things of earth, to behold the things of heaven,\" to lead others heavenward.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jonah answers simply the central point to which all these questions tended: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Jonah answers simply the central point to which all these questions tended: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. The guilty individual being discovered is interrogated so as to make full confession with his own mouth. So in Achan's case (Jos 7:19).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then said they unto him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when the lot pointed out Jonah, these mariners all are satisfied that he was the man, that heaven had determined that grand inquiry, and accordingly they treat with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Tell us, we pray thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they try what fair means will do with him, and desire to have the account from his own mouth; so Joshua dealt with Achan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joshua 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": satisfied in the person, next they do, with commendable justice and calmness, inquire into the thing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For whose cause this evil is upon us:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what hast thou done, for which God is so angry with thee, and with us for thy sake? sure thou canst not but know what it is, and now frankly tell us what is thine occupation, what course of life hast thou lived, or what employment dost thou now profess to follow, that we may guess by that whether thou art one of flagitious or of honest life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whence comest thou?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ere he give answer to this, probably another asketh whence he cometh, what company he had kept; by this they conjecture at the man. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What is thy country?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " another starts a third inquiry, what country or nation he is of; to those ports persons of different nations flocked; possibly they hoped some or other in the ship might be his countrymen, and so fittest to examine him. Of what people art thou? this seems to be the same question repeated, or else an inquiry where he dwelt. These are the heads of the questions asked him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then they said unto him, tell us, we pray thee,.... They did not fall upon him at once in an outrageous manner, and throw him overboard; as it might be thought such men would have done, considering what they had suffered and lost by means of him; but they use him with great respect, tenderness, and lenity: and entreat him to tell them ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for whose cause this evil was upon them: or rather, as the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for what this evil is upon us;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and so Noldius (f) renders the words; for their inquiry was not about the person for whose cause it was; that was determined by the lot; but on what account it was; what sin it was he had been guilty of, which was the cause of it; for they supposed some great sin must be committed, that had brought down the vengeance of God in such a manner: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "what is thine occupation? trade or business? this question they put, to know whether he had any, or was an idle man; or rather, whether it was an honest and lawful employment; whether it was by fraud or violence, by thieving and stealing, he got his livelihood; or by conjuring, and using the magic art: or else the inquiry was about his present business, what he was going about; what he was to do at Tarshish when he came there; whether he was not upon some ill design, and sent on an unlawful errand, and going to do some ill thing, for which vengeance pursued him, and stopped him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and whence comest thou? what is thy country? and of what people art thou? which questions seem to relate to the same thing, what nation he was of; and put by different persons, who were eager to learn what countryman he was, that they might know who was the God he worshipped, and guess at the crime he had been guilty of. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Concordant. Part. Ebr. p. 182. No. 828. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Concordant. Part. Ebr. p. 182. No. 828. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then said they unto him, Tell us, we pray thee, for whose cause this evil is upon us; What is thine occupation? and whence comest thou? what is thy country? and of what people art thou?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for whose cause",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The lot has detected Jonah, but they will not condemn him unheard. They will give him an opportunity of clearing himself, or like Achan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 7:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), of making confession with his own lips. The judicial fairness and calmness of these heathen men, their abstinence from anger and reproach for the wrong done them, their sense of the sanctity of human life, their fear of punishing the innocent, are very strikingly brought out in the whole of this exciting scene.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Even in their supreme danger the mariners were anxious not only to avoid all violence, but all haste. While the fury of the waves and the tempest constantly increased, and every instant was precious to those who prized their lives, they patiently instituted an investigation with almost judicial calmness. Though fully trusting to the reality of the decision by lot, they were resolved neither to execute the judgment without the offender’s confession, nor to execute it in an arbitrary manner.” Kalisch, who quotes the words of Philo: “One might see in the scene a terrible tribunal: for the ship was the court of justice, the judges were the sailors, the executioners were the winds, the prisoner at the bar was the prophet, the house of correction and prison of safe keeping was the whale, and the accuser was the angry sea.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What is thine occupation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] This crowding together of questions in their excitement is very true to nature. It has been compared with the well-known passage in Virgil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Æn.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " VIII. 112–114.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The mariners having, as they supposed, discovered the culprit, proceed calmly to investigate his guilt; amid the roaring of the tempest and the peril that surrounded them, they give him every opportunity of clearing himself or confessing his crime. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For whose cause",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some manuscripts of the Hebrew and the Greek omit this clause as unnecessary; but, as Keil remarks, it is not superfluous, the sailors thereby wishing to induce Jonah to confess his guilt with his own mouth. In their excitement they crowd question upon question, asking him about his business, his journey, his country, his parentage. Jerome notes the pregnant brevity of these inquiries, and compares Virgil, 'AEneid,' 8:112, etc. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"Juvenes, quae causa subegitIgnotas tentare vias? quo tenditis? inquit.Qui genus? unde domo? pacemne huc fertis an arma?\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Juvenes, quae causa subegit",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Ignotas tentare vias? quo tenditis? inquit.",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Qui genus? unde domo? pacemne huc fertis an arma?\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"Warriors, what cause constrained you thus to temptA path untrodden? Whither are ye bound?What is your race? Where dwell ye?Peace or war, Come ye to bring?\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Warriors, what cause constrained you thus to tempt",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "A path untrodden? Whither are ye bound?",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "What is your race? Where dwell ye?",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Peace or war, Come ye to bring?\"",
            "children": []
          }
        ]
      },
      {
        "element": "br",
        "class": "",
        "text": "",
        "children": []
      },
      {
        "element": "br",
        "class": "",
        "text": "",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "note_acc",
        "text": "Comp. Hom., 'Od.,' 1:170.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What is thine occupation?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His occupation, they thought, might have been one to excite the wrath of the gods; or his country and family might have been exposed to the hatred of Heaven; hence the succeeding questions. Jonah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the danger was at its height, the upper-steersman, or ship's captain (rabh hachōbhēl, the chief of the ship's governors; chōbhēl with the article is a collective noun, and a denom. from chebhel, a ship's cable, hence the one who manages, steers, or guides the ship), wakes him with the words, \"How canst thou sleep soundly? Arise, and call upon thy God; perhaps God (hâ'ĕlōhı̄m with the article, 'the true God') will think of us, that we may not perish.\" The meaning of יתעשּׁת is disputed. As עשׁת is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the sense of shining (viz., of fat), Calvin and others (last of all, Hitzig) have maintained that the hithpael has the meaning, shown himself shining, i.e., bright (propitious); whilst others, including Jerome, prefer the meaning think again, which is apparently better supported than the former, not only by the Chaldee, but also by the nouns עשׁתּוּת (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and עשׁתּון (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 146:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). God's thinking of a person involves the idea of active assistance. For the thought itself, compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The fact that Jonah obeyed this awakening call is passed over as self-evident; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the narrative proceeds to relate, that as the storm had not abated in the meantime, the sailors, firmly believing that some one in the ship had committed a crime which had excited the anger of God that was manifesting itself in the storm, had recourse to the lot to find out the culprit. בּשׁלּמי  equals  בּאשׁר למי (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as שׁ is the vulgar, and in conversation the usual contraction for אשׁר: \"on account of whom\" (בּאשׁר, in this that  equals  because, or followed by ל, on account of). הרעה, the misfortune (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), - namely, the storm which is threatening destruction. The lot fell upon Jonah. \"The fugitive is taken by lot, not from any virtue in lots themselves, least of all the lots of heathen, but by the will of Him who governs uncertain lots\" (Jerome).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When Jonah had been singled out by the lot as the culprit, the sailors called upon him to confess his guilt, asking him at the same time about his country, his occupation, and his parentage. The repetition of the question, on whose account this calamity had befallen them, which is omitted in the lxx (Vatic.), the Socin. prophets, and Cod. 195 of Kennicott, is found in the margin in Cod. 384, and is regarded by Grimm and Hitzig as a marginal gloss that has crept into the text. It is not superfluous, however; still less does it occasion any confusion; on the contrary, it is quite in order. The sailors wanted thereby to induce Jonah to confess with his own mouth that he was guilty, now that the lot had fallen upon him, and to disclose his crime (Ros. and others). As an indirect appeal to confess his crime, it prepares the way for the further inquiries as to his occupation, etc. They inquired about this occupation, because it might be a disreputable one, and one which excited the wrath of the gods; also about his parentage, and especially about the land and people from which he sprang, that they might be able to pronounce a safe sentence upon his crime. ",
        "children": []
      }
    ]
  }
]