[{"header":"Isaac Is Born"},{"num":21,"verse":"The Lord was gracious to Sarah, just as he had said he would be. The Lord did for Sarah what he had promised to do. "},{"num":2,"verse":"Sarah became pregnant. She had a son by Abraham when he was old. The child was born at the exact time God had promised. "},{"num":3,"verse":"Abraham gave the name Isaac to the son Sarah had by him. "},{"num":4,"verse":"When his son Isaac was eight days old, Abraham circumcised him. He did it exactly as God had commanded him. "},{"num":5,"verse":"Abraham was 100 years old when his son Isaac was born to him."},{"num":6,"verse":"Sarah said, “God has given laughter to me. Everyone who hears about this will laugh with me.” "},{"num":7,"verse":"She also said, “Who would have said to Abraham that Sarah would breast-feed children? But I’ve had a son by him when he is old.”"},{"header":"Abraham Sends Hagar and Ishmael Away"},{"num":8,"verse":"Isaac grew. The time came for his mother to stop breast-feeding him. On that day Abraham prepared a big celebration. "},{"num":9,"verse":"But Sarah saw Ishmael making fun of Isaac. Ishmael was the son Hagar had by Abraham. Hagar was Sarah’s Egyptian slave. "},{"num":10,"verse":"Sarah said to Abraham, “Get rid of that slave woman! Get rid of her son! That woman’s son will never have a share of the family’s property. All of it belongs to my son Isaac.”"},{"num":11,"verse":"What Sarah said upset Abraham very much. After all, Ishmael was his son. "},{"num":12,"verse":"But God said to Abraham, “Do not be so upset about the boy and your slave Hagar. Listen to what Sarah tells you, because your family line will continue through Isaac. "},{"num":13,"verse":"I will also make the son of your slave into a nation. I will do it because he is your child.”"},{"num":14,"verse":"Early the next morning Abraham got some food and a bottle of water. The bottle was made out of animal skin. He gave the food and water to Hagar, placing them on her shoulders. Then he sent her away with the boy. She went on her way and wandered in the Desert of Beersheba."},{"num":15,"verse":"When the water in the bottle was gone, she put the boy under a bush. "},{"num":16,"verse":"Then she sat down about as far away as a person can shoot an arrow. She thought, “I can’t stand to watch the boy die.” As she sat there, she began to sob."},{"num":17,"verse":"God heard the boy crying. Then the angel of God called out to Hagar from heaven. He said to her, “What is the matter, Hagar? Do not be afraid. God has heard the boy crying as he lies there. "},{"num":18,"verse":"Lift up the boy and take him by the hand. I will make him into a great nation.”"},{"num":19,"verse":"Then God opened Hagar’s eyes, and she saw a well of water. So she went and filled the bottle with water and gave the boy a drink."},{"num":20,"verse":"God was with the boy as he grew up. He lived in the desert and learned to shoot a bow and arrow. "},{"num":21,"verse":"While he was living in the Desert of Paran, his mother got a wife for him from Egypt."},{"header":"The Agreement at Beersheba"},{"num":22,"verse":"At that time Abimelek and his army commander, Phicol, spoke to Abraham. They said to Abraham, “God is with you in everything you do. "},{"num":23,"verse":"Now make a promise to me here while God is watching. Give me your word that you will treat me fairly. Promise that you will treat my children and their children the same way. I’ve been kind to you. Now you be kind to me and the country where you are living as an outsider.”"},{"num":24,"verse":"Abraham said, “I give you my word that I’ll do it.”"},{"num":25,"verse":"Then Abraham complained to Abimelek that his servants had taken over a well of water. "},{"num":26,"verse":"But Abimelek said, “I don’t know who has done this. You didn’t tell me. And today is the first time I heard about it.”"},{"num":27,"verse":"So Abraham gave Abimelek sheep and cattle. The two men came to an agreement. "},{"num":28,"verse":"Then Abraham picked out seven female lambs from his flock. "},{"num":29,"verse":"Abimelek asked Abraham, “What’s the meaning of these seven female lambs? Why have you picked them out and set them apart?”"},{"num":30,"verse":"Abraham replied, “Accept the seven lambs from me. They will be a witness that I dug this well.”"},{"num":31,"verse":"So that place was named Beersheba. That’s because there the two men came to an agreement."},{"num":32,"verse":"After the agreement had been made at Beersheba, Abimelek went back to the land of the Philistines. His army commander, Phicol, went with him. "},{"num":33,"verse":"Abraham planted a tamarisk tree in Beersheba. There he called on the name of the Lord, the God who lives forever. "},{"num":34,"verse":"Abraham stayed in the land of the Philistines for a long time."}]