[{"num":1,"verse":"Then God did as he had promised, and Sarah became pregnant and gave Abraham a baby son in his old age, at the time God had said; "},{"num":3,"verse":"and Abraham named him Isaac (meaning “Laughter!”). "},{"num":4,"verse":"Eight days after he was born, Abraham circumcised him, as God required. (Abraham was 100 years old at that time.)"},{"num":6,"verse":"And Sarah declared, “God has brought me laughter! All who hear about this shall rejoice with me. "},{"num":7,"verse":"For who would have dreamed that I would ever have a baby? Yet I have given Abraham a child in his old age!”"},{"num":8,"verse":"Time went by and the child grew and was weaned; and Abraham gave a party to celebrate the happy occasion. "},{"num":9,"verse":"But when Sarah noticed Ishmael—the son of Abraham and the Egyptian girl Hagar—teasing Isaac, "},{"num":10,"verse":"she turned upon Abraham and demanded, “Get rid of that slave girl and her son. He is not going to share your property with my son. I won’t have it.”"},{"num":11,"verse":"This upset Abraham very much, for after all, Ishmael too was his son."},{"num":12,"verse":"But God told Abraham, “Don’t be upset over the boy or your slave-girl wife; do as Sarah says, for Isaac is the son through whom my promise will be fulfilled. "},{"num":13,"verse":"And I will make a nation of the descendants of the slave girl’s son, too, because he also is yours.”"},{"num":14,"verse":"So Abraham got up early the next morning, prepared food for the journey, and strapped a canteen of water to Hagar’s shoulders and sent her away with their son. She walked out into the wilderness of Beersheba, wandering aimlessly."},{"num":15,"verse":"When the water was gone she left the youth in the shade of a bush "},{"num":16,"verse":"and went off and sat down a hundred yards or so away. “I don’t want to watch him die,” she said, and burst into tears, sobbing wildly."},{"num":17,"verse":"Then God heard the boy crying, and the Angel of God called to Hagar from the sky, “Hagar, what’s wrong? Don’t be afraid! For God has heard the lad’s cries as he is lying there. "},{"num":18,"verse":"Go and get him and comfort him, for I will make a great nation from his descendants.”"},{"num":19,"verse":"Then God opened her eyes and she saw a well; so she refilled the canteen and gave the lad a drink. "},{"num":20,"verse":"And God blessed the boy and he grew up in the wilderness of Paran, and became an expert archer. And his mother arranged a marriage for him with a girl from Egypt."},{"num":22,"verse":"About this time King Abimelech and Phicol, commander of his troops, came to Abraham and said to him, “It is evident that God helps you in everything you do; "},{"num":23,"verse":"swear to me by God’s name that you won’t defraud me or my son or my grandson, but that you will be on friendly terms with my country, as I have been toward you.”"},{"num":24,"verse":"Abraham replied, “All right, I swear to it!” "},{"num":25,"verse":"Then Abraham complained to the king about a well the king’s servants had taken violently away from Abraham’s servants."},{"num":26,"verse":"“This is the first I’ve heard of it,” the king exclaimed, “and I have no idea who is responsible. Why didn’t you tell me before?”"},{"num":27,"verse":"Then Abraham gave sheep and oxen to the king, as sacrifices to seal their pact."},{"num":28,"verse":"But when he took seven ewe lambs and set them off by themselves, the king inquired, “Why are you doing that?”"},{"num":30,"verse":"And Abraham replied, “They are my gift to you as a public confirmation that this well is mine.”"},{"num":31,"verse":"So from that time on the well was called Beer-sheba (“Well of the Oath”), because that was the place where they made their covenant. "},{"num":32,"verse":"Then King Abimelech and Phicol, commander of his army, returned home again. "},{"num":33,"verse":"And Abraham planted a tamarisk tree beside the well and prayed there to the Lord, calling upon the Eternal God. "},{"num":34,"verse":"And Abraham lived in the Philistine country for a long time."}]