[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:20-32 As Israel was a people not to be numbered among the nations, so Levi was a tribe to be distinguished from the rest. Those who have God for their Inheritance and their Portion for ever, ought to look with holy contempt and indifference upon the possessions of this world. The Levites were to give God his dues out of their tithes, as well as the Israelites out of their increase. See, in ver. 31, the way to have comfort in all our worldly possessions, so as to bear no sin by reason of them. 1. We must be sure that what we have is got honestly and in the service of God. That meat is best eaten which is first earned; but if any will not work, neither shall he eat, 2Th 3:10. 2. We must be sure that God has his dues out of it. We have the comfort of our substance, when we have honoured the Lord with it. Ye shall bear no sin by reason of it, when ye have heaved the best from it. We should give alms of such things as we have, that all may be holy and comfortable to us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Reckoned unto you - Or, by you. The Levites were, of their tithes, to pay tithe to the priests, just as other Israelites paid tithe to the Levites. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26. the Levites … offer … a tenth of the tithe—Out of their own they were to pay tithes to the priests equally as the people gave to them. The best of their tithes was to be assigned to the priests, and afterwards they enjoyed the same liberty to make use of the remainder that other Israelites had of the produce of their threshing-floors and wine-presses.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " And to his children, which were one with him, and were all to have their share herein. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus you also shall offer an heave offering unto the Lord,.... As the Israelites did when they paid tithes to them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of all your tithes which ye receive of the children of Israel; which heave offering was a tenth part of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and ye shall give thereof the Lord's heave offering to Aaron the priest; that is, the said tenth part of the tithe was to be given not to Aaron only, as the high priest, as some have thought, and so to his successors in the high priesthood; but to him and his sons, even to all the priests in common, the high priest having his share of it; and Josephus (o) is clear for it, that the tithe of the annual fruits was paid to the Levites, and to the priests. Hecataeus, an Heathen writer, who lived in the times of Alexander the great, says (p), that all the priests of the Jews received the tenth of whatsoever was produced, and ministered things in common, and were 1500 in number. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Antiqu. l. 4. c. 4. sect. 3.((p) Apud Joseph. contr. Apion. l. 1. sect. 22. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) Antiqu. l. 4. c. 4. sect. 3.((p) Apud Joseph. contr. Apion. l. 1. sect. 22. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thus ye also shall offer an heave offering unto the LORD of all your tithes, which ye receive of the children of Israel; and ye shall give thereof the LORD's heave offering to Aaron the priest.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall give thereof the Lord's heave offering to Aaron the priest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Levites tithed the people, the priests tithed the Levites. At this time the other Israelites were nearly fifty times as numerous as the Levites, and therefore they would have been exceptionally well provided for. It must be remembered, however, that the Levites would naturally increase faster than the rest, not being exposed to the same dangers; and still more that tithes are never paid at all fully or generally, even when of strict legal obligation. A glance along the history of Israel after the conquest will satisfy us that at no time could the people at large be trusted to pay their tithes, unless it were during the ascendancy of the Maccabees, and afterwards under the influence of the Pharisees (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:9, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Levites, indeed, appear in the history of Israel as the reverse of an opulent or influential class. It was no doubt much easier for the sons of Aaron to obtain their tithes from the Levites; and as these were very numerous in proportion, and the tithes themselves were only a part of their revenues, the priests should have been, and in later times certainly were, sufficiently rich. If they were devout they no doubt spent much on the service of the altar and of the sanctuary. Numbers 18:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Appropriation of the Tithe. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When the Levites took (received) from the people the tithe assigned them by Jehovah, they were to lift off from it a heave-offering for Jehovah, a tithe of the tithe for Aaron the priest (i.e., for the priesthood; see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"Your heave-offering shall be reckoned to you as the corn of the threshing-floor, and the fulness (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the wine-press,\" i.e., according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the revenue of the threshing-floor and wine-press; that is to say, as corn and wine which they had reaped themselves. ",
        "children": []
      }
    ]
  }
]