[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(32) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And ye shall bear no sin . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "shall not incur any guilt, or become liable to any punishment. (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 18:32",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Neither shall ye pollute the holy things ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As you will do, if you abuse their holy offerings, by reserving that entirely to yourselves which they offer to God, to be disposed as he hath appointed, namely, part to you, and part to the priests. Thus we learn in what manner God regulated the offices of the priests and Levites, and how he provided for their subsistence. The tribe of Levi had no part nor inheritance in the land of Canaan as the other tribes had; but had for their share the tithes of the whole country; and the priests, in particular, had their portions of the sacrifices and offerings, and a tenth part of the tithes. By these means the ministers of religion were supported in a comfortable, decent manner, without being forced to neglect the duties of their function to provide for the necessities of the body. This proves that, in the Christian Church, provision should be made for the maintenance of those that serve in the sacred ministry, as St. Paul teaches: “They which minister about holy things, live by the things of the temple; and they which wait at the altar are partakers with the altar; even so hath the Lord ordained that they which preach the gospel, should live by the gospel.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:20-32 As Israel was a people not to be numbered among the nations, so Levi was a tribe to be distinguished from the rest. Those who have God for their Inheritance and their Portion for ever, ought to look with holy contempt and indifference upon the possessions of this world. The Levites were to give God his dues out of their tithes, as well as the Israelites out of their increase. See, in ver. 31, the way to have comfort in all our worldly possessions, so as to bear no sin by reason of them. 1. We must be sure that what we have is got honestly and in the service of God. That meat is best eaten which is first earned; but if any will not work, neither shall he eat, 2Th 3:10. 2. We must be sure that God has his dues out of it. We have the comfort of our substance, when we have honoured the Lord with it. Ye shall bear no sin by reason of it, when ye have heaved the best from it. We should give alms of such things as we have, that all may be holy and comfortable to us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Neither shall ye pollute ... - Rather, and by not polluting the holy things of the children of Israel, ye shall not die. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32. ye shall bear no sin by reason of it, &c.—Neglect in having the best entailed sin in the use of such unhallowed food. And the holy things would be polluted by the reservation to themselves of what should be offered to God and the priests.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The best of it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " implying, that if they neglected this duty, they sinned in the use of such unhallowed food. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither shall ye pollute the holy things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as you will do, if you abuse their holy offerings, by reserving that entirely to yourselves which they offer to God to be disposed as he hath appointed, to wit, part to you, and part to the priests. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And ye shall bear no sin by reason of it,.... Shall have no blame laid upon them, or guilt imputed to them, or punishment inflicted on them, on account of their having and enjoying their tithes and gifts: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when ye have heaved from it the best of it; took out the tenth, and that the best, and given it to the priests; or otherwise they would be blameworthy, guilty, and liable to punishment: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither shall ye pollute the holy things of the children of Israel; the gifts they have given for holy uses, and so are holy; which would be the case if they ate of them, or enjoyed them, without giving the priests the tenth part of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lest ye die; for it seems such a neglect was punishable with death. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lest ye die; for it seems such a neglect was punishable with death. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And ye shall {f} bear no sin by reason of it, when ye have heaved from it the best of it: neither shall ye pollute the holy {t} things of the children of Israel, lest ye die.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And ye shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " bear no sin by reason of it, when ye have heaved from it the best of it: neither shall ye pollute the holy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{t}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " things of the children of Israel, lest ye die.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) You shall not be punished therefore.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) The offerings which the Israelites have offered to God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "profane the holy things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. the tithe of the tithe, which they would profane if they did not give it to the priests.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 32.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye shall bear no sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עָלָיו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לֹא־תִשְׂאוּ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They would not incur any guilty responsibility by enjoying it as and where they pleased. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither shall ye",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "pollute the holy things of the children of Israel, lest ye die.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This seems to be the tree translation, and it conveyed a final warning. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 22:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for one very obvious way in which the Levites might pollute \"holy things.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Numbers 18:32",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They would load no sin upon themselves by so doing (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), if they only lifted off the best as tithe (for the priest), and did not desecrate the holy gifts, sc., by eating in all kinds of places, which was not allowed, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with regard to the most holy gifts. These regulations concerning the revenues of the priests and Levites were in perfect accordance with the true idea of the Israelitish kingdom of God. Whereas in heathen states, where there was an hereditary priestly caste, that caste was generally a rich one, and held a firm possession in the soil (in Egypt, for example; see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the Levites received no hereditary landed property in the land of Israel, but only towns to dwell in among the other tribes, with pasturage for their cattle (ch. 35), because Jehovah, the God of Israel, would be their inheritance. In this way their earthly existence as based upon the spiritual ground and soil of faith, in accordance with the calling assigned them to be the guardians and promoters of the commandments, statutes, and rights of Jehovah; and their authority and influence among the people were bound up with their unreserved surrender of themselves to the Lord, and their firm reliance upon the possession of their God. Now, whilst this position was to be a constant incitement to the Levites to surrender themselves entirely to the Lord and His service, it was also to become to the whole nation a constant admonition, inasmuch as it was a prerogative conferred upon them by the Lord, to seek the highest of all good in the possession of the Lord, as its portion and inheritance. - The revenue itself, however, which the Lord assigned to the Levites and priests, as His servants, consisting of the tenths and first-fruits, as well as certain portions of the different sacrificial gifts that were offered to Him, appears to have been a very considerable one, especially if we adopt the computation of J. D. Michaelis (Mos. Recht. i. 52) with reference to the tithes. \"A tribe,\" he says, \"which had only 22,000 males in it (23,000 afterwards), and therefore could hardly have numbered more than 12,000 grown-up men, received the tithes of 600,000 Israelites; consequently one single Levite, without the slightest necessity for sowing, and without any of the expenses of agriculture, reaped or received from the produce of the flocks and herds as much as five of the other Israelites.\" But this leaves out of sight the fact that tithes are never paid so exactly as this, and that no doubt there was as little conscientiousness in the matter then as there is at the present day, when those who are entitled to receive a tenth often receive even less than a twentieth. Moreover, the revenue of the tribe, which the Lord had chosen as His own peculiar possession, was not intended to be a miserable and beggarly one; but it was hardly equal, at any time, to the revenues which the priestly castes of other nations derived from their endowments. Again, the Levites had to give up the tenth of all the tithes they received to the priests; and the priests were to offer to Jehovah upon the altar a portion of the first-fruits, heave-offerings, and wave-offerings that were assigned to them. Consequently, as the whole nation was to make a practical acknowledgment, in the presentation of the tithe and first-fruits, that it had received its hereditary property as a fief from the Lord its God, so the Levites, by their payment of the tenth to the priests, and the priests, by presenting a portion of their revenues upon the altar, were to make a practical confession that they had received all their revenues from the Lord their God, and owed Him praise and adoration in return (see Bhr, Symbolik, ii. pp. 43ff.). ",
        "children": []
      }
    ]
  }
]