[{"header":"The Seventh Day—Rest"},{"num":2,"verse":"So the sky, the earth, and all that filled them were finished. "},{"num":2,"verse":"By the seventh day God finished the work he had been doing, so he rested from all his work. "},{"num":3,"verse":"God blessed the seventh day and made it a holy day, because on that day he rested from all the work he had done in creating the world."},{"header":"The First People"},{"num":4,"verse":"This is the story of the creation of the sky and the earth. When the Lord God first made the earth and the sky, "},{"num":5,"verse":"there were still no plants on the earth. Nothing was growing in the fields because the Lord God had not yet made it rain on the land. And there was no person to care for the ground, "},{"num":6,"verse":"but a mist would rise up from the earth and water all the ground."},{"num":7,"verse":"Then the Lord God took dust from the ground and formed a man from it. He breathed the breath of life into the man’s nose, and the man became a living person. "},{"num":8,"verse":"Then the Lord God planted a garden in the east, in a place called Eden, and put the man he had formed into it. "},{"num":9,"verse":"The Lord God caused every beautiful tree and every tree that was good for food to grow out of the ground. In the middle of the garden, God put the tree that gives life and also the tree that gives the knowledge of good and evil."},{"num":10,"verse":"A river flowed through Eden and watered the garden. From there the river branched out to become four rivers. "},{"num":11,"verse":"The first river, named Pishon, flows around the whole land of Havilah, where there is gold. "},{"num":12,"verse":"The gold of that land is excellent. Bdellium and onyx are also found there. "},{"num":13,"verse":"The second river, named Gihon, flows around the whole land of Cush. "},{"num":14,"verse":"The third river, named Tigris, flows out of Assyria toward the east. The fourth river is the Euphrates."},{"num":15,"verse":"The Lord God put the man in the garden of Eden to care for it and work it. "},{"num":16,"verse":"The Lord God commanded him, “You may eat the fruit from any tree in the garden, "},{"num":17,"verse":"but you must not eat the fruit from the tree which gives the knowledge of good and evil. If you ever eat fruit from that tree, you will die!”"},{"header":"The First Woman"},{"num":18,"verse":"Then the Lord God said, “It is not good for the man to be alone. I will make a helper who is right for him.”"},{"num":19,"verse":"From the ground God formed every wild animal and every bird in the sky, and he brought them to the man so the man could name them. Whatever the man called each living thing, that became its name. "},{"num":20,"verse":"The man gave names to all the tame animals, to the birds in the sky, and to all the wild animals. But Adam did not find a helper that was right for him. "},{"num":21,"verse":"So the Lord God caused the man to sleep very deeply, and while he was asleep, God removed one of the man’s ribs. Then God closed up the man’s skin at the place where he took the rib. "},{"num":22,"verse":"The Lord God used the rib from the man to make a woman, and then he brought the woman to the man."},{"num":23,"verse":"And the man said,"},{"num":24,"verse":"So a man will leave his father and mother and be united with his wife, and the two will become one body."},{"num":25,"verse":"The man and his wife were naked, but they were not ashamed."}]