[{"num":5,"verse":"Therefore, since we are justified (acquitted, declared righteous, and given a right standing with God) through faith, let us [grasp the fact that we] have [the peace of reconciliation to hold and to enjoy] peace with God through our Lord Jesus Christ (the Messiah, the Anointed One)."},{"num":2,"verse":"Through Him also we have [our] access (entrance, introduction) by faith into this grace (state of God’s favor) in which we [firmly and safely] stand. And let us rejoice and exult in our hope of experiencing and enjoying the glory of God."},{"num":3,"verse":"Moreover [let us also be full of joy now!] let us exult and triumph in our troubles and rejoice in our sufferings, knowing that pressure and affliction and hardship produce patient and unswerving endurance."},{"num":4,"verse":"And endurance (fortitude) develops maturity of character (approved faith and tried integrity). And character [of this sort] produces [the habit of] joyful and confident hope of eternal salvation."},{"num":5,"verse":"Such hope never disappoints or deludes or shames us, for God’s love has been poured out in our hearts through the Holy Spirit Who has been given to us."},{"num":6,"verse":"While we were yet in weakness [powerless to help ourselves], at the fitting time Christ died for (in behalf of) the ungodly."},{"num":7,"verse":"Now it is an extraordinary thing for one to give his life even for an upright man, though perhaps for a noble and lovable and generous benefactor someone might even dare to die."},{"num":8,"verse":"But God shows and clearly proves His [own] love for us by the fact that while we were still sinners, Christ (the Messiah, the Anointed One) died for us."},{"num":9,"verse":"Therefore, since we are now justified (acquitted, made righteous, and brought into right relationship with God) by Christ’s blood, how much more [certain is it that] we shall be saved by Him from the indignation and wrath of God."},{"num":10,"verse":"For if while we were enemies we were reconciled to God through the death of His Son, it is much more [certain], now that we are reconciled, that we shall be saved (daily delivered from sin’s dominion) through His [resurrection] life."},{"num":11,"verse":"Not only so, but we also rejoice and exultingly glory in God [in His love and perfection] through our Lord Jesus Christ, through Whom we have now received and enjoy [our] reconciliation."},{"num":12,"verse":"Therefore, as sin came into the world through one man, and death as the result of sin, so death spread to all men, [no one being able to stop it or to escape its power] because all men sinned."},{"num":13,"verse":"[To be sure] sin was in the world before ever the Law was given, but sin is not charged to men’s account where there is no law [to transgress]."},{"num":14,"verse":"Yet death held sway from Adam to Moses [the Lawgiver], even over those who did not themselves transgress [a positive command] as Adam did. Adam was a type (prefigure) of the One Who was to come [in reverse, the former destructive, the Latter saving]."},{"num":15,"verse":"But God’s free gift is not at all to be compared to the trespass [His grace is out of all proportion to the fall of man]. For if many died through one man’s falling away (his lapse, his offense), much more profusely did God’s grace and the free gift [that comes] through the undeserved favor of the one Man Jesus Christ abound and overflow to and for [the benefit of] many."},{"num":16,"verse":"Nor is the free gift at all to be compared to the effect of that one [man’s] sin. For the sentence [following the trespass] of one [man] brought condemnation, whereas the free gift [following] many transgressions brings justification (an act of righteousness)."},{"num":17,"verse":"For if because of one man’s trespass (lapse, offense) death reigned through that one, much more surely will those who receive [God’s] overflowing grace (unmerited favor) and the free gift of righteousness [putting them into right standing with Himself] reign as kings in life through the one Man Jesus Christ (the Messiah, the Anointed One)."},{"num":18,"verse":"Well then, as one man’s trespass [one man’s false step and falling away led] to condemnation for all men, so one Man’s act of righteousness [leads] to acquittal and right standing with God and life for all men."},{"num":19,"verse":"For just as by one man’s disobedience (failing to hear, heedlessness, and carelessness) the many were constituted sinners, so by one Man’s obedience the many will be constituted righteous (made acceptable to God, brought into right standing with Him)."},{"num":20,"verse":"But then Law came in, [only] to expand and increase the trespass [making it more apparent and exciting opposition]. But where sin increased and abounded, grace (God’s unmerited favor) has surpassed it and increased the more and superabounded,"},{"num":21,"verse":"So that, [just] as sin has reigned in death, [so] grace (His unearned and undeserved favor) might reign also through righteousness (right standing with God) which issues in eternal life through Jesus Christ (the Messiah, the Anointed One) our Lord."}]