[{"header":"Right With God"},{"num":5,"verse":"We have been made right with God because of our faith. So we have peace with God through our Lord Jesus Christ."},{"num":2,"verse":"Through our faith, Christ has brought us into that blessing of God’s grace that we now enjoy. And we are very happy because of the hope we have of sharing God’s glory."},{"num":3,"verse":"And we are also happy with the troubles we have. Why are we happy with troubles? Because we know that these troubles make us more patient."},{"num":4,"verse":"And this patience is proof that we are strong. And this proof gives us hope."},{"num":5,"verse":"And this hope will never disappoint us. We know this because God has poured out his love to fill our hearts through the Holy Spirit he gave us."},{"num":6,"verse":"Christ died for us when we were unable to help ourselves. We were living against God, but at just the right time Christ died for us."},{"num":7,"verse":"Very few people will die to save the life of someone else, even if it is for a good person. Someone might be willing to die for an especially good person."},{"num":8,"verse":"But Christ died for us while we were still sinners, and by this God showed how much he loves us."},{"num":9,"verse":"We have been made right with God by the blood sacrifice of Christ. So through Christ we will surely be saved from God’s anger."},{"num":10,"verse":"I mean that while we were God’s enemies, he made friends with us through his Son’s death. And the fact that we are now God’s friends makes it even more certain that he will save us through his Son’s life."},{"num":11,"verse":"And not only will we be saved, but we also rejoice right now in what God has done for us through our Lord Jesus Christ. It is because of Jesus that we are now God’s friends."},{"header":"Adam and Christ"},{"num":12,"verse":"Sin came into the world because of what one man did. And with sin came death. So this is why all people must die—because all people have sinned."},{"num":13,"verse":"Sin was in the world before the Law of Moses. But God does not consider people guilty of sin if there is no law."},{"num":14,"verse":"But from the time of Adam to the time of Moses, everyone had to die. Adam died because he sinned by not obeying God’s command. But even those who did not sin that same way had to die."},{"num":15,"verse":"But God’s free gift is not like Adam’s sin. Many people died because of the sin of that one man. But the grace that people received from God was much greater. Many received God’s gift of life by the grace of this other man, Jesus Christ."},{"num":16,"verse":"After Adam sinned once, he was judged guilty. But the gift of God is different. His free gift came after many sins, and it makes people right with him."},{"num":17,"verse":"One man sinned, and so death ruled all people because of that one man. But now some people accept God’s full grace and his great gift of being made right. Surely they will have true life and rule through the one man, Jesus Christ."},{"num":18,"verse":"So that one sin of Adam brought the punishment of death to all people. But in the same way, Christ did something so good that it makes all people right with God. And that brings them true life."},{"num":19,"verse":"One man disobeyed God and many became sinners. But in the same way, one man obeyed God and many will be made right."},{"num":20,"verse":"The law was brought in so that more people would sin the way Adam did. But where sin increased, there was even more of God’s grace."},{"num":21,"verse":"Sin once used death to rule us. But God gave us more of his grace so that grace could rule by making us right with him. And this brings us eternal life through Jesus Christ our Lord."}]