[{"num":5,"verse":"Then, being justified by faith, we have peace with God, through our Lord Jesus Christ,"},{"num":2,"verse":"by Whom, through faith, we also have access into this grace wherein we stand and rejoice in the hope of the glory of God."},{"num":3,"verse":"Not only that, but we also rejoice in tribulations, knowing that tribulation brings forth patience;"},{"num":4,"verse":"and patience, experience; and experience, hope;"},{"num":5,"verse":"and hope does not humiliate. Because the Holy Ghost, Who is given to us, drenches our hearts with the love of God."},{"num":6,"verse":"For Christ, when we were still without strength, at His time, died for the ungodly."},{"num":7,"verse":"Doubtless, one will scarcely die for a righteous man. Although, for a good man it may be that one dare die."},{"num":8,"verse":"But God exhibits his love towards us, in that while we were still sinners, Christ died for us."},{"num":9,"verse":"Much more, then, being justified now by His blood, we shall be saved from wrath through Him."},{"num":10,"verse":"For if, when we were enemies, we were reconciled to God by the death of his Son, much more so (being reconciled) shall we be saved by his life."},{"num":11,"verse":"And not only that, but we also boast in God, through our Lord Jesus Christ, by Whom we have now received reconciliation."},{"num":12,"verse":"Therefore, just as by one man, sin entered into the world, and death by sin, so also death spread to all mankind. For all mankind has sinned."},{"num":13,"verse":"For until the time of the Law, sin was in the world. But sin was not taken into account while there was no Law."},{"num":14,"verse":"But death reigned from Adam to Moses, even over those who did not sin in a similar way to the transgression of Adam, who was the model of Him Who was to come."},{"num":15,"verse":"But still, the gift is not like the offense. For if, through the offense of the one, many died, much more so has the grace of God, and the gift (by grace) of the one man, Jesus Christ, abounded to many."},{"num":16,"verse":"Nor is the gift as if it were from one who sinned. Indeed, judgment unto condemnation came from one. But the gift unto justification came from many offenses."},{"num":17,"verse":"For if, by the offense of one, death reigned through one, much more so shall those who receive the abundance of grace, and the gift of righteousness, reign in life through One - Jesus Christ."},{"num":18,"verse":"Likewise then, as by the offense of one, judgment unto condemnation came to all mankind, so also by the righteousness of One, the benefit abounded toward all mankind, to the justification of life."},{"num":19,"verse":"For, as by one man’s disobedience, many were made sinners, so also by the obedience of One, shall many be made righteous."},{"num":20,"verse":"Moreover, there the Law entered, so that offense might abound. Nevertheless, where sin abounded, grace abounded much more."},{"num":21,"verse":"So that, as sin had reigned unto death, so also might grace reign by righteousness unto eternal life, through Jesus Christ our Lord."}]