[{"header":"Our New Life"},{"num":5,"verse":"Our faith in Jesus transfers God’s righteousness to us and he now declares us flawless in his eyes. This means we can now enjoy true and lasting peace with God, all because of what our Lord Jesus, the Anointed One, has done for us. "},{"num":2,"verse":"Our faith guarantees us permanent access into this marvelous kindness that has given us a perfect relationship with God. What incredible joy bursts forth within us as we keep on celebrating our hope of experiencing God’s glory!"},{"num":3,"verse":"But that’s not all! Even in times of trouble we have a joyful confidence, knowing that our pressures will develop in us patient endurance. "},{"num":4,"verse":"And patient endurance will refine our character, and proven character leads us back to hope. "},{"num":5,"verse":"And this hope is not a disappointing fantasy, because we can now experience the endless love of God cascading into our hearts through the Holy Spirit who lives in us!"},{"num":6,"verse":"For when the time was right, the Anointed One came and died to demonstrate his love for sinners who were entirely helpless, weak, and powerless to save themselves."},{"num":7,"verse":"Now, would anyone dare to die for the sake of a wicked person? We can all understand if someone was willing to die for a truly noble person. "},{"num":8,"verse":"But Christ proved God’s passionate love for us by dying in our place while we were still lost and ungodly!"},{"num":9,"verse":"And there is still much more to say of his unfailing love for us! For through the blood of Jesus we have heard the powerful declaration, “You are now righteous in my sight.” And because of the sacrifice of Jesus, you will never experience the wrath of God. "},{"num":10,"verse":"So if while we were still enemies, God fully reconciled us to himself through the death of his Son, then something greater than friendship is ours. Now that we are at peace with God, and because we share in his resurrection life, how much more we will be rescued from sin’s dominion!"},{"num":11,"verse":"And even more than that, we overflow with triumphant joy in our new relationship of living reconciled to God—all because of Jesus Christ!"},{"header":"The Gift of Grace Greater Than Sin"},{"num":12,"verse":"When Adam sinned, the entire world was affected. Sin entered human experience, and death was the result. And so death followed this sin, casting its shadow over all humanity, because all have sinned. "},{"num":13,"verse":"Sin was in the world before Moses gave the written law, but it was not charged against them where no law existed. "},{"num":14,"verse":"Yet death reigned as king from Adam to Moses even though they hadn’t broken a command the way Adam had. The first man, Adam, was a picture of the Messiah, who was to come."},{"num":15,"verse":"Now, there is no comparison between Adam’s transgression and the gracious gift that we experience. For the magnitude of the gift far outweighs the crime. It’s true that many died because of one man’s transgression, but how much greater will God’s grace and his gracious gift of acceptance overflow to many because of what one man, Jesus, the Messiah, did for us!"},{"num":16,"verse":"And this free-flowing gift imparts to us much more than what was given to us through the one who sinned. For because of one transgression, we are all facing a death sentence with a verdict of “Guilty!” But this gracious gift leaves us free from our many failures and brings us into the perfect righteousness of God—acquitted with the words “Not guilty!”"},{"num":17,"verse":"Death once held us in its grip, and by the blunder of one man, death reigned as king over humanity. But now, how much more are we held in the grip of grace and continue reigning as kings in life, enjoying our regal freedom through the gift of perfect righteousness in the one and only Jesus, the Messiah!"},{"num":18,"verse":"In other words, just as condemnation came upon all people through one transgression, so through one righteous act of Jesus’ sacrifice, the perfect righteousness that makes us right with God and leads us to a victorious life is now available to all. "},{"num":19,"verse":"One man’s disobedience opened the door for all humanity to become sinners. So also one man’s obedience opened the door for many to be made perfectly right with God and acceptable to him. "},{"num":20,"verse":"So then, the law was introduced into God’s plan to bring the reality of human sinfulness out of hiding. And yet, wherever sin increased, there was more than enough of God’s grace to triumph all the more! "},{"num":21,"verse":"And just as sin reigned through death, so also this sin-conquering grace will reign as king through righteousness, imparting eternal life through Jesus, our Lord and Messiah!"}]