[{"header":"Rules About Skin Diseases"},{"num":13,"verse":"The Lord said to Moses and Aaron, "},{"num":2,"verse":"“Someone might have a swelling on his skin. Or he might have a scab or a bright spot on his skin. If the sore looks like a harmful skin disease, the person must be brought to Aaron the priest. Or he must be brought to one of Aaron’s sons, the priests. "},{"num":3,"verse":"The priest must look at the sore on the person’s skin. The hair in the sore may have become white. And the sore may seem deeper than the person’s skin. If so, it is a harmful skin disease. When he has finished looking at the person, the priest must announce that the person is unclean."},{"num":4,"verse":"“Sometimes there is a white spot on a person’s skin, but the spot does not seem deeper than the skin. If that is true, and if the hair from the spot has not turned white, the priest must separate that person from other people for seven days. "},{"num":5,"verse":"On the seventh day the priest must look at the person again. He may see that the sore has not changed. It might not have spread on the skin. Then the priest must keep the person separated for seven more days. "},{"num":6,"verse":"On the seventh day the priest must look at the person again. The sore may have faded. And it may not have spread on the skin. If that is true, the priest must announce that the person is clean. The sore is only a rash. The person must wash his clothes. Then he will become clean again."},{"num":7,"verse":"“But the sore may have spread again after the priest has announced him clean. Then the person must come again to the priest. "},{"num":8,"verse":"The priest must look at him. If the rash has spread on the skin, the priest must announce that person is unclean. It is a harmful skin disease."},{"num":9,"verse":"“If a person has a harmful skin disease, he must be brought to the priest. "},{"num":10,"verse":"The priest must look at him. There might be a white swelling in the skin. And the hair may have become white. And the skin may look raw in the swelling. "},{"num":11,"verse":"If these things are true, it is a harmful skin disease. It is one that he has had for a long time. The priest must announce that the person is unclean. He will not need to separate that person from other people. This is because everyone already knows that the person is unclean."},{"num":12,"verse":"“Sometimes skin disease spreads all over a person’s body. The disease covers that person’s skin from his head to his feet, as far as the priest can see. Then the priest must look at the person’s whole body. "},{"num":13,"verse":"The priest might see that the disease covers the whole body. It might have turned all of the person’s skin white. Then the priest must announce that the person is clean."},{"num":14,"verse":"“But when the person has an open sore, he is not clean. "},{"num":15,"verse":"When the priest sees the open sore, he must announce that the person is unclean. The open sore is not clean. It is a harmful skin disease. "},{"num":16,"verse":"If the open sore becomes white again, the person must come to the priest. "},{"num":17,"verse":"The priest must look at him. If the sores have become white, the priest must announce that the person with the sores is clean. Then he will be clean."},{"num":18,"verse":"“Someone may have a boil on his skin, but it is healed. "},{"num":19,"verse":"In the place where the boil was, there might be a white swelling. Or there might be a bright red spot. This place on the skin must be shown to the priest. "},{"num":20,"verse":"And the priest must look at it. The spot might seem deeper than the skin. And the hair on it might have become white. If these things are true, the priest must announce that the person is unclean. The spot is a harmful skin disease. It has broken out from inside the boil. "},{"num":21,"verse":"But the priest must look at the spot. There might be no white hairs in it. The spot may not be deeper than the skin. And it may have faded. Then the priest must separate the person from other people for seven days. "},{"num":22,"verse":"If the spot spreads on the skin, the priest must announce that the person is unclean. It is a disease that will spread. "},{"num":23,"verse":"But the bright spot might not spread or change. Then it is only the scar from the old boil. Then the priest must announce that the person is clean."},{"num":24,"verse":"“A person might get a burn on his skin. If the open sore becomes white or red, "},{"num":25,"verse":"the priest must look at it. The white spot might seem deeper than the skin. And the hair at that spot might have become white. If these things are true, it is a harmful skin disease. The disease has broken out in the burn. Then the priest must announce that the person is unclean. It is a harmful skin disease. "},{"num":26,"verse":"But the priest must look at the spot. There might be no white hair in the bright spot. And the spot may be no deeper than the skin. It may have faded. Then the priest must separate the person from other people for seven days. "},{"num":27,"verse":"On the seventh day the priest must look at him again. If the spot has spread on the skin, the priest must announce that the person is unclean. It is a harmful skin disease. "},{"num":28,"verse":"But the bright spot may not have spread on the skin. It may have faded. Then it is the swelling from the burn. And the priest must announce that the person is clean. The spot is only a scar from the burn."},{"num":29,"verse":"“Someone might get a sore on his scalp or on his chin. "},{"num":30,"verse":"A priest must look at the sore. It may seem to be deeper than the skin. And the hair around it may be thin and yellow. If these things are true, the priest must announce that the person is unclean. It is an itch, a harmful skin disease of the head or chin. "},{"num":31,"verse":"But when the priest looks at it, the sore might not seem deeper than the skin. There might not be any black hair in it. If that is true, the priest must separate the person from other people for seven days. "},{"num":32,"verse":"On the seventh day the priest must look at the sore. It may not have spread. There may be no yellow hairs growing in it. And the sore may not seem deeper than the skin. "},{"num":33,"verse":"If these things are true, the person must shave himself. But he must not shave the sore place. The priest must separate that person from other people for seven more days. "},{"num":34,"verse":"On the seventh day the priest must look at the sore. The sore may not have spread on the skin. And it may not seem deeper than the skin. If that is true, the priest must announce that the person is clean. So the person must wash his clothes and become clean. "},{"num":35,"verse":"But the sore might spread on the skin after the person has become clean. "},{"num":36,"verse":"Then the priest must look at him again. If the sore has spread on the skin, the priest doesn’t need to look for the yellowish hair. The person is unclean. "},{"num":37,"verse":"But the priest might think the sore has stopped spreading. And black hair may be growing in it. Then the sore has healed. The person is clean. And the priest must announce that he is clean."},{"num":38,"verse":"“When a person has white spots on his skin, "},{"num":39,"verse":"a priest must look at them. If the spots on his skin are dull white, the disease is only a harmless rash. That person is clean."},{"num":40,"verse":"“A man might lose hair from his head and be bald. He is clean. "},{"num":41,"verse":"He might lose hair from the front of his head and have a bald forehead. He is clean. "},{"num":42,"verse":"But if there is a red-white sore on his scalp, it is a skin disease. "},{"num":43,"verse":"A priest must look at that person. The swelling of the sore might be red-white. It might look like a skin disease that spreads. "},{"num":44,"verse":"Then that person has a skin disease. He is unclean. And the priest must announce that the person is unclean because of the sore on his head."},{"num":45,"verse":"“If a person has a skin disease that spreads, he must warn other people. He must shout, ‘Unclean, unclean!’ His clothes must be torn at the seams. He must let his hair stay uncombed. And he must cover his mouth. "},{"num":46,"verse":"That person will be unclean the whole time he has the disease. He is unclean. He must live alone outside the camp."},{"header":"Rules About Mildew"},{"num":47,"verse":"“Some clothing might have mildew on it. The cloth might be linen or wool. "},{"num":48,"verse":"It might be woven or knitted. The mildew might be on a piece of leather or on something made from leather. "},{"num":49,"verse":"The mildew might be in the clothing, leather or woven or knitted material. If the mildew is green or red, it is a spreading mildew. Then it must be shown to the priest. "},{"num":50,"verse":"The priest must look at the mildew. And he must put that thing in a separate place for seven days. "},{"num":51,"verse":"On the seventh day he must look at the mildew. It doesn’t matter if the mildew is on leather or cloth. It doesn’t matter if the cloth is woven or knitted. It doesn’t matter what it was used for. If the mildew has spread, it is a mildew that destroys. "},{"num":52,"verse":"The priest must burn it. It does not matter if it is woven or knitted, wool or linen or a leather article. The mildew is spreading. The thing must be burned."},{"num":53,"verse":"“If the priest sees that the mildew has not spread, the cloth or leather must be washed. It does not matter if it is leather or cloth, knitted or woven. It must be washed. "},{"num":54,"verse":"The priest must order the people to wash that piece of leather or cloth. Then he must separate the clothing for seven more days. "},{"num":55,"verse":"After that time the priest must look at it again. If the mildew still looks the same, that thing is unclean. It does not matter if the mildew has not spread. You must burn that cloth or piece of leather."},{"num":56,"verse":"“But when the priest looks at that piece of leather or cloth, the mildew might have faded. Then the priest must tear the mildew out of the piece of leather or cloth. It does not matter if the cloth is woven or knitted. "},{"num":57,"verse":"But the mildew might come back to that piece of leather or cloth. If that happens, the mildew is spreading. And that piece of leather or cloth must be burned. "},{"num":58,"verse":"The cloth, the woven or knitted material, or the leather may be washed. The mildew may then be gone. It must be washed again. Then it will be clean."},{"num":59,"verse":"“These are the teachings about mildew on pieces of leather or cloth. It doesn’t matter if the cloth is woven or knitted.”"}]