[{"header":"Jacob Blesses Joseph’s Two Sons"},{"num":48,"verse":"Joseph was told that his father Jacob had become very sick. So Joseph went to see him and took along his two sons, Manasseh and Ephraim. "},{"num":2,"verse":"When Joseph arrived, someone told Jacob, “Your son Joseph has come to see you.” Jacob sat up in bed, but it took almost all his strength."},{"num":3,"verse":"Jacob told Joseph:"},{"num":5,"verse":"Then Jacob went on to say:"},{"num":8,"verse":"Jacob was very old and almost blind. He did not recognize the two boys, and so he asked Joseph, “Who are these boys?”"},{"num":11,"verse":"Jacob turned to Joseph and told him, “For many years I thought you were dead and that I would never see you again. But now God has even let me live to see your children.” "},{"num":12,"verse":"Then Joseph made his sons move away from Jacob’s knees, and Joseph bowed down in front of him with his face to the ground."},{"num":13,"verse":"After Joseph got up, he brought his two sons over to Jacob again. He led his younger son Ephraim to the left side of Jacob and his older son Manasseh to the right. "},{"num":14,"verse":"But before Jacob gave them his blessing, he crossed his arms, putting his right hand on the head of Ephraim and his left hand on the head of Manasseh. "},{"num":15,"verse":"Then he gave Joseph his blessing and said:"},{"num":17,"verse":"Joseph did not like it when he saw his father place his right hand on the head of the younger son. So he tried to move his father’s right hand from Ephraim’s head and place it on Manasseh. "},{"num":18,"verse":"Joseph said, “Father, you have made a mistake. This is the older boy. Put your right hand on him.”"},{"num":19,"verse":"But his father said, “Son, I know what I am doing. It’s true that Manasseh’s family will someday become a great nation. But Ephraim will be even greater than Manasseh, because his descendants will become many great nations.”"},{"num":20,"verse":"Jacob told him that in the future the people of Israel would ask God’s blessings on one another by saying, “I pray for God to bless you as much as he blessed Ephraim and Manasseh.” Jacob put Ephraim’s name first to show that he would be greater than Manasseh. "},{"num":21,"verse":"After that, Jacob said, “Joseph, you can see that I won’t live much longer. But God will be with you and will lead you back to the land he promised our family long ago. "},{"num":22,"verse":"Meanwhile, I’m giving you the hillside I captured from the Amorites.”"}]