[[],[],[{"type":"prose","content":"Some time after this conversation, Joseph was told, “Your father is ill.” He took his two sons, Manasseh and Ephraim, and went to Jacob. When Jacob was told, “Your son Joseph has come,” he roused himself and sat up in bed."}],[{"type":"prose","content":"Jacob said to Joseph, “The Strong God appeared to me at Luz in the land of Canaan and blessed me. He said, ‘I’m going to make you prosperous and numerous, turn you into a congregation of tribes; and I’ll turn this land over to your children coming after you as a permanent inheritance.’ I’m adopting your two sons who were born to you here in Egypt before I joined you; they have equal status with Reuben and Simeon. But any children born after them are yours; they will come after their brothers in matters of inheritance. I want it this way because, as I was returning from Paddan, your mother Rachel, to my deep sorrow, died as we were on our way through Canaan when we were only a short distance from Ephrath, now called Bethlehem.”"}],[{"type":"prose","content":"Just then Jacob noticed Joseph’s sons and said, “Who are these?”"}],[{"type":"prose","content":"Joseph told his father, “They are my sons whom God gave to me in this place.”“Bring them to me,” he said, “so I can bless them.” Israel’s eyesight was poor from old age; he was nearly blind. So Joseph brought them up close. Old Israel kissed and embraced them and then said to Joseph, “I never expected to see your face again, and now God has let me see your children as well!”"}],[{"type":"prose","content":"Joseph took them from Israel’s knees and bowed respectfully, his face to the ground. Then Joseph took the two boys, Ephraim with his right hand setting him to Israel’s left, and Manasseh with his left hand setting him to Israel’s right, and stood them before him. But Israel crossed his arms and put his right hand on the head of Ephraim who was the younger and his left hand on the head of Manasseh, the firstborn. Then he blessed them:"},{"type":"poetry","content":"The God before whom walked"},{"type":"poetry","content":""},{"type":"poetry","content":"The God who has been my shepherd"},{"type":"poetry","content":""},{"type":"poetry","content":"The Angel who delivered me from every evil,"},{"type":"poetry","content":""},{"type":"poetry","content":"May my name be echoed in their lives,"},{"type":"poetry","content":""},{"type":"poetry","content":"And may they grow"},{"type":"poetry","content":""}],[{"type":"prose","content":"When Joseph saw that his father had placed his right hand on Ephraim’s head, he thought he had made a mistake, so he took hold of his father’s hand to move it from Ephraim’s head to Manasseh’s, saying, “That’s the wrong head, Father; the other one is the firstborn; place your right hand on his head.”"}],[{"type":"prose","content":"But his father wouldn’t do it. He said, “I know, my son; but I know what I’m doing. He also will develop into a people, and he also will be great. But his younger brother will be even greater and his descendants will enrich nations.” Then he blessed them both:"},{"type":"poetry","content":"Israel will use your names to give blessings:"},{"type":"poetry","content":""},{"type":"prose","content":"In that he made it explicit: he put Ephraim ahead of Manasseh."}],[{"type":"prose","content":"Israel then said to Joseph, “I’m about to die. God be with you and give you safe passage back to the land of your fathers. As for me, I’m presenting you, as the first among your brothers, the ridge of land I took from Amorites with my sword and bow.”* * *"}]]