[{"header":"Israel’s Last Days"},{"num":48,"verse":"Now it came about after these things that Joseph was told, “Behold, your father is sick.” So he took his two sons Manasseh and Ephraim with him."},{"num":2,"verse":"When it was told to Jacob, “Behold, your son Joseph has come to you,” Israel collected his strength and sat up in the bed."},{"num":3,"verse":"Then Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan and blessed me,"},{"num":4,"verse":"and He said to me, ‘Behold, I will make you fruitful and numerous, and I will make you a multitude of peoples, and will give this land to your descendants after you as an everlasting possession.’"},{"num":5,"verse":"Now your two sons, who were born to you in the land of Egypt before I came to you in Egypt, are mine; Ephraim and Manasseh shall be mine, as Reuben and Simeon are."},{"num":6,"verse":"But your children that you have fathered after them shall be yours; they shall be called by the names of their brothers in their inheritance."},{"num":7,"verse":"Now as for me, when I came from Paddan, Rachel died, to my sorrow, in the land of Canaan on the journey, when there was still some distance to go to Ephrath. I buried her there on the way to Ephrath (that is, Bethlehem).”"},{"num":8,"verse":"When Israel saw Joseph’s sons, he said, “Who are these?”"},{"num":9,"verse":"And Joseph said to his father, “They are my sons, whom God has given me here.” So he said, “Bring them to me, please, so that I may bless them.”"},{"num":10,"verse":"Now the eyes of Israel were so dim from age that he could not see. And Joseph brought them close to him, and he kissed them and embraced them."},{"num":11,"verse":"And Israel said to Joseph, “I never expected to see your face, and behold, God has let me see your children as well!”"},{"num":12,"verse":"Then Joseph took them from his knees, and bowed with his face to the ground."},{"num":13,"verse":"And Joseph took them both, Ephraim with his right hand toward Israel’s left, and Manasseh with his left hand toward Israel’s right, and brought them close to him."},{"num":14,"verse":"But Israel reached out his right hand and placed it on the head of Ephraim, who was the younger, and his left hand on Manasseh’s head, crossing his hands, although Manasseh was the firstborn."},{"num":15,"verse":"And he blessed Joseph, and said,"},{"num":17,"verse":"When Joseph saw that his father placed his right hand on Ephraim’s head, it displeased him; and he grasped his father’s hand to move it from Ephraim’s head to Manasseh’s head."},{"num":18,"verse":"And Joseph said to his father, “Not so, my father, for this one is the firstborn. Place your right hand on his head.”"},{"num":19,"verse":"But his father refused and said, “I know, my son, I know; he also will become a people and he also will be great. However, his younger brother shall be greater than he, and his descendants shall become a multitude of nations.”"},{"num":20,"verse":"So he blessed them that day, saying,"},{"num":21,"verse":"Then Israel said to Joseph, “Behold, I am about to die, but God will be with you, and bring you back to the land of your fathers."},{"num":22,"verse":"And I give you one portion more than your brothers, which I took from the hand of the Amorite with my sword and my bow.”"}]