[{"num":48,"verse":"And it came to pass after these things, that one told Yosef, Hinei, Avicha is choleh (ill); and he took with him his two banim, Menasheh and Ephrayim."},{"num":2,"verse":"And one told Ya’akov, and said, Hinei, the ben of thee Yosef cometh unto thee; and Yisroel strengthened himself, and sat up upon the mittah (bed)."},{"num":3,"verse":"And Ya’akov said unto Yosef, El Shaddai appeared unto me at Luz in Eretz Kena’an, and made on me a brocha,"},{"num":4,"verse":"And said unto me, Hineni, I will make thee fruitful, and multiply thee, and I will make of thee a kehal of ammim; and will give HaAretz Hazot to thy zera after thee for an achuzzat olam (everlasting possession)."},{"num":5,"verse":"And now thy two banim, Ephrayim and Menasheh, which were born unto thee in Eretz Mitzrayim before I came unto thee into Mitzrayim, are mine; like Reuven and Shimon, they shall be mine."},{"num":6,"verse":"And thy moledet, which are born to thee after them, shall be thine, and shall be called after the shem of their achim in their nachalah."},{"num":7,"verse":"And as for me, when I came from Padan, Rachel died by me in Eretz Kena’an in the way, when there was yet but a space of land to go unto Ephratah; and I buried her there by the derech Ephrat; the same is Beit-Lechem."},{"num":8,"verse":"And Yisroel beheld Bnei Yosef, and said, Who are these?"},{"num":9,"verse":"And Yosef said unto aviv, They are my banim, whom Elohim hath given me in this place. And he said, Bring them, now, unto me, and I will make upon them a brocha."},{"num":10,"verse":"Now the eyes of Yisroel were dim from age, so that he could not see. And he brought them near unto him; and he kissed them, and embraced them."},{"num":11,"verse":"And Yisroel said unto Yosef, I never expected to see thy face; and, hinei, Elohim hath showed me also thy zera."},{"num":12,"verse":"And Yosef brought them out from between his knees, and he bowed himself with his face to the ground."},{"num":13,"verse":"And Yosef took them both, Ephrayim in his yamin toward smol Yisroel, and Menasheh on his smol toward yamin Yisroel, and brought them near unto him."},{"num":14,"verse":"And Yisroel stretched out his yamin, and laid it upon rosh Ephraim, who was the younger, and his smol upon rosh Manasseh, guiding his hands intentionally; for Menasheh was the bechor."},{"num":15,"verse":"And he made on Yosef a brocha, and said, HaElohim, before whom my Avot Avraham and Yitzchak did walk, HaElohim Who was Roeh to me all my life long unto this day,"},{"num":16,"verse":"The Malach which redeemed me from kol rah, may he make a brocha on the ne’arim, and let my shem be named on them, and the shem of my Avot Avraham and Yitzchak; and let them grow into a multitude in the midst of ha’aretz."},{"num":17,"verse":"And when Yosef saw that aviv laid his yamin upon the rosh Ephrayim, it displeased him; and he took hold of yad aviv, to remove it from rosh Ephrayim unto rosh Menasheh."},{"num":18,"verse":"And Yosef said unto aviv, Not so, Avi; for this is the bechor; put thy yamin upon his rosh."},{"num":19,"verse":"And aviv refused, and said, I know it, beni (my son), I know it; he also shall become a people, and he also shall be great; but truly achiv hakaton shall be greater than he, and his zera shall become a multitude of Goyim."},{"num":20,"verse":"And he made a brocha on them that day, saying, In thee shall Yisroel bless, saying, Elohim make thee like Ephrayim and like Menasheh; and he set Ephrayim before Menasheh."},{"num":21,"verse":"And Yisroel said unto Yosef, Hinei I die; but Elohim shall be with you, and bring you back unto the Eretz Avoteichem."},{"num":22,"verse":"Moreover, I have given to thee one portion above thy achim, which I took out of the yad HaEmori with my cherev and with my keshet."}]