[[],[{"type":"prose","content":"And it cometh to pass, after these things, that [one] saith to Joseph, `Lo, thy father is sick;' and he taketh his two sons with him, Manasseh and Ephraim."}],[{"type":"prose","content":"And [one] declareth to Jacob, and saith, `Lo, thy son Joseph is coming unto thee;' and Israel doth strengthen himself, and sit upon the bed."}],[{"type":"prose","content":"And Jacob saith unto Joseph, `God Almighty hath appeared unto me, in Luz, in the land of Canaan, and blesseth me,"}],[{"type":"prose","content":"and saith unto me, Lo, I am making thee fruitful, and have multiplied thee, and given thee for an assembly of peoples, and given this land to thy seed after thee, a possession age-during."}],[{"type":"prose","content":"`And now, thy two sons, who are born to thee in the land of Egypt, before my coming unto thee to Egypt, mine they [are]; Ephraim and Manasseh, as Reuben and Simeon they are mine;"}],[{"type":"prose","content":"and thy family which thou hast begotten after them are thine; by the name of their brethren they are called in their inheritance."}],[{"type":"prose","content":"`And I -- in my coming in from Padan-[Aram] Rachel hath died by me in the land of Canaan, in the way, while yet a kibrath of land to enter Ephrata, and I bury her there in the way of Ephrata, which [is] Bethlehem.'"}],[{"type":"prose","content":"And Israel seeth the sons of Joseph, and saith, `Who [are] these?'"}],[{"type":"prose","content":"and Joseph saith unto his father, `They [are] my sons, whom God hath given to me in this [place];' and he saith, `Bring them, I pray thee, unto me, and I bless them.'"}],[{"type":"prose","content":"And the eyes of Israel have been heavy from age, he is unable to see; and he bringeth them nigh unto him, and he kisseth them, and cleaveth to them;"}],[{"type":"prose","content":"and Israel saith unto Joseph, `To see thy face I had not thought, and lo, God hath shewed me also thy seed.'"}],[{"type":"prose","content":"And Joseph bringeth them out from between his knees, and boweth himself on his face to the earth;"}],[{"type":"prose","content":"and Joseph taketh them both, Ephraim in his right hand towards Israel's left, and Manasseh in his left towards Israel's right, and bringeth [them] nigh to him."}],[{"type":"prose","content":"And Israel putteth out his right hand, and placeth [it] upon the head of Ephraim, who [is] the younger, and his left hand upon the head of Manasseh; he hath guided his hands wisely, for Manasseh [is] the first-born."}],[{"type":"prose","content":"And he blesseth Joseph, and saith, `God, before whom my fathers Abraham and Isaac walked habitually: God who is feeding me from my being unto this day:"}],[{"type":"prose","content":"the Messenger who is redeeming me from all evil doth bless the youths, and my name is called upon them, and the name of my fathers Abraham and Isaac; and they increase into a multitude in the midst of the land.'"}],[{"type":"prose","content":"And Joseph seeth that his father setteth his right hand on the head of Ephraim, and it is wrong in his eyes, and he supporteth the hand of his father to turn it aside from off the head of Ephraim to the head of Manasseh;"}],[{"type":"prose","content":"and Joseph saith unto his father, `Not so, my father, for this [is] the first-born; set thy right hand on his head.'"}],[{"type":"prose","content":"And his father refuseth, and saith, `I have known, my son, I have known; he also becometh a people, and he also is great, and yet, his young brother is greater than he, and his seed is the fulness of the nations;'"}],[{"type":"prose","content":"and he blesseth them in that day, saying, `By thee doth Israel bless, saying, God set thee as Ephraim and as Manasseh;' and he setteth Ephraim before Manasseh."}],[{"type":"prose","content":"And Israel saith unto Joseph, `Lo, I am dying, and God hath been with you, and hath brought you back unto the land of your fathers;"}],[{"type":"prose","content":"and I -- I have given to thee one portion above thy brethren, which I have taken out of the hand of the Amorite by my sword and by my bow.'"}]]