[{"num":6,"verse":"What shall we say then? Shall we keep on doing wrong things so that God will be more kind to us?"},{"num":2,"verse":"No, surely not! We died to our wrong ways and no longer live in them."},{"num":3,"verse":"All of us have been baptised in water. This means we are joined to Christ Jesus. We were baptised into his death. Do you know that?"},{"num":4,"verse":"We were buried when he was buried because we were baptised into his death. Christ was raised from death by the wonderful power of the Father. So we also must live a new life."},{"num":5,"verse":"Have we shared with Christ and died as he died? Then we shall share with him by rising from death as he arose."},{"num":6,"verse":"We know this is true. The old person we used to be was nailed to the cross with him, so that our bodies which do wrong things would die. Then we will no longer be like slaves to the wrong things we used to do."},{"num":7,"verse":"Anyone who has died no longer does wrong things."},{"num":8,"verse":"If we have died with Christ, we believe that we will also live with him."},{"num":9,"verse":"We know that Christ was raised from death and will not die again. Death has no power over him any more."},{"num":10,"verse":"He died. And he died once for all time, so that people would stop their wrong ways. But now he lives. And he lives for God."},{"num":11,"verse":"So you also must think you are dead, and stop your wrong ways. And you must think you are living for God along with Christ Jesus our Lord."},{"num":12,"verse":"Do not let wrong things rule over your bodies that are going to die. Do not do the things your bodies want."},{"num":13,"verse":"Do not use your bodies to do wrong things. But give yourselves to God like men who have been raised from death to life. Give your bodies to God and use them to do good things."},{"num":14,"verse":"Wrong ways will not be your masters. The law does not rule over you now, but God's loving kindness rules over you."},{"num":15,"verse":"What then? The law does not rule over us now. God's loving kindness rules over us. So, shall we do wrong things? No, never!"},{"num":16,"verse":"If you give yourselves to be slaves and obey your master, you are not free. You are his slaves. Do you not know this: you may be slaves to wrong things? But you will not live for ever. Or you may be slaves to obey God. Then you will be made good people and live with him."},{"num":17,"verse":"You were at one time slaves to wrong things. But I praise God that you obeyed what your teachers taught you. And you obeyed because you wanted to obey."},{"num":18,"verse":"You were made free from doing wrong things. You were made slaves to good things."},{"num":19,"verse":"I speak the way people would think about such things, because your minds are weak. At one time you gave your bodies to be slaves to your unclean ways, and to do more and more wrong things. So now give your bodies to be slaves to doing what is right, and to being good."},{"num":20,"verse":"When you were slaves to wrong things, you were free from doing good things."},{"num":21,"verse":"You are now ashamed of those things. What good did they do you? For the end of those things is death."},{"num":22,"verse":"But now you have been made free from wrong ways and you have been made God's slaves. You are made good and you will live for ever."},{"num":23,"verse":"The reward that wrong ways give is to die. But the gift which God gives is to live for ever. Christ Jesus our Lord has done this for us."}]