[{"num":1,"verse":"¶ Save me, O God; for the waters are come in unto my soul."},{"num":2,"verse":"I sink in deep mire where there is no standing; I am come into deep waters, where the floods overflow me."},{"num":3,"verse":"I am weary of my crying; my throat is dried; my eyes fail while I wait for my God."},{"num":4,"verse":"Those that hate me without a cause are more than the hairs of my head; those that would destroy me, being my enemies wrongfully, are mighty; then I restored that which I did not take away."},{"num":5,"verse":"O God, thou knowest my foolishness, and my guiltiness is not hid from thee."},{"num":6,"verse":"Do not let those that wait on thee, O Lord GOD of the hosts, be ashamed for my sake; do not let those that seek thee be confounded for my sake, O God of Israel."},{"num":7,"verse":"Because for thy sake I have borne reproach; shame has covered my face."},{"num":8,"verse":"I am become a stranger unto my brethren and an alien unto my mother’s sons."},{"num":9,"verse":"For the zeal of thy house has consumed me, and the reproaches of those that reproached thee are fallen upon me."},{"num":10,"verse":"When I wept with fasting of my soul, thou hast been a reproach unto me."},{"num":11,"verse":"I made sackcloth also my garment, and I became a proverb to them."},{"num":12,"verse":"They that sat in the gate spoke against me, and I was the song of the drunkards."},{"num":13,"verse":"¶ But I corrected my prayer unto thee, O LORD, in the time of thy good pleasure; O God, in the multitude of thy mercy hear me, in the truth of thy saving health."},{"num":14,"verse":"Deliver me out of the mire, and let me not drown; let me be delivered from those that hate me and out of the deep waters."},{"num":15,"verse":"Let not the violent force of the waters overcome me, neither let the deep swallow me up, and let not the pit shut her mouth upon me."},{"num":16,"verse":"Hear me, O LORD, for thy mercy is perceptible, look upon me according to the multitude of thy acts of compassion"},{"num":17,"verse":"And hide not thy face from thy slave, for I am in trouble; hear me speedily."},{"num":18,"verse":"Draw near unto my soul and redeem it; deliver me because of my enemies."},{"num":19,"verse":"Thou hast known my reproach and my shame and my dishonour; my adversaries are all before thee."},{"num":20,"verse":"Reproach has broken my heart, and I am full of heaviness, and I looked for some to take pity, but there was no one, and for comforters, but I found none."},{"num":21,"verse":"They also gave me gall for my food; and in my thirst they gave me vinegar to drink."},{"num":22,"verse":"¶ Let their table become a snare before them, and that which should have been for their prosperity, let it become a stumbling block."},{"num":23,"verse":"Let their eyes be darkened that they see not and make their loins continually to shake."},{"num":24,"verse":"Pour out thine indignation upon them, and let thy wrathful anger take hold of them."},{"num":25,"verse":"Let their palace be desolate, and let no one dwell in their tents."},{"num":26,"verse":"For they persecute him whom thou hast smitten, and they boast that thou hast slain their enemies."},{"num":27,"verse":"Add iniquity unto their iniquity, and let them not come into thy righteousness."},{"num":28,"verse":"Let them be blotted out of the book of the living and not be written with the righteous."},{"num":29,"verse":"But I am poor and sorrowful; let thy saving health, O God, set me up on high."},{"num":30,"verse":"¶ I will praise the name of God with a song and will magnify him with praises."},{"num":31,"verse":"This also shall please the LORD better than the sacrifice of an ox or bullock that struggles with horns and hoofs."},{"num":32,"verse":"The humble shall see this and be glad; seek God and thy heart shall live."},{"num":33,"verse":"For the LORD hears the destitute and does not despise his prisoners."},{"num":34,"verse":"Let the heavens and the earth praise him, the seas, and every thing that moves in them."},{"num":35,"verse":"For God will protect Zion and will rebuild the cities of Judah; they shall dwell there and inherit it."},{"num":36,"verse":"The seed of his slaves shall inherit it, and those that love his name shall dwell therein."}]