[{"num":69,"verse":"(For the one directing. Al Shoshanim. Of Dovid.) Hoshi’eini, O Elohim; for the mayim are come unto my nefesh (i.e., neck)."},{"num":3,"verse":"I sink in deep mire, where there is no standing; I am come into the depths of the mayim, where the floods overflow me."},{"num":4,"verse":"I am weary of my crying out; my garon (throat) is dry; mine eyes fail while I wait for Elohai."},{"num":5,"verse":"They that have sinas chinom (baseless hatred) toward me are more than the hairs of mine rosh; they that would destroy me, being mine oyevim (enemies) sheker (baselessly) are mighty; then I restored that which I did not steal."},{"num":6,"verse":"O Elohim, Thou knowest my folly; and my ashmot (guiltinesses) are not hid from Thee."},{"num":7,"verse":"Let not them that wait on Thee, Adonoi Hashem Tzva’os, be ashamed because of me; let not those that seek Thee be disgraced because of me, O Elohei Yisroel."},{"num":8,"verse":"Because for Thy sake I have borne cherpah; shame hath covered my face."},{"num":9,"verse":"I am become a stranger unto my achim, and a nochri (foreigner) unto the bnei immi (sons of my mother)."},{"num":10,"verse":"For kinas Beitcha (zeal for Thy House) hath consumed me; and the cherpot of them that scorned Thee are fallen upon me [Yn 2:17]."},{"num":11,"verse":"When I wept, and chastened my nefesh in the tzom (fast), that became my cherpot (reproaches)."},{"num":12,"verse":"I made sackcloth also my garment; and I became a mashal (byword) to them."},{"num":13,"verse":"They that sit [as judges] in the sha’ar (gate) speak against me; and I was the neginot (drinking songs) of the drunkards."},{"num":14,"verse":"But as for me, may my tefillah be unto Thee, Hashem, in an et ratzon (acceptable time, time of favor); O Elohim, in the multitude of Thy chesed hear me, in the emes of Thy salvation."},{"num":15,"verse":"Save me out of the teet (mire, clay, soil) and let me not sink; let me be saved from them that hate me, and out of the depths of the mayim."},{"num":16,"verse":"Let not the floodwaters overflow me, neither let the deep swallow me up, and let not the be’er (pit) shut her mouth upon me."},{"num":17,"verse":"Hear me, Hashem, for Thy chesed is tov; turn unto me according to the multitude of Thy rachamim;"},{"num":18,"verse":"And hide not Thy face from Thy eved; for I am in tzoros. Hear me speedily."},{"num":19,"verse":"Draw near unto my nefesh, and make the go’el redemption of it; deliver me because of mine oyevim (enemies)."},{"num":20,"verse":"Thou hast known the cherpah (scorn) I bear, and my shame, and my dishonor; mine adversaries are all before Thee."},{"num":21,"verse":"Reproach hath broken my lev; and I have sickness as unto death; and I looked for some to take pity, but there was none; and for menachamim (comforters), but I found none."},{"num":22,"verse":"They gave me also gall in my food; and in my tzamah (thirst) they gave me chometz (vinegar) to drink [See Mt.27:34,48; Mk.15:23,36; Lk.23:36 Yn.19:28-30 OJBC]."},{"num":23,"verse":"Let their shulchan become a pach (snare, trap) before them; and that which should have been for their shlomim (peacefulnesses), let it become a mokesh (trap)."},{"num":24,"verse":"Let their eyes be darkened, that they see not; and make their loins shake tamid."},{"num":25,"verse":"Pour out Thine indignation upon them, and let Thy charon af (burning wrath) overtake them."},{"num":26,"verse":"Let their habitation be desolate; and let none dwell in their ohalim [See Ac 1:20 OJBC]."},{"num":27,"verse":"For they persecute him whom Thou hast struck; and they tell of the makh’ov (pain, grief) of those whom Thou hast wounded."},{"num":28,"verse":"Add avon (iniquity) unto their avon; and let them not come into Thy tzedakah."},{"num":29,"verse":"Let them be blotted out of the Sefer Chayyim, and not be recorded with the tzaddikim."},{"num":30,"verse":"But I am ani (poor) and in pain; let Thy Yeshuah (salvation), O Elohim, set me up on high."},{"num":31,"verse":"I will praise Shem Elohim b’shir (in song), and will magnify Him with todah (thanksgiving)."},{"num":32,"verse":"This also shall please Hashem better than shor (ox) or bull that hath keren (horn) and parsah (hoof)."},{"num":33,"verse":"Those that have anavah (meekness, humility) shall see this, and have simchah; and your [pl.] lev shall live that seek Elohim."},{"num":34,"verse":"For Hashem heareth the evyonim (needy ones, poor), and despiseth not His prisoners."},{"num":35,"verse":"Let the Shomayim v’Aretz praise Him, the seas, and every thing that moveth therein."},{"num":36,"verse":"For Elohim yoshi’a (will save) Tziyon, and will build the cities of Yehudah; that they may dwell there, and have it in possession."},{"num":37,"verse":"The zera also of His avadim shall inherit it; and they that love Shmo shall dwell therein."}]