[{"header":"Review of the Journey from Egypt to Jordan"},{"num":33,"verse":"These are the stages of the journeys of the Israelites, by which they came out of the land of Egypt by their [tribal] armies, under the leadership of Moses and Aaron. "},{"num":2,"verse":"Moses recorded their points of departure, as the Lord commanded, stage by stage; and these are their journeys according to their points of departure: "},{"num":3,"verse":"They set out from Rameses on the fifteenth day of the first month; on the day after the Passover the Israelites moved out triumphantly in the sight of all the Egyptians, "},{"num":4,"verse":"while the Egyptians were burying all their firstborn whom the Lord had struck down among them. Upon their gods the Lord also executed judgments."},{"num":5,"verse":"Then the Israelites moved out from Rameses [where they had all joined together], and camped in Succoth. "},{"num":6,"verse":"They moved out from Succoth and camped in Etham, which is on the edge of the wilderness. "},{"num":7,"verse":"They moved out from Etham and turned back to Pi-hahiroth, east of Baal-zephon, and they camped before Migdol. "},{"num":8,"verse":"They moved out from before Pi-hahiroth and passed through the midst of the [Red] Sea into the wilderness; and they went a three days’ journey in the Wilderness of Etham and camped at Marah. "},{"num":9,"verse":"They moved out from Marah and came to Elim; in Elim there were twelve springs of water and seventy palm trees, and they camped there. "},{"num":10,"verse":"They moved out from Elim and camped by the Red Sea (Sea of Reeds). "},{"num":11,"verse":"They moved out from the Red Sea and camped in the Wilderness of Sin. "},{"num":12,"verse":"They moved out from the Wilderness of Sin and camped at Dophkah. "},{"num":13,"verse":"They moved out from Dophkah and camped at Alush. "},{"num":14,"verse":"They moved out from Alush and camped at Rephidim; now it was there that the people had no water to drink. "},{"num":15,"verse":"They moved out from Rephidim and camped in the Wilderness of Sinai [where they remained for about a year]. "},{"num":16,"verse":"They moved out from the Wilderness of Sinai and camped at Kibroth-hattaavah."},{"num":17,"verse":"They moved out from Kibroth-hattaavah and camped at Hazeroth. "},{"num":18,"verse":"They moved out from Hazeroth and camped at Rithmah [near Kadesh, the place from which the twelve spies were sent to spy out the land of Canaan]. "},{"num":19,"verse":"They moved out from Rithmah and camped at Rimmon-perez. "},{"num":20,"verse":"They moved out from Rimmon-perez and camped at Libnah. "},{"num":21,"verse":"They moved out from Libnah and camped at Rissah. "},{"num":22,"verse":"They moved out from Rissah and camped at Kehelathah. "},{"num":23,"verse":"They moved out from Kehelathah and camped at Mount Shepher. "},{"num":24,"verse":"They moved out from Mount Shepher and camped at Haradah. "},{"num":25,"verse":"They moved out from Haradah and camped at Makheloth. "},{"num":26,"verse":"They moved out from Makheloth and camped at Tahath. "},{"num":27,"verse":"They moved out from Tahath and camped at Terah. "},{"num":28,"verse":"They moved out from Terah and camped at Mithkah. "},{"num":29,"verse":"They moved out from Mithkah and camped at Hashmonah. "},{"num":30,"verse":"They moved out from Hashmonah and camped at Moseroth. "},{"num":31,"verse":"They moved out from Moseroth and camped at Bene-jaakan. "},{"num":32,"verse":"They moved out from Bene-jaakan and camped at Hor-haggidgad. "},{"num":33,"verse":"They moved out from Hor-haggidgad and camped at Jotbathah. "},{"num":34,"verse":"They moved out from Jotbathah and camped at Abronah. "},{"num":35,"verse":"They moved out from Abronah and camped at Ezion-geber [or Elath on the gulf of Aqabah]. "},{"num":36,"verse":"They moved out from Ezion-geber and camped in the Wilderness of Zin, which is Kadesh. "},{"num":37,"verse":"They moved out from Kadesh and camped at Mount Hor, on the edge of the land of Edom."},{"num":38,"verse":"Aaron the priest went up on Mount Hor at the command of the Lord, and died there in the fortieth year after the Israelites came out of the land of Egypt, on the first day of the fifth month. "},{"num":39,"verse":"Aaron was a hundred and twenty-three years old when he died on Mount Hor."},{"num":40,"verse":"The Canaanite king of Arad, who lived in the Negev (the South country) in the land of Canaan, heard that the sons of Israel were coming."},{"num":41,"verse":"They moved out from Mount Hor and camped at Zalmonah. "},{"num":42,"verse":"Then they moved out from Zalmonah and camped at Punon. "},{"num":43,"verse":"They moved out from Punon and camped at Oboth. "},{"num":44,"verse":"They moved out from Oboth and camped at Iye-abarim, on the border of Moab. "},{"num":45,"verse":"They moved out from Iyim (Iye-abarim) and camped at Dibon-gad. "},{"num":46,"verse":"They moved out from Dibon-gad and camped at Almon-diblathaim. "},{"num":47,"verse":"They moved out from Almon-diblathaim and camped in the mountains of Abarim, before [Mount] Nebo. "},{"num":48,"verse":"They moved out from the mountains of Abarim and camped in the plains of Moab by the Jordan across from Jericho [their last stop on the journey to Canaan]. "},{"num":49,"verse":"They camped by the Jordan from Beth-jeshimoth as far as Abel-shittim in the plains of Moab."},{"header":"Law of Possessing the Land"},{"num":50,"verse":"Then the Lord spoke to Moses in the plains of Moab by the Jordan across from Jericho, saying, "},{"num":51,"verse":"“Say to the children of Israel, ‘When you cross the Jordan into the land of Canaan, "},{"num":52,"verse":"then you shall drive out all the inhabitants of the land before you and destroy all their sculpted images, and destroy all their cast idols and completely eliminate all their [idolatrous] high places, "},{"num":53,"verse":"and you shall take possession of the land and live in it, for I have given the land to you to possess. "},{"num":54,"verse":"You shall inherit the land by lot according to your families; to the large tribe you shall give a larger inheritance, and to the small tribe you shall give a smaller inheritance. Wherever the lot falls to any man, that shall be [the location of] his [inheritance]. According to the tribes of your fathers (ancestors) you shall inherit. "},{"num":55,"verse":"But if you do not drive out the inhabitants of the land from before you, then those you let remain of them will be like pricks in your eyes and like thorns in your sides, and they will attack you in the land in which you live. "},{"num":56,"verse":"And as I [the Lord] planned to do to them, so I will do to you.’”"}]