[[],[{"type":"header","content":"Remembering Israel’s Journey"},{"type":"prose","content":"This is the route the Israelites followed as they marched out of Egypt under the leadership of Moses and Aaron."}],[{"type":"prose","content":"At the ’s direction, Moses kept a written record of their progress. These are the stages of their march, identified by the different places where they stopped along the way."}],[{"type":"prose","content":"They set out from the city of Rameses in early spring—on the fifteenth day of the first month—on the morning after the first Passover celebration. The people of Israel left defiantly, in full view of all the Egyptians."}],[{"type":"prose","content":"Meanwhile, the Egyptians were burying all their firstborn sons, whom the  had killed the night before. The  had defeated the gods of Egypt that night with great acts of judgment!"}],[{"type":"prose","content":"After leaving Rameses, the Israelites set up camp at Succoth."}],[{"type":"prose","content":"Then they left Succoth and camped at Etham on the edge of the wilderness."}],[{"type":"prose","content":"They left Etham and turned back toward Pi-hahiroth, opposite Baal-zephon, and camped near Migdol."}],[{"type":"prose","content":"They left Pi-hahiroth and crossed the Red Sea into the wilderness beyond. Then they traveled for three days into the Etham wilderness and camped at Marah."}],[{"type":"prose","content":"They left Marah and camped at Elim, where there were twelve springs of water and seventy palm trees."}],[{"type":"prose","content":"They left Elim and camped beside the Red Sea."}],[{"type":"prose","content":"They left the Red Sea and camped in the wilderness of Sin."}],[{"type":"prose","content":"They left the wilderness of Sin and camped at Dophkah."}],[{"type":"prose","content":"They left Dophkah and camped at Alush."}],[{"type":"prose","content":"They left Alush and camped at Rephidim, where there was no water for the people to drink."}],[{"type":"prose","content":"They left Rephidim and camped in the wilderness of Sinai."}],[{"type":"prose","content":"They left the wilderness of Sinai and camped at Kibroth-hattaavah."}],[{"type":"prose","content":"They left Kibroth-hattaavah and camped at Hazeroth."}],[{"type":"prose","content":"They left Hazeroth and camped at Rithmah."}],[{"type":"prose","content":"They left Rithmah and camped at Rimmon-perez."}],[{"type":"prose","content":"They left Rimmon-perez and camped at Libnah."}],[{"type":"prose","content":"They left Libnah and camped at Rissah."}],[{"type":"prose","content":"They left Rissah and camped at Kehelathah."}],[{"type":"prose","content":"They left Kehelathah and camped at Mount Shepher."}],[{"type":"prose","content":"They left Mount Shepher and camped at Haradah."}],[{"type":"prose","content":"They left Haradah and camped at Makheloth."}],[{"type":"prose","content":"They left Makheloth and camped at Tahath."}],[{"type":"prose","content":"They left Tahath and camped at Terah."}],[{"type":"prose","content":"They left Terah and camped at Mithcah."}],[{"type":"prose","content":"They left Mithcah and camped at Hashmonah."}],[{"type":"prose","content":"They left Hashmonah and camped at Moseroth."}],[{"type":"prose","content":"They left Moseroth and camped at Bene-jaakan."}],[{"type":"prose","content":"They left Bene-jaakan and camped at Hor-haggidgad."}],[{"type":"prose","content":"They left Hor-haggidgad and camped at Jotbathah."}],[{"type":"prose","content":"They left Jotbathah and camped at Abronah."}],[{"type":"prose","content":"They left Abronah and camped at Ezion-geber."}],[{"type":"prose","content":"They left Ezion-geber and camped at Kadesh in the wilderness of Zin."}],[{"type":"prose","content":"They left Kadesh and camped at Mount Hor, at the border of Edom."}],[{"type":"prose","content":"While they were at the foot of Mount Hor, Aaron the priest was directed by the  to go up the mountain, and there he died. This happened in midsummer, on the first day of the fifth month of the fortieth year after Israel’s departure from Egypt."}],[{"type":"prose","content":"Aaron was 123 years old when he died there on Mount Hor."}],[{"type":"prose","content":"At that time the Canaanite king of Arad, who lived in the Negev in the land of Canaan, heard that the people of Israel were approaching his land."}],[{"type":"prose","content":"Meanwhile, the Israelites left Mount Hor and camped at Zalmonah."}],[{"type":"prose","content":"Then they left Zalmonah and camped at Punon."}],[{"type":"prose","content":"They left Punon and camped at Oboth."}],[{"type":"prose","content":"They left Oboth and camped at Iye-abarim on the border of Moab."}],[{"type":"prose","content":"They left Iye-abarim and camped at Dibon-gad."}],[{"type":"prose","content":"They left Dibon-gad and camped at Almon-diblathaim."}],[{"type":"prose","content":"They left Almon-diblathaim and camped in the mountains east of the river, near Mount Nebo."}],[{"type":"prose","content":"They left the mountains east of the river and camped on the plains of Moab beside the Jordan River, across from Jericho."}],[{"type":"prose","content":"Along the Jordan River they camped from Beth-jeshimoth as far as the meadows of Acacia on the plains of Moab."}],[{"type":"prose","content":"While they were camped near the Jordan River on the plains of Moab opposite Jericho, the  said to Moses,"}],[{"type":"prose","content":"“Give the following instructions to the people of Israel: When you cross the Jordan River into the land of Canaan,"}],[{"type":"prose","content":"you must drive out all the people living there. You must destroy all their carved and molten images and demolish all their pagan shrines."}],[{"type":"prose","content":"Take possession of the land and settle in it, because I have given it to you to occupy."}],[{"type":"prose","content":"You must distribute the land among the clans by sacred lot and in proportion to their size. A larger portion of land will be allotted to each of the larger clans, and a smaller portion will be allotted to each of the smaller clans. The decision of the sacred lot is final. In this way, the portions of land will be divided among your ancestral tribes."}],[{"type":"prose","content":"But if you fail to drive out the people who live in the land, those who remain will be like splinters in your eyes and thorns in your sides. They will harass you in the land where you live."}],[{"type":"prose","content":"And I will do to you what I had planned to do to them.”"}]]