[{"header":"From Egypt to Moab"},{"num":33,"verse":"These are the travels of the people of Israel, when Moses and Aaron led them out from the land of Egypt by their armies. "},{"num":2,"verse":"Moses wrote down the starting places of their travels, as the Lord told him. These are their travels by their starting places. "},{"num":3,"verse":"They traveled from Rameses on the fifteenth day of the first month. On the day after the Passover the people of Israel started out strong in heart in front of all the Egyptians. "},{"num":4,"verse":"The Egyptians were burying all their first-born whom the Lord had killed among them. The Lord had punished their gods also."},{"num":5,"verse":"Then the people of Israel traveled from Rameses and stayed in Succoth. "},{"num":6,"verse":"They traveled from Succoth and stayed in Etham, beside the desert. "},{"num":7,"verse":"They went from Etham and turned back to Pi-hahiroth, east of Baal-zephon, and stayed at Migdol. "},{"num":8,"verse":"Then they traveled from Hahiroth and passed through the sea into the desert. They traveled for three days in the desert of Etham, and stayed at Marah. "},{"num":9,"verse":"They left Marah and came to Elim. There were twelve wells of water and seventy palm trees in Elim, and they stayed there. "},{"num":10,"verse":"Then they traveled from Elim and stayed by the Red Sea. "},{"num":11,"verse":"They left the Red Sea and stayed in the Desert of Sin. "},{"num":12,"verse":"They traveled from the Desert of Sin, and stayed at Dophkah. "},{"num":13,"verse":"Then they left Dophkah and stayed at Alush. "},{"num":14,"verse":"They traveled from Alush and stayed at Rephidim. It was there that the people had no water to drink. "},{"num":15,"verse":"They went from Rephidim and stayed in the Desert of Sinai. "},{"num":16,"verse":"They traveled from the Desert of Sinai, and stayed at Kibroth-hattaavah."},{"num":17,"verse":"They went from Kibroth-hattaavah and stayed at Hazeroth. "},{"num":18,"verse":"They left Hazeroth and stayed at Rithmah. "},{"num":19,"verse":"Then they went from Rithmah and stayed at Rimmon-perez. "},{"num":20,"verse":"They traveled from Rimmon-perez, and stayed at Libnah. "},{"num":21,"verse":"They left Libnah, and stayed at Rissah. "},{"num":22,"verse":"Then they went from Rissah and stayed at Kehelathah. "},{"num":23,"verse":"They went from Kehelathah and stayed at Mount Shepher. "},{"num":24,"verse":"They traveled from Mount Shepher and stayed at Haradah. "},{"num":25,"verse":"They left Haradah and stayed at Makheloth. "},{"num":26,"verse":"Then they traveled from Makheloth, and stayed at Tahath. "},{"num":27,"verse":"They traveled from Tahath, and stayed at Terah. "},{"num":28,"verse":"They went from Terah and stayed at Mithkah. "},{"num":29,"verse":"They left Mithkah and stayed at Hashmonah. "},{"num":30,"verse":"Then they left Hashmonah and stayed at Moseroth. "},{"num":31,"verse":"They went from Moseroth and stayed at Benejaakan. "},{"num":32,"verse":"They traveled from Benejaakan, and stayed at Hor-haggidgad. "},{"num":33,"verse":"They went from Hor-haggidgad and stayed at Jotbathah. "},{"num":34,"verse":"Then they left Jotbathah and stayed at Abronah. "},{"num":35,"verse":"They went from Abronah and stayed at Ezion-geber. "},{"num":36,"verse":"They went from Ezion-geber and stayed in the Desert of Zin, that is, Kadesh. "},{"num":37,"verse":"And they traveled from Kadesh, and stayed at Mount Hor, beside the land of Edom."},{"num":38,"verse":"Then Aaron the religious leader went up to Mount Hor, as the Lord told him. He died there, in the fortieth year after the people of Israel had left the land of Egypt, on the first day of the fifth month. "},{"num":39,"verse":"Aaron was 123 years old when he died on Mount Hor."},{"num":40,"verse":"The Canaanite king of Arad, who lived in the Negev in the land of Canaan, heard of the coming of the people of Israel."},{"num":41,"verse":"Then the people traveled from Mount Hor, and stayed at Zalmonah. "},{"num":42,"verse":"They left Zalmonah, and stayed at Punon. "},{"num":43,"verse":"They went from Punon and stayed at Oboth. "},{"num":44,"verse":"Then they left Oboth and stayed at Iye-abarim, beside Moab. "},{"num":45,"verse":"They traveled from Iyim, and stayed at Dibon-gad. "},{"num":46,"verse":"They went from Dibon-gad and stayed at Almon-diblathaim. "},{"num":47,"verse":"They left Almon-diblathaim and stayed in the mountains of Abarim, near Nebo. "},{"num":48,"verse":"They traveled from the mountains of Abarim, and stayed in the plains of Moab by the Jordan near Jericho. "},{"num":49,"verse":"And they stayed by the Jordan, from Beth-jeshimoth as far as Abelshittim in the plains of Moab."},{"num":50,"verse":"Then the Lord said to Moses in the plains of Moab by the Jordan near Jericho, "},{"num":51,"verse":"“Say to the people of Israel, ‘You will cross over the Jordan into the land of Canaan. "},{"num":52,"verse":"Then drive out all the people living in the land in front of you. Destroy all their cut stones, and all their man-made gods, and all their high places. "},{"num":53,"verse":"Take the land for your own and live in it. For I have given the land to you. "},{"num":54,"verse":"Your families will receive land by drawing names. The larger families should be given more land. The smaller families should be given less land. When a man’s name is drawn, that land will be his. You will receive land by the family groups of your fathers. "},{"num":55,"verse":"Drive out the people who live in the land in front of you. If you do not, then those who are allowed to stay will be like sharp pieces in your eyes and like thorns in your sides. They will trouble you in the land where you live. "},{"num":56,"verse":"And I will do to you as I thought to do to them.’”"}]