[{"header":"Israel’s Journeys Reviewed"},{"num":33,"verse":"These are the journeys of Bnei-Yisrael when they came out of Egypt by their divisions under the hand of Moses and Aaron. "},{"num":2,"verse":"Moses recorded the stages of their journeys at Adonai’s command. These then are their journeys by stages."},{"num":3,"verse":"Bnei-Yisrael set out from Rameses on the fifteenth day of the first month, the first day after Passover. They went out with a high hand in the sight of all Egypt."},{"num":4,"verse":" Now the Egyptians were burying those whom Adonai had struck down among them. Adonai had brought judgments on all their first-born and their gods."},{"num":5,"verse":"Bnei-Yisrael left Rameses and encamped at Succoth. "},{"num":6,"verse":"They departed from Succoth and camped at Etham on the edge of the wilderness. "},{"num":7,"verse":"They left from Etham and turned back toward Pi-Hahiroth, east of Baal-Zephon, and camped before Migdol. "},{"num":8,"verse":"They left from before Pi-Hahiroth and passed through the sea into the wilderness. They traveled three days journey into the wilderness of Etham and camped at Marah. "},{"num":9,"verse":"They departed from Marah and went to Elim. There were twelve water springs and 70 palm trees in Elim, so they camped there. "},{"num":10,"verse":"They left Elim and camped by the Sea of Reeds."},{"num":11,"verse":"They set out from the Sea of Reeds and camped in the wilderness of Sin. "},{"num":12,"verse":"They left from the wilderness of Sin and camped in Dophkah. "},{"num":13,"verse":"They then left Dophkah and camped at Alush. "},{"num":14,"verse":"They left from Alush and camped at Rephidim, where there was no water for the people to drink."},{"num":15,"verse":"They set out from Rephidim and encamped in the Sinai wilderness. "},{"num":16,"verse":"They departed from the Sinai wilderness and camped at Kibroth-hattaavah. "},{"num":17,"verse":"They left from Kibroth-hattaavah and camped at Hazeroth. "},{"num":18,"verse":"Departing Hazeroth, they camped at Rithmah. "},{"num":19,"verse":"Leaving Rithmah, they camped at Rimmon-perez. "},{"num":20,"verse":"They left from Rimmon-perez and camped at Libnah. "},{"num":21,"verse":"They departed Libnah and camped at Rissah. "},{"num":22,"verse":"They left Rissah and camped at Kehelah. "},{"num":23,"verse":"They left Kehelah and camped at Mount Shepher. "},{"num":24,"verse":"They departed Mount Shepher and camped at Haradah. "},{"num":25,"verse":"They departed from Haradah and camped at Makheloth. "},{"num":26,"verse":"They left Makheloth and camped in Tahath."},{"num":27,"verse":"They left from Tahath and camped in Terah. "},{"num":28,"verse":"They left Terah and camped in Mithkah. "},{"num":29,"verse":"They departed Mithkah and camped at Hashmonah. "},{"num":30,"verse":"They left Hashmonah and camped at Moseroth."},{"num":31,"verse":"They left Moseroth and camped at Bene-jaakan. "},{"num":32,"verse":"Departing Bene-jaakan, they camped at Hor-haggidgad. "},{"num":33,"verse":"Leaving Hor-haggidgad, they camped at Jotbah. "},{"num":34,"verse":"They left Jotbah and camped at Abronah. "},{"num":35,"verse":"They departed from Abronah and camped at Ezion-geber. "},{"num":36,"verse":"They left Ezion-geber and encamped at Kadesh in the wilderness of Zin."},{"num":37,"verse":"Leaving Kadesh, they camped at Mount Hor on the border of the land of Edom. "},{"num":38,"verse":"Aaron the kohen went up Mount Hor at Adonai’s command and died there, in the fortieth year since the departure of Bnei-Yisrael from the land of Egypt, on the first day of the fifth month. "},{"num":39,"verse":"Aaron was 123 years old when he died on Mount Hor."},{"num":40,"verse":"The Canaanite king of Arad, who was living in the Negev in the territory of Canaan, heard of the coming of Bnei-Yisrael. "},{"num":41,"verse":"They departed from Mount Hor and camped at Zalmonah. "},{"num":42,"verse":"They left Zalmonah and encamped at Punon. "},{"num":43,"verse":"Departing Punon, they camped at Oboth. "},{"num":44,"verse":"Leaving Oboth, they camped at Ije-abarim on the border of Moab. "},{"num":45,"verse":"They moved on from Ijim and camped at Dibon-gad. "},{"num":46,"verse":"They moved on from Dibon-gad and camped at Almon-diblathaim. "},{"num":47,"verse":"They departed from Almon-diblathaim and camped at the mountains of Abarim, before Nebo."},{"num":48,"verse":"They moved on from the mountains of Abarim and camped in the plains of Moab, by the Jordan, across from Jericho. "},{"num":49,"verse":"They camped along the Jordan, from Beth-jeshimoth to Abel-shittim."},{"num":50,"verse":"Adonai spoke to Moses along the Jordan in the plains of Moab across from Jericho saying, "},{"num":51,"verse":"“Speak to Bnei-Yisrael and say to them: When you cross the Jordan into the land of Canaan, "},{"num":52,"verse":"You must drive out all the inhabitants of the land before you. You must destroy all their idols and cast images, and demolish their high places. "},{"num":53,"verse":"You will take possession of the land, so you will settle in it, because I have given it to you to possess."},{"num":54,"verse":"“You are to divide the land by lot according to your families. To the large, make their inheritance larger, and to the small, make their inheritance smaller. Whatever comes out of the lot will be theirs. You are to distribute the inheritance according to your ancestral tribes."},{"num":55,"verse":"“But if you do not drive out the inhabitants of the land from before you, whoever you allow to remain will become to you barbs in your eyes and thorns in your sides. They will give you trouble in the land in which you will be living. "},{"num":56,"verse":"Then what I had intended to do to them, I will do to you.”"}]