[{"header":"Rules for warfare"},{"num":20,"verse":"When you march out to battle your enemies and you see horses, chariots, and a fighting force larger than yours, don’t be afraid of them, because the Lord your God, the one who brought you up from Egypt, is with you."},{"num":2,"verse":"As you advance toward the war, the priest will come forward and will address the troops."},{"num":3,"verse":"He will say to them: “Listen, Israel: Right now you are advancing to wage war against your enemies. Don’t be discouraged! Don’t be afraid! Don’t panic! Don’t shake in fear on account of them,"},{"num":4,"verse":"because the Lord your God is going with you to fight your enemies for you and to save you.”"},{"num":5,"verse":"The officials will also say to the troops: “Is there anyone here who has just built a new house but hasn’t yet dedicated it? He can leave and go back to his house; otherwise, he might die in the war and someone else would dedicate the house."},{"num":6,"verse":"Or is there anyone here who has planted a vineyard but hasn’t yet put it to good use? He can leave and go back to his house; otherwise, he might die in the battle and someone else would use the vineyard."},{"num":7,"verse":"Or is there anyone here who is engaged but not yet married? He may leave and go back to his house; otherwise, he might die in the battle and someone else would marry his fiancée.”"},{"num":8,"verse":"The officials will continue to address the troops, stating: “Is there anyone here who is afraid and discouraged? He can leave and go back to his house; otherwise, his comrades might lose courage just as he has.”"},{"num":9,"verse":"Once the officials have completed their speech to the troops, the army commanders will assume leadership of the forces."},{"num":10,"verse":"When you approach a city to fight against it, you should first extend peaceful terms to it."},{"num":11,"verse":"If the city responds with peaceful terms and surrenders to you, then all the people in the city will serve you as forced laborers."},{"num":12,"verse":"However, if the city does not negotiate peacefully with you but makes war against you, you may attack it."},{"num":13,"verse":"The Lord your God will hand it over to you; you must kill all the city’s males with the sword."},{"num":14,"verse":"However, you can take for yourselves the women, the children, the animals, and all that is in the city—all its plunder. You can then enjoy your enemies’ plunder, which the Lord your God has given you."},{"num":15,"verse":"That’s what you must do to all the cities that are located far away from you—specifically, those cities that don’t belong to these nations here."},{"num":16,"verse":"But in the case of any of the cities of these peoples—the ones the Lord your God is giving you as an inheritance—you must not spare any living thing."},{"num":17,"verse":"Instead, you must place these under the ban: Hittites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites—just as the Lord your God commanded you."},{"num":18,"verse":"Then they can’t teach you to do all the detestable things they did for their gods, with the result that you end up sinning against the Lord your God."},{"num":19,"verse":"Now if you have been attacking a city for some time, fighting against it and trying to conquer it, don’t destroy its trees by cutting them down with axes. You can eat from those trees; don’t cut them down! Do you think a tree of the field is some sort of warrior to be attacked by you in battle?"},{"num":20,"verse":"That said, if you know that a tree is not a food-producing tree, you are allowed to destroy it, cutting it down and using it in the siege against the city that is fighting against you until it falls."}]