[{"header":"Confidence in Battle"},{"num":20,"verse":"“When you go out to battle against your enemies and see horse and chariot—a people more numerous than you—do not be afraid of them. For Adonai your God, the One who brought you up from the land of Egypt, is with you. "},{"num":2,"verse":"When you draw near to the battle, the kohen will come forward and speak to the people. "},{"num":3,"verse":"He will say to them, ‘Hear, O Israel, you are drawing near today to the battle against your enemies. Don’t be fainthearted! Don’t fear or panic or tremble because of them. "},{"num":4,"verse":"For Adonai your God is the One who goes with you, to fight for you against your enemies to save you.’"},{"num":5,"verse":"“The officers are to speak to the troops saying, ‘What man has built a new house but has not dedicated it? Let him go back to his house—otherwise he might die in the battle and another man would dedicate it. "},{"num":6,"verse":"What man has planted a vineyard but has not put it to use? Let him go back to his house—otherwise he might die in the battle and another man would begin to use it. "},{"num":7,"verse":"What man has become engaged to a woman but has not married her? Let him go back to his house—otherwise he might die in the battle and another man would marry her.’ "},{"num":8,"verse":"The officers will speak further to the troops and say, ‘What man is afraid and fainthearted? Let him go back to his house—so he does not weaken his brothers’ heart like his own.’ "},{"num":9,"verse":"Then when the officers have finished speaking to the troops, they should appoint army commanders at the head of the troops."},{"num":10,"verse":"“When you go near a city to fight against it, call out shalom to it. "},{"num":11,"verse":"Now if it answers you shalom and opens up to you, then all the people found in it will serve you as forced laborers. "},{"num":12,"verse":"If it does not make peace with you but makes war against you, then lay siege against that city. "},{"num":13,"verse":"When Adonai your God hands it over to you, you are to strike all its males with the sword. "},{"num":14,"verse":"Only the women, children, livestock and all that is in the city—all its spoil—may you take as plunder for yourself. So you may consume your enemies’ spoil, which Adonai your God has given you. "},{"num":15,"verse":"Thus you will do to all the cities that are very distant from you, which are not among the towns of these nations nearby. "},{"num":16,"verse":"However, only from the cities of these peoples, which Adonai your God is giving you as an inheritance, you must not let anything that breathes live. "},{"num":17,"verse":"You must utterly destroy them—the Hittites, the Amorites, the Canaanites, the Perizzites, the Hivites and the Jebusites—just as Adonai your God has commanded you. "},{"num":18,"verse":"You are to do this so they will not teach you to do all the abominations as they have done for their gods, and so you would sin against Adonai your God."},{"num":19,"verse":"“When you lay siege to a city for a long time, making war against it to capture it, you are not to destroy its trees by swinging an axe at them. For from them you may eat, so you shall not chop them down. For is the tree of the field human, that it should enter the siege before you? "},{"num":20,"verse":"You may destroy and chop down only the trees that you know are not trees for food, so that you may build siege equipment against the city that is making war with you until its downfall."}]