[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am full of power.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Micah reverts to his denunciation of sin in high places with the fearlessness of his namesake. He contrasts himself with the prophets of the “lying spirit,” and declares his own commission from the Spirit of the Lord, and the ample equipment with which he was endowed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 3:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 3:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Truly I am full of power by the Spirit of the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Here Micah speaks of himself by way of contrast to the false prophets, and declares that he was filled with a divine prophetic influence, and not with dainties, wine, and strong drink, like those false pretenders to prophecy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and of judgment — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To discern truth from error, right from wrong, and to judge properly of times and seasons, and improve them accordingly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And of might — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Of courage, constancy, and resolution to speak whatever God commands me, without being deterred from it by the fear of any one, however great, or in whatever station.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-8 Men cannot expect to do ill, and fare well; but to find that done to them which they did to others. How seldom do wholesome truths reach the ears of those in high stations or in authority! Those who deceive others are preparing confusion for their own faces. The prophet had ardent love to God and to the souls of men; deep concern for his glory and their salvation, and zeal against sin. The difficulties he met with did not drive him from his work. He had this strength; not from and of himself, but he was full of power by the Spirit of the Lord. Those who act honestly, may act boldly. And those who come to hear the word of God, must be willing to be told of their faults, must take it kindly, and be thankful.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And truly I-- (Literally, contrariwise I,) that is, whereas they shall be void and no word in them, \"I am full of (or filled with) power by the Spirit of the Lord and of judgment and might.\" The false prophets, walked after their own spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their only power or influence was from without, from favoring circumstances, from adapting themselves to the great or to the people, going along with the tide, and impelling persons whither they wished to go. The power of the true prophet was inherent, and that by gift of \"the Spirit of the Lord\". And so, while adverse circumstances silenced the false prophets, they called forth the more the energy of the true, whose power was from Him in whose Hands the world is. The adverse circumstances to the false prophets were God's judgments; to the true, they were man's refractoriness, rebellion, oppressiveness. Now was the time of the false prophets; now, at a distance, they could foretell hardily, because they could not yet be convicted of untruth. When trouble came, they went into the inner chamber to hide ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " themselves. Micah, amid the wild tumult of the people ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 65:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was fearless, upborne by Him who controls, stills, or looses it, to do His Sovereign Will.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I am filled with power - So our Lord bade His Apostles, \"Tarry ye, until ye be endued with power from on high\" Luke 24:49 : \"ye shall receive power, after that the Holy Ghost is come upon you\" Acts 1:8; and \"they were all filled with the Holy Ghost\" Acts 2:4. The three gifts, \"power, judgment, might,\" are the fruits of the One Spirit of God, through whom the prophet was filled with them. Of these, \"power\" is always strength residing in the person, whether it be the \"power\" (Exodus 15:6; Exodus 32:11; Numbers 14:17, etc.) or \"might of wisdom\" Job 36:5 of Almighty God Himself, or \"power\" which He imparts Deuteronomy 8:18; Judges 16:5, Judges 16:9, Judges 16:19 or implants . But it is always power lodged in the person, to be put forth by him. Here, as in John the Immerser Luke 1:17 or the Apostles Luk 24:49, it is divine power, given through God the Holy Spirit, to accomplish that for which he was sent, as Paul was endued with might 2 Corinthians 10:5, casting down imaginations and every high thing that exalteth itself against the knowledge of God, and bringing into captivity every thought to the obedience of Christ. It is just that, which is so wanting to human words, which is so characteristic of the word of God, \"power.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I am filled with power - So our Lord bade His Apostles, \"Tarry ye, until ye be endued with power from on high\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"ye shall receive power, after that the Holy Ghost is come upon you\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and \"they were all filled with the Holy Ghost\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The three gifts, \"power, judgment, might,\" are the fruits of the One Spirit of God, through whom the prophet was filled with them. Of these, \"power\" is always strength residing in the person, whether it be the \"power\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 32:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 14:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.) or \"might of wisdom\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of Almighty God Himself, or \"power\" which He imparts ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 8:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 16:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 16:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 16:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or implants . But it is always power lodged in the person, to be put forth by him. Here, as in John the Immerser ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or the Apostles Luk 24:49, it is divine power, given through God the Holy Spirit, to accomplish that for which he was sent, as Paul was endued with might ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 10:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", casting down imaginations and every high thing that exalteth itself against the knowledge of God, and bringing into captivity every thought to the obedience of Christ. It is just that, which is so wanting to human words, which is so characteristic of the word of God, \"power.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Judgment\" is, from its form, not so much discernment in the human being, as \"the thing judged,\" pronounced by God, the righteous judgment of God, and righteous judgment in man conformably therewith (as in Proverbs 1:3; Isaiah 1:21; Isaiah 5:7). It was what, he goes on to say, the great men of his people abhorred Micah 3:9, equity. With this he was filled. This was the substance of his message, right judgment to be enacted by them, to which he was to exhort them, or which, on their refusal, was to be pronounced upon them in the Name of God the Judge of all, and to be executed upon them. \"Might\" is courage or boldness to deliver the message of God, not awed or hindered by any adversaries. It is that holy courage, of which Paul speaks, \"that utterance may be given unto me, that I may open my mouth boldly, to make known the mystery of the gospel, for which I am an ambassador in bonds, that therein I may speak boldly, as I ought to speak\" Ephesians 6:19-20. So too, after the Apostles had been \"straitly threatened that they should speak no more in the Name of Jesus, all, having prayed, were filled with the Holy Spirit, and spake the word of God with boldness\" Acts 4:18, Acts 4:31. Dionysius: \"Whoso is so strengthened and arrayed, uttereth fiery words, Whereby hearers' hearts are moved and changed. But whoso speaketh of his own mind, doth good neither to himself nor others.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Judgment\" is, from its form, not so much discernment in the human being, as \"the thing judged,\" pronounced by God, the righteous judgment of God, and righteous judgment in man conformably therewith (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It was what, he goes on to say, the great men of his people abhorred ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", equity. With this he was filled. This was the substance of his message, right judgment to be enacted by them, to which he was to exhort them, or which, on their refusal, was to be pronounced upon them in the Name of God the Judge of all, and to be executed upon them. \"Might\" is courage or boldness to deliver the message of God, not awed or hindered by any adversaries. It is that holy courage, of which Paul speaks, \"that utterance may be given unto me, that I may open my mouth boldly, to make known the mystery of the gospel, for which I am an ambassador in bonds, that therein I may speak boldly, as I ought to speak\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 6:19-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". So too, after the Apostles had been \"straitly threatened that they should speak no more in the Name of Jesus, all, having prayed, were filled with the Holy Spirit, and spake the word of God with boldness\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 4:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Dionysius: \"Whoso is so strengthened and arrayed, uttereth fiery words, Whereby hearers' hearts are moved and changed. But whoso speaketh of his own mind, doth good neither to himself nor others.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "So then, of the three gifts, \"power\" expresses the divine might lodged in him; \"judgment,\" the substance of what he had to deliver; \"might or courage,\" the strength to deliver it in face of human power, persecution, ridicule, death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lap.: \"These gifts the prophets know are not their own, but are from the Spirit of God, and are by Him inspired into them. Such was the spirit of Elijah, unconquered, energetic, fiery, of whom it is said, 'Then stood up Elias as fire, and his word burned like a lamp' (Ecclus. 48:1). Such was Isaiah, 'Cry aloud, spare not, lift up thy voice like a trumpet, and shew My people their transgression and the house of Jacob their sins' Isaiah 58:1. Such was Jeremiah; 'Therefore I am full of the fury of the Lord; I am weary of holding in. I have set thee for a trier among My people, a strong fort; and thou shalt know and try their ways' Jeremiah 6:11, Jeremiah 6:27. Such was John Baptist, who said, 'O generation of vipers, who hath warned you to flee from the wrath to come?' Matthew 3:7. Such was Paul, who, when he Acts 24:25 reasoned of temperance, righteousness and judgment to come, made Felix tremble, though unbelieving and ungodly. Such were the Apostles, who, when they had received the Holy Spirit Psalm 48:8, broke, with a mighty breath, ships and kings of Tarshish. Such will be Elias and Enoch at the end of the world, striving against antichrist, of whom it is said Revelation 11:5, if any man will hurt them, fire proceedeth out of their mouth and devoureth their enemies.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lap.: \"These gifts the prophets know are not their own, but are from the Spirit of God, and are by Him inspired into them. Such was the spirit of Elijah, unconquered, energetic, fiery, of whom it is said, 'Then stood up Elias as fire, and his word burned like a lamp' (Ecclus. 48:1). Such was Isaiah, 'Cry aloud, spare not, lift up thy voice like a trumpet, and shew My people their transgression and the house of Jacob their sins' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 58:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Such was Jeremiah; 'Therefore I am full of the fury of the Lord; I am weary of holding in. I have set thee for a trier among My people, a strong fort; and thou shalt know and try their ways' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Such was John Baptist, who said, 'O generation of vipers, who hath warned you to flee from the wrath to come?' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Such was Paul, who, when he ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 24:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " reasoned of temperance, righteousness and judgment to come, made Felix tremble, though unbelieving and ungodly. Such were the Apostles, who, when they had received the Holy Spirit ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", broke, with a mighty breath, ships and kings of Tarshish. Such will be Elias and Enoch at the end of the world, striving against antichrist, of whom it is said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", if any man will hurt them, fire proceedeth out of their mouth and devoureth their enemies.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. I—in contrast to the false prophets (Mic 3:5, 7).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "full of power—that which \"the Spirit of Jehovah\" imparts for the discharge of the prophetical function (Lu 1:17; 24:49; Ac 1:8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "judgment—a sense of justice [Maurer]; as opposed to the false prophets' speaking to please men, not from a regard to truth. Or, \"judgment\" to discern between graver and lighter offenses, and to denounce punishments accordingly [Grotius].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "might—moral intrepidity in speaking the truth at all costs (2Ti 1:7).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to declare unto Jacob his … sin—(Isa 58:1). Not to flatter the sinner as the false prophets do with promises of peace.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But truly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " notwithstanding this shame and silence covering these false prophets, yet, saith Micah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am full of power; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " courage, vivacity, and ability, becoming a prophet of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By the Spirit of the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not from himself, but from the Spirit of God given to him, and duly qualifying him to the faithful discharge of the prophetic office; and without fear, flattery, by-respects, or self-seeking, I have already, and still do, and will declare the sins, duties, and dangers of this people, that they may repent and be saved, or my God may be justified when he judgeth, and this people may know the difference between a false and true prophet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And of judgment; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a spirit of judgment to discern aright times and seasons, to discern right from wrong, truth from lies, and pure worship of God from idolatry, and what are the consequents of all these to a people who decline from the way of truth and purity, or adhere to it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And of might; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " resolution, undaunted in speaking God’s word to the greatest of men; as I have dared, I still do dare to tell the heads of Jacob and princes of Israel what they do against God, and what God will do against them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To declare unto Jacob his transgression; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with impartial reproofs, with severe menaces from God, to preach against Jacob’s transgressions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And to Israel his sin; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the same repeated. All the twelve tribes have sinned, and God will visit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But truly I am full of power by the Spirit of the Lord,.... Or, \"full of power, even, the Spirit of the Lord\", as Gussetius (f), by way of contrast, and as explaining what is meant by power; for so the Spirit is sometimes called from his gifts and graces, which are powerful in men; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These are the words of Micah concerning himself, in opposition to the false prophets, who are destitute of the Spirit of God; men of mean sordid dispositions, that had nothing but sinister and selfish ends in view, and not in the least qualified for the office and character they bore; whereas he could say of himself, with truth, that he was possessed of sufficient abilities for such an employment; and which he had, not of himself, but from the Spirit of God, who gives gifts to men, and divides them to each as he will; so that this was no vaunt and vain boast, or a piece of arrogance and ostentation in the prophet; since he only opposes himself to the false prophets, and ascribes his endowments and qualifications, not to himself, but to the Spirit of God; he had, though they had not, answers from the Lord, visions and prophecies from him, with a commission and abilities from him to execute the office of a prophet, being under the inspiration of the Spirit of God, and full of him and his gifts: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and of judgment, and of might; or of the judgment of truth, as the Targum; being able to discern truth and error, between what comes from the Spirit of God, and what from a lying spirit, or a spirit of divination and falsehood; what is proper to, be spoken, when the right time, and to whom; and having courage and greatness of mind, fearing no man's person or face, but bold ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to declare unto Jacob his transgression, and to Israel his sin; freely and openly to set it before them in a true light, with all aggravating circumstances, and reprove them for the same; and threaten them with the judgments of God in case they, repented not; see Isaiah 58:1; and as a proof of all this, says what follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "to declare unto Jacob his transgression, and to Israel his sin; freely and openly to set it before them in a true light, with all aggravating circumstances, and reprove them for the same; and threaten them with the judgments of God in case they, repented not; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 58:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and as a proof of all this, says what follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Ebr. Comment. p. 468. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Ebr. Comment. p. 468. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But truly I am full {g} of power by the spirit of the LORD, and of judgment, and of might, to declare unto Jacob his transgression, and to Israel his sin.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But truly I am full ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of power by the spirit of the LORD, and of judgment, and of might, to declare unto Jacob his transgression, and to Israel his sin.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) The Prophet being assured of his vocation by the Spirit of God, sets himself alone against all the wicked, showing how God gave him gifts, ability and knowledge, to discern between good and evil, and also steadfastness and endurance to reprove the sins of the people, and not to flatter them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But truly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The sign of a fresh paragraph, placed here in most editions, should rather be at the beginning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Micah 3:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 3:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Micah contrasts his own powers and acts with those of the false prophets. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I am full of power by the Spirit of the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Micah asserts that he speaks and sots by the direct inspiration of God; he claims three gifts bestowed upon him by the Holy Spirit to enable him to effect his purpose. The first of these is \"power,\" - such might imparted to him that his words fall with force and proclaim their Divine origin (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The second gift is judgment - the righteous judgment of God; this fills his mind and comprises all his message. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The third gift is might,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a holy courage that enables him to face any danger in delivering his testimony (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In these points he is in strong contrast to the false prophets, who were not inspired by the Spirit of God. spoke not with power, called good evil, and evil good, were timid and time-serving. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jacob... Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The two are identical as in ver. 1, and the clauses in which they occur contain the same thought repeated for emphasis' sake. Micah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the second strophe, Micah turns from the godless princes and judges to the prophets who lead the people astray, with whom he contrasts the true prophets and their ways. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus saith Jehovah concerning the prophets who lead my people astray, who bite with their teeth, and preach peace; and whoever should put nothing into their mouths, against him they sanctify war. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore night to you because of the visions, and darkness to you because of the soothsaying! and the sun will set over the prophets, and the day blacken itself over them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the seers will be ashamed, and the soothsayers blush, and all cover their beard, because (there is) no answer of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But I, I am filled with power, with the Spirit of Jehovah, and with judgment and strength, to show to Jacob his transgression, and to Israel his sin.\" As the first strophe attaches itself to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so does the second to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", carrying out still further what is there affirmed concerning the false prophets. Micah describes them as people who predict peace and prosperity for a morsel of bread, and thereby lead the people astray, setting before them prosperity and salvation, instead of preaching repentance to them, by charging them with their sins. Thus they became accomplices of the wicked rulers, with whom they are therefore classed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", together with the wicked priests. המּתעים, leading astray (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") my people, namely, by failing to charge them with their sins, and preach repentance, as the true prophets do, and predicting prosperity for bread and payment. The words, \"who bite with their teeth,\" are to be connected closely with the next clause, \"and they preach peace,\" in the sense of \"who preach peace if they can bite with their teeth,\" i.e., if they receive something to bite (or eat). This explanation, which has already been expressed by the Chaldee, is necessarily required by the antithesis, \"but whoever puts nothing into their mouth,\" i.e., gives them nothing to eat, notwithstanding the fact that in other passages nâshakh only signifies to bite, in the sense of to wound, and is the word generally applied to the bite of a snake (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If, however, we understand the biting with the teeth as a figurative representation of the words of the prophets who always preach prosperity, and of the injury they do to the real welfare of the people (Ros., Casp., and others), the obvious antithesis of the two double clauses of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is totally destroyed. The harsh expression, to \"bite with the teeth,\" in the sense of \"to eat,\" is perfectly in harmony with the harsh words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Qiddēsh milchâmâh, to sanctify war, i.e., to preach a holy war (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or, in reality, to proclaim the vengeance of God. For this shall night and darkness burst upon them. Night and darkness denote primarily the calamity which would come upon the false prophets (unto you) in connection with the judgment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The sun which sets to them is the sun of salvation or prosperity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and the day which becomes black over them is the day of judgment, which is darkness, and not light (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This calamity is heightened by the fact that they will then stand ashamed, because their own former prophecies are thereby proved to be lies, and fresh, true prophecies fail them, because God gives no answer. \"Convicted by the result, they are thus utterly put to shame, because God does not help them out of their trouble by any word of revelation\" (Hitzig). Bōsh, to be ashamed, when connected with châphēr (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., etc.), signifies to become pale with shame; châphēr, to blush, with min causae, to denote the thing of which a man is ashamed. Qōsemı̄m (diviners) alternates with chōzı̄m (seers), because these false prophets had no visions of God, but only divinations out of their own hearts. ‛Atâh sâphâm: to cover the beard, i.e., to cover the face up to the nose, is a sign of mourning (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), here of trouble and shame (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 24:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is really equivalent to covering the head (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Ma‛ănēh, the construct state of the substantive, but in the sense of the participle; some codd. have indeed מענה. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Micah contrasts himself and his own doings with these false prophets, as being filled with power by the Spirit of Jehovah (i.e., through His assistance) and with judgment. Mishpât, governed by מלא, is the divine justice which the prophet has to proclaim, and gebhūrâh strength, manliness, to hold up before the people their sins and the justice of God. In this divine strength he can and must declare their unrighteousness to all ranks of the people, and predict the punishment of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:9-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]