[{"num":11,"verse":"Then the Israelites found David at Hebron and acknowledged him as their king."},{"num":3,"verse":"So all the elders of Israel came to coronate their king at Hebron. David made a covenant with them that the Eternal One witnessed; and they anointed him king over Israel, as the Eternal had commanded them to do through the seer, Samuel."},{"num":4,"verse":"Then David and his subjects traveled from Hebron to Jebus, which is now known as Jerusalem, where the Jebusites lived. "},{"num":5,"verse":"The Jebusites threatened David, “You shall not pass through these gates.” Nevertheless David captured the stronghold (Zion), now known as the city of David, and made it his capital."},{"num":7,"verse":"After the conquest David lived in Zion, so it became known as the “city of David.” "},{"num":8,"verse":"He fortified the city with earthen ramparts while Joab repaired the damages caused by the conquest. "},{"num":9,"verse":"David, along with the city, grew in power because the Eternal One, Commander of heavenly armies supported him."},{"num":10,"verse":"These are leaders of the warriors whom David commanded. They and the citizens of Israel supported him in his rule, as the Eternal desired for Israel when He chose David as king. "},{"num":11,"verse":"So what follows is an accounting of David’s great warriors. Jashobeam (son of a Hachmonite) was the chief of 30, the highest-ranking officers in David’s army. He slaughtered 300 men in one battle with his spear."},{"num":12,"verse":"Second in command was Eleazar (son of Dodo the Ahohite), who was one of three notable warriors. "},{"num":13,"verse":"He fought alongside David in a barley field called Pasdammim when the people fled from the Philistines. "},{"num":14,"verse":"Together they repelled the Philistines from the field, and the Eternal delivered them from the Philistines with a great victory."},{"num":15,"verse":"Three other of the 30 chiefs pursued the Philistines to their camp in the valley of Rephaim (between Jerusalem and Bethlehem). These other chiefs waited with David in a rocky area of the cave of Adullam, west of Bethlehem. "},{"num":16,"verse":"While David was in his stronghold and the Philistine garrison was in Bethlehem, "},{"num":17,"verse":"the king was very thirsty."},{"num":18,"verse":"The three warriors broke through the Philistine camp in the valley of Rephaim, drew water from the well of Bethlehem near the gate, and took it to David. In spite of his thirst, David would not drink it. Instead he poured it out as an offering to the Eternal One."},{"num":20,"verse":"Abshai, Joab’s brother and leader of these 30, slaughtered 300 men in one battle with his spear and made a notable name for himself. "},{"num":21,"verse":"Of the three in the second rank, Abshai was the most honored and became their commander, but he was never promoted to the highest rank."},{"num":22,"verse":"Benaiah (son of Jehoiada, son of a warrior of Kabzeel) performed great deeds—he killed the two warriors of Moab, killed a lion inside a pit on a snowy day, "},{"num":23,"verse":"and killed a seven-foot-six-inch-tall Egyptian, who carried a curved spear (the size and shape of a weaver’s beam). Benaiah attacked this Egyptian with a club, stole the spear from the Egyptian’s hand, and killed him with the same spear. "},{"num":24,"verse":"Because of these great deeds, Benaiah (Jehoiada’s son) had a powerful reputation equal to that of the three mighty men. "},{"num":25,"verse":"He was honored among the 30, but he did not achieve the status of the three. Because of Benaiah’s effectiveness in battle, David appointed him captain of the king’s guard."},{"num":26,"verse":"The warriors of the armies were Asahel (another brother of Joab), Elhanan (son of Dodo of Bethlehem), "},{"num":27,"verse":"Shammoth the Harorite, Helez the Pelonite, "},{"num":28,"verse":"Ira (son of Ikkesh the Tekoite), Abiezer the Anathothite, "},{"num":29,"verse":"Sibbecai the Hushathite, Ilai the Ahohite, "},{"num":30,"verse":"Maharai the Netophathite, Heled (son of Baanah the Netophathite), "},{"num":31,"verse":"Ithai (son of Ribai of Gibeah the Benjaminite), Benaiah the Pirathonite, "},{"num":32,"verse":"Hurai of the brooks of Gaash, Abiel the Arbathite, "},{"num":33,"verse":"Azmaveth the Baharumite, Eliahba the Shaalbonite, "},{"num":34,"verse":"the sons of Hashem the Gizonite, Jonathan (son of Shagee the Hararite), "},{"num":35,"verse":"Ahiam (son of Sacar the Hararite), Eliphal (son of Ur), "},{"num":36,"verse":"Hepher the Mecherathite, Ahijah the Pelonite, "},{"num":37,"verse":"Hezro the Carmelite, Naarai (son of Ezbai), "},{"num":38,"verse":"Joel (brother of Nathan), Mibhar (son of Hagri), "},{"num":39,"verse":"Zelek the Ammonite, Naharai the Berothite, the armor bearer of Joab (son of Zeruiah), "},{"num":40,"verse":"Ira the Ithrite, Gareb the Ithrite, "},{"num":41,"verse":"Uriah the Hittite, Zabad (son of Ahlai), "},{"num":42,"verse":"Adina (son of Shiza, a Reubenite chief) and 30 with him, "},{"num":43,"verse":"Hanan (son of Maacah), Joshaphat the Mithnite, "},{"num":44,"verse":"Uzzia the Ashterathite, Shama and Jeiel (sons of Hotham the Aroerite), "},{"num":45,"verse":"Jediael and Joha (sons of Shimri the Tizite), "},{"num":46,"verse":"Eliel the Mahavite, Jeribai and Joshaviah (sons of Elnaam), Ithmah the Moabite, "},{"num":47,"verse":"Eliel, Obed, and Jaasiel the Mezobaite."}]