[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which is.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and he is. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The suddenness of the Oriental sunrise is finely caught in the image of the uplifted tent-curtain and appearance of the radiant hero (“strong man;” Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gibbor. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This want of twilight, this absence of silent preparation for the supreme moment, distinguishes Eastern songs of sunrise from the poetry of the West. There are no musterings of “mute companies of changeful clouds,” no “avant couriers of the light,” no “grey lines fretting the clouds as messengers of day.” Unheralded, unannounced, the sun leaps forth in all his splendour—a young bridegroom with the joy of the wedding-day still on his countenance, a hero leaping forth on his path of conquest and glory. How different the suggested feeling of this from the wistful tenderness of Milton’s dawn coming forth “with pilgrim steps in amice grey;” or Shakespeare’s “morn in russet clad,” that “walks o’er the dew” of the high eastern hill.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Chamber.—Heb., chuphah, a marriage chamber or bed (Joel 2:16). In later Hebrew the canopy carried over the wedded pair, or even the marriage itself.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Chamber.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Heb., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "chuphah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "a marriage chamber or bed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In later Hebrew the canopy carried over the wedded pair, or even the marriage itself.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Rejoiceth.—Literally, leaps for joy.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Rejoiceth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "leaps for joy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A race.—Better, his race, i.e., his daily course or journey.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "A",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "race.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "his race, i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "his daily course or journey.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-6 The heavens so declare the glory of God, and proclaim his wisdom, power, and goodness, that all ungodly men are left without excuse. They speak themselves to be works of God's hands; for they must have a Creator who is eternal, infinitely wise, powerful, and good. The counter-changing of day and night is a great proof of the power of God, and calls us to observe, that, as in the kingdom of nature, so in that of providence, he forms the light, and creates the darkness, Isa 45:7, and sets the one against the other. The sun in the firmament is an emblem of the Sun of righteousness, the Bridegroom of the church, and the Light of the world, diffusing Divine light and salvation by his gospel to the nations of the earth. He delights to bless his church, which he has espoused to himself; and his course will be unwearied as that of the sun, till the whole earth is filled with his light and salvation. Let us pray for the time when he shall enlighten, cheer, and make fruitful every nation on earth, with the blessed salvation. They have no speech or language, so some read it, and yet their voice is heard. All people may hear these preachers speak in their own tongue the wonderful works of God. Let us give God the glory of all the comfort and benefit we have by the lights of heaven, still looking above and beyond them to the Sun of righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Which is as a bridegroom coming out of his chamber - That is, when he rises in the morning. He rises from the darkness of the night, and comes forth as the bridegroom comes out of the chamber where he has slept. The allusion is to the bright, and joyful, and cheerful aspect of the rising sun. The image of the bridegroom is employed because we associate with a bridegroom the idea of hilarity, cheerfulness, joy. The essential image is that the sun seems to rise from a night of repose, as man does in the morning, and that after such a night of repose he goes forth with cheerfulness and alacrity to the employments of the day. The figure is an obvious but a very beautiful one, though there is a transition from the image employed in the previous verse, where the sun is represented as dwelling in a tent or tabernacle fitted up for it in the heavens. In the next member of the sentence the figure is again changed, by his being represented as a man prepared to run a race.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And rejoiceth as a strong man to run a race - As a man who is vigorous and powerful, when he enters on a race. He is girded for it; he summons all his strength; he seems to exult in the idea of putting his strength to the test, and starting off on his career. Compare the note at 1 Corinthians 9:24-27. The same comparison which is employed here occurs in the Zendavesta, ii. 106. DeWette. The idea is that the sun seems to have a long journey before him, and puts forth all his vigour, exulting in the opportunity of manifesting that vigour, and confident of triumphing in the race. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And rejoiceth as a strong man to run a race - As a man who is vigorous and powerful, when he enters on a race. He is girded for it; he summons all his strength; he seems to exult in the idea of putting his strength to the test, and starting off on his career. Compare the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:24-27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The same comparison which is employed here occurs in the Zendavesta, ii. 106. DeWette. The idea is that the sun seems to have a long journey before him, and puts forth all his vigour, exulting in the opportunity of manifesting that vigour, and confident of triumphing in the race. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. The sun, as the most glorious heavenly body, is specially used to illustrate the sentiment; and his vigorous, cheerful, daily, and extensive course, and his reviving heat (including light), well display the wondrous wisdom of his Maker.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As a bridegroom; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gloriously adorned with light as with a beautiful garment, and smiling upon the lower world with a pleasant countenance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Coming out of his chamber; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in which he is poetically supposed to have rested all night, and thence to break forth as it were on a sudden, as both sacred and profane poets represent the matter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As a strong man; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who being conscious and confident of his own strength, and promising to himself victory and the glory which attends it, sets upon his work with great pleasure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Which is as a bridegroom coming out of his chamber,.... His nuptial chamber, on which Elias writes (y), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"we call the garment (or canopy) spread over the head of the bridegroom and bride, supported by four pillars, in the time of their espousals, '' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who looks lovely and beautiful in his nuptial robes, cheerful and pleasant in his countenance, creating pleasure and delight in all his friends that see him and hear his voice: and this simile is expressive of the brightness and glory of the sun when it rises; and of the joy and pleasure which it produces in the minds of men when they behold it: all which sets forth the loveliness and beauty of Christ, as he is held forth in the ministration of the Gospel, and the joy unspeakable and full of glory which his presence yields, after a short departure from his people; see Isaiah 61:10; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who looks lovely and beautiful in his nuptial robes, cheerful and pleasant in his countenance, creating pleasure and delight in all his friends that see him and hear his voice: and this simile is expressive of the brightness and glory of the sun when it rises; and of the joy and pleasure which it produces in the minds of men when they behold it: all which sets forth the loveliness and beauty of Christ, as he is held forth in the ministration of the Gospel, and the joy unspeakable and full of glory which his presence yields, after a short departure from his people; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and rejoiceth as a strong man to run a race; in which he shows his readiness, velocity, and strength; and this denotes the swiftness of the sun in running its course, and its indefatigableness in its constant motion; though it has been employed therein for so many thousands of years, yet every morning rises with the same cheerfulness, pursues its course, and is never weary: all which may point at the readiness of Gospel ministers, their swiftness to run to and fro, and their strength to fulfil the course of their ministry, in which Christ, the sun of righteousness, is held forth in so glorious a manner. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) Elias, in his Tishbi, p. 119. The same word is used Isa. iv. 5. and translated \"a defence\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) Elias, in his Tishbi, p. 119. The same word is used Isa. iv. 5. and translated \"a defence\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Which is as a bridegroom coming out of his {e} chamber, and rejoiceth as a strong man to run a race.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as a bridegroom coming out of his ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " chamber, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rejoiceth as a strong man to run a race.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Or vail. The custom was that the bride and bridegroom would stand under a vail together, and after come forward with great solemnity and rejoicing of the assembly.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thence he comes forth morning by morning like the bridegroom in all the splendour of his bridal attire, in all the freshness of youthful vigour and buoyant happiness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): like the hero exulting in the consciousness of strength, and eager to put it to the proof. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 5:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Which is as a bridegroom coming out of his chamber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and he is as a bridegroom.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The bridegroom went forth to meet the bride in glorious apparel, and \"preceded by a blaze of torch-light\" (Kay). The sun's \"chamber\" is where he passes the night - below the earth; from this he bursts forth at morning in his full glory, scattering the darkness, and lighting up his splendid \"tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": ".\" And rejoiceth as a strong man-to run a race",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"As the sun when he goeth forth ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in his might\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Prayer-book Version, if less literal, better conveys the spirit of the original. Psalm 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 19:5-7) Since אמר and דברים are the speech and words of the heavens, which form the ruling principal notion, comprehending within itself both יום and לילה, the suffixes of קוּם and מלּיהם must unmistakeably refer to השׁמים in spite of its being necessary to assign another reference to קולם in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows how we are to understand קו in connection with יצא. The measuring line of the heavens is gone forth into all the earth, i.e., has taken entire possession of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " tells us what kind of measuring line is intended, viz., that of their heraldship: their words (from מלּה, which is more Aramaic than Hebrew, and consequently more poetic) reach to the end of the world, they fill it completely, from its extreme boundary inwards. Isaiah's קו, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " :10, is inapplicable here, because it does not mean commandment, but rule, and is there used as a word of derision, rhyming with צו. The ὁ φθόγγος αὐτῶν of the lxx (ὁ ἦχος αὐτῶν Symm.) might more readily be justified, inasmuch as קו might mean a harpstring, as being a cord in tension, and then, like τόνος (cf. τοναία), a tone or sound (Gesenius in his Lex., and Ewald), if the reading קולם does not perhaps lie at the foundation of that rendering. But the usage of the language presents with signification of a measuring line for קו when used with יצא (Aq. κανών, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and this gives a new thought, whereas in the other case we should merely have a repetition of what has been already expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Paul makes use of these first two lines of the strophe in order, with its very words, to testify to the spread of the apostolic message over the whole earth. Hence most of the older expositors have taken the first half of the Psalm to be an allegorical prediction, the heavens being a figure of the church and the sun a figure of the gospel. The apostle does not, however, make a formal citation in the passage referred to, he merely gives a New Testament application to Old Testament language, by taking the all-penetrating praeconium coelorum as figure of the all-penetrating praeconium evangelii; and he is fully justified in so doing by the parallel which the psalmist himself draws between the revelation of God in nature and in the written word.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The reference of בּהם to השׁמים is at once opposed by the tameness of the thought so obtained. The tent, viz., the retreat (אהל, according to its radical meaning a dwelling, from אהל, cogn. אול, to retire from the open country) of the sun is indeed in the sky, but it is more naturally at the spot where the sky and the קצה תבל meet. Accordingly בהם has the neuter signification \"there\" (cf. Isaiah 30:6); and there is so little ground for reading שׁם instead of שׂם, as Ewald does, that the poet on the contrary has written בהם and not שׁם, because he has just used שׂם (Hitzig). The name of the sun, which is always feminine in Arabic, is predominantly masculine in Hebrew and Aramaic (cf. on the other hand Genesis 15:17, Nahum 3:17, Isaiah 45:6, Malachi 4:2); just as the Sabians and heathen Arabs had a sun-god (masc.). Accordingly in Psalm 19:6 the sun is compared to a bridegroom, who comes forth in the morning out of his חפּה. Joel 2:16 shows that this word means a bride-chamber; properly (from חפף to cover) it means a canopy (Isaiah 4:5), whence in later Hebrew the bridal or portable canopy (Talmud. בּית גּננא), which is supported by four poles and borne by four boys, at the consecration of the bridal pair, and then also the marriage itself, is called chuppa. The morning light has in it a freshness and cheerfulness, as it were a renewed youth. Therefore the morning sun is compared to a bridegroom, the desire of whose heart is satisfied, who stands as it were at the beginning of a new life, and in whose youthful countenance the joy of the wedding-day still shines. And as at its rising it is like a bridegroom, so in its rapid course (Sir. 43:5) it is like a hero (vid., on Psalm 18:34), inasmuch as it marches on its way ever anew, light-giving and triumphant, as often as it comes forth, with גּבוּרה (Judges 5:31). From one end of heaven, the extreme east of the horizon, is its going forth, i.e., rising (cf. Hosea 6:3; the opposite is מבוא going in  equals  setting), and its circuit (תּקוּפה, from קוּף  equals  נקף, Isaiah 29:1, to revolve) על־קצותם, to their (the heavens') end ( equals  עד Deuteronomy 4:32), cf. 1 Esdr. 4:34: ταχὺς τῷ δρόμῳ ὁ ἥλιος, ὅτι στρέφεται ἐν τῷ κύκλῳ τοῦ οὐρανοῦ καὶ πάλιν ἀποτρέχει εἰς τὸν ἑαυτοῦ τόπον ἐν μιᾷ ἡμέρᾳ. On this open way there is not נסתּר, anything hidden, i.e., anything that remains hidden, before its heat. חמּה is the enlightening and warming influence of the sun, which is also itself called חמּה in poetry. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The reference of בּהם to השׁמים is at once opposed by the tameness of the thought so obtained. The tent, viz., the retreat (אהל, according to its radical meaning a dwelling, from אהל, cogn. אול, to retire from the open country) of the sun is indeed in the sky, but it is more naturally at the spot where the sky and the קצה תבל meet. Accordingly בהם has the neuter signification \"there\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and there is so little ground for reading שׁם instead of שׂם, as Ewald does, that the poet on the contrary has written בהם and not שׁם, because he has just used שׂם (Hitzig). The name of the sun, which is always feminine in Arabic, is predominantly masculine in Hebrew and Aramaic (cf. on the other hand ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); just as the Sabians and heathen Arabs had a sun-god (masc.). Accordingly in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the sun is compared to a bridegroom, who comes forth in the morning out of his חפּה. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shows that this word means a bride-chamber; properly (from חפף to cover) it means a canopy (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), whence in later Hebrew the bridal or portable canopy (Talmud. בּית גּננא), which is supported by four poles and borne by four boys, at the consecration of the bridal pair, and then also the marriage itself, is called chuppa. The morning light has in it a freshness and cheerfulness, as it were a renewed youth. Therefore the morning sun is compared to a bridegroom, the desire of whose heart is satisfied, who stands as it were at the beginning of a new life, and in whose youthful countenance the joy of the wedding-day still shines. And as at its rising it is like a bridegroom, so in its rapid course (Sir. 43:5) it is like a hero (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), inasmuch as it marches on its way ever anew, light-giving and triumphant, as often as it comes forth, with גּבוּרה (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). From one end of heaven, the extreme east of the horizon, is its going forth, i.e., rising (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the opposite is מבוא going in  equals  setting), and its circuit (תּקוּפה, from קוּף  equals  נקף, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to revolve) על־קצותם, to their (the heavens') end ( equals  עד ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), cf. 1 Esdr. 4:34: ταχὺς τῷ δρόμῳ ὁ ἥλιος, ὅτι στρέφεται ἐν τῷ κύκλῳ τοῦ οὐρανοῦ καὶ πάλιν ἀποτρέχει εἰς τὸν ἑαυτοῦ τόπον ἐν μιᾷ ἡμέρᾳ. On this open way there is not נסתּר, anything hidden, i.e., anything that remains hidden, before its heat. חמּה is the enlightening and warming influence of the sun, which is also itself called חמּה in poetry. ",
            "children": []
          }
        ]
      }
    ]
  }
]