[{"num":1,"verse":"From Paul, a bond servant of Jesus Christ (the Messiah) called to be an apostle, (a special messenger) set apart to [preach] the Gospel (good news) of and from God,"},{"num":2,"verse":"Which He promised in advance [long ago] through His prophets in the sacred Scriptures—"},{"num":3,"verse":"[The Gospel] regarding His Son, Who as to the flesh (His human nature) was descended from David,"},{"num":4,"verse":"And [as to His divine nature] according to the Spirit of holiness was openly designated the Son of God in power [in a striking, triumphant and miraculous manner] by His resurrection from the dead, even Jesus Christ our Lord (the Messiah, the Anointed One)."},{"num":5,"verse":"It is through Him that we have received grace (God’s unmerited favor) and [our] apostleship to promote obedience to the faith and make disciples for His name’s sake among all the nations,"},{"num":6,"verse":"And this includes you, called of Jesus Christ and invited [as you are] to belong to Him."},{"num":7,"verse":"To [you then] all God’s beloved ones in Rome, called to be saints and designated for a consecrated life: Grace and spiritual blessing and peace be yours from God our Father and from the Lord Jesus Christ."},{"num":8,"verse":"First, I thank my God through Jesus Christ for all of you, because [the report of] your faith is made known to all the world and is commended everywhere."},{"num":9,"verse":"For God is my witness, Whom I serve with my [whole] spirit [rendering priestly and spiritual service] in [preaching] the Gospel and [telling] the good news of His Son, how incessantly I always mention you when at my prayers."},{"num":10,"verse":"I keep pleading that somehow by God’s will I may now at last prosper and come to you."},{"num":11,"verse":"For I am yearning to see you, that I may impart and share with you some spiritual gift to strengthen and establish you;"},{"num":12,"verse":"That is, that we may be mutually strengthened and encouraged and comforted by each other’s faith, both yours and mine."},{"num":13,"verse":"I want you to know, brethren, that many times I have planned and intended to come to you, though thus far I have been hindered and prevented, in order that I might have some fruit (some result of my labors) among you, as I have among the rest of the Gentiles."},{"num":14,"verse":"Both to Greeks and to barbarians (to the cultured and to the uncultured), both to the wise and the foolish, I have an obligation to discharge and a duty to perform and a debt to pay."},{"num":15,"verse":"So, for my part, I am willing and eagerly ready to preach the Gospel to you also who are in Rome."},{"num":16,"verse":"For I am not ashamed of the Gospel (good news) of Christ, for it is God’s power working unto salvation [for deliverance from eternal death] to everyone who believes with a personal trust and a confident surrender and firm reliance, to the Jew first and also to the Greek,"},{"num":17,"verse":"For in the Gospel a righteousness which God ascribes is revealed, both springing from faith and leading to faith [disclosed through the way of faith that arouses to more faith]. As it is written, The man who through faith is just and upright shall live and shall live by faith."},{"num":18,"verse":"For God’s [holy] wrath and indignation are revealed from heaven against all ungodliness and unrighteousness of men, who in their wickedness repress and hinder the truth and make it inoperative."},{"num":19,"verse":"For that which is known about God is evident to them and made plain in their inner consciousness, because God [Himself] has shown it to them."},{"num":20,"verse":"For ever since the creation of the world His invisible nature and attributes, that is, His eternal power and divinity, have been made intelligible and clearly discernible in and through the things that have been made (His handiworks). So [men] are without excuse [altogether without any defense or justification],"},{"num":21,"verse":"Because when they knew and recognized Him as God, they did not honor and glorify Him as God or give Him thanks. But instead they became futile and godless in their thinking [with vain imaginings, foolish reasoning, and stupid speculations] and their senseless minds were darkened."},{"num":22,"verse":"Claiming to be wise, they became fools [professing to be smart, they made simpletons of themselves]."},{"num":23,"verse":"And by them the glory and majesty and excellence of the immortal God were exchanged for and represented by images, resembling mortal man and birds and beasts and reptiles."},{"num":24,"verse":"Therefore God gave them up in the lusts of their [own] hearts to sexual impurity, to the dishonoring of their bodies among themselves [abandoning them to the degrading power of sin],"},{"num":25,"verse":"Because they exchanged the truth of God for a lie and worshiped and served the creature rather than the Creator, Who is blessed forever! Amen (so be it)."},{"num":26,"verse":"For this reason God gave them over and abandoned them to vile affections and degrading passions. For their women exchanged their natural function for an unnatural and abnormal one,"},{"num":27,"verse":"And the men also turned from natural relations with women and were set ablaze (burning out, consumed) with lust for one another—men committing shameful acts with men and suffering in their own bodies and personalities the inevitable consequences and penalty of their wrong-doing and going astray, which was [their] fitting retribution."},{"num":28,"verse":"And so, since they did not see fit to acknowledge God or approve of Him or consider Him worth the knowing, God gave them over to a base and condemned mind to do things not proper or decent but loathsome,"},{"num":29,"verse":"Until they were filled (permeated and saturated) with every kind of unrighteousness, iniquity, grasping and covetous greed, and malice. [They were] full of envy and jealousy, murder, strife, deceit and treachery, ill will and cruel ways. [They were] secret backbiters and gossipers,"},{"num":30,"verse":"Slanderers, hateful to and hating God, full of insolence, arrogance, [and] boasting; inventors of new forms of evil, disobedient and undutiful to parents."},{"num":31,"verse":"[They were] without understanding, conscienceless and faithless, heartless and loveless [and] merciless."},{"num":32,"verse":"Though they are fully aware of God’s righteous decree that those who do such things deserve to die, they not only do them themselves but approve and applaud others who practice them."}]