[{"num":29,"verse":"Woe to Ariel, to Ariel, the city of David's encampment! Add ye year to year; let the feasts come round."},{"num":2,"verse":"But I will distress Ariel, and there shall be sorrow and sadness; and it shall be unto me as an Ariel."},{"num":3,"verse":"And I will camp against thee round about, and will lay siege against thee with watch-posts, and I will raise forts against thee."},{"num":4,"verse":"And thou shalt be brought low, thou shalt speak out of the ground, and thy speech shall come low out of the dust, and thy voice shall be as of one that hath a familiar spirit, out of the ground, and thy speech shall whisper out of the dust."},{"num":5,"verse":"And the multitude of thine enemies shall be like small dust, and the multitude of the terrible ones as chaff that passeth away; and it shall be in an instant, suddenly."},{"num":6,"verse":"Thou shalt be visited by Jehovah of hosts with thunder and with earthquake and great noise, with whirlwind and tempest, and the flame of devouring fire."},{"num":7,"verse":"And the multitude of all the nations that war against Ariel, even all that war against her and her fortifications, and that distress her, shall be as a dream of a night vision."},{"num":8,"verse":"It shall even be as when the hungry dreameth, and, behold, he eateth; and he awaketh, and his soul is empty; or as when the thirsty dreameth, and, behold, he drinketh; and he awaketh, and, behold, he is faint, and his soul craveth: so shall the multitude of all the nations be that war against mount Zion."},{"num":9,"verse":"Be astounded and astonished, blind yourselves and be blind! They are drunken, but not with wine; they stagger, but not with strong drink."},{"num":10,"verse":"For Jehovah hath poured out upon you a spirit of deep sleep, and hath closed your eyes; the prophets and your chiefs, the seers, hath he covered."},{"num":11,"verse":"And the whole vision is become unto you as the words of a book that is sealed, which they give to one that can read, saying, Read this, I pray thee; and he saith, I cannot, for it is sealed."},{"num":12,"verse":"And they give the book to him that cannot read, saying, Read this, I pray thee; and he saith, I cannot read."},{"num":13,"verse":"And the Lord saith, Forasmuch as this people draw near with their mouth, and honour me with their lips, but their heart is removed far from me, and their fear of me is a commandment taught of men;"},{"num":14,"verse":"therefore, behold, I will proceed to do marvellously with this people, to do marvellously, even with wonder, and the wisdom of their wise [men] shall perish, and the understanding of their intelligent ones shall be hid."},{"num":15,"verse":"Woe unto them that hide deep, far from Jehovah, their counsel! And their works are in the dark, and they say, Who seeth us? and who knoweth us?"},{"num":16,"verse":"[Oh] your perverseness!—Shall the potter be esteemed as the clay, so that the work should say of him that made it, He made me not; or the thing formed say of him that formed it, He hath no understanding?"},{"num":17,"verse":"Is it not yet a very little while, and Lebanon shall be turned into a fruitful field, and the fruitful field shall be esteemed as a forest?"},{"num":18,"verse":"And in that day shall the deaf hear the words of the book, and, out of obscurity and out of darkness, the eyes of the blind shall see;"},{"num":19,"verse":"and the meek shall increase their joy in Jehovah, and the needy among men shall rejoice in the Holy One of Israel."},{"num":20,"verse":"For the terrible one shall come to nought, and the scorner shall be no more, and all that watch for iniquity shall be cut off,"},{"num":21,"verse":"that make a man an offender for a word, and lay a snare for him that reproveth in the gate, and pervert [the judgment of] the righteous by futility."},{"num":22,"verse":"Therefore thus saith Jehovah who redeemed Abraham, concerning the house of Jacob: Jacob shall not now be ashamed, neither shall his face now be pale;"},{"num":23,"verse":"for when he seeth his children, the work of my hands, in the midst of him, they shall hallow my name, and hallow the Holy One of Jacob, and shall fear the God of Israel."},{"num":24,"verse":"And they that are of erring spirit shall know understanding, and the disobedient shall learn doctrine."}]