[{"num":9,"verse":"Now the first covenant had both regulations for worship and a Holy Place here on earth. "},{"num":2,"verse":"A tent was set up, the outer one, which was called the Holy Place; in it were the menorah, the table and the Bread of the Presence. "},{"num":3,"verse":"Behind the second parokhet was a tent called the Holiest Place, "},{"num":4,"verse":"which had the golden altar for burning incense and the Ark of the Covenant, entirely covered with gold. In the Ark were the gold jar containing the man, Aharon’s rod that sprouted and the stone Tablets of the Covenant; "},{"num":5,"verse":"and above it were the k’ruvim representing the Sh’khinah, casting their shadow on the lid of the Ark — but now is not the time to discuss these things in detail."},{"num":6,"verse":"With things so arranged, the cohanim go into the outer tent all the time to discharge their duties; "},{"num":7,"verse":"but only the cohen hagadol enters the inner one; and he goes in only once a year, and he must always bring blood, which he offers both for himself and for the sins committed in ignorance by the people. "},{"num":8,"verse":"By this arrangement, the Ruach HaKodesh showed that so long as the first Tent had standing, the way into the Holiest Place was still closed. "},{"num":9,"verse":"This symbolizes the present age and indicates that the conscience of the person performing the service cannot be brought to the goal by the gifts and sacrifices he offers. "},{"num":10,"verse":"For they involve only food and drink and various ceremonial washings — regulations concerning the outward life, imposed until the time for God to reshape the whole structure."},{"num":11,"verse":"But when the Messiah appeared as cohen gadol of the good things that are happening already, then, through the greater and more perfect Tent which is not man-made (that is, it is not of this created world), "},{"num":12,"verse":"he entered the Holiest Place once and for all."},{"num":13,"verse":"For if sprinkling ceremonially unclean persons with the blood of goats and bulls and the ashes of a heifer restores their outward purity; "},{"num":14,"verse":"then how much more the blood of the Messiah, who, through the eternal Spirit, offered himself to God as a sacrifice without blemish, will purify our conscience from works that lead to death, so that we can serve the living God!"},{"num":15,"verse":"It is because of this death that he is mediator of a new covenant [or will]. Because a death has occurred which sets people free from the transgressions committed under the first covenant, those who have been called may receive the promised eternal inheritance. "},{"num":16,"verse":"For where there is a will, there must necessarily be produced evidence of its maker’s death, "},{"num":17,"verse":"since a will goes into effect only upon death; it never has force while its maker is still alive."},{"num":18,"verse":"This is why the first covenant too was inaugurated with blood. "},{"num":19,"verse":"After Moshe had proclaimed every command of the Torah to all the people, he took the blood of the calves with some water and used scarlet wool and hyssop to sprinkle both the scroll itself and all the people; "},{"num":20,"verse":"and he said, “This is the blood of the covenant which God has ordained for you.” "},{"num":21,"verse":"Likewise, he sprinkled with the blood both the Tent and all the things used in its ceremonies. "},{"num":22,"verse":"In fact, according to the Torah, almost everything is purified with blood; indeed, without the shedding of blood there is no forgiveness of sins."},{"num":23,"verse":"Now this is how the copies of the heavenly things had to be purified, but the heavenly things themselves require better sacrifices than these. "},{"num":24,"verse":"For the Messiah has entered a Holiest Place which is not man-made and merely a copy of the true one, but into heaven itself, in order to appear now on our behalf in the very presence of God."},{"num":25,"verse":"Further, he did not enter heaven to offer himself over and over again, like the cohen hagadol who enters the Holiest Place year after year with blood that is not his own; "},{"num":26,"verse":"for then he would have had to suffer death many times — from the founding of the universe on. But as it is, he has appeared once at the end of the ages in order to do away with sin through the sacrifice of himself. "},{"num":27,"verse":"Just as human beings have to die once, but after this comes judgment, "},{"num":28,"verse":"so also the Messiah, having been offered once to bear the sins of many, will appear a second time, not to deal with sin, but to deliver those who are eagerly waiting for him."}]