[{"num":9,"verse":"¶ Nevertheless the first had its justifications of worship and its worldly sanctuary."},{"num":2,"verse":"For there was a tabernacle made: the first, in which was the lampstand and the table and the showbread, which is called the sanctuary."},{"num":3,"verse":"And after the second veil was the tabernacle which is called the holy of holies,"},{"num":4,"verse":"which had a golden censer and the ark of the covenant overlaid round about with gold, in which was the golden urn that had the manna, and Aaron’s rod that budded, and the tables of the testament,"},{"num":5,"verse":"and over it the cherubim of glory shadowing the seat of reconciliation, of which we cannot now speak particularly."},{"num":6,"verse":"Now when these things were thus ordained, the priests went always into the first tabernacle, accomplishing the service of God."},{"num":7,"verse":"But into the second the high priest went alone once every year, not without blood, which he offered for his own ignorance, and for that of the people:"},{"num":8,"verse":"¶ The Holy Spirit signifying in this, that the way into the sanctuary was not yet made manifest, as long as the first tabernacle was yet standing:"},{"num":9,"verse":"Which was a figure of that time present, in which were offered both gifts and sacrifices, that could not make him that did the service perfect, as pertaining to the conscience,"},{"num":10,"verse":"but in foods and drinks and different washings and carnal ordinances, imposed on them until the time of correction."},{"num":11,"verse":"But Christ being now come, high priest of the good things to come, by a greater and more perfect tabernacle, not made with hands, that is to say, not of this creation,"},{"num":12,"verse":"neither by the blood of goats and calves, but by his own blood he entered in once into the sanctuary designed for eternal redemption."},{"num":13,"verse":"For if the blood of bulls and of goats and the ashes of a heifer sprinkling the unclean, sanctified to the purifying of the flesh,"},{"num":14,"verse":"how much more shall the blood of the Christ, who through the eternal Spirit offered himself without spot to God, purge your conscience from the works of death to serve the living God?"},{"num":15,"verse":"¶ And for this cause he is the mediator of the new testament, so that death intervening for the redemption of the rebellions that took place under the first testament, those who are called might receive the promise of the eternal inheritance."},{"num":16,"verse":"For where a testament is, there must also of necessity intervene the death of the testator."},{"num":17,"verse":"For a testament is confirmed by the death: otherwise it is not valid as long as the testator lives."},{"num":18,"verse":"From which came that not even the first one was dedicated without blood."},{"num":19,"verse":"For when Moses had read every commandment of the law to all the people, taking the blood of calves and of goats, with water, and scarlet wool, and hyssop, he sprinkled both the book and all the people,"},{"num":20,"verse":"saying, This is the blood of the testament which God has commanded unto you."},{"num":21,"verse":"Moreover he sprinkled with blood both the tabernacle and all the vessels of the ministry."},{"num":22,"verse":"And almost all things are by the law purged with blood, and without shedding of blood there is no remission."},{"num":23,"verse":"¶ So that it was necessary that the figures of the heavenly things should be purified with these, but the heavenly things themselves with better sacrifices than these."},{"num":24,"verse":"For Christ is not entered into the sanctuary made with hands (which is a figure of the true), but into the heaven itself, now to appear in the presence of God for us,"},{"num":25,"verse":"nor yet that he should offer himself many times (as the high priest enters into the sanctuary each year with blood that is not his own);"},{"num":26,"verse":"otherwise it would have been necessary for him to suffer many times since the foundation of the world; but now once in the consummation of the ages he has appeared to abolish sin by the sacrifice of himself."},{"num":27,"verse":"And as it is appointed unto men to die once, and after this the judgment;"},{"num":28,"verse":"so also the Christ is offered once to take away the sins of many; and unto those that wait for him without sin he shall appear the second time unto saving health."}]