[{"num":1,"verse":"Now in that first agreement between God and his people there were rules for worship and there was a sacred tent down here on earth. Inside this place of worship there were two rooms. The first one contained the golden candlestick and a table with special loaves of holy bread upon it; this part was called the Holy Place. "},{"num":3,"verse":"Then there was a curtain, and behind the curtain was a room called the Holy of Holies. "},{"num":4,"verse":"In that room there were a golden incense-altar and the golden chest, called the ark of the covenant, completely covered on all sides with pure gold. Inside the ark were the tablets of stone with the Ten Commandments written on them, and a golden jar with some manna in it, and Aaron’s wooden cane that budded. "},{"num":5,"verse":"Above the golden chest were statues of angels called the cherubim—the guardians of God’s glory—with their wings stretched out over the ark’s golden cover, called the mercy seat. But enough of such details."},{"num":6,"verse":"Well, when all was ready, the priests went in and out of the first room whenever they wanted to, doing their work. "},{"num":7,"verse":"But only the high priest went into the inner room, and then only once a year, all alone, and always with blood that he sprinkled on the mercy seat as an offering to God to cover his own mistakes and sins and the mistakes and sins of all the people."},{"num":8,"verse":"And the Holy Spirit uses all this to point out to us that under the old system the common people could not go into the Holy of Holies as long as the outer room and the entire system it represents were still in use."},{"num":9,"verse":"This has an important lesson for us today. For under the old system, gifts and sacrifices were offered, but these failed to cleanse the hearts of the people who brought them. "},{"num":10,"verse":"For the old system dealt only with certain rituals—what foods to eat and drink, rules for washing themselves, and rules about this and that. The people had to keep these rules to tide them over until Christ came with God’s new and better way."},{"num":11,"verse":"He came as High Priest of this better system that we now have. He went into that greater, perfect tabernacle in heaven, not made by men nor part of this world, "},{"num":12,"verse":"and once for all took blood into that inner room, the Holy of Holies, and sprinkled it on the mercy seat; but it was not the blood of goats and calves. No, he took his own blood, and with it he, by himself, made sure of our eternal salvation."},{"num":13,"verse":"And if under the old system the blood of bulls and goats and the ashes of young cows could cleanse men’s bodies from sin, "},{"num":14,"verse":"just think how much more surely the blood of Christ will transform our lives and hearts. His sacrifice frees us from the worry of having to obey the old rules and makes us want to serve the living God. For by the help of the eternal Holy Spirit, Christ willingly gave himself to God to die for our sins—he being perfect, without a single sin or fault. "},{"num":15,"verse":"Christ came with this new agreement so that all who are invited may come and have forever all the wonders God has promised them. For Christ died to rescue them from the penalty of the sins they had committed while still under that old system."},{"num":16,"verse":"Now, if someone dies and leaves a will—a list of things to be given away to certain people when he dies—no one gets anything until it is proved that the person who wrote the will is dead. "},{"num":17,"verse":"The will goes into effect only after the death of the person who wrote it. While he is still alive no one can use it to get any of those things he has promised them."},{"num":18,"verse":"That is why blood was sprinkled as proof of Christ’s death before even the first agreement could go into effect. "},{"num":19,"verse":"For after Moses had given the people all of God’s laws, he took the blood of calves and goats, along with water, and sprinkled the blood over the book of God’s laws and over all the people, using branches of hyssop bushes and scarlet wool to sprinkle with. "},{"num":20,"verse":"Then he said, “This is the blood that marks the beginning of the agreement between you and God, the agreement God commanded me to make with you.” "},{"num":21,"verse":"And in the same way he sprinkled blood on the sacred tent and on whatever instruments were used for worship. "},{"num":22,"verse":"In fact we can say that under the old agreement almost everything was cleansed by sprinkling it with blood, and without the shedding of blood there is no forgiveness of sins."},{"num":23,"verse":"That is why the sacred tent down here on earth and everything in it—all copied from things in heaven—all had to be made pure by Moses in this way, by being sprinkled with the blood of animals. But the real things in heaven, of which these down here are copies, were made pure with far more precious offerings."},{"num":24,"verse":"For Christ has entered into heaven itself to appear now before God as our Friend. It was not in the earthly place of worship that he did this, for that was merely a copy of the real temple in heaven. "},{"num":25,"verse":"Nor has he offered himself again and again, as the high priest down here on earth offers animal blood in the Holy of Holies each year. "},{"num":26,"verse":"If that had been necessary, then he would have had to die again and again, ever since the world began. But no! He came once for all, at the end of the age, to put away the power of sin forever by dying for us."},{"num":27,"verse":"And just as it is destined that men die only once, and after that comes judgment, "},{"num":28,"verse":"so also Christ died only once as an offering for the sins of many people; and he will come again, but not to deal again with our sins."}]