[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "HEROD-A STARTLED CONSCIENCEMark 6:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "HEROD-A STARTLED CONSCIENCE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 6:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The character of this Herod, surnamed Antipas, is a sufficiently common and a sufficiently despicable one. He was the very type of an Eastern despot, exactly like some of those half-independent Rajahs, whose dominions march with ours in India; capricious, crafty, as the epithet which Christ applied to him, ‘That fox!’ shows; cruel, as the story of the murder of John the Baptist proves; sensuous and lustful; and withal weak of fibre and infirm of purpose. He, Herodias, and John the Baptist make a triad singularly like the other triad in the Old Testament, of Ahab, Jezebel, and Elijah. In both cases we have the weak ruler, the beautiful she-devil at his side, inspiring him for all evil, and the stern prophet, the rebuker and the incarnate conscience for them both.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The words that I have read are the terrified exclamation of this weak and wicked man when he was brought in contact with the light and beauty of Jesus Christ. And if we think who it was that frightened him, and ponder the words in which his fear expressed itself, we get, as it seems to me, some lessons worth the drawing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. You have here the voice of a startled conscience. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. You have here the voice of a startled conscience.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Herod killed John without much sense of doing wrong. He was sorry, no doubt, for he had a kind of respect for the man, and he was reluctant to put him to death. But though there was reluctance, there was no hesitation. His fantastic sense of honour came in the way. In the one scale there was the life of a poor enthusiast who had amused him for a while, but of whom he had got tired. In the other scale there were his word, the pleasure of Herodias, and the applause of the half-drunken boon companions that were sitting with them at the table. So, of course, the prophet was slain, and the pale head brought in to that wild revel, and, except for the malignant gloating of the woman over her gratified revenge, the event, no doubt, very quickly passed from the memories of all concerned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But then there came stealing into the silken seclusion of the palace, where he was wallowing in his sensuality like a hog in the sty, the tidings of another peasant Teacher that had risen up among the people. Christ’s name had been ringing through the land, and been sounded with blessings in poor men’s huts long before it got within the gates of Herod’s palace. That is the place where religious earnestness makes its mark last of all. But it finally ran thither also; and light gossip went round concerning this new sensation. ‘Who is He? Who is He?’ Each man had his own theory about Him, but a sudden memory started up in the frivolous despot’s soul, and it was with a trembling heart that he said to himself, ‘I know! I know! It is John, whom I beheaded! He is risen from the dead!’ His conscience and his memory and his fears all awoke.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, my friends, I pray you to lay that simple lesson to heart. We all of us do evil things with regard to which it is not hard for us to bribe or to silence our memories and our consciences. The hurry and bustle of daily life, the very weakness of our characters, the rush of sensuous delights, may make us blind and deaf to the voice of conscience; and we think that all chance of the evil deed rising again to harm us is past. But some trifle touches the hidden spring by mere accident; as in the old story of the man groping along a wall till his finger happens to fall upon one inch of it, and immediately the concealed door flies open, and there is the skeleton. So with us, some merely fortuitous association may freshen faded memories and wake a dormant conscience. An apparently trivial circumstance, like some hooked pole pushed at random into the sea, may bring up by the locks some pale and drowned memory long plunged in an ocean of oblivion. Here, in Herod’s case, a report reaches him of a new Rabbi who bears but a very faint resemblance to John, and that is enough to bring his crime back in its naked atrocity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " My friends, we all have these hibernating serpents in our consciences, and nobody knows when the needful warmth may come that will wake them and make them lift their forked heads to sting. The whole landscape of my past life lies there behind the mists of apparent forgetfulness, and any light air of suggestion may sweep away the clouds and show it all. What have you laid up in these memories of yours to start into life some day: ‘at the last biting like a serpent and stinging like an adder’? ‘It is John! It is John, whom I beheaded!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Take this other thought, how, as the story shows us, when once at the bidding of memory conscience begins to work, all illusions as to the nature of my action and as to my share in it are swept away.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " When the evil deed was done, Herod scarcely felt as if he did it. There was his plighted troth, there was Herodias’s pressure, there was the excitement of the moment. He seemed forced to do it, and scarcely responsible for doing it. And no doubt, if he ever thought about it afterwards, he shuffled off a large percentage of the responsibility of the guilt upon the shoulders of the others. But when,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘In the silent sessions of things past,’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "the image and remembrance of the deed come up to him, all the helpers and tempters have disappeared, and ‘It is John, whom ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " beheaded!’ {There is emphasis in the Greek upon the ‘I.’} ‘Yes, it was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Herodias tempted me; Herodias’ daughter titillated my lust; I fancied that my oath bound me; I could not help doing what would please those who sat at the table-I said all that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I did it. But now, when it is done, they have all disappeared, every one of them to his quarter; and I and the ugly thing are left together alone. It was I that did it, and nobody besides.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The blackness of the crime, too, presents itself to the startled conscience as it did not in the doing. There are many euphemisms and soft words in which, as in cotton-wool, we wrap our evil deeds and so deceive ourselves as to their hardness and their edge; but when conscience gets hold of them, and they pass out of the realm of fact into the mystical region of remembrance, all the wrappings, and all the apologies, and all the soft phrases drop away; and the ugliest, briefest, plainest word is the one by which my conscience describes my own evil. ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " beheaded him! ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and none else, was the murderer.’ Oh! dear brethren, do you see to it that what you store up in these caves and treasure-cellars of memory which we all carry with us, are deeds that will bear being brought out again and looked at in the pure white light of conscience, and which you will neither be ashamed nor afraid to lay your hand upon and say: ‘It is mine; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " planted and sowed and worked it, and I am ready to reap the fruit.’ ‘If thou be wise thou shalt be wise for thyself, if thou scornest thou alone shalt bear it.’ Take care of the storehouses of memory and of conscience, and mind what kind of things you lay up there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, once more, I take these words as setting before us an example of a conscience awakened to the unseen world. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now, once more, I take these words as setting before us an example of a conscience awakened to the unseen world.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Many commentators tell us that this Herod was a Sadducee; that is to say that theologically and theoretically he had given up the belief in a future state and in spiritual existence. I do not know that that can be sustained, but much more probably he was only a Sadducee in the way in which a great many of us are Sadducees: he never thought about these things, he did not think about them enough to know whether he believed in them or not. He was a practical, if not a theoretical Sadducee; that is to say, this present was his world, and as for the future, it did not come much into his mind. But now, notice that when conscience begins to stir, it at once sends his thoughts into that unseen world beyond.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a very close connection, as all history proves, between theoretical disbelief in a future life and in spiritual existence, and superstition. So strong is the bond which unites men with the unseen world, that if they do not link themselves with that world in the legitimate and true fashion, it is almost certain to avenge itself upon them by leading them to all manner of low and abject superstitions. Spiritualism is the disease of a generation that disbelieves in another life. The French Revolution, with its infidelities, was also the age of quacks and impostors such as Cagliostro and the like. The time when Christ lived presented precisely the same phenomena. If Herod was a Sadducee, Herod’s Sadduceeism, like frost upon the window-panes, was such a thin layer shutting out the invisible world, that the least warmth of conscience melted it, and the clear daylight glared in upon him. And I am afraid that there are a great many of us who may be half-inclined to reject the belief in another life, who would find precisely the same thing happening to us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But be that as it may, it seems to me that whenever a man comes to think very seriously about his conduct as being wrong in the sight of God, there at once starts up before him the thought of a future life and a judgment-bar. And I want to know why and how it is that the vigorous operation of conscience is always accompanied with a ‘fearful looking for of judgment and fiery indignation.’ I think it is worth your while to reflect upon the fact, and to try and ascertain for yourselves the reason of it, that whenever a man’s conscience begins to tell him of his wrong, its message is not only of transgressions but of judgment, and that beyond the grave.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And, moreover, notice here how the startled conscience, when it becomes aware of an unseen world beyond the grave, cannot but think that out of that world there will come evil for it. These words of my text are obviously the words of a frightened man. It was terror that made Herod say: ‘It is John, whom I beheaded. He is risen from the dead!’ Who was it that frightened Herod? It was He who came from the bosom of the Father, with His hands full of blessings and His heart full of love: who came to quiet all fears, and to cleanse all consciences, and to satisfy all men’s souls with His own sweet love and His perfect righteousness. And it was this genial and gracious and divine form, with all its actualities of gentleness and its possibilities of grace, which the evil conscience of the terrified tetrarch converted into a messenger of judgment come from the tomb to rebuke and to smite him for his evils.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is to say, men may always make that future life and their relation to it what they will. Either the heavens may pour down their dewy influences of benediction and fruitfulness upon them, or may pour down fire and brimstone upon their spirits. Men have the choice which it shall be. The evil conscience drapes the future in darkness, and is right in doing it. The evil conscience forebodes chastisement, judgment, condemnation coming to it from out of the unseen world, and, with limitations, it is right in doing it. You can make Christ Himself the Messenger of condemnation and of death to you. My dear friends, do you choose whether, fronting eternity with an unforgiven burden of sin upon your shoulders and a conscience unsprinkled by the blood of Jesus Christ, you make of it one great fear; or whether you make it what it really is, a lustrous hope, a perfect joy. Is the Messenger that comes out of the unseen to come to you as a Judge of your buried evils started into life, or is He to come to you as the Christ that bears in His hand the price of your redemption, and with His blood ‘sprinkles your conscience from dead works’ and from all its terrors?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, lastly, I see in this saying an illustration of a conscience which, partially stirred, soon went finally to sleep again. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now, lastly, I see in this saying an illustration of a conscience which, partially stirred, soon went finally to sleep again.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Strangely enough, if we pursue the story, this very terror and clear-eyed perception of the nature of his action led the frivolous king to nothing more than a curious wish to see this new Teacher. It was not gratified; and thus by degrees he came to hate Him and to wish to kill Him. And then, finally, on the eve of the Crucifixion Jesus was brought into his presence, and Herod was glad that his curiosity was satisfied at last. His conscience lay perfectly still. There was no trace of the old convictions or of the old tremor. He ‘questioned Jesus many things, and Christ answered him nothing,’ because He knew it was of no use to speak to him. So ‘Herod and his men of war mocked Him and set Him at nought’; and sent Him back to Pilate; and he let his last chance of salvation go, and never knew what he had done.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a lesson for us all. Do not tamper with partially awakened consciences; do not rest satisfied till they are quieted in the legitimate way. There was a man who trembled when he heard Paul remonstrating with him about ‘righteousness and temperance’-both of which the unjust judge had set at naught-’and judgment to come’ And he ‘sent for him often and communed with him gladly,’ but we never hear that Felix trembled any more. It is possible for you so to lull yourselves into indifference, and, as it were, so to waterproof your consciences that appeals, threatenings, pleadings, mercies, the words of men, the Gospel of God, and the beseechings of Christ Himself may all run off them and leave them dry and hard.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One very potent means of rendering consciences insensible is to neglect their voice. The convictions which you have not followed out, like the ruins of a bastion shattered by shell, protect your remaining fortifications against the impact of God’s truth. I believe that there is no man, woman, or child listening to me at this moment but has had, some time or other in the course of his or her life, convictions which only needed to be followed out, gleams of guidance which only required to be faithfully pursued, to bring him or her into loving fellowship with, and true faith in, Jesus Christ. But some of you have neglected them; some of you have choked them with cares and studies and occupations of different kinds; and you are driving on to this result,-I do not know that it is ever reached in this life, but a man may come indefinitely near it,-that you shall stand, like Herod, face to face with Jesus Christ and feel nothing, and that all His love and grace shall be offered and not excite the faintest stirring in your hearts of a desire to accept it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh! my friend, we have all of us evils enough in these charnel-houses of our memory to make us dread the awakening of conscience, to make us look with fear and apprehension beyond the veil to a judgment-seat. And, blessed be God! we have all of us had, and some of us have now, drawings to which we need but to yield ourselves in order to find that He who comes from the heavens is no ‘John whom we beheaded,’ risen for judgment, but a mightier than he, that Son of God who came ‘not to condemn the world, but that the world through Him might be saved.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:14-29 Herod feared John while he lived, and feared him still more when he was dead. Herod did many of those things which John in his preaching taught him; but it is not enough to do many things, we must have respect to all the commandments. Herod respected John, till he touched him in his Herodias. Thus many love good preaching, if it keep far away from their beloved sin. But it is better that sinners persecute ministers now for faithfulness, than curse them eternally for unfaithfulness. The ways of God are unsearchable; but we may be sure he never can be at a loss to repay his servants for what they endure or lose for his sake. Death could not come so as to surprise this holy man; and the triumph of the wicked was short.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See this account of the death of John the Baptist fully explained in the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. But when Herod heard thereof, he said, It is John, whom I beheaded; he is risen from the dead—\"Himself has risen\"; as if the innocence and sanctity of his faithful reprover had not suffered that he should lie long dead.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Account of the Baptist's Imprisonment and Death (Mr 6:17-29).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 5:14\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But when Herod heard thereof,.... Either of Christ, or rather of the different opinions about him, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he said, it is John, whom I have beheaded: the thought stuck close to him, and continued with him; he could not get rid of it, nor persuade himself to the contrary; nor could any of his servants get him off of it, but he affirmed it with the greatest assurance imaginable. These different sentiments of the people concerning Jesus, greatly perplexed the mind of Herod, as appears from Luke 9:7, for it was first given out by others, and not by Herod, that John the Baptist was ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he said, it is John, whom I have beheaded: the thought stuck close to him, and continued with him; he could not get rid of it, nor persuade himself to the contrary; nor could any of his servants get him off of it, but he affirmed it with the greatest assurance imaginable. These different sentiments of the people concerning Jesus, greatly perplexed the mind of Herod, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for it was first given out by others, and not by Herod, that John the Baptist was ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "risen from the dead; which he hearing of, gave him great uneasiness: he thoroughly considered the matter; he called to mind how he had used him, imprisoned him, and put him to death. At first he could not receive it, that since he was beheaded by him, he should be restored to life; but hearing of the miracles that were done by him, his conscience accused him, his fancy worked, and at length he firmly believed it, that he must be risen: and this sentiment, which he himself gave into at last, distressed him above all the rest, because of his concern in his death, fearing he was come to life to take vengeance on him: it might not sit very easy upon his mind, to bear that Elias had appeared the forerunner of the Messiah, the king of the Jews; who himself might be quickly expected, and who, he might fear, would seize upon, and take away that part of the kingdom which he was possessed of: and even to be told, that one of the prophets was risen from the dead, might be shocking to him; imagining that something of considerable moment was to be done, some revolution to be made; that the people would be stirred up by him, to attempt a change of government: but the first of these made the greatest impression on him, and what he could not get off, but fully gave into, as a thing unquestionable. He owns he beheaded John; he was conscious to himself of the sin, and confesses it; he does not lay it to the charge of Herodias and her daughter, though they requested it; the guilt of it lay upon his conscience, and he dreaded this appearance of John, as he fancied. And if he was a Sadducee before, as he has been thought to be, he now changed his mind, and believed a resurrection from the dead. So men may be convinced of sin, and entertain other and better notions of religion, and yet not be converted persons. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "risen from the dead; which he hearing of, gave him great uneasiness: he thoroughly considered the matter; he called to mind how he had used him, imprisoned him, and put him to death. At first he could not receive it, that since he was beheaded by him, he should be restored to life; but hearing of the miracles that were done by him, his conscience accused him, his fancy worked, and at length he firmly believed it, that he must be risen: and this sentiment, which he himself gave into at last, distressed him above all the rest, because of his concern in his death, fearing he was come to life to take vengeance on him: it might not sit very easy upon his mind, to bear that Elias had appeared the forerunner of the Messiah, the king of the Jews; who himself might be quickly expected, and who, he might fear, would seize upon, and take away that part of the kingdom which he was possessed of: and even to be told, that one of the prophets was risen from the dead, might be shocking to him; imagining that something of considerable moment was to be done, some revolution to be made; that the people would be stirred up by him, to attempt a change of government: but the first of these made the greatest impression on him, and what he could not get off, but fully gave into, as a thing unquestionable. He owns he beheaded John; he was conscious to himself of the sin, and confesses it; he does not lay it to the charge of Herodias and her daughter, though they requested it; the guilt of it lay upon his conscience, and he dreaded this appearance of John, as he fancied. And if he was a Sadducee before, as he has been thought to be, he now changed his mind, and believed a resurrection from the dead. So men may be convinced of sin, and entertain other and better notions of religion, and yet not be converted persons. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But when Herod heard thereof, he said, It is John, whom I {l} beheaded: he is risen from the dead.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But when Herod heard ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "thereof",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he said, It is John, whom I ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " beheaded: he is risen from the dead.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Commanded to be beheaded.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰωάννην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the accusative incorporated with the relative clause by attraction both in position and in construction; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Winer, § xxiv. 2, and Viger, p. 33. The king’s statement is very emphatic = the man whom I beheaded, John, he is risen (that is what it all means).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is John",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The words in the original, according to the best MSS., are very striking. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John whom I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I myself;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the pronoun “has the emphasis of a guilty conscience”) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "beheaded—this is he—he is risen.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Josephus confirms the account of these forebodings when he tells us that after the utter defeat of Herod Antipas by Aretas, the people regarded it as a righteous retribution for the murder of John (Jos. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". xviii. 5. 1, 2).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀκούσας δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but having heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This is repeated from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Mark 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He is risen",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The he, οὗτος, is emphatic. This one. This very John.",
        "children": []
      }
    ]
  }
]