[{"header":"The Law of Burnt Offerings"},{"num":1,"verse":"Now the Lord called to Moses and spoke to him from the tent of meeting, saying,"},{"num":2,"verse":"“Speak to the sons of Israel and say to them, ‘When anyone of you brings an offering to the Lord, you shall bring your offering of livestock from the herd or the flock."},{"num":3,"verse":"If his offering is a burnt offering from the herd, he shall offer a male without defect; he shall offer it at the doorway of the tent of meeting, so that he may be accepted before the Lord."},{"num":4,"verse":"And he shall lay his hand on the head of the burnt offering, so that it may be accepted for him to make atonement on his behalf."},{"num":5,"verse":"Then he shall slaughter the bull before the Lord; and Aaron’s sons the priests shall offer up the blood and sprinkle the blood around on the altar that is at the doorway of the tent of meeting."},{"num":6,"verse":"He shall then skin the burnt offering and cut it into its pieces."},{"num":7,"verse":"And the sons of Aaron the priest shall put fire on the altar and arrange wood on the fire."},{"num":8,"verse":"Then Aaron’s sons the priests shall arrange the pieces, with the head and the suet, on the wood which is on the fire that is on the altar."},{"num":9,"verse":"Its entrails, however, and its legs he shall wash with water. And the priest shall offer all of it up in smoke on the altar as a burnt offering, an offering by fire as a soothing aroma to the Lord."},{"num":10,"verse":"‘But if his offering is from the flock, either from the sheep or from the goats, as a burnt offering, he shall offer a male without defect."},{"num":11,"verse":"And he shall slaughter it on the side of the altar northward before the Lord, and Aaron’s sons the priests shall sprinkle its blood around on the altar."},{"num":12,"verse":"He shall then cut it into its pieces with its head and its suet, and the priest shall arrange them on the wood which is on the fire that is on the altar."},{"num":13,"verse":"The entrails, however, and the legs he shall wash with water. And the priest shall offer all of it, and offer it up in smoke on the altar; it is a burnt offering, an offering by fire of a soothing aroma to the Lord."},{"num":14,"verse":"‘But if his offering to the Lord is a burnt offering of birds, then he shall bring his offering from the turtledoves or from young doves."},{"num":15,"verse":"The priest shall bring it to the altar, and pinch off its head, and offer it up in smoke on the altar; and its blood is to be drained out on the side of the altar."},{"num":16,"verse":"He shall also remove its craw with its feathers and throw it beside the altar eastward, to the place of the fatty ashes."},{"num":17,"verse":"Then he shall tear it by its wings, but shall not sever it. And the priest shall offer it up in smoke on the altar, on the wood which is on the fire; it is a burnt offering, an offering by fire of a soothing aroma to the Lord."}]