[{"header":"The Burnt Offering"},{"num":1,"verse":"Now the Lord called to Moses, and spoke to him from the tabernacle of meeting, saying, "},{"num":2,"verse":"“Speak to the children of Israel, and say to them: ‘When any one of you brings an offering to the Lord, you shall bring your offering of the livestock—of the herd and of the flock."},{"num":3,"verse":"‘If his offering is a burnt sacrifice of the herd, let him offer a male without blemish; he shall offer it of his own free will at the door of the tabernacle of meeting before the Lord. "},{"num":4,"verse":"Then he shall put his hand on the head of the burnt offering, and it will be accepted on his behalf to make atonement for him. "},{"num":5,"verse":"He shall kill the bull before the Lord; and the priests, Aaron’s sons, shall bring the blood and sprinkle the blood all around on the altar that is by the door of the tabernacle of meeting. "},{"num":6,"verse":"And he shall skin the burnt offering and cut it into its pieces. "},{"num":7,"verse":"The sons of Aaron the priest shall put fire on the altar, and lay the wood in order on the fire. "},{"num":8,"verse":"Then the priests, Aaron’s sons, shall lay the parts, the head, and the fat in order on the wood that is on the fire upon the altar; "},{"num":9,"verse":"but he shall wash its entrails and its legs with water. And the priest shall burn all on the altar as a burnt sacrifice, an offering made by fire, a sweet aroma to the Lord."},{"num":10,"verse":"‘If his offering is of the flocks—of the sheep or of the goats—as a burnt sacrifice, he shall bring a male without blemish. "},{"num":11,"verse":"He shall kill it on the north side of the altar before the Lord; and the priests, Aaron’s sons, shall sprinkle its blood all around on the altar. "},{"num":12,"verse":"And he shall cut it into its pieces, with its head and its fat; and the priest shall lay them in order on the wood that is on the fire upon the altar; "},{"num":13,"verse":"but he shall wash the entrails and the legs with water. Then the priest shall bring it all and burn it on the altar; it is a burnt sacrifice, an offering made by fire, a sweet aroma to the Lord."},{"num":14,"verse":"‘And if the burnt sacrifice of his offering to the Lord is of birds, then he shall bring his offering of turtledoves or young pigeons. "},{"num":15,"verse":"The priest shall bring it to the altar, wring off its head, and burn it on the altar; its blood shall be drained out at the side of the altar. "},{"num":16,"verse":"And he shall remove its crop with its feathers and cast it beside the altar on the east side, into the place for ashes. "},{"num":17,"verse":"Then he shall split it at its wings, but shall not divide it completely; and the priest shall burn it on the altar, on the wood that is on the fire. It is a burnt sacrifice, an offering made by fire, a sweet aroma to the Lord."}]