[{"num":37,"verse":"1 Zedekiah succeedeth Jeconiah. 3 He sendeth unto Jeremiah to pray for him. 12 Jeremiah going into the land of Benjamin is taken. 15 He is beaten and put in prison."},{"num":1,"verse":"And King Zedekiah the son of Josiah reigned for Coniah the son of Jehoiakim, whom Nebuchadnezzar king of Babel made king in the land of Judah."},{"num":2,"verse":"But neither he, nor his servants, nor the people of the land would obey the words of the Lord which he spake by the ministry of the Prophet Jeremiah."},{"num":3,"verse":"And Zedekiah the king sent Jehucal the son of Shelemiah, and Zephaniah the son of Maaseiah the Priest to the Prophet Jeremiah, saying, Pray now unto the Lord our God for us."},{"num":4,"verse":"(Now Jeremiah went in and out among the people: for they had not put him into the prison."},{"num":5,"verse":"Then Pharaoh’s host was come out of Egypt: and when the Chaldeans that besieged Jerusalem, heard tidings of them, they departed from Jerusalem.)"},{"num":6,"verse":"Then came the word of the Lord unto the Prophet Jeremiah, saying,"},{"num":7,"verse":"Thus saith the Lord God of Israel, Thus shall ye say to the King of Judah, that sent you unto me to inquire of me, Behold, Pharaoh’s host, which is come forth to help you, shall return to Egypt into their own land."},{"num":8,"verse":"And the Chaldeans shall come again, and fight against this city, and take it and burn it with fire."},{"num":9,"verse":"Thus saith the Lord, Deceive not yourselves, saying, The Chaldeans shall surely depart from us: for they shall not depart."},{"num":10,"verse":"For though ye had smitten the whole host of the Chaldeans that fight against you, and there remained, but wounded men among them, yet should every man rise up in his tent, and burn this city with fire."},{"num":11,"verse":"¶ When the host of the Chaldeans was broken up from Jerusalem, because of Pharaoh’s army,"},{"num":12,"verse":"Then Jeremiah went out of Jerusalem to go into the land of Benjamin, separating himself thence from among the people."},{"num":13,"verse":"And when he was in the gate of Benjamin, there was a chief officer, whose name was Irijah, the son of Shelemiah, the son of Hananiah, and he took Jeremiah the Prophet, saying, Thou fleest to the Chaldeans."},{"num":14,"verse":"Then said Jeremiah, That is false, I flee not to the Chaldeans: but he would not hear him: so Irijah took Jeremiah, and brought him to the princes."},{"num":15,"verse":"Wherefore the princes were angry with Jeremiah, and smote him, and laid him in prison in the house of Jehonathan the Scribe: for they had made that the prison."},{"num":16,"verse":"When Jeremiah was entered into the dungeon, and into the prisons, and had remained there a long time,"},{"num":17,"verse":"Then Zedekiah the king sent, and took him out, and the king asked him secretly, in his house, and said, Is there any word from the Lord? And Jeremiah said, Yea: for, said he, thou shalt be delivered into the hand of the king of Babel."},{"num":18,"verse":"Moreover, Jeremiah said unto king Zedekiah, What have I offended against thee, or against thy servants, or against this people, that ye have put me in prison?"},{"num":19,"verse":"Where are now your prophets, which prophesied unto you, saying, The king of Babel shall not come against you, nor against this land?"},{"num":20,"verse":"Therefore hear now, I pray thee, O my lord the King: let my prayer be acceptable before thee, that thou cause me not to return to the house of Jehonathan the scribe, lest I die there."},{"num":21,"verse":"Then Zedekiah the King commanded, that they should put Jeremiah in the court of the prison, and that they should give him daily a piece of bread out of the baker’s street until all the bread in the city were eaten up. Thus Jeremiah remained in the court of the prison."}]