[[],[{"type":"header","content":"Jeremiah Warns against Trust in Pharaoh"},{"type":"prose","content":"Now Zedekiah the son of Josiah whom Nebuchadnezzar king of Babylon had made king in the land of Judah, reigned as king in place of Coniah the son of Jehoiakim."}],[{"type":"prose","content":"But neither he nor his servants nor the people of the land listened to the words of the  which He spoke through Jeremiah the prophet."}],[{"type":"prose","content":"Yet King Zedekiah sent Jehucal the son of Shelemiah, and the priest Zephaniah the son of Maaseiah, to Jeremiah the prophet, saying, “Please pray to the  our God in our behalf.”"}],[{"type":"prose","content":"Now Jeremiah was  coming and going among the people, for they had not  put him in prison."}],[{"type":"prose","content":"Meanwhile, Pharaoh’s army had set out from Egypt; and when the Chaldeans who had been besieging Jerusalem heard the report about them, they withdrew from Jerusalem."}],[{"type":"prose","content":"Then the word of the  came to Jeremiah the prophet, saying,"}],[{"type":"prose","content":"“This is what the , the God of Israel says: ‘This is what you are to say to the king of Judah, who sent you to Me to inquire of Me: “Behold, Pharaoh’s army, which has come out to help you, is going to return to its own land of Egypt."}],[{"type":"prose","content":"Then the Chaldeans will return and fight against this city, and they will capture it and burn it with fire.”’"}],[{"type":"prose","content":"This is what the  says: ‘Do not deceive yourselves, saying, “The Chaldeans will certainly go  from us,” for they will not go."}],[{"type":"prose","content":"For even if you had defeated the entire army of Chaldeans who were fighting against you, and there were  wounded men left among them, each man in his tent, they would rise up and burn this city with fire.’”"},{"type":"header","content":"Jeremiah Imprisoned"}],[{"type":"prose","content":"Now it happened when the army of the Chaldeans had withdrawn from Jerusalem because of Pharaoh’s army,"}],[{"type":"prose","content":"that Jeremiah left Jerusalem to go to the land of Benjamin in order to take possession of  property there among the people."}],[{"type":"prose","content":"While he was at the Gate of Benjamin, a captain of the guard whose name was Irijah, the son of Shelemiah the son of Hananiah was there; and he arrested Jeremiah the prophet, saying, “You are deserting to the Chaldeans!”"}],[{"type":"prose","content":"But Jeremiah said, “A lie! I am not deserting to the Chaldeans”; yet he would not listen to him. So Irijah arrested Jeremiah and brought him to the officials."}],[{"type":"prose","content":"Then the officials were angry at Jeremiah and they beat him, and put him in prison in the house of Jonathan the scribe, for they had made it into the prison."}],[{"type":"prose","content":"For Jeremiah had come into the dungeon, that is, the vaulted cell; and Jeremiah stayed there many days."}],[{"type":"prose","content":"Now King Zedekiah sent  and took him ; and in his palace the king secretly asked him and said, “Is there a word from the ?” And Jeremiah said, “There is!” Then he said, “You will be handed over to the king of Babylon!”"}],[{"type":"prose","content":"Moreover, Jeremiah said to King Zedekiah, “ what  have I sinned against you, or your servants, or this people, that you have put me in prison?"}],[{"type":"prose","content":"And where are your prophets who prophesied to you, saying, ‘The king of Babylon will not come against you or against this land’?"}],[{"type":"prose","content":"But now, please listen, my lord the king; please let my plea come before you and do not make me return to the house of Jonathan the scribe, so that I will not die there.”"}],[{"type":"prose","content":"Then King Zedekiah gave a command, and they placed Jeremiah in custody in the courtyard of the guardhouse, and gave him a loaf of bread daily from the bakers’ street, until all the bread in the city was gone. So Jeremiah remained in the courtyard of the guardhouse."}]]