[{"header":"Jeremiah in Prison"},{"num":37,"verse":"Nebuchadnezzar king of Babylon had appointed Zedekiah son of Josiah to be king of Judah. Zedekiah took the place of Jehoiachin son of Jehoiakim. "},{"num":2,"verse":"But Zedekiah, his servants, and the people of Judah did not listen to the words the Lord had spoken through Jeremiah the prophet."},{"num":3,"verse":"Now King Zedekiah sent Jehucal son of Shelemiah and the priest Zephaniah son of Maaseiah with a message to Jeremiah the prophet. This was the message: “Jeremiah, please pray to the Lord our God for us.”"},{"num":4,"verse":"At that time Jeremiah had not yet been put into prison. So he was free to go anywhere he wanted. "},{"num":5,"verse":"The army of the king of Egypt had marched from Egypt toward Judah. Now the Babylonian army had surrounded the city of Jerusalem. When they heard about the Egyptian army marching toward them, the Babylonian army left Jerusalem."},{"num":6,"verse":"The Lord spoke his word to Jeremiah the prophet: "},{"num":7,"verse":"“This is what the Lord, the God of Israel, says: Jehucal and Zephaniah, I know Zedekiah king of Judah sent you to seek my help. Tell this to King Zedekiah: ‘The army of the king of Egypt came here to help you, but they will go back to Egypt. "},{"num":8,"verse":"After that, the Babylonian army will return and attack Jerusalem and capture it and burn it down.’"},{"num":9,"verse":"“This is what the Lord says: People of Jerusalem, do not fool yourselves. Don’t say, ‘The Babylonian army will surely leave us alone.’ They will not! "},{"num":10,"verse":"Even if you defeated all of the Babylonian army that is attacking you and there were only a few injured men left in their tents, they would come from their tents and burn down Jerusalem!”"},{"num":11,"verse":"So the Babylonian army left Jerusalem to fight the army of the king of Egypt. "},{"num":12,"verse":"Now Jeremiah tried to travel from Jerusalem to the land of Benjamin to get his share of the property that belonged to his family. "},{"num":13,"verse":"When Jeremiah got to the Benjamin Gate of Jerusalem, the captain in charge of the guards arrested him. The captain’s name was Irijah son of Shelemiah son of Hananiah. Irijah said, “You are leaving us to join the Babylonians!”"},{"num":14,"verse":"But Jeremiah said to Irijah, “That’s not true! I am not leaving to join the Babylonians.” Irijah refused to listen to Jeremiah, so he arrested Jeremiah and took him to the officers of Jerusalem. "},{"num":15,"verse":"Those rulers were very angry with Jeremiah and beat him. Then they put him in jail in the house of Jonathan the royal secretary, which had been made into a prison. "},{"num":16,"verse":"So those people put Jeremiah into a cell in a dungeon, and Jeremiah was there for a long time."},{"num":17,"verse":"Then King Zedekiah sent for Jeremiah and had him brought to the palace. Zedekiah asked him in private, “Is there any message from the Lord?”"},{"num":18,"verse":"Then Jeremiah said to King Zedekiah, “What crime have I done against you or your officers or the people of Jerusalem? Why have you thrown me into prison? "},{"num":19,"verse":"Where are your prophets that prophesied this message to you: ‘The king of Babylon will not attack you or this land of Judah’? "},{"num":20,"verse":"But now, my master, king of Judah, please listen to me, and please do what I ask of you. Do not send me back to the house of Jonathan the royal secretary, or I will die there!”"},{"num":21,"verse":"So King Zedekiah gave orders for Jeremiah to be put under guard in the courtyard of the guard and to be given bread each day from the street of the bakers until there was no more bread in the city. So he stayed under guard in the courtyard of the guard."}]