[{"num":1,"verse":"This is the beginning of the good news about Jesus Christ, God's Son."},{"num":2,"verse":"The men of God, called prophets, long ago wrote about it this way: God said, `See, I send my man ahead of you to tell about you. He will make the way ready for you."},{"num":3,"verse":"A man is calling out in the desert, \"Make the way ready for the Lord. Make the road straight for him.\" '"},{"num":4,"verse":"John baptised people in the desert. He told them to stop doing wrong things and be baptised, and God would forgive them for the wrong things they did."},{"num":5,"verse":"People from all the land of Judea and all the city of Jerusalem went out to John. He baptised them in the Jordan River when they told about the wrong things they did."},{"num":6,"verse":"John wore clothes made of camel's hair and a leather belt. He ate locusts and wild honey."},{"num":7,"verse":"He told the people, `Another person is coming. He is greater than I am. I am not good enough to bend down and untie his shoe strings."},{"num":8,"verse":"I have baptised you with water, but he will baptise you with the Holy Spirit.'"},{"num":9,"verse":"At that time Jesus came from the town of Nazareth in the country of Galilee. John baptised him in the Jordan River."},{"num":10,"verse":"As soon as he came up out of the water, Jesus saw the sky open. He saw God's Holy Spirit come down on him like a bird called a dove."},{"num":11,"verse":"A voice from the sky said, `You are my dear Son. I am very pleased with you.'"},{"num":12,"verse":"Right away, the Spirit made Jesus go into the desert."},{"num":13,"verse":"Jesus was in the desert for forty days. All that time Satan tried to make Jesus do wrong. Jesus was with wild animals. Angels came and took care of him."},{"num":14,"verse":"John was put in prison. Then Jesus went to Galilee. He told people the good news of God's kingdom."},{"num":15,"verse":"`The time has come,' he said. `The kingdom of God is here. Stop your wrong ways, turn back to God and believe the good news.'"},{"num":16,"verse":"Jesus was walking by the Sea of Galilee. There he saw Simon and his brother Andrew. They were throwing a fishing net into the water. Their work was to catch fish."},{"num":17,"verse":"Jesus said to them, `Come with me. The work I give you will be to catch people.'"},{"num":18,"verse":"Right away they left their nets and went with him."},{"num":19,"verse":"Jesus went on from there and saw James and his brother John. Their father's name was Zebedee. They were in a boat mending their nets."},{"num":20,"verse":"Jesus called them. Right away they left their father Zebedee in the boat with the workmen and went with Jesus."},{"num":21,"verse":"They went to the town of Capernaum. As soon as it was the Sabbath day, Jesus went into their meeting house and taught the people."},{"num":22,"verse":"They were very much surprised at his teaching because he taught them as if he had the right to teach them. He did not teach them like their teachers called scribes."},{"num":23,"verse":"A man who had a bad spirit in him was in the meeting house at that time."},{"num":24,"verse":"He called out, `Jesus of Nazareth, what do you want to do to us? Have you come to kill us? I know who you are. You are the Holy One of God.'"},{"num":25,"verse":"Jesus said to the spirit, `Be quiet! Come out of him!'"},{"num":26,"verse":"The bad spirit threw the man around. It called out loud and then it came out of the man."},{"num":27,"verse":"The people were all surprised. They said one to another, `What is this? Is not this a new teaching? He tells the bad spirits what to do and even they obey him'"},{"num":28,"verse":"The people all around Galilee heard right away about Jesus."},{"num":29,"verse":"As soon as they came out of the meeting house, they went to the home of Simon and Andrew. James and John went also."},{"num":30,"verse":"Simon's wife's mother was sick and was lying down. She had a fever. Right away they told Jesus about her."},{"num":31,"verse":"Jesus went to her. He took her hand and helped her up. The fever left her right away, and she began to do things to help them."},{"num":32,"verse":"That evening when the sun went down, people brought to Jesus all the sick people and those who had bad spirits."},{"num":33,"verse":"All the people in the city crowded around the door."},{"num":34,"verse":"He healed many sick people. He drove the bad spirits out of people. And he did not let them speak because they knew who he was."},{"num":35,"verse":"The next morning Jesus got up long before daylight. He went out to a place by himself. There he talked with God."},{"num":36,"verse":"Simon and his friends went out after Jesus."},{"num":37,"verse":"When they found him they said, `Everyone is looking for you.'"},{"num":38,"verse":"Jesus said, `We must go to the next towns. I must tell the good news to the people there too. That is why I came here.'"},{"num":39,"verse":"Then Jesus talked to the people in all the meeting houses in all the country of Galilee. He also made the bad spirits come out of people."},{"num":40,"verse":"A man who was sick with leprosy [a bad skin disease] came to him. He kneeled down and begged Jesus saying, `I know you can heal me if you want to.'"},{"num":41,"verse":"Jesus was very sorry for him. He put out his hand and touched him. He said, `I want to. Be healed.'"},{"num":42,"verse":"As soon as he said this, the disease left the man and he was healed."},{"num":43,"verse":"Jesus talked strongly to him and sent him away."},{"num":44,"verse":"He said, `Do not tell anyone about this. But go and let the priest look at you. Moses gave a law about the gift you must give to God when you are healed. Give it to prove to people that you are healed.'"},{"num":45,"verse":"But the man went out and told everyone everywhere what had happened to him. Because he did this, Jesus could not go into any large town freely. He stayed in places where only a few people were. There people came to him from everywhere."}]