[{"num":20,"verse":"Drinking too much makes you loud and foolish. It's stupid to get drunk."},{"num":2,"verse":"Fear an angry king as you would a growling lion; making him angry is suicide."},{"num":3,"verse":"Any fool can start arguments; the honorable thing is to stay out of them."},{"num":4,"verse":"A farmer too lazy to plow his fields at the right time will have nothing to harvest."},{"num":5,"verse":"A person's thoughts are like water in a deep well, but someone with insight can draw them out."},{"num":6,"verse":"Everyone talks about how loyal and faithful he is, but just try to find someone who really is!"},{"num":7,"verse":"Children are fortunate if they have a father who is honest and does what is right."},{"num":8,"verse":"The king sits in judgment and knows evil when he sees it."},{"num":9,"verse":"Can anyone really say that his conscience is clear, that he has gotten rid of his sin?"},{"num":10,"verse":"The Lord hates people who use dishonest weights and measures."},{"num":11,"verse":"Even children show what they are by what they do; you can tell if they are honest and good."},{"num":12,"verse":"The Lord has given us eyes to see with and ears to listen with."},{"num":13,"verse":"If you spend your time sleeping, you will be poor. Keep busy and you will have plenty to eat."},{"num":14,"verse":"The customer always complains that the price is too high, but then he goes off and brags about the bargain he got."},{"num":15,"verse":"If you know what you are talking about, you have something more valuable than gold or jewels."},{"num":16,"verse":"Anyone stupid enough to promise to be responsible for a stranger's debts ought to have their own property held to guarantee payment."},{"num":17,"verse":"What you get by dishonesty you may enjoy like the finest food, but sooner or later it will be like a mouthful of sand."},{"num":18,"verse":"Get good advice and you will succeed; don't go charging into battle without a plan."},{"num":19,"verse":"A gossip can never keep a secret. Stay away from people who talk too much."},{"num":20,"verse":"If you curse your parents, your life will end like a lamp that goes out in the dark."},{"num":21,"verse":"The more easily you get your wealth, the less good it will do you."},{"num":22,"verse":"Don't take it on yourself to repay a wrong. Trust the Lord and he will make it right."},{"num":23,"verse":"The Lord hates people who use dishonest scales and weights."},{"num":24,"verse":"The Lord has determined our path; how then can anyone understand the direction his own life is taking?"},{"num":25,"verse":"Think carefully before you promise an offering to God. You might regret it later."},{"num":26,"verse":"A wise king will find out who is doing wrong, and will punish him without pity."},{"num":27,"verse":"The Lord gave us mind and conscience; we cannot hide from ourselves."},{"num":28,"verse":"A king will remain in power as long as his rule is honest, just, and fair."},{"num":29,"verse":"We admire the strength of youth and respect the gray hair of age."},{"num":30,"verse":"Sometimes it takes a painful experience to make us change our ways."}]