[{"num":20,"verse":"Wine makes people act in a foolish way. Strong drink starts fights. Whoever is fooled by it is not wise."},{"num":2,"verse":"The anger of a king is like the noise of a lion. He who makes him angry gives up his own life."},{"num":3,"verse":"It is an honor for a man to keep away from fighting, but any fool will argue."},{"num":4,"verse":"The lazy man does not plow before winter. So he begs during gathering time and has nothing."},{"num":5,"verse":"The plan in a man’s heart is like water in a deep well, but a man of understanding gets it out."},{"num":6,"verse":"Many men tell about their own loving-kindness and good ways but who can find a faithful man?"},{"num":7,"verse":"How happy are the sons of a man who is right with God and walks in honor!"},{"num":8,"verse":"A king who sits on his throne to judge finds out all sin with his eyes."},{"num":9,"verse":"Who can say, “I have made my heart clean, and I am pure from my sin?”"},{"num":10,"verse":"The Lord hates the use of tools that lie about how heavy or how long something is."},{"num":11,"verse":"A young man makes himself known by his actions and proves if his ways are pure and right."},{"num":12,"verse":"The hearing ear and the seeing eye were both made by the Lord."},{"num":13,"verse":"Do not love sleep, or you will become poor. Open your eyes, and you will be filled with food."},{"num":14,"verse":"“It is bad, it is bad,” says the one who buys, but when he goes away, he talks much about his good buy."},{"num":15,"verse":"There is gold and many stones of great worth, but the lips of much learning are worth more."},{"num":16,"verse":"Take a man’s coat when he has given himself as trust for what a stranger owes. And hold him to his promise when he gives himself as trust for what the people from other lands owe."},{"num":17,"verse":"Bread a man gets by lying is sweet to him, but later his mouth will be filled with sand."},{"num":18,"verse":"Make plans by listening to what others have to say, and make war by listening to the leading of wise men."},{"num":19,"verse":"He who goes about talking to hurt people makes secrets known. So do not be with those who talk about others."},{"num":20,"verse":"If a son talks against his father or his mother, his lamp will be put out in the time of darkness."},{"num":21,"verse":"A large gift received at one time in a hurry will not bring good in the end."},{"num":22,"verse":"Do not say, “I will punish wrong-doing.” Wait on the Lord, and He will take care of it."},{"num":23,"verse":"Giving the wrong weight is hated by the Lord. And weighing something wrong is not good."},{"num":24,"verse":"A man’s steps are decided by the Lord. How can anyone understand his own way?"},{"num":25,"verse":"It is a trap for a man to say without thinking, “It is holy,” and then later think more about what he has promised."},{"num":26,"verse":"A wise king puts the sinful aside and crushes the grain over them."},{"num":27,"verse":"The spirit of man is the lamp of the Lord. It shows all the inside parts of his heart."},{"num":28,"verse":"A king will stay in power as long as he is faithful and true. He can stay on his throne if he does what is right and good."},{"num":29,"verse":"The honor of young men is their strength. And the honor of old men is their hair turning white."},{"num":30,"verse":"Beatings that hurt clean away sin. And beatings make even the inside parts clean."}]