[[],[{"type":"prose","content":"Wine [is] a scorner -- strong drink [is] noisy, And any going astray in it is not wise."}],[{"type":"prose","content":"The fear of a king [is] a growl as of a young lion, He who is causing him to be wroth is wronging his soul."}],[{"type":"prose","content":"An honour to a man is cessation from strife, And every fool intermeddleth."}],[{"type":"prose","content":"Because of winter the slothful plougheth not, He asketh in harvest, and there is nothing."}],[{"type":"prose","content":"Counsel in the heart of a man [is] deep water, And a man of understanding draweth it up."}],[{"type":"prose","content":"A multitude of men proclaim each his kindness, And a man of stedfastness who doth find?"}],[{"type":"prose","content":"The righteous is walking habitually in his integrity, O the happiness of his sons after him!"}],[{"type":"prose","content":"A king sitting on a throne of judgment, Is scattering with his eyes all evil,"}],[{"type":"prose","content":"Who saith, `I have purified my heart, I have been cleansed from my sin?'"}],[{"type":"prose","content":"A stone and a stone, an ephah and an ephah, Even both of them [are] an abomination to Jehovah."}],[{"type":"prose","content":"Even by his actions a youth maketh himself known, Whether his work be pure or upright."}],[{"type":"prose","content":"A hearing ear, and a seeing eye, Jehovah hath made even both of them."}],[{"type":"prose","content":"Love not sleep, lest thou become poor, Open thine eyes -- be satisfied [with] bread."}],[{"type":"prose","content":"`Bad, bad,' saith the buyer, And going his way then he boasteth himself."}],[{"type":"prose","content":"Substance, gold, and a multitude of rubies, Yea, a precious vessel, [are] lips of knowledge."}],[{"type":"prose","content":"Take his garment when a stranger hath been surety, And for strangers pledge it."}],[{"type":"prose","content":"Sweet to a man [is] the bread of falsehood, And afterwards is his mouth filled [with] gravel."}],[{"type":"prose","content":"Purposes by counsel thou dost establish, And with plans make thou war."}],[{"type":"prose","content":"A revealer of secret counsels is the busybody, And for a deceiver [with] his lips make not thyself surety."}],[{"type":"prose","content":"Whoso is vilifying his father and his mother, Extinguished is his lamp in blackness of darkness."}],[{"type":"prose","content":"An inheritance gotten wrongly at first, Even its latter end is not blessed."}],[{"type":"prose","content":"Do not say, `I recompense evil,' Wait for Jehovah, and He delivereth thee."}],[{"type":"prose","content":"An abomination to Jehovah [are] a stone and a stone, And balances of deceit [are] not good."}],[{"type":"prose","content":"From Jehovah [are] the steps of a man, And man -- how understandeth he his way?"}],[{"type":"prose","content":"A snare to a man [is] he hath swallowed a holy thing, And after vows to make inquiry."}],[{"type":"prose","content":"A wise king is scattering the wicked, And turneth back on them the wheel."}],[{"type":"prose","content":"The breath of man [is] a lamp of Jehovah, Searching all the inner parts of the heart."}],[{"type":"prose","content":"Kindness and truth keep a king, And he hath supported by kindness his throne."}],[{"type":"prose","content":"The beauty of young men is their strength, And the honour of old men is grey hairs."}],[{"type":"prose","content":"The bandages of a wound thou removest with the evil, Also the plagues of the inner parts of the heart!"}]]