[[],[{"type":"header","content":"The Plot to Kill Jesus(A)"},{"type":"prose","content":"After two days it was the Passover and  of Unleavened Bread. And the chief priests and the scribes sought how they might take Him by trickery and put  to death. "}],[{"type":"prose","content":"But they said, “Not during the feast, lest there be an uproar of the people.”"},{"type":"header","content":"The Anointing at Bethany(D)"}],[{"type":"prose","content":"And being in Bethany at the house of Simon the leper, as He sat at the table, a woman came having an alabaster flask of very costly oil of spikenard. Then she broke the flask and poured  on His head. "}],[{"type":"prose","content":"But there were some who were indignant among themselves, and said, “Why was this fragrant oil wasted? "}],[{"type":"prose","content":"For it might have been sold for more than three hundred denarii and given to the poor.” And they criticized her sharply."}],[{"type":"prose","content":"But Jesus said,  "}],[{"type":"prose","content":"  "}],[{"type":"prose","content":" "}],[{"type":"prose","content":" "},{"type":"header","content":"Judas Agrees to Betray Jesus(K)"}],[{"type":"prose","content":"Then Judas Iscariot, one of the twelve, went to the chief priests to betray Him to them. "}],[{"type":"prose","content":"And when they heard  they were glad, and promised to give him money. So he sought how he might conveniently betray Him."},{"type":"header","content":"Jesus Celebrates the Passover with His Disciples(M)"}],[{"type":"prose","content":"Now on the first day of Unleavened Bread, when they killed the Passover  His disciples said to Him, “Where do You want us to go and prepare, that You may eat the Passover?”"}],[{"type":"prose","content":"And He sent out two of His disciples and said to them,  "}],[{"type":"prose","content":" "}],[],[{"type":"prose","content":"So His disciples went out, and came into the city, and found it just as He had said to them; and they prepared the Passover."}],[{"type":"prose","content":"In the evening He came with the twelve. "}],[{"type":"prose","content":"Now as they sat and ate, Jesus said,  "}],[{"type":"prose","content":"And they began to be sorrowful, and to say to Him one by one, “ it I?” And another  “ it I?”"}],[{"type":"prose","content":"He answered and said to them,  "}],[{"type":"header","content":"Jesus Institutes the Lord’s Supper(R)"}],[{"type":"prose","content":"And as they were eating, Jesus took bread, blessed and broke  and gave  to them and said,   "}],[{"type":"prose","content":"Then He took the cup, and when He had given thanks He gave  to them, and they all drank from it. "}],[{"type":"prose","content":"And He said to them,   "}],[],[{"type":"prose","content":"And when they had sung a hymn, they went out to the Mount of Olives."},{"type":"header","content":"Jesus Predicts Peter’s Denial(V)"}],[{"type":"prose","content":"Then Jesus said to them,  "}],[{"type":"prose","content":" "}],[{"type":"prose","content":"Peter said to Him, “Even if all are made to stumble, yet I  not ”"}],[{"type":"prose","content":"Jesus said to him, "}],[{"type":"prose","content":"But he spoke more vehemently, “If I have to die with You, I will not deny You!”And they all said likewise."},{"type":"header","content":"The Prayer in the Garden(AA)"}],[{"type":"prose","content":"Then they came to a place which was named Gethsemane; and He said to His disciples,  "}],[{"type":"prose","content":"And He took Peter, James, and John with Him, and He began to be troubled and deeply distressed. "}],[{"type":"prose","content":"Then He said to them, "}],[{"type":"prose","content":"He went a little farther, and fell on the ground, and prayed that if it were possible, the hour might pass from Him. "}],[{"type":"prose","content":"And He said,   "}],[{"type":"prose","content":"Then He came and found them sleeping, and said to Peter,  "}],[{"type":"prose","content":" "}],[{"type":"prose","content":"Again He went away and prayed, and spoke the same words. "}],[{"type":"prose","content":"And when He returned, He found them asleep again, for their eyes were heavy; and they did not know what to answer Him."}],[{"type":"prose","content":"Then He came the third time and said to them,   "}],[{"type":"header","content":"Betrayal and Arrest in Gethsemane(AL)"}],[{"type":"prose","content":"And immediately, while He was still speaking, Judas, one of the twelve, with a great multitude with swords and clubs, came from the chief priests and the scribes and the elders. "}],[{"type":"prose","content":"Now His betrayer had given them a signal, saying, “Whomever I kiss, He is the One; seize Him and lead  away safely.”"}],[{"type":"prose","content":"As soon as he had come, immediately he went up to Him and said to Him, “Rabbi, Rabbi!” and kissed Him."}],[{"type":"prose","content":"Then they laid their hands on Him and took Him. "}],[{"type":"prose","content":"And one of those who stood by drew his sword and struck the servant of the high priest, and cut off his ear."}],[{"type":"prose","content":"Then Jesus answered and said to them,  "}],[{"type":"prose","content":"  "}],[{"type":"prose","content":"Then they all forsook Him and fled."},{"type":"header","content":"A Young Man Flees Naked"}],[{"type":"prose","content":"Now a certain young man followed Him, having a linen cloth thrown around  naked  And the young men laid hold of him, "}],[{"type":"prose","content":"and he left the linen cloth and fled from them naked."},{"type":"header","content":"Jesus Faces the Sanhedrin(AS)"}],[{"type":"prose","content":"And they led Jesus away to the high priest; and with him were assembled all the chief priests, the elders, and the scribes. "}],[{"type":"prose","content":"But Peter followed Him at a distance, right into the courtyard of the high priest. And he sat with the servants and warmed himself at the fire."}],[{"type":"prose","content":"Now the chief priests and all the council sought testimony against Jesus to put Him to death, but found none. "}],[{"type":"prose","content":"For many bore false witness against Him, but their testimonies did not agree."}],[{"type":"prose","content":"Then some rose up and bore false witness against Him, saying, "}],[{"type":"prose","content":"“We heard Him say, ‘I will destroy this temple made with hands, and within three days I will build another made without hands.’ ” "}],[{"type":"prose","content":"But not even then did their testimony agree."}],[{"type":"prose","content":"And the high priest stood up in the midst and asked Jesus, saying, “Do You answer nothing? What  these men testify against You?” "}],[{"type":"prose","content":"But He kept silent and answered nothing.Again the high priest asked Him, saying to Him, “Are You the Christ, the Son of the Blessed?”"}],[{"type":"prose","content":"Jesus said,  "}],[{"type":"prose","content":"Then the high priest tore his clothes and said, “What further need do we have of witnesses? "}],[{"type":"prose","content":"You have heard the blasphemy! What do you think?”And they all condemned Him to be deserving of death."}],[{"type":"prose","content":"Then some began to spit on Him, and to blindfold Him, and to beat Him, and to say to Him, “Prophesy!” And the officers struck Him with the palms of their hands."},{"type":"header","content":"Peter Denies Jesus, and Weeps(BH)"}],[{"type":"prose","content":"Now as Peter was below in the courtyard, one of the servant girls of the high priest came. "}],[{"type":"prose","content":"And when she saw Peter warming himself, she looked at him and said, “You also were with Jesus of Nazareth.”"}],[{"type":"prose","content":"But he denied it, saying, “I neither know nor understand what you are saying.” And he went out on the porch, and a rooster crowed."}],[{"type":"prose","content":"And the servant girl saw him again, and began to say to those who stood by, “This is  of them.” "}],[{"type":"prose","content":"But he denied it again.And a little later those who stood by said to Peter again, “Surely you are  of them; for you are a Galilean, and your speech shows ”"}],[{"type":"prose","content":"Then he began to curse and swear, “I do not know this Man of whom you speak!”"}],[{"type":"prose","content":"A second time  rooster crowed. Then Peter called to mind the word that Jesus had said to him,  And when he thought about it, he wept."}]]