[[],[{"type":"prose","content":"And the passover and the unleavened food were after two days, and the chief priests and the scribes were seeking how, by guile, having taken hold of him, they might kill him;"}],[{"type":"prose","content":"and they said, `Not in the feast, lest there shall be a tumult of the people.'"}],[{"type":"prose","content":"And he, being in Bethany, in the house of Simon the leper, at his reclining (at meat), there came a woman having an alabaster box of ointment, of spikenard, very precious, and having broken the alabaster box, did pour on his head;"}],[{"type":"prose","content":"and there were certain much displeased within themselves, and saying, `For what hath this waste of the ointment been made?"}],[{"type":"prose","content":"for this could have been sold for more than three hundred denaries, and given to the poor;' and they were murmuring at her."}],[{"type":"prose","content":"And Jesus said, `Let her alone; why are ye giving her trouble? a good work she wrought on me;"}],[{"type":"prose","content":"for the poor always ye have with you, and whenever ye may will ye are able to do them good, but me ye have not always;"}],[{"type":"prose","content":"what she could she did, she anticipated to anoint my body for the embalming."}],[{"type":"prose","content":"Verily I say to you, wherever this good news may be proclaimed in the whole world, what also this woman did shall be spoken of -- for a memorial of her.'"}],[{"type":"prose","content":"And Judas the Iscariot, one of the twelve, went away unto the chief priests that he might deliver him up to them,"}],[{"type":"prose","content":"and having heard, they were glad, and promised to give him money, and he was seeking how, conveniently, he might deliver him up."}],[{"type":"prose","content":"And the first day of the unleavened food, when they were killing the passover, his disciples say to him, `Where wilt thou, [that,] having gone, we may prepare, that thou mayest eat the passover?'"}],[{"type":"prose","content":"And he sendeth forth two of his disciples, and saith to them, `Go ye away to the city, and there shall meet you a man bearing a pitcher of water, follow him;"}],[{"type":"prose","content":"and wherever he may go in, say ye to the master of the house -- The Teacher saith, Where is the guest-chamber, where the passover, with my disciples, I may eat?"}],[{"type":"prose","content":"and he will shew you a large upper room, furnished, prepared -- there make ready for us.'"}],[{"type":"prose","content":"And his disciples went forth, and came to the city, and found as he said to them, and they made ready the passover."}],[{"type":"prose","content":"And evening having come, he cometh with the twelve,"}],[{"type":"prose","content":"and as they are reclining, and eating, Jesus said, `Verily I say to you -- one of you, who is eating with me -- shall deliver me up.'"}],[{"type":"prose","content":"And they began to be sorrowful, and to say to him, one by one, `Is it I?' and another, `Is it I?'"}],[{"type":"prose","content":"And he answering said to them, `One of the twelve who is dipping with me in the dish;"}],[{"type":"prose","content":"the Son of Man doth indeed go, as it hath been written concerning him, but wo to that man through whom the Son of Man is delivered up; good were it to him if that man had not been born.'"}],[{"type":"prose","content":"And as they are eating, Jesus having taken bread, having blessed, brake, and gave to them, and said, `Take, eat; this is my body.'"}],[{"type":"prose","content":"And having taken the cup, having given thanks, he gave to them, and they drank of it -- all;"}],[{"type":"prose","content":"and he said to them, `This is my blood of the new covenant, which for many is being poured out;"}],[{"type":"prose","content":"verily I say to you, that no more may I drink of the produce of the vine till that day when I may drink it new in the reign of God.'"}],[{"type":"prose","content":"And having sung an hymn, they went forth to the mount of the Olives,"}],[{"type":"prose","content":"and Jesus saith to them -- `All ye shall be stumbled at me this night, because it hath been written, I will smite the shepherd, and the sheep shall be scattered abroad,"}],[{"type":"prose","content":"but after my having risen I will go before you to Galilee.'"}],[{"type":"prose","content":"And Peter said to him, `And if all shall be stumbled, yet not I;'"}],[{"type":"prose","content":"And Jesus said to him, `Verily I say to thee, that to-day, this night, before a cock shall crow twice, thrice thou shalt deny me.'"}],[{"type":"prose","content":"And he spake the more vehemently, `If it may be necessary for me to die with thee -- I will in nowise deny thee;' and in like manner also said they all."}],[{"type":"prose","content":"And they come to a spot, the name of which [is] Gethsemane, and he saith to his disciples, `Sit ye here till I may pray;'"}],[{"type":"prose","content":"and he taketh Peter, and James, and John with him, and began to be amazed, and to be very heavy,"}],[{"type":"prose","content":"and he saith to them, `Exceeding sorrowful is my soul -- to death; remain here, and watch.'"}],[{"type":"prose","content":"And having gone forward a little, he fell upon the earth, and was praying, that, if it be possible the hour may pass from him,"}],[{"type":"prose","content":"and he said, `Abba, Father; all things are possible to Thee; make this cup pass from me; but, not what I will, but what Thou.'"}],[{"type":"prose","content":"And he cometh, and findeth them sleeping, and saith to Peter, `Simon, thou dost sleep! thou wast not able to watch one hour!"}],[{"type":"prose","content":"Watch ye and pray, that ye may not enter into temptation; the spirit indeed is forward, but the flesh weak.'"}],[{"type":"prose","content":"And again having gone away, he prayed, the same word saying;"}],[{"type":"prose","content":"and having returned, he found them again sleeping, for their eyes were heavy, and they had not known what they might answer him."}],[{"type":"prose","content":"And he cometh the third time, and saith to them, `Sleep on henceforth, and rest -- it is over; the hour did come; lo, the Son of Man is delivered up to the hands of the sinful;"}],[{"type":"prose","content":"rise, we may go, lo, he who is delivering me up hath come nigh.'"}],[{"type":"prose","content":"And immediately -- while he is yet speaking -- cometh near Judas, one of the twelve, and with him a great multitude, with swords and sticks, from the chief priests, and the scribes, and the elders;"}],[{"type":"prose","content":"and he who is delivering him up had given a token to them, saying, `Whomsoever I shall kiss, he it is, lay hold on him, and lead him away safely,'"}],[{"type":"prose","content":"and having come, immediately, having gone near him, he saith, `Rabbi, Rabbi,' and kissed him."}],[{"type":"prose","content":"And they laid on him their hands, and kept hold on him;"}],[{"type":"prose","content":"and a certain one of those standing by, having drawn the sword, struck the servant of the chief priest, and took off his ear."}],[{"type":"prose","content":"And Jesus answering said to them, `As against a robber ye came out, with swords and sticks, to take me!"}],[{"type":"prose","content":"daily I was with you in the temple teaching, and ye did not lay hold on me -- but that the Writings may be fulfilled.'"}],[{"type":"prose","content":"And having left him they all fled;"}],[{"type":"prose","content":"and a certain young man was following him, having put a linen cloth about [his] naked body, and the young men lay hold on him,"}],[{"type":"prose","content":"and he, having left the linen cloth, did flee from them naked."}],[{"type":"prose","content":"And they led away Jesus unto the chief priest, and come together to him do all the chief priests, and the elders, and the scribes;"}],[{"type":"prose","content":"and Peter afar off did follow him, to the inside of the hall of the chief priest, and he was sitting with the officers, and warming himself near the fire."}],[{"type":"prose","content":"And the chief priests and all the sanhedrim were seeking against Jesus testimony -- to put him to death, and they were not finding,"}],[{"type":"prose","content":"for many were bearing false testimony against him, and their testimonies were not alike."}],[{"type":"prose","content":"And certain having risen up, were bearing false testimony against him, saying --"}],[{"type":"prose","content":"`We heard him saying -- I will throw down this sanctuary made with hands, and by three days, another made without hands I will build;'"}],[{"type":"prose","content":"and neither so was their testimony alike."}],[{"type":"prose","content":"And the chief priest, having risen up in the midst, questioned Jesus, saying, `Thou dost not answer anything! what do these testify against thee?'"}],[{"type":"prose","content":"and he was keeping silent, and did not answer anything. Again the chief priest was questioning him, and saith to him, `Art thou the Christ -- the Son of the Blessed?'"}],[{"type":"prose","content":"and Jesus said, `I am; and ye shall see the Son of Man sitting on the right hand of the power, and coming with the clouds, of the heaven.'"}],[{"type":"prose","content":"And the chief priest, having rent his garments, saith, `What need have we yet of witnesses?"}],[{"type":"prose","content":"Ye heard the evil speaking, what appeareth to you?' and they all condemned him to be worthy of death,"}],[{"type":"prose","content":"and certain began to spit on him, and to cover his face, and to buffet him, and to say to him, `Prophesy;' and the officers were striking him with their palms."}],[{"type":"prose","content":"And Peter being in the hall beneath, there doth come one of the maids of the chief priest,"}],[{"type":"prose","content":"and having seen Peter warming himself, having looked on him, she said, `And thou wast with Jesus of Nazareth!'"}],[{"type":"prose","content":"and he denied, saying, `I have not known [him], neither do I understand what thou sayest;' and he went forth without to the porch, and a cock crew."}],[{"type":"prose","content":"And the maid having seen him again, began to say to those standing near -- `This is of them;'"}],[{"type":"prose","content":"and he was again denying. And after a little again, those standing near said to Peter, `Truly thou art of them, for thou also art a Galilean, and thy speech is alike;'"}],[{"type":"prose","content":"and he began to anathematize, and to swear -- `I have not known this man of whom ye speak;'"}],[{"type":"prose","content":"and a second time a cock crew, and Peter remembered the saying that Jesus said to him -- `Before a cock crow twice, thou mayest deny me thrice;' and having thought thereon -- he was weeping."}]]