[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "II.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) The rose.—Heb., chabatseleth. The identification of this flower is a much vexed question. From its derivation, it should be a bulbous plant (batsal—a bulb), and it happens that the flower which for other reasons best satisfies the requirements is of this kind, viz., the Sweet-scented Narcissus (Narcissus tazetta). “Others have suggested the crocus, of which there are many species very common, but they are deficient in perfume, and there is no bulb more fragrant than the narcissus; it is, besides, one of which the Orientals arc passionately fond. While it is in flower it is to be seen in all the bazaars, and the men as well as the women always carry two or three blossoms, at which they are continually smelling” (Tristram, Nat. Hist. of Bible, p. 477). Dr. Thomson prefers the mallow, from the fact that the Arabs call it khubbazey. In Isaiah 35:1, the only other place where chabatseleth occurs, the LXX., Vulg., and Chaldee render “lily,” and many eminent moderns “autumn crocus.” Here the LXX. and the Vulg. have flower.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The rose.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Heb., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "chabatseleth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The identification of this flower is a much vexed question. From its derivation, it should be a bulbous plant (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "batsal",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—a bulb), and it happens that the flower which for other reasons best satisfies the requirements is of this kind, viz., the Sweet-scented Narcissus (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Narcissus tazetta",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ". “",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Others have suggested the crocus, of which there are many species very common, but they are deficient in perfume, and there is no bulb more fragrant than the narcissus; it is, besides, one of which the Orientals arc passionately fond. While it is in flower it is to be seen in all the bazaars, and the men as well as the women always carry two or three blossoms, at which they are continually smelling” (Tristram, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Nat. Hist. of Bible, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 477). Dr. Thomson prefers the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "mallow, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "from the fact that the Arabs call it khubbazey. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the only other place where ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "chabatseleth ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "occurs, the LXX., Vulg., and Chaldee render “lily,” and many eminent moderns “autumn crocus.” Here the LXX. and the Vulg. have ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "flower.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Of Sharon.—Better, of the plain, as in the LXX. Here (as invariably except 1Chronicles 5:16) the Hebrew has the article before sharon, but without definite local allusion to the district north of Philistia. The verse is by many taken as a snatch of a song into which the heroine breaks in answer to the eulogies on her beauty. It is certainly spoken with modest and lowly intention: “I am a mere flower of the plain, a lily of the valley;” by no means like Tennyson’s “Queen lily and rose in one.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Of Sharon.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "of the plain, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as in the LXX. Here (as invariably except ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Chronicles 5:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the Hebrew has the article before ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "sharon, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "but without definite local allusion to the district north of Philistia. The verse is by many taken as a snatch of a song into which the heroine breaks in answer to the eulogies on her beauty. It is certainly spoken with modest and lowly intention: “I am a mere flower of the plain, a lily of the valley;” by no means like Tennyson’s “Queen lily and rose in one.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Lily.—So the LXX. and Vulg.; Heb., shôshanath (fem. of shôshan, or shûshan; comp. name Susan), a word occurring seven times in the poem, three times in 1 Kings 7, and in the headings to Psalms 45, 60, 69, 80. The Arabs have the word, and apply it to any brilliantly coloured flower, as the tulip, anemone, ranunculus. Although many plants of the lily tribe flourish in Palestine, none of them give a predominant character to the flora. There are, however, many other plants which would in popular language be called lilies. Of these, the Irises may claim the first mention; and Dr. Thomson (Land and Book, p. 256) unhesitatingly fixes on one, which he calls Huleh Lily, or the Lily of the Gospel and of the Song of Songs. “Our flower,” he says, “delights most in the valleys, but it is also found in the mountains. It grows among thorns, and I have sadly lacerated my hands while extricating it from them. . . . Gazelles still delight to feed among them, and you can scarcely ride through the woods north of Tabor, where these lilies abound, without frightening them from their flowery pasture.” Tristram, however, prefers the Anemone (A. coronaria), “the most gorgeously painted, the most conspicuous in spring, and the most universally spread of all the treasures of the Holy Land” (Nat. Hist. of Bible, p. 464).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Lily.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—So the LXX. and Vulg.; Heb., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "shôshanath ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(fem. of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "shôshan, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "shûshan; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "comp. name ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Susan",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "a word occurring seven times in the poem, three times in 1 Kings 7, and in the headings to Psalms 45, 60, 69, 80. The Arabs have the word, and apply it to any brilliantly coloured flower, as the tulip, anemone, ranunculus. Although many plants of the lily tribe flourish in Palestine, none of them give a predominant character to the flora. There are, however, many other plants which would in popular language be called lilies. Of these, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Irises ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "may claim the first mention; and Dr. Thomson (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Land and Book, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 256) unhesitatingly fixes on one, which he calls ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Huleh Lily, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or the Lily of the Gospel and of the Song of Songs. “Our flower,” he says, “delights most in the valleys, but it is also found in the mountains. It grows among thorns, and I have sadly lacerated my hands while extricating it from them. . . . Gazelles still delight to feed among them, and you can scarcely ride through the woods north of Tabor, where these lilies abound, without frightening them from their flowery pasture.” Tristram, however, prefers the Anemone (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "A. coronaria",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "“the most gorgeously painted, the most conspicuous in spring, and the most universally spread of all the treasures of the Holy Land” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Nat. Hist. of Bible, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 464).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Song of Solomon 2:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Song of Solomon 2:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am the rose of Sharon ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— These are the words of the bridegroom. He compares himself to the rose and lily, for fragrancy and beauty. Sharon was a very fruitful place, and famous for roses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As the lily among thorns ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Compared with thorns, which it unspeakably exceeds in glory and beauty; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so is my love ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— So far doth my church, or people, excel all other assemblies. The title of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "daughter ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is often given to whole nations. These are Christ’s words, to which the spouse makes the following reply.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-7 Believers are beautiful, as clothed in the righteousness of Christ; and fragrant, as adorned with the graces of his Spirit; and they thrive under the refreshing beams of the Sun of righteousness. The lily is a very noble plant in the East; it grows to a considerable height, but has a weak stem. The church is weak in herself, yet is strong in Him that supports her. The wicked, the daughters of this world, who have no love to Christ, are as thorns, worthless and useless, noxious and hurtful. Corruptions are thorns in the flesh; but the lily now among thorns, shall be transplanted into that paradise where there is no brier or thorn. The world is a barren tree to the soul; but Christ is a fruitful one. And when poor souls are parched with convictions of sin, with the terrors of the law, or the troubles of this world, weary and heavy laden, they may find rest in Christ. It is not enough to pass by this shadow, but we must sit down under it. Believers have tasted that the Lord Jesus is gracious; his fruits are all the precious privileges of the new covenant, purchased by his blood, and communicated by his Spirit; promises are sweet to a believer, and precepts also. Pardons are sweet, and peace of conscience sweet. If our mouths are out of taste for the pleasures of sin, Divine consolations will be sweet to us. Christ brings the soul to seek and to find comforts through his ordinances, which are as a banqueting-house where his saints feast with him. The love of Christ, manifested by his death, and by his word, is the banner he displays, and believers resort to it. How much better is it with the soul when sick from love to Christ, than when surfeited with the love of this world! And though Christ seemed to have withdrawn, yet he was even then a very present help. All his saints are in his hand, which tenderly holds their aching heads. Finding Christ thus nigh to her, the soul is in great care that her communion with him is not interrupted. We easily grieve the Spirit by wrong tempers. Let those who have comfort, fear sinning it away.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The division of the chapters is unfortunate; Cant. 2 ought to have begun at Sol 1:15, or Cant. 1 to have been continued to Sol 2:7. The bride replies, \"And I am like a lovely wild flower springing at the root of the stately forest-trees.\" The majority of Christian fathers assigned this verse to the King (Christ). Hebrew commentators generally assign it to the bride. It is quite uncertain what flower is meant by the word rendered (here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") \"rose.\" The etymology is in favor of its being a bulbous plant (the white narcissus, Conder). \"Sharon\" is usually the proper name of the celebrated plain from Joppa to Caesarea, between the hill-country and the sea, and travelers have remarked the abundance of flowers with which this plain is still carpeted in spring. But in the time of Eusebius and Jerome there was a smaller plain of Sharon (Saron) situated between Mount Tabor and the sea of Tiberias, which would be very near the bride's native home if that were Shunem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 2",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So 2:1-17.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. rose—if applied to Jesus Christ, it, with the white lily (lowly, 2Co 8:9), answers to \"white and ruddy\" (So 5:10). But it is rather the meadow-saffron: the Hebrew means radically a plant with a pungent bulb, inapplicable to the rose. So Syriac. It is of a white and violet color [Maurer, Gesenius, and Weiss]. The bride thus speaks of herself as lowly though lovely, in contrast with the lordly \"apple\" or citron tree, the bridegroom (So 2:3); so the \"lily\" is applied to her (So 2:2),",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sharon—(Isa 35:1, 2). In North Palestine, between Mount Tabor and Lake Tiberias (1Ch 5:16). Septuagint and Vulgate translate it, \"a plain\"; though they err in this, the Hebrew Bible not elsewhere favoring it, yet the parallelism to valleys shows that, in the proper name Sharon, there is here a tacit reference to its meaning of lowliness. Beauty, delicacy, and lowliness, are to be in her, as they were in Him (Mt 11:29).The excellency of the majesty of Christ, Song of Solomon 2:1, and of his church, Song of Solomon 2:2. The benefits which the church receives from him, Song of Solomon 2:3. Christ’s love to his church, Song of Solomon 2:4. The church sick of love; her prayer for help, Song of Solomon 2:5. His ears for her in this condition, Song of Solomon 2:6. The hope and calling of the church, Song of Solomon 2:10-13. Christ’s care of the church, Song of Solomon 2:14,15. The profession of the church; her faith and hope, Song of Solomon 2:16,17.  These are the words either, 1. Of the spouse, continuing her discourse. Or rather, 2. Of the bridegroom, drawing forth the church’s affections to him. He compares himself to the rose and lily, for fragrancy and beauty. Nor is it in the least degree indecent that Christ should thus commend himself, partly because his excellency is so transcendently great, that he is free from all suspicion of vanity and self-flattery; and partly because it is suitable to the style of such writings, and to the present design of recommending himself to the affection of his spouse. He mentions the rose of Sharon, which was a very fruitful place, as is evident from 1 Chronicles 27:29 Isaiah 33:9 65:10, and famous for roses, as may seem probable from Isaiah 35:1,2. Or, as others translate it, the rose of the field, which may note that Christ is not only pleasant and beautiful, but free and communicative, offering himself to all that come to him. The lily is a beautiful and glorious creature, Matthew 6:29, especially to one who beholds it through a magnifying glass. He saith, the lily of the valleys,  because they grew and flourished best in such low and waterish grounds. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Sharon—(Isa 35:1, 2). In North Palestine, between Mount Tabor and Lake Tiberias (1Ch 5:16). Septuagint and Vulgate translate it, \"a plain\"; though they err in this, the Hebrew Bible not elsewhere favoring it, yet the parallelism to valleys shows that, in the proper name Sharon, there is here a tacit reference to its meaning of lowliness. Beauty, delicacy, and lowliness, are to be in her, as they were in Him (Mt 11:29).The excellency of the majesty of Christ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and of his church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The benefits which the church receives from him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Christ’s love to his church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The church sick of love; her prayer for help, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His ears for her in this condition, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The hope and calling of the church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:10-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Christ’s care of the church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:14,15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The profession of the church; her faith and hope, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Song of Solomon 2:16,17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " These are the words either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. Of the spouse, continuing her discourse. Or rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. Of the bridegroom, drawing forth the church’s affections to him. He compares himself to the rose and lily, for fragrancy and beauty. Nor is it in the least degree indecent that Christ should thus commend himself, partly because his excellency is so transcendently great, that he is free from all suspicion of vanity and self-flattery; and partly because it is suitable to the style of such writings, and to the present design of recommending himself to the affection of his spouse. He mentions the rose of Sharon, which was a very fruitful place, as is evident from ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Chronicles 27:29 Isaiah 33:9 65:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and famous for roses, as may seem probable from ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 35:1,2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or, as others translate it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the rose of the field",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which may note that Christ is not only pleasant and beautiful, but free and communicative, offering himself to all that come to him. The ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "lily",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is a beautiful and glorious creature, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Matthew 6:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", especially to one who beholds it through a magnifying glass. He saith, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "the lily of the valleys, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " because they grew and flourished best in such low and waterish grounds. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I am the rose of Sharon, and the lily of the valleys. Whether Christ, or the church, is here speaking, is not certain: most of the Jewish writers (t), and some Christian interpreters (u), take them to be the words of the church, expressing the excellency of her grace, loveliness, and beauty, she had from Christ; and intimating also her being in the open fields, exposed to many dangers and enemies, and so needed his protection. The church may be compared to a \"rose\", for its beautiful colour and sweet odour (w), and for its delight in sunny places, where it thrives best, and is most fragrant. This figure is exceeding just; not only the beauty of women is expressed by the colour of the rose (x), as is common in poems of this kind; to give instances of it would be endless (y); some have had the name of Rhoda from hence; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 12:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". No rose can be more beautiful in colour, and delightful to the eye, than the church is in the eyes of Christ, as clothed with his righteousness, and adorned with the graces of his Spirit: nor is any rose of a more sweet and fragrant smell than the persons of believers are to God and Christ, being considered in him; and even their graces, when in exercise, yea, their duties and services, when performed in faith; and, as the rose, they grow and thrive under the warming, comforting, and refreshing beams of the sun of righteousness, where they delight to be. The church may also be compared to a \"lily of the valleys\", as she is, in the next verse, to one among thorns. This is a very beautiful flower; Pliny (z) says it is next in nobleness to the rose; its whiteness is singularly excellent; no plant more fruitful, and no flower exceeds it in height; in some countries, it rises up three cubits high; has a weak neck or body, insufficient to bear the weight of its head. The church may be compared to a lily, for her beauty and fragrance, as to a rose; and the redness of the rose, and the whiteness of the lily, meeting in her, make her somewhat like her beloved, white and ruddy; like the lily, being arrayed in fine linen, clean and white, the righteousness of the saints; and like it for fruitfulness, as it is in good works, under the influence of divine grace, and grows up on high into her head, Christ Jesus; and though weak in herself, yet strong in him, who supports her, and not she him: and the church may be compared to a \"lily of the valleys\"; which may not describe any particular lily, and what we now call so; but only expresses the place where it grows, in low places, where plants are in danger of being plucked and trodden upon; though they may have more moisture and verdure than those in higher places; so the church of Christ is sometimes in a low estate, exposed to enemies, and liable to be trampled and trodden under foot by them, and to be carried away with the flood of persecution, were it not guarded by divine power; and, being watered with the dews of grace, it becomes flourishing and fruitful. But the more commonly received opinion is, that these are the words of Christ concerning himself; and which indeed best become him, and are more agreeable to his style and language, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and suit best with the words in the Sol 2:2, as one observes (a); nor is it unfitly taken by the bridegroom to himself, since it is sometimes given by lovers to men (b). Christ may be compared to a rose for its colour and smell; to the rose for its red colour: and which may be expressive of the truth of his humanity, and of his bloody sufferings in it; and this, with the whiteness of the lily, finishes the description of him for his beauty, Sol 5:10; and for its sweet smell; which denotes the same things for which he is before compared to spikenard, myrrh, and camphire. The rose, as Pliny says (c), delights not in fat soils and rich clays, but in rubbish, and roses that grow there are of the sweetest smell; and such was the earth about Sharon (d); and to a rose there Christ is compared, to show the excellency and preferableness of him to all others. The word is only used here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Where it is in many versions rendered a \"lily\": it seems to be compounded of two words; one which signifies to \"cover\" and hide, and another which signifies a \"shadow\"; and so may be rendered, \"the covering shadow\": but for what reason a rose should be so called is not easy to say; unless it can be thought to have the figure of an umbrella; or that the rose tree in those parts was so large, as to be remarkable for its shadow; like that Montfaucon (e) saw, in a garden at Ravenna, under the shadow of the branches of which more than forty men could stand: Christ is sometimes compared to trees for their shadow, which is pleasant and reviving, as in Sol 2:3. Some render it, \"the flower of the field\" (f); which may be expressive of the meanness of Christ in the eyes of men; of his not being of human production; of his being accessible; and of his being liable to be trampled upon, as he has been. And as he is compared to a rose, so to a \"lily\", for its colour, height, and fruitfulness; expressive of his purity in himself, of his superiority to angels and men, and of his being filled with the fruits and blessings of grace; and to a lily of the valleys, denoting his wonderful condescension in his low estate of humiliation, and his delight in dwelling with the humble and lowly: some render the words, \"I am the rose of Sharon, with the lily of the valleys\" (g); by the former epithet meaning himself; and by the latter his church, his companion, in strict union and communion with him; of whom the following words are spoken. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Zohar in Gen. fol. 46. 2. Targum, Aben Ezra, & Yalkut in loc. (u) Ainsworth, Brightman, Vatablus; Cocceius; Michaelis. (w) The rose, by the Arcadians, was called  that is, \"sweet-smelling\", Timachidas apud Athenaei Deipnosophist. l. 15. c. 8. p. 682. and \"rosy\" is used for \"beautiful\"; \"rosea cervice refulsit\", Virgil. Aeneid. l. 1. Vid. Servium in ibid. (x) So Helena, for her beauty, is called , in Theocrit. Idyll. 19. The rose was sacred to Venus, Pausaniae Eliac. 2. sive l. 6, p. 391. (y) Vid. Barthii Animadv. ad Claudian. de Nupt. Honor. v. 247. (z) Nat. Hist. l. 21. c. 5. (a) Durham in Ioc. (b) \"Mea rosa\", Plauti Bacchides, Sc. 1. v. 50. Asinaria, Acts 3, Sc. 3. v. 74. Curculio, Acts 1. Sc. 2. v. 6. (c) Nat. Hist. l. 21. c. 4. (d) Misnah Sotah, c. 8. s. 3.((e) Diar. Italic, c. 7. p. 100. (f)  , Sept. \"flos campi\", V. L. Pagninus, Mercerus. (g) \"Ego rosa Sharon lilio vallium\", Marckius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Zohar in Gen. fol. 46. 2. Targum, Aben Ezra, & Yalkut in loc. (u) Ainsworth, Brightman, Vatablus; Cocceius; Michaelis. (w) The rose, by the Arcadians, was called  that is, \"sweet-smelling\", Timachidas apud Athenaei Deipnosophist. l. 15. c. 8. p. 682. and \"rosy\" is used for \"beautiful\"; \"rosea cervice refulsit\", Virgil. Aeneid. l. 1. Vid. Servium in ibid. (x) So Helena, for her beauty, is called , in Theocrit. Idyll. 19. The rose was sacred to Venus, Pausaniae Eliac. 2. sive l. 6, p. 391. (y) Vid. Barthii Animadv. ad Claudian. de Nupt. Honor. v. 247. (z) Nat. Hist. l. 21. c. 5. (a) Durham in Ioc. (b) \"Mea rosa\", Plauti Bacchides, Sc. 1. v. 50. Asinaria, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Sc. 3. v. 74. Curculio, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Sc. 2. v. 6. (c) Nat. Hist. l. 21. c. 4. (d) Misnah Sotah, c. 8. s. 3.((e) Diar. Italic, c. 7. p. 100. (f)  , Sept. \"flos campi\", V. L. Pagninus, Mercerus. (g) \"Ego rosa Sharon lilio vallium\", Marckius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I am the rose of Sharon, and the lily of the valleys.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 2:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Song of Solomon 2:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Song of Solomon 2:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " the bride speaks, describing herself as a humble meadow flower unfit to be in such a luxurious place as that in which she now finds herself, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Song of Solomon 2:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Song of Solomon 2:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Solomon replies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am a crocus of Sharon, a lily of the valleys",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the rose of Sharon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Heb. word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chabhatstseleth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which occurs besides only in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", can hardly mean a rose. The LXX, Vulg., and Targ. to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " translate it ‘lily,’ but as we have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shôshannâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for lily in the next clause, it is probably some other flower. The Targum here gives ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "narqôs rattîb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘the green narcissus,’ but Gesen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". prefers the Syriac translation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Colchicum autumnale",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "meadow saffron",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a meadow flower like the crocus, white and violet in colour, and having poisonous bulbs. This is the most probable of the proposed identifications, though Tristram, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nat. Hist. of Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 476, decides for the sweet-scented narcissus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Narcissus tazetta",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a native of Palestine, and a flower of which the natives are passionately fond. While it is in flower it is to be seen in all the bazaars, and the men as well as the women at that season always carry two or three blossoms which they are constantly smelling.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sharon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] is generally supposed to be the great plain of Sharon to the S. of Carmel on the Mediterranean coast, stretching from Caesarea to Joppa. But the word probably means ‘a plain,’ and might, consequently, be applied by the inhabitants of any district to the plain in their neighbourhood. This is supported by the fact that Eusebius states that the district from Tabor to the Lake of Gennesaret was called Sharon, so here we may render either ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a crocus of Sharon, or of the plain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in the LXX.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the lily",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a lily",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shôshannâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " must be a red flower; cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “His lips are like lilies.” Tristram, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nat. Hist",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 464, identifies it with the scarlet ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Anemone coronaria",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is found everywhere, on all soils and in all situations. It meets every requirement of the allusions in Canticles and is one of the flowers called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "susan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the Arabs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Song of Solomon 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "What Shulamith now further says confirms what had just been said. City and palace with their splendour please her not; forest and field she delights in; she is a tender flower that has grown up in the quietness of rural life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1 I am a meadow-flower of Sharon,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   A lily of the valleys.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We do not render: \"the wild-flower,\" \"the lily,\" ... for she seeks to represent herself not as the one, but only as one of this class; the definiteness by means of the article sometimes belongs exclusively to the second number of the genit. word-chain. מלאך ה may equally (vid., at Sol 1:11, Hitz. on Psalm 113:9, and my Comm. on Genesis 9:20) mean \"an angel\" or \"the angel of Jahve;\" and בת ישׂ \"a virgin,\" or \"the virgin of Israel\" (the personification of the people). For hhǎvatstsělěth (perhaps from hhivtsēl, a denom. quadril. from bětsěl, to form bulbs or bulbous knolls) the Syr. Pesh. (Isaiah 35:1) uses chamsaljotho, the meadow-saffron, colchicum autumnale; it is the flesh-coloured flower with leafless stem, which, when the grass is mown, decks in thousands the fields of warmer regions. They call it filius ante patrem, because the blossoms appear before the leaves and the seed-capsules, which develope themselves at the close of winter under the ground. Shulamith compares herself to such a simple and common flower, and that to one in Sharon, i.e., in the region known by that name. Sharon is per aphaer. derived from ישׁרון. The most celebrated plain of this name is that situated on the Mediterranean coast between Joppa and Caesarea; but there is also a trans-Jordanic Sharon, 1 Chronicles 5:16; and according to Eusebius and Jerome, there is also another district of this name between Tabor and the Lake of Tiberias, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We do not render: \"the wild-flower,\" \"the lily,\" ... for she seeks to represent herself not as the one, but only as one of this class; the definiteness by means of the article sometimes belongs exclusively to the second number of the genit. word-chain. מלאך ה may equally (vid., at Sol 1:11, Hitz. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 113:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and my Comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") mean \"an angel\" or \"the angel of Jahve;\" and בת ישׂ \"a virgin,\" or \"the virgin of Israel\" (the personification of the people). For hhǎvatstsělěth (perhaps from hhivtsēl, a denom. quadril. from bětsěl, to form bulbs or bulbous knolls) the Syr. Pesh. (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") uses chamsaljotho, the meadow-saffron, colchicum autumnale; it is the flesh-coloured flower with leafless stem, which, when the grass is mown, decks in thousands the fields of warmer regions. They call it filius ante patrem, because the blossoms appear before the leaves and the seed-capsules, which develope themselves at the close of winter under the ground. Shulamith compares herself to such a simple and common flower, and that to one in Sharon, i.e., in the region known by that name. Sharon is per aphaer. derived from ישׁרון. The most celebrated plain of this name is that situated on the Mediterranean coast between Joppa and Caesarea; but there is also a trans-Jordanic Sharon, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 5:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and according to Eusebius and Jerome, there is also another district of this name between Tabor and the Lake of Tiberias, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Lagarde, Onomastica, p. 296; cf. Neubauer, Gographic du Talm. p. 47.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which is the one here intended, because Shulamith is a Galilean: she calls herself a flower from the neighbourhood of Nazareth. Aquila translates: \"A rosebud of Sharon;\" but שׁושׁנּה (designedly here the fem. form of the name, which is also the name of a woman) does not mean the Rose which was brought at a later period from Armenia and Persia, as it appears, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Ewald, Jahrbuch, IV p. 71; cf. Wstemann, Die Rose, etc., 1854.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and cultivated in the East (India) and West (Palestine, Egypt, Europe). It is nowhere mentioned in the canonical Scriptures, but is first found in Sir. 24:14; 39:13; 50:8; Wisd. 2:8; and Esther 1:6, lxx. Since all the rosaceae are five-leaved, and all the liliaceae are six-leaved, one might suppose, with Aben Ezra, that the name sosan (susan) is connected with the numeral שׁשׁ, and points to the number of leaves, especially since one is wont to represent to himself the Eastern lilies as red. But they are not only red, or rather violet, but also white: the Moorish-Spanish azucena denotes the white lily.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and cultivated in the East (India) and West (Palestine, Egypt, Europe). It is nowhere mentioned in the canonical Scriptures, but is first found in Sir. 24:14; 39:13; 50:8; Wisd. 2:8; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", lxx. Since all the rosaceae are five-leaved, and all the liliaceae are six-leaved, one might suppose, with Aben Ezra, that the name sosan (susan) is connected with the numeral שׁשׁ, and points to the number of leaves, especially since one is wont to represent to himself the Eastern lilies as red. But they are not only red, or rather violet, but also white: the Moorish-Spanish azucena denotes the white lily.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Fleischer, Sitzungs-Berichten d. Schs. Gesell. d. Wissensch. 1868, p. 305. Among the rich flora on the descent of the Hauran range, Wetstein saw (Reisebericht, p. 148) a dark-violet magnificent lily (susan) as large as his fist. We note here Rckert's \"Bright lily! The flowers worship God in the garden: thou art the priest of the house.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The root-word will thus, however, be the same as that of שׁשׁ, byssus, and שׁישׁ, white marble. The comparison reminds us of Hosea 14:5, \"I shall be as the dew unto Israel: he shall grow as the lily.\" העמקים are deep valleys lying between mountains. She thinks humbly of herself; for before the greatness of the king she appears diminutive, and before the comeliness of the king her own beauty disappears - but he takes up her comparison of herself, and gives it a notable turn. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The root-word will thus, however, be the same as that of שׁשׁ, byssus, and שׁישׁ, white marble. The comparison reminds us of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"I shall be as the dew unto Israel: he shall grow as the lily.\" העמקים are deep valleys lying between mountains. She thinks humbly of herself; for before the greatness of the king she appears diminutive, and before the comeliness of the king her own beauty disappears - but he takes up her comparison of herself, and gives it a notable turn. ",
            "children": []
          }
        ]
      }
    ]
  }
]