[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-7 Believers are beautiful, as clothed in the righteousness of Christ; and fragrant, as adorned with the graces of his Spirit; and they thrive under the refreshing beams of the Sun of righteousness. The lily is a very noble plant in the East; it grows to a considerable height, but has a weak stem. The church is weak in herself, yet is strong in Him that supports her. The wicked, the daughters of this world, who have no love to Christ, are as thorns, worthless and useless, noxious and hurtful. Corruptions are thorns in the flesh; but the lily now among thorns, shall be transplanted into that paradise where there is no brier or thorn. The world is a barren tree to the soul; but Christ is a fruitful one. And when poor souls are parched with convictions of sin, with the terrors of the law, or the troubles of this world, weary and heavy laden, they may find rest in Christ. It is not enough to pass by this shadow, but we must sit down under it. Believers have tasted that the Lord Jesus is gracious; his fruits are all the precious privileges of the new covenant, purchased by his blood, and communicated by his Spirit; promises are sweet to a believer, and precepts also. Pardons are sweet, and peace of conscience sweet. If our mouths are out of taste for the pleasures of sin, Divine consolations will be sweet to us. Christ brings the soul to seek and to find comforts through his ordinances, which are as a banqueting-house where his saints feast with him. The love of Christ, manifested by his death, and by his word, is the banner he displays, and believers resort to it. How much better is it with the soul when sick from love to Christ, than when surfeited with the love of this world! And though Christ seemed to have withdrawn, yet he was even then a very present help. All his saints are in his hand, which tenderly holds their aching heads. Finding Christ thus nigh to her, the soul is in great care that her communion with him is not interrupted. We easily grieve the Spirit by wrong tempers. Let those who have comfort, fear sinning it away.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Render as a wish or prayer: \"O that his left hand were under my head, and that his right hand did embrace me!\" Let him draw me to him with entire affection. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. The \"stay\" she prayed for (So 2:5) is granted (De 33:12, 27; Ps 37:24; Isa 41:16). None can pluck from that embrace (Joh 10:28-30). His hand keeps us from falling (Mt 14:30, 31); to it we may commit ourselves (Ps 31:5).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "left hand—the left is the inferior hand, by which the Lord less signally manifests His love, than by the right; the secret hand of ordinary providence, as distinguished from that of manifested grace (the \"right\"). They really go together, though sometimes they seem divided; here both are felt at once. Theodoret takes the left hand, equivalent to judgment and wrath; the right, equivalent to honor and love. The hand of justice no longer is lifted to smite, but is under the head of the believer to support (Isa 42:21); the hand of Jesus Christ pierced by justice for our sin supports us. The charge not to disturb the beloved occurs thrice: but the sentiment here, \"His left hand,\" &c., nowhere else fully; which accords with the intensity of joy (So 2:5) found nowhere else; in So 8:3, it is only conditional, \"should embrace,\" not \"doth.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Is under my head, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a pillow for me to rest upon. No sooner did I cry out for help, but he was at hand to succour me, and did manifest his tender care and dear love to me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "His left hand is under my head, and his right hand doth embrace me. The church, having desired to be stayed, supported, strengthened, and comforted, presently found her beloved with her, who with both hands sustained her; which shows his tender love to her, care of her, and regard for her; and is expressive of the near and intimate communion she had with him, as the effect of union to him, often enjoyed in his house and ordinances; likewise of blessings of every kind she received from him; temporal, mercies, or left hand blessings, which are necessary to support and carry through this wilderness; and spiritual, or right hand blessings, as justification, pardon, adoption, &c. and, moreover, may denote the safety and security of the church, being encircled in the arms of her beloved, sustained by Christ's left hand, and embraced by his right hand, out of whose hands none can pluck. Some read the words prayer wise, \"let his left hand be\", &c. (b); still desiring further tokens of his love to her, and more and nearer communion with him: others read it in the future, \"his left hand will be\", &c. (c); \"his right hand shall embrace\", &c. expressing the strength of her faith that she should for the future enjoy his gracious presence; and that he would support her, that she should not sink and faint. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Tigurine version, some in Mercer. Marckius; so Ainsworth. (c) V. L. Pagninus Montanus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) Tigurine version, some in Mercer. Marckius; so Ainsworth. (c) V. L. Pagninus Montanus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "His left hand is under my head, and his right hand doth embrace me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The verb here should be taken as expressing a wish. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O that his left hand were under my head, and his right hand were embracing me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His left hand would be under my head",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same words recur in a kind of refrain, and where they must unmistakeably be taken to express a wish.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His left hand is under my head, and his right hand doth embrace me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We may render the verb either as indicative or imperative. The hand gently smooths with loving caresses. The historical sense is more in accordance with the context, as the next verse is an appeal to the attendant ladies. Behold my happiness, how my Beloved comforts me! Song of Solomon 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6 His left hand is under my head,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   And his right hand doth embrace me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With his left hand he supports her head that had fallen backwards, and with his right he embraces her [herzet], as Luther rightly renders it (as he also renders the name Habakkuk by \"der Herzer\"  equals  the embracer); for חבּק signifies properly to enfold, to embrace; but then generally, to embrace lovingly, to fondle, of that gentle stroking with the hand elsewhere denoted by חלּה, mulcere. The situation here is like that at Genesis 29:13; Genesis 48:10; where, connected with the dat., it is meant of loving arms stretched out to embrace. If this sympathetic, gentle embracing exercises a soothing influence on her, overcome by the power of her emotions; so love mutually kindled now celebrates the first hour of delighted enjoyment, and the happy Shulamith calls to those who are witnesses of her joy:  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With his left hand he supports her head that had fallen backwards, and with his right he embraces her [herzet], as Luther rightly renders it (as he also renders the name Habakkuk by \"der Herzer\"  equals  the embracer); for חבּק signifies properly to enfold, to embrace; but then generally, to embrace lovingly, to fondle, of that gentle stroking with the hand elsewhere denoted by חלּה, mulcere. The situation here is like that at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 29:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 48:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; where, connected with the dat., it is meant of loving arms stretched out to embrace. If this sympathetic, gentle embracing exercises a soothing influence on her, overcome by the power of her emotions; so love mutually kindled now celebrates the first hour of delighted enjoyment, and the happy Shulamith calls to those who are witnesses of her joy:  ",
            "children": []
          }
        ]
      }
    ]
  }
]