[{"num":102,"verse":"The prayer of a poor man, when he was anguished, and shedded out his speech before the Lord. Lord, hear thou my prayer; and my cry come to thee. (The prayer of a poor man, when he was anguished, and poured out his words before the Lord. Lord, hear thou my prayer; and let my cry come unto thee.)"},{"num":2,"verse":"Turn not away thy face from me; in whatever day I am troubled, bow down thine ear to me. In whatever day I shall inwardly call thee; hear thou me swiftly. (Turn not away thy face from me; on whatever day I am troubled, bow down thy ear to me. On whatever day that I shall call to thee, please swiftly answer thou me.)"},{"num":3,"verse":"For my days have failed as smoke; and my bones have dried up as croutons/as cracklings, either (the) leaving(s) of frying. (For my days have vanished like smoke; and my bones have dried up like croutons.)"},{"num":4,"verse":"I am smitten as hay, and mine heart (hath) dried up; for I have forgotten to eat my bread. (I am beaten down like dry grass; and I have forgotten to eat my food.)"},{"num":5,"verse":"Of the voice of my wailing; my bone cleaved to my flesh. (My voice waileth; for my bones cleave to my flesh.)"},{"num":6,"verse":"I am made like a pelican of (the) wilderness; I am made as a night crow in an house."},{"num":7,"verse":"I waked; and I am made as a solitary sparrow in the roof. (I lie awake; and I am like a solitary sparrow on the rooftop.)"},{"num":8,"verse":"All day mine enemies despised me; and they that praised me swore against me. (All day long my enemies despise me; and those who be angry with me/and those who mock me, conspire against me.)"},{"num":9,"verse":"For I ate ashes as bread; and I meddled my drink with weeping. (For I have eaten ashes for food; and I have mixed my tears with my drink.)"},{"num":10,"verse":"From the face of the ire of thine indignation; for thou raising me [up] hast hurtled me down. (All because of thy anger, and thy indignation; for first thou hast raised me up, and then thou hast hurtled me down.)"},{"num":11,"verse":"My days bowed away as a shadow; and I waxed dry as hay. (My days disappeared like a shadow; and I am dried up like the hay, or the grass.)"},{"num":12,"verse":"But, Lord, thou dwellest [into] without end; and thy memorial in generation and into generation. (But, Lord, thou livest forever; and shalt be remembered by all generations.)"},{"num":13,"verse":"Lord, thou rising up, shalt have mercy on Zion (Lord, thou shalt rise up, and have mercy on Zion); for the time to have mercy thereof cometh, for the time cometh."},{"num":14,"verse":"For the stones thereof pleased thy servants; and they shall have mercy on the land thereof. (For its stones pleased thy servants; and they even love its dust.)"},{"num":15,"verse":"And, Lord, heathen men shall dread thy name; and all kings of earth shall dread thy glory. (And, Lord, the heathen shall fear thy name; and all the kings of the earth shall fear thy glory.)"},{"num":16,"verse":"For the Lord hath built [up] Zion; and he shall be seen in his glory. (And when the Lord buildeth up Zion again; he shall be seen in all his glory.)"},{"num":17,"verse":"He beheld on the prayer of meek men; and he despised not the prayer of them. (He heareth the prayers of the humble; and he did not despise their prayers.)"},{"num":18,"verse":"Be these things written in another generation; and the people that shall be made shall praise the Lord. (These things be written for another generation; and then those people, yet to be, shall praise the Lord.)"},{"num":19,"verse":"For he beheld from his high holy place; the Lord looked from heaven into earth (the Lord looked down from heaven onto the earth)."},{"num":20,"verse":"For to hear the wailings of fettered men; and for to unbind the sons of slain men."},{"num":21,"verse":"That they tell in Zion the name of the Lord; and his praising in Jerusalem. (So that they tell out the Lord’s name in Zion; and his praises in Jerusalem.)"},{"num":22,"verse":"In gathering together peoples into one; and kings, that they serve the Lord. (Yea, when all peoples, and kingdoms, shall be gathered together into one, to serve the Lord.)"},{"num":23,"verse":"It answered to him in the way of his virtue; Tell thou to me the fewness of my days. (But he hath weakened my strength along the way; he hath shortened my days.)"},{"num":24,"verse":"Again-call thou not me in the middle of my days; thy years be in generation and into generation. (Please do not call me back in the middle of my days; thy years last for all generations.)"},{"num":25,"verse":"Lord, thou foundedest the earth in the beginning; and (the) heavens be the works of thine hands."},{"num":26,"verse":"Those shall perish, but thou dwellest perfectly; and all shall wax eld as a cloth. And thou shalt change them as a covering, and those shall be changed; (They shall perish, but thou shalt live forever; all of them shall grow old like a cloak. And thou shalt change them like a covering, and they shall be changed;)"},{"num":27,"verse":"but thou art the same thyself, and thy years shall not fail. (but thou thyself art the same, and thy years shall have no end.)"},{"num":28,"verse":"The sons of thy servants shall dwell; and the seed of them shall be (ad)dressed, (or directed,) into the world. (The sons and daughters of thy servants shall live; and their children shall be secure before thee/and their descendants shall be established before thee.)"}]