[{"header":"Wisdom and Power"},{"num":8,"verse":"No one can understand and explain things the way wise people can. Their wisdom makes them happy. It changes a sad face into a happy one."},{"num":2,"verse":"I say you should always obey the king’s command. Do this because you made a promise to God."},{"num":3,"verse":"Don’t be afraid to give suggestions to the king, and don’t support something that is wrong. But remember, the king gives the commands that please him."},{"num":4,"verse":"He has the authority to give commands, and no one can tell him what to do."},{"num":5,"verse":"People will be safe if they obey his command. But wise people know the right time to do this, and they also know when to do the right thing."},{"num":6,"verse":"There is a right time and a right way to do everything. You must decide what you should do, even when it might cause problems"},{"num":7,"verse":"and you are not sure what will happen. No one can tell you what will happen in the future."},{"num":8,"verse":"No one has the power to keep their spirit from leaving or to stop their death. During war, no soldier has the freedom to go wherever he wants. In the same way evil does not allow anyone who does wrong to go free."},{"num":9,"verse":"I saw all this. I thought very hard about the things that happen in this world. I saw that people always struggle for the power to rule others, and this is bad for them."},{"num":10,"verse":"I also saw great and beautiful funerals for evil people. While the people were going home after the funeral services, they said good things about the evil people who had died. This happened even in the same towns where the evil people had done many bad things. This is senseless."},{"header":"Justice, Rewards, and Punishment"},{"num":11,"verse":"Sometimes people are not immediately punished for the bad things they do. Their punishment is slow to come, and that makes other people want to do bad things too."},{"num":12,"verse":"A sinner might do a hundred evil things and still live a long time. But I know that it is still better to obey and respect God."},{"num":13,"verse":"Evil people don’t respect God, so they will not get good things or live long lives. Their lives will not be like the shadows that become longer and longer as the sun goes down."},{"num":14,"verse":"There is something else that happens on earth that does not seem fair. Bad things should happen to bad people, and good things should happen to good people. But sometimes bad things happen to good people, and good things happen to bad people. This is not fair."},{"num":15,"verse":"So I decided it was more important to enjoy life because the best thing people can do in this life is to eat, drink, and enjoy life. At least that will help people enjoy the hard work God gave them to do during their life on earth."},{"header":"We Cannot Understand All God Does"},{"num":16,"verse":"I carefully studied the things people do in this life. I saw how busy people are. They work day and night, and they almost never sleep."},{"num":17,"verse":"I also saw that no one can understand all that God does. People can try and try to understand the things that happen here on earth, but they cannot. There may be wise people who claim to understand the meaning of these things, but they are wrong. No one can understand it all."}]