[{"header":"Chapter 8"},{"num":2,"verse":"When Man Dominates Man. Obey the command of the king because of your sacred oath,"},{"num":3,"verse":"and do not be hasty to ignore it. Do not support him in some evil scheme, for he does whatever he pleases."},{"num":4,"verse":"Since his word is sovereign, who can say to him, “What are you doing?”"},{"num":9,"verse":"All this I have observed as I carefully concentrated my mind on everything that is done under the sun, while one person tyrannizes another and causes suffering."},{"num":10,"verse":"The Desire To Do Evil. Meanwhile I have observed the wicked being carried to their graves. They used to approach and enter the holy place, and they were praised in the city for having done such things. This also is vanity."},{"num":11,"verse":"Because the sentence for committing an evil act is not carried out quickly, people’s hearts are prone to act wickedly."},{"num":12,"verse":"Even though the sinner does wrong a hundred times and continues to live, I am confident that things will go well for those who fear God because of their fear of him."},{"num":13,"verse":"However, things will not go well with the wicked, and their days will not lengthen like a shadow, because they do not stand in fear before God."},{"num":14,"verse":"What Constitutes Happiness. Another vanity that takes place on earth is that sometimes righteous people are treated as though they had acted in an evil way, and wicked people are treated as though they had lived righteous lives. This too, I say, is vanity."},{"num":15,"verse":"Therefore, I commend enjoyment, since there is nothing better for a man under the sun than to eat and drink and be glad. This is his reward for his toil during the days of life that God grants him under the sun."},{"header":"How To Know?"},{"num":16,"verse":"The Claims of a Wise Man. Having pursued my goal to acquire wisdom and to observe the tasks undertaken on earth by man, whose eyes do not find rest either by day or by night,"},{"num":17,"verse":"I came to the realization that man is unable to discover all God’s work that is done under the sun. However great an effort a man exerts in this search, he will never succeed. A wise man may claim to know, but he is in no way able to do so."}]