[{"header":"Hezekiah Reforms Judah’s Worship"},{"num":31,"verse":"When this was over, all the Israelites who were there went to the cities in Judah. They crushed the sacred stones, cut down the poles dedicated to the goddess Asherah, and tore down the illegal places of worship and the altars throughout Judah, Benjamin, Ephraim, and Manasseh. The Israelites destroyed all of these things. Then all the Israelites returned to their own cities. Each person went to his own property."},{"num":2,"verse":"Hezekiah assigned the priests and the Levites to divisions. Each priest or Levite was put in a division based on the service he performed: sacrificing burnt offerings, sacrificing fellowship offerings, serving, giving thanks, or praising within the gates of the Lord’s camp."},{"num":3,"verse":"He set aside part of the king’s property for burnt offerings, the morning and evening offerings, burnt offerings on the weekly days of rest—holy days, the New Moon Festivals, and the annual festivals, as it is written in the Lord’s Teachings. "},{"num":4,"verse":"He told the people living in Jerusalem to give the priests and Levites the portions they were due so that they could devote themselves to the Lord’s Teachings. "},{"num":5,"verse":"As soon as the word spread, the Israelites brought plenty of offerings from the first of their produce: grain, new wine, fresh olive oil, honey, and every crop from the fields. They brought large quantities, a tenth of everything. "},{"num":6,"verse":"The people of Israel and Judah who were living in the cities of Judah brought a tenth of their cattle and sheep and a tenth of the holy things they had dedicated to the Lord their God. They piled these holy things in heaps. "},{"num":7,"verse":"In the third month they started piling them up, and in the seventh month they finished. "},{"num":8,"verse":"When Hezekiah and the leaders saw the heaps, they praised the Lord and his people Israel."},{"num":9,"verse":"Hezekiah asked the priests and the Levites about the heaps. "},{"num":10,"verse":"The chief priest Azariah from Zadok’s family said, “Since the people started to bring the offerings to the Lord’s temple, we have had all we wanted to eat and plenty to spare. The Lord has blessed his people, and there’s a lot left over.”"},{"num":11,"verse":"Then Hezekiah told them to prepare storerooms in the Lord’s temple. After they had prepared them, "},{"num":12,"verse":"they faithfully brought in the contributions, the offerings of one-tenth of the crops, and the gifts dedicated to God. The Levite Conaniah was in charge of these things, and his brother Shimei was his assistant. "},{"num":13,"verse":"King Hezekiah and Azariah, who was in charge of God’s temple, appointed Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismachiah, Mahath, and Benaiah to serve under Conaniah and his brother Shimei. "},{"num":14,"verse":"Kore, son of Imnah the Levite, was the gatekeeper at East Gate and had to take care of the freewill offerings made to God. His responsibility was to distribute the offerings made to the Lord and the holy gifts dedicated to God. "},{"num":15,"verse":"Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah served under him in the cities belonging to the priests. They were to distribute the offerings faithfully to all their relatives, young and old, by their divisions. "},{"num":16,"verse":"They were appointed to distribute them to males who were at least three years old. The way they were enrolled in the genealogical records did not matter. The six men who served under Kore were to distribute the offerings to everyone who went to the Lord’s temple to perform the daily service that each division was responsible for. "},{"num":17,"verse":"They were to distribute offerings to the priests who were enrolled by families and to the Levites who were at least 20 years old. Distribution was based on the way they served in their divisions. "},{"num":18,"verse":"The priests and Levites were enrolled with their wives, sons, daughters, and other people who depended on them—the whole community. The priests and Levites had to be faithful in keeping themselves holy for the holy work. "},{"num":19,"verse":"Men were appointed to give a portion of the offerings to all the males in the priestly families and to everyone listed in the genealogies of the Levites. These men were Aaron’s descendants, priests who lived in the pasturelands of every Levite city."},{"num":20,"verse":"This is what Hezekiah did throughout Judah. He did what was good and right and true to the Lord his God. "},{"num":21,"verse":"Hezekiah incorporated Moses’ Teachings and commands into worship and dedicated his life to serving God. Whatever he did for the worship in God’s temple, he did wholeheartedly, and he succeeded."}]