[{"num":31,"verse":"When the Passover was finished, all the Israelites who had attended the festival left Jerusalem for the cities of Judah, Benjamin, Ephraim, and Manasseh. There they continued Hezekiah’s zeal by destroying all cultic statues and carved images of Asherah. Having purged the nation of idolatrous symbols like the high places and altars, the Israelites returned to their own homes."},{"num":2,"verse":"Meanwhile Hezekiah continued structuring the temple activities. He reorganized the divisions of priests and Levites according to their duties, such as making burnt or peace offerings, ministering, worshiping, or praising near the gates to the Eternal’s camp."},{"num":3,"verse":"Just as his ancestors David and Solomon did before him, Hezekiah donated a portion of his animals for the morning, evening, Sabbath, new moon, and other festival burnt offerings as the Eternal’s law requires. "},{"num":4,"verse":"He also commanded everyone in Jerusalem to offer a portion of their possessions to the priests and the Levites, so that each person could participate in the Eternal’s law by tithing. "},{"num":5,"verse":"Once everyone had heard Hezekiah’s request, the Israelites in Jerusalem gave more than was required from their best grain, wine, oil, honey, and produce, creating a surplus of offerings. "},{"num":6,"verse":"Those Israelites living in neighboring Judahite cities brought tithes and offerings of oxen, sheep, and other sacred gifts, which were cleansed and piled high for use by the Eternal One their God. "},{"num":7,"verse":"The offerings continued from the third month until the seventh month when the offerings were so plentiful that they lay in stacks around the temple yard. "},{"num":8,"verse":"Seeing the heaps of tithes, Hezekiah and his officers praised the Eternal and blessed the Israelites who had answered their obligations. "},{"num":9,"verse":"Hezekiah wondered why all the gifts had not been offered to God, so he asked the priests and Levites what would happen to the offerings. "},{"num":10,"verse":"Azariah, the chief priest and a Zadokite, answered."},{"num":11,"verse":"Having no place to put the abundance, Hezekiah commanded the priests and Levites to prepare storage rooms in the Eternal’s temple. Once the rooms were ready, "},{"num":12,"verse":"the people continued offering their gifts, which were organized by Conaniah (the Levite) and his brother and assistant, Shimei. "},{"num":13,"verse":"They supervised Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismachiah, Mahath, and Benaiah, who were all appointed overseers of the tithes by both King Hezekiah and chief priest Azariah."},{"num":14,"verse":"Kore (son of Imnah the Levite and the eastern gatekeeper) distributed the freewill offerings to the True God—both the contributions to the Eternal and the most sacred gifts. "},{"num":15,"verse":"He supervised Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah in the cities of the priests, and they fairly distributed the goods to the Levites by their divisions and gave an equal amount to all men 30 years old and older, regardless of the size of their division or their lineage, who entered the Eternal’s temple to perform the daily duties. "},{"num":17,"verse":"Kore and his men also distributed goods to the priests according to their lineage and to the Levites 20 years old and older according to their duties and divisions. "},{"num":18,"verse":"(Included in those genealogical records were the Levites’ and priests’ wives and children who also cleansed themselves regularly to be holy before Him.)"},{"num":19,"verse":"Even the descendants of Aaron who lived outside the cities in the surrounding pasturelands were provided for. In each city men were designated to distribute goods to every male priest and every Levite included in a Levitical genealogy."},{"num":20,"verse":"Hezekiah organized the religious practices throughout all of Judah, just as the Eternal, his True God, considered right. "},{"num":21,"verse":"Every idea Hezekiah had concerning the improvement of the True God’s temple was begun by his commandments and carried out by his people. And Hezekiah did all out of a dedicated heart and was rewarded for his work."}]