[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 5:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 5:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The man shall bring her to the priest ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— With the witnesses that could prove the ground of his suspicions, and desire she might be put upon her trial. The Jews say, the priest was first to endeavour to persuade her to confess the truth, saying, to this purpose, “Dear daughter, perhaps thou wast overtaken by drinking wine, or wast carried away by the heat of youth, or the examples of ill neighbours; come, confess the truth, for the sake of his great name, which is described in this most sacred ceremony; and do not let it be blotted out with the bitter water.” If she confessed, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am defiled, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "she was not put to death, but was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "divorced, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lost her dowry; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "if she said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am pure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "then they proceeded.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:11-31 This law would make the women of Israel watch against giving cause for suspicion. On the other hand, it would hinder the cruel treatment such suspicions might occasion. It would also hinder the guilty from escaping, and the innocent from coming under just suspicion. When no proof could be brought, the wife was called on to make this solemn appeal to a heart-searching God. No woman, if she were guilty, could say Amen to the adjuration, and drink the water after it, unless she disbelieved the truth of God, or defied his justice. The water is called the bitter water, because it caused the curse. Thus sin is called an evil and a bitter thing. Let all that meddle with forbidden pleasures, know that they will be bitterness in the latter end. From the whole learn, 1. Secret sins are known to God, and sometimes are strangely brought to light in this life; and that there is a day coming when God will, by Christ, judge the secrets of men according to the gospel, Ro 2:16. 2 In particular, Whoremongers and adulterers God will surely judge. Though we have not now the waters of jealousy, yet we have God's word, which ought to be as great a terror. Sensual lusts will end in bitterness. 3. God will manifest the innocency of the innocent. The same providence is for good to some, and for hurt to others. And it will answer the purposes which God intends.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The offering was to be of the cheapest and coarsest kind, barley (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), representing the abused condition of the suspected woman. It was, like the sin-offering ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to be made without oil and frankincense, the symbols of grace and acceptableness. The woman herself stood with head uncovered ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in token of her shame.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12-15. if any man's wife go aside, and commit a trespass against him—This law was given both as a strong discouragement to conjugal infidelity on the part of a wife, and a sufficient protection of her from the consequences of a hasty and groundless suspicion on the part of the husband. His suspicions, however, were sufficient in the absence of witnesses (Le 20:10) to warrant the trial described; and the course of proceeding to be followed was for the jealous husband to bring his wife unto the priest with an offering of barley meal, because none were allowed to approach the sanctuary empty handed (Ex 23:15). On other occasions, there were mingled with the offering, oil which signified joy, and frankincense which denoted acceptance (Ps 141:2). But on the occasion referred to, both these ingredients were to be excluded, partly because it was a solemn appeal to God in distressing circumstances, and partly because it was a sin offering on the part of the wife, who came before God in the character of a real or suspected offender.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " she persisting in her denial, and her husband requiring her submission to this way of trial. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Her offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was partly because none were to appear before God empty, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 23:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 23:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; partly, by way of solemn appeal to God, whom hereby she desired to judge between her and her husband; and partly, by way of atonement to appease God, who had for her sins stirred up her husband against her, and sent an evil spirit between them. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 26:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 26:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "No oil nor frankincense",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", both because it was a kind of sin-offering, from which these were excluded, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 5:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 5:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to testify, her sorrowful sense of the hand of God, and of her husband’s displeasure, and because she came thither as a delinquent, or one suspected of delinquency, and under an ill fame, and unpleasing both to God and men; as one that wanted that grace and amiableness and joy which oil signified, and that acceptance with God which frankincense designed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 141:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Bringing iniquity to remembrance; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " both to God, before whom she appeared as a sinner, and to her own conscience, if she were guilty, and, if she were not guilty of this, yet it reminded her of her other sins, for which this might be a punishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then shall the man bring his wife unto the priest,.... Not to the high priest but to a common priest, anyone then officiating in his course; for there was a jealousy offering to be offered up before the Lord upon the altar, which none but a priest might do; and besides, the whole process in this affair was to be carried, on by him: according to the Misnah (n), the man brought his wife first to the sanhedrim, or court of judicature in the place where he lived; before whom, as Maimonides (o) says, he proved by witnesses that he had warned his wife of being in private with such a man, and yet she had done it again; and whereas she insisted on her chastity, he desired that the bitter waters might be given her, that the truth might appear; and then they sent him with two disciples of the wise men, to the great sanhedrim at Jerusalem, where the trial was made; who, in order to bring her too confession, endeavoured to terrify her, as they do persons in capital cases, and finding this wilt not do, then they used smooth words, saying, my daughter, perhaps much wine was the occasion of it, or much laughter, &c. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he shall bring her offering for her: not the priest, but her husband, and that whether he is willing or not, as Aben Ezra; who also observes, that it may be interpreted, with her, or for her sake, not to make any expiation for any fault of his, that when he first observed her immodesty, did not reprove her; for the offering, though brought by him, was not his, but his wife's, and not to expiate her sin, but to bring it to remembrance, as is after expressed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the tenth part of an ephah of barley meal; which was an omer, Exodus 16:36, the quantity of manna for one man every day, Exodus 16:16, and the quantity of flour in the daily meat offering, Exodus 29:40; only that was of fine wheaten flour; this of barley, the food of beasts, as the Targum of Jonathan remarks; and R. Gamaliel in the Misnah (p) says, that as her deed was the deed of a beast, so her offering was the food of a beast; and this is observed by Jarchi and Aben Ezra on the text, as the reason of barley being used in this offering: some say it was a symbol of her impudence, others of her being little at home, as the barley is not long under ground (q); the true reason, it may be, was for her humiliation, being vile, and mean, hence it follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the tenth part of an ephah of barley meal; which was an omer, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the quantity of manna for one man every day, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the quantity of flour in the daily meat offering, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 29:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; only that was of fine wheaten flour; this of barley, the food of beasts, as the Targum of Jonathan remarks; and R. Gamaliel in the Misnah (p) says, that as her deed was the deed of a beast, so her offering was the food of a beast; and this is observed by Jarchi and Aben Ezra on the text, as the reason of barley being used in this offering: some say it was a symbol of her impudence, others of her being little at home, as the barley is not long under ground (q); the true reason, it may be, was for her humiliation, being vile, and mean, hence it follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall pour no oil upon it, nor put frankincense thereon; as used to be oft meat offerings, denoting their acceptableness to God, Leviticus 2:1; the reason seems to be, because these were tokens of joy and gladness, whereas this was a mournful affair to the husband, that he should have any cause of suspicion and jealousy, to the wife that she should be suspected, and to the whole family on that account: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he shall pour no oil upon it, nor put frankincense thereon; as used to be oft meat offerings, denoting their acceptableness to God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the reason seems to be, because these were tokens of joy and gladness, whereas this was a mournful affair to the husband, that he should have any cause of suspicion and jealousy, to the wife that she should be suspected, and to the whole family on that account: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for it is an offering of jealousy, an offering of memorial, bringing iniquity to remembrance; if guilty of it, and therefore oil and frankincense were forbidden in this kind of offering as in a sin offering, Leviticus 5:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for it is an offering of jealousy, an offering of memorial, bringing iniquity to remembrance; if guilty of it, and therefore oil and frankincense were forbidden in this kind of offering as in a sin offering, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Ut supra, (Misn. Bava Kama, c. 9.) sect. 3, 4. (o) Hilchot Sotah, c. 3. sect. 1.((p) Sotah, c. 2. sect. 1.((q) Apud Muis. in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Ut supra, (Misn. Bava Kama, c. 9.) sect. 3, 4. (o) Hilchot Sotah, c. 3. sect. 1.((p) Sotah, c. 2. sect. 1.((q) Apud Muis. in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then shall the man bring his wife unto the priest, and he shall bring her offering for her, the tenth part of an ephah of barley meal; he shall pour no {f} oil upon it, nor put frankincense thereon; for it is an offering of jealousy, an offering of memorial, bringing iniquity to {g} remembrance.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then shall the man bring his wife unto the priest, and he shall bring her offering for her, the tenth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "part",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of an ephah of barley meal; he shall pour no ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " oil upon it, nor put frankincense thereon; for it ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an offering of jealousy, an offering of memorial, bringing iniquity to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " remembrance.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Only in the sin offering, and so this offering of jealousy were neither oil nor incense offered.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Or, making the sin known, and not purging it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tenth part of an ephah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A little under 7 pints. An ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ephah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was a dry measure equivalent to the liquid measure ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; both were equal to 1/10th ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "homer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "barley meal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The coarsest farinaceous food, ordinarily used by the poorer classes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and given to animals (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It would frequently be used as an offering in early days, but the mention of it is unique in P , which probably shews that it was an integral part of a primitive ceremony on which P’s account is based. Elsewhere in P ‘fine meal’ is always prescribed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall pour no oil upon it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Perhaps because symbols of joy and festivity were excluded by the grievous nature of the woman’s alleged crime. Oil and frankincense were also forbidden in the case of a poor man’s sin-offering (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - He shall bring her offering for her. ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "קָדְבָּנָהּ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"her offering;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עָלֶיהָ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"on her account.\" It was to be a meat offering - not connected on this occasion with any other sacrifice - of the fruits of the earth, symbolizing the fruits of her guilty, or at least care. less and suspicious, conduct. As of barley meal, not of fine wheat flour, it indicated her present low and vile estate (deserved or undeserved); as without incense or oil, it disclaimed for itself the sanctifying influences of God's grace and of prayer. Thus every detail of the offering, while it did not condemn the woman (for one found guilty could not have made any offering at all), yet represented her questionable repute and unquestionable dishonour, for even the unjust suspicion  of the husband is a dishonour to the wife. Barley meal. In the days of Elisha half the price of fine flour (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and only eaten by the poor (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "offering of jealousy.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Literally, \"of jealousies.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "קְנָאֹת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an intensive plural. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "offering of memorial, bringing iniquity to remembrance.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Θυσία μνημοσίνου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Septuagint. An offering to bring the woman into judicial remembrance before the Lord, in order that her sin (if any) might be remembered with him, and be declared. Numbers 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If a man's wife went aside, and was guilty of unfaithfulness towards him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is an explanatory clause), through a (another) man having lain with her with emissio seminis, and it was hidden from the eyes of her husband, on account of her having defiled herself secretly, and there being no witness against her, and her not having been taken (in the act); but if, for all that, a spirit of jealousy came upon him, and he was jealous of his wife, and she was defiled,...or she was not defiled: the man was to take his wife to the priest, and bring as her sacrificial gift, on her account, the tenth of an ephah of barley meal, without putting oil or incense, \"for it is a meat-offering of jealousy, a meat-offering of memory, to bring iniquity to remembrance.\" As the woman's crime, of which her husband accused her, was naturally denied by herself, and was neither to be supported by witnesses nor proved by her being taken in the very act, the only way left to determine whether there was any foundation or not for the spirit of jealousy excited in her husband, and to prevent an unrighteous severance of the divinely appointed marriage, was to let the thing be decided by the verdict of God Himself. To this end the man was to bring his wife to the priest with a sacrificial gift, which is expressly called קרבּנהּ, her offering, brought עליה \"on her account,\" that is to say, with a meat-offering, the symbol of the fruit of her walk and conduct before God. Being the sacrificial gift of a wife who had gone aside and was suspected of adultery, this meat-offering could not possess the character of the ordinary meat-offerings, which shadowed forth the fruit of the sanctification of life in good works; could not consist, that is to say, of fine wheaten flour, but only of barley meal. Barley was worth only half as much as wheat (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so that only the poorer classes, or the people generally in times of great distress, used barley meal as their daily food (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whilst those who were better off used it for fodder (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Barley meal was prescribed for this sacrifice, neither as a sign that the adulteress had conducted herself like an irrational animal (Philo, Jonathan, Talm., the Rabb., etc.), nor \"because the persons presenting the offering were invoking the punishment of a crime, and not the favour of God\" (Cler., Ros.): for the guilt of a woman was not yet established; nor even, taking a milder view of the matter, to indicate that the offerer might be innocent, and in that case no offering at all was required Knobel), but to represent the questionable repute in which the woman stood, or the ambiguous, suspicious character of her conduct. Because such conduct as hers did not proceed from the Spirit of God, and was not carried out in prayer: oil and incense, the symbols of the Spirit of God and prayer, were not to be added to her offering. It was an offering of jealousy (קנאת, an intensive plural), and the object was to bring the ground of that jealousy to light; and in this respect it is called the \"meat-offering of remembrance,\" sc., of the woman, before Jehovah (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 31:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), namely, \"the remembrance of iniquity,\" bringing her crime to remembrance before the Lord, that it might be judged by Him.",
        "children": []
      }
    ]
  }
]