[{"header":"One Destiny for All"},{"num":9,"verse":"For all this I laid on my heart and to ascertain all this: that the righteous and the wise, as well as their works are in the hand of God. Whether love or hatred, no one knows—everything awaits them."},{"num":2,"verse":"Everyone shares the same destiny: for the righteous and the wicked; for the good, the ritually clean and the defiled; for one who sacrifices and one who does not sacrifice; as the good person so the sinner; as the one who swears like the one who fears an oath."},{"num":3,"verse":"This is a misery in everything done under the sun: that the same destiny awaits everyone. Moreover, the hearts of all humans are full of evil, and folly is in their hearts during their lives—after that they die. "},{"num":4,"verse":"Everyone who is among the living has hope—even a living dog is better off than a dead lion."},{"num":7,"verse":"Go! Eat your bread with gladness and drink your wine with a merry heart, for God has already accepted your deeds. "},{"num":8,"verse":"Let your clothes always be white, and do not spare oil on your head. "},{"num":9,"verse":"Live joyously with the wife whom you love all the days of your fleeting life that He has given you under the sun during all your fleeting days—for this is your portion in life and in your toil that you labor under the sun."},{"num":10,"verse":"Whatever your hand finds to do, do with your all strength, for there is no work or planning or knowledge or wisdom in Sheol, where you are going."},{"num":13,"verse":"I also observed this as wisdom under the sun, and it greatly impressed me. "},{"num":14,"verse":"There was a little city with a few people in it and a mighty king came against it, surrounded it, and built great siege works against it. "},{"num":15,"verse":"Now a poor, wise man was found in it, and he delivered the city by his shrewdness. Yet nobody remembered that poor man! "},{"num":16,"verse":"So I said: “Wisdom is better than strength.” But the poor man’s wisdom is despised and his words are not heeded."}]