[{"num":4,"verse":"Hear, ye banim, the musar (instruction, discipline) of an av, and attend to know binah (understanding)."},{"num":2,"verse":"For I give you lekach tov (good doctrine, good instruction), forsake ye not my torah."},{"num":3,"verse":"For I was ben to avi, tender and yachid (an only child) before immi."},{"num":4,"verse":"He taught me also, and said unto me, Let thine lev retain my words; be shomer over my mitzvot, and live."},{"num":5,"verse":"Acquire chochmah, acquire binah (understanding); forget it not; neither turn from the words of my peh (mouth)."},{"num":6,"verse":"Forsake her not, and she shall be shomer over thee; love her, and she shall protect thee."},{"num":7,"verse":"Chochmah is the principal thing; therefore get chochmah, and with all thy getting get binah (understanding)."},{"num":8,"verse":"Exalt her, and she shall promote thee; she shall honor thee with kavod, when thou dost embrace her."},{"num":9,"verse":"She shall give to thine head a garland of chen; an ateret (crown) of tiferet (glory) shall she present to thee."},{"num":10,"verse":"Hear, O beni (my son), and receive my sayings; and thy shnot chayyim shall be many."},{"num":11,"verse":"I have taught thee in the derech chochmah; I have led thee in ma’aglei yosher (right paths)."},{"num":12,"verse":"When thou goest, thy steps shall not be hindered; and when thou runnest, lo tikashel (thou shalt not stumble)."},{"num":13,"verse":"Take firm hold of musar; let her not go; guard her; for she is thy chayyim."},{"num":14,"verse":"Enter not into the orach resha’im, and go not on the derech ra’im (road of the wicked)."},{"num":15,"verse":"Avoid it, travel al (not) on it, turn from it, and pass on."},{"num":16,"verse":"For they sleep not, unless they have done evil; and their sheynah (sleep) is robbed, unless they cause some to fall."},{"num":17,"verse":"For they eat the lechem of resha, and drink the yayin of chamasim (violences)."},{"num":18,"verse":"But the orach tzaddikim (path of the righteous) is as the bright light, that shineth brighter and brighter unto the full day."},{"num":19,"verse":"The derech resha’im is as deep darkness; they know not at what they stumble."},{"num":20,"verse":"Beni (my son), attend to my words; incline thine ozen unto my sayings."},{"num":21,"verse":"Let them not depart from thine eyes; be shomer over them within thine lev."},{"num":22,"verse":"For they are chayyim unto those that find them, and health to all their basar."},{"num":23,"verse":"Set watch over and guard thy lev with all diligence; for out of it are the totze’ot chayyim (issues, wellsprings of life cf Mk 7:20-23)."},{"num":24,"verse":"Put away from thee a deceitful peh (mouth), and perverse sfatayim (lips) put far from thee."},{"num":25,"verse":"Let thine eynayim look straight forward, and let thine eyelids look straight before thee."},{"num":26,"verse":"Ponder the ma’agal (path) of thy raglayim, and let all thy drakhim be firm."},{"num":27,"verse":"Turn not to the right hand nor to the left; remove thy regel from rah [T.N. Everyone in life has two paths to choose from just as Moshiach Tzidkeinu spoke of two gates, a wide one crowded with traffic and leading to destruction, and another one found by few but leading to life and redemption‖Mt 7:13-14]."}]