[{"num":1,"verse":"When thou sittest to eat with a ruler, consider diligently what is before thee,"},{"num":2,"verse":"And put thy knife to thy throat, if thou be a man given to the appetite."},{"num":3,"verse":"Be not desirous of his dainty meats: for it is a deceivable meat."},{"num":4,"verse":"Travail not too much to be rich: but cease from thy wisdom."},{"num":5,"verse":"Wilt thou cast thine eyes upon it, which is nothing? for riches taketh her to her wings, as an Eagle, and flieth into the heaven."},{"num":6,"verse":"Eat thou not the bread of him that hath an evil eye, neither desire his dainty meats."},{"num":7,"verse":"For as though he thought it in his heart: so will he say unto thee, Eat and drink: but his heart is not with thee."},{"num":8,"verse":"Thou shalt vomit thy morsel that thou hast eaten, and thou shalt lose thy sweet words."},{"num":9,"verse":"Speak not in the ears of a fool: for he will despise the wisdom of thy words."},{"num":10,"verse":"Remove not the ancient bounds, and enter not into the fields of the fatherless."},{"num":11,"verse":"For he that redeemeth them, is mighty: he will defend their cause against thee."},{"num":12,"verse":"Apply thine heart to instruction, and thine ears to the words of knowledge."},{"num":13,"verse":"Withhold not correction from the child: if thou smite him with the rod, he shall not die."},{"num":14,"verse":"Thou shalt smite him with the rod, and shalt deliver his soul from hell."},{"num":15,"verse":"My son, if thine heart be wise, mine heart shall rejoice, and I also,"},{"num":16,"verse":"And my reins shall rejoice, when thy lips speak righteous things."},{"num":17,"verse":"Let not thine heart be envious against sinners: but let it be in the fear of the Lord continually."},{"num":18,"verse":"For surely there is an end, and thy hope shall not be cut off."},{"num":19,"verse":"O thou my son, hear, and be wise, and guide thine heart in the way."},{"num":20,"verse":"Keep not company with drunkards, nor with gluttons."},{"num":21,"verse":"For the drunkard and the glutton shall be poor, and the sleeper shall be clothed with rags."},{"num":22,"verse":"Obey thy father that hath begotten thee, and despise not thy mother when she is old."},{"num":23,"verse":"Buy the truth, but sell it not: likewise wisdom, instruction, and understanding."},{"num":24,"verse":"The father of the righteous shall greatly rejoice, and he that begetteth a wise child, shall have joy of him."},{"num":25,"verse":"Thy father and thy mother shall be glad, and she that bare thee shall rejoice."},{"num":26,"verse":"My son, give me thine heart, and let thine eyes delight in my ways."},{"num":27,"verse":"For a whore is as a deep ditch, and a strange woman is as a narrow pit."},{"num":28,"verse":"Also she lieth in wait as for a prey, and she increaseth the transgressors among men."},{"num":29,"verse":"To whom is woe? to whom is sorrow? to whom is strife? to whom is murmuring? to whom are wounds without cause? and to whom is the redness of the eyes?"},{"num":30,"verse":"Even to them that tarry long at the wine, to them that go, and seek mixed wine."},{"num":31,"verse":"Look not thou upon the wine, when it is red, and when it showeth his color in the cup, or goeth down pleasantly."},{"num":32,"verse":"In the end thereof it will bite like a serpent, and hurt like a cockatrice."},{"num":33,"verse":"Thine eyes shall look upon strange women, and thine heart shall speak lewd things."},{"num":34,"verse":"And thou shalt be as one that sleepeth in the midst of the sea, and as he that sleepeth in the top of the mast."},{"num":35,"verse":"They have stricken me, shalt thou say, but I was not sick: they have beaten me, but I knew not, when I awoke: therefore will I seek it yet still."}]