[{"num":23,"verse":"When thou sittest to eat with the prince, perceive thou diligently what things be set before thy face,"},{"num":2,"verse":"and set thou a coulter in thy throat. If nevertheless thou hast power on thy soul, (and set thou a knife at thy own throat, if thou hast not power over thy self.)"},{"num":3,"verse":"desire thou not of his meats, in whom is the bread of lying. (Do not thou desire any of his food, for he is not what he seemeth to be/for this is not what it seemeth to be.)"},{"num":4,"verse":"Do not thou travail to be made rich, but set thou measure to thy prudence. (Do not thou labour to be made rich, but set thou a limit to what thou can achieve.)"},{"num":5,"verse":"Raise not thine eyes to riches, which thou mayest not have; for those shall make to themselves pens, as of an eagle, and they shall fly into heaven. (Raise not up thine eyes to riches, which thou cannot hold onto; for they shall make wings for themselves, like an eagle, and they shall fly away into the heavens.)"},{"num":6,"verse":"Eat thou not with an envious man, and desire thou not his meats; (Do not thou eat with the envious, and do not thou desire his food;)"},{"num":7,"verse":"for at the likeness of a false diviner, and of a conjecturer, that is, (an) expounder of dreams, he guesseth that, that he knoweth not. He shall say to thee, Eat thou and drink; and his soul is not with thee (but his heart is not for thee/but his heart is not with thee)."},{"num":8,"verse":"Thou shalt spew out the meat, which thou hast eaten; and thou shalt lose thy fair words (and thy flattery shall have been wasted)."},{"num":9,"verse":"Speak thou not in the ears of unwise men (Speak thou not in the ears of the unwise); for they shall despise the teaching of thy speech."},{"num":10,"verse":"Touch thou not the terms, (or the boundary stones, of the property) of little children; and enter thou not into the field of fatherless and motherless children."},{"num":11,"verse":"For the neighbour of them is strong, and he shall deem their cause against thee. (For their Friend is strong, and he shall judge their case against thee.)"},{"num":12,"verse":"Thine heart enter to teaching, and thine ears to the words of knowing. (Let thy heart draw close to instruction, and thy ears to words of knowledge.)"},{"num":13,"verse":"Do not thou withdraw chastising, (or discipline,) from a child; for though thou smitest him with a rod, he shall not die."},{"num":14,"verse":"Thou shalt smite him with a rod, and thou shalt deliver his soul from hell. (Thou shalt strike him with a rod, and so thou shalt rescue his soul from Sheol, or from the land of the dead/from hell itself.)"},{"num":15,"verse":"My son, if thy soul is wise, mine heart shall have joy with thee; (My son, if thou be wise, my heart shall have joy over thee;)"},{"num":16,"verse":"and my reins shall make full out joy, when thy lips speak rightful thing(s)."},{"num":17,"verse":"(Let) Thine heart follow not sinners; but be thou in the dread of the Lord all day (but be thou in the fear of the Lord/with reverence for the Lord all day long)."},{"num":18,"verse":"For thou shalt have hope at the last, and thine abiding shall not be done away."},{"num":19,"verse":"My son, hear thou, and be wise, and (ad)dress thy soul in the way (and direct thy soul to the right way)."},{"num":20,"verse":"Do not thou be in the feasts of drinkers, neither in the oft eatings of them, that bring together fleshes to eat. (Do not thou be at the feasts of drinkers, nor at the oft eatings of those who bring much meat to eat.)"},{"num":21,"verse":"For men giving attention to drinks, and giving morsels together, shall be wasted, and napping shall be clothed with clothes rent. (For those giving attention to drinks, and giving morsels to each other, shall be wasted, or destroyed, and their napping shall eventually clothe them with torn clothes.)"},{"num":22,"verse":"Hear thy father, that begat thee (Listen to thy father, who begat thee); and despise not thy mother, when she is eld."},{"num":23,"verse":"Buy thou truth, and do not thou sell (off) wisdom, and doctrine, and understanding."},{"num":24,"verse":"The father of a just man joyeth full out with joy; he that begat a wise man, shall be glad in him. (The father of a righteous person rejoiceth with great joy; he who begat someone who is wise, shall take much pleasure, or pride, in him.)"},{"num":25,"verse":"Thy father and thy mother have joy, and he that begat thee, make full out joy. (So let thy father and thy mother have joy over thee, and let she who bare thee, rejoice.)"},{"num":26,"verse":"My son, give thine heart to me, and thine eyes keep my ways."},{"num":27,"verse":"For a whore is a deep ditch, and an alien woman, is a strait pit. (For a whore is a deep ditch, and a woman whom thou hath been intimate with, but who is not thy wife, is a narrow pit.)"},{"num":28,"verse":"She setteth ambush in the way, as a thief (She setteth ambush on the way, like a thief); and shall add despisers in men, that is, (she) shall multiply (the) despisers of God among men."},{"num":29,"verse":"To whom is woe? to whose father is woe? to whom be chidings? (to whom be arguments?) to whom be ditches? to whom be wounds without cause? to whom is putting out of eyes?"},{"num":30,"verse":"Whether not to them, that dwell in wine, and study to drink [up] all of (the) cups? (Whether not to those, who live in wine, and endeavour to drink up every last drop from the cup?)"},{"num":31,"verse":"Behold thou not [the] wine (Look thou not upon the wine), when it sparkleth, when the colour thereof shineth in a glass cup. It entereth sweetly,"},{"num":32,"verse":"but at the last it shall bite as an adder, and as a cockatrice it shall shed abroad venoms. (but in the end, it shall bite like a serpent, and it shall sting, with its venom, like a cockatrice.)"},{"num":33,"verse":"Thine eyes shall see strange, (or unknown,) women, and thy heart shall speak wayward things."},{"num":34,"verse":"And thou shalt be as a man sleeping in the midst of the sea, and as a governor asleeped, when the steer(ing), either the instrument of governance, is lost."},{"num":35,"verse":"And thou shalt say, They beat me, but I had not sorrow; they drew me, and I feeled not; when shall I wake out, and I shall find wines again? (when shall I wake up, and I can drink more wine again?)"}]