[{"header":"The Capture of the Covenant Box"},{"num":4,"verse":"At that time the Philistines gathered to go to war against Israel, so the Israelites set out to fight them. The Israelites set up their camp at Ebenezer and the Philistines at Aphek. "},{"num":2,"verse":"The Philistines attacked, and after fierce fighting they defeated the Israelites and killed about four thousand men on the battlefield. "},{"num":3,"verse":"When the survivors came back to camp, the leaders of Israel said, “Why did the Lord let the Philistines defeat us today? Let's go and bring the Lord's Covenant Box from Shiloh, so that he will go with us and save us from our enemies.” "},{"num":4,"verse":"So they sent messengers to Shiloh and got the Covenant Box of the Lord Almighty, who is enthroned above the winged creatures. And Eli's two sons, Hophni and Phinehas, came along with the Covenant Box."},{"num":5,"verse":"When the Covenant Box arrived, the Israelites gave such a loud shout of joy that the earth shook. "},{"num":6,"verse":"The Philistines heard the shouting and said, “Listen to all that shouting in the Hebrew camp! What does it mean?” When they found out that the Lord's Covenant Box had arrived in the Hebrew camp, "},{"num":7,"verse":"they were afraid, and said, “A god has come into their camp! We're lost! Nothing like this has ever happened to us before! "},{"num":8,"verse":"Who can save us from those powerful gods? They are the gods who slaughtered the Egyptians in the desert! "},{"num":9,"verse":"Be brave, Philistines! Fight like men, or we will become slaves to the Hebrews, just as they were our slaves. So fight like men!”"},{"num":10,"verse":"The Philistines fought hard and defeated the Israelites, who went running to their homes. There was a great slaughter: thirty thousand Israelite soldiers were killed. "},{"num":11,"verse":"God's Covenant Box was captured, and Eli's sons, Hophni and Phinehas, were both killed."},{"header":"The Death of Eli"},{"num":12,"verse":"A man from the tribe of Benjamin ran all the way from the battlefield to Shiloh and arrived there the same day. To show his grief, he had torn his clothes and put dirt on his head. "},{"num":13,"verse":"Eli, who was very worried about the Covenant Box, was sitting in his seat beside the road, staring. The man spread the news throughout the town, and everyone cried out in fear. "},{"num":14,"verse":"Eli heard the noise and asked, “What is all this noise about?” The man hurried to Eli to tell him the news. "},{"num":15,"verse":"(Eli was now ninety-eight years old and almost completely blind.) "},{"num":16,"verse":"The man said, “I have escaped from the battle and have run all the way here today.”"},{"num":17,"verse":"The messenger answered, “Israel ran away from the Philistines; it was a terrible defeat for us! Besides that, your sons Hophni and Phinehas were killed, and God's Covenant Box was captured!”"},{"num":18,"verse":"When the man mentioned the Covenant Box, Eli fell backward from his seat beside the gate. He was so old and fat that the fall broke his neck, and he died. He had been a leader in Israel for forty years."},{"header":"The Death of the Widow of Phinehas"},{"num":19,"verse":"Eli's daughter-in-law, the wife of Phinehas, was pregnant, and it was almost time for her baby to be born. When she heard that God's Covenant Box had been captured and that her father-in-law and her husband were dead, she suddenly went into labor and gave birth. "},{"num":20,"verse":"As she was dying, the women helping her said to her, “Be brave! You have a son!” But she paid no attention and did not answer. "},{"num":21,"verse":"She named the boy Ichabod, explaining, “God's glory has left Israel”—referring to the capture of the Covenant Box and the death of her father-in-law and her husband. "},{"num":22,"verse":"“God's glory has left Israel,” she said, “because God's Covenant Box has been captured.”"}]