[{"header":"Paul Answers Those Who Accuse Him"},{"num":1,"verse":"From Paul, an apostle of Christ Jesus. I am an apostle because that is what God wanted."},{"num":2,"verse":"Grace and peace to you from God our Father and the Lord Jesus Christ."},{"header":"Paul Gives Thanks to God"},{"num":3,"verse":"Praise be to the God and Father of our Lord Jesus Christ. God is the Father who is full of mercy. And he is the God of all comfort. "},{"num":4,"verse":"He comforts us every time we have trouble, so that we can comfort others when they have trouble. We can comfort them with the same comfort that God gives us. "},{"num":5,"verse":"We share in the many sufferings of Christ. In the same way, much comfort comes to us through Christ. "},{"num":6,"verse":"If we have troubles, it is for your comfort and salvation. If we have comfort, then you also have comfort. This helps you to accept patiently the same sufferings that we have. "},{"num":7,"verse":"Our hope for you is strong. We know that you share in our sufferings. So we know that you also share in the comfort we receive."},{"num":8,"verse":"Brothers, we want you to know about the trouble we suffered in the country of Asia. We had great burdens there that were greater than our own strength. We even gave up hope for life. "},{"num":9,"verse":"Truly, in our own hearts we believed that we would die. But this happened so that we would not trust in ourselves. It happened so that we would trust in God, who raises people from death. "},{"num":10,"verse":"God saved us from these great dangers of death. And he will continue to save us. We have put our hope in him, and he will save us again. "},{"num":11,"verse":"And you can help us with your prayers. Then many people will give thanks for us—that God blessed us because of their many prayers."},{"header":"The Change in Paul’s Plans"},{"num":12,"verse":"This is what we are proud of, and I can say with all my heart that it is true: In all the things we have done in the world, we have done everything with an honest and pure heart from God. And this is even more true in what we have done with you. We did this by God’s grace, not by the kind of wisdom the world has. "},{"num":13,"verse":"For we write to you only what you can read and understand. And I hope that "},{"num":14,"verse":"as you have understood some things about us, you may come to know everything about us. Then you can be proud of us, as we will be proud of you on the day our Lord Jesus Christ comes again."},{"num":15,"verse":"I was very sure of all this. That is why I made plans to visit you first. Then you could be blessed twice. "},{"num":16,"verse":"I planned to visit you on my way to Macedonia. Then I planned to visit you again on my way back. I wanted to get help from you for my trip to Judea. "},{"num":17,"verse":"Do you think that I made these plans without really thinking? Or maybe you think I make plans as the world does, so that I say “Yes, yes,” and at the same time “No, no.”"},{"num":18,"verse":"But since you can believe God, then you can believe that what we tell you is never both “Yes” and “No.” "},{"num":19,"verse":"The Son of God, Jesus Christ, that Silas and Timothy and I preached to you, was not “Yes” and “No.” In Christ it has always been “Yes.” "},{"num":20,"verse":"The “Yes” to all of God’s promises is in Christ. And that is why we say “Amen” through Christ to the glory of God. "},{"num":21,"verse":"And God is the One who makes you and us strong in Christ. God made us his chosen people. "},{"num":22,"verse":"He put his mark on us to show that we are his. And he put his Spirit in our hearts to be a guarantee for all he has promised."},{"num":23,"verse":"I tell you this, and I ask God to be my witness that this is true: The reason I did not come back to Corinth was that I did not want to punish or hurt you. "},{"num":24,"verse":"I do not mean that we are trying to control your faith. You are strong in faith. But we are workers with you for your own happiness."}]