[{"header":"The Death of King Saul and His Sons"},{"num":10,"verse":"Now the many Philistines fought against Israel. The men of Israel ran away from the Philistines, and were killed on Mount Gilboa. "},{"num":2,"verse":"The Philistines went after Saul and his sons. And they killed Jonathan, Abinadab and Malchi-shua, Saul’s sons. "},{"num":3,"verse":"The battle was hard for Saul. Those who fought with the bow found him, and hurt him with an arrow. "},{"num":4,"verse":"Then Saul said to the one who carried his battle-clothes, “Take your sword and kill me with it. Or these men who have not gone through our religious act will come and make fun of me.” But the one who carried his battle-clothes would not do it. For he was very afraid. So Saul took his sword and fell on it. "},{"num":5,"verse":"When the one who carried his battle-clothes saw that Saul was dead, he fell on his sword and died also. "},{"num":6,"verse":"So Saul died with his three sons. All those of his house died together."},{"num":7,"verse":"All the men of Israel who were in the valley saw that the army had run away and that Saul and his sons were dead. So they left their cities and ran away. Then the Philistines came and lived in their cities. "},{"num":8,"verse":"When the Philistines came the next day to take what had belonged to the dead, they found Saul and his sons dead on Mount Gilboa. "},{"num":9,"verse":"So they took his clothes, his head, and his battle-clothes. And they sent men around the land of the Philistines to take the good news to their false gods and to the people. "},{"num":10,"verse":"They put Saul’s battle-clothes in the house of their gods. And they put his head in the house of Dagon. "},{"num":11,"verse":"All the people of Jabesh-gilead heard what the Philistines had done to Saul. "},{"num":12,"verse":"So all the powerful soldiers went and took the bodies of Saul and his sons. They brought them to Jabesh and buried their bones under the oak tree there. Then they went without food for seven days."},{"num":13,"verse":"So Saul died for his sin against the Lord, because he did not keep the Word of the Lord. He had asked a woman who spoke with spirits what he should do. "},{"num":14,"verse":"He did not ask the Lord. So the Lord killed him, and gave the nation to David the son of Jesse."}]