[{"num":56,"verse":"The Lord saith these things, Keep ye doom, and do ye rightfulness, for why mine health is nigh, that it come, and my rightfulness, that it be showed. (The Lord saith these things, Do ye justly, and do ye righteously, for my deliverance, or my salvation, is near, so that it shall come, and my righteousness, so that it shall be shown.)"},{"num":2,"verse":"Blessed is the man, that doeth this, and the son of (a) man, that shall take (hold of) this; keeping the sabbath, that he defoul not it, keeping his hands, that he do not any evil. (Blessed is the person, who doeth this, and those who shall take hold of this; yea, keeping the sabbath, so that they do not defile it, and keeping their hands clean, so that they do not do any evil.)"},{"num":3,"verse":"And say not the son of a comeling, that cleaveth fast to the Lord, saying, By parting the Lord shall part me from his people; and a gelding, either a chaste man, say not, Lo! I am a dry tree. (And the son of a newcomer, or of a foreigner, who cleaveth firmly to the Lord, say not, By separating the Lord shall separate me from his people; and a eunuch, or a chaste man, say not, Lo! I am a dry tree.)"},{"num":4,"verse":"For the Lord saith these things to geldings, that keep my sabbaths, and choose what things I would, and hold (fast to) my bond of peace. (For the Lord saith these things to the eunuchs, who keep my sabbaths, and choose what things I would, and hold firm to my covenant.)"},{"num":5,"verse":"I shall give to them a place in mine house, and (with)in my walls, and the best name, (yea, better than that) of sons and daughters; I shall give to them a name everlasting, that shall not perish (I shall give them an everlasting name, that shall not perish)."},{"num":6,"verse":"And I shall bring in to bless the sons of a comeling, that cleave fast to the Lord, that they worship him, and love his name, that they be to him into servants; (to) each man keeping the sabbath, that he defoul it not, and holding (fast to) my bond of peace; (And also to the sons and daughters of the newcomers, or of the foreigners, who cleave firmly to the Lord, so that they worship him, and love his name, and so that they be his servants; to each person keeping the sabbath, so that they do not defile it, and holding firm to my covenant;)"},{"num":7,"verse":"I shall bring them into mine holy hill, and I shall make them glad in the house of my prayer; their burnt sacrifices and their slain sacrifices shall please me on mine altar; for why mine house shall be called an house of prayer to all peoples, (I shall bring them to my holy hill, and I shall make them happy in the House of my prayer; their burnt sacrifices and their slain sacrifices shall be acceptable on my altar; for my House shall be called a House of prayer for all peoples, or for all the nations,)"},{"num":8,"verse":"saith the Lord God, that gathereth together the scattered men of Israel. Yet I shall gather together to him all the gathered men thereof. (saith the Lord God, who gathereth together the scattered of Israel. And I shall bring still others to join them.)"},{"num":9,"verse":"All beasts of the field, come ye to devour, (and) all beasts of the forest."},{"num":10,"verse":"All the beholders thereof be blind, all they knew not; (they be) dumb dogs, that be not able to bark; seeing vain things, sleeping, and loving dreams; (All of its beholders be blind, all of them did not know; they be dumb dogs, that be not able to bark; seeing empty and futile things, sleeping, and loving dreams;)"},{"num":11,"verse":"and (they be) most unshamefast dogs (that) knew not fullness. Those shepherds knew not understanding; all they bowed into their (own) way, each man to his avarice, from the highest till to the last. (and they be the most shameless dogs who shall never know fullness. They be shepherds who understand nothing; they all be turned to their own way, each one to his own greed, from the highest unto the lowest.)"},{"num":12,"verse":"Come ye, take we wine, and be we filled of drunkenness; and it shall be as today, so and tomorrow, and much more. (And they say, Come ye, take we wine, and be we filled with drunkenness; and tomorrow shall be like today, and even more so.)"}]