[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Withdraw thine hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The instinct of the general, as we should expect from the character of Saul, soon got the better of his first desire for some Divine guidance. His watchful eye saw that the confusion in the Philistine camp was increasing; now was the moment for his little compact force to throw itself into the melée; so he at once bids Ahijah, the priest of the Lord, to put up the Urim and Thummim, and no longer to seek higher counsel, for the hour was come to fight rather than to pray. This has been the general interpretation of Saul’s action here. Wordsworth quotes Bishop Andrewes, saying, “There are some who with Saul will call for the Ark, and will presently cry ‘Away with it !’ that is, will begin their prayers, and break them off in the midst on every occasion.” And Bishop Hall: “Saul will consult the Ark; hypocrites, when they have leisure, will perhaps be holy. But when the tumult was aroused, Saul’s piety decreased. ‘Withdraw thine hand,’ he said; the Ark must give place to arms.’”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:16-23 The Philistines were, by the power of God, set against one another. The more evident it was that God did all, the more reason Saul had to inquire whether God would give him leave to do any thing. But he was in such haste to fight a fallen enemy, that he would not stay to end his devotions, nor hear what answer God would give him. He that believeth, will not make such haste, nor reckon any business so urgent, as not to allow time to take God with him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Withdraw thine hand - i. e., \"Desist from what thou art about.\" Saul in his impatience to join the battle would not wait for the answer from God, which he had desired Ahijah to inquire for; just as later ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 14:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he would not wait to finish the altar which he had begun to build. Had he now waited he would doubtless have avoided the error into which he fell. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Withdraw thine hand—The priest, invested with the ephod, prayed with raised and extended hands. Saul perceiving that the opportunity was inviting, and that God appeared to have sufficiently declared in favor of His people, requested the priest to cease, that they might immediately join in the contest. The season for consultation was past—the time for prompt action was come.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Trouble not thyself in putting on the breastplate, with the ephod, to inquire of God; for I now plainly discern the matter; the business calls not for prayer, but for action. But if it did so, there was the more need of God’s direction and blessing, that they might act with more success. Herein therefore he shows his impatience in waiting upon God; his hypocrisy, in pretending to religion; and yet his profaneness, in neglecting and despising it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass, while Saul talked with the priest,.... With Ahiah about bringing the ark, and inquiring before it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that the noise that was in the host of the Philistines went on, and increased; the shrieks and cries of those that were beat down and trampled upon, and were bruised and wounded; and indeed the cry of the whole host, being alarmed with the enemy being upon them, or among them; and it seems that not only their motions could be seen, but the noise of them heard at this distance: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Saul said unto the priest, withdraw thine hand; from putting on the ephod, or opening the breastplate of Urim and Thummim, or placing the ark in a proper position, to inquire before it, or from lifting up both hands in prayer for direction. Saul by the noise he heard concluded the army of the Philistines was routed, and therefore there was no need to consult the Lord, and he had no leisure for it; no time was to be lost, the advantage was to be taken directly, and the enemy pursued, to complete the victory. The Jews look upon this as a piece of profaneness in Saul, as no doubt it was, and reckon it one of the sins for which his kingdom was not prolonged (o). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Vajikra Rabba & Midrash Tillim apud Abarbinel in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) Vajikra Rabba & Midrash Tillim apud Abarbinel in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it came to pass, while Saul talked unto the priest, that the noise that was in the host of the Philistines went on and increased: and Saul said unto the priest, {i} Withdraw thine hand.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And it came to pass, while Saul talked unto the priest, that the noise that ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in the host of the Philistines went on and increased: and Saul said unto the priest, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Withdraw thine hand.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Leave the Ephod alone, for I have no time now to ask counsel from God, Nu 27:21.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Withdraw thine hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Desist from the inquiry. With characteristic impatience Saul would not wait for God’s answer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Withdraw thine hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Saul, impatient of delay, cannot wait till the will of God is made known to him. There would have been no real loss of time, and he might have been saved from the errors which marred the happiness of the deliverance. But this precipitancy very well shows the state of Saul's mind. 1 Samuel 14:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"It increased more and more;\" lit. increasing and becoming greater. The subject וגו וההמון is placed absolutely at the head, so that the verb ויּלך brev eh is appended in the form of an apodosis. ידך אסף, \"draw thy hand in\" (back); i.e., leave off now.",
        "children": []
      }
    ]
  }
]