[{"num":2,"verse":"1 Wisdom exhorteth to obey her. 5 She teacheth the fear of God. 6 She is given of God. 10 She preserveth from wickedness."},{"num":1,"verse":"My son, if thou wilt receive my words, and hide my commandments within thee,"},{"num":2,"verse":"And cause thine ears to hearken unto wisdom, and incline thine heart to understanding,"},{"num":3,"verse":"(For if thou callest after knowledge, and cryest for understanding:"},{"num":4,"verse":"If thou seekest her as silver, and searchest for her as for treasures,"},{"num":5,"verse":"Then shalt thou understand the fear of the Lord, and find the knowledge of God."},{"num":6,"verse":"For the Lord giveth wisdom, out of his mouth cometh knowledge and understanding."},{"num":7,"verse":"He preserveth the state of the righteous, he is a shield to them that walk uprightly,"},{"num":8,"verse":"That they may keep the ways of judgment: and he preserveth the way of his Saints)."},{"num":9,"verse":"Then shalt thou understand righteousness and judgment, and equity, and every good path."},{"num":10,"verse":"¶ When wisdom entereth into thine heart, and knowledge delighteth thy soul,"},{"num":11,"verse":"Then shall counsel preserve thee, and understanding shall keep thee,"},{"num":12,"verse":"And deliver thee from the evil way, and from the man that speaketh froward things,"},{"num":13,"verse":"And from them that leave the ways of righteousness to walk in the ways of darkness:"},{"num":14,"verse":"Which rejoice in doing evil, and delight in the frowardness of the wicked,"},{"num":15,"verse":"Whose ways are crooked, and they are lewd in their paths."},{"num":16,"verse":"And it shall deliver thee from the strange woman, even from the stranger which flattereth with her words."},{"num":17,"verse":"Which forsaketh the guide of her youth, and forgetteth the covenant of her God."},{"num":18,"verse":"Surely her house tendeth to death, and her paths unto the dead."},{"num":19,"verse":"All they that go unto her, return not again, neither take they hold of the ways of life."},{"num":20,"verse":"Therefore walk thou in the way of good men, and keep the ways of the righteous."},{"num":21,"verse":"For the just shall dwell in the land, and the upright men shall remain in it."},{"num":22,"verse":"But the wicked shall be cut off from the earth, and the transgressor shall be rooted out of it."}]