[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Why? Doth not the son bear?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It would be clearer to read this as a single question, “Why doth not the son, &c?",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "” ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is the question proposed by the people in objection to what has been declared. To them it seemed the law of nature, the necessity of the case, the teaching of history, that the son should bear the iniquity of his father. Their ideas had not risen to the conception of man’s individual responsibility to God; to them the individual was still but a part of the nation or the family. They ask, therefore, why this universal law should now be reversed. It was not true that any law was reversed, it was only that the superior prevailed over the inferior law; but, as usual in such cases, the Divine word does not reason with the human objection, but in this and the following verse only reiterates most emphatically the law of individual responsibility.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 18:19-20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:19-20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet say ye, Why? doth not the son bear the iniquity of the father? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God here puts into the prophet’s mouth what he knew the Jews would object (at least in their minds) to the foregoing declarations, namely, that they would deny what the prophet had said on this head, and would appeal to facts and experience that the son did ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bear the iniquity of the father; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "so that the sense of the first clause of the verse is, Why do you affirm this? does not experience show that the son bears the iniquity of the father? Is it not plain and undeniable, notwithstanding your fine discourse to the contrary? To be sure, we feel the truth of it in our own cases. To this cavil God makes answer in the following words, affirming that this was no otherwise so than when the son followed the example of his father’s iniquity; for that, when the son did that which was lawful and right, and kept God’s statutes, or lived a life of true piety and virtue, he should ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "surely live, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, should not be punished, or cut off, on account of the iniquity of his father. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The righteousness of the righteous shall be upon him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, the righteous shall receive the reward of his righteousness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the wickedness of the wicked shall be upon him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, the reward of his wickedness. As certainly as it shall be well with the righteous, because ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall eat the fruit of his doings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "so certainly shall woful punishment be executed upon the wicked who persist in their wickedness: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-20 The soul that sinneth it shall die. As to eternity, every man was, is, and will be dealt with, as his conduct shows him to have been under the old covenant of works, or the new covenant of grace. Whatever outward sufferings come upon men through the sins of others, they deserve for their own sins all they suffer; and the Lord overrules every event for the eternal good of believers. All souls are in the hand of the great Creator: he will deal with them in justice or mercy; nor will any perish for the sins of another, who is not in some sense worthy of death for his own. We all have sinned, and our souls must be lost, if God deal with us according to his holy law; but we are invited to come to Christ. If a man who had shown his faith by his works, had a wicked son, whose character and conduct were the reverse of his parent's, could it be expected he should escape the Divine vengeance on account of his father's piety? Surely not. And should a wicked man have a son who walked before God as righteous, this man would not perish for his father's sins. If the son was not free from evils in this life, still he should be partaker of salvation. The question here is not about the meritorious ground of justification, but about the Lord's dealings with the righteous and the wicked.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Why?... - Rather, \"Why doth not the son bear the iniquity of the father?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Here the Jews object to the prophet's word and in their objection seem to seek a continuance of that very thing which they had originally made a matter of complaint. Therefore translate, \"Wherefore doth not the son bear the iniquity of his father?\" It now would seem a consolation to them to think the son might suffer for his father's misdeeds; for it would soothe their self-love to regard themselves as innocent sufferers for the guilt of others and would justify them in their present course of life, which they did not choose to abandon for a better. In reply, Ezekiel reiterates the truth of each being dealt with according to his own merits [Fairbairn]. But Grotius supports English Version, wherein the Jews contradict the prophet, \"Why (sayest thou so) doth not the son (often, as in our case, though innocent) bear (that is, suffer for) the iniquity of their father?\" Ezekiel replies, It is not as you say, but as I in the name of God say: \"When the son hath done,\" &c. English Version is simpler than that of Fairbairn.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Notwithstanding this method of the Divine justice, which renders to every one his own work, and gives to every one the fruit of his own doings, ye, proud, quarrelling, self-justifying debauchees, idolaters, adulterers, murderers, usurers, oppressors, will not see your own sins, for which you are punished, but cry you are innocent, that your fathers sinned and you suffer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Doth not the son bear the iniquity of the father?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The prophet here brings in what he met with among them; still every where they insist on it that they deserved not by any sin of their own what they now suffered, and so would cast the sin and guilt on their fathers, and the rigour and severity on God, and clear themselves to all; which the prophet answers by a recapitulation of what he had more largely spoken, and avows it, that the righteous son of an unrighteous father shall live, and not die. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Kept all my statutes; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 119:44",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:44",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yet say ye, why?.... Why do you say so? why do you go on to assert that which is not fact, or which is contrary to fact, contrary to what we feel and experience every day, to say that children are not punished for their parents' sins? these are the words of the murmuring, complaining, and blaspheming Jews, quarrelling with the prophet, and with the Lord himself: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "doth not the son bear the iniquity of the father? have not we proof of it every day we live? are not our present case and circumstances a full evidence of it? or the words may be rendered, \"why does not the son bear the iniquity of the father?\" so the Septuagint, Vulgate Latin, and Arabic versions; or, as the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"why is not the son punished for the sins of the father?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and so they are an objection, which is foreseen might be made, and is here anticipated, to which an answer is returned; and so the Syriac version introduces it, \"but if they said\", &c. then adds, \"tell them\", as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when, or \"because\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the son hath done that which is lawful and right, and hath kept all my statutes, and hath done them: this is the reason why he shall not bear his father's sins, or be punished for them; intimating that they had not done these things that made the complaint, or put the, question; but had committed the same sins their fathers had, and so were punished, not for their fathers' sins, but their own: for otherwise the man that does what is just and right with God, and between man and man, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall surely live; See Gill on Ezekiel 18:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he shall surely live; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Yet say ye, Why? doth not the son bear the iniquity of the father? When the son hath done that which is lawful and right, and hath kept all my statutes, and hath done them, he shall surely live.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet say ye, Why?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and ye say, wherefore doth not the son bear …?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The prophet refers to the current view, and supposes it quoted as an objection to his principle. So long as the idea prevailed that the son was, so to speak, part of the father, it was natural to suppose that he should be included in the father’s punishment; hence the people ask, Why doth the son not bear, lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bear part of, share in bearing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 18:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), the iniquity of the father? In opposition to this idea the prophet states his principle on both its sides, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 18:19-20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:19-20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Secondly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 18:21-32",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:21-32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". As men shall not be involved in the sins of their people or their fathers, so the individual soul shall not lie under the ban of its own past.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The sinner who turneth from his evil and doeth righteousness shall live in his righteousness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 18:21-23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:21-23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And on the other hand, the righteous man who turneth away from his righteousness and doeth evil shall die in his evil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 18:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 18:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Why? doth not the son,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc.? The words are better taken, with the LXX., Vulgate, Revised Version, and most critics, as a single question, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Why doth not the son bear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.? What is the explanation of a fact which seemingly contradicts the teaching of the Law? The answer to the question seems at first only an iteration of what had been stated before. The son repents, and therefore does not bear his father's iniquity. A man is responsible for his own sins, and for those only. To think otherwise is to think of God as less righteous than man. Ezekiel 18:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The son who avoids his father's sin will live; but the father will die for his own sins. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And behold, he begetteth a son, who seeth all his father's sins which he doeth; he seeth them, and doeth not such things. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He eateth not upon the mountains, and lifteth not up his eyes to the idols of the house of Israel; he defileth not his neighbour's wife, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And oppresseth no one; he doth not withhold a pledge, and committeth not robbery; giveth his bread to the hungry, and covereth the naked with clothes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He holdeth back his hand from the distressed one, taketh not usury and interest, doeth my rights, walketh in my statutes; he will not die for the sin of his father; he shall live. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His father, because he hath practised oppression, committed robbery upon his brother, and hath done that which is not good in the midst of his people; behold, he shall die for his sin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And do ye say, Why doth the son not help to bear the father's sin? But the son hath done right and righteousness, hath kept all my statutes, and done them; he shall live. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The soul that sinneth, it shall die. A son shall not help to bear the father's sin, and a father shall not help to bear the sin of the son. The righteousness of the righteous shall be upon him, and the wickedness of the wicked shall be upon him. - The case supposed in these verses forms the antithesis to the preceding one; the father is the transgressor in this instance, and the son a keeper of the law. The subject to הוליד in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not the righteous man described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but a man who is described immediately afterwards as a transgressor of the commandments of God. The Chetib וירא bite in the last clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not to be read ויּרא, καὶ φοβηθῇ, et timuerit, as it has been by the translators of the Septuagint and Vulgate; nor is it to be altered into ויּראה, as it has been by the Masoretes, to make it accord with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but it is the apocopated form ויּרא, as in the preceding clause, and the object is to be repeated from what precedes, as in the similar case which we find in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (18). Ewald and Hitzig propose to alter מעני in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into מעול after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but without the slightest necessity. The lxx are not to be taken as an authority for this, since the Chaldee and Syriac have both read and rendered עני; and Ezekiel, when repeating the same sentences, is accustomed to make variations in particular words. Holding back the hand from the distressed, is equivalent to abstaining from seizing upon him for the purpose of crushing him (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); בּתוך, in the midst of his countrymen  equals  בּתוך עמּו, is adopted from the language of the Pentateuch. מת after הנּה is a participle. The question, \"Why does the son not help to bear?\" is not a direct objection on the part of the people, but is to be taken as a pretext, which the people might offer on the ground of the law, that God would visit the sin of the fathers upon the sons in justification of their proverb. Ezekiel cites this pretext for the purpose of meeting it by stating the reason why this does not occur. נשׂא ב, to carry, near or with, to join in carrying, or help to carry (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This proved the proverb to be false, and confirmed the assertion made in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to which the address therefore returns (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The righteousness of the righteous man will come upon him, i.e., upon the righteous man, namely, in its consequences. The righteous man will receive the blessing of righteousness, but the unrighteous man the curse of his wickedness. There is no necessity for the article, which the Keri proposes to insert before רשׁע. ",
        "children": []
      }
    ]
  }
]