[[],[{"type":"header","content":"Healing the Lame Beggar"},{"type":"prose","content":"Now Peter and John were going up to the temple at the hour of prayer, the ninth hour (3:00 p.m.), "}],[{"type":"prose","content":"and a man who had been unable to walk from birth was being carried along, whom they used to set down every day at that gate of the temple which is called Beautiful, so that he could beg alms from those entering the temple. "}],[{"type":"prose","content":"So when he saw Peter and John about to go into the temple, he  asking [them] for coins. "}],[{"type":"prose","content":"But Peter, along with John, stared at him intently and said, “Look at us!” "}],[{"type":"prose","content":"And the man  to pay attention to them, eagerly expecting to receive something from them. "}],[{"type":"prose","content":"But Peter said, “Silver and gold I do not have; but what I do have I give to you: In the name (authority, power) of Jesus Christ the Nazarene—[begin now to] walk  go on walking!” "}],[{"type":"prose","content":"Then he seized the man’s right hand with a firm grip and raised him up. And at once his feet and ankles became strong  steady, "}],[{"type":"prose","content":"and with a leap he stood up and  to walk; and he went into the temple with them, walking and leaping and praising God. "}],[{"type":"prose","content":"All the people saw him walking and praising God; "}],[{"type":"prose","content":"and they recognized him as the very man who usually sat  for coins at the Beautiful Gate of the temple, and they were filled with wonder and amazement  were mystified at what had happened to him."}],[{"type":"header","content":"Peter’s Second Sermon"},{"type":"prose","content":"Now while he was still holding on to Peter and John, all the people, utterly amazed, ran together  crowded around them at the covered porch called Solomon’s portico. "}],[{"type":"prose","content":"And Peter, seeing this, said to the people, “You men of Israel, why are you amazed at this? Why are you staring at us, as though by our own power or godliness we had made this man walk? "}],[{"type":"prose","content":"The God of Abraham, Isaac, and Jacob, the God of our fathers, has glorified His Servant  Son Jesus [doing Him this honor],  whom you handed over and disowned  rejected before Pilate, when he had decided to release Him. "}],[{"type":"prose","content":"But you disowned  denied the Holy and Righteous One and asked for [the pardon of] a murderer to be granted to you. "}],[{"type":"prose","content":"But you killed the Prince (Author, Originator, Source) of life, whom God raised [bodily] from the dead. To this [fact] we are witnesses [for we have seen the risen Christ]. "}],[{"type":"prose","content":"And on the basis of faith in His name, it is the name of Jesus which has strengthened this man whom you see and know; and the faith which  through Him has given him this perfect health  complete wholeness in your presence."}],[{"type":"prose","content":"“Now, brothers, I know that you acted in ignorance [not fully aware of what you were doing], just as your rulers did also. "}],[{"type":"prose","content":"And so God has fulfilled what He foretold by the mouth of all the prophets, that His Christ (Messiah, Anointed) would suffer. "}],[{"type":"prose","content":"So repent [change your inner self—your old way of thinking, regret past sins] and return [to God—seek His purpose for your life], so that your sins may be wiped away [blotted out, completely erased], so that times of refreshing may come from the presence of the Lord [restoring you like a cool wind on a hot day]; "}],[{"type":"prose","content":"and that He may send [to you] Jesus, the Christ, who has been appointed for you, "}],[{"type":"prose","content":"whom heaven must keep until the time for the [complete] restoration of all things about which God promised through the mouth of His holy prophets from ancient time. "}],[{"type":"prose","content":"Moses said, ‘THE LORD GOD WILL RAISE UP FOR YOU A PROPHET LIKE ME FROM YOUR COUNTRYMEN; YOU SHALL LISTEN TO HIM  OBEY everything He tells you. "}],[{"type":"prose","content":"And it will be that every person that does not listen to  heed that Prophet will be utterly destroyed from among the people.’ "}],[{"type":"prose","content":"Indeed, all the prophets who have spoken, from Samuel and those who came after him, also announced these days. "}],[{"type":"prose","content":"You are the sons (descendants) of the prophets and [heirs] of the covenant which God made with your fathers, saying to Abraham, ‘AND IN YOUR SEED (descendant) ALL THE FAMILIES OF THE EARTH SHALL BE BLESSED.’ "}],[{"type":"prose","content":" for you first  God raised up His Servant  Son [Jesus], and sent Him to bless you by turning every one  from your wicked ways.”"}]]