[{"header":"Peter Heals a Man Lame From Birth In The Name of Jesus Christ The Nazarene"},{"num":3,"verse":"Now Peter and John were going up to the temple at the hour of prayer, the ninth hour. "},{"num":2,"verse":"And a certain man being lame from his mother’s womb was being carried, whom they were putting daily at the gate of the temple being called “Beautiful”, that he might be asking-for alms from the ones coming into the temple— "},{"num":3,"verse":"who, having seen Peter and John being about to go into the temple, was asking to receive alms. "},{"num":4,"verse":"And Peter, along with John, having looked-intently at him, said, “Look at us!” "},{"num":5,"verse":"And the one was fixing-his-attention-on them, expecting to receive something from them. "},{"num":6,"verse":"And Peter said, “There is no silver and gold with me. But what I have, this I give to you— in the name of Jesus Christ the Nazarene, arise and walk”. "},{"num":7,"verse":"And having seized him by the right hand, he raised him. And at once his feet and ankles were made-strong. "},{"num":8,"verse":"And leaping-up, he stood and was walking-around. And he entered with them into the temple, walking and leaping and praising God. "},{"num":9,"verse":"And all the people saw him walking and praising God. "},{"num":10,"verse":"And they were recognizing him— that he was the one sitting for alms at the Beautiful Gate of the temple. And they were filled with wonder and astonishment at the thing having happened to him."},{"header":"A Crowd Comes Together, And Peter Speaks To Them:"},{"num":11,"verse":"And while he was holding-on-to Peter and John, all the people ran-together to them at the portico being called “Solomon’s”, struck-with-wonder. "},{"num":12,"verse":"And having seen it, Peter responded to the people—"},{"header":"God Raised Jesus, The One You Denied And Killed. And Jesus Healed This Man"},{"num":13,"verse":"The God of Abraham and the God of Isaac and the God of Jacob, the God of our fathers— He glorified His servant Jesus, Whom you indeed handed-over and denied in the presence of Pilate, that one having determined to release Him. "},{"num":14,"verse":"But you denied the Holy and Righteous One, and asked that a man who was a murderer be granted to you. "},{"num":15,"verse":"And you killed the Author of life, Whom God raised from the dead— of which we are witnesses. "},{"num":16,"verse":"And on-the-basis-of [our] faith in His name, His name made this one strong whom you see and know. And the faith that comes through Him gave him this wholeness in front of all of you."},{"header":"The Prophets Said The Christ Would Suffer, Which God Now Fulfilled. Therefore Repent"},{"num":17,"verse":"“And now, brothers, I know that you acted in-accordance-with ignorance, just as also your rulers. "},{"num":18,"verse":"But God fulfilled in this manner the things which He announced-beforehand through the mouth of all the prophets— that His Christ would suffer. "},{"num":19,"verse":"Therefore repent and turn-back so that your sins may be wiped-out, "},{"num":20,"verse":"so that times of refreshing may come from the presence of the Lord, and He may send-forth the Christ having been appointed for you— Jesus, "},{"num":21,"verse":"Whom it-is-necessary that heaven receive until the times of restoration of all things, of which God spoke through the mouth of His holy prophets from the past age."},{"header":"Moses And The Prophets Announced This Day. God Has Sent Jesus To You First"},{"num":22,"verse":"“Moses said [in Deut 18:15-19] that ‘The Lord your God will raise-up a prophet for you from your brothers like me. You shall listen-to Him in relation to all that He says to you. "},{"num":23,"verse":"And it will be that every soul who does not listen-to that prophet will be utterly-destroyed out of the people’. "},{"num":24,"verse":"And indeed all the prophets from Samuel and his successors who spoke also announced these days. "},{"num":25,"verse":"You are the sons of the prophets, and of the covenant which God covenanted with your fathers, saying to Abraham [in Gen 22:18], ‘And all the families of the earth will be blessed in your seed’. "},{"num":26,"verse":"God, having raised-up His Servant, sent Him forth to you first— blessing you in turning-away each of you from your evil-ways”."}]