[{"header":"A Crippled Man is Healed"},{"num":3,"verse":"One afternoon, Peter and John were on their way to the Temple for the three o’clock prayer time. "},{"num":2,"verse":"Now a man who had been crippled from birth was being carried in. Every day people would lay him at what was called the Beautiful Gate so that he could beg from those who were going into the Temple. "},{"num":3,"verse":"When he saw that Peter and John were about to go into the Temple, he asked them to give him something."},{"num":4,"verse":"Peter, along with John, looked him straight in the eye and said, “Look at us!” "},{"num":5,"verse":"So the man watched them closely, expecting to get something from them. "},{"num":6,"verse":"However, Peter said, “I don’t have any silver or gold, but I’ll give you what I do have. In the name of Jesus the Messiah from Nazareth, walk!” "},{"num":7,"verse":"Then Peter took hold of his right hand and began to help him up. Immediately his feet and ankles became strong, "},{"num":8,"verse":"and he sprang to his feet, stood up, and began to walk. Then he went with them into the Temple, walking, jumping, and praising God."},{"num":9,"verse":"When all the people saw him walking and praising God, "},{"num":10,"verse":"they knew that he was the man who used to sit and beg at the Beautiful Gate of the Temple, and they were filled with wonder and amazement at what had happened to him."},{"header":"Peter Speaks to the Onlookers"},{"num":11,"verse":"While he was holding on to Peter and John, all the people came running to them in what was called “Solomon’s Colonnade”. They were dumbfounded. "},{"num":12,"verse":"When Peter saw this, he told the people: “Fellow Israelis, why are you wondering about this, and why are you staring at us as if by our own power or godliness we made him walk? "},{"num":13,"verse":"The God of Abraham, Isaac, and Jacob—the God of our ancestors—has glorified his servant Jesus, whom you betrayed and rejected in the presence of Pilate, even though he had decided to let him go. "},{"num":14,"verse":"You rejected the Holy and Righteous One and asked to have a murderer released to you, "},{"num":15,"verse":"and you killed the source of life, whom God raised from the dead. We are witnesses to that. "},{"num":16,"verse":"It is his name—that is, by faith in his name—that has healed this man whom you see and know. Yes, the faith that comes through Jesus has given him this perfect health in the presence of all of you."},{"num":17,"verse":"“And now, brothers, I know that you acted in ignorance like your leaders. "},{"num":18,"verse":"This is how God fulfilled what he had predicted through the voice of all the prophets—that his Messiah would suffer. "},{"num":19,"verse":"Therefore, repent and turn to him to have your sins blotted out, "},{"num":20,"verse":"so that times of refreshing may come from the presence of the Lord and so that he may send you Jesus, whom he appointed long ago to be the Messiah. "},{"num":21,"verse":"He must remain in heaven until the time of universal restitution, which God announced long ago through the voice of his holy prophets. "},{"num":22,"verse":"In fact, Moses said,"},{"num":23,"verse":"Any person who will not listen to that prophet will be utterly destroyed from among the people.’"},{"num":24,"verse":"“Indeed, all the prophets who have spoken, from Samuel and those who followed him, also announced these days. "},{"num":25,"verse":"You are the descendants of the prophets and the heirs of the covenant that God made with your ancestors when he told Abraham, ‘Through your descendant all the families of the earth will be blessed.’ "},{"num":26,"verse":"When God raised up his servant, he sent him first to you to bless you by turning every one of you from your evil ways.”"}]