[{"num":3,"verse":"One day at three o'clock, Peter and John went to the temple to talk with God."},{"num":2,"verse":"There was a man who had been born lame. He was carried and was laid at the gate of the temple every day. The gate was called Beautiful. He was brought there to beg. He asked for money from the people who went into the temple."},{"num":3,"verse":"This man saw Peter and John ready to go into the temple. He begged them to give him something."},{"num":4,"verse":"Peter and John looked at him. Peter said, `Look at us.'"},{"num":5,"verse":"The man looked at them. He thought they would give him something."},{"num":6,"verse":"Then Peter said, `I have no money. But I will give you what I have. In the name of Jesus Christ of Nazareth, get up and walk!'"},{"num":7,"verse":"He took the man's right hand and raised him up. Right away his feet and ankles became strong."},{"num":8,"verse":"He jumped to his feet and walked into the temple with them. He was so happy he jumped around and praised God."},{"num":9,"verse":"All the people saw him walking and praising God."},{"num":10,"verse":"And they knew that this was the man who sat begging at the temple gate which was called Beautiful. They were very much surprised at what had happened to him. They could hardly believe it."},{"num":11,"verse":"While the man still held on to Peter and John, all the people came running to them. It was in the part of the temple which is called Solomon's porch. They were still very excited."},{"num":12,"verse":"When Peter saw this, he talked to the people. He said, `Men of Israel, why are you so surprised at this? Do you think that we have power or are good enough to make this man walk? Why do you look at us that way?"},{"num":13,"verse":"The God of Abraham, Isaac, Jacob, and of our fathers, has made his Son Jesus great. You gave him up to Pilate. You did not want to believe who he was. You did not want him back when Pilate agreed to let him go free."},{"num":14,"verse":"You would not receive the one who was holy and good. You asked for a bad man, who killed people, to be given to you."},{"num":15,"verse":"You killed the one who gives life, the one whom God brought back from death. We saw it and are telling people about it."},{"num":16,"verse":"This man whom you see and know, believed in the name of Jesus Christ. This man's faith in that name has healed him. Yes, believing in Jesus Christ has made him well here in front of you all."},{"num":17,"verse":"`My brothers, I know that you and your rulers killed Jesus because you did not understand what you were doing."},{"num":18,"verse":"But in this way God did what he had told us would happen. Through all the prophets he had told us that Christ would suffer."},{"num":19,"verse":"`Stop doing wrong things. Turn to God again. Then the wrong things you have done will be wiped away altogether. The Lord will give you a new start and make you very glad."},{"num":20,"verse":"He will send you Jesus. He was the one God chose to be the Christ."},{"num":21,"verse":"But he must wait in heaven until the time when all things will be made new again as they were at first. By his holy prophets God spoke of all this from the beginning."},{"num":22,"verse":"Moses himself said, \"The Lord God will raise up for you a Prophet like me. He will be one of your brothers. You must listen to everything that the Prophet says to you."},{"num":23,"verse":"And everyone who does not obey that Prophet will be cut off from his people altogether.\""},{"num":24,"verse":"`Prophets spoke at the time of Samuel, and prophets spoke after that time. They all have told about these days also."},{"num":25,"verse":"You are the people who have received what the prophets promised. And you have received the agreement which God made with your fathers. He said to Abraham, \"Through your children all the nations of the earth will receive blessing.\""},{"num":26,"verse":"God raised up and sent his Son to you first to bless you. He blesses you when each one of you stops doing wrong things.'"}]