[{"num":1,"verse":"Simon Peter, bondman and apostle of Jesus Christ, to them that have received like precious faith with us through [the] righteousness of our God and Saviour Jesus Christ:"},{"num":2,"verse":"Grace and peace be multiplied to you in [the] knowledge of God and of Jesus our Lord."},{"num":3,"verse":"As his divine power has given to us all things which relate to life and godliness, through the knowledge of him that has called us by glory and virtue,"},{"num":4,"verse":"through which he has given to us the greatest and precious promises, that through these ye may become partakers of [the] divine nature, having escaped the corruption that is in the world through lust."},{"num":5,"verse":"But for this very reason also, using therewith all diligence, in your faith have also virtue, in virtue knowledge,"},{"num":6,"verse":"in knowledge temperance, in temperance endurance, in endurance godliness,"},{"num":7,"verse":"in godliness brotherly love, in brotherly love love:"},{"num":8,"verse":"for these things existing and abounding in you make [you] to be neither idle nor unfruitful as regards the knowledge of our Lord Jesus Christ;"},{"num":9,"verse":"for he with whom these things are not present is blind, short-sighted, and has forgotten the purging of his former sins."},{"num":10,"verse":"Wherefore the rather, brethren, use diligence to make your calling and election sure, for doing these things ye will never fall;"},{"num":11,"verse":"for thus shall the entrance into the everlasting kingdom of our Lord and Saviour Jesus Christ be richly furnished unto you."},{"num":12,"verse":"Wherefore I will be careful to put you always in mind of these things, although knowing [them] and established in the present truth."},{"num":13,"verse":"But I account it right, as long as I am in this tabernacle, to stir you up by putting [you] in remembrance,"},{"num":14,"verse":"knowing that the putting off of my tabernacle is speedily [to take place], as also our Lord Jesus Christ has manifested to me;"},{"num":15,"verse":"but I will use diligence, that after my departure ye should have also, at any time, [in your power] to call to mind these things."},{"num":16,"verse":"For we have not made known to you the power and coming of our Lord Jesus Christ, following cleverly imagined fables, but having been eyewitnesses of *his* majesty."},{"num":17,"verse":"For he received from God [the] Father honour and glory, such a voice being uttered to him by the excellent glory: This is my beloved Son, in whom *I* have found my delight;"},{"num":18,"verse":"and this voice *we* heard uttered from heaven, being with him on the holy mountain."},{"num":19,"verse":"And we have the prophetic word [made] surer, to which ye do well taking heed (as to a lamp shining in an obscure place) until [the] day dawn and [the] morning star arise in your hearts;"},{"num":20,"verse":"knowing this first, that [the scope of] no prophecy of scripture is had from its own particular interpretation,"},{"num":21,"verse":"for prophecy was not ever uttered by [the] will of man, but holy men of God spake under the power of [the] Holy Spirit."}]