[{"header":"Salutation"},{"num":1,"verse":"Simon Peter, a servant and apostle of Jesus Christ,"},{"num":2,"verse":"Grace and peace be multiplied to you through the knowledge of God and of Jesus our Lord."},{"header":"The Christian’s Call and Election"},{"num":3,"verse":"His divine power has given to us all things that pertain to life and godliness through the knowledge of Him who has called us by His own glory and excellence, "},{"num":4,"verse":"by which He has given to us exceedingly great and precious promises, so that through these things you might become partakers of the divine nature and escape the corruption that is in the world through lust."},{"num":5,"verse":"For this reason make every effort to add virtue to your faith; and to your virtue, knowledge; "},{"num":6,"verse":"and to your knowledge, self-control; and to your self-control, patient endurance; and to your patient endurance, godliness; "},{"num":7,"verse":"and to your godliness, brotherly kindness; and to your brotherly kindness, love. "},{"num":8,"verse":"For if these things reside in you and abound, they ensure that you will neither be useless nor unfruitful in the knowledge of our Lord Jesus Christ. "},{"num":9,"verse":"But the one who lacks these things is blind and shortsighted because he has forgotten that he was cleansed from his former sins."},{"num":10,"verse":"Therefore, brothers, diligently make your calling and election sure. For if you do these things, you will never stumble. "},{"num":11,"verse":"For in this way the entrance into the eternal kingdom of our Lord and Savior Jesus Christ will be abundantly provided for you."},{"num":12,"verse":"Therefore I will not be negligent to always remind you of these things, though you know them and are established in the truth that is present with you. "},{"num":13,"verse":"I consider it right, as long as I live in this body, to stir you up by reminding you, "},{"num":14,"verse":"knowing that soon I will take off this body, even as our Lord Jesus Christ has shown me. "},{"num":15,"verse":"And I will also be diligent to make sure that after my death you will always remember these things."},{"header":"Christ’s Glory and the Prophetic Word"},{"num":16,"verse":"For we have not followed cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we were eyewitnesses of His majesty. "},{"num":17,"verse":"For He received honor and glory from God the Father when a voice came to Him from the majestic glory, saying, “This is My beloved Son, in whom I am well pleased.” "},{"num":18,"verse":"And we ourselves heard this voice, which came from heaven, when we were with Him on the holy mountain."},{"num":19,"verse":"And we have a more reliable word of prophecy, which you would do well to follow, as to a light that shines in a dark place, until the day dawns and the morning star arises in your hearts. "},{"num":20,"verse":"But know this first of all, that no prophecy of the Scripture is a matter of one’s own interpretation. "},{"num":21,"verse":"For no prophecy at any time was produced by the will of man, but holy men moved by the Holy Spirit spoke from God."}]