[{"header":"Chapter 1"},{"num":1,"verse":"Greeting. Symeon Peter, a slave and apostle of Jesus Christ, to those who have received a faith of equal value to ours through the righteousness of our God and savior Jesus Christ: "},{"num":2,"verse":"may grace and peace be yours in abundance through knowledge of God and of Jesus our Lord."},{"num":3,"verse":"His divine power has bestowed on us everything that makes for life and devotion, through the knowledge of him who called us by his own glory and power. "},{"num":4,"verse":"Through these, he has bestowed on us the precious and very great promises, so that through them you may come to share in the divine nature, after escaping from the corruption that is in the world because of evil desire. "},{"num":5,"verse":"For this very reason, make every effort to supplement your faith with virtue, virtue with knowledge, "},{"num":6,"verse":"knowledge with self-control, self-control with endurance, endurance with devotion, "},{"num":7,"verse":"devotion with mutual affection, mutual affection with love. "},{"num":8,"verse":"If these are yours and increase in abundance, they will keep you from being idle or unfruitful in the knowledge of our Lord Jesus Christ. "},{"num":9,"verse":"Anyone who lacks them is blind and shortsighted, forgetful of the cleansing of his past sins. "},{"num":10,"verse":"Therefore, brothers, be all the more eager to make your call and election firm, for, in doing so, you will never stumble. "},{"num":11,"verse":"For, in this way, entry into the eternal kingdom of our Lord and savior Jesus Christ will be richly provided for you."},{"num":12,"verse":"Apostolic Witness. Therefore, I will always remind you of these things, even though you already know them and are established in the truth you have. "},{"num":13,"verse":"I think it right, as long as I am in this “tent,” to stir you up by a reminder, "},{"num":14,"verse":"since I know that I will soon have to put it aside, as indeed our Lord Jesus Christ has shown me. "},{"num":15,"verse":"I shall also make every effort to enable you always to remember these things after my departure."},{"num":16,"verse":"We did not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we had been eyewitnesses of his majesty. "},{"num":17,"verse":"For he received honor and glory from God the Father when that unique declaration came to him from the majestic glory, “This is my Son, my beloved, with whom I am well pleased.” "},{"num":18,"verse":"We ourselves heard this voice come from heaven while we were with him on the holy mountain. "},{"num":19,"verse":"Moreover, we possess the prophetic message that is altogether reliable. You will do well to be attentive to it, as to a lamp shining in a dark place, until day dawns and the morning star rises in your hearts. "},{"num":20,"verse":"Know this first of all, that there is no prophecy of scripture that is a matter of personal interpretation, "},{"num":21,"verse":"for no prophecy ever came through human will; but rather human beings moved by the holy Spirit spoke under the influence of God."}]