[{"num":1,"verse":"Simon Peter, a servant and an Apostle of Jesus Christ, to you who have obtained equal precious faith with us, by the righteousness of our God and Savior Jesus Christ:"},{"num":2,"verse":"Grace and peace be multiplied to you, through the acknowledging of God, and of Jesus Christ our Lord."},{"num":3,"verse":"His divine power has given us all things pertaining to life and godliness, through the acknowledging of Him Who has called us to glory and virtue;"},{"num":4,"verse":"by which most great and precious promises are given to us, so that by them you could be partakers of the divine nature (in that you flee the corruption which is in the world through lust)."},{"num":5,"verse":"Therefore, give all diligence to this. Moreover, join virtue with your faith; and with virtue, knowledge;"},{"num":6,"verse":"and with knowledge, temperance; and with temperance, patience; and with patience, godliness;"},{"num":7,"verse":"and with godliness, brotherly kindness; and with brotherly kindness, love."},{"num":8,"verse":"For if these things are among you, and abound, they will cause you to be neither idle nor unfruitful in the acknowledging of our Lord Jesus Christ."},{"num":9,"verse":"For the one who does not have these things is blind and short-sighted and has forgotten that he was purged from his old sins."},{"num":10,"verse":"Therefore, brothers, give all the more diligence to making your calling and election sure. For if you do these things, you shall never fall."},{"num":11,"verse":"For by this means shall entry into the everlasting Kingdom of our Lord and Savior Jesus Christ be abundantly provided to you."},{"num":12,"verse":"Therefore, I will not be negligent to always remind you of these things (though you have knowledge and are established in the present truth)."},{"num":13,"verse":"For I think it right (as long as I am in this body) to stir you up by reminding you."},{"num":14,"verse":"I know that the time is at hand that I must lay down this, my body, just as our Lord Jesus Christ has shown me."},{"num":15,"verse":"Therefore, I will always endeavor, so that you also may be reminded of these things after my departing."},{"num":16,"verse":"For we did not follow cunningly-devised fables when we opened to you the power and coming of our Lord Jesus Christ. But we saw His majesty with our own eyes."},{"num":17,"verse":"For He received honor and glory from God the Father when there came such a voice to Him from that excellent Glory: “This is my beloved Son, in Whom I am well pleased.”"},{"num":18,"verse":"And this voice we heard when it came from Heaven, being with Him on the holy mount."},{"num":19,"verse":"We also have the enduring word of the Prophets - to which you do well to pay attention, as to a light that shines in a dark place - until the day dawns and the day star arise in your hearts."},{"num":20,"verse":"So that you first know this: that no prophecy of the Scripture is of any private interpretation."},{"num":21,"verse":"For the prophecy did not come by the will of man. But holy men of God spoke as they were moved by the Holy Ghost."}]