[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the key of the house of David will I lay upon his shoulder . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The key of the king’s treasure-chambers and of the gates of the palace was the natural symbol of the chamberlain’s or vizier’s office, and, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it was solemnly laid upon the shoulder of the new official, perhaps as representing the burden of the responsibilities of the duties of his office. In the “keys of the kingdom of heaven,” in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as also in the custom of admitting a Rabbi to his office by giving him a key, we have a reproduction of the same emblem.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So he shall open, and none shall shut . . .—The words paint vividly the supremacy of the office to which Eliakim was to be called. He alone was to decide who was to be admitted into the king’s chamber, and for whom the king’s treasury was to be opened. In Revelation 3:7, the symbolism is reproduced in its higher application to the King of kings.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "So he shall open, and none shall shut . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The words paint vividly the supremacy of the office to which Eliakim was to be called. He alone was to decide who was to be admitted into the king’s chamber, and for whom the king’s treasury was to be opened. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the symbolism is reproduced in its higher application to the King of kings.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:15-25 This message to Shebna is a reproof of his pride, vanity, and security; what vanity is all earthly grandeur, which death will so soon end! What will it avail, whether we are laid in a magnificent tomb, or covered with the green sod? Those who, when in power, turn and toss others, will be justly turned and tossed themselves. Eliakim should be put into Shebna's place. Those called to places of trust and power, should seek to God for grace to enable them to do their duty. Eliakim's advancement is described. Our Lord Jesus describes his own power as Mediator, Re 3:7, that he has the key of David. His power in the kingdom of heaven, and in ordering all the affairs of that kingdom, is absolute. Rulers should be fathers to those under their government; and the honour men bring unto their families, by their piety and usefulness, is more to be valued than what they derive from them by their names and titles. The glory of this world gives a man no real worth or excellence; it is but hung upon him, and it will soon drop from him. Eliakim was compared to a nail in a sure place; all his family are said to depend upon him. In eastern houses, rows of large spikes were built up in the walls. Upon these the moveables and utensils were hung. Our Lord Jesus is as a nail in a sure place. That soul cannot perish, nor that concern fall to the ground, which is by faith hung upon Christ. He will set before the believer an open door, which no man can shut, and bring both body and soul to eternal glory. But those who neglect so great salvation will find, that when he shutteth none can open, whether it be shutting out from heaven, or shutting up in hell for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the key - A key is that by which a house is locked or opened. To possess that is, therefore, to have free access to it, or control over it. Thus we give possession of a house by giving the \"key\" into the hands of a purchaser, implying that it is his; that he has free access to it; that he can close it when he pleases, and that no other one, without his permission, has the right of access to it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of the house of David - Of the house which David built for his royal residence; that is, of the palace. This house was on Mount Zion; and to have the key of that house was to have the chief authority at court, or to be prime minister (see the note at Isaiah 22:15). To be put in possession of that key, therefore, was the mark of office, or was a sign that he was entrusted with the chief authority in the government.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of the house of David - Of the house which David built for his royal residence; that is, of the palace. This house was on Mount Zion; and to have the key of that house was to have the chief authority at court, or to be prime minister (see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). To be put in possession of that key, therefore, was the mark of office, or was a sign that he was entrusted with the chief authority in the government.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Will I lay upon his shoulder - (see Isaiah 9:6). This seems to have been designed as an emblem of office. But in what way it was done is unknown. Lowth supposes that the key was of considerable magnitude, and was made crooked, and that thus it would lie readily on the shoulder. He has observed also, that this was a well-known badge or emblem of office. Thus the priestess of Ceres is described as having a key on the shoulder (Callim. \"Ceres,\" ver. 45); and thus in AEschyl. \"Supp.\" 299, a female high in office is described as having a key. But it is not known in what way the key was borne. It may have been borne on the shoulder, being so made as to be easily carried there; or it may have been attached to the shoulder by a belt or strap, as a sword is; or it may have been a mere emblem or figure fashioned into the robe, and worn as a sign of office; or the figure of a key may have been worn on the shoulder as an epaulet is now, as a sign of office and authority. If the locks were made of wood, as we have reason to suppose, then the key was probably large, and would answer well for a sign of office. 'How much was I delighted when I first saw the people, especially the Moors, going along the streets with each his key on his shoulder. The handle is generally made of brass (though sometimes of silver), and is often nicely worked in a device of filigrane. The way it is carried is to have the corner of a kerchief tied to the ring; the key is then placed on the shoulder, and the kerchief hangs down in front. At other times they have a bunch of large keys, and then they have half on one side of the shoulder, and half on the other. For a man thus to march along with a large key on his shoulder, shows at once that he is a person of consequence. \"Raman is in great favor with the Modeliar, for he now carries the key.\" \"Whose key have you got on your shoulder?\" \"I shall carry my key on my own shoulder.\"' - (Roberts)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Will I lay upon his shoulder - (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This seems to have been designed as an emblem of office. But in what way it was done is unknown. Lowth supposes that the key was of considerable magnitude, and was made crooked, and that thus it would lie readily on the shoulder. He has observed also, that this was a well-known badge or emblem of office. Thus the priestess of Ceres is described as having a key on the shoulder (Callim. \"Ceres,\" ver. 45); and thus in AEschyl. \"Supp.\" 299, a female high in office is described as having a key. But it is not known in what way the key was borne. It may have been borne on the shoulder, being so made as to be easily carried there; or it may have been attached to the shoulder by a belt or strap, as a sword is; or it may have been a mere emblem or figure fashioned into the robe, and worn as a sign of office; or the figure of a key may have been worn on the shoulder as an epaulet is now, as a sign of office and authority. If the locks were made of wood, as we have reason to suppose, then the key was probably large, and would answer well for a sign of office. 'How much was I delighted when I first saw the people, especially the Moors, going along the streets with each his key on his shoulder. The handle is generally made of brass (though sometimes of silver), and is often nicely worked in a device of filigrane. The way it is carried is to have the corner of a kerchief tied to the ring; the key is then placed on the shoulder, and the kerchief hangs down in front. At other times they have a bunch of large keys, and then they have half on one side of the shoulder, and half on the other. For a man thus to march along with a large key on his shoulder, shows at once that he is a person of consequence. \"Raman is in great favor with the Modeliar, for he now carries the key.\" \"Whose key have you got on your shoulder?\" \"I shall carry my key on my own shoulder.\"' - (Roberts)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "So he shall open ... - This phrase means, that he should have the highest authority in the government, and is a promise of unlimited power. Our Saviour has made use of the same expression to denote the unlimited power conferred on his apostles in his church Matthew 16:19; and has applied it also to himself in Revelation 3:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So he shall open ... - This phrase means, that he should have the highest authority in the government, and is a promise of unlimited power. Our Saviour has made use of the same expression to denote the unlimited power conferred on his apostles in his church ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 16:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and has applied it also to himself in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22. key—emblem of his office over the house; to \"open\" or \"shut\"; access rested with him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "upon … shoulder—So keys are carried sometimes in the East, hanging from the kerchief on the shoulder. But the phrase is rather figurative for sustaining the government on one's shoulders. Eliakim, as his name implies, is here plainly a type of the God-man Christ, the son of \"David,\" of whom Isaiah (Isa 9:6) uses the same language as the former clause of this verse. In Re 3:7, the same language as the latter clause is found (compare Job 12:14).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The key; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the government, the power of opening and shutting, of letting men into it or putting them out of it, whereof ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a key",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a fit emblem; whence the delivering of the keys of a house or city into the hands of another, is a sign to signify and confirm the giving him the power and possession of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lay upon his shoulder; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he mentions the shoulder rather than the hand, in which keys are commonly carried, either from some ceremony then in use, of carrying a key upon the shoulder, either of the officer of state himself, or of another in his name and stead; or to signify that this was a key of greater weight than ordinary, and that government, which is designed by this key, is a heavy burden, and therefore in Scripture phrase said to be upon the shoulder, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 9:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "None shall shut",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " against his will, or without his commission or consent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the key of the house of David will I lay upon his shoulder,.... In allusion either to magistrates carrying a key on their shoulder, hanging down from thence, having a hook at one end of it fit for that purpose; or having one embroidered on that part of their garment: or one carried before them by their servants. It regards either the keys of the temple; or rather the key of the king's house, which it was proper should be delivered to him as treasurer and steward of it; the Targum takes in both, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and I will give the key of the house of the sanctuary, and the government of the house of David, into his hand.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the mystical sense, Christ is said to have this key, Revelation 3:7 where the following words are applied to him: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the mystical sense, Christ is said to have this key, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " where the following words are applied to him: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "so he shall open, and none shall shut; and he shall shut, and none shall open; all which is expressive of the government of the church being on his shoulders, and of his absolute and uncontrollable power over it; who opens the treasures of his word, of his grace, and of wisdom and knowledge, and communicates them unto, and shuts or hides them from, whom he pleases; who opens and shuts the doors of his church, his house, and lets in, and keeps out, whom he thinks fit; and who also opens and shuts the door of the kingdom of heaven, and introduces into it his own people, and excludes others. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so he shall open, and none shall shut; and he shall shut, and none shall open; all which is expressive of the government of the church being on his shoulders, and of his absolute and uncontrollable power over it; who opens the treasures of his word, of his grace, and of wisdom and knowledge, and communicates them unto, and shuts or hides them from, whom he pleases; who opens and shuts the doors of his church, his house, and lets in, and keeps out, whom he thinks fit; and who also opens and shuts the door of the kingdom of heaven, and introduces into it his own people, and excludes others. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the {x} key of the house of David will I lay upon his shoulder; so he shall open, and none shall shut; and he shall shut, and none shall open.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{x}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " key of the house of David will I lay upon his shoulder; so he shall open, and none shall shut; and he shall shut, and none shall open.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) I will commit to him the full charge and government of the king's house.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the key of the house of David",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The symbol of unlimited authority over the royal household, carrying with it a similar influence in all affairs of state; like Pharaoh’s signet-ring in the hands of Joseph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:40-44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon his shoulder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and with the whole verse comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The key of the house of David will I lay upon his shoulder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A key would seem to have been the special badge of the prefect's office, which included the control of the stores (ver. 15), and the general management of the household. It was, perhaps, a part of the form of investiture, that the key should be first laid on the prefect's shoulder and then delivered into his hand. Among the Greeks the priests of Ceres are said to have borne a key on their shoulder, permanently, as a badge of office (Callimach., 'Hymn. ad Cererem,' 1. 45). The reference to this passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is sufficient to show that Eliakim, the \"servant of Jehovah\" (ver. 20), is, to a certain extent, a type of Christ; perhaps also of his faithful ministers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Isaiah 22:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jehovah first of all gives him the blow which makes him tremble in his post, and then pulls him completely down from this his lofty station,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: וּממּעמדך has not only the metheg required by the kametz on account of the long vowel, and the metheg required by the patach on account of the following chateph patach (the latter of which also takes the place of the metheg, as the sign of a subordinate tone), but also a third metheg with the chirek, which only assists the emphatic pronunciation of the preposition, out which would not stand there at all unless the word had had a disjunctive accent (compare Isaiah 55:9; Psalm 18:45; Hosea 11:6).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: וּממּעמדך has not only the metheg required by the kametz on account of the long vowel, and the metheg required by the patach on account of the following chateph patach (the latter of which also takes the place of the metheg, as the sign of a subordinate tone), but also a third metheg with the chirek, which only assists the emphatic pronunciation of the preposition, out which would not stand there at all unless the word had had a disjunctive accent (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "in order that another worthier man may take his place. \"And it will come to pass in that day, that I call to my servant Eliakim the son of Hilkiah, and invest him with thy coat, and I throw thy sash firmly round him, and place they government in his hand; and he will become a father to the inhabitants of Jerusalem and to the house of Judah. And I place the key of David upon his shoulder: and when he opens, no man shuts; and when he shuts, no man opens. And I fasten him as a plug in a fast place, and he becomes the seat of honour to his father's house. And the whole mass of his father's house hangs upon him, the offshoots and side-shoots, every small vessel, from the vessel of the basins even to every vessel of the pitchers.\" Eliakim is called the \"servant of Jehovah,\" as one who was already a servant of God in his heart and conduct; the official service is added for the first time here. This title of honour generally embraces both kinds of service (Isaiah 20:3). It is quite in accordance with oriental custom, that this transfer of the office is effected by means of investiture (compare 1 Kings 19:19): chizzēk, with a double accusative, viz., that of the person and that of the official girdle, is used here according to its radical signification, in the sense of girding tightly or girding round, putting the girdle round him so as to cause the whole dress to sit firmly, without hanging loose. The word memshaltekâ (thy government) shows how very closely the office forfeited by Shebna was connected with that of the king. This is also proved by the word \"father,\" which is applied in other cases to the king as the father of the land (Isaiah 9:5). The \"key\" signifies the power of the keys; and for this reason it is not given into Eliakim's hand, but placed upon his shoulder (Isaiah 9:5). This key was properly handled by the king (Revelation 3:7), and therefore by the \"house-mayor\" only in his stead. The power of the keys consisted not only in the supervision of the royal chambers, but also in the decision who was and who was not to be received into the king's service. There is a resemblance, therefore, to the giving of the keys of the kingdom of heaven to Peter under the New Testament. But there the \"binding\" and \"loosing\" introduce another figure, though one similar in sense; whereas here, in the \"opening\" and \"shutting,\" the figure of the key is retained. The comparison of the institution of Eliakim in his office to the fastening of a tent-peg was all the more natural, that yâthēd was also used as a general designation for national rulers (Zechariah 10:4), who stand in the same relation to the commonwealth as a tent-peg to the tent which it holds firmly and keeps upright. As the tent-peg is rammed into the ground, so that a person could easily sit upon it, the figure is changed, and the tent-peg becomes a seat of honour. As a splendid chair is an ornament to a room, so Eliakim would be an honour to his hitherto undistinguished family. The thought that naturally suggests itself - namely, that the members of the family would sit upon this chair, for the purpose of raising themselves to honour - is expressed by a different figure. Eliakim is once more depicted as a yâthed, but it is as a still higher one this time - namely, as the rod of a wardrobe, or a peg driven high up into the wall. Upon this rod or peg they hang (thâlu, i.e., one hangs, or there hangs) all the câbōd of the house of Eliakim, i.e., not every one who wished to be honoured and attained to honour in this way (cf., Isaiah 5:13), but the whole weight of his family (as in Isaiah 8:7). This family is then subdivided into its separate parts, and, as we may infer from the juxtaposition of the masculine and feminine nouns, according to its male and female constituents. In צאצאים (offshoots) and צפעות (\"side-shoots,\" from צפע, to push out; compare צפיע, dung, with צאה, mire) there is contained the idea of a widely ramifying and undistinguished family connection. The numerous rabble consisted of nothing but vessels of a small kind (hakkâtân), at the best of basons (aggânoth) like those used by the priests for the blood (Exodus 24:6), or in the house for mixing wine (Sol 7:3; Aram. aggono, Ar. iggâne, ingân, a washing bason), but chiefly of nebâlim, i.e., leather bottles or earthenware pitchers (Isaiah 30:14). The whole of this large but hitherto ignoble family of relations would fasten upon Eliakim, and climb through him to honour. Thus all at once the prophecy, which seemed so full of promise of Eliakim, assumes a satirical tone. We get an impression of the favouring of nephews and cousins, and cannot help asking how this could be a suitable prophecy for Shebna to hear. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in order that another worthier man may take his place. \"And it will come to pass in that day, that I call to my servant Eliakim the son of Hilkiah, and invest him with thy coat, and I throw thy sash firmly round him, and place they government in his hand; and he will become a father to the inhabitants of Jerusalem and to the house of Judah. And I place the key of David upon his shoulder: and when he opens, no man shuts; and when he shuts, no man opens. And I fasten him as a plug in a fast place, and he becomes the seat of honour to his father's house. And the whole mass of his father's house hangs upon him, the offshoots and side-shoots, every small vessel, from the vessel of the basins even to every vessel of the pitchers.\" Eliakim is called the \"servant of Jehovah,\" as one who was already a servant of God in his heart and conduct; the official service is added for the first time here. This title of honour generally embraces both kinds of service (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is quite in accordance with oriental custom, that this transfer of the office is effected by means of investiture (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 19:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): chizzēk, with a double accusative, viz., that of the person and that of the official girdle, is used here according to its radical signification, in the sense of girding tightly or girding round, putting the girdle round him so as to cause the whole dress to sit firmly, without hanging loose. The word memshaltekâ (thy government) shows how very closely the office forfeited by Shebna was connected with that of the king. This is also proved by the word \"father,\" which is applied in other cases to the king as the father of the land (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The \"key\" signifies the power of the keys; and for this reason it is not given into Eliakim's hand, but placed upon his shoulder (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This key was properly handled by the king (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and therefore by the \"house-mayor\" only in his stead. The power of the keys consisted not only in the supervision of the royal chambers, but also in the decision who was and who was not to be received into the king's service. There is a resemblance, therefore, to the giving of the keys of the kingdom of heaven to Peter under the New Testament. But there the \"binding\" and \"loosing\" introduce another figure, though one similar in sense; whereas here, in the \"opening\" and \"shutting,\" the figure of the key is retained. The comparison of the institution of Eliakim in his office to the fastening of a tent-peg was all the more natural, that yâthēd was also used as a general designation for national rulers (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 10:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), who stand in the same relation to the commonwealth as a tent-peg to the tent which it holds firmly and keeps upright. As the tent-peg is rammed into the ground, so that a person could easily sit upon it, the figure is changed, and the tent-peg becomes a seat of honour. As a splendid chair is an ornament to a room, so Eliakim would be an honour to his hitherto undistinguished family. The thought that naturally suggests itself - namely, that the members of the family would sit upon this chair, for the purpose of raising themselves to honour - is expressed by a different figure. Eliakim is once more depicted as a yâthed, but it is as a still higher one this time - namely, as the rod of a wardrobe, or a peg driven high up into the wall. Upon this rod or peg they hang (thâlu, i.e., one hangs, or there hangs) all the câbōd of the house of Eliakim, i.e., not every one who wished to be honoured and attained to honour in this way (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but the whole weight of his family (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This family is then subdivided into its separate parts, and, as we may infer from the juxtaposition of the masculine and feminine nouns, according to its male and female constituents. In צאצאים (offshoots) and צפעות (\"side-shoots,\" from צפע, to push out; compare צפיע, dung, with צאה, mire) there is contained the idea of a widely ramifying and undistinguished family connection. The numerous rabble consisted of nothing but vessels of a small kind (hakkâtân), at the best of basons (aggânoth) like those used by the priests for the blood (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 24:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or in the house for mixing wine (Sol 7:3; Aram. aggono, Ar. iggâne, ingân, a washing bason), but chiefly of nebâlim, i.e., leather bottles or earthenware pitchers (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The whole of this large but hitherto ignoble family of relations would fasten upon Eliakim, and climb through him to honour. Thus all at once the prophecy, which seemed so full of promise of Eliakim, assumes a satirical tone. We get an impression of the favouring of nephews and cousins, and cannot help asking how this could be a suitable prophecy for Shebna to hear. ",
            "children": []
          }
        ]
      }
    ]
  }
]