[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(25) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall the nail that is fastened in a sure place be removed . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There is, the prophet says, a judgment for the misuse of power portrayed in the previous verse. The “nail” that seems so firmly fixed should be removed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Eliakim should cease to hold his high office, and with his fall should come that of all his kindred and dependents. Here, as in the case of Shebna, we have no record of the fulfilment of the prediction, but it is a natural inference, from its remaining in the collected prophecies of Isaiah, either that it was fulfilled, or that it did its work as a warning, and that the penalty was averted by a timely reformation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:15-25 This message to Shebna is a reproof of his pride, vanity, and security; what vanity is all earthly grandeur, which death will so soon end! What will it avail, whether we are laid in a magnificent tomb, or covered with the green sod? Those who, when in power, turn and toss others, will be justly turned and tossed themselves. Eliakim should be put into Shebna's place. Those called to places of trust and power, should seek to God for grace to enable them to do their duty. Eliakim's advancement is described. Our Lord Jesus describes his own power as Mediator, Re 3:7, that he has the key of David. His power in the kingdom of heaven, and in ordering all the affairs of that kingdom, is absolute. Rulers should be fathers to those under their government; and the honour men bring unto their families, by their piety and usefulness, is more to be valued than what they derive from them by their names and titles. The glory of this world gives a man no real worth or excellence; it is but hung upon him, and it will soon drop from him. Eliakim was compared to a nail in a sure place; all his family are said to depend upon him. In eastern houses, rows of large spikes were built up in the walls. Upon these the moveables and utensils were hung. Our Lord Jesus is as a nail in a sure place. That soul cannot perish, nor that concern fall to the ground, which is by faith hung upon Christ. He will set before the believer an open door, which no man can shut, and bring both body and soul to eternal glory. But those who neglect so great salvation will find, that when he shutteth none can open, whether it be shutting out from heaven, or shutting up in hell for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In that day shall the nail - Not Eliakim, but Shebna. Eliakim was to be fastened, that is, confirmed in office. But Shebna was to be removed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That is fastened in the sure place - Or, that was once fastened, or was supposed to be fastened - a phrase appropriate to an office which the incumbent supposed to be firm or secure. It here refers to Shebna. He was regarded as haying a permanent hold on the office, and was making provisions for ending his days in it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Be removed - To a distant land Isaiah 22:17-18, or simply taken down.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Be removed - To a distant land ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:17-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or simply taken down.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And be cut down, and fall - As a spike, pin, or peg would be taken away from the wall of a house.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the burden that was upon it - All that it sustained - as the spikes in the wall of a house sustained the cups of gold, the raiment, or the armor that belonged to the family. Here it means, all that was dependent on Shebna - the honor of his family, his emoluments, his hope of future fame, or of an honored burial. All these would fail as a matter of course, when he was removed from his office. This is one instance of the usual mode of the divine administration. The errors of a man entrusted with office entail poverty, disgrace, and misery on all who are connected with him. Not only is his own name disgraced, but his sin \"diffuses itself,\" as it were, on all connected wit him. It involves them in want, and shame, and tears; and the design is to deter those in office from sin, by the fact that their crimes and errors \"will\" thus involve the innocent in calamiry, and shed disgrace and woe on those whom they love. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the burden that was upon it - All that it sustained - as the spikes in the wall of a house sustained the cups of gold, the raiment, or the armor that belonged to the family. Here it means, all that was dependent on Shebna - the honor of his family, his emoluments, his hope of future fame, or of an honored burial. All these would fail as a matter of course, when he was removed from his office. This is one instance of the usual mode of the divine administration. The errors of a man entrusted with office entail poverty, disgrace, and misery on all who are connected with him. Not only is his own name disgraced, but his sin \"diffuses itself,\" as it were, on all connected wit him. It involves them in want, and shame, and tears; and the design is to deter those in office from sin, by the fact that their crimes and errors \"will\" thus involve the innocent in calamiry, and shed disgrace and woe on those whom they love. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25. nail … fastened—Shebna, who was supposed to be firmly fixed in his post.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "burden … upon it—All that were dependent on Shebna, all his emoluments and rank will fail, as when a peg is suddenly \"cut down,\" the ornaments on it fall with it. Sin reaches in its effects even to the family of the guilty (Ex 20:5).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The nail that is fastened in the sure place; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Shebna, who seemed to be so, both in his own eyes, and in the eyes of others. The burden that was upon it; all those wicked officers that were advanced and supported by his power. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In that day, saith the Lord of hosts,.... That Shebna is deposed, and Eliakim put in his place: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall the nail that is fastened in the sure place be removed, and be cut down, and fall; meaning, not Eliakim before spoken of, who really was a nail fastened in a sure place, and not to be removed; but Shebna, who thought himself to be as a nail in a sure place, being put into it by the king, and supported by his authority, and courted by his friends and flatterers; for to him the whole preceding prophecy is directed, which is carried down to this verse; for all that is said of the glory and usefulness of his successor Eliakim was to be told to him, which would make it still the more grievous to him, to be degraded and disgraced as he would be, signified by his being removed, cast down, and falling: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the burden that was upon it shall be cut off; those that were dependent upon him, his family, his flatterers, and friends, such whom he had raised by his influence and authority to considerable places, and whom he supported in them; these would fall with him, as is usual when a royal favourite, or prime minister of state, falls into disgrace, and is removed; an instance of this may be seen in Haman, whose family and friends were involved in the same ruin with him, Esther 9:12 and it may be observed, that many dependents, which a minister of state always has, are a burden to him. The Targum interprets this of the burden of prophecy; and Jarchi says, that some explain it thus, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the burden that was upon it shall be cut off; those that were dependent upon him, his family, his flatterers, and friends, such whom he had raised by his influence and authority to considerable places, and whom he supported in them; these would fall with him, as is usual when a royal favourite, or prime minister of state, falls into disgrace, and is removed; an instance of this may be seen in Haman, whose family and friends were involved in the same ruin with him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 9:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and it may be observed, that many dependents, which a minister of state always has, are a burden to him. The Targum interprets this of the burden of prophecy; and Jarchi says, that some explain it thus, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the prophecy, which thou prophesiest, concerning it, shall be confirmed;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord hath spoken it; and therefore it shall come to pass; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for, so it is decreed by the word of the Lord.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"for, so it is decreed by the word of the Lord.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "In that day, saith the LORD of hosts, shall the {a} nail that is fastened in the sure place be removed, and be cut down, and fall; and the burden that was upon it shall be cut off: for the LORD hath spoken it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In that day, saith the LORD of hosts, shall the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " nail that is fastened in the sure place be removed, and be cut down, and fall; and the burden that ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " upon it shall be cut off: for the LORD hath spoken ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) He means Shebna, who in man's judgment should never have fallen.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The fall of Eliakim’s house, described under the same metaphor. It is not necessarily implied that the minister himself lived to see this reverse of fortune; living or dead, his name was the “peg” of the family’s nobility, and when the crash came, it might truly be said that the “peg fastened in a sure place” had been removed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - SEQUEL OF THE PROPHECY CONCERNING ELIAKIM. This verse has been truly called \"an enigma\" (Kay). It is impossible to understand it of Shebna. \"The nail that was fastened in a sure place\" can only refer to the nail said to have been so fastened in ver. 23. Are we, then, to understand that Eliakim too will experience a reverse of fortune? But then all the force of the contrast between him and Shebna would be gone. Is it not possible that the prophet, seeing in Eliakim a type of the Messiah, and becoming more and more Messianic in his utterances, has ended by forgetting the type altogether, and being absorbed in the thought of the antitype? He, the nail, so surely fixed in his eternal place, would nevertheless be \"removed\" for a time, and then \"he cut down and fall\" (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). At the same time would be \"cut off\" the burden which Messiah bore (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"He bare the sin of many\"). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In that day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Not the day of Shebna's fall, certainly (ver. 20), but some ether. Is not the day that of Christ's earthly mission, when it seemed as if his people were about to acknowledge him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:29-40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and his throne to be established, but suddenly Messiah was \"cut off\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - stricken for the transgression of his people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The burden that was upon it shall be cut off.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The great burden upon the Messiah was the load of human sin which he had to bear. \"He himself bare our sins in his own body on the tree\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). By his death this burden was \"cut off\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the Lord hath spoken it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The double attestation, at the beginning and at the end of the verse, is a mark of the vast importance of the announcement contained in it, which ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in fact, the germ of the great doctrine of the atonement. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaiah 22:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We will refer to this again. But in the meantime the impression is an irresistible one; and the Targum, Jerome, Hitzig, and others, are therefore right in assuming that Eliakim is the peg which, however glorious its beginning may have been, comes at last to the shameful end described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"In that day, saith Jehovah of hosts, will the peg that is fastened in a sure place be removed, and be cast down, and fall; and the burden that it bore falls to the ground: for Jehovah hath spoken.\" The prophet could not express in clearer terms the identity of the peg threatened here with Eliakim himself; for how is it conceivable that the prophet could turn all that he has predicated of Eliakim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", into predicates of Shebna? What Umbreit says - namely, that common sense must refer ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to Shebna - is the very reverse of correct. Eliakim himself is also brought down at last by the greatness of his power, on account of the nepotism to which he has given way. His family makes a wrong use of him; and he is more yielding than he ought to be, and makes a wrong use of his office to favour them! He therefore falls, and brings down with him all that hung upon the peg, i.e., all his relations, who have brought him to ruin through the rapacity with which they have grasped at prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hitzig maintains that Isaiah 22:24, Isaiah 22:25 form a later addition. But it is much better to assume that the prophet wrote down Isaiah 22:15-25 at one sitting, after the predicted fate of the two great ministers of state, which had been revealed to him at two different times, had been actually fulfilled. We know nothing more about them than this, that in the fourteenth year of Hezekiah it was not Shebna, but Eliakim, \"who was over the house\" (Isaiah 36:3, Isaiah 36:22; Isaiah 37:2). But Shebna also filled another office of importance, namely that of sōpher. Was he really taken prisoner and carried away (a thing which is perfectly conceivable even without an Assyrian captivity of the nation generally)? Or did he anticipate the threatened judgment, and avert it by a penitential self-abasement? To this and other questions we can give no reply. One thing alone is certain - namely, that the threefold prediction of Shebna's fall, of Eliakim's elevation, and of Eliakim's fall, would not stand where it does, if there were any reason whatever to be ashamed of comparing the prophecy with its fulfilment. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hitzig maintains that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " form a later addition. But it is much better to assume that the prophet wrote down ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:15-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " at one sitting, after the predicted fate of the two great ministers of state, which had been revealed to him at two different times, had been actually fulfilled. We know nothing more about them than this, that in the fourteenth year of Hezekiah it was not Shebna, but Eliakim, \"who was over the house\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 36:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 36:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But Shebna also filled another office of importance, namely that of sōpher. Was he really taken prisoner and carried away (a thing which is perfectly conceivable even without an Assyrian captivity of the nation generally)? Or did he anticipate the threatened judgment, and avert it by a penitential self-abasement? To this and other questions we can give no reply. One thing alone is certain - namely, that the threefold prediction of Shebna's fall, of Eliakim's elevation, and of Eliakim's fall, would not stand where it does, if there were any reason whatever to be ashamed of comparing the prophecy with its fulfilment. ",
            "children": []
          }
        ]
      }
    ]
  }
]