[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There is a league.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bĕrîth,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “covenant.” The verse is the same as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", omitting the word “a present” before “silver and gold,” and making two or three other minute verbal changes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As.—And.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Depart.—Go up. See the Notes on Kings.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Depart.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Go up.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " See the Notes on Kings.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:1-14 Asa seeks the aid of the Syrians, His death. - A plain and faithful reproof was given to Asa by a prophet of the Lord, for making a league with Syria. God is displeased when he is distrusted, and when an arm of flesh is relied on, more than his power and goodness. It is foolish to lean on a broken reed, when we have the Rock of ages to rely upon. To convince Asa of his folly, the prophet shows that he, of all men, had no reason to distrust God, who had found him such a powerful Helper. The many experiences we have had of the goodness of God to us, aggravate our distrust of him. But see how deceitful our hearts are! we trust in God when we have nothing else to trust to, when need drives us to him; but when we have other things to stay on, we are apt to depend too much on them. Observe Asa's displeasure at this reproof. What is man, when God leaves him to himself! He that abused his power for persecuting God's prophet, was left to himself, to abuse it further for crushing his own subjects. Two years before he died, Asa was diseased in his feet. Making use of physicians was his duty; but trusting to them, and expecting that from them which was to be had from God only, were his sin and folly. In all conflicts and sufferings we need especially to look to our own hearts, that they may be perfect towards God, by faith, patience, and obedience.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Compare the ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 16",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2Ch 16:1-14. Asa, by a League with the Syrians, Diverts Baasha from Building Ramah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-6. In the six and thirtieth year of the reign of Asa, Baasha … came up against Judah—Baasha had died several years before this date (1Ki 15:33), and the best biblical critics are agreed in considering this date to be calculated from the separation of the kingdoms, and coincident with the sixteenth year of Asa's reign. This mode of reckoning was, in all likelihood, generally followed in the book of the kings of Judah and Israel, the public annals of the time (2Ch 16:11), the source from which the inspired historian drew his account.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Baasha … built Ramah—that is, fortified it. The blessing of God which manifestly rested at this time on the kingdom of Judah, the signal victory of Asa, the freedom and purity of religious worship, and the fame of the late national covenant, were regarded with great interest throughout Israel, and attracted a constantly increasing number of emigrants to Judah. Baasha, alarmed at this movement, determined to stem the tide; and as the high road to and from Jerusalem passed by Ramah, he made that frontier town, about six miles north of Asa's capital, a military station, where the vigilance of his sentinels would effectually prevent all passage across the boundary of the kingdom (see on [439]1Ki 15:16-22; also Jer 41:9).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the thirty and sixth year of the reign of Asa Baasha king of Israel came up against Judah,.... How this is to be reconciled with the reign of Baasha, which was but twenty four years, and was begun in the third of Asa, and therefore must have been dead nearly ten years before this year of Asa's reign; see Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where, and in the following verses, are the same things related as here, to the end of the sixth verse; the explanation of which the reader is referred to. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "There is a league between me and thee, as there was between my father and thy father: behold, I have sent thee silver and gold; go, {c} break thy league with Baasha king of Israel, that he may depart from me.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "There is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a league between me and thee, as ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " between my father and thy father: behold, I have sent thee silver and gold; go, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " break thy league with Baasha king of Israel, that he may depart from me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) He thought to repulse his adversary by an unlawful means, that is, by seeking help from infidels, as they who seek the help of Turks, thinking by it to make themselves stronger.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The alliance of the King of Syria was sought now by one kingdom, now by the other. On what occasion Abijah made league with the king, the history does not say, either here or in the parallel, nor when he or his son resigned it. For there is, read \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Let there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be a league between me and thee, as between my father and thy father;\" the short cut which Area thought to take now to his object was not the safe nor right one. 2 Chronicles 16:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "War with Baasha, and the weakness of Asa's faith. The end of his reign. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 16:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Baasha's invasion of Judah, and Asa's prayer for help to the king of Syria. The statement, \"In the thirty-sixth year of the reign of Asa, Baasha the king of Israel came up against Judah,\" is inaccurate, or rather cannot possibly be correct; for, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Baasha died in the twenty-sixth year of Asa's reign, and his successor Elah was murdered by Zimri in the second year of his reign, i.e., in the twenty-seventh year of Asa. The older commentators, for the most part, accepted the conjecture that the thirty-fifth year (in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is to be reckoned from the commencement of the kingdom of Judah; and consequently, since Asa became king in the twentieth year of the kingdom of Judah, that Baasha's invasion occurred in the sixteenth year of his reign, and that the land had enjoyed peace till his fifteenth year; cf. Ramb. ad h. l.; des Vignoles, Chronol. i. p. 299. This is in substance correct; but the statement, \"in the thirty-sixth year of Asa's kingship,\" cannot re reconciled with it. For even if we suppose that the author of the Chronicle derived his information from an authority which reckoned from the rise of the kingdom of Judah, yet it could not have been said on that authority, אסא למלכוּת. This only the author of the Chronicle can have written; but then he cannot also have taken over the statement, \"in the thirty-sixth year,\" unaltered from his authority into his book. There remains therefore no alternative but to regard the text as erroneous - the letters ל (30) and י (10), which are somewhat similar in the ancient Hebrew characters, having been interchanged by a copyist; and hence the ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and 36 have arisen out of the original 15 and 16. By this alteration all difficulties are removed, and all the statements of the Chronicle as to Asa's reign are harmonized. During the first ten years there was peace (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); thereafter, in the eleventh year, the inroad of the Cushites; and after the victory over them there was the continuation of the Cultus reform, and rest until the fifteenth year, in which the renewal of the covenant took place (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 15:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and in the sixteenth year the war with Baasha arose.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Movers, S. 255ff., and Then. on 1 Kings 15, launch out into arbitrary hypotheses, founded in both cases upon the erroneous presumption that the author of the Chronicle copied our canonical books of Kings - they being his authority-partly misunderstanding and partly altering them.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Movers, S. 255ff., and Then. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", launch out into arbitrary hypotheses, founded in both cases upon the erroneous presumption that the author of the Chronicle copied our canonical books of Kings - they being his authority-partly misunderstanding and partly altering them.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The account of this war in 2 Chronicles 16:1-6 agrees with that in 1 Kings 15:17-22 almost literally, and has been commented upon in the remarks on 1 Kings 15. In 2 Chronicles 16:2 the author of the Chronicle has mentioned only the main things. Abel-maim, i.e., Abel in the Water (2 Chronicles 16:4), is only another name for Abel-Beth-Maachah (Kings); see on 2 Samuel 20:14. In the same verse נפתּלי ערי כּל־מסכּנות ואת is surprising, \"and all magazines (or stores) of the cities of Naphtali,\" instead of נפתּלי כּל־ארץ על כּל־כּנּרות את, \"all Kinneroth, together with all the land of Naphtali\" (Kings). Then. and Berth. think ערי מסכנות has arisen out of ארץ and כנרות by a misconception of the reading; while Gesen., Dietr. in Lex. sub voce כּנּרות, conjecture that in 1 Kings 15:20 מסכּנות should be read instead of כּנּרות. Should the difference actually be the result only of a misconception, then the latter conjecture would have much more in its favour than the first. But it is a more probable solution of the difficulty that the text of the Chronicle is a translation of the unusual and, especially on account of the כּל־ארץ נ על, scarcely intelligible כּל־כּנּרות. כּנּרות is the designation of the very fertile district on the west side of the Sea of Kinnereth, i.e., Gennesaret, after which a city also was called כּנּרת (see on Joshua 19:35), and which, on account of its fertility, might be called the granary of the tribal domain of Naphtali. But the smiting of a district can only be a devastation of it, - a plundering and destruction of its produce, both in stores and elsewhere. With this idea the author of the Chronicle, instead of the district Kinnereth, the name of which had perhaps become obsolete in his time, speaks of the מסכּנות, the magazines or stores, of the cities of Naphtali. In 2 Chronicles 16:5, too, we cannot hold the addition את־מלאכתּו ויּשׁבּת, \"he caused his work to rest,\" as Berth. does, for an interpretation of the original reading, בּתרצה ויּשׁב (Kings), it having become illegible: it is rather a free rendering of the thought that Baasha abandoned his attempt upon Judah. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The account of this war in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 16:1-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " agrees with that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15:17-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " almost literally, and has been commented upon in the remarks on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the author of the Chronicle has mentioned only the main things. Abel-maim, i.e., Abel in the Water (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 16:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is only another name for Abel-Beth-Maachah (Kings); see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In the same verse נפתּלי ערי כּל־מסכּנות ואת is surprising, \"and all magazines (or stores) of the cities of Naphtali,\" instead of נפתּלי כּל־ארץ על כּל־כּנּרות את, \"all Kinneroth, together with all the land of Naphtali\" (Kings). Then. and Berth. think ערי מסכנות has arisen out of ארץ and כנרות by a misconception of the reading; while Gesen., Dietr. in Lex. sub voce כּנּרות, conjecture that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " מסכּנות should be read instead of כּנּרות. Should the difference actually be the result only of a misconception, then the latter conjecture would have much more in its favour than the first. But it is a more probable solution of the difficulty that the text of the Chronicle is a translation of the unusual and, especially on account of the כּל־ארץ נ על, scarcely intelligible כּל־כּנּרות. כּנּרות is the designation of the very fertile district on the west side of the Sea of Kinnereth, i.e., Gennesaret, after which a city also was called כּנּרת (see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and which, on account of its fertility, might be called the granary of the tribal domain of Naphtali. But the smiting of a district can only be a devastation of it, - a plundering and destruction of its produce, both in stores and elsewhere. With this idea the author of the Chronicle, instead of the district Kinnereth, the name of which had perhaps become obsolete in his time, speaks of the מסכּנות, the magazines or stores, of the cities of Naphtali. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 16:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", too, we cannot hold the addition את־מלאכתּו ויּשׁבּת, \"he caused his work to rest,\" as Berth. does, for an interpretation of the original reading, בּתרצה ויּשׁב (Kings), it having become illegible: it is rather a free rendering of the thought that Baasha abandoned his attempt upon Judah. ",
            "children": []
          }
        ]
      }
    ]
  }
]