[{"num":2,"verse":"¶ Moreover the word of the LORD came to me, saying,"},{"num":2,"verse":"Go and cry out in the ears of Jerusalem, saying, Thus saith the LORD: I remember thee, the mercy of thy youth, the love of thine espousals, when thou didst go after me in the wilderness, in a land that was not sown."},{"num":3,"verse":"Israel was holiness unto the LORD and the firstfruits of his increase; all that devour him shall be found guilty; evil shall come upon them, saith the LORD."},{"num":4,"verse":"Hear ye the word of the LORD, O house of Jacob, and all the families of the house of Israel;"},{"num":5,"verse":"thus hath the LORD said, What iniquity have your fathers found in me that they are gone far from me and have walked after vanity and are become vain?"},{"num":6,"verse":"Neither did they say, Where is the LORD that brought us up out of the land of Egypt, that led us through the wilderness, through a land of deserts and of pits, through a land of drought and of the shadow of death, through a land that no man passed through and where no man dwelt?"},{"num":7,"verse":"And I brought you into a plentiful country to eat the fruit thereof and the goodness thereof; but when ye entered, ye defiled my land and made my heritage an abomination."},{"num":8,"verse":"The priests did not say, Where is the LORD? and those that handled the law did not know me; the pastors also rebelled against me, and the prophets prophesied by Baal and walked after things that do not profit."},{"num":9,"verse":"¶ Therefore I will yet enter into judgment with you, saith the LORD, and I will plead with your children’s children."},{"num":10,"verse":"For pass over the isles of Chittim and see; and send unto Kedar and consider diligently and see if there be such a thing."},{"num":11,"verse":"Has a nation changed their gods? Even though they are not gods. But my people have changed their glory for that which does not profit."},{"num":12,"verse":"Be astonished, O ye heavens, at this; and be horribly afraid, be ye very desolate, said the LORD."},{"num":13,"verse":"For my people have committed two evils: they have forsaken me the fountain of living waters to hew them out cisterns, broken cisterns, that can hold no water."},{"num":14,"verse":"¶ Is Israel a slave? Is he a homeborn slave? Why has he been given over as a prey?"},{"num":15,"verse":"The young lions roared upon him and yelled, and they made his land waste: his cities are deserted without inhabitant."},{"num":16,"verse":"Even the sons of Noph and Tahapanes have broken the crown of thy head."},{"num":17,"verse":"Could this not have come upon you peradventure because thou hast forsaken the LORD thy God, when he led thee by the way?"},{"num":18,"verse":"And now what hast thou to do in the way of Egypt? to drink the waters of the Nile? or what hast thou to do in the way of Assyria? to drink the waters of the river Eufrates?"},{"num":19,"verse":"Thine own wickedness shall chastise thee, and thy backslidings shall reprove thee; know therefore and see how evil and bitter it is, that thou hast forsaken the LORD thy God and that my fear is lacking in thee, saith the Lord GOD of the hosts."},{"num":20,"verse":"¶ For of old time I have broken thy yoke and burst thy bands; and thou didst say, I will not serve sin. With all this, upon every high hill and under every green tree thou dost wander, playing the harlot."},{"num":21,"verse":"Yet I had planted thee a noble vine, a seed of Truth, all of her; how then art thou turned into the degenerate plant of a strange vine unto me?"},{"num":22,"verse":"For though thou wash thee with nitre and take thee much soap, yet thine iniquity is sealed before me, saith the Lord GOD."},{"num":23,"verse":"How canst thou say, I am not polluted, I have not gone after Baalim? See thy way in the valley, know what thou hast done: thou art a swift dromedary traversing her ways;"},{"num":24,"verse":"a wild ass used to the wilderness that breathes according to the desire of her soul; from her lust, who shall stop her? All those that seek her will not weary themselves; in her month they shall find her."},{"num":25,"verse":"Withhold thy foot from being unshod and thy throat from thirst; but thou didst say, There is no hope: no; for I have loved strangers, and after them I will go."},{"num":26,"verse":"As the thief is ashamed when he is taken, so shall the house of Israel be ashamed: they, their kings, their princes, and their priests, and their prophets,"},{"num":27,"verse":"saying to a piece of firewood, Thou art my father; and to a stone, Thou hast brought me forth: for they have turned their back unto me, and not their face: but in the time of their trouble they say, Arise and deliver us."},{"num":28,"verse":"But where are thy gods that thou hast made thee? Let them arise, if they can save thee in the time of thy trouble, for according to the number of thy cities were thy gods, O Judah."},{"num":29,"verse":"¶ Why will ye plead with me? Ye have all rebelled against me, saith the LORD."},{"num":30,"verse":"I have smitten your children in vain; they have received no correction; your own sword has devoured your prophets, like a destroying lion."},{"num":31,"verse":"O generation, see ye the word of the LORD. Have I been a wilderness unto Israel? a land of darkness? Why do my people say, We are lords; we will come no more unto thee?"},{"num":32,"verse":"Shall the virgin, perchance, forget her ornaments, or a bride her attire? yet my people have forgotten me days without number."},{"num":33,"verse":"Why dost thou trim thy way to seek love? therefore thou hast also taught the wicked ones thy ways."},{"num":34,"verse":"Even in thy skirts is found the blood of the souls of the poor innocents; thou didst not find them in any trespass, but by all these things."},{"num":35,"verse":"Yet thou didst say, Because I am innocent, surely his anger shall turn from me. Behold, I will enter into judgment with thee because thou hast said, I did not sin."},{"num":36,"verse":"Why dost thou talk so much, changing thy ways? Thou shalt also be ashamed of Egypt, as thou wast ashamed of Assyria."},{"num":37,"verse":"Thou shalt also go forth from him with thine hands upon thine head; for the LORD has rejected thy confidences, and thou shalt not prosper in them."}]