[{"header":"Israel Turns Away from God"},{"num":2,"verse":"The Word of the Lord came to me saying, "},{"num":2,"verse":"“Go and speak so those in Jerusalem will hear, ‘This is what the Lord says: “I remember how you loved Me when you were young. Your love was as a bride. I remember how you followed Me in the desert, through a land that had not been planted. "},{"num":3,"verse":"Israel was holy to the Lord, the first-fruits of His gathering. All who ate of it (Israel) were guilty, and trouble came upon them,” says the Lord.’”"},{"header":"The Sin of Israel’s Early Families"},{"num":4,"verse":"Hear the Word of the Lord, O family of Jacob, and all the families of the people of Israel. "},{"num":5,"verse":"The Lord says, “What wrong did your fathers find in Me, that they turned so far from Me and followed false gods? "},{"num":6,"verse":"They did not say, ‘Where is the Lord Who brought us up from the land of Egypt? Where is He Who led us through the wilderness, through a land of deserts and deep holes, through a land without water and with much trouble, through a land that no one traveled and where no man lived?’ "},{"num":7,"verse":"And I brought you into a rich land to eat its fruit and its good things. But you came and made My land unclean. You made the land I gave you sinful and hated. "},{"num":8,"verse":"The religious leaders did not say, ‘Where is the Lord?’ And those who worked with the Law did not know Me. The rulers sinned against Me. And the men of God spoke by the false god of Baal, and went after things that did not help."},{"header":"The Lord Speaks against His People"},{"num":9,"verse":"“So I will still fight with you,” says the Lord. “And I will fight your children’s children. "},{"num":10,"verse":"Go over to the land of Cyprus and see. Or send men to Kedar to watch with care. And see if there has been such a thing as this! "},{"num":11,"verse":"Has a nation changed its gods, even when they are not gods? But My people have changed their greatness for that which does not help them. "},{"num":12,"verse":"Be full of wonder at this, O heavens. Shake with fear and waste away,” says the Lord. "},{"num":13,"verse":"“For My people have done two sinful things: They have turned away from Me, the well of living waters. And they have cut out of the rock wells for water for themselves. They are broken wells that cannot hold water."},{"header":"What Happens When Israel Is Not Faithful"},{"num":14,"verse":"“Is Israel a servant? Is he born as a servant? Why can he be taken away? "},{"num":15,"verse":"The young lions have made noise against him. They have made a loud noise. And they have made his land a waste. His cities have been destroyed, and have no people. "},{"num":16,"verse":"The men of Memphis and Tahpanhes have broken the crown of your head. "},{"num":17,"verse":"Have you not brought this upon yourself, by turning away from the Lord your God, when He led you in the way? "},{"num":18,"verse":"Now why are you going to Egypt to drink water from the Nile? Or why are you going to Assyria to drink water from the Euphrates? "},{"num":19,"verse":"Your own sin will punish you. Your turning away from the Lord will punish you. So know and see that it is sinful and bitter for you to leave the Lord your God. You have no fear of Me,” says the Lord God of All."},{"header":"Israel Turns Its Back on God"},{"num":20,"verse":"“Long ago I broke the load from your neck and tore off your chains. But you said, ‘I will not serve!’ For on every high hill and under every green tree you have lain down as a woman who sells the use of her body. "},{"num":21,"verse":"Yet I planted you as a vine of much worth, in every way a true seed. How then have you turned away from Me and become a wild vine? "},{"num":22,"verse":"Even when you wash yourself with much strong soap, the mark of your sin is still before Me,” says the Lord God. "},{"num":23,"verse":"“How can you say, ‘I am clean. I have not gone after the false gods of Baal’? Look at what you did in the valley! Know what you have done! You are like a wild young camel wanting to mate. "},{"num":24,"verse":"You are a wild donkey used to the desert, that smells the wind in her desire. In the time of her mating who can turn her away? All who look for her will not become tired. In her month of mating they will find her. "},{"num":25,"verse":"Do not run until your shoes wear out or until your mouth is dry. But you said, ‘It is of no use, for I love strange gods, and I will go after them.’"},{"header":"Israel Should Be Punished"},{"num":26,"verse":"“As a robber is put to shame when he is caught, so the family of Israel is put to shame: they, their kings, their rulers, their religious leaders, and their men of God. "},{"num":27,"verse":"They say to a tree, ‘You are my father,’ and to a stone, ‘You gave me birth.’ For they have turned their back to Me, and not their face. But in the time of their trouble they will say, ‘Rise up and save us.’ "},{"num":28,"verse":"But where are your gods that you made for yourself? Let them come if they can save you when you are in trouble. For you have as many gods as cities, O Judah."},{"num":29,"verse":"“Why do you complain against Me? You have all sinned against Me,” says the Lord. "},{"num":30,"verse":"“I have punished your children for nothing, for they would not learn from it. Your sword has destroyed your men of God like a destroying lion. "},{"num":31,"verse":"O people of this day, listen to the Word of the Lord. Have I been a desert to Israel, or a land of much darkness? Why do My people say, ‘We are free to go, and we will come to You no more’? "},{"num":32,"verse":"Can a young woman forget the beautiful objects she wears? Can a bride forget her clothing? Yet My people have forgotten Me too many days to number. "},{"num":33,"verse":"How you dress yourself and go after lovers! You have taught your ways even to the sinful women. "},{"num":34,"verse":"On your clothing is found the blood of the poor who could not be blamed. You did not find them breaking in. But even with all these things, "},{"num":35,"verse":"you say, ‘I am not guilty. For sure He has turned His anger away from me.’ See, I will punish you because you say, ‘I have not sinned.’ "},{"num":36,"verse":"Why do you go around so much changing your way? You will be put to shame by Egypt as you were put to shame by Assyria. "},{"num":37,"verse":"From Egypt also you will go out with your hands on your head. For the Lord has turned against those in whom you trust, and as you are with them, it will not go well for you.”"}]