[{"num":2,"verse":"Moreover the Devar Hashem came to me, saying,"},{"num":2,"verse":"Go and cry, shouting in the ears of Yerushalayim, saying, Thus saith Hashem; I remember thee, the chesed of thy ne’urim, the ahavas of thy days as a kallah, when thou wentest after Me in midbar, in an eretz that was not sown."},{"num":3,"verse":"Yisroel was Kodesh unto Hashem, and the reshit (firstfruit) of his tevu’ah (crop): all that devour him are held guilty; ra’ah shall overtake them, saith Hashem."},{"num":4,"verse":"Hear ye the Devar Hashem, O Beis Ya’akov, and all the mishpekhot of Bais Yisroel:"},{"num":5,"verse":"Thus saith Hashem, What avel (wrong, fault) have avoteichem found in Me, that they are strayed far from Me, and have walked after hevel (vain, empty delusion), and are become deluded?"},{"num":6,"verse":"Neither did they ask, Where is Hashem that brought us up out of Eretz Mitzrayim, that led us through the midbar, through an eretz of deserts and pits, through an eretz tziyyah (land of drought) and tzalmavet, through eretz that no ish passed through, where no adam dwelt?"},{"num":7,"verse":"And I brought you into an eretz hacarmel, to eat the pri thereof and the tovah thereof; but when ye entered, ye made My land tameh, and made My nachalah a to’evah."},{"num":8,"verse":"The Kohanim asked not, Where is Hashem? And they that handle the Torah had no da’as of Me; the ro’im also rebelled against Me, and the nevi’im prophesied by Ba’al, and walked after worthless things."},{"num":9,"verse":"Therefore I will yet bring lawsuit against you, saith Hashem, and against bnei beneichem will I bring lawsuit."},{"num":10,"verse":"For pass over to the isles of Kittim, and look; and send unto Kedar, and consider diligently, and see if there has ever been anything like this."},{"num":11,"verse":"Hath ever a nation changed elohim, and these no elohim at all? But My people have exchanged their kavod for that which is worthless."},{"num":12,"verse":"Be appalled, O ye Shomayim, at this, and be horribly afraid, be ye very desolate, saith Hashem."},{"num":13,"verse":"For Ami have committed shtayim ra’ot (two evils); they have forsaken Me, the fountain of Mayim Chayim, and hewed them out cisterns, broken cisterns, that can hold no mayim."},{"num":14,"verse":"Is Yisroel an eved? Is he a homeborn slave? Why has he become plunder?"},{"num":15,"verse":"The young lions roared upon him, and growled, and they made his [Israel’s] Eretz waste; his towns are burned without inhabitant."},{"num":16,"verse":"Also the Bnei Noph and Tachpanhes have broken the crown of thy head."},{"num":17,"verse":"Hast thou not procured this unto thyself, in that thou hast forsaken Hashem Eloheicha, when He led thee by the derech?"},{"num":18,"verse":"And now what hast thou to do in the derech Mitzrayim, to drink the waters of the Shichor [[Nile] River]? Or what hast thou to do in the derech Ashur (Assyria), to drink the waters of the Euphrates [River]?"},{"num":19,"verse":"Thine own ra’ah shall correct thee, and thy meshuvot (backslidings) shall reprove thee: know therefore and see that it is an evil thing and mar (bitter), that thou hast forsaken Hashem Eloheicha, and that My pachad is not in thee, saith Adonoi Hashem Tzva’os."},{"num":20,"verse":"For long ago I have broken thy ol (yoke), and tore off thy bonds; and thou saidst, I will not serve; when upon every high hill and under every green tree thou hast sprawled, playing the zonah."},{"num":21,"verse":"Yet I had planted thee a choice vine, wholly a zera emes. How then art thou turned into the degenerate plant of a gefen nochriyah unto Me?"},{"num":22,"verse":"For though thou wash thee with lye, and take thee much soap, yet thine avon (iniquity) is marked before Me, saith Adonoi Hashem."},{"num":23,"verse":"How canst thou say, I am not tameh, I have not gone after Ba’alim? See thy derech in the valley, know what thou hast done: thou art a swift camel traversing her ways;"},{"num":24,"verse":"A pereh used to the midbar, that sniffs up the ruach in the craving of her nefesh; in her occasion [of heat] who can turn her away? All they that seek her will not weary themselves; in her month they shall find her."},{"num":25,"verse":"Withhold thy regel from being unshod, and thy throat from thirst; but thou saidst, There is no hope: no; for I have loved zarim, and after them will I go."},{"num":26,"verse":"As the ganav is ashamed when he is caught, so is the Bais Yisroel ashamed; they, their melachim, their sarim, and their kohanim, and their nevi’im."},{"num":27,"verse":"Saying to Etz (wood), Thou art Avi; and to Even (stone), Thou hast brought me forth; for they have turned their back unto Me, and not their face; but in the time of their trouble they will say, Arise, and hoshi’einu (save us)."},{"num":28,"verse":"But where are thy elohim that thou hast made for thee? Let them arise, if they can save thee in the time of thy trouble; for as many as are the mispar (number) of thy towns are thy elohim, O Yehudah."},{"num":29,"verse":"Why will ye bring lawsuit against Me? Ye all have rebelled against Me, saith Hashem."},{"num":30,"verse":"In vain have I struck your banim; they received no musar [cf Isa 53:5]; your own cherev hath devoured your nevi’im, like a destroying lion."},{"num":31,"verse":"O HaDor (Generation), heed ye the Devar Hashem. Have I been a midbar unto Yisroel? An eretz of great darkness? Madu’a (why) say Ami, We are free; we will come no more unto Thee?"},{"num":32,"verse":"Can a betulah forget her jewelry, or a kallah her adornments? Yet My people have forgotten Me yamim ein mispar (days without number)."},{"num":33,"verse":"How well thou direct thy derech to seek ahavah? Therefore hast thou also taught hara’ot (the worst women) the darkhei (ways) of thee."},{"num":34,"verse":"Also in thy skirts is found the dahm of the nefashot of the innocent poor; although you never caught them breaking in. Yet concerning all these"},{"num":35,"verse":"Thou sayest, Because I am innocent, surely His anger shall turn from me. Hineni, I will plead with thee, because thou sayest, Loh chatati (I have not sinned)."},{"num":36,"verse":"Why doest thou gad about so much to change the course of thy derech? Thou also shalt be ashamed of Mitzrayim, as thou wast ashamed of Assyria."},{"num":37,"verse":"Yea, thou shalt go forth from this [dependence on religiously entangling and compromising foreign allies], and thine hands upon thine head; for Hashem hath rejected thy confidences, and thou shalt not prosper in them."}]