[{"num":86,"verse":"The prayer of David. Lord, bow (down) thine ear, and hear me; for I am needy and poor."},{"num":2,"verse":"Keep thou my life, for I am holy; my God, make thou safe thy servant hoping in thee. (Keep thou my life safe, for I am holy; my God, save thou thy servant, who trusteth in thee.)"},{"num":3,"verse":"Lord, have thou mercy on me, for I cried all day (long) to thee;"},{"num":4,"verse":"make thou glad the soul of thy servant; for why, Lord, I have raised my soul to thee (for Lord, I have raised up my soul to thee)."},{"num":5,"verse":"For thou, Lord, art sweet and mild; and of much mercy to all men inwardly calling thee. (For thou, Lord, art good and forgiving; and hath great love for all who call to thee/and hath great mercy for all who cry to thee.)"},{"num":6,"verse":"Lord, perceive thou my prayer with ears; and give thou attention to the voice of my beseeching. (Lord, listen thou to my prayer; and give attention to the words of my plea.)"},{"num":7,"verse":"In the day of my tribulation I cried to thee; for thou heardest me. (In my time of trouble, I cried to thee; for thou shalt answer me.)"},{"num":8,"verse":"Lord, none among gods is like thee; and none is even to thy works. (Lord, there is no god like thee; and there be no works like thy works/and there be no works equal to thy works.)"},{"num":9,"verse":"Lord, all folks, whichever thou madest (Lord, all the nations, which thou hast made), shall come, and worship before thee; and they shall glorify thy name."},{"num":10,"verse":"For thou art full great, and making marvels (For thou art very great, and doing marvellous deeds); thou art God alone."},{"num":11,"verse":"Lord, lead thou me forth in thy way, and I shall enter in thy truth; mine heart be glad, that it dread thy name. (Lord, lead thou me forth in thy way, and I shall walk in thy truth; let my heart be glad, that I fear thy name/that I revere thy name.)"},{"num":12,"verse":"My Lord God, I shall acknowledge to thee in all mine heart; and I shall glorify thy name [into] without end. (My Lord God, I shall praise thee with all my heart; and I shall glorify thy name forever.)"},{"num":13,"verse":"For thy mercy is great on me; and thou deliveredest my soul from the lower hell. (For thy love is great towards me; and thou hast rescued my soul from the depths of Sheol, or the land of the dead/and thou hast rescued my soul from the grave itself.)"},{"num":14,"verse":"God, wicked men have risen upon me; and the synagogue of mighty men have sought my life; and they have not set forth thee in their sight. (God, the wicked have risen against me; and a company of mighty men have sought my life; and they have no thought of thee.)"},{"num":15,"verse":"And thou, Lord God, doing mercy, and merciful; patient, and of much mercy, and soothfast. (But thou, Lord, art a God who giveth love, and art merciful; yea, thou art patient, and hath great love, and art faithful.)"},{"num":16,"verse":"Behold on me, and have mercy on me, give thou the empire to thy servant; and make thou safe the son of thine handmaid. (Turn to me, and have mercy on me; give thou thy strength to thy servant, and save thou the son of thy servantess.)"},{"num":17,"verse":"Make thou with me a sign in(to) good, that they see, that hate me, and be ashamed (Show thou me a sign of thy goodness, so that those who hate me can see it, and be ashamed); (yea,) for thou, Lord, hast helped me/hast holpen me, and hast comforted me."}]