[{"header":"When Problems Arise In Serving The Needy In The Church, Deacons Are Chosen To Oversee It"},{"num":6,"verse":"Now during these days, while the disciples were multiplying, grumbling arose from the Hellenists against the Hebrews because their widows were being overlooked in the daily ministry [of food]. "},{"num":2,"verse":"And the twelve, having summoned the multitude of the disciples, said, “It is not pleasing that we, having left-behind the word of God, should be serving tables. "},{"num":3,"verse":"But brothers, look-for seven men from-among you being attested, full of the Spirit and wisdom, whom we will put-in-charge over this need. "},{"num":4,"verse":"And we will devote-ourselves to prayer and the ministry of the word”. "},{"num":5,"verse":"And the statement was pleasing in the sight of the whole multitude. And they chose Stephen (a man full of faith and of the Holy Spirit), and Philip, and Prochorus, and Nicanor, and Timon, and Parmenas, and Nicolas (a proselyte from Antioch), "},{"num":6,"verse":"whom they stood before the apostles. And having prayed, they laid their hands on them. "},{"num":7,"verse":"And the word of God was growing. And the number of the disciples in Jerusalem was being multiplied greatly. And a large crowd of the priests were obeying the faith."},{"header":"Stephen Is Seized While Doing Miracles And Proclaiming Christ With Irresistible Wisdom"},{"num":8,"verse":"Now Stephen, full of grace and power, was doing great wonders and signs among the people. "},{"num":9,"verse":"But some of the ones from the synagogue being called “of Freedmen”— both Cyrenians and Alexandrians, and the ones from Cilicia and Asia— rose-up, debating with Stephen. "},{"num":10,"verse":"And they were not able to resist the wisdom and the Spirit with which he was speaking. "},{"num":11,"verse":"Then they secretly-induced men [to begin] saying that “We have heard him speaking blasphemous words against Moses and God”. "},{"num":12,"verse":"And they stirred-up the people and the elders and the scribes. And having suddenly-come-upon him, they seized him and brought him to the Sanhedrin. "},{"num":13,"verse":"And they put-forward false witnesses, saying, “This man does not cease speaking words against this holy place and the Law. "},{"num":14,"verse":"For we have heard him saying that this Jesus the Nazarene will tear-down this place, and change the customs which Moses handed-down to us”. "},{"num":15,"verse":"And having looked-intently at him, all the ones sitting in the council [chamber] saw his face was like a face of an angel. "}]