[{"num":6,"verse":"And in those days, the number of the disciples increasing, there arose a murmuring of the Greeks against the Hebrews, for that their widows were neglected in the daily ministration."},{"num":2,"verse":"Then the twelve calling together the multitude of the disciples, said: It is not reason that we should leave the word of God, and serve tables."},{"num":3,"verse":"Wherefore, brethren, look ye out among you seven men of good reputation, full of the Holy Ghost and wisdom, whom we may appoint over this business."},{"num":4,"verse":"But we will give ourselves continually to prayer, and to the ministry of the word."},{"num":5,"verse":"And the saying was liked by all the multitude. And they chose Stephen, a man full of faith, and of the Holy Ghost, and Philip, and Prochorus, and Nicanor, and Timon, and Parmenas, and Nicolas, a proselyte of Antioch."},{"num":6,"verse":"These they set before the apostles; and they praying, imposed hands upon them."},{"num":7,"verse":"And the word of the Lord increased; and the number of the disciples was multiplied in Jerusalem exceedingly: a great multitude also of the priests obeyed the faith."},{"num":8,"verse":"And Stephen, full of grace and fortitude, did great wonders and signs among the people."},{"num":9,"verse":"Now there arose some of that which is called the synagogue of the Libertines, and of the Cyrenians, and of the Alexandrians, and of them that were of Cilicia and Asia, disputing with Stephen."},{"num":10,"verse":"And they were not able to resist the wisdom and the spirit that spoke."},{"num":11,"verse":"Then they suborned men to say, they had heard him speak words of blasphemy against Moses and against God."},{"num":12,"verse":"And they stirred up the people, and the ancients, and the scribes; and running together, they took him, and brought him to the council."},{"num":13,"verse":"And they set up false witnesses, who said: This man ceaseth not to speak words against the holy place and the law."},{"num":14,"verse":"For we have heard him say, that this Jesus of Nazareth shall destroy this place, and shall change the traditions which Moses delivered unto us."},{"num":15,"verse":"And all that sat in the council, looking on him, saw his face as if it had been the face of an angel."}]