[{"header":"Seven Men Chosen for a Special Work"},{"num":6,"verse":"More and more people were becoming followers of Jesus. But during this same time, the Greek-speaking followers began to complain against the other Jewish followers. They said that their widows were not getting their share of what the followers received every day."},{"num":2,"verse":"The twelve apostles called the whole group of followers together."},{"num":3,"verse":"So, brothers and sisters, choose seven of your men who have a good reputation. They must be full of wisdom and the Spirit. We will give them this work to do."},{"num":4,"verse":"Then we can use all our time to pray and to teach the word of God.”"},{"num":5,"verse":"The whole group liked the idea. So they chose these seven men: Stephen (a man with great faith and full of the Holy Spirit), Philip, Prochorus, Nicanor, Timon, Parmenas, and Nicolaus (a man from Antioch who had become a Jew)."},{"num":6,"verse":"Then they put these men before the apostles, who prayed and laid their hands on them."},{"num":7,"verse":"The word of God was reaching more and more people. The group of followers in Jerusalem became larger and larger. Even a big group of Jewish priests believed and obeyed."},{"header":"Some Jews Against Stephen"},{"num":8,"verse":"Stephen received a great blessing. God gave him power to do great wonders and miraculous signs among the people."},{"num":9,"verse":"But some of the Jews there were from the synagogue of Free Men, as it was called. The group included Jews from Cyrene, Alexandria, Cilicia, and Asia. They started arguing with Stephen."},{"num":10,"verse":"But the Spirit was helping him speak with wisdom. His words were so strong that these Jews could not argue with him."},{"num":11,"verse":"So they told some men to say, “We heard Stephen say bad things against Moses and against God!”"},{"num":12,"verse":"By doing this, these Jews upset the people, the older Jewish leaders, and the teachers of the law. They became so angry that they came and grabbed Stephen and took him to a meeting of the high council."},{"num":13,"verse":"The Jews brought some men into the meeting to tell lies about Stephen. These men said, “This man is always saying things against this holy place and against the Law of Moses."},{"num":14,"verse":"We heard him say that Jesus from Nazareth will destroy this place and change what Moses told us to do.”"},{"num":15,"verse":"Everyone there in the council meeting was staring at Stephen. They saw that his face looked like the face of an angel."}]