[{"num":31,"verse":"But then he heard what Lavan’s sons were saying: “Ya‘akov has taken away everything that our father once had. It’s from what used to belong to our father that he has gotten so rich.” "},{"num":2,"verse":"He also saw that Lavan regarded him differently than before. "},{"num":3,"verse":"Adonai said to Ya‘akov, “Return to the land of your ancestors, to your kinsmen; I will be with you.” "},{"num":4,"verse":"So Ya‘akov sent for Rachel and Le’ah and had them come to the field where his flock was. "},{"num":5,"verse":"He said to them, “I see by the way your father looks that he feels differently toward me than before; but the God of my father has been with me. "},{"num":6,"verse":"You know that I have served your father with all my strength, "},{"num":7,"verse":"and that your father has belittled me and has changed my wages ten times; but God did not allow him to do me any damage. "},{"num":8,"verse":"If he said, ‘The speckled will be your wages,’ then all the animals gave birth to speckled young; and if he said, ‘The streaked will be your wages,’ then all the animals gave birth to streaked young. "},{"num":9,"verse":"This is how God has taken away your father’s animals and given them to me. "},{"num":10,"verse":"Once, when the animals were mating, I had a dream: I looked up and there in front of me the male goats which mated with the females were streaked, speckled and mottled. "},{"num":11,"verse":"Then, in the dream, the angel of God said to me, ‘Ya‘akov!’ and I replied, ‘Here I am.’ "},{"num":12,"verse":"He continued, ‘Raise your eyes now, and look: all the male goats mating with the females are streaked, speckled and mottled; for I have seen everything Lavan has been doing to you. "},{"num":13,"verse":"I am the God of Beit-El, where you anointed a standing-stone with oil, where you vowed your vow to me. Now get up, get out of this land, and return to the land where you were born.’” "},{"num":14,"verse":"Rachel and Le’ah answered him, “We no longer have any inheritance from our father’s possessions; "},{"num":15,"verse":"and he considers us foreigners, since he has sold us; moreover, he has consumed everything he received in exchange for us. "},{"num":16,"verse":"Nevertheless, the wealth which God has taken away from our father has become ours and our children’s anyway; so whatever God has told you to do, do.”"},{"num":17,"verse":"(vi) Then Ya‘akov got up, put his sons and wives on the camels, "},{"num":18,"verse":"and carried off all his livestock, along with all the riches he had accumulated, the livestock in his possession which he had acquired in Paddan-Aram, to go to Yitz’chak his father in the land of Kena‘an."},{"num":19,"verse":"Now Lavan had gone to shear his sheep, so Rachel stole the household idols that belonged to her father, "},{"num":20,"verse":"and Ya‘akov outwitted Lavan the Arami by not telling him of his intended flight. "},{"num":21,"verse":"So he fled with everything he had: he departed, crossed the [Euphrates] River and set out for the hill-country of Gil‘ad. "},{"num":22,"verse":"Not until the third day was Lavan told that Ya‘akov had fled."},{"num":23,"verse":"Lavan took his kinsmen with him and spent the next seven days pursuing Ya‘akov, overtaking him in the hill-country of Gil‘ad. "},{"num":24,"verse":"But God came to Lavan the Arami in a dream that night and said to him, “Be careful that you don’t say anything to Ya‘akov, either good or bad.”"},{"num":25,"verse":"When Lavan caught up with Ya‘akov, Ya‘akov had set up camp in the hill-country; so Lavan and his kinsmen set up camp in the hill-country of Gil‘ad. "},{"num":26,"verse":"Lavan said to Ya‘akov, “What do you mean by deceiving me and carrying off my daughters as if they were captives taken in war? "},{"num":27,"verse":"Why did you flee in secret and deceive me and not tell me? I would have sent you off with joy and singing to the music of tambourines and lyres. "},{"num":28,"verse":"You didn’t even let me kiss my sons and daughters good-bye! What a stupid thing to do! "},{"num":29,"verse":"I have it in my power to do you harm; but the God of your father spoke to me last night and said, ‘Be careful that you don’t say anything to Ya‘akov, either good or bad.’ "},{"num":30,"verse":"Granted that you had to leave, because you longed so deeply for your father’s house; but why did you steal my gods?” "},{"num":31,"verse":"Ya‘akov answered Lavan, “Because I was afraid. I said, ‘Suppose you take your daughters away from me by force?’ "},{"num":32,"verse":"But if you find your gods with someone, that person will not remain alive. So with our kinsmen to witness, if you spot anything that I have which belongs to you, take it back.” Ya‘akov did not know that Rachel had stolen them. "},{"num":33,"verse":"Lavan went into Ya‘akov’s tent, then into Le’ah’s tent and into the tent of the two slave-girls; but he did not find them. He left Le’ah’s tent and entered Rachel’s tent. "},{"num":34,"verse":"Now Rachel had taken the household gods, put them in the saddle of the camel and was sitting on them. Lavan felt all around the tent but did not find them. "},{"num":35,"verse":"She said to her father, “Please don’t be angry that I’m not getting up in your presence, but it’s the time of my period.” So he searched, but he didn’t find the household gods."},{"num":36,"verse":"Then Ya‘akov became angry and started arguing with Lavan. “What have I done wrong?” he demanded. “What is my offense, that you have come after me in hot pursuit? "},{"num":37,"verse":"You have felt around in all my stuff, but what have you found of all your household goods? Put it here, in front of my kinsmen and yours, so that they can render judgment between the two of us! "},{"num":38,"verse":"I have been with you for these twenty years! Your female sheep and goats haven’t aborted their young, and I haven’t eaten the male animals in your flocks. "},{"num":39,"verse":"If one of your flock was destroyed by a wild animal, I didn’t bring the carcass to you but bore the loss myself. You demanded that I compensate you for any animal stolen, whether by day or by night. "},{"num":40,"verse":"Here’s how it was for me: during the day thirst consumed me, and at night the cold — my sleep fled from my eyes. "},{"num":41,"verse":"These twenty years I’ve been in your house — I served you fourteen years for your two daughters and six years for your flock; and you changed my wages ten times! "},{"num":42,"verse":"If the God of my father, the God of Avraham, the one whom Yitz’chak fears, had not been on my side, by now you would certainly have already sent me away with nothing! God has seen how distressed I’ve been and how hard I’ve worked, and last night he passed judgment in my favor.”"},{"num":43,"verse":"(vii) Lavan answered Ya‘akov, “The daughters are mine, the children are mine, the flocks are mine, and everything you see is mine! But what can I do today about these daughters of mine or the children they have borne? "},{"num":44,"verse":"So now, come, let’s make a covenant, I and you; and let it stand as a testimony between me and you.” "},{"num":45,"verse":"Ya‘akov took a stone and set it upright as a standing-stone. "},{"num":46,"verse":"Then Ya‘akov said to his kinsmen, “Gather some stones”; and they took stones, made a pile of them and ate there by the pile of stones. "},{"num":47,"verse":"Lavan called it Y’gar-Sahaduta [“pile of witness” in Aramaic], while Ya‘akov called it Gal-‘Ed [“pile of witness” in Hebrew]."},{"num":48,"verse":"Lavan said, “This pile witnesses between me and you today.” This is why it is called Gal-‘Ed "},{"num":49,"verse":"and also HaMitzpah [the watchtower], because he said, “May Adonai watch between me and you when we are apart from each other. "},{"num":50,"verse":"If you cause pain to my daughters, or if you take wives in addition to my daughters, then, even if no one is there with us, still God is witness between me and you.” "},{"num":51,"verse":"Lavan also said to Ya‘akov, “Here is this pile, and here is this standing-stone, which I have set up between me and you. "},{"num":52,"verse":"May this pile be a witness, and may the standing-stone be a witness, that I will not pass beyond this pile to you, and you will not pass beyond this pile and this standing-stone to me, to cause harm. "},{"num":53,"verse":"May the God of Avraham and also the god of Nachor, the god of their father, judge between us.” But Ya‘akov swore by the One his father Yitz’chak feared. "},{"num":54,"verse":"Ya‘akov offered a sacrifice on the mountain and invited his kinsmen to the meal. They ate the food and spent the whole night on the mountain."}]