[{"header":"Jacob Leaves Laban"},{"num":31,"verse":"Jacob heard the words of Laban’s sons, saying, “Jacob has taken away all that our father had. He has become rich with what had belonged to our father.” "},{"num":2,"verse":"Jacob saw that Laban did not show him as much favor as he did before. "},{"num":3,"verse":"Then the Lord said to Jacob, “Return to the land of your fathers and to those of your family. And I will be with you.”"},{"num":4,"verse":"So Jacob called Rachel and Leah to come to his flock in the field. "},{"num":5,"verse":"He said to them, “I see that your father does not show me as much favor as he did before. But the God of my father has been with me. "},{"num":6,"verse":"You know that I have worked for your father with all my strength. "},{"num":7,"verse":"Yet your father has not been fair with me. He has changed my pay ten times. But God did not let him hurt me. "},{"num":8,"verse":"If he said, ‘The animals that have spots will be your pay,’ then all the flock gave birth to young ones with spots. If he said, ‘The animals with black marks will be your pay,’ then all the flock gave birth to young ones with black marks. "},{"num":9,"verse":"So God has taken away your father’s animals and has given them to me. "},{"num":10,"verse":"I had a dream at the time the flocks were mating. I looked up and saw that the male goats which were mating with the female goats had black marks and spots. "},{"num":11,"verse":"Then the angel of God said to me in the dream, ‘Jacob,’ and I said, ‘Here I am.’ "},{"num":12,"verse":"He said, ‘Look and see how all the male goats that are mating with the others have black marks and spots. For I have seen all that Laban has been doing to you. "},{"num":13,"verse":"I am the God of Bethel, where you set up a stone in honor to Me, and where you made a promise to Me. Now get up, leave this land, and return to the land of your birth.’”"},{"num":14,"verse":"Rachel and Leah answered him, “Do we still have any part or share in our father’s house? "},{"num":15,"verse":"Does he not think of us as strangers? For he has sold us. And he has used all the money that was paid for us. "},{"num":16,"verse":"All the riches that God has taken away from our father belong to us and our children. So do whatever God has told you to do.”"},{"num":17,"verse":"Then Jacob got up and put his children and his wives on camels. "},{"num":18,"verse":"He took away all his animals, all the riches he had gathered and all the cattle he had gathered in Paddan-aram. And he left to go to his father Isaac in the land of Canaan. "},{"num":19,"verse":"Laban had gone to cut the wool from his flock. And Rachel stole the gods of her father’s house. "},{"num":20,"verse":"Jacob fooled Laban the Syrian by not telling him that he was going. "},{"num":21,"verse":"So he left with all he had. He went and crossed the Euphrates River, and turned toward the hill country of Gilead."},{"header":"Laban Follows after Jacob"},{"num":22,"verse":"But Laban was told on the third day that Jacob had gone. "},{"num":23,"verse":"So he took the men of his family with him, and followed Jacob for seven days. He found him in the hill country of Gilead. "},{"num":24,"verse":"But God came to Laban the Syrian in a dream by night. He said to him, “Be careful that you do not speak good or bad to Jacob.”"},{"num":25,"verse":"Then Laban came to Jacob. Now Jacob had put up his tent in the hill country. Laban and the men of his family put up their tents in the hill country of Gilead. "},{"num":26,"verse":"Laban said to Jacob, “What do you mean by fooling me and carrying away my daughters as if they were taken by the sword? "},{"num":27,"verse":"Why did you leave in secret and fool me? Why did you not tell me, so I would have sent you away with joy and with songs and with sounds of joy on the timbrel and harp. "},{"num":28,"verse":"Why did you not let me kiss my grandchildren and daughters good-bye? Now you have been foolish. "},{"num":29,"verse":"I have the power to hurt you. But the God of your father spoke to me last night, saying, ‘Be careful not to speak good or bad to Jacob.’ "},{"num":30,"verse":"Now you have gone away because you had a desire for your father’s house. But why did you steal my gods?”"},{"num":31,"verse":"Jacob answered Laban, “Because I was afraid you might take your daughters from me and make them stay. "},{"num":32,"verse":"The one with whom you find your gods will not live. In front of those of our family, look for what I have that is yours, and take it.” For Jacob did not know that Rachel had stolen them."},{"num":33,"verse":"So Laban went into Jacob’s tent, and into Leah’s tent, and into the tent of the two women who served Rachel and Leah. But he did not find his gods. Then he went from Leah’s tent into Rachel’s tent. "},{"num":34,"verse":"Now Rachel had taken the gods of Laban’s house and put them in the seat that was used on the camel’s back. And she sat upon them. Laban looked through the whole tent, but did not find them. "},{"num":35,"verse":"She said to her father, “My lord, do not be angry that I cannot rise in front of you. For the way of women is upon me.” So he looked, but could not find the gods."},{"num":36,"verse":"Then Jacob became angry and argued with Laban. Jacob said to Laban, “What have I done wrong? What is my sin that made you run after me? "},{"num":37,"verse":"What things of your house have you found by looking through all that belongs to me? Set it here in front of my brothers and your brothers, so they may judge between us. "},{"num":38,"verse":"During these twenty years I have been with you, your female goats and sheep have not lost a young one. And I have not eaten the sheep of your flocks. "},{"num":39,"verse":"I did not bring to you those that were torn by wild animals. I took the loss upon myself. You had me pay for what was carried away during the day or during the night. "},{"num":40,"verse":"This is the way it was for me. I suffered from heat during the day, and from cold during the night. And I could not sleep. "},{"num":41,"verse":"I have been in your house twenty years. I worked for you fourteen years for your two daughters, and six years for your flock. And you changed my pay ten times. "},{"num":42,"verse":"If the God of my father, the God of Abraham and the fear of Isaac, had not been with me, for sure you would have sent me away with nothing. God has seen my suffering and the work of my hands. So He spoke sharp words to you last night.”"},{"num":43,"verse":"Laban answered Jacob, “The daughters are my daughters. The children are my children. And the flocks are my flocks. All that you see is mine. But what can I do today to these my daughters or to their children who were born to them? "},{"num":44,"verse":"So come now, let us make an agreement, you and I. And let us do something to show we have an agreement between us.”"},{"num":45,"verse":"So Jacob took a stone and set it up in honor of the agreement. "},{"num":46,"verse":"Then Jacob said to the men of his family, “Gather stones.” So they took stones and put them on top of each other. And they ate there by all the stones. "},{"num":47,"verse":"Laban gave the stones the name of Jegar-sahadutha. But Jacob gave them the name Galeed. "},{"num":48,"verse":"Laban said, “These stones are to stand for the agreement between you and me today.” So they were given the name Galeed. "},{"num":49,"verse":"They were given the name of Mizpah also. For Laban said, “May the Lord watch between you and me when we are apart from each other. "},{"num":50,"verse":"If you hurt my daughters, or if you take wives other than my daughters, no man may see it. But God sees what happens between you and me.” "},{"num":51,"verse":"Laban said to Jacob, “See these stones that have been set up between you and me. "},{"num":52,"verse":"These stones that have been set up will stand for our agreement. I will not pass by these stones to hurt you. And you will not pass by these stones to hurt me. "},{"num":53,"verse":"The God of Abraham, the God of Nahor, the God of their father, judge between us.” So Jacob promised by the fear of his father Isaac. "},{"num":54,"verse":"Then Jacob gave a gift in worship to God on the mountain. Then he called his brothers to eat bread. And they ate bread and stayed the night on the mountain."},{"num":55,"verse":"Laban got up early in the morning and kissed his grandchildren and daughters. He prayed that good would come to them. Then Laban left and returned home."}]