[{"header":"Jesus Heals a Man Who Had a Skin Disease"},{"num":8,"verse":"Jesus came down from the mountainside. Large crowds followed him. "},{"num":2,"verse":"A man who had a skin disease came and got down on his knees in front of Jesus. He said, “Lord, if you are willing to make me ‘clean,’ you can do it.”"},{"num":3,"verse":"Jesus reached out his hand and touched the man. “I am willing to do it,” he said. “Be ‘clean’!” Right away the man was healed of his skin disease. "},{"num":4,"verse":"Then Jesus said to him, “Don’t tell anyone. Go and show yourself to the priest, and offer the gift Moses commanded. It will be a witness to everyone.”"},{"header":"A Roman Commander Has Faith"},{"num":5,"verse":"When Jesus entered Capernaum, a Roman commander came to him. He asked Jesus for help. "},{"num":6,"verse":"“Lord,” he said, “my servant lies at home and can’t move. He is suffering terribly.”"},{"num":7,"verse":"Jesus said, “Shall I come and heal him?”"},{"num":8,"verse":"The commander replied, “Lord, I am not good enough to have you come into my house. But just say the word, and my servant will be healed. "},{"num":9,"verse":"I myself am a man under authority. And I have soldiers who obey my orders. I tell this one, ‘Go,’ and he goes. I tell that one, ‘Come,’ and he comes. I say to my slave, ‘Do this,’ and he does it.”"},{"num":10,"verse":"When Jesus heard this, he was amazed. He said to those following him, “What I’m about to tell you is true. In Israel I have not found anyone whose faith is so strong. "},{"num":11,"verse":"I say to you that many will come from the east and the west. They will take their places at the feast in the kingdom of heaven. They will sit with Abraham, Isaac and Jacob. "},{"num":12,"verse":"But those who think they belong in the kingdom will be thrown outside, into the darkness. There they will weep and grind their teeth.”"},{"num":13,"verse":"Then Jesus said to the Roman commander, “Go! It will be done just as you believed it would.” And his servant was healed at that moment."},{"header":"Jesus Heals Many People"},{"num":14,"verse":"When Jesus came into Peter’s house, he saw Peter’s mother-in-law. She was lying in bed. She had a fever. "},{"num":15,"verse":"Jesus touched her hand, and the fever left her. She got up and began to serve him."},{"num":16,"verse":"When evening came, many people controlled by demons were brought to Jesus. He drove out the spirits with a word. He healed all who were sick. "},{"num":17,"verse":"This happened so that what Isaiah the prophet had said would come true. He had said,"},{"header":"The Cost of Following Jesus"},{"num":18,"verse":"Jesus saw the crowd around him. So he gave his disciples orders to go to the other side of the Sea of Galilee. "},{"num":19,"verse":"Then a teacher of the law came to him. He said, “Teacher, I will follow you no matter where you go.”"},{"num":20,"verse":"Jesus replied, “Foxes have dens. Birds have nests. But the Son of Man has no place to lay his head.”"},{"num":21,"verse":"Another follower said to him, “Lord, first let me go and bury my father.”"},{"num":22,"verse":"But Jesus told him, “Follow me. Let the dead bury their own dead.”"},{"header":"Jesus Calms the Storm"},{"num":23,"verse":"Jesus got into a boat. His disciples followed him. "},{"num":24,"verse":"Suddenly a terrible storm came up on the lake. The waves crashed over the boat. But Jesus was sleeping. "},{"num":25,"verse":"The disciples went and woke him up. They said, “Lord! Save us! We’re going to drown!”"},{"num":26,"verse":"He replied, “Your faith is so small! Why are you so afraid?” Then Jesus got up and ordered the winds and the waves to stop. It became completely calm."},{"num":27,"verse":"The disciples were amazed. They asked, “What kind of man is this? Even the winds and the waves obey him!”"},{"header":"Jesus Heals Two Men Controlled by Demons"},{"num":28,"verse":"Jesus arrived at the other side of the lake in the area of the Gadarenes. Two men controlled by demons met him. They came from the tombs. The men were so wild that no one could pass that way. "},{"num":29,"verse":"“Son of God, what do you want with us?” they shouted. “Have you come here to punish us before the time for us to be judged?”"},{"num":30,"verse":"Not very far away, a large herd of pigs was feeding. "},{"num":31,"verse":"The demons begged Jesus, “If you drive us out, send us into the herd of pigs.”"},{"num":32,"verse":"Jesus said to them, “Go!” So the demons came out of the men and went into the pigs. The whole herd rushed down the steep bank. They ran into the lake and drowned in the water. "},{"num":33,"verse":"Those who were tending the pigs ran off. They went into the town and reported all this. They told the people what had happened to the men who had been controlled by demons. "},{"num":34,"verse":"Then the whole town went out to meet Jesus. When they saw him, they begged him to leave their area."}]