[{"header":"Two Healings"},{"num":8,"verse":"When Jesus came down from the hillside, large crowds followed him. "},{"num":2,"verse":"Suddenly someone with a virulent skin disease approached, and knelt down in front of him."},{"num":3,"verse":"Jesus stretched out his hand and touched him."},{"num":4,"verse":"‘Take care’, Jesus said to him, ‘that you don’t say anything to anyone. Instead, go and show yourself to the priest, and make the offering which Moses commanded. That will be a proof to them.’"},{"num":5,"verse":"Jesus went into Capernaum. A centurion came up and pleaded with him."},{"num":6,"verse":"‘Master,’ he said, ‘my servant is lying at home, paralysed. He’s in a very bad state.’"},{"num":7,"verse":"‘I’ll come and make him better,’ said Jesus."},{"num":8,"verse":"‘Master,’ replied the centurion, ‘I don’t deserve to have you come under my roof! Just say the word, and my servant will be healed. "},{"num":9,"verse":"I know what authority’s all about, you know – I’ve got soldiers answering to me, and I can say to one of them, “Go!” and he goes, and to another one, “Come here!” and he comes, and I can say, “Do this,” to my slave, and he does it!’"},{"num":10,"verse":"Jesus was fair amazed when he heard this."},{"num":11,"verse":"Let me tell you this: lots of people will come from East and West and join the great party of celebration with Abraham, Isaac and Jacob in the kingdom of heaven. "},{"num":12,"verse":"But the children of the kingdom will be thrown into outer darkness, where people will weep and gnash their teeth.’"},{"num":13,"verse":"Then he turned to the centurion."},{"header":"On Following Jesus"},{"num":14,"verse":"Jesus went into Peter’s house. There he saw Peter’s mother-in-law laid low with a fever. "},{"num":15,"verse":"He touched her hand. The fever left her, and she got up and waited on him."},{"num":16,"verse":"When evening came, they brought to him many people who were possessed by demons. He cast out the spirits with a word of command, and healed everyone who was sick. "},{"num":17,"verse":"This happened so that the word spoken by Isaiah the prophet might come true:"},{"num":18,"verse":"When Jesus saw the crowd all around him, he told them to go across to the other side of the lake. "},{"num":19,"verse":"A scribe came up and spoke to him."},{"num":20,"verse":"Foxes have their dens,’ replied Jesus, ‘and the birds in the sky have their nests. But the son of man has nowhere he can lay his head.’"},{"num":21,"verse":"‘Master,’ said another of his disciples, ‘let me first go and see to my father’s funeral.’"},{"num":22,"verse":"‘Follow me!’ replied Jesus. ‘And leave the dead to bury their own dead.’"},{"header":"The Calming of the Storm"},{"num":23,"verse":"So Jesus got into the boat, and his disciples followed him. "},{"num":24,"verse":"All of a sudden a great storm blew up on the sea, so that the boat was being swamped by the waves. Jesus, however, was asleep. "},{"num":25,"verse":"They came and woke him up."},{"num":26,"verse":"‘Why are you so scared, you little-faith lot?’ he replied."},{"num":27,"verse":"They were all astonished."},{"header":"The Healing of the Demoniacs"},{"num":28,"verse":"So he went across to the other side, to the region of the Gadarenes. Two demon-possessed men met him, coming out of the tombs. They were very violent and made it impossible for anyone to go along that road."},{"num":29,"verse":"‘What is it with us and you, son of God?’ they yelled. ‘Have you come here to torture us ahead of the time?’"},{"num":30,"verse":"Some way off from where they were there was a large herd of pigs feeding."},{"num":31,"verse":"‘If you cast us out,’ the demons begged Jesus, ‘send us into the herd of pigs!’"},{"num":32,"verse":"‘Off you go, then!’ said Jesus."},{"num":33,"verse":"The herdsmen took to their heels. They went off to the town and told the whole tale, including the bit about the demon-possessed men. "},{"num":34,"verse":"So the whole town came out to see Jesus for themselves. When they saw him, they begged him to leave their district."}]