[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joshua",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE NEW LEADER’S COMMISSIONJoshua 1:1 - Joshua 1:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE NEW LEADER’S COMMISSION",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The closest connection exists between Deuteronomy and Joshua. The narrative may be read as running on without a break. It turns away from the lonely grave up on the mountain to the bustling camp and the new leader. No man is indispensable. God’s work goes on uninterrupted. The instruments are changed, but the Master-hand is the same, and lays one tool aside and takes another out of the tool-chest as He will. Moses is dead,-what then? Does his death paralyse the march of the tribes? No; it is but the ground for the ringing command, ‘Therefore arise, go over this Jordan.’ The immediate installation of his successor, and the uninterrupted continuance of the advance, do not mean that Moses is not honoured or is forgotten, for the narrative lovingly links his honorific title, ‘the servant of the Lord,’ with the mention of his death; and God Himself does the same, for he is thrice referred to in the divine command to Joshua, as the recipient of the promise of the conquest, as the example of the highest experience of God’s all-sufficing companionship, and as the medium by which Israel received the law. Joshua steps into the empty place, receives the same great promise, is assured of the same Presence, and is to obey the same law. The change of leaders is great, but nothing else is changed; and even it is not so great as faint hearts in their sorrow are apt to think, for the real Leader lives, and Moses and Joshua alike are but the transmitters of His orders and His aids to Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The first command given to Joshua was a trial of his faith, for ‘Jordan was in flood’ {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "},-and how was that crowd to get across, when fords were impassable and ferry-boats were wanting, to say nothing of the watchful eyes that were upon them from the other bank? To cross a stream in the face of the enemy is a ticklish operation, even for modern armies; what must it have been, then, for Joshua and his horde? Not a hint is given him as to the means by which the crossing is to be made possible. He has Jehovah’s command to do it, and Jehovah’s promise to be with him, and that is to be enough. We too have sometimes to face undertakings which we cannot see how to carry through; but if we do see that the path is one appointed by God, and will boldly tread it, we may be quite sure that, when we come to what at present seems like a mountain wall across it, we shall find that the glen opens as we advance, and that there is a way,-narrow, perhaps, and dangerous, but practicable. ‘One step enough for me’ should be our motto. We may trust God not to command impossibilities, nor to lead us into a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cul de sac",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The promise to Moses {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} is repeated almost verbally in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The boundaries of the land are summarily given as from ‘the wilderness’ in the south to ‘this Lebanon’ in the north, and from the Euphrates in the east to the Mediterranean in the west. ‘The land of the Hittites’ is not found in the original passage in Deuteronomy, and it seems to be a designation of the territory between Lebanon and the Euphrates, which we now know to have been the seat of the northern Hittites, while the southern branch was planted round Hebron and the surrounding district. But these wide boundaries were not attained till late in the history, and were not long retained. Did the promise, then, fail? No, for it, like all the promises, was contingent on conditions, and Israel’s unfaithfulness cut short its extent of territory. We, too, fail to possess all the land destined for us. Our charter is much wider than our actual wealth. God gives more than we take, and we are content to occupy but a corner of the broad land which He has given us. In like manner Joshua did not realise to the full the following promise of uniform victory, but was defeated at Ai and elsewhere. The reason was the same,-the faithlessness of the people. Unbelief and sin turn a Samson into a weakling, and make Israel flee before the ranks of the Philistines.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The great encouragement given to Joshua in entering on his hard and perilous enterprise is twice repeated here: ‘As I was with Moses, so will I be with thee.’ Did Joshua remember how, nearly forty years since, he had fronted the mob of cowards with the very same assurance, and how the answer had been a shower of stones? The cowards are all dead,-will their sons believe the assurance now? If we do believe that God is with us, we shall be ready to cross Jordan in flood, and to meet the enemies that are waiting on the other bank. If we do not, we shall not dare greatly, nor succeed in what we attempt. The small successes of material wealth and gratified ambition may be ours, but for all the higher duties and nobler conflicts that become a man, the condition of achievement and victory is steadfast faith in God’s presence and help.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That assurance-which we may all have if we cling to Jesus, in whom God comes to be with every believing soul-is the only basis on which the command to Joshua, thrice repeated, can wisely or securely be rested. It is mockery to say to a man conscious of weakness, and knowing that there are evils which must surely come, and evils which may possibly come, against which he is powerless, ‘Don’t be afraid’ unless you can show him good reason why he need not be. And there is only one reason which can still reasonable dread in a human heart that has to front ‘all the ills that flesh is heir to,’ and sees behind them all the grim form of death. He ought to be afraid, unless-unless what? Unless he has heard and taken into his inmost soul the Voice that said to Joshua, ‘I will not fail thee, nor forsake thee: be strong and of a good courage,’ or, still more sweet and peace-bringing, the Voice that said to the frightened crew of the fishing-boat in the storm and the darkness,’ It is I; be not afraid.’ If we know that Christ is with us, it is wise to be strong and courageous; if we are meeting the tempest alone, the best thing we can do is to fear, for the fear may drive us to seek for His help, and He ever stretches out His hand to him who is afraid, as he ought to be, when he feels the cold water rising above his knees, and by his very fear is driven to faith, and cries, ‘Lord, save; I perish!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Courage that does not rest on Christ’s presence is audacity rather than courage, and is sure to collapse, like a pricked bladder, when the sharp point of a real peril comes in contact with it. If we sit down and reckon the forces that we have to oppose to the foes that we are sure to meet, we shall find ourselves unequal to the fight, and, if we are wise, shall ‘send the ambassage’ of a humble desire to the great King, who will come to our help with His all-conquering powers. Then, and only then, shall we be safe in saying,’ I will not fear what man can do unto me, or devils either,’ when we have said,’ In God have I put my trust,’ and have heard Him answering, ‘I will not fail thee, nor forsake thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:5-9 Joshua is to make the law of God his rule. He is charged to meditate therein day and night, that he might understand it. Whatever affairs of this world we have to mind, we must not neglect the one thing needful. All his orders to the people, and his judgments, must be according to the law of God. Joshua must himself be under command; no man's dignity or dominion sets him above the law of God. He is to encourage himself with the promise and presence of God. Let not the sense of thine own infirmities dishearten thee; God is all-sufficient. I have commanded, called, and commissioned thee to do it, and will be sure to bear thee out in it. When we are in the way of duty, we have reason to be strong and very bold. Our Lord Jesus, as Joshua here, was borne up under his sufferings by a regard to the will of God, and the commandment from his Father.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Prosper - See the margin. The literal rendering should be retained here since the notion of prosperity is separately introduced by a different word in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5-9. There shall not any man be able to stand before thee—Canaan was theirs by a divine grant; and the renewed confirmation of that grant to Joshua when about to lead the people into it, intimated not only a certain but an easy conquest. It is remarkable, however, that his courage and hope of victory were made to depend (see on [171]De 17:18) on his firm and inflexible adherence to the law of God, not only that regarding the extirpation of the Canaanites, but the whole divine code.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Have not I commanded thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I whom thou art obliged to obey; I who can carry thee through every thing I put thee upon; I of whose faithfulness and almightiness thou hast had large experience? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Have not I commanded thee?.... The above things, to go over Jordan with the people into the land of Canaan, and to observe the law of Moses in all things, and to be of good courage, which is again repeated; consider who it is that has given these orders and instructions, the great Jehovah, the everlasting I AM, who is faithful to his promises, and able to perform. The consideration of which would serve to animate him to the work he was called unto, to encourage his faith in God, to engage in his service cheerfully and readily: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "be strong, and of a good courage; See Gill on Joshua 1:6; See Gill on Joshua 1:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "be strong, and of a good courage; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "be not afraid, nor be thou dismayed; at his enemies, numerous and powerful, nor discouraged at anything in himself, any unfitness for such service, as he might think, or at any difficulties he might fear from the people he had the government of, and was to lead on; it was enough that the divine Presence was promised him, and which is repeated: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord thy God is with thee whithersoever thou goest: or, as the Targum of Jonathan,\"for thy help is the Word of the Lord thy God;''See Gill on Joshua 1:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the Lord thy God is with thee whithersoever thou goest: or, as the Targum of Jonathan,\"for thy help is the Word of the Lord thy God;''See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Have not I commanded thee? Be strong and of a good courage; be not afraid, neither be thou dismayed: for the LORD thy God is with thee whithersoever thou goest.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Have not I commanded thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "?] Observe the repetition of the words of exhortation. The Hebrew leader is reminded again and again that it was not his work but God’s work, which he had been raised up to carry out. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 31:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 31:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Joshua 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In conclusion, the Lord not only repeats His exhortation to firmness, but the promise that He gave in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Have I not\" (nonne) is a rhetorical mode of saying, \"Behold, I have,\" the assurance being clothed in the form of an affirmative question. On the words \"be not afraid,\" etc., see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 31:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 31:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]