[[],[{"type":"header","content":"Parables on Prayer"},{"type":"prose","content":"Now Jesus was telling the disciples a parable to make the point that at all times they ought to pray and not give up  lose heart, "}],[{"type":"prose","content":"saying,   [desperate]    [will be an intolerable annoyance and she]  "}],[{"type":"prose","content":"Then the Lord said,   [our just]  [His chosen ones]  [in providing justice]   [this kind of persistent] "}],[{"type":"header","content":"The Pharisee and the Tax Collector"},{"type":"prose","content":"He also told this parable to some people who trusted in themselves  were confident that they were righteous [posing outwardly as upright and in right standing with God], and who viewed others with contempt:  [enclosure]   [ostentatiously]  [in a self-righteous way, saying]:    [in humility and repentance],  [especially wicked]  [that I am]!’  [forgiven of the guilt of sin and placed in right standing with God]  [forsaking self-righteous pride] "}],[{"type":"prose","content":"Now they were also bringing their babies to Him, so that He would touch  bless them, and when the disciples noticed it, they  reprimanding them. "}],[{"type":"prose","content":"But Jesus called them to Himself, saying [to the apostles],   [with faith and humility] "}],[{"type":"header","content":"The Rich Young Ruler"},{"type":"prose","content":"A certain ruler asked Him, “Good Teacher [You who are essentially and morally good], what shall I do to inherit eternal life [that is, eternal salvation in the Messiah’s kingdom]?” "}],[{"type":"prose","content":"Jesus said to him,  [essentially and morally]   "}],[{"type":"prose","content":"He replied, “I have kept all these things from my youth.” "}],[{"type":"prose","content":"When Jesus heard this, He said to him,  [abundant]  [becoming My disciple, believing and trusting in Me and walking the same path of life that I walk].” "}],[{"type":"prose","content":"But when he heard these things, he became very sad, for he was extremely rich. "}],[{"type":"prose","content":"Jesus looked at him and said,   [who places his faith in wealth or status]  "}],[{"type":"prose","content":"And those who heard it said, “Then who can be saved?” "}],[{"type":"prose","content":"But He said, "}],[{"type":"prose","content":"Peter said, “Look, we have left all [things—homes, families, businesses] and followed You.” "}],[{"type":"prose","content":"And He said to them,  "}],[{"type":"prose","content":"Then taking the twelve [disciples] aside, He said to them,    [from the dead].” "}],[{"type":"prose","content":"But the disciples understood none of these things [about the approaching death and resurrection of Jesus]. This statement was hidden from them, and they did not grasp the [meaning of the] things that were said [by Jesus]."}],[{"type":"header","content":"Bartimaeus Receives Sight"},{"type":"prose","content":"As He was approaching Jericho [on His way to Jerusalem], it happened that a blind man was sitting beside the road begging. "}],[{"type":"prose","content":"Now when he heard a crowd going by, he  to ask what this was [about]. "}],[{"type":"prose","content":"They told him, “Jesus of Nazareth is passing by.” "}],[{"type":"prose","content":"So he shouted out, saying, “Jesus, Son of David (Messiah), have mercy on me!” "}],[{"type":"prose","content":"Those who were leading the way were sternly telling him to keep quiet; but he screamed all the more, “Son of David, have mercy on me!” "}],[{"type":"prose","content":"Then Jesus stopped and ordered that the blind man be led to Him; and when he came near, Jesus asked him,  He said, “Lord, let me regain my sight!” "}],[{"type":"prose","content":"Jesus said to him,  [personal trust and confident]  [in Me]  "}],[{"type":"prose","content":"Immediately he regained his sight and  following Jesus, glorifying  praising  honoring God. And all the people, when they saw it, praised God."}]]