[{"header":"A Widow and a Judge"},{"num":18,"verse":"Jesus told his disciples a story about how they should keep on praying and never give up:"},{"header":"A Pharisee and a Tax Collector"},{"num":9,"verse":"Jesus told a story to some people who thought they were better than others and who looked down on everyone else:"},{"num":14,"verse":"Then Jesus said, “When the two men went home, it was the tax collector and not the Pharisee who was pleasing to God. If you put yourself above others, you will be put down. But if you humble yourself, you will be honored.”"},{"header":"Jesus Blesses Little Children"},{"num":15,"verse":"Some people brought their little children for Jesus to bless. But when his disciples saw them doing this, they told the people to stop bothering him. "},{"num":16,"verse":"So Jesus called the children over to him and said, “Let the children come to me! Don’t try to stop them. People who are like these children belong to God’s kingdom. "},{"num":17,"verse":"You will never get into God’s kingdom unless you enter it like a child!”"},{"header":"A Rich and Important Man"},{"num":18,"verse":"An important man asked Jesus, “Good Teacher, what must I do to have eternal life?”"},{"num":19,"verse":"Jesus said, “Why do you call me good? Only God is good. "},{"num":20,"verse":"You know the commandments: ‘Be faithful in marriage. Do not murder. Do not steal. Do not tell lies about others. Respect your father and mother.’”"},{"num":21,"verse":"He told Jesus, “I have obeyed all these commandments since I was a young man.”"},{"num":22,"verse":"When Jesus heard this, he said, “There is one thing you still need to do. Go and sell everything you own! Give the money to the poor, and you will have riches in heaven. Then come and be my follower.” "},{"num":23,"verse":"When the man heard this, he was sad, because he was very rich."},{"num":24,"verse":"Jesus saw how sad the man was. So he said, “It’s terribly hard for rich people to get into God’s kingdom! "},{"num":25,"verse":"In fact, it’s easier for a camel to go through the eye of a needle than for a rich person to get into God’s kingdom.”"},{"num":26,"verse":"When the crowd heard this, they asked, “How can anyone ever be saved?”"},{"num":27,"verse":"Jesus replied, “There are some things that people cannot do, but God can do anything.”"},{"num":28,"verse":"Peter said, “Remember, we left everything to be your followers!”"},{"num":29,"verse":"Jesus answered, “You can be sure that anyone who gives up home or wife or brothers or family or children because of God’s kingdom "},{"num":30,"verse":"will be given much more in this life. And in the future world they will have eternal life.”"},{"header":"Jesus Again Tells about His Death"},{"num":31,"verse":"Jesus took the twelve apostles aside and said:"},{"num":34,"verse":"The apostles did not understand what Jesus was talking about. They could not understand, because the meaning of what he said was hidden from them."},{"header":"Jesus Heals a Blind Beggar"},{"num":35,"verse":"When Jesus was coming close to Jericho, a blind man sat begging beside the road. "},{"num":36,"verse":"The man heard the crowd walking by and asked what was happening. "},{"num":37,"verse":"Some people told him that Jesus from Nazareth was passing by. "},{"num":38,"verse":"So the blind man shouted, “Jesus, Son of David, have pity on me!” "},{"num":39,"verse":"The people who were going along with Jesus told the man to be quiet. But he shouted even louder, “Son of David, have pity on me!”"},{"num":40,"verse":"Jesus stopped and told some people to bring the blind man over to him. When the blind man was getting near, Jesus asked, "},{"num":41,"verse":"“What do you want me to do for you?”"},{"num":42,"verse":"Jesus replied, “Look and you will see! Your eyes are healed because of your faith.” "},{"num":43,"verse":"Right away the man could see, and he went with Jesus and started thanking God. When the crowds saw what happened, they praised God."}]