[[],[{"type":"header","content":"Parables on Prayer"},{"type":"prose","content":"Now He was telling them a parable to show that at all times they ought to pray and not become discouraged,"}],[{"type":"prose","content":"saying, "}],[{"type":"prose","content":"And the Lord said, "},{"type":"header","content":"The Pharisee and the Tax Collector"}],[{"type":"prose","content":"Now He also told this parable to some people who trusted in themselves that they were righteous, and viewed others with contempt:"}],[{"type":"prose","content":"Now they were bringing even their babies to Him so that He would touch them; but when the disciples saw , they  rebuking them."}],[{"type":"prose","content":"But Jesus called for the little ones, saying, "},{"type":"header","content":"The Rich Young Ruler"}],[{"type":"prose","content":"A ruler questioned Him, saying, “Good Teacher, what shall I do to inherit eternal life?”"}],[{"type":"prose","content":"But Jesus said to him, "}],[{"type":"prose","content":"And he said, “All these things I have kept since  youth.”"}],[{"type":"prose","content":"Now when Jesus heard , He said to him, "}],[{"type":"prose","content":"But when he had heard these things, he became very sad, for he was extremely wealthy."}],[{"type":"prose","content":"And Jesus looked at him and said, "}],[{"type":"prose","content":"Those who heard  said, “And  who can be saved?”"}],[{"type":"prose","content":"But He said, "}],[{"type":"prose","content":"Peter said, “Behold, we have left our own homes and followed You.”"}],[{"type":"prose","content":"And He said to them, "}],[{"type":"prose","content":"Now He took the twelve aside and said to them, "}],[{"type":"prose","content":"The disciples understood none of these things, and  this statement was hidden from them, and they did not comprehend the things that were said."},{"type":"header","content":"Bartimaeus Receives Sight"}],[{"type":"prose","content":"Now as Jesus was approaching Jericho, a man who was blind was sitting by the road, begging."}],[{"type":"prose","content":"But when he heard a crowd going by, he  inquiring what this was."}],[{"type":"prose","content":"They told him that Jesus of Nazareth was passing by."}],[{"type":"prose","content":"And he called out, saying, “Jesus, Son of David, have mercy on me!”"}],[{"type":"prose","content":"Those who led the way were sternly telling him to be quiet; but he kept crying out all the more, “Son of David, have mercy on me!”"}],[{"type":"prose","content":"And Jesus stopped and commanded that he be brought to Him; and when he came near, He asked him, And he said, “Lord,  to regain my sight!”"}],[{"type":"prose","content":"And Jesus said to him, "}],[{"type":"prose","content":"And immediately he regained his sight and  following Him, glorifying God; and when all the people saw , they gave praise to God."}]]