[{"header":"Parables on Prayer"},{"num":18,"verse":"Now He was telling them a parable to show that at all times they ought to pray and not to lose heart,"},{"num":2,"verse":"saying, “In a certain city there was a judge who did not fear God and did not respect man."},{"num":6,"verse":"And the Lord said, “Hear what the unrighteous judge *said;"},{"header":"The Pharisee and the Publican"},{"num":9,"verse":"And He also told this parable to some people who trusted in themselves that they were righteous, and viewed others with contempt:"},{"num":15,"verse":"And they were bringing even their babies to Him so that He would touch them, but when the disciples saw it, they began rebuking them."},{"num":16,"verse":"But Jesus called for them, saying, “Permit the children to come to Me, and do not hinder them, for the kingdom of God belongs to such as these."},{"header":"The Rich Young Ruler"},{"num":18,"verse":"A ruler questioned Him, saying, “Good Teacher, what shall I do to inherit eternal life?”"},{"num":19,"verse":"And Jesus said to him, “Why do you call Me good? No one is good except God alone."},{"num":21,"verse":"And he said, “All these things I have kept from my youth.”"},{"num":22,"verse":"When Jesus heard this, He said to him, “One thing you still lack; sell all that you possess and distribute it to the poor, and you shall have treasure in heaven; and come, follow Me.”"},{"num":23,"verse":"But when he had heard these things, he became very sad, for he was extremely rich."},{"num":24,"verse":"And Jesus looked at him and said, “How hard it is for those who are wealthy to enter the kingdom of God!"},{"num":26,"verse":"They who heard it said, “Then who can be saved?”"},{"num":27,"verse":"But He said, “The things that are impossible with people are possible with God.”"},{"num":28,"verse":"Peter said, “Behold, we have left our own homes and followed You.”"},{"num":29,"verse":"And He said to them, “Truly I say to you, there is no one who has left house or wife or brothers or parents or children, for the sake of the kingdom of God,"},{"num":31,"verse":"Then He took the twelve aside and said to them, “Behold, we are going up to Jerusalem, and all things which are written through the prophets about the Son of Man will be accomplished."},{"num":34,"verse":"But the disciples understood none of these things, and the meaning of this statement was hidden from them, and they did not comprehend the things that were said."},{"header":"Bartimaeus Receives Sight"},{"num":35,"verse":"As Jesus was approaching Jericho, a blind man was sitting by the road begging."},{"num":36,"verse":"Now hearing a crowd going by, he began to inquire what this was."},{"num":37,"verse":"They told him that Jesus of Nazareth was passing by."},{"num":38,"verse":"And he called out, saying, “Jesus, Son of David, have mercy on me!”"},{"num":39,"verse":"Those who led the way were sternly telling him to be quiet; but he kept crying out all the more, “Son of David, have mercy on me!”"},{"num":40,"verse":"And Jesus stopped and commanded that he be brought to Him; and when he came near, He questioned him,"},{"num":42,"verse":"And Jesus said to him, “Receive your sight; your faith has made you well.”"},{"num":43,"verse":"Immediately he regained his sight and began following Him, glorifying God; and when all the people saw it, they gave praise to God."}]