[[],[{"type":"header","content":"Remembering Israel’s Wanderings"},{"type":"prose","content":"“Then we turned around and headed back across the wilderness toward the Red Sea, just as the LORD had instructed me, and we wandered around in the region of Mount Seir for a long time."}],[{"type":"prose","content":"“Then at last the LORD said to me,"}],[{"type":"prose","content":"‘You have been wandering around in this hill country long enough; turn to the north."}],[{"type":"prose","content":"Give these orders to the people: “You will pass through the country belonging to your relatives the Edomites, the descendants of Esau, who live in Seir. The Edomites will feel threatened, so be careful."}],[{"type":"prose","content":"Do not bother them, for I have given them all the hill country around Mount Seir as their property, and I will not give you even one square foot of their land."}],[{"type":"prose","content":"If you need food to eat or water to drink, pay them for it."}],[{"type":"prose","content":"For the LORD your God has blessed you in everything you have done. He has watched your every step through this great wilderness. During these forty years, the LORD your God has been with you, and you have lacked nothing.”’"}],[{"type":"prose","content":"“So we bypassed the territory of our relatives, the descendants of Esau, who live in Seir. We avoided the road through the Arabah Valley that comes up from Elath and Ezion-geber.“Then as we turned north along the desert route through Moab,"}],[{"type":"prose","content":"the LORD warned us, ‘Do not bother the Moabites, the descendants of Lot, or start a war with them. I have given them Ar as their property, and I will not give you any of their land.’”"}],[{"type":"prose","content":"(A race of giants called the Emites had once lived in the area of Ar. They were as strong and numerous and tall as the Anakites, another race of giants."}],[{"type":"prose","content":"Both the Emites and the Anakites are also known as the Rephaites, though the Moabites call them Emites."}],[{"type":"prose","content":"In earlier times the Horites had lived in Seir, but they were driven out and displaced by the descendants of Esau, just as Israel drove out the people of Canaan when the LORD gave Israel their land.)"}],[{"type":"prose","content":"Moses continued, “Then the LORD said to us, ‘Get moving. Cross the Zered Brook.’ So we crossed the brook."}],[{"type":"prose","content":"“Thirty-eight years passed from the time we first left Kadesh-barnea until we finally crossed the Zered Brook! By then, all the men old enough to fight in battle had died in the wilderness, as the LORD had vowed would happen."}],[{"type":"prose","content":"The LORD struck them down until they had all been eliminated from the community."}],[{"type":"prose","content":"“When all the men of fighting age had died,"}],[{"type":"prose","content":"the LORD said to me,"}],[{"type":"prose","content":"‘Today you will cross the border of Moab at Ar"}],[{"type":"prose","content":"and enter the land of the Ammonites, the descendants of Lot. But do not bother them or start a war with them. I have given the land of Ammon to them as their property, and I will not give you any of their land.’”"}],[{"type":"prose","content":"(That area was once considered the land of the Rephaites, who had lived there, though the Ammonites call them Zamzummites."}],[{"type":"prose","content":"They were also as strong and numerous and tall as the Anakites. But the LORD destroyed them so the Ammonites could occupy their land."}],[{"type":"prose","content":"He had done the same for the descendants of Esau who lived in Seir, for he destroyed the Horites so they could settle there in their place. The descendants of Esau live there to this day."}],[{"type":"prose","content":"A similar thing happened when the Caphtorites from Crete invaded and destroyed the Avvites, who had lived in villages in the area of Gaza.)"}],[{"type":"prose","content":"Moses continued, “Then the LORD said, ‘Now get moving! Cross the Arnon Gorge. Look, I will hand over to you Sihon the Amorite, king of Heshbon, and I will give you his land. Attack him and begin to occupy the land."}],[{"type":"prose","content":"Beginning today I will make people throughout the earth terrified because of you. When they hear reports about you, they will tremble with dread and fear.’”"}],[{"type":"header","content":"Victory over Sihon of Heshbon"},{"type":"prose","content":"Moses continued, “From the wilderness of Kedemoth I sent ambassadors to King Sihon of Heshbon with this proposal of peace:  "}],[{"type":"prose","content":"“But King Sihon of Heshbon refused to allow us to pass through, because the LORD your God made Sihon stubborn and defiant so he could help you defeat him, as he has now done."}],[{"type":"prose","content":"“Then the LORD said to me, ‘Look, I have begun to hand King Sihon and his land over to you. Begin now to conquer and occupy his land.’"}],[{"type":"prose","content":"“Then King Sihon declared war on us and mobilized his forces at Jahaz."}],[{"type":"prose","content":"But the LORD our God handed him over to us, and we crushed him, his sons, and all his people."}],[{"type":"prose","content":"We conquered all his towns and completely destroyed everyone—men, women, and children. Not a single person was spared."}],[{"type":"prose","content":"We took all the livestock as plunder for ourselves, along with anything of value from the towns we ransacked."}],[{"type":"prose","content":"“The LORD our God also helped us conquer Aroer on the edge of the Arnon Gorge, and the town in the gorge, and the whole area as far as Gilead. No town had walls too strong for us."}],[{"type":"prose","content":"However, we avoided the land of the Ammonites all along the Jabbok River and the towns in the hill country—all the places the LORD our God had commanded us to leave alone."}]]