[{"num":2,"verse":"And we went forth from thence, and came into the wilderness that leadeth to the Red Sea, as the Lord said to me; and we compassed the hill of Seir in long time. (And we went forth from there, and came to the wilderness that leadeth to the Red Sea, as the Lord said to me; and we marched around the hill country of Seir for a long time.)"},{"num":2,"verse":"And (then) the Lord said to me,"},{"num":3,"verse":"It sufficeth to you to compass this hill; go ye against the north. (It sufficeth for you to have gone around these hills long enough; now go ye to the north.)"},{"num":4,"verse":"And command thou to the people, and say, Ye shall pass by the terms of your brethren, the sons of Esau, that dwell in Seir, and they shall dread you. Therefore see ye diligently, (And command thou to the people, and say, Ye shall pass by the borders, or the territory, of your brothers, the sons of Esau, who live in Seir, and they shall fear you. And so see ye diligently,)"},{"num":5,"verse":"that ye be not moved against them; for I shall not give to you of their land as much as the step of one foot may tread, for I have given the hill of Seir into the possession of Esau. (that ye go not against them; for I shall not give you any of their land, not as much as the step of one foot can tread, for I have given the hill country of Seir to the sons of Esau for a possession.)"},{"num":6,"verse":"Ye shall buy of them meats for money, and ye shall eat; and ye shall draw, and drink water bought. (Ye shall buy food from them with your money, and then ye shall eat; and ye shall buy some water, and drink it.)"},{"num":7,"verse":"Thy Lord God hath blessed thee in all the works of thine hands; he hath known thy way, how thou hast passed this most wilderness, by forty years; and thy Lord God dwelled with thee, and nothing failed to thee. (The Lord thy God hath blessed thee in all the works of thy hands; he hath known thy way, how thou hast passed through this great wilderness for forty years; and the Lord thy God hath been with thee, and thou hast lacked nothing.)"},{"num":8,"verse":"And when we had passed by our brethren, the sons of Esau, that dwelled in Seir, by the way of the field of Elath, and of Eziongaber, we came to the way that leadeth into the desert, (or the wilderness,) of Moab."},{"num":9,"verse":"And the Lord said to me, Fight thou not against Moabites, neither begin thou battle against them; for I shall not give to thee anything of their land, for I have given Ar into possession to the sons of Lot (for I have given Ar to the sons of Lot for a possession)."},{"num":10,"verse":"Emim were the first dwellers thereof, a great people, and strong, and so high, (The Emims were the first inhabitants there, a great and strong people, and so tall,)"},{"num":11,"verse":"that they were believed to be as giants, of the generation of Anakim, and they were like the sons of Anakim; forsooth Moabites call them Emim (but the Moabites call them the Emims)."},{"num":12,"verse":"Soothly Horims dwelled before in Seir, and when they were put out, and were done away, the sons of Esau dwelled there, as Israel did in the land of his possession, which the Lord gave to him. (And the Horims lived there before in Seir, and when they were put out, and were done away, then the sons of Esau lived there, like the Israelites did in the land of their possession, which the Lord gave to them.)"},{"num":13,"verse":"Therefore we rose up, that we should pass the strand of Zered, and we came to it. (And so we rose up, and went out, and crossed over the Zered River.)"},{"num":14,"verse":"Soothly the time in which we went from Kadeshbarnea till to the passing of the strand of Zered, was of eight and thirty years (And the time it took us to go from Kadeshbarnea until we crossed over the Zered River, was thirty-eight years), till all the generation of fighting men was wasted from their tents, as the Lord had sworn;"},{"num":15,"verse":"whose hand was against them, (so) that they should perish from the midst of their tents."},{"num":16,"verse":"Soothly after that all the fighters had fallen down, (And when all the fighting men had died,)"},{"num":17,"verse":"the Lord spake to me, and said,"},{"num":18,"verse":"Thou shalt pass today the coasts of Moab, (by) the city, Ar by name, (Today, thou shalt cross over the border of Moab, by the city of Ar,)"},{"num":19,"verse":"and thou shalt nigh into the coasts of the sons of Ammon; be thou ware that thou fight not against them, nor be moved to battle; for I shall not give to thee of the land of the sons of Ammon, for I have given it to the sons of Lot into possession. (and thou shalt come near to the land of the Ammonites; be thou careful that thou do not fight against them, nor go into battle with them; for I shall not give thee any of the land of the Ammonites, for I have given it to the sons of Lot for a possession.)"},{"num":20,"verse":"It is reckoned the land of giants, and giants inhabited therein sometime, which giants Ammonites call Zamzummims; (It is reckoned the land of giants, and giants lived there sometime ago, whom the Ammonites called the Zamzummims;)"},{"num":21,"verse":"a much people, and great, and of noble length, as Anakim, which the Lord did away from the face of them, and made them to dwell (there) for those giants, (a great and numerous people, and as tall as the Anakim, whom the Lord did away from there, and then allowed the Ammonites to live there instead of those giants,)"},{"num":22,"verse":"as he did to the sons of Esau, that dwelled in Seir, and did away Horims, and gave to them the land of Horims, which the sons of Esau wield till into present time. (as he did for the sons of Esau, who lived in Seir, for he did away the Horims, and gave the land of the Horims to the sons of Esau, which they possess unto this present time.)"},{"num":23,"verse":"Also men of Cappadocia putted out Avims, that dwelled in Hazerim, till to Gaza; which went out from Cappadocia, and did away Avims, and dwelled there for them. (And the men of Caphtor put out the Avims, who lived in Hazerim, unto Gaza; yea, they went out from Caphtor, and did away the Avims, and lived there in their place.)"},{"num":24,"verse":"Rise ye, and pass ye the strand of Arnon; lo! I have betaken in(to) thine hand Sihon, king of Heshbon, of Amorites; and his land begin thou to wield, and smite thou battle against him. (So rise ye up, and cross ye over the Arnon River; lo! I have delivered Sihon, the king of Heshbon, of the Amorites, and his land, into thy hands; now begin thou to possess it, and make thou battle against him.)"},{"num":25,"verse":"Today I shall begin to send thy dread, and thy fear into the peoples that dwell under all heaven (Today I shall begin to put the dread and the fear of thee into all the peoples who live under heaven), (so) that when thy name is heard, they dread, and tremble, by the manner of women travailing of child, and be holden with sorrow."},{"num":26,"verse":"Therefore I sent messengers from the wilderness of Kedemoth to Sihon, king of Heshbon; and I said with peaceable words (and I said with these words of peace),"},{"num":27,"verse":"We shall pass through thy land, we shall go in the common way; we shall not bow neither to the right side, nor to the left side. (We desire to pass through thy land, and we shall go by the common way; we shall not turn to the right, nor to the left.)"},{"num":28,"verse":"Sell thou us meats for price, that we eat; give thou us water for money, and so we shall drink. Only it is that we ask of thee that thou grant passage to us, (Sell thou food to us for money, so that we can eat; and sell thou water to us for money, so that we can drink. All that we ask of thee is that thou grant passage to us,)"},{"num":29,"verse":"as the sons of Esau did, that dwell in Seir, and the Moabites, that dwell in Ar, till we come to (the) Jordan, and pass to the land which our Lord God shall give to us. (as the sons of Esau did, who live in Seir, and the Moabites, who live in Ar, until we come to the Jordan River, and then cross over to the land which the Lord our God shall give to us.)"},{"num":30,"verse":"And Sihon, king of Heshbon, would not give passage to us; for thy Lord God made hard his spirit, and made firm in evil the heart of him, that he should be betaken into thine hands, as thou seest now. (But Sihon, the king of Heshbon, would not grant us passage; for the Lord thy God made his spirit hard, and his heart firm in evil, so that he would be delivered into thy hands, as thou now seest that he is.)"},{"num":31,"verse":"And the Lord said to me, Lo, I have begun to betake to thee Sihon, and his land; begin thou to wield it. (And the Lord said to me, Lo! I have now begun to deliver unto thee Sihon, and his land; begin thou to possess it.)"},{"num":32,"verse":"And Sihon went out against us with all his people, to battle in Jahaz (to do battle at Jahaz)."},{"num":33,"verse":"And our Lord God betook him to us, and we have smitten him (and we struck him down), with his sons, and all his people."},{"num":34,"verse":"And we took in that time all the cities, when the dwellers of those cities, men, and women, and children, were slain; we left not in them anything, (And we took all their cities at that time, and the inhabitants of those cities, the men, and women, and children, were all killed; we left nothing in them,)"},{"num":35,"verse":"except beasts that fell into the part of men taking prey (except for the beasts which we took as prey), and except (for the) spoils of the cities which we (also) took."},{"num":36,"verse":"From Aroer, which is on the brink of the strand of Arnon, from the town which is set in the valley, unto Gilead, no town was, nor city, that escaped our hands. Our Lord God betook all to us; (From Aroer, which is on the bank of the Arnon River, and from the town which is set in the valley, unto Gilead, there was no town, or city, that escaped our hands. The Lord our God delivered all of them to us;)"},{"num":37,"verse":"except the land of the sons of Ammon, to which land we nighed not, and all things that lie to the strand of Jabbok, and except the cities of the mountains, and all the places from which our Lord God forbade us. (except for the land of the Ammonites, which land we did not even come near to, and all the places that be along the Jabbok River, and except for the cities in the mountains, and all the places to which the Lord our God forbade us to go.)"}]