[{"header":"Chapter 1"},{"num":1,"verse":"Since many different individuals have undertaken the task to set down an account of the events that have been fulfilled among us,"},{"num":2,"verse":"in accordance with their transmission to us by those who were eyewitnesses and ministers of the word from the beginning,"},{"num":3,"verse":"I too, after researching all the evidence anew with great care, have decided to write an orderly account for you, Theophilus, who are so greatly revered,"},{"num":4,"verse":"so that you may learn the unquestioned authenticity of the teachings you have received."},{"num":8,"verse":"On one occasion, when his division was on duty and he was exercising his priestly office before God,"},{"num":9,"verse":"he was designated by lot to enter the sanctuary of the Lord and offer incense."},{"num":10,"verse":"At the hour of the offering of incense, all the people were outside, praying."},{"num":11,"verse":"Then there appeared to him the angel of the Lord, standing to the right of the altar of incense."},{"num":12,"verse":"When Zechariah beheld him, he was terrified and overcome with fear."},{"num":13,"verse":"But the angel said to him, “Do not be afraid, Zechariah, for your prayer has been heard. Your wife Elizabeth will bear for you a son, and you shall name him John."},{"num":14,"verse":"He will be a source of joy and delight to you, and many will rejoice at his birth,"},{"num":15,"verse":"for he will be great in the sight of the Lord."},{"num":18,"verse":"Zechariah said to the angel, “How can I be assured of this? For I am an old man and my wife is well past the stage of giving birth.”"},{"num":19,"verse":"The angel replied, “I am Gabriel. I stand in the presence of God, and I have been sent to speak to you and to convey to you this good news."},{"num":20,"verse":"But now, because you did not believe my words, which will be fulfilled at their appointed time, you will lose your power of speech and will become mute until the day that these things take place.”"},{"num":21,"verse":"Meanwhile, the people were waiting for Zechariah and were surprised that he was delaying so long in the sanctuary."},{"num":22,"verse":"When he did emerge, he could not speak to them, and they realized that he had seen a vision while he was in the sanctuary. He was only able to make signs to them, but he remained unable to speak."},{"num":23,"verse":"When his term of service was completed, he returned home."},{"num":24,"verse":"Shortly thereafter his wife Elizabeth conceived, and she remained in seclusion for five months, saying,"},{"num":25,"verse":"“The Lord has granted me this blessing, looking favorably upon me and removing from me the humiliation I have endured among my people.”"},{"num":26,"verse":"Announcement of the Birth of Jesus. In the sixth month, the angel Gabriel was sent by God to a town in Galilee called Nazareth,"},{"num":27,"verse":"to a virgin betrothed to a man named Joseph, of the house of David. The virgin’s name was Mary."},{"num":28,"verse":"The angel came to her and said, “Hail, full of grace! The Lord is with you.”"},{"num":29,"verse":"But she was greatly troubled by his words and wondered in her heart what this salutation could mean."},{"num":30,"verse":"Then the angel said to her, “Do not be afraid, Mary, for you have found favor with God."},{"num":31,"verse":"Behold, you will conceive in your womb and bear a son, and you will name him Jesus."},{"num":32,"verse":"He will be great and will be called Son of the Most High. The Lord God will give him the throne of his ancestor David."},{"num":33,"verse":"He will rule over the house of Jacob forever, and of his kingdom there will be no end.”"},{"num":34,"verse":"Mary said to the angel, “How will this be, since I am a virgin?”"},{"num":35,"verse":"The angel answered, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you. Therefore, the child to be born will be holy, and he will be called the Son of God."},{"num":36,"verse":"And behold, your cousin Elizabeth in her old age has also conceived a son, and she who was called barren is now in her sixth month,"},{"num":37,"verse":"for nothing will be impossible for God.”"},{"num":38,"verse":"Then Mary said, “Behold, I am the servant of the Lord. Let it be done to me according to your word.” After this, the angel departed from her."},{"num":39,"verse":"Mary Visits Elizabeth. In those days, Mary set out and journeyed in haste into the hill country to a town of Judah"},{"num":40,"verse":"where she entered the house of Zechariah and greeted Elizabeth."},{"num":41,"verse":"When Elizabeth heard Mary’s greeting, the baby leaped in her womb."},{"num":46,"verse":"The Canticle of Mary. And Mary said:"},{"num":56,"verse":"Mary remained with Elizabeth for about three months and then returned to her home."},{"num":57,"verse":"The Birth of John. When the time came for Elizabeth to give birth, she bore a son."},{"num":58,"verse":"Her neighbors and relatives heard that the Lord had shown his great mercy to her, and they shared in her rejoicing."},{"num":59,"verse":"On the eighth day, when they came to circumcise the child, they were going to name him Zechariah after his father."},{"num":60,"verse":"However, his mother objected. “No,” she said. “He is to be called John.”"},{"num":61,"verse":"They said to her, “There is no one in your family who has this name.”"},{"num":62,"verse":"They then made signs to his father to ask what name he wanted to be given to the child."},{"num":63,"verse":"He asked for a writing tablet, and he wrote: “His name is John.” They were all filled with wonder."},{"num":64,"verse":"Immediately, his mouth was opened and his tongue was freed, and he began to speak, giving praise to God."},{"num":65,"verse":"All their neighbors were overcome with awe, and all these things were related throughout the entire hill country of Judea."},{"num":66,"verse":"All who heard them were deeply impressed, and they wondered, “What then is this child going to be?” For the hand of the Lord was with him."},{"num":67,"verse":"The Canticle of Zechariah. Then the child’s father Zechariah was filled with the Holy Spirit and prophesied:"},{"num":80,"verse":"The Son of the Wilderness. The child grew and became strong in spirit. He lived in the wilderness until the day he appeared publicly to Israel."}]