[{"header":"Luke Writes an Orderly Report"},{"num":1,"verse":"Many people have attempted to write about the things that have taken place among us. "},{"num":2,"verse":"Reports of these things were handed down to us. There were people who saw these things for themselves from the beginning. They saw them and then passed the word on. "},{"num":3,"verse":"With this in mind, I myself have carefully looked into everything from the beginning. So I also decided to write down an orderly report of exactly what happened. I am doing this for you, most excellent Theophilus. "},{"num":4,"verse":"I want you to know that the things you have been taught are true."},{"header":"The Coming Birth of John the Baptist"},{"num":5,"verse":"Herod was king of Judea. During the time he was ruling, there was a priest named Zechariah. He belonged to a group of priests named after Abijah. His wife Elizabeth also came from the family line of Aaron. "},{"num":6,"verse":"Both of them did what was right in the sight of God. They obeyed all the Lord’s commands and rules faithfully. "},{"num":7,"verse":"But they had no children, because Elizabeth was not able to have any. And they were both very old."},{"num":8,"verse":"One day Zechariah’s group was on duty. He was serving as a priest in God’s temple. "},{"num":9,"verse":"He happened to be chosen, in the usual way, to go into the temple of the Lord. There he was supposed to burn incense. "},{"num":10,"verse":"The time came for this to be done. All who had gathered to worship were praying outside."},{"num":11,"verse":"Then an angel of the Lord appeared to Zechariah. The angel was standing at the right side of the incense altar. "},{"num":12,"verse":"When Zechariah saw him, he was amazed and terrified. "},{"num":13,"verse":"But the angel said to him, “Do not be afraid, Zechariah. Your prayer has been heard. Your wife Elizabeth will have a child. It will be a boy, and you must call him John. "},{"num":14,"verse":"He will be a joy and delight to you. His birth will make many people very glad. "},{"num":15,"verse":"He will be important in the sight of the Lord. He must never drink wine or other such drinks. He will be filled with the Holy Spirit even before he is born. "},{"num":16,"verse":"He will bring back many of the people of Israel to the Lord their God. "},{"num":17,"verse":"And he will prepare the way for the Lord. He will have the same spirit and power that Elijah had. He will bring peace between parents and their children. He will teach people who don’t obey to be wise and do what is right. In this way, he will prepare a people who are ready for the Lord.”"},{"num":18,"verse":"Zechariah asked the angel, “How can I be sure of this? I am an old man, and my wife is old too.”"},{"num":19,"verse":"The angel said to him, “I am Gabriel. I serve God. I have been sent to speak to you and to tell you this good news. "},{"num":20,"verse":"And now you will have to be silent. You will not be able to speak until after John is born. That’s because you did not believe my words. They will come true at the time God has chosen.”"},{"num":21,"verse":"During that time, the people were waiting for Zechariah to come out of the temple. They wondered why he stayed there so long. "},{"num":22,"verse":"When he came out, he could not speak to them. They realized he had seen a vision in the temple. They knew this because he kept gesturing to them. He still could not speak."},{"num":23,"verse":"When his time of service was over, he returned home. "},{"num":24,"verse":"After that, his wife Elizabeth became pregnant. She stayed at home for five months. "},{"num":25,"verse":"“The Lord has done this for me,” she said. “In these days, he has been kind to me. He has taken away my shame among the people.”"},{"header":"The Coming Birth of Jesus"},{"num":26,"verse":"In the sixth month after Elizabeth had become pregnant, God sent the angel Gabriel to Nazareth, a town in Galilee. "},{"num":27,"verse":"He was sent to a virgin. The girl was engaged to a man named Joseph. He came from the family line of David. The virgin’s name was Mary. "},{"num":28,"verse":"The angel greeted her and said, “The Lord has blessed you in a special way. He is with you.”"},{"num":29,"verse":"Mary was very upset because of his words. She wondered what kind of greeting this could be. "},{"num":30,"verse":"But the angel said to her, “Do not be afraid, Mary. God is very pleased with you. "},{"num":31,"verse":"You will become pregnant and give birth to a son. You must call him Jesus. "},{"num":32,"verse":"He will be great and will be called the Son of the Most High God. The Lord God will make him a king like his father David of long ago. "},{"num":33,"verse":"The Son of the Most High God will rule forever over his people. They are from the family line of Jacob. That kingdom will never end.”"},{"num":34,"verse":"“How can this happen?” Mary asked the angel. “I am a virgin.”"},{"num":35,"verse":"The angel answered, “The Holy Spirit will come to you. The power of the Most High God will cover you. So the holy one that is born will be called the Son of God. "},{"num":36,"verse":"Your relative Elizabeth will have a child even though she is old. People thought she could not have children. But she has been pregnant for six months now. "},{"num":37,"verse":"That’s because what God says will always come true.”"},{"num":38,"verse":"“I serve the Lord,” Mary answered. “May it happen to me just as you said it would.” Then the angel left her."},{"header":"Mary Visits Elizabeth"},{"num":39,"verse":"At that time Mary got ready and hurried to a town in Judea’s hill country. "},{"num":40,"verse":"There she entered Zechariah’s home and greeted Elizabeth. "},{"num":41,"verse":"When Elizabeth heard Mary’s greeting, the baby inside her jumped. And Elizabeth was filled with the Holy Spirit. "},{"num":42,"verse":"In a loud voice she called out, “God has blessed you more than other women. And blessed is the child you will have! "},{"num":43,"verse":"But why is God so kind to me? Why has the mother of my Lord come to me? "},{"num":44,"verse":"As soon as I heard the sound of your voice, the baby inside me jumped for joy. "},{"num":45,"verse":"You are a woman God has blessed. You have believed that the Lord would keep his promises to you!”"},{"header":"Mary’s Song"},{"num":46,"verse":"Mary said,"},{"num":56,"verse":"Mary stayed with Elizabeth about three months. Then she returned home."},{"header":"John the Baptist Is Born"},{"num":57,"verse":"The time came for Elizabeth to have her baby. She gave birth to a son. "},{"num":58,"verse":"Her neighbors and relatives heard that the Lord had been very kind to her. They shared her joy."},{"num":59,"verse":"On the eighth day, they came to have the child circumcised. They were going to name him Zechariah, like his father. "},{"num":60,"verse":"But his mother spoke up. “No!” she said. “He must be called John.”"},{"num":61,"verse":"They said to her, “No one among your relatives has that name.”"},{"num":62,"verse":"Then they motioned to his father. They wanted to find out what he would like to name the child. "},{"num":63,"verse":"He asked for something to write on. Then he wrote, “His name is John.” Everyone was amazed. "},{"num":64,"verse":"Right away Zechariah could speak again. Right away he praised God. "},{"num":65,"verse":"All his neighbors were filled with fear and wonder. Throughout Judea’s hill country, people were talking about all these things. "},{"num":66,"verse":"Everyone who heard this wondered about it. And because the Lord was with John, they asked, “What is this child going to be?”"},{"header":"Zechariah’s Song"},{"num":67,"verse":"John’s father Zechariah was filled with the Holy Spirit. He prophesied,"},{"num":80,"verse":"The child grew up, and his spirit became strong. He lived in the desert until he appeared openly to Israel."}]