[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Have devoured.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The past tense may refer to the invasions of Tiglath-pileser. Both Egypt and Assyria had come to regard Israel as the earthen pipkin between iron pots. These strangers have devoured his strength—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he has less power to resist aggression, less treasure, less land, smaller population. The signs of senility are upon him. “Grey hairs are his passing bell.” He is under sentence of death, and knoweth it not.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:8-16 Israel was as a cake not turned, half burnt and half dough, none of it fit for use; a mixture of idolatry and of the worship of Jehovah. There were tokens of approaching ruin, as grey hairs are of old age, but they noticed them not. The pride which leads to break the law of God leads to self-flattery. The mercy and grace of God are the only refuge to which obstinate sinners never think of fleeing. Though they may howl forth their terrors in the form of prayers, they seldom cry to God with their hearts. Even their prayers for earthly mercies only seek fuel for their lusts. Their turning from one sect, sentiment, form, or vice, to another, still leaves them far short of Christ and holiness. Such are we by nature. And such shall we prove if left to ourselves. Create in us a clean heart, O God, and renew a right spirit within us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Strangers have devoured his strength, and he knoweth it not - Like Samson, when, for sensual pleasure, he had betrayed the source of his strength and God had departed from him, lsrael knew not how or wherein his alliancs with the pagan had impaired his strength. He thought his losses at the hand of the enemy, passing wounds, which time would heal; he thought not of them, as tokens of God's separation from him, that his time of trial was coming to its close, his strength decaying, his end at hand. Israel was not only incorrigible, but \"past feeling\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the Apostle says of the pagan. The marks of wasting and decay were visible to sight and touch; yet he himself perceived not what all saw except himself. Israel had sought to strangers for help, and it \"had turned to his decay.\" Pul and Tiglath-pileser had \"devoured his strength,\" despoiling him of his wealth and treasure, the flower of his men, and the produce of his land, draining him of his riches, and hardly oppressing him through the tribute imposed upon him. But \"like men quite stupified, they, though thus continually gnawed upon, yet suffered themselves willingly to be devoured, and seemed insensible of it.\" Yet not only so, but the present evils were the forerunners of worse. Grey hairs, themselves the effects of declining age and tokens of decay, are the forerunners of death. \"Thy grey hairs are thy passing-bell,\" says the proverb .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The prophet repeats, after each clause, \"he knoweth not.\" He knoweth nothing; be knoweth not the tokens of decay in himself, but hides them from himself; he knoweth not God, who is the author of them;. he knoweth not the cause of them, his sins; he knoweth not the end and object of them, his conversion; he knoweth not, what, since he knoweth not any of these things, will be the issue of them, his destruction. People hide from themselves the tokens of decay, whether of body or soul. And so death, whether of body or soul or both, comes upon them unawares. : \"Looking on the surface, he imagines that all things are right with him, not feeling the secret worm which gnaws within. The outward garb remains; the rules of fasting are observed; the stated times of prayer are kept; but the heart is far from Me, saith the Lord. Consider diligently what thou lovest, what thou fearest, whereat thou rejoicest or art saddened, and thou will find, under the habit of religion, a worldly mind; under the rags of conversion, a heart of perversion.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prophet repeats, after each clause, \"he knoweth not.\" He knoweth nothing; be knoweth not the tokens of decay in himself, but hides them from himself; he knoweth not God, who is the author of them;. he knoweth not the cause of them, his sins; he knoweth not the end and object of them, his conversion; he knoweth not, what, since he knoweth not any of these things, will be the issue of them, his destruction. People hide from themselves the tokens of decay, whether of body or soul. And so death, whether of body or soul or both, comes upon them unawares. : \"Looking on the surface, he imagines that all things are right with him, not feeling the secret worm which gnaws within. The outward garb remains; the rules of fasting are observed; the stated times of prayer are kept; but the heart is far from Me, saith the Lord. Consider diligently what thou lovest, what thou fearest, whereat thou rejoicest or art saddened, and thou will find, under the habit of religion, a worldly mind; under the rags of conversion, a heart of perversion.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. Strangers—foreigners: the Syrians and Assyrians (2Ki 13:7; 15:19, 20; 17:3-6).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "gray hairs—that is, symptoms of approaching national dissolution.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "are here and there upon—literally, \"are sprinkled on\" him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yet he knoweth not—Though old age ought to bring with it wisdom, he neither knows of his senile decay, nor has the true knowledge which leads to reformation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Strangers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " foreigners, whose aid Ephraim sought, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 15:19,20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", when Menahem bought the friendship of Pul king of Assyria for one thousand talents of silver, and impoverished the land thereby. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Have devoured; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " eat up, lived upon, as men live on bread they eat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His strength; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the riches and goods of the kingdom of Israel; the fruit of the olive and vine; the fruit of the earth, corn; the increase of their flocks and of their herds; the most or best of all eaten up by strangers, either soldiers in garrison among them, or else courted by presents and rich gifts sent to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Knoweth it not; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not sensible either of the cause why, or the tendency of this hasty consumption of all; still they are secure, and sin as much as ever. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Grey hairs are here and there upon him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the manifest symptoms of approaching death, undeniable tokens of old age, and declining strength never recoverable, are upon their kingdom, like grey hairs that are here and there intermixed on the head of a man: what with domestic seditions and foreign invasions, and the fears, cares, and griefs from both, Ephraim is turned grey-headed, his vital vigour and strength decayeth, and this is a forerunner of his death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Yet he knoweth it not; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so secure and stupid, that no notice is taken of this, nor any course thought of for preventing the dismal effects of this declining consumptive state; none turn from sin, none seek to God, the only Physician that can heal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Strangers have devoured his strength,.... Or his substance, as the Targum; his wealth and riches, fortresses and strong holds: these strangers were either the Syrians, who, in the times of Jehoahaz, destroyed Ephraim or the Israelites, and so weakened them, as to make them like the dust by threshing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or the Assyrians, first under Pul king of Assyria, who came out against Menahem king of Israel, and exacted a tribute of a thousand talents of silver, and so drained them of their treasure, which was their strength, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and then under Tiglathpileser, another king of Assyria, who came and took away from them many of their fortified places, and carried the inhabitants captive, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he knoweth it not; is not sensible how much he is weakened by such exactions and depredations; or does not take notice of the hand of God in all this; does not consider from whence it comes, what is the cause of it, and for what ends; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yea, gray hairs are here and there upon him, yet he knoweth not; or, \"old age has sprinkled itself upon him\" (s); or, \"gray hairs are sprinkled on him\"; gray hairs, when thick, are a sign that old age is come; and, when sprinkled here and there, are symptoms of its coming on, and of a person's being on the decline of life; and here it signifies the weak and declining state of Israel, through the exactions and depredations of their neighbours, and that theft utter ruin was near; and yet they did not know nor consider their latter end, nor repent of their sins and acknowledge them, and return unto the Lord, and implore his mercy: so carnal professors, who mix with the men of the world, that are strangers to God and godliness, and everything that is divine and good, are devoured by them; they lose their time and substance, and their precious souls, and are not aware of it. The symptoms of the declining state of the church of God are at this time upon us, and yet not taken notice of; such as great departures from the faith; a number of false teachers risen up; great failings off of professors, and of such who have made a great figure in the church; a small number of faithful men; great coldness and lukewarmness to spiritual things; little faith on the earth; great neglect of Gospel worship and ordinances; much sleepiness and drowsiness; great immorality and profaneness: as also the symptoms of the declining state of the world, and of its drawing to its period; as wars, and rumours of wars, famine, pestilence, and earthquakes in divers places; volcanos, burning mountains, eruptions of subterraneous fire, which portend the general conflagration; and yet these things are little attended to. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(s)   \"canities sparsit se in eo\", Pagninus, Montanus, Cocceius, Schmidt; \"cani sparsi sunt\", Tigurine version; \"canities aspergit eum\", Junius & Tremellius, Piscator; so Latin writers: \"sparserit et nigras alba senecta comas\". Propert. l. 3. Eleg. 4. \"Jam mihi deterior canis aspergitur aetas\". Ovid. de Ponto, l. 1. Eleg. 5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s)   \"canities sparsit se in eo\", Pagninus, Montanus, Cocceius, Schmidt; \"cani sparsi sunt\", Tigurine version; \"canities aspergit eum\", Junius & Tremellius, Piscator; so Latin writers: \"sparserit et nigras alba senecta comas\". Propert. l. 3. Eleg. 4. \"Jam mihi deterior canis aspergitur aetas\". Ovid. de Ponto, l. 1. Eleg. 5. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Strangers have devoured his strength, and he knoweth it not: yea, {g} gray hairs are here and there upon him, yet he knoweth not.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Strangers have devoured his strength, and he knoweth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not: yea, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " gray hairs are here and there upon him, yet he knoweth not.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Which are a token of his manifold afflictions.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Strangers have devoured his strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] By heavy tribute and desolating invasions. The ‘strangers’ would be Hazael and Benhadad (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:32-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Pul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:19-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Tiglath-Pileser (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), though the two last are really the same person, Pul being the private name of a usurper who took the old royal name of Tiglath-Pileser (as proved by Mr Pinches).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gray hairs are here and there upon him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., ‘are sprinkled upon him.’ That a state has different stages, analogous to the periods of human life, was a familiar idea; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 71:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (where the speaker is probably the personified people, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 7:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "20 in the Hebrew).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Strangers have devoured his strength, and he knoweth it not.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Israel's intercourse with other nationalities could not but issue in disaster; a specimen of that disaster is here given. As the Greeks called all who did not speak the Greek language, whether they were savage or civilized, barbarians, so Israel called all foreigners, whether near or far off, strangers. The foreign nations here meant were those with which Israel had entered into treaties or formed alliances, in contravention of the constitution which God had given them. These nations, moreover, devoured their national resources by the imposition of taxes and hostile incursions; thus the King of Syria left \"of the people to Jehoahaz only fifty horsemen, and ten chariots, and ten thousand footmen; for the King of Syria had destroyed them, and had made them like the dust by threshing;\" again, when \"Pul, the King of Assyria, came against the laud,\" we read that Menahem gave Pul a thousand talents of silver, that his hand might be with him to confirm the kingdom in his hand. And Menahem exacted the money of Israel, even of all the mighty men of wealth, of each man fifty shekels of silver, to give to the King of Assyria;\" then, \"in the days of Pekah King of Israel came Tiglath-pileser King of Assyria, and took Ijon, and Abel-beth-maachah, and Janoah, and Kedesh, and Hazer, and Gilead, and Galilee, all the land of Naphtali, and carried them captive to Assyria. \"The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here mentioned includes all those things which constitute the wealth and well-being of a country, the produce of the soil and the riches of its inhabitants. Thus Aben Ezra rightly explains this clause, referring it to \"the tribute which the Israelites gave to Assyria and Egypt, as is written in the Book of Kings.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yea, grey hairs are here and there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sprinkled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "upon him",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "upon him",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". What from foreign foes and internal feuds, the body politic was manifesting unmistakable symptoms of decay and decrepitude and approaching dissolution, just as grey hairs on the human body give indication of the advance of old age, with its decay of strength and nearness to the tomb. \"The course of nature,\" says Aben Ezra, \"has sprinkled grey hairs upon him, just as grey hair comes on men in consequence of the course of nature;\" this corresponds to the sentiment of the preceding clause, for, according to the commentator just named,\" the grey hair denotes that their power is weakened and their possession perished.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yet he knoweth not is parallel to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And he knoweth (it) not,\" and repeats the same sentiment, of course with emphasis of what was Israel thus ignorant? Not, surely, of the declining state of the national strength and the decay of the national importance. After so many drains upon their resources and the unsatisfactory position of their foreign relations, they could not shut their eyes upon the steadily and even rapidly approaching decadence. But though they could not pretend ignorance of the fact, they remained in ignorance of the cause, its consequence, and the cure. Notwithstanding the already exhausted condition of their country, and the process of exhaustion still going on, they overlooked the lamentable cause of all, which was their sin, national and individual, in departing from the Lord; and at the same time the dangerous consequences that were neither remote nor capable of being staved off; as also the only possible cure to be found in direct and immediate return and application to that God from whom they had so revolted. The \"it\" supplied in the Authorized Version ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had better be omitted; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the construction adopted by Rashi and others, who make the first part of each clause the object of the second, is erroneous, as we have shown in the preceding observations. \"They took it not to heart that the kings of Syria consumed them in the days of Jehoahaz\" is the exposition of Rashi just referred to; but that of Kimchi favors the first and correct construction, as may be inferred from the words, \"And he (Israel) knows not that on account of his iniquity all this has come upon him, and yet he turns not from his wickedness.\" Hosea 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the next strophe (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:8-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the prophecy passes from the internal corruption of the kingdom of the ten tribes to its worthless foreign policy, and the injurious attitude which it had assumed towards the heathen nations, and unfolds the disastrous consequences of such connections. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Ephraim, it mixes itself among the nations; Ephraim has become a cake not turned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Strangers have devoured his strength, and he knoweth it not; grey hair is also sprinkled upon him, and he knoweth it not.\" יתבּולל, from בּלל, to mix or commingle, is not a future in the sense of \"it will be dispersed among the Gentiles;\" for, according to the context, the reference is not to the punishment of the dispersion of Israel among the nations, but to the state in which Israel then was. The Lord had separated Israel from the nations, that it might be holy to Him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As Balaam said of it, it was to be a people dwelling alone (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But in opposition to this object of its divine calling, the ten tribes had mingled with the nations, i.e., with the heathen, learned their works, and served their idols (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:35-36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The mingling with the nations consisted in the adoption of heathen ways, not in the penetration of the heathen into Israelitish possessions (Hitzig), nor merely in the alliances which it formed with heathen nations. For these were simply the consequence of inward apostasy from its God, of that inward mixing with the nature of heathenism which had already taken place. Israel had thereby become a cake not turned. עגּה, a cake baked upon hot ashes or red-hot stones, which, if it be not turned, is burned at the bottom, and not baked at all above. The meaning of this figure is explained by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As the fire will burn an ash-cake when it is left unturned, so have foreigners consumed the strength of Israel, partly by devastating wars, and partly by the heathenish nature which has penetrated into Israel in their train. \"Greyness is also sprinkled upon it;\" i.e., the body politic, represented as one person, is already covered with traces of hoary old age, and is ripening for destruction. The object to לא ידע may easily be supplied from the previous clauses, namely, that strangers devour its strength, and it is growing old. The rendering non sapit is precluded by the emphatic והוּא, and he knoweth it not, i.e., does not perceive the decay of his strength. ",
        "children": []
      }
    ]
  }
]