[[],[{"type":"header","content":"Samson’s Birth"},{"type":"prose","content":"The Israelites again did evil in the ’s sight, so the  handed them over to the Philistines for forty years."}],[{"type":"prose","content":"There was a man named Manoah from Zorah, from the Danite tribe. His wife was infertile and childless. "}],[{"type":"prose","content":"The angel of the  appeared to the woman and said to her, “You are infertile and childless, but you will conceive and have a son. "}],[{"type":"prose","content":"Now be careful! Do not drink wine or beer, and do not eat any food that will make you ritually unclean. "}],[{"type":"prose","content":"Look, you will conceive and have a son. You must never cut his hair, for the child will be dedicated to God from birth. He will begin to deliver Israel from the power of the Philistines.”"}],[{"type":"prose","content":"The woman went and said to her husband, “A man sent from God came to me! He looked like God’s angel—he was very awesome. I did not ask him where he came from, and he did not tell me his name. "}],[{"type":"prose","content":"He said to me, ‘Look, you will conceive and have a son. So now, do not drink wine or beer and do not eat any food that will make you ritually unclean. For the child will be dedicated to God from birth till the day he dies.’”"}],[{"type":"prose","content":"Manoah prayed to the , “Please, Lord, allow the man sent from God to visit us again, so he can teach us how we should raise the child who will be born.” "}],[{"type":"prose","content":"God answered Manoah’s prayer. God’s angel visited the woman again while she was sitting in the field. But her husband Manoah was not with her. "}],[{"type":"prose","content":"The woman ran at once and told her husband, “Come quickly, the man who visited me the other day has appeared to me!” "}],[{"type":"prose","content":"So Manoah got up and followed his wife. When he met the man, he said to him, “Are you the man who spoke to my wife?” He said, “Yes.” "}],[{"type":"prose","content":"Manoah said, “Now, when your announcement comes true, how should the child be raised and what should he do?” "}],[{"type":"prose","content":"The angel of the  told Manoah, “Your wife should pay attention to everything I told her. "}],[{"type":"prose","content":"She should not drink anything that the grapevine produces. She must not drink wine or beer, and she must not eat any food that will make her ritually unclean. She should obey everything I commanded her to do.” "}],[{"type":"prose","content":"Manoah said to the angel of the , “Please stay here awhile, so we can prepare a young goat for you to eat.” "}],[{"type":"prose","content":"The angel of the  said to Manoah, “If I stay, I will not eat your food. But if you want to make a burnt sacrifice to the , you should offer it.” (He said this because Manoah did not know that he was the angel of the .) "}],[{"type":"prose","content":"Manoah said to the angel of the , “Tell us your name, so we can honor you when your announcement comes true.” "}],[{"type":"prose","content":"The angel of the  said to him, “You should not ask me my name, because you cannot comprehend it.” "}],[{"type":"prose","content":"Manoah took a young goat and a grain offering and offered them on a rock to the . The ’s messenger did an amazing thing as Manoah and his wife watched. "}],[{"type":"prose","content":"As the flame went up from the altar toward the sky, the angel of the  went up in it while Manoah and his wife watched. They fell facedown to the ground."}],[{"type":"prose","content":"The angel of the  did not appear again to Manoah and his wife. After all this happened Manoah realized that the visitor had been the angel of the . "}],[{"type":"prose","content":"Manoah said to his wife, “We will certainly die, because we have seen a supernatural being!” "}],[{"type":"prose","content":"But his wife said to him, “If the  wanted to kill us, he would not have accepted the burnt offering and the grain offering from us. He would not have shown us all these things, or have spoken to us like this just now.”"}],[{"type":"prose","content":"Manoah’s wife gave birth to a son and named him Samson. The child grew and the  empowered him. "}],[{"type":"prose","content":"The ’s Spirit began to control him in Mahaneh Dan between Zorah and Eshtaol."}]]