[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My Father’s house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Some among those present now (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") may have been present in that same house when He, a lad of twelve years, was there at the Passover, and after questions and answers, higher and deeper than these doctors could grasp, claimed God as His true Father (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). What that repeated claim meant now must have been clear to all. Their own messengers had brought them John’s witness; later reports must have come before, and come with, the crowd of Galilæan pilgrims; the disciples are themselves with Him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and their hearts are too full for silence; but there was more than all this. Those expounders of the oracles of God who remembered that Elijah was to come before the day of the Lord, must have remembered, too, that the Lord was to come to this Temple, like a refiner’s fire, and like fullers’ soap (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). That fire was in their midst, and from that Presence buyers and sellers and changers shrunk back in awe, none daring to resist; that cleansing was then taking place, and the Son was claiming the sanctity and reverence due to His Father’s house. He has before claimed to be Son of Man. The Messianic title is publicly claimed before the official representatives of the people at the great national festival, in the Temple, at Jerusalem. If, while this scene is fresh is our minds, we think again of the marriage at Cana, we shall feel how different the manifestations are, and that this latter was not, and was not intended to be, a public declaration of His person and work. Now we understand what seemed hard before, that the assertion “Mine hour is not yet come” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") immediately precedes the first sign. This sign was at a family gathering known only to few, probably not to all who were there, for “the ruler knew not whence it was” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and no effect is described as resulting from it, except that the little band of disciples believed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The “forth,” which in the English version seems to mark an effect upon others, is not found in the Greek. It is within the circle of the other Gospel narratives, but is included in none of them. It left no such impression in the mind of St. Peter as to lead him to include it in the Gospel of his interpreter, St. Mark, or upon Mary herself as to lead her to include it in the answers she must have given to the questions of St. Luke. It was, indeed, the first sign in Cana of Galilee, but the scene before us is the announcement to the world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "CHRIST CLEANSING THE TEMPLEJOHN ii. 16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "CHRIST CLEANSING THE TEMPLE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "JOHN ii. 16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The other Evangelists do not record this cleansing of the Temple at the beginning of Christ’s ministry, but, as we all know, tell of a similar act at its very close. John, on the other hand, has no notice of the latter incident. The question, then, naturally arises, are these diverse narratives accounts of the same event? The answer seems to me to be in the negative, because John’s Gospel is evidently intended to supplement the other three, and to record incidents either unknown to, or unnoticed by, them, and, as a matter of fact, the whole of this initial visit of our Lord to Jerusalem is omitted by the three Evangelists. Then the two incidents are distinctly different in tone, in setting, and in the words with which our Lord accompanies them. They are both appropriate in the place in which they stand, the one as the initial and the other as all but the final act of His Messiahship. So we may learn from the repetition of this cleansing the solemn lesson: that outward reformation of religious corruptions is of small and transient worth. For in three years-perhaps in as many weeks-the abuse that He corrected returned in full force.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, this narrative has many points of interest, but I think I shall best bring out its meaning if I remind you, by way of introduction, that the Temple of Jerusalem was succeeded by the Temple of the Christian Church, and that each individual Christian man is a temple. So there are three things that I want to set before you: what Christ did in the Temple; what He does in the Church; what He will do to each of us if we will let Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, what Christ did in the Temple. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, then, what Christ did in the Temple.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, the scene in our narrative is not unlike that which may be witnessed in any Roman Catholic country in the cathedral place or outside the church on the saint’s day, where there are long rows of stalls, fitted up with rosaries, and images of the saint, and candles, and other apparatus for worship.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The abuse had many practical grounds on which it could be defended. It was very convenient to buy sacrifices on the spot, instead of having to drag them from a distance. It was no less convenient to be able to exchange foreign money, possibly bearing upon it the head of an emperor, for the statutory half-shekel. It was profitable to the sellers, and no doubt to the priests, who were probably sleeping partners in the concern, or drew rent for the ground on which the stalls stood. And so, being convenient for all and profitable to many, the thing became a recognised institution.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Being familiar it became legitimate, and no one thought of any incongruity in it until this young Nazarene felt a flash of zeal for the sanctity of His Father’s house consuming Him. Catching up some of the reeds which served as bedding for the cattle, He twisted them into the semblance of a scourge, which could hurt neither man nor beast. He did not use it. It was a symbol, not an instrument. According to the reading adopted in the Revised Version, it was the sheep and cattle, not their owners, whom He ‘drove out.’ And then, dropping the scourge, He turned to the money-changers, and, with the same hand, overthrew their tables. And then came the turn of the sellers of doves. He would not hurt the birds, nor rob their owners. And so He neither overthrew nor opened the cages, but bade them ‘Take these things hence’; and then came the illuminating words, ‘Make not My Father’s house a house of merchandise.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now this incident is very unlike our Lord’s usual method, even if we do not exaggerate the violence which He employed. It is unlike in two respects: in the use of compulsion, and in aiming at mere outward reformation. And both of these points are intimately connected with its place in His career.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It was the first public appearance of Jesus before His nation as Messiah. He inaugurates His work by a claim-by an act of authority-to be the King of Israel and the Lord of the Temple. If we remember the words from the last prophet, in which Malachi says that ‘the Messenger of the Covenant . . . shall suddenly come to His Temple, and purify the sons of Levi,’ we get the significance of this incident. We have to mark in it our Lord’s deliberate assumption of the role of Messiah; His shaping His conduct so as to recall to all susceptible hearts that last utterance of prophecy, and to recognise the fact that at the beginning of His career He was fully conscious of His Son-ship, and inaugurated His work by the solemn appeal to the nation to recognise Him as their Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And this is the reason, as I take it, why the anomalous incident is in its place at the beginning of His career no less than the repetition of it was at the close. And this is the explanation of the anomaly of the incident. It is His solemn, authoritative claiming to be God’s Messenger, the Messiah long foretold.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, further, this incident is a singular manifestation of Christ’s unique power. How did it come that all these sordid hucksters had not a word to say, and did not lift a finger in opposition, or that the Temple Guard offered no resistance, and did not try to quell the unseemly disturbance, or that the very officials, when they came to reckon with Him, had nothing harsher to say than, ‘What sign showest Thou unto us, seeing that Thou doest these things’? No miracle is needed to explain that singular acquiescence. We see in lower forms many instances of a similar thing. A man ablaze with holy indignation, and having a secret ally in the hearts of those whom He rebukes, will awe a crowd even if he does not infect them. But that is not the full explanation. I see here an incident analogous to that strange event at the close of Christ’s ministry, when, coming out from beneath the shadows of the olives in the garden, He said to the soldiers ‘Whom seek ye?’ and they fell backwards and wallowed on the ground. An overwhelming impression of His personal majesty, and perhaps some forth-putting of that hidden glory which did swim up to the surface on the mountain of Transfiguration, bowed all these men before Him, like reeds before the wind. And though there was no recognition of His claim, there was something in the Claimant that forbade resistance and silenced remonstrance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Further, this incident is a revelation of Christ’s capacity for righteous indignation. No two scenes can be more different than the two recorded in this chapter: the one that took place in the rural seclusion of Cana, nestling among the Galilean hills, the other that was done in the courts of the Temple swarming with excited festival-keepers; the one hallowing the common joys of daily life, the other rebuking the profanation of what assumed to be a great deal more sacred than a wedding festival; the one manifesting the love and sympathy of Jesus, His power to ennoble all human relationships, and His delight in ministering to need and bringing gladness, and the other setting forth the sterner aspect of His character as consumed with holy zeal for the sanctity of God’s name and house. Taken together, one may say that they cover the whole ground of His character, and in some very real sense are a summary of all His work. The programme contains the whole of what is to follow hereafter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We may well take the lesson, which no generation ever needed more than the present, both by reason of its excellences and of its defects, that there were no love worthy of a perfect spirit in which there did not lie dormant a dark capacity of wrath, and that Christ Himself would not have been the Joy-bringer, the sympathising Gladdener which He manifested Himself as being in the ‘beginning of miracles in Cana of Galilee’ unless, side by side, there had lain in Him the power of holy indignation and, if need be, of stern rebuke. Brethren, we must retain our conception of His anger if we are not to maim our conception of His love. There is no wrath like the wrath of the Lamb. The Temple court, with the strange figure of the Christ with a scourge in His hand, is a revelation which this generation, with its exaggerated sentimentalism, with its shrinking, by reason of its good and of its evil, from the very notion of a divine retribution based upon the eternal antagonism between good and evil, most sorely needs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, secondly, notice what Christ does in His Church. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now, secondly, notice what Christ does in His Church.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I need not remind you how God’s method of restoration is always to restore with a difference and a progress. The ruined Temple on Zion was not to be followed by another house of stone and lime, but by ‘a spiritual house,’ builded together for ‘a habitation of God in the Spirit.’ The Christian Church takes the place of that material sanctuary, and is the dwelling-place of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That being so, let us take the lesson that that house, too, may be desecrated. There may be, as there were in the original Temple, the externals of worship, and yet, eating out the reality of these, there may be an inward mercenary spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note how insensibly such corruption creeps in to a community. You cannot embody an idea in a form or in an external association without immediately dragging it down, and running the risk of degradation. It is just like a drop of quicksilver which you cannot expose to the air but instantaneously its brightness is dimmed by the scum that forms on its surface. A church as an outward institution is exposed to all the dangers to which other institutions are exposed. And these creep on insensibly, as this abuse had crept on. So it is not enough that we should be at ease in our consciences in regard to our practices as Christian communities. We become familiar with any abuse, and as we become familiar we lose the power of rightly judging of it. Therefore conscience needs to be guided and enlightened quite as much as to be obeyed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How long has it taken the Christian Church to learn the wickedness of slavery? Has the Christian Church yet learned the unchristianity of War? Are there no abuses amongst us, which subsequent generations will see to be so glaring that they will talk about us as we talk about our ancestors, and wonder whether we were Christians at all when we could tolerate such things? They creep on gradually, and they need continual watchfulness if they are not to assume the mastery.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The special type of corruption which we find in this incident is one that besets the Church always. Of course, if I were preaching to ministers, I should have a great deal to say about that. For men that are necessarily paid for preaching have a sore temptation to preach for pay. But it is not only we professionals who have need to lay to heart this incident. It is all Christian communities, established and non-established churches, Roman Catholic and Protestant. The same danger besets them all. There must be money to work the outward business of the house of God. But what about people that ‘run’ churches as they run mills? What about people whose test of the prosperity of a Christian community is its balance-sheet? What about the people that hang on to religious communities and services for the sake of what they can make out of them? We have heard a great deal lately about what would happen ‘if Christ came to Chicago.’ If Christ came to any community of professing Christians in this land, do you not think He would need to have the scourge in His hand, and to say ‘Make not My Father’s house a house of merchandise’? He will come; He does come; He is always coming if we would listen to Him. And at long intervals He comes in some tremendous and manifest fashion, and overthrows the money-changers’ tables.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah, brethren! if Jesus Christ had not thus come, over and over again, to His Church, Christian men would have killed Christianity long ago. Did you ever think that Christianity is the only religion that has shown recuperative power and that has been able to fling off its peccant humours? They used to say-I do not know whether it is true or not-that Thames water was good to put on board ship because of its property of corrupting and then clearing itself, and becoming fit to drink. We and our brethren, all through the ages, have been corrupting the Water of Life. And how does it come to be sweet and powerful still? This tree has substance in it when it casts its leaves. That unique characteristic of Christianity, its power of reformation, is not self-reformation, but it is a coming of the Lord to His temple to ‘purify the sons of Levi, that their offering may be pleasant as in days of yore.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So one looks upon the spectacle of churches labouring under all manner of corruptions; and one need not lose heart. The shortest day is the day before the year turns; and when the need is sorest the help is nearest. And so I, for my part, believe that very much of the organisations of all existing churches will have to be swept away. But I believe too, with all my heart-and I hope that you do-that, though the precious wheat is riddled in the sieve, and the chaff falls to the ground, not one grain will go through the meshes. Whatever becomes of churches, the Church of Christ shall never have its strength so sapped by abuses that it must perish, or its lustre so dimmed that the Lord of the Temple must depart from His sanctuary.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, note what Christ will do for each of us if we will let Him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, note what Christ will do for each of us if we will let Him.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is not a community only which is the temple of God. For the Apostles in many places suggest, and in some distinctly say, ‘ye are the temples’ individually, as well as the Temple collectively, of the Most High. And so every Christian soul-by virtue of that which is the deepest truth of Christianity, the indwelling of Christ in men’s hearts by faith-is a temple of God; and every human soul is meant to be and may become such. That temple can be profaned. There are many ways in which professing Christians make it a house of merchandise. There are forms of religion which are little better than chaffering with God, to give Him so much service if He will repay us with so much Heaven. There are too many temptations, to which we yield, to bring secular thoughts into our holiest things. Some of us, by reason not of wishing wealth but of dreading penury, find it hard to shut worldly cares out of our hearts. We all need to be on our guard lest the atmosphere in which we live in this great city shall penetrate even into our moments of devotion, and the noise of the market within earshot of the Holy of Holies shall disturb the chant of the worshippers. It is Manchester’s temptation, and it is one that most of us need to be guarded against.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So engrossed, and, as we should say, necessarily engrossed-or, at all events, legitimately engrossed-are we in the pursuits of our daily commerce, that we have scarcely time enough or leisure of heart and mind enough to come into ‘the secret place of the Most High.’ The worshippers stop outside trading for beasts and doves, and they have no time to go into the Temple and present their offerings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is our besetting danger. Forewarned is forearmed, to some extent. Would that we could all hear, as we go about our ordinary avocations, that solemn voice, ‘Make not My Father’s house a house of merchandise,’ and could keep the inner sanctuary still from the noises, and remote from the pollutions, of the market hard by!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We cannot cast out these or any other desecrating thoughts and desires by ourselves, except to a very small degree. And if we do, then there happens what our Lord warned us against in profound words. The house may be emptied of the evil tenant in some measure by our own resolution and self-reformation. But if it is not occupied by Him, it remains ‘empty,’ though it is ‘swept and garnished.’ Nature abhors a vacuum, and into the empty house there come the old tenant and seven brethren blacker than himself. The only way to keep the world out of my heart is to have Christ filling it. If we will ask Him He will come to us. And if He has the scourge in His hand, let Him be none the less welcome a guest for that. He will come, and when He enters, it will be like the rising of the sun, when all the beasts of the forest slink away and lay them down in their dens. It will be like the carrying of the Ark of the Covenant of the Lord of the whole earth into the temple of Dagon, when the fish-like image fell prone and mutilated on the threshold. If we say to Him, ‘Arise, O Lord, into Thy rest, Thou and the Ark of Thy strength,’ He will enter in, and by His entrance will ‘make the place of His feet glorious’ and pure.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:12-22 The first public work in which we find Christ engaged, was driving from the temple the traders whom the covetous priests and rulers encouraged to make a market-place of its courts. Those now make God's house a house of merchandise, whose minds are filled with cares about worldly business when attending religious exercises, or who perform Divine offices for love of gain. Christ, having thus cleansed the temple, gave a sign to those who demanded it, to prove his authority for so doing. He foretells his death by the Jews' malice, Destroy ye this temple; I will permit you to destroy it. He foretells his resurrection by his own power; In three days I will raise it up. Christ took again his own life. Men mistake by understanding that according to the letter, which the Scripture speaks by way of figure. When Jesus was risen from the dead, his disciples remembered he has said this. It helps much in understanding the Divine word, to observe the fulfilling of the Scriptures.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A scourge - A whip.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of small cords - This whip was made as an emblem of authority, and also for the purpose of driving from the temple the cattle which had been brought there for sale. There is no evidence that he used any violence to the men engaged in that unhallowed traffic. The original word implies that these \"cords\" were made of twisted \"rushes\" or \"reeds\" - probably the ancient material for making ropes. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of small cords - This whip was made as an emblem of authority, and also for the purpose of driving from the temple the cattle which had been brought there for sale. There is no evidence that he used any violence to the men engaged in that unhallowed traffic. The original word implies that these \"cords\" were made of twisted \"rushes\" or \"reeds\" - probably the ancient material for making ropes. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. my Father's house—How close the resemblance of these remarkable words to Lu 2:49; the same consciousness of intrinsic relation to the temple—as the seat of His Father's most august worship, and so the symbol of all that is due to Him on earth—dictating both speeches. Only, when but a youth, with no authority, He was simply \"a Son in His own house\"; now He was \"a Son over His own house\" (Heb 3:6), the proper Representative, and in flesh \"the Heir,\" of his Father's rights.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "house of merchandise—There was nothing wrong in the merchandise; but to bring it, for their own and others' convenience, into that most sacred place, was a high-handed profanation which the eye of Jesus could not endure.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " At this his first coming, he gives them that sold doves a liberty to take their goods away; but at the last coming, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 21:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is said, he overturned their seats. Those that think this precedent sufficient to vindicate private persons tumultuous pulling down images, seem not to consider, that Christ was no private person, (though so esteemed), and did what he did as Lord of his house. Those who urge it as inferring magistrates and superiors duty in this case, urge it well; for it may well be from hence concluded, that it is the will of Christ, that places set apart for public worship, should neither wickedly be made dens of thieves, nor yet indecently made places for men to buy and sell in; though we can ascribe no such holiness to any place as to the temple, which had not only a particular dedication, but was built by God’s order, his acceptation of it declared, and had peculiar promises annexed to it; besides its prefiguration of Christ (of which we shall speak more afterward); yet even nature itself teacheth, that there is a decent reverence and respect due to such places. This action of Christ’s also, before he had published the doctrine of the gospel, instructs us, that those who have authority are not always to refrain from removing instruments of superstition and idolatry, or gross and indecent corruptions, until people be first by the preaching of the true doctrine persuaded willingly to part with them. But if this were to make God’s house a place of merchandise for men, there to sell oxen, and sheep, and doves, and keep shops for changing money; what do papists make such houses, by their showing their relics and images to people, thereby to get money for their priests, and for selling pardons, indulgences, &c.? Never were God’s houses to that degree made places of merchandise, and dens of thieves, if every one that cheateth for his profit be (as he is) a thief. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And said unto them that sold doves,.... For as these were kept in coups, or cages, they could not be drove, as the sheep and oxen, nor could they be let out, and fly, without the loss of the owners: and therefore Christ said to them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "take these things hence; not only the doves, but the pens, coups, or cages, in which they were, and both together: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "make not my Father's house an house of merchandise; so he calls the temple, which was built as an house for God, and where he took up his residence; where were the symbols of his presence; where his worship was kept, and sacrifices offered to him: and he asserts God, whose house this was, to be his Father, and himself to be his son, as none of the prophets that went before him did; and in such sense as neither men nor angels are; and which carries in it a reason why he was so much concerned for the honour of God, and so much resented the profanation of his house, because he was his Father. A like action with this, done by Christ at another time, is recorded in Matthew 21:12. This was at the beginning of his ministry, that at the close of it, in which he expressed himself with more warmth and severity than here: here he only charges them with making his Father's house an house of merchandise, but there with making it a den of thieves; since they had not only slighted, and despised his first reproof, but had returned to their evil ways, and might grow more wicked and audacious. This instance of Christ now coming into the temple as a public minister, and which was the first time of his entrance into it, after he had taken this character, was a further accomplishment of Malachi 3:1, for he now went into it, as the Lord and proprietor of it; and which this action of his in driving out the merchants, with their cattle, shows; and was a surprising instance of his divine power; and is equal to other miracles of his, that a single person, a stranger, one of no power and authority in the government, unassisted and unarmed, with only a scourge of small cords, should carry such awe and majesty with him, and inject such terror into, and drive such a number of men before him, who were selling things for religious uses, and were supported in it by the priests and sanhedrim of the nation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "make not my Father's house an house of merchandise; so he calls the temple, which was built as an house for God, and where he took up his residence; where were the symbols of his presence; where his worship was kept, and sacrifices offered to him: and he asserts God, whose house this was, to be his Father, and himself to be his son, as none of the prophets that went before him did; and in such sense as neither men nor angels are; and which carries in it a reason why he was so much concerned for the honour of God, and so much resented the profanation of his house, because he was his Father. A like action with this, done by Christ at another time, is recorded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This was at the beginning of his ministry, that at the close of it, in which he expressed himself with more warmth and severity than here: here he only charges them with making his Father's house an house of merchandise, but there with making it a den of thieves; since they had not only slighted, and despised his first reproof, but had returned to their evil ways, and might grow more wicked and audacious. This instance of Christ now coming into the temple as a public minister, and which was the first time of his entrance into it, after he had taken this character, was a further accomplishment of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for he now went into it, as the Lord and proprietor of it; and which this action of his in driving out the merchants, with their cattle, shows; and was a surprising instance of his divine power; and is equal to other miracles of his, that a single person, a stranger, one of no power and authority in the government, unassisted and unarmed, with only a scourge of small cords, should carry such awe and majesty with him, and inject such terror into, and drive such a number of men before him, who were selling things for religious uses, and were supported in it by the priests and sanhedrim of the nation. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And said unto them that sold doves, Take these things hence; make not my Father's house an house of merchandise.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "said unto them that sold doves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The doves could not be driven out. He calls to the owners to take the cages away. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my Father’s house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A distinct claim to Messiahship: it reminds us of ‘about My Father’s business’ (which may also mean ‘in My Father’s house’) spoken in the same place some 17 years before, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Possibly some who heard the Child’s claim heard the Man’s claim also.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an house of merchandise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Two years later things seem to have grown worse instead of better; the Temple has then become ‘a den of robbers’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "or",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘a bandits’ cave.’ See notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τοῦ Πατρός μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My Father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Surprising authority! [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Saviour proved Himself on this occasion Lord of the temple, and of all the feasts connected with it; therefore there was no reason why men should wonder, if either then He did not wait on to the end of the feast, or if afterwards He did not frequent all the feasts, or if he neglected to be present at the beginning of the feast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—Harm., p. 162.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he said to those that sold the doves.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The vendors of tethered or caged birds were as guilty of profanation as the rest. Some sentimental comments have gathered round this verse, as though the Lord were more tender in his treatment of the turtle doves than in that of the oxen or sheep. But there would be no meaning in such a distinction. No other way of scattering the doves was so simple as to command their removal. At \"the Ammergan Passion play,\" the doves are let loose, fly away over the heads of the audience, and disappear. The lifting of the scourge, accompanied, doubtless, with words of solemn warning and command, said in effect what he now put into words. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Take these things hence. Make not the house of my Father a house of merchandise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this act our Lord simply assumed the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "role",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of any and every Hebrew prophet. The Talmud enjoins the sanctity for which the Saviour pleads. He called the temple \"my Father's house\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and therefore claims especially to be the Son of God Most High. The Eternal, the Holy One of Israel, stands in this mysterious relationship to him. He does not say, \"our Father's house.\" When, however, alter the second cleansing of the temple, he spake of the temple, from which he finally withdrew (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he called it by no other name than \"your house,\" \"left unto you desolate.\" Moreover, on that subsequent occasion, he used, in place of \"house of merchandise,\" the bitter description, \"den of robbers\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This first act was reformatory of a gross abuse; the latter was judicial and condemnatory (see Hengstenberg, 'Christology' and 'Comm.,' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Archdeacon Watkins has wisely called attention to the contrast between this scene and sign and that given at Cana. Here we see how true it was that his hour had not yet come. John 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My Father's house",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on Father's business, Luke 2:49, and compare Matthew 23:38, where Jesus speaks of the temple as your house. The people had made God's house their own.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on Father's business, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 23:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where Jesus speaks of the temple as your house. The people had made God's house their own.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Merchandise (ἐμπορίου)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Only here in the New Testament. The Synoptists say a den of robbers. ",
        "children": []
      }
    ]
  }
]