[{"num":20,"verse":"¶ And it came to pass in the seventh year, in the fifth month, the tenth day of the month, that certain of the elders of Israel came to enquire of the LORD and sat before me."},{"num":2,"verse":"Then came the word of the LORD unto me, saying,"},{"num":3,"verse":"Son of man, speak unto the elders of Israel and say unto them, Thus hath the Lord GOD said: Are ye come to enquire of me? As I live, said the Lord GOD, I will not be enquired of by you."},{"num":4,"verse":"Dost thou desire to judge them? Dost thou desire to judge them, son of man? Notify them of the abominations of their fathers:"},{"num":5,"verse":"¶ And say unto them, Thus hath the Lord GOD said; In the day when I chose Israel and lifted up my hand for the seed of the house of Jacob and made myself known unto them in the land of Egypt when I lifted up my hand unto them, saying, I am the LORD your God;"},{"num":6,"verse":"in the day that I lifted up my hand unto them with an oath that I would bring them forth from the land of Egypt into a land that I had prepared for them, flowing with milk and honey, which is the most beautiful of all lands,"},{"num":7,"verse":"then said I unto them, Cast away each one of you all worship of god fabricated by carnal appearance and do not defile yourselves with the idols of Egypt: I am the LORD your God."},{"num":8,"verse":"But they rebelled against me and did not desire to hearken unto me; each one did not cast away the abominations of their eyes, neither did they forsake the idols of Egypt; then I said, I will pour out my fury upon them, to accomplish my anger against them in the midst of the land of Egypt."},{"num":9,"verse":"With all this, I intervened for my name’s sake that it should not be polluted before the Gentiles, among whom they were, in whose sight I made myself known unto them, in bringing them forth out of the land of Egypt."},{"num":10,"verse":"¶ Therefore I took them out of the land of Egypt and brought them into the wilderness;"},{"num":11,"verse":"and I gave them my statutes and declared unto them my rights, by which the man that does them shall live by them."},{"num":12,"verse":"And I also gave them my sabbaths to be a sign between me and them, that they might know that I am the LORD that sanctifies them."},{"num":13,"verse":"But the house of Israel rebelled against me in the wilderness: they did not walk in my statutes, and they despised my rights, by which the man that does them shall live by them; and my sabbaths they greatly polluted; therefore I said, I would pour out my fury upon them in the wilderness to consume them."},{"num":14,"verse":"But I intervened for my name’s sake, that it should not be polluted before the Gentiles, in whose sight I brought them out."},{"num":15,"verse":"Yet I also lifted up my hand unto them in the wilderness, with an oath that I would not bring them into the land which I had given them, flowing with milk and honey, which is the most beautiful of all lands,"},{"num":16,"verse":"because they despised my rights and did not walk in my statutes but polluted my Sabbaths, for their heart went after their idols."},{"num":17,"verse":"With all this, my eye spared them from destroying them, neither did I make an end of them in the wilderness."},{"num":18,"verse":"But I said unto their sons in the wilderness: Do not walk in the statutes of your fathers, neither keep their laws, nor defile yourselves with their idols:"},{"num":19,"verse":"I am the LORD your God; walk in my statutes, and keep my rights, and do them;"},{"num":20,"verse":"and hallow my sabbaths; and they shall be a sign between me and you, that ye may know that I am the LORD your God."},{"num":21,"verse":"Notwithstanding, the sons rebelled against me: they did not walk in my statutes, nor keep my rights to do them, by which the man that does them shall live by them; they polluted my Sabbaths; then I said: I would pour out my fury upon them to accomplish my anger against them in the wilderness."},{"num":22,"verse":"Nevertheless, I withdrew my hand and intervened for my name’s sake that it should not be polluted in the sight of the Gentiles in whose sight I brought them forth."},{"num":23,"verse":"I lifted up my hand unto them also in the wilderness with an oath that I would scatter them among the Gentiles and disperse them through the countries"},{"num":24,"verse":"because they had not executed my rights and had despised my statutes and had polluted my sabbaths, and their eyes were after their fathers’ idols."},{"num":25,"verse":"For this reason I also gave them statutes that were not good and rights by which they could not live,"},{"num":26,"verse":"and I polluted them in their offerings when they caused to pass through the fire all that opens the womb that I might make them desolate, to the end that they might know that I am the LORD."},{"num":27,"verse":"¶ Therefore, son of man, speak unto the house of Israel and say unto them, Thus hath the Lord GOD said: Even in this your fathers have blasphemed me when they committed rebellion against me."},{"num":28,"verse":"For when I had brought them into the land, for which I lifted up my hand to give it to them, then they saw every high hill and all the thick trees, and they offered there their sacrifices, and there they presented the provocation of their offerings; there also they made their sweet savour and poured out there their drink offerings."},{"num":29,"verse":"Then I said unto them, What is the high place unto which ye go? And its name is called Bamah unto this day."},{"num":30,"verse":"Therefore say unto the house of Israel, Thus hath the Lord GOD said: Perchance are ye polluted after the manner of your fathers? and do ye commit whoredom after their abominations?"},{"num":31,"verse":"For when ye offer your gifts, when ye make your sons to pass through the fire, ye pollute yourselves with all your idols, even unto this day; and shall I be enquired of by you, O house of Israel? As I live, said the Lord GOD, I will not be enquired of by you."},{"num":32,"verse":"And that which ye think shall not be at all, that ye say, We will be as the Gentiles, as the families of the nations to serve wood and stone."},{"num":33,"verse":"¶ As I live, said the Lord GOD, surely with a mighty hand and with a stretched out arm and with fury poured out, I must rule over you:"},{"num":34,"verse":"and I will bring you out from among the peoples and will gather you out of the countries in which ye are scattered with a mighty hand and with a stretched out arm and with fury poured out."},{"num":35,"verse":"And I will bring you into the wilderness of peoples, and there I will litigate with you face to face."},{"num":36,"verse":"Like as I litigated with your fathers in the wilderness of the land of Egypt, so I will litigate with you, said the Lord GOD."},{"num":37,"verse":"And I will cause you to pass under the rod, and I will bring you into the bond of the covenant:"},{"num":38,"verse":"and I will purge out from among you the rebels and those that rebelled against me; I will take them out of the country where they have gone, and they shall not enter into the land of Israel: and ye shall know that I am the LORD."},{"num":39,"verse":"As for you, O house of Israel, thus hath the Lord GOD said: Go, serve ye each one his idols, and hereafter also, if ye will not hearken unto me, but do not pollute my holy name any longer with your gifts and with your idols."},{"num":40,"verse":"For in the mountain of my holiness, in the high mountain of Israel, said the Lord GOD, there shall all the house of Israel serve me, all of them in the land; there will I be pleased with them, and there will I require your offerings and the firstfruits of your gifts with all your sacred things."},{"num":41,"verse":"I will accept you with your sweet savour when I have brought you out from among the peoples and gathered you out of the countries in which ye have been scattered; and I will be sanctified in you in the eyes of the Gentiles."},{"num":42,"verse":"And ye shall know that I am the LORD when I shall bring you into the land of Israel, into the land for which I lifted up my hand to give it to your fathers."},{"num":43,"verse":"And there ye shall remember your ways and all your doings, in which ye have been defiled; and ye shall loathe yourselves in your own sight for all your evils that ye have committed."},{"num":44,"verse":"And ye shall know that I am the LORD when I have intervened with you for my name’s sake, not according to your wicked ways, nor according to your corrupt doings, O ye house of Israel, said the Lord GOD."},{"num":45,"verse":"¶ Moreover the word of the LORD came unto me, saying,"},{"num":46,"verse":"Son of man, set thy face toward the south and drop thy word toward the south, and prophesy against the forest of the south field;"},{"num":47,"verse":"and thou shalt say to the forest of the south, Hear the word of the LORD. Thus hath the Lord GOD said: Behold, I kindle a fire in thee, which shall devour every green tree in thee and every dry tree; the flame of the fire shall not be quenched, and all faces from the south to the north shall be burned therein."},{"num":48,"verse":"And all flesh shall see that I the LORD have kindled it; it shall not be quenched."},{"num":49,"verse":"Then I said, Ah Lord GOD! they say of me, Does he not speak parables?"}]