[{"header":"Israel’s Continuing Rebellion"},{"num":20,"verse":"In the seventh year, in the fifth month, on the tenth day of the month, certain of the elders of Israel came to inquire of the Lord and sat before me."},{"num":2,"verse":"Then the word of the Lord came to me, saying: "},{"num":3,"verse":"Son of man, speak to the elders of Israel, and say to them: Thus says the Lord God: Do you come to inquire of Me? As I live, says the Lord God, I will not be inquired of by you."},{"num":4,"verse":"Will you judge them, son of man, will you judge them? Cause them to know the abominations of their fathers. "},{"num":5,"verse":"And say to them: Thus says the Lord God: On the day when I chose Israel, and lifted up My hand to the seed of the house of Jacob, and made Myself known to them in the land of Egypt, when I lifted up My hand to them, saying, I am the Lord your God, "},{"num":6,"verse":"on that day that I lifted up My hand to them to bring them out of the land of Egypt into a land that I had selected for them, flowing with milk and honey, which is the glory of all lands, "},{"num":7,"verse":"then I said to them: Cast away, each of you, the abominations of his eyes, and do not defile yourselves with the idols of Egypt. I am the Lord your God."},{"num":8,"verse":"But they rebelled against Me and would not listen to Me. They did not cast away the abominations of their eyes, nor did they forsake the idols of Egypt. Then I said I will pour out My fury upon them, to accomplish My anger against them in the midst of the land of Egypt. "},{"num":9,"verse":"But I acted for My name’s sake, that it should not be polluted before the nations among whom they were, in whose sight I made Myself known to them in bringing them out of the land of Egypt. "},{"num":10,"verse":"Therefore I caused them to go forth out of the land of Egypt and brought them into the wilderness. "},{"num":11,"verse":"I gave them My statutes and showed them My judgments, which if a man does them, he shall live. "},{"num":12,"verse":"Moreover I gave them My Sabbaths to be a sign between them and Me, that they might know that I am the Lord who sanctifies them."},{"num":13,"verse":"But the house of Israel rebelled against Me in the wilderness. They did not walk in My statutes, and they despised My judgments, which if a man does them, he shall live. And My Sabbaths they greatly polluted. Then I said I would pour out My fury upon them in the wilderness to consume them. "},{"num":14,"verse":"But I acted for My name’s sake, that it should not be polluted before the nations in whose sight I brought them out. "},{"num":15,"verse":"Also I lifted up My hand to them in the wilderness that I would not bring them into the land which I had given them, flowing with milk and honey, which is the glory of all lands, "},{"num":16,"verse":"because they despised My judgments and did not walk in My statutes, but polluted My Sabbaths. For their hearts went after their idols. "},{"num":17,"verse":"Nevertheless My eye spared them from destroying them, nor did I make an end of them in the wilderness. "},{"num":18,"verse":"But I said to their children in the wilderness: Do not walk in the statutes of your fathers, neither observe their judgments, nor defile yourselves with their idols. "},{"num":19,"verse":"I am the Lord your God: Walk in My statutes, and keep My judgments, and do them. "},{"num":20,"verse":"And hallow My Sabbaths. And they shall be a sign between Me and you that you may know that I am the Lord your God."},{"num":21,"verse":"Yet the children rebelled against Me. They did not walk in My statutes, nor did they keep My judgments to do them, which if a man does them, he shall live. They polluted My Sabbaths. Then I said I would pour out My fury upon them to accomplish My anger against them in the wilderness. "},{"num":22,"verse":"Nevertheless I withdrew My hand and acted for My name’s sake, that it should not be polluted in the sight of the nations in whose sight I brought them out. "},{"num":23,"verse":"I lifted up My hand to them also in the wilderness, that I would scatter them among the nations and disperse them through the countries, "},{"num":24,"verse":"because they had not executed My judgments, but had despised My statutes and had polluted My Sabbaths, and their eyes were after their fathers’ idols. "},{"num":25,"verse":"Therefore I gave them also statutes that were not good and judgments by which they could not live. "},{"num":26,"verse":"And I pronounced them unclean because of their gifts, in that they caused to pass through the fire all who opened the womb, that I might make them desolate in order that they might know that I am the Lord."},{"num":27,"verse":"Therefore, son of man, speak to the house of Israel and say to them, Thus says the Lord God: Yet in this your fathers have blasphemed Me, in that they have committed a trespass against Me. "},{"num":28,"verse":"When I had brought them into the land for which I lifted up My hand to give it to them, then they saw every high hill and all the leafy trees, and there they offered their sacrifices, and there they presented the provocation of their offering. There also they made their sweet savor and there poured out their drink offerings. "},{"num":29,"verse":"Then I said to them: What is the high place to which you go? And the name is called Bamah to this day."},{"num":30,"verse":"Therefore say to the house of Israel, Thus says the Lord God: Will you pollute yourselves after the manner of your fathers and commit harlotry after their abominations? "},{"num":31,"verse":"When you offer your gifts, when you make your sons to pass through the fire, you pollute yourselves with all your idols, even to this day. And shall I be inquired of by you, O house of Israel? As I live, says the Lord God, I will not be inquired of by you."},{"num":32,"verse":"That which comes into your mind shall not come about when you say, “We will be as the nations, as the families of the countries, to serve wood and stone.”"},{"header":"God Will Restore Israel"},{"num":33,"verse":"As I live, says the Lord God, surely with a mighty hand and with a stretched-out arm and with fury poured out, I will rule over you. "},{"num":34,"verse":"And I will bring you out from the peoples and will gather you out of the countries in which you are scattered with a mighty hand and with a stretched-out arm and with fury poured out. "},{"num":35,"verse":"I will bring you into the wilderness of the peoples, and there I will enter into judgment with you face to face. "},{"num":36,"verse":"As I entered into judgment with your fathers in the wilderness of the land of Egypt, so I will enter into judgment with you, says the Lord God. "},{"num":37,"verse":"I will cause you to pass under the rod, and I will bring you into the bond of the covenant. "},{"num":38,"verse":"And I will purge from among you the rebels and those who transgress against Me. I will bring them out of the country where they sojourn, and they shall not enter into the land of Israel. And you shall know that I am the Lord."},{"num":39,"verse":"As for you, O house of Israel, thus says the Lord God: Go serve every one of you his idols, but later you shall surely listen to Me. But do not pollute My holy name anymore with your gifts and with your idols. "},{"num":40,"verse":"For on My holy mountain, on the mountain of the height of Israel, says the Lord God, there all the house of Israel, all of them, shall serve Me in the land. There I will accept them, and there I will seek your offerings and the first fruits of your gifts with all your holy things. "},{"num":41,"verse":"I will accept you with your sweet savor when I bring you out from the peoples and gather you out of the countries in which you have been scattered. And I will be sanctified among you before the nations. "},{"num":42,"verse":"You shall know that I am the Lord when I bring you into the land of Israel, into the country for which I lifted up My hand to give it to your fathers. "},{"num":43,"verse":"There you shall remember your ways and all your deeds in which you have been defiled. And you shall loathe yourselves in your own sight for all your evils that you have committed. "},{"num":44,"verse":"You shall know that I am the Lord when I have dealt with you for My name’s sake, not according to your wicked ways, or according to your corrupt deeds, O house of Israel, says the Lord God."},{"header":"A Prophecy Against the Negev"},{"num":45,"verse":"Moreover the word of the Lord came to me, saying: "},{"num":46,"verse":"Son of man, set your face toward the south, preach against the south, and prophesy against the forest land in the Negev. "},{"num":47,"verse":"And say to the forest of the Negev, Hear the word of the Lord. Thus says the Lord God: I will kindle a fire in you, and it shall devour every green tree in you and every dry tree. The flaming flame shall not be quenched, and all faces from the south to the north shall be burned in it. "},{"num":48,"verse":"All flesh shall see that I the Lord have kindled it. It shall not be quenched."},{"num":49,"verse":"Then I said, “Ah, Lord God! They say of me, ‘Does he not speak parables?’ ”"}]