[{"header":"The Lord Judges Sinful Israel"},{"num":20,"verse":"It was the seventh year since King Jehoiachin had been brought to Babylon as a prisoner. On the tenth day of the fifth month, some of the elders of Israel came to ask the Lord for advice. They sat down with me."},{"num":2,"verse":"Then a message from the Lord came to me. The Lord said, "},{"num":3,"verse":"“Son of man, speak to the elders of Israel. Tell them, ‘The Lord and King says, “Have you come to ask me for advice? I will not let you do that,” announces the Lord and King. “And that is just as sure as I am alive.” ’"},{"num":4,"verse":"“Are you going to judge them, son of man? Will you judge them? Tell them the evil things done by their people of long ago. I hate those things. "},{"num":5,"verse":"Tell them, ‘The Lord and King says, “I chose Israel. On that day I raised my hand and made a promise. I made a promise to the members of Jacob’s family line. I made myself known to them in Egypt. I raised my hand and told them, ‘I am the Lord your God.’ "},{"num":6,"verse":"On that day I promised I would bring them out of Egypt. I told them I would take them to a land I had found for them. It had plenty of milk and honey. It was the most beautiful land of all. "},{"num":7,"verse":"I said to them, ‘Each of you must get rid of the statues of the evil gods you worship. Do not make yourselves “unclean” by worshiping the gods of Egypt. I am the Lord your God.’"},{"num":8,"verse":"“ ‘ “But they refused to obey me. They would not listen to me. They did not get rid of the evil gods they worshiped. And they did not turn away from Egypt’s gods. So I said I would pour out all my great anger on them in Egypt. "},{"num":9,"verse":"I wanted my name to be honored. So I brought my people out of Egypt. I did it to keep my name from being treated as if it were not holy. I didn’t want this to happen in front of the nations around my people. I had made myself known to Israel in the sight of those nations. "},{"num":10,"verse":"So I led them out of Egypt. I brought them into the Desert of Sinai. "},{"num":11,"verse":"I gave them my rules. I made my laws known to them. The person who obeys them will live by them. "},{"num":12,"verse":"I also told them to observe my Sabbath days. That is the sign of the covenant I made with them. I wanted them to know that I made them holy. I am the Lord."},{"num":13,"verse":"“ ‘ “But in the desert the people of Israel refused to obey me. They did not follow my rules. They turned their backs on my laws. The person who obeys them will live by them. They totally misused my Sabbath days. So I said I would pour out my great anger on them. I would destroy them in the desert. "},{"num":14,"verse":"But I wanted my name to be honored. I kept it from being treated as if it were not holy. I did not want that to happen in front of the nations. They had seen me bring Israel out of Egypt. "},{"num":15,"verse":"I also raised my hand and made a promise in the desert. I told my people I would not bring them into the land I had given them. It had plenty of milk and honey. It was the most beautiful land of all. "},{"num":16,"verse":"But they turned their backs on my laws. They did not obey my rules. They misused my Sabbath days. Their hearts were committed to worshiping the statues of their gods. "},{"num":17,"verse":"Then I felt sorry for them. So I did not destroy them. I did not put an end to them in the desert. "},{"num":18,"verse":"I spoke to their children there. I said, ‘Do not follow the rules your parents gave you. Do not obey their laws. Do not make yourselves “unclean” by worshiping their gods. "},{"num":19,"verse":"I am the Lord your God. So follow my rules. Be careful to obey my laws. "},{"num":20,"verse":"Keep my Sabbath days holy. That is the sign of the covenant I made with you. You will know that I am the Lord your God.’"},{"num":21,"verse":"“ ‘ “But their children refused to obey me. They did not follow my rules. They were not careful to keep my laws. The person who obeys them will live by them. They misused my Sabbath days. So I said I would pour out all my great anger on them in the desert. "},{"num":22,"verse":"But I kept myself from punishing them at that time. I wanted my name to be honored. So I kept it from being treated as if it were not holy. I did not want that to happen in front of the nations. They had seen me bring Israel out of Egypt. "},{"num":23,"verse":"I also raised my hand and made a promise in the desert. I told my people I would scatter them among the nations. I would send them to other countries. "},{"num":24,"verse":"They had not obeyed my laws. They had turned their backs on my rules. They had misused my Sabbath days. They only wanted to worship the statues of their parents’ gods. "},{"num":25,"verse":"So I let them follow other rules. Those other rules were not good. I let them have laws they could not live by. "},{"num":26,"verse":"I let them become ‘unclean’ by offering sacrifices to other gods. They even sacrificed the first male child born in each family. I wanted to fill them with horror. Then they would know that I am the Lord.” ’"},{"num":27,"verse":"“Son of man, speak to the people of Israel. Tell them, ‘The Lord and King says, “Your people spoke evil things against me long ago. They were unfaithful to me. "},{"num":28,"verse":"But I brought them into the land. I had promised to give the land to them. Then they offered sacrifices that made me very angry. They did it on every high hill and under every green tree. There they brought their sweet-smelling incense. And there they poured out their drink offerings. "},{"num":29,"verse":"Then I said to them, ‘What is this high place you go to?’ ” ’ ” That high place is called Bamah to this day."},{"header":"The Lord Makes Israel New Again"},{"num":30,"verse":"The Lord said to me, “Speak to the Israelites. Tell them, ‘Here is what the Lord and King says. “Are you going to make yourselves ‘unclean’ the way your people of long ago did? Are you also going to want to worship the statues of their evil gods? "},{"num":31,"verse":"You make yourselves ‘unclean’ by offering sacrifices to other gods. You even sacrifice your children in the fire. You continue to do these things to this day. People of Israel, should I let you ask me for advice? I will not let you do that,” announces the Lord and King. “And that is just as sure as I am alive."},{"num":32,"verse":"“ ‘ “You say, ‘We want to be like the other nations. We want to be like all the other people in the world. They serve gods made out of wood and stone.’ But what you have in mind will never happen. "},{"num":33,"verse":"I will rule over you by reaching out my mighty hand and powerful arm. I will pour my great anger out on you,” announces the Lord and King. “And that is just as sure as I am alive. "},{"num":34,"verse":"I will bring you back from the nations. I will gather you together from the countries where you have been scattered. I will reach out my mighty hand and powerful arm. I will pour my great anger out on you. "},{"num":35,"verse":"I will send you among the nations. There I will judge you face to face. It will be as if I were judging you in the desert again. "},{"num":36,"verse":"Long ago, I judged your people in the desert of Egypt. In the same way, I will judge you,” announces the Lord and King. "},{"num":37,"verse":"“I will take note of you as you pass under my shepherd’s stick. I will separate those who obey me from those who do not. And I will give the blessings of the covenant to those of you who obey me. "},{"num":38,"verse":"I will get rid of those among you who turn against me. They refuse to obey me. I will bring them out of the land where they are living. But they will not enter the land of Israel. Then you will know that I am the Lord."},{"num":39,"verse":"“ ‘ “People of Israel, the Lord and King says, ‘Go, every one of you! Serve your gods. But later you will listen to me. You will no longer treat my name as if it were not holy. You will not offer sacrifices to other gods anymore. "},{"num":40,"verse":"People of Israel, you will all serve me,’ announces the Lord and King. ‘You will serve me on my high and holy mountain in Jerusalem. There I will accept you. I will require your offerings and your finest gifts. I want you to bring them along with all your other holy sacrifices. "},{"num":41,"verse":"I will bring you back from the nations. I will gather you together from the countries where you have been scattered. Then I will accept you as if you were sweet-smelling incense. I will show that I am holy among you. The nations will see it. "},{"num":42,"verse":"I will bring you into the land of Israel. Then you will know that I am the Lord. Long ago I raised my hand and made a promise. I promised to give that land to your people of long ago. "},{"num":43,"verse":"There you will remember your conduct. You will think about everything you did that made you “unclean.” And you will hate yourselves because of all the evil things you have done. "},{"num":44,"verse":"People of Israel, I will deal with you for the honor of my name. I will not deal with you based on your evil conduct and sinful practices. Then you will know that I am the Lord,’ announces the Lord and King.” ’ ”"},{"header":"Ezekiel Prophesies Against the South"},{"num":45,"verse":"A message from the Lord came to me. The Lord said, "},{"num":46,"verse":"“Son of man, turn your attention to Judah in the south. Preach against it. Prophesy against its forests. "},{"num":47,"verse":"Tell them, ‘Listen to the Lord’s message. The Lord and King says, “I am about to set you on fire. The fire will destroy all your trees. It will burn down green trees and dry trees alike. The blazing flame will not be put out. The faces of everyone from south to north will be burned by it. "},{"num":48,"verse":"Everyone will see that I started the fire. It will not be put out. I am the Lord.” ’ ”"},{"num":49,"verse":"Then I said, “Lord and King, people are talking about me. They are saying, ‘Isn’t he just telling stories?’ ”"}]