[{"header":"Israel Fights against God"},{"num":20,"verse":"On the tenth day of the fifth month in the seventh year, some of the leaders of Israel came to ask the Lord’s will, and they sat down in front of me. "},{"num":2,"verse":"The Word of the Lord came to me saying, "},{"num":3,"verse":"“Son of man, speak to the leaders of Israel. Tell them, ‘The Lord God says, “Have you come to ask My will? As I live,” says the Lord God, “I will not let you ask me anything.”’ "},{"num":4,"verse":"Will you judge them, son of man? Will you judge them? Make known to them the sinful things their fathers did. "},{"num":5,"verse":"Tell them, ‘The Lord God says, “On the day I chose Israel, I raised My hand and made a promise to the children of the family of Jacob and made Myself known to them in the land of Egypt. I made a promise to them, saying, ‘I am the Lord your God.’ "},{"num":6,"verse":"On that day I promised to bring them out of the land of Egypt to a land I had chosen for them, a land flowing with milk and honey, the most beautiful of all lands. "},{"num":7,"verse":"I said to them, ‘Each of you get rid of the sinful things you have looked upon. Do not make yourselves sinful with the false gods of Egypt. I am the Lord your God.’ "},{"num":8,"verse":"But they turned against Me and would not listen to Me. They did not get rid of the sinful things they had looked upon. And they did not turn away from the false gods of Egypt."},{"num":9,"verse":"But I acted for the good of My name. I did what would keep My name clean in the eyes of the nations they lived among, in whose eyes I made Myself known to them by bringing My people out of Egypt. "},{"num":10,"verse":"So I led them out of the land of Egypt and brought them into the desert. "},{"num":11,"verse":"I gave them My Laws and made known to them My Words, which bring life to anyone who obeys them. "},{"num":12,"verse":"I gave them My Days of Rest to be something special to see between Me and them, so they would know that I am the Lord Who makes them holy. "},{"num":13,"verse":"But the people of Israel turned against Me in the desert. They did not obey My Laws, and they turned away from My Words which bring life to anyone who obeys them. They made My Days of Rest very sinful. Then I said that I would be angry with them in the desert and destroy them. "},{"num":14,"verse":"But I acted for the good of My name. I did what would keep My name clean in the eyes of the nations who saw Me bring them out of Egypt. "},{"num":15,"verse":"So I promised them in the desert that I would not bring them into the land I had given them, the land flowing with milk and honey, the most beautiful of all lands. "},{"num":16,"verse":"This was because they turned away from My Laws and did not obey My Words. They did not keep My Days of Rest holy, for they followed after their false gods with all their heart. "},{"num":17,"verse":"Yet I looked on them with pity and did not destroy them. I did not make an end of them in the desert."},{"num":18,"verse":"“And I said to their children in the desert, ‘Do not keep the laws of your fathers, or follow their ways, or make yourselves sinful with their false gods. "},{"num":19,"verse":"I am the Lord your God. Keep My Laws and obey My Words. "},{"num":20,"verse":"Keep My Days of Rest holy, and they will be something special to see between Me and you. Then you will know that I am the Lord your God.’ "},{"num":21,"verse":"But the children turned against Me. They did not keep My Laws or obey My Words which bring life to anyone who obeys them. They did not keep My Days of Rest holy. So I said I would be angry with them. I would send My anger against them in the desert. "},{"num":22,"verse":"But I held My hand back, and acted for the good of My name, to keep it clean in the eyes of the nations who saw Me bring them out of Egypt. "},{"num":23,"verse":"And I promised them in the desert that I would send them everywhere among the nations and spread them out among the lands. "},{"num":24,"verse":"This is because they had not obeyed My Words. They had turned away from My Laws and did not keep My Days of Rest holy. And they worshiped the false gods of their fathers. "},{"num":25,"verse":"Then I gave them laws that were not good, and words they could not live by. "},{"num":26,"verse":"And I let them become sinful because of their gifts. I let them give all their first-born sons as burnt gifts. This was to punish them and show them that I am the Lord.”’"},{"num":27,"verse":"“So, son of man, speak to the people of Israel. Tell them, ‘The Lord God says, “This is another way that your fathers have brought shame to My name by not being faithful to Me. "},{"num":28,"verse":"I brought them into the land I promised to give them. And when they saw all the high hills and trees with many leaves, they gave their gifts on all of them and made Me angry. They also burned special perfume there, and poured out their drink gifts. "},{"num":29,"verse":"Then I said to them, ‘What is this high place you go to?’ So it is called Bamah to this day.”’ "},{"num":30,"verse":"So tell the people of Israel, ‘The Lord God says, “Will you make yourselves sinful in the same way your fathers did, and go after their sinful things? "},{"num":31,"verse":"When you give your gifts and make your sons go through the fire, you are making yourselves sinful with all your false gods to this day. Am I to let you question Me, O people of Israel? As I live,” says the Lord God, “I will not let you ask Me anything. "},{"num":32,"verse":"You say, ‘We will be like the nations, like the people of the lands, who serve wood and stone.’ But what you have in mind will never happen."},{"header":"Israel Will Come Back to God"},{"num":33,"verse":"“As I live,” says the Lord God, “I will be King over you, and will rule with a powerful hand, a strong arm, and with anger. "},{"num":34,"verse":"I will bring you out of the nations and countries where you have been divided. I will gather you together with a powerful hand, a strong arm, and with anger. "},{"num":35,"verse":"I will bring you into the desert of the nations, and there I will punish you face to face. "},{"num":36,"verse":"As I punished your fathers in the desert of Egypt, so I will punish you,” says the Lord God. "},{"num":37,"verse":"“I will hold power over you and make you obey the agreement. "},{"num":38,"verse":"I will take away from among you all those who sin or who turn against Me. I will bring them out of the land where they are living, but they will not go into the land of Israel. Then you will know that I am the Lord. "},{"num":39,"verse":"As for you, O people of Israel,” the Lord God says, “Go and serve your false gods, every one of you, now and later if you will not listen to Me. Do not ever again bring shame to My holy name with your gifts and your false gods. "},{"num":40,"verse":"For on My holy mountain, the high mountain of Israel,” says the Lord God, “all the people of Israel will serve Me in the land. There I will receive them. And there I will ask for the best of your gifts, with all your holy things. "},{"num":41,"verse":"I will receive you as the pleasing smell of special perfume, when I bring you out of the nations and gather you from the different lands where you have been sent. And I will prove Myself holy among you in the eyes of the nations. "},{"num":42,"verse":"Then you will know that I am the Lord, when I bring you into the land of Israel, the land I promised to give to your fathers. "},{"num":43,"verse":"There you will remember your ways and all the bad things you did to make yourselves sinful. And you will hate yourselves in your own eyes for all the sinful things you have done. "},{"num":44,"verse":"You will know that I am the Lord when I honor My name by being good to you even though your ways have been sinful and you have done many sinful things, O people of Israel,” says the Lord God.’”"},{"header":"Words against the South"},{"num":45,"verse":"The Word of the Lord came to me saying, "},{"num":46,"verse":"“Son of man, look toward the south. And speak out against the south and against the land of many trees in the Negev. "},{"num":47,"verse":"Say to the land of trees in the Negev, ‘Hear the Word of the Lord. The Lord God says, “See, I am about to start a fire that will destroy all of your green trees and all of your dry trees. The hot fire will not be put out, and every face from south to north will be burned by it. "},{"num":48,"verse":"Everyone will see that I, the Lord, have made the fire. It will not be put out.”’” "},{"num":49,"verse":"Then I said, “O Lord God! They are saying of me, ‘Is he not just telling picture-stories?’”"}]