[{"num":20,"verse":"And it was done in the seventh year, in the fifth month, in the tenth day of the month (on the tenth day of the month), men of the elders of Israel came to ask the Lord; and they sat before me."},{"num":2,"verse":"And the word of the Lord was made to me, and he said,"},{"num":3,"verse":"Son of man, speak thou to the elder men of Israel; and thou shalt say to them, The Lord God saith these things, Whether ye came to ask me? I live, for I shall not answer to you, saith the Lord God. (Son of man, speak thou to the elders of Israel; and thou shalt say to them, The Lord God saith these things, Did ye come here to ask me something? As I live, I shall not answer you, saith the Lord God.)"},{"num":4,"verse":"Son of man, if thou deemest them, if thou deemest, show thou to them the abominations of their fathers. (Son of man, if thou judgest them, yea, if thou judgest them, show thou to them their forefathers’ abominations.)"},{"num":5,"verse":"And thou shalt say to them, The Lord God saith these things, In the day in which I chose Israel, and raised mine hand for the generation of the house of Jacob, and I appeared to them in the land of Egypt, and I raised mine hand for them, and I said, I am your Lord God, (And thou shalt say to them, The Lord God saith these things, On the day on which I chose Israel, and raised up my hand for the descendants of the house of Jacob, and I appeared to them in the land of Egypt, and I raised up my hand for them, and I said, I am the Lord your God,)"},{"num":6,"verse":"in that day I raised mine hand for them, that I should lead them out of the land of Egypt (on that day that I raised up my hand for them, that I would lead them out of the land of Egypt), into the land which I had purveyed for them, a land flowing with milk and honey, which is noble among all lands."},{"num":7,"verse":"And I said to them, Each man cast away the offences of his eyes, and do not ye be defouled in the idols of Egypt; I am your Lord God. (And I said to them, Each person throw away the abominations before his eyes, and do not ye be defiled with the idols of Egypt; I am the Lord your God.)"},{"num":8,"verse":"And they stirred me to wrath, and would not hear me; each man casted not away the abominations of his eyes, neither they forsook the idols of Egypt. And I said, that I would shed out mine indignation on them, and [ful]fill my wrath in them, in the midst of the land of Egypt. (And they stirred me to anger, and would not listen to me; each person did not throw away the abominations before their eyes, nor did they abandon the idols of Egypt. And I said, that I would pour out my indignation upon them, and fulfill my anger against them, in the midst of the land of Egypt.)"},{"num":9,"verse":"And I did for my name, that it should not be defouled before heathen men, in the midst of whom they were, and among whom I appeared to them, that I should lead them out of the land of Egypt. (And I did it for the sake of my name, so that it would not be defiled before the heathen, in the midst of whom they were, and among whom I appeared to them, so that I could lead them out of the land of Egypt.)"},{"num":10,"verse":"Therefore I casted them out of the land of Egypt, and I led them out into desert; (And so I brought them out of the land of Egypt, and I led them out into the desert, or into the wilderness;)"},{"num":11,"verse":"and I gave to them my commandments, and I showed to them my dooms, which a man shall do, and live in those. (and I gave them my commandments, and I showed them, or I taught them, my laws, which a person shall do, and shall live because of them.)"},{"num":12,"verse":"Furthermore and I gave to them my sabbaths, that it should be a sign betwixt me and them, and that they should know, that I am the Lord hallowing them. (And furthermore I gave them my sabbaths, so that they would be a sign between me and them, and so that they would know, that I am the Lord who maketh them holy.)"},{"num":13,"verse":"And the house of Israel stirred me to wrath in desert; they went not in my commandments, and they casted away my dooms, which a man that doeth, shall live in those; and they defouled greatly my sabbaths. Therefore I said, that I would shed out my strong vengeance on them in desert, and waste them; (And the house of Israel stirred me to anger in the wilderness; they went not in my commandments, and they threw away my laws, which a person who doeth them, shall live in them; and they greatly defiled my sabbaths. And so I said, that I would pour out my strong vengeance upon them in the wilderness, and destroy them;)"},{"num":14,"verse":"and I did for my name, lest it were defouled before heathen men, from whom I casted them out in the sight of those. (and I did it for the sake of my name, lest it were defiled before the heathen, from whom I brought them out in their sight.)"},{"num":15,"verse":"Therefore I raised mine hand on them in the desert, that I brought not them into the land which I gave to them, the land flowing with milk and honey, the best of all lands. (And so I raised up my hand before them in the wilderness, and said that I would not bring them into the land which I had given them, the land flowing with milk and honey, yea, the best of all lands.)"},{"num":16,"verse":"For they casted away my dooms, and went not in my commandments, and they defouled my sabbaths; for the heart of them went after idols. (For they threw away my laws, and went not in my commandments, and they defiled my sabbaths; for their hearts went after idols.)"},{"num":17,"verse":"And mine eyes spared on them, that I killed not them, neither I wasted them in the desert. (And my eyes spared them, so that I did not kill them, and I did not destroy them in the wilderness.)"},{"num":18,"verse":"Forsooth I said to the sons of them in wilderness, Do no ye go in the commandments of your fathers, neither keep ye the dooms of them, neither be ye defouled in the idols of them. (For I said to them in the wilderness, Do no ye go in the commandments of your forefathers, neither keep ye, or obey ye, their laws, nor be ye defiled with their idols.)"},{"num":19,"verse":"I am your Lord God, go ye in my commandments, and keep ye my dooms, and do ye those. (I am the Lord your God, go ye in my commandments, and keep ye, or obey ye, my laws, and do ye them.)"},{"num":20,"verse":"And hallow ye my sabbaths, that it be a sign betwixt me and you, and that it be known, that I am your Lord God. (And make ye holy my sabbaths, so that it be a sign between me and you, and so that it be known, that I am the Lord your God.)"},{"num":21,"verse":"And the sons stirred me to wrath, and went not in my commandments, and kept not my dooms, that they did those, which when a man hath done, he shall live in those, and they defouled my sabbaths. And I menaced to them that I would shed out my strong vengeance on them, and [ful]fill my wrath in them in the desert. (But they stirred me to anger, and went not in my commandments, and kept not, or obeyed not, my laws, so that they did them, which when a person hath done them, he shall live in them, and they defiled my sabbaths. And I threatened them that I would pour out my strong vengeance upon them, and fulfill my anger against them in the wilderness.)"},{"num":22,"verse":"But I turned away mine hand, and I did this for my name, that it were not defouled before heathen men, from which I casted them out before the eyes of those. (But I turned away my hand, and I did this for the sake of my name, so that it was not defiled before the heathen, from whom I brought them out before their eyes.)"},{"num":23,"verse":"Again I raised (up) mine hand against them in (the) wilderness, that I should scatter them into (the) nations, and winnow them into (other) lands;"},{"num":24,"verse":"for that that they had not done my dooms, and had reproved my commandments, and had defouled my sabbaths, and their eyes had been (longing) after the idols of their fathers. (because they had not followed my laws, and had rejected my commandments, and had defiled my sabbaths, and their eyes had been longing after their forefathers’ idols.)"},{"num":25,"verse":"Therefore and I gave to them commandments (that were) not good, and dooms in which they shall not live. (And so I gave them commandments that were not good, and laws that would not bring them life.)"},{"num":26,"verse":"And I defouled them in their gifts (And I let them defile themselves with their gifts), when they offered to me for their trespasses all thing that openeth the womb; and (so) they shall know, that I am the Lord."},{"num":27,"verse":"Wherefore speak thou, son of man, to the house of Israel, and thou shalt say to them, The Lord God saith these things, Yet and in this your fathers blasphemed me, when they despising had forsaken me (And yet in this your forefathers blasphemed me, when they despising me had deserted me),"},{"num":28,"verse":"and I had brought them into the land on which I raised (up) mine hand, that I should give [it] to them, they saw each high little hill, and each tree full of boughs, and they offered there their sacrifices, and they gave there their offerings, into stirring (me) to wrath; and they set there the odour of their sweetness, and they offered their moist sacrifices (and they set forth their offerings of sweet aroma, and they offered their wine offerings)."},{"num":29,"verse":"And I said to them, What is the high thing, to which ye enter? And the name thereof is called High Thing till to this day. (And I said to them, What is the high place, or the hill shrine, to which ye enter? And its name is called High Place/Hill Shrine, or Bamah, unto this day.)"},{"num":30,"verse":"Therefore say thou to the house of Israel, The Lord God saith these things, Certainly ye be defouled in the way of your fathers, and ye do fornication after the offendings of them, (And so say thou to the house of Israel, The Lord God saith these things, Truly ye be defiled in the ways of your forefathers, and ye do fornication, or idolatry, after their abominations,)"},{"num":31,"verse":"and in the offering of your gifts, when ye led over your sons by fire, ye be defouled in all your idols till today, and shall I answer to you, the house of Israel? I live, saith the Lord God, for I shall not answer to you; (and in the offering of your gifts, when ye led your sons and your daughters through the fire, ye be defiled with all your idols unto this day, and so shall I answer you, O house of Israel? As I live, saith the Lord God, I shall not answer you;)"},{"num":32,"verse":"neither the thought of your soul shall be done, that say, We shall be as heathen men, and as [the] nations of earth, that we worship trees and stones. (nor shall the thoughts of your souls be done, that say, We shall be like the heathen, and like the nations of the earth, so that we worship wood and stones.)"},{"num":33,"verse":"(As) I live, saith the Lord God, for in strong hand, and in arm stretched forth, and in strong vengeance shed out, I shall reign [up]on you (I shall rule over you)."},{"num":34,"verse":"And I shall lead out you from peoples, and I shall gather you from lands, in which ye be scattered; in strong hand, and in arm stretched forth, and in strong vengeance shed out I shall reign on you. (And I shall lead you out from the peoples, or from the nations, and I shall gather you from the lands, in which ye be scattered; yea, with a strong hand, and an arm stretched forth, and with strong vengeance poured out I shall rule over you.)"},{"num":35,"verse":"And I shall bring you into desert of peoples, and I shall be deemed there with you face to face. (And I shall bring you into the wilderness of the nations, and I shall judge you there face to face.)"},{"num":36,"verse":"As I strived in doom against your fathers in the desert of the land of Egypt, so I shall deem you, saith the Lord; (Like I pronounced judgement against your forefathers in the desert, or in the wilderness, in the land of Egypt, so now I shall judge you, saith the Lord;)"},{"num":37,"verse":"and I shall make you subject to my sceptre, and I shall bring in you in the bonds of peace. (and I shall make you subject to my rod, or to my rule, and I shall bring you within, or make you obey, the covenant.)"},{"num":38,"verse":"And I shall choose of you trespassers, and wicked men (And I shall purge you of trespassers, and those who be wicked); and I shall lead them out of the land of their dwelling, and they shall not enter into the land of Israel; and ye shall know, that I am the Lord."},{"num":39,"verse":"And ye, the house of Israel, the Lord God saith these things, Go ye each man after your idols, and serve ye those. That and if ye hear not me in this, and defoul more mine holy name in your gifts, and in your idols, (And ye, O house of Israel, the Lord God saith these things, Go ye each person after your idols, and serve ye them. But if ye do not listen to me, or obey me, in this, and more defile my holy name with your gifts, and with your idols,)"},{"num":40,"verse":"in mine holy hill, in the high hill of Israel, saith the Lord God, ye shall be punished grievouslier. There all the house of Israel shall serve me, soothly all men in the land (truly all those in the land), in which they shall please me; and there I shall seek your first fruits, and the beginning of your tithes in all your hallowings."},{"num":41,"verse":"I shall receive you into odour of sweetness (I shall receive your offerings of sweet aroma), when I shall lead you out of (the) peoples, and shall gather you from (the) lands, in which ye were scattered; and I shall be hallowed in you before the eyes of the nations."},{"num":42,"verse":"And ye shall know, that I am the Lord, when I shall bring you into the land of Israel, into the land for which I raised (up) mine hand, that I should give it to your fathers (that I would give it to your forefathers)."},{"num":43,"verse":"And ye shall have mind there on your ways, and on all your great trespasses, by which ye be defouled in those; and ye shall displease you in your sight, in all your malices which ye did. (And ye shall remember there your ways, and all your great trespasses, by which ye be defiled in them; and ye shall displease yourselves in your own sight, with all your malices which ye did.)"},{"num":44,"verse":"And ye shall know, that I am the Lord, when I shall do well to you for my name (when I shall do well with you for the sake of my name); (and) not by your evil ways, neither by your worst trespasses, ye house of Israel, saith the Lord God."},{"num":45,"verse":"And the word of the Lord was made to me, and he said,"},{"num":46,"verse":"Thou, son of man, set thy face against the way of the south, and drop thou (thy word) to the south, and prophesy thou to the forest of the midday, [or south,] field. (Thou, son of man, set thy face toward the way of the south, and drop thou thy word to the south, and prophesy thou to the forest of the south, or to the Negeb.)"},{"num":47,"verse":"And thou shalt say to the midday, [or south(ern),] forest, Hear thou the word of the Lord. The Lord God saith these things, Lo! I shall kindle a fire in thee, and I shall burn in thee each green tree, and each dry tree; the flame of burning shall not be quenched, and each face shall be burnt therein, from the south till to the north. (And thou shalt say to the southern forest, or to the Negeb, Hear thou the word of the Lord. The Lord God saith these things, Lo! I shall kindle a fire in thee, and I shall burn each green tree, and each dry tree, in thee; the flame of burning shall not be quenched, and each face shall be burned there, from the south unto the north.)"},{"num":48,"verse":"And each man shall see (And each person shall see), that I the Lord have kindled it, and it shall not be quenched."},{"num":49,"verse":"And I said, A! A! A! Lord God, they say of me, Whether this man speaketh not by parables? (And I said, O! O! O! Lord God, they say of me, Speaketh this man only by parables?)"}]