[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:7-13 Micah thought it was a sign of God's favour to him and his images, that a Levite should come to his door. Thus those who please themselves with their own delusions, if Providence unexpectedly bring any thing to their hands that further them in their evil way, are apt from thence to think that God is pleased with them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Which was also of Mount Ephraim - i. e., of the country of the Levite. This single giver of hospitality was himself a stranger and sojourner at Gibeah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jud 19:16-21. An Old Man Entertains Him at Gibeah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16. there came an old man from his work out of the field at even, which was also of mount Ephraim—Perhaps his hospitality was quickened by learning the stranger's occupation, and that he was on his return to his duties at Shiloh.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he had lifted up his eyes,.... For it may be, as he came out of the field, he was musing and meditating with his eyes downwards directed, but coming into the city looked up: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he saw a wayfaring man in the street of the city; whom he supposed to be a traveller and a stranger by his dress, and other circumstances, having never seen him before, and knowing pretty well the inhabitants of the place: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the old man said, whither goest thou? and whence comest thou? the meaning of the questions is, what place he was travelling to, and from whence he came last. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the old man said, whither goest thou? and whence comest thou? the meaning of the questions is, what place he was travelling to, and from whence he came last. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when he had lifted up his eyes, he saw a wayfaring man in the street of the city: and the old man said, Whither goest thou? and whence comest thou?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Behold, there came an old man from the field, who was of the mountains of Ephraim, and dwelt as a stranger in Gibeah, the inhabitants of which were Benjaminites (as is observed here, as a preliminary introduction to the account which follows). When he saw the traveller in the market-place of the town, he asked him whither he was going and whence he came; and when he had heard the particulars concerning his descent and his journey, he received him into his house. ואת־בּית י הלך אני (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 19:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"and I walk at the house of Jehovah, and no one receives me into his house\" (Seb. Schm., etc.); not \"I am going to the house of Jehovah\" (Ros., Berth., etc.), for את הלך does not signify to go to a place, for which the simple accusative is used either with or without ה local. It either means \"to go through a place\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), or \"to go with a person,\" or, when applied to things, \"to go about with anything\" (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Ges. Thes. p. 378). Moreover, in this instance the Levite was not going to the house of Jehovah (i.e., the tabernacle), but, as he expressly told the old man, from Bethlehem to the outermost sides of the mountains of Ephraim. The words in question explain the reason why he was staying in the market-place. Because he served at the house of Jehovah, no one in Gibeah would receive him into his house, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: As Seb. Schmidt correctly observes, \"the argument is taken from the indignity shown him: the Lord thinks me worthy to minister to Him, as a Levite, in His house, and there is not one of the people of the Lord who thinks me worthy to receive his hospitality.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "although, as he adds in Judges 19:19, he had everything with him that was requisite for his wants. \"We have both straw and fodder for our asses, and bread and wine for me and thy maid, and for the young man with thy servants. No want of anything at all,\" so as to cause him to be burdensome to his host. By the words \"thy maid\" and \"thy servants\" he means himself and his concubine, describing himself and his wife, according to the obsequious style of the East in olden times, as servants of the man from whom he was expecting a welcome.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "although, as he adds in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 19:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he had everything with him that was requisite for his wants. \"We have both straw and fodder for our asses, and bread and wine for me and thy maid, and for the young man with thy servants. No want of anything at all,\" so as to cause him to be burdensome to his host. By the words \"thy maid\" and \"thy servants\" he means himself and his concubine, describing himself and his wife, according to the obsequious style of the East in olden times, as servants of the man from whom he was expecting a welcome.",
            "children": []
          }
        ]
      }
    ]
  }
]