[{"header":"The Prince’s Offerings"},{"num":46,"verse":"“‘This is what the Sovereign Lord says: The gate of the inner court that faces east will be closed six working days, but on the Sabbath day it will be opened and on the day of the new moon it will be opened. "},{"num":2,"verse":"The prince will enter by way of the porch of the gate from the outside and will stand by the doorpost of the gate. The priests will provide his burnt offering and his peace offerings, and he will bow down at the threshold of the gate and then go out. But the gate will not be closed until evening. "},{"num":3,"verse":"The people of the land will bow down at the entrance of that gate before the Lord on the Sabbaths and on the new moons. "},{"num":4,"verse":"The burnt offering that the prince will offer to the Lord on the Sabbath day will be six unblemished lambs and one unblemished ram. "},{"num":5,"verse":"The grain offering will be an ephah with the ram, and the grain offering with the lambs will be as much as he is able to give, and a gallon of olive oil with an ephah. "},{"num":6,"verse":"On the day of the new moon he will offer an unblemished young bull and six lambs and a ram, all without blemish. "},{"num":7,"verse":"He will provide a grain offering: an ephah with the bull and an ephah with the ram, and with the lambs as much as he wishes, and a gallon of olive oil with each ephah of grain. "},{"num":8,"verse":"When the prince enters, he will come by way of the porch of the gate and will go out the same way."},{"num":9,"verse":"“‘When the people of the land come before the Lord at the appointed feasts, whoever enters by way of the north gate to worship will go out by way of the south gate; whoever enters by way of the south gate will go out by way of the north gate. No one will return by way of the gate they entered but will go out straight ahead. "},{"num":10,"verse":"When they come in, the prince will come in with them, and when they go out, he will go out."},{"num":11,"verse":"“‘At the festivals and at the appointed feasts the grain offering will be an ephah with the bull and an ephah with the ram, and with the lambs as much as one is able, and a gallon of olive oil with each ephah of grain. "},{"num":12,"verse":"When the prince provides a freewill offering, a burnt offering, or peace offerings as a voluntary offering to the Lord, the gate facing east will be opened for him, and he will provide his burnt offering and his peace offerings just as he did on the Sabbath. Then he will go out, and the gate will be closed after he goes out."},{"num":13,"verse":"“‘You will provide a lamb a year old without blemish for a burnt offering daily to the Lord; morning by morning he will provide it. "},{"num":14,"verse":"And you will provide a grain offering with it morning by morning, a sixth of an ephah, and a third of a gallon of olive oil to moisten the choice flour, as a grain offering to the Lord; this is a  perpetual statute. "},{"num":15,"verse":"Thus they will provide the lamb, the grain offering, and the olive oil morning by morning, as a perpetual burnt offering."},{"num":16,"verse":"“‘This is what the Sovereign Lord says: If the prince should give a gift to one of his sons as his inheritance, it will belong to his sons; it is their property by inheritance. "},{"num":17,"verse":"But if he gives a gift from his inheritance to one of his servants, it will be his until the year of liberty; then it will revert to the prince. His inheritance will only remain with his sons. "},{"num":18,"verse":"The prince will not take away any of the people’s inheritance by oppressively removing them from their property. He will give his sons an inheritance from his own possessions so that my people will not be scattered, each from his own property.’”"},{"num":19,"verse":"Then he brought me through the entrance, which was at the side of the gate, into the holy chambers for the priests, which faced north. There I saw a place at the extreme western end. "},{"num":20,"verse":"He said to me, “This is the place where the priests will boil the guilt offering and the sin offering, and where they will bake the grain offering, so that they do not bring them out to the outer court to transmit holiness to the people.”"},{"num":21,"verse":"Then he brought me out to the outer court and led me past the four corners of the court, and I noticed that in every corner of the court there was a court. "},{"num":22,"verse":"In the four corners of the court were  small courts, 70 feet in length and 52½ feet in width; the four were all the same size. "},{"num":23,"verse":"There was a row of masonry around each of the four courts, and places for boiling offerings were made under the rows all around. "},{"num":24,"verse":"Then he said to me, “These are the houses for boiling, where the ministers of the temple boil the sacrifices of the people.”"}]