[{"num":46,"verse":"The Lord and King says, “On the six working days of each week you must keep the east gate of the inner courtyard of the temple shut. But open it on Sabbath days and during New Moon feasts. "},{"num":2,"verse":"The prince must enter the temple area through the porch of the gateway. He must stand by the gatepost. The priests must sacrifice his burnt offering and friendship offerings. He must bow down in worship at the entrance of the gateway. Then he must leave. But the gate will not be shut until evening. "},{"num":3,"verse":"On Sabbath days and during New Moon feasts the people of the land must gather together. They must gather at the entrance of the temple gateway. That is where they must worship me. "},{"num":4,"verse":"The prince must bring a burnt offering to me on the Sabbath day. It will be six male lambs and a ram. They must not have any flaws. "},{"num":5,"verse":"He must offer 35 pounds of grain along with the ram. The grain he offers along with the lambs can be as much as he wants to give. He must also offer four quarts of olive oil for every 35 pounds of grain. "},{"num":6,"verse":"On the day of the New Moon feast the prince must make another offering. He must offer a young bull, six lambs and a ram. They must not have any flaws. "},{"num":7,"verse":"He must offer 35 pounds of grain along with the bull or ram. The grain he offers along with the lambs can be as much as he wants to give. He must also offer four quarts of olive oil for every 35 pounds of grain. "},{"num":8,"verse":"Here is how the prince must enter the temple area. He must go in through the porch of the gateway. And he must leave the same way."},{"num":9,"verse":"“The people of the land must worship me at the appointed feasts. Those who enter through the north gate must leave through the south gate. Those who enter through the south gate must leave through the north gate. They must not leave through the same gate they entered. Each one must go out the opposite gate. "},{"num":10,"verse":"The prince must be among them. He must go in when they go in. And he must leave when they leave. "},{"num":11,"verse":"At the yearly feasts and other appointed feasts there must be grain offerings. The prince must offer 35 pounds of grain along with a bull or ram. The grain he offers along with the lambs can be as much as he wants to give. He must also offer four quarts of olive oil for every 35 pounds of grain."},{"num":12,"verse":"“He may also bring another offering to me because he chooses to. It might be a burnt offering or friendship offering. When he brings it, the east gate must be opened for him. He will bring his offering just as he does on the Sabbath day. Then he will leave. After he has gone out, the gate must be shut."},{"num":13,"verse":"“Every day you must provide a lamb that is a year old. It must not have any flaws. It is a burnt offering to me. You must provide it every morning. "},{"num":14,"verse":"You must also offer grain along with it every morning. Bring six pounds of grain. Also bring one and a half quarts of olive oil to make the flour a little wet. So you will give the grain offering to me. That will be a law that will last for all time to come. "},{"num":15,"verse":"Provide the lamb, grain offering and oil every morning. They will be used for a regular burnt offering.”"},{"num":16,"verse":"The Lord and King says, “Suppose the prince makes a gift from his share of land. And he gives it to one of his sons. Then the property will also belong to his sons after him. It will be handed down to them. "},{"num":17,"verse":"But suppose he makes a gift from his share of land to one of his servants. Then the servant may keep it until the Year of Jubilee. After that, it will be returned to the prince. His property may be handed down only to his sons. It belongs to them. "},{"num":18,"verse":"The prince must not take any share of land that belongs to the people. He must not drive them off their property. He must give his sons their share out of his own property. Then not one of my people will be separated from their property.”"},{"num":19,"verse":"The man brought me through the entrance at the side of the north building. That’s where the priests’ sacred rooms were located. He showed me a place west of the building. "},{"num":20,"verse":"He said to me, “This is where the priests must cook the guilt offerings and sin offerings. They must also bake the grain offerings here. Then they will not have to bring the offerings into the outer courtyard. That will keep the people from touching the offerings and becoming holy.”"},{"num":21,"verse":"Then the man brought me to the outer courtyard. He led me around to its four corners. In each corner I saw another smaller courtyard. "},{"num":22,"verse":"So in the four corners of the outer courtyard were walled courtyards. Each one was 70 feet long and 53 feet wide. All of them were the same size. "},{"num":23,"verse":"Around the inside of each of the four courtyards was a stone ledge. Places for fire were built all around under each ledge. "},{"num":24,"verse":"The man said to me, “These are the kitchens. Those who serve at the temple must cook the people’s sacrifices here.”"}]