[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Asahel pursued after Abner.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Asahel, the youngest of the three nephews of David, took part in the battle with his elder brothers, and well knowing how completely the cause of Ish-bosheth depended upon Abner, pertinaciously sought him out in the pursuit. His great fleetness enabled him to overtake Abner and, coming behind him, endanger his life. Abner was unwilling to injure him, and only after remonstrating with him, and urging him to seek the spoil of some warrior more nearly his equal (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 2:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), did he unwillingly slay him “with the hinder end of his spear.” The spears were sharpened at the “hinder end” for the purpose of sticking them into the ground (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 26:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Abner’s reluctance to kill Asahel may have been partly on account of his extreme youth, but was chiefly through dread of the vengeance of Joab (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). “The fifth rib” here, and wherever else it occurs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 3:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 20:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), should be translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abdomen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:18-24 Death often comes by ways we least suspect. We are often betrayed by the accomplishments we are proud of! Asahel's swiftness, which he presumed so much upon, did him no service, but hastened his end.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Neither side had the advantage in the combat of twelve a side; hence, the quarrel was fought out with great fierceness by the two armies, and the victory was won by David. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2Sa 2:19-32. Asahel Slain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19-32. Asahel pursued after Abner—To gain the general's armor was deemed the grandest trophy. Asahel, ambitious of securing Abner's, had outstripped all other pursuers, and was fast gaining on the retreating commander. Abner, conscious of possessing more physical power, and unwilling that there should be \"blood\" between himself and Joab, Asahel's brother, twice urged him to desist. The impetuous young soldier being deaf to the generous remonstrance, the veteran raised the pointed butt of his lance, as the modern Arabs do when pursued, and, with a sudden back thrust, transfixed him on the spot, so that he fell, and lay weltering in his blood. But Joab and Abishai continued the pursuit by another route till sunset. On reaching a rising ground, and receiving a fresh reinforcement of some Benjamites, Abner rallied his scattered troops and earnestly appealed to Joab's better feelings to stop the further effusion of blood, which, if continued, would lead to more serious consequences—a destructive civil war. Joab, while upbraiding his opponent as the sole cause of the fray, felt the force of the appeal and led off his men; while Abner probably dreading a renewal of the attack when Joab should learn his brother's fate, and vow fierce revenge, endeavored, by a forced march, to cross the Jordan that night. On David's side the loss was only nineteen men, besides Asahel. But of Ish-bosheth's party there fell three hundred and sixty. This skirmish is exactly similar to the battles of the Homeric warriors, among whom, in the flight of one, the pursuit by another, and the dialogue held between them, there is vividly represented the style of ancient warfare.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Asahel pursued after Abner,.... Ambitious of the glory of taking or slaying the general of the army of Israel; trusting to his swiftness, not considering that the race is not always to the swift, and that he had to do with a veteran soldier, and he a raw young man, though valiant: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in going he turned not to the right hand nor to the left in following Abner; he kept his eye upon him, and pursued him closely, disregarding persons on the right or left he could have made prisoners; but those he neglected, being bent on taking Abner if possible. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and in going he turned not to the right hand nor to the left in following Abner; he kept his eye upon him, and pursued him closely, disregarding persons on the right or left he could have made prisoners; but those he neglected, being bent on taking Abner if possible. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Asahel pursued after Abner; and in going he turned not to the right hand nor to the left from following Abner.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Asahel pursued after Abner.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This episode is fully narrated, both because of Asahel's rank as David's nephew, and also because of its tragical consequences to Abner himself. Asahel was a son of Zeruiah, David's sister, and, while his own brothers were of little use to him, his nephews, Joab, Abishai, and Asahel, were the mainstays of David's throne. As their father's name is never mentioned, but only the mother's, Zeruiah was probably a woman of great ability, and her sons inherited it from her. Possibly she had married beneath her station, or her husband had died early; but certainly her sons, thinking more of her than of their father, had soon thrown in their lot with David her brother (but see note on ver. 32). The youngest of the  three, Asahel, was remarkable for his personal accomplishments, and especially for swiftness of foot, for which he was compared to the Zebi, the camp name of Jonathan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It now caused his death. For conscious that Abner was the sole support of Ishbosheth's party, and indignant at his challenge to useless slaughter, he pursued after him, allowing nothing to divert him from his object, and hoping to end the war by slaying the veteran commander. But though he had the fleetness of an Achilles, he had not his robust strength, and Abner, knowing that the combat was unequal, remonstrated with him, and bade him turn aside, and be content with winning the spoils of some meaner warrior. It is evident from this that Abner saw in this defeat in a battle of his own choosing, the certainty of the near downfall of the house of Saul, and, as he would then be in Joab's power, he was unwilling to have a blood feud with a man of such determined character. \"How,\" he asks, \"should I hold up my face to Joab thy brother?\" It would be his duty, as the avenger of blood, to slay me. Apparently, during this conference, he was standing with the butt end of his lance held towards Asahel, to ward off his blows, but, as the spearhead was turned the other way, Asahel forgot that even so it might be used for offence. For it was pointed, that it might be stuck in the ground at night (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and possibly shod with iron, though it is more likely that it was only hardened by being thrust into the fire. So when he saw that his words had no avail, and that Asahel was not on his guard, he suddenly struck him with it so violent a blow that it pierced his body right through, and Asahel fell down dead. It is probable, from the merciless force used, that there was a sudden outburst of anger on Abner's part. 2 Samuel 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As this single combat decided nothing, there followed a general and very sore or fierce battle, in which Abner and his troops were put to flight by the soldiers of David. The only thing connected with this, of which we have any further account, is the slaughter of Asahel by Abner, which is mentioned here (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 2:18-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") on account of the important results which followed. Of the three sons of Zeruiah, viz., Joab, Abishai, and Asahel, Asahel was peculiarly light of foot, like one of the gazelles; and he pursued Abner most eagerly, without turning aside to the right or to the left. ",
        "children": []
      }
    ]
  }
]