[{"num":23,"verse":"And Balaam said to Balak, Build me here seven altars, and prepare me here seven oxen and seven rams."},{"num":2,"verse":"And Balak did as Balaam had spoken, and Balak and Balaam offered on each altar a bull and a ram."},{"num":3,"verse":"And Balaam said to Balak, Stand by your burnt offering and I will go. Perhaps the Lord will come to meet me; and whatever He shows me I will tell you. And he went to a bare height."},{"num":4,"verse":"God met Balaam, who said to Him, I have prepared seven altars, and I have offered on each altar a bull and a ram."},{"num":5,"verse":"And the Lord put a speech in Balaam’s mouth, and said, Return to Balak and thus shall you speak."},{"num":6,"verse":"Balaam returned to Balak, who was standing by his burnt sacrifice, he and all the princes of Moab."},{"num":7,"verse":"Balaam took up his [figurative] speech and said: Balak, the king of Moab, has brought me from Aram, out of the mountains of the east, saying, Come, curse Jacob for me; and come, violently denounce Israel."},{"num":8,"verse":"How can I curse those God has not cursed? Or how can I [violently] denounce those the Lord has not denounced?"},{"num":9,"verse":"For from the top of the rocks I see Israel, and from the hills I behold him. Behold, the people [of Israel] shall dwell alone and shall not be reckoned and esteemed among the nations."},{"num":10,"verse":"Who can count the dust (the descendants) of Jacob and the number of the fourth part of Israel? Let me die the death of the righteous [those who are upright and in right standing with God], and let my last end be like theirs!"},{"num":11,"verse":"And Balak said to Balaam, What have you done to me? I brought you to curse my enemies, and here you have [thoroughly] blessed them instead!"},{"num":12,"verse":"And Balaam answered, Must I not be obedient and speak what the Lord has put in my mouth?"},{"num":13,"verse":"Balak said to him, Come with me, I implore you, to another place from which you can see them, though you will see only the nearest and not all of them; and curse them for me from there."},{"num":14,"verse":"So he took Balaam into the field of Zophim to the top of [Mount] Pisgah, and built seven altars, and offered a bull and a ram on each altar."},{"num":15,"verse":"Balaam said to Balak, Stand here by your burnt offering while I go to meet the Lord yonder."},{"num":16,"verse":"And the Lord met Balaam and put a speech in his mouth, and said, Go again to Balak and speak thus."},{"num":17,"verse":"And when he returned to Balak, he was standing beside his burnt offering, and the princes of Moab with him. And Balak said to him, What has the Lord said?"},{"num":18,"verse":"Balaam took up his [figurative] discourse and said: Rise up, Balak, and hear; listen [closely] to me, son of Zippor."},{"num":19,"verse":"God is not a man, that He should tell or act a lie, neither the son of man, that He should feel repentance or compunction [for what He has promised]. Has He said and shall He not do it? Or has He spoken and shall He not make it good?"},{"num":20,"verse":"You see, I have received His command to bless Israel. He has blessed, and I cannot reverse or qualify it."},{"num":21,"verse":"[God] has not beheld iniquity in Jacob [for he is forgiven], neither has He seen mischief or perverseness in Israel [for the same reason]. The Lord their God is with Israel, and the shout of praise to their King is among the people."},{"num":22,"verse":"God brought them forth out of Egypt; they have as it were the strength of a wild ox."},{"num":23,"verse":"Surely there is no enchantment with or against Jacob, neither is there any divination with or against Israel. [In due season and even] now it shall be said of Jacob and of Israel, What has God wrought!"},{"num":24,"verse":"Behold, a people! They rise up as a lioness and lift themselves up as a lion; he shall not lie down until he devours the prey and drinks the blood of the slain."},{"num":25,"verse":"And Balak said to Balaam, Neither curse them at all nor bless them at all."},{"num":26,"verse":"But Balaam answered Balak, Did I not say to you, All the Lord speaks, that I must do?"},{"num":27,"verse":"And Balak said to Balaam, Come, I implore you; I will take you to another place. Perhaps it will please God to let you curse them for me from there."},{"num":28,"verse":"So Balak brought Balaam to the top of [Mount] Peor, that overlooks [the wilderness or desert] Jeshimon."},{"num":29,"verse":"And Balaam said to Balak, Build me here seven altars, and prepare me here seven bulls and seven rams."},{"num":30,"verse":"And Balak did as Balaam had said, and offered a bull and a ram on each altar."}]