[{"header":"Balaam’s Oracles"},{"num":23,"verse":"Then Balaam said to Balak, “Build me seven altars here and prepare seven bulls and seven rams for me.” "},{"num":2,"verse":"So Balak did as Balaam directed, and they offered a bull and a ram on each altar. "},{"num":3,"verse":"Balaam said to Balak, “Stay here by your burnt offering while I am gone. Maybe the Lord will meet with me. I will tell you whatever He reveals to me.” So he went to a barren hill."},{"num":4,"verse":"God met with him and Balaam said to Him, “I have arranged seven altars and offered a bull and a ram on each altar.” "},{"num":5,"verse":"Then the Lord put a message in Balaam’s mouth and said, “Return to Balak and say what I tell you.”"},{"num":6,"verse":"So he returned to Balak, who was standing there by his burnt offering with all the officials of Moab."},{"header":"Balaam’s First Oracle"},{"num":7,"verse":"Balaam proclaimed his poem:"},{"num":11,"verse":"“What have you done to me?” Balak asked Balaam. “I brought you to curse my enemies, but look, you have only blessed them!”"},{"num":12,"verse":"He answered, “Shouldn’t I say exactly what the Lord puts in my mouth?”"},{"header":"Balaam’s Second Oracle"},{"num":13,"verse":"Then Balak said to him, “Please come with me to another place where you can see them. You will only see the outskirts of their camp; you won’t see all of them. From there, put a curse on them for me.” "},{"num":14,"verse":"So Balak took him to Lookout Field on top of Pisgah, built seven altars, and offered a bull and a ram on each altar."},{"num":15,"verse":"Balaam said to Balak, “Stay here by your burnt offering while I seek the Lord over there.”"},{"num":16,"verse":"The Lord met with Balaam and put a message in his mouth. Then He said, “Return to Balak and say what I tell you.”"},{"num":17,"verse":"So he returned to Balak, who was standing there by his burnt offering with the officials of Moab. Balak asked him, “What did the Lord say?”"},{"num":18,"verse":"Balaam proclaimed his poem:"},{"num":25,"verse":"Then Balak told Balaam, “Don’t curse them and don’t bless them!”"},{"num":26,"verse":"But Balaam answered him, “Didn’t I tell you: Whatever the Lord says, I must do?”"},{"header":"Balaam’s Third Oracle"},{"num":27,"verse":"Again Balak said to Balaam, “Please come. I will take you to another place. Maybe it will be agreeable to God that you can put a curse on them for me there.” "},{"num":28,"verse":"So Balak took Balaam to the top of Peor, which overlooks the wasteland."},{"num":29,"verse":"Balaam told Balak, “Build me seven altars here and prepare seven bulls and seven rams for me.” "},{"num":30,"verse":"So Balak did as Balaam said and offered a bull and a ram on each altar."}]