[{"header":"Chapter 23"},{"num":1,"verse":"Then Balaam said to Balak, “Build me seven altars here, and here prepare seven bulls and seven rams for me.” "},{"num":2,"verse":"So Balak did as Balaam had ordered, and Balak and Balaam offered a bull and a ram on each altar. "},{"num":3,"verse":"Balaam said to Balak, “Stand here by your burnt offering while I go over there. Perhaps the Lord will meet me, and then I will tell you whatever he lets me see.” And so he went out on the barren height. "},{"num":4,"verse":"Then God met Balaam, and Balak said to him: “I have erected the seven altars, and have offered a bull and a ram on each altar.” "},{"num":5,"verse":"The Lord put an utterance in Balaam’s mouth, and said: Go back to Balak, and speak accordingly. "},{"num":6,"verse":"So he went back to Balak, who was still standing by his burnt offering together with all the princes of Moab. "},{"num":7,"verse":"Then Balaam recited his poem:"},{"num":11,"verse":"“What have you done to me?” cried Balak to Balaam. “It was to lay a curse on my foes that I brought you here; but instead, you have blessed them!” "},{"num":12,"verse":"Balaam replied, “Is it not what the Lord puts in my mouth that I take care to repeat?”"},{"num":13,"verse":"The Second Oracle. Then Balak said to him, “Please come with me to another place from which you can see them; but you will see only some, not all of them, and from there lay a curse on them for me.” "},{"num":14,"verse":"So he brought him to a lookout post on the top of Pisgah, where he built seven altars and offered a bull and a ram on each of them. "},{"num":15,"verse":"Balaam then said to Balak, “Stand here by your burnt offering, while I seek a meeting over there.” "},{"num":16,"verse":"Then the Lord met Balaam, and, having put an utterance in his mouth, said to him: Return to Balak, and speak accordingly. "},{"num":17,"verse":"So he went to Balak, who was still standing by his burnt offering together with the princes of Moab. When Balak asked him, “What did the Lord say?” "},{"num":18,"verse":"Balaam recited his poem:"},{"num":25,"verse":"“Neither lay a curse on them nor bless them,” said Balak to Balaam. "},{"num":26,"verse":"But Balaam answered Balak, “Did I not tell you, ‘Everything the Lord tells me I must do’?”"},{"num":27,"verse":"The Third Oracle. Then Balak said to Balaam, “Come, let me bring you to another place; perhaps God will approve of your laying a curse on them for me from there.” "},{"num":28,"verse":"So he took Balaam to the top of Peor, that overlooks Jeshimon. "},{"num":29,"verse":"Balaam then said to Balak, “Build me seven altars here; and here prepare for me seven bulls and seven rams.” "},{"num":30,"verse":"And Balak did as Balaam had ordered, offering a bull and a ram on each altar."}]