[{"header":"Balaam Tells What Will Happen the First Time"},{"num":23,"verse":"Then Balaam said to Balak, “Build seven altars here for me. And make ready seven bulls and seven rams for me here.” "},{"num":2,"verse":"Balak did as Balaam had said. Balak and Balaam gave a bull and a ram on each altar in worship. "},{"num":3,"verse":"Then Balaam said to Balak, “Stand beside your burnt gift, and I will go. It might be that the Lord will come to me. And whatever He shows me I will tell you.” So he went up to a hill without trees. "},{"num":4,"verse":"God met Balaam. Balaam said to Him, “I have made seven altars. And I have given a bull and a ram on each altar in worship.” "},{"num":5,"verse":"Then the Lord put words in Balaam’s mouth, and said, “Return to Balak. This is what you should say.” "},{"num":6,"verse":"So Balaam returned to Balak, and saw him and all the leaders of Moab standing beside his burnt gift. "},{"num":7,"verse":"Balaam began speaking and said, “Balak the king of Moab has brought me from Aram, from the mountains of the east. ‘Come, curse Jacob for me,’ he said. ‘Come, say that Israel should be punished!’ "},{"num":8,"verse":"How can I curse those whom God has not cursed? How can I say that those should be punished whom God has not said should be punished? "},{"num":9,"verse":"I see Israel from the top of the rocks. I look at them from the hills. See, the people live apart. They will not be thought of as one of the nations. "},{"num":10,"verse":"Who can number the dust of Jacob, or number the fourth part of Israel? Let me die the death of those who are right and good. Let my end be like theirs!”"},{"num":11,"verse":"Balak said to Balaam, “What have you done to me? I took you to curse those who hate me. But see, you have asked that good would come to them!” "},{"num":12,"verse":"Balaam answered, “Must I not be careful to speak what the Lord puts in my mouth?”"},{"header":"Balaam Tells What Will Happen the Second Time"},{"num":13,"verse":"Balak said to him, “I beg you, come with me to another place from where you will see them. But you will only see a part of them and not all of them. Curse them for me from there.” "},{"num":14,"verse":"So he took him to the field of Zophim, to the top of Pisgah. He built seven altars and gave a bull and a ram on each altar. "},{"num":15,"verse":"Balaam said to Balak, “Stand here beside your burnt gift, while I meet the Lord over there.” "},{"num":16,"verse":"The Lord met Balaam and put words in his mouth and said, “Return to Balak. This is what you should say.” "},{"num":17,"verse":"So he returned to Balak, and saw him and all the leaders of Moab standing beside his burnt gift. Balak said to him, “What has the Lord said?” "},{"num":18,"verse":"Then Balaam began speaking and said, “Rise, O Balak, and hear! Listen to me, O son of Zippor! "},{"num":19,"verse":"God is not a man, that He should lie. He is not a son of man, that He should be sorry for what He has said. Has He said, and will He not do it? Has He spoken, and will He not keep His Word? "},{"num":20,"verse":"See, I have been told to speak good of Israel. When He has spoken good of them, I cannot change it. "},{"num":21,"verse":"No hard times are seen in Jacob. No trouble is seen in Israel. The Lord their God is with them. And the cry of a king is among them. "},{"num":22,"verse":"God brings them out of Egypt. He is for them like the horns of the wild bull. "},{"num":23,"verse":"For there is no special thing that has been shown against Jacob. Nothing has told of a bad future for Israel. Now it will be said of Jacob and Israel, ‘Look what God has done!’ "},{"num":24,"verse":"See, people rise like a female lion. It lifts itself like a lion. It will not lie down until it eats the food it has killed, and drinks the blood of the kill.” "},{"num":25,"verse":"Balak said to Balaam, “Do not curse them at all or pray that good would come to them!” "},{"num":26,"verse":"But Balaam answered Balak, “Did I not tell you that I must do whatever the Lord says?”"},{"header":"Balaam Tells What Will Happen the Third Time"},{"num":27,"verse":"Then Balak said to Balaam, “I beg you, come. I will take you to another place. It might be that God will be pleased to have you curse them for me from there.” "},{"num":28,"verse":"So Balak took Balaam to the top of Peor which looks over the desert. "},{"num":29,"verse":"Balaam said to Balak, “Build seven altars for me here. And make ready seven bulls and seven rams for me here.” "},{"num":30,"verse":"Balak did just as Balaam had said. He gave a bull and a ram on each altar in worship."}]