[{"header":"A Curse Turns to Blessings"},{"num":23,"verse":"Then Balaam said to Balak, “Build me seven altars here and prepare for me here seven bulls and seven rams.” "},{"num":2,"verse":"So Balak did just as Balaam had said. Balak and Balaam offered a bull and a ram on each altar. "},{"num":3,"verse":"Balaam said to Balak, “Stay here beside your offering. I will go and perhaps Adonai will meet me. Whatever message He shows me, I will tell you. Then he went to a barren height."},{"num":4,"verse":"God met with Balaam and he said to Him, “I have prepared seven altars, and on each altar I offered a bull and a ram.”"},{"num":5,"verse":"Adonai put a message into Balaam’s mouth and said, “Return to Balak and speak this.”"},{"num":6,"verse":"Balaam went back to him. Behold, he was standing beside his offering with all the princes of Moab. "},{"num":7,"verse":"Then he uttered his oracle and said,"},{"num":11,"verse":"Balak said to Balaam, “What have you done to me? I brought you to curse my enemies, but look, you’ve actually blessed them!”"},{"num":12,"verse":"But in response he said, “Mustn’t I speak whatever Adonai puts into my mouth?”"},{"num":13,"verse":"Then Balak said to him, “Come now with me to another place where you can see a part of them only, not all of them. Curse them for me from there.”"},{"num":14,"verse":"He took him to Lookout Field on top of Pisgah. He built seven altars and offered a bull and a ram on each altar."},{"num":15,"verse":"“Stay here beside your offering,” he said to Balak, “while I am meeting over there.”"},{"num":16,"verse":"Adonai met Balaam there and put a message into his mouth, and said, “Return to Balak and speak thus.” "},{"num":17,"verse":"So he went to him, and behold, he and the princes of Moab were standing beside his offering."},{"num":18,"verse":"So he uttered his oracle and said:"},{"num":25,"verse":"Then Balak said to Balaam, “Do not curse them or bless them at all!”"},{"num":26,"verse":"Balaam answered and said to Balak, “Haven’t I told you, ‘All that Adonai says, I must do?’"},{"num":27,"verse":"Balak said to Balaam, “Come with me to another place. Perhaps it will be pleasing to God and you may curse them for me from there.” "},{"num":28,"verse":"So Balak took Balaam to the top of Peor, overlooking the wasteland."},{"num":29,"verse":"Balaam said to Balak, “Build me seven altars here, and prepare seven bulls and seven rams for me.”"},{"num":30,"verse":"Balak did just as Balaam said, and offered a bull and a ram on each altar."}]