[{"header":"Jesus Washes His Disciples’ Feet"},{"num":13,"verse":"Before the Passover Festival, Jesus knew that his hour had come to depart from this world to the Father. Having loved his own who were in the world, he loved them to the end."},{"num":2,"verse":"Now when it was time for supper, the devil had already put it into the heart of Judas, Simon Iscariot’s son, to betray him. "},{"num":3,"verse":"Jesus knew that the Father had given everything into his hands, that he had come from God, and that he was going back to God. "},{"num":4,"verse":"So he got up from supper, laid aside his outer clothing, took a towel, and tied it around himself. "},{"num":5,"verse":"Next, he poured water into a basin and began to wash his disciples’ feet and to dry them with the towel tied around him."},{"num":6,"verse":"He came to Simon Peter, who asked him, “Lord, are you going to wash my feet?”"},{"num":7,"verse":"Jesus answered him, “What I’m doing you don’t realize now, but afterward you will understand.”"},{"num":8,"verse":"“You will never wash my feet,” Peter said."},{"num":9,"verse":"Simon Peter said to him, “Lord, not only my feet, but also my hands and my head.”"},{"num":10,"verse":"“One who has bathed,” Jesus told him, “doesn’t need to wash anything except his feet, but he is completely clean. You are clean, but not all of you.” "},{"num":11,"verse":"For he knew who would betray him. This is why he said, “Not all of you are clean.”"},{"header":"The Meaning of Foot Washing"},{"num":12,"verse":"When Jesus had washed their feet and put on his outer clothing, he reclined again and said to them, “Do you know what I have done for you? "},{"num":13,"verse":"You call me Teacher and Lord—and you are speaking rightly, since that is what I am. "},{"num":14,"verse":"So if I, your Lord and Teacher, have washed your feet, you also ought to wash one another’s feet. "},{"num":15,"verse":"For I have given you an example, that you also should do just as I have done for you."},{"num":16,"verse":"“Truly I tell you, a servant is not greater than his master, and a messenger is not greater than the one who sent him. "},{"num":17,"verse":"If you know these things, you are blessed if you do them."},{"num":18,"verse":"“I’m not speaking about all of you; I know those I have chosen. But the Scripture must be fulfilled:  The one who eats my bread has raised his heel against me. "},{"num":19,"verse":"I am telling you now before it happens, so that when it does happen you will believe that I am he. "},{"num":20,"verse":"Truly I tell you, whoever receives anyone I send receives me, and the one who receives me receives him who sent me.”"},{"header":"Judas’s Betrayal Predicted"},{"num":21,"verse":"When Jesus had said this, he was troubled in his spirit and testified, “Truly I tell you, one of you will betray me.”"},{"num":22,"verse":"The disciples started looking at one another—uncertain which one he was speaking about. "},{"num":23,"verse":"One of his disciples, the one Jesus loved, was reclining close beside Jesus. "},{"num":24,"verse":"Simon Peter motioned to him to find out who it was he was talking about. "},{"num":25,"verse":"So he leaned back against Jesus and asked him, “Lord, who is it?”"},{"num":26,"verse":"Jesus replied, “He’s the one I give the piece of bread to after I have dipped it.” When he had dipped the bread, he gave it to Judas, Simon Iscariot’s son. "},{"num":27,"verse":"After Judas ate the piece of bread, Satan entered him. So Jesus told him, “What you’re doing, do quickly.”"},{"num":28,"verse":"None of those reclining at the table knew why he said this to him. "},{"num":29,"verse":"Since Judas kept the money-bag, some thought that Jesus was telling him, “Buy what we need for the festival,” or that he should give something to the poor. "},{"num":30,"verse":"After receiving the piece of bread, he immediately left. And it was night."},{"header":"The New Command"},{"num":31,"verse":"When he had left, Jesus said, “Now the Son of Man is glorified, and God is glorified in him. "},{"num":32,"verse":"If God is glorified in him, God will also glorify him in himself and will glorify him at once. "},{"num":33,"verse":"Little children, I am with you a little while longer. You will look for me, and just as I told the Jews, so now I tell you, ‘Where I am going, you cannot come.’"},{"num":34,"verse":"“I give you a new command: Love one another. Just as I have loved you, you are also to love one another. "},{"num":35,"verse":"By this everyone will know that you are my disciples, if you love one another.”"},{"header":"Peter’s Denials Predicted"},{"num":36,"verse":"“Lord,” Simon Peter said to him, “where are you going?”"},{"num":37,"verse":"“Lord,” Peter asked, “why can’t I follow you now? I will lay down my life for you.”"},{"num":38,"verse":"Jesus replied, “Will you lay down your life for me? Truly I tell you, a rooster will not crow until you have denied me three times."}]