[{"header":"Washing the Disciples’ Feet"},{"num":13,"verse":"Now before the Passover Feast, Jesus knew that His hour had come to depart from this world to the Father. Having loved His own who were in the world, He loved them to the end."},{"num":2,"verse":"Now supper being concluded, the devil had put into the heart of Judas Iscariot, Simon’s son, to betray Him. "},{"num":3,"verse":"Jesus, knowing that the Father had given all things into His hands and that He came from God and was going to God, "},{"num":4,"verse":"rose from supper, laid aside His garments, and took a towel and wrapped Himself. "},{"num":5,"verse":"After that, He poured water into a basin and began to wash the disciples’ feet and to wipe them with the towel with which He was wrapped."},{"num":6,"verse":"Then He came to Simon Peter, and Peter said to Him, “Lord, are You washing my feet?”"},{"num":7,"verse":"Jesus answered him, “You do not understand what I am doing now. But later you will understand.”"},{"num":8,"verse":"Peter said to Him, “You shall never wash my feet!”"},{"num":9,"verse":"Simon Peter said to Him, “Lord, not my feet only, but also my hands and my head!”"},{"num":10,"verse":"Jesus said to him, “He who is bathed needs only to wash his feet, but is completely clean. You are clean, but not all of you.” "},{"num":11,"verse":"For He knew who would betray Him. Therefore He said, “Not all of you are clean.”"},{"num":12,"verse":"So when He had washed their feet, and put on His garments, and sat down again, He said to them, “Do you know what I have done to you? "},{"num":13,"verse":"You call Me Teacher and Lord. You speak accurately, for so I am. "},{"num":14,"verse":"If I then, your Lord and Teacher, have washed your feet, you also ought to wash one another’s feet. "},{"num":15,"verse":"For I have given you an example, that you should do as I have done to you. "},{"num":16,"verse":"Truly, truly I say to you, a servant is not greater than his master, nor is he who is sent greater than he who sent him. "},{"num":17,"verse":"If you know these things, blessed are you if you do them."},{"num":18,"verse":"“I do not speak concerning all of you. I know whom I have chosen, but that the Scripture may be fulfilled, ‘He who eats bread with Me has lifted up his heel against Me.’"},{"num":19,"verse":"“Now I tell you before it happens, that when it does happen, you may believe that I am He. "},{"num":20,"verse":"Truly, truly I say to you, he who receives whomever I send receives Me. And he who receives Me receives Him who sent Me.”"},{"header":"Jesus Foretells His Betrayal(A)"},{"num":21,"verse":"When Jesus had said this, He was troubled in spirit, and testified, “Truly, truly I say to you that one of you will betray Me.”"},{"num":22,"verse":"The disciples looked at one another, uncertain of whom He spoke. "},{"num":23,"verse":"Now there was leaning against Jesus’ bosom one of His disciples whom Jesus loved. "},{"num":24,"verse":"Therefore Simon Peter motioned to him to ask who it was of whom He spoke."},{"num":25,"verse":"Leaning back against Jesus’ bosom, he said to Him, “Lord, who is it?”"},{"num":26,"verse":"Jesus answered, “It is he to whom I shall give a piece of bread when I have dipped it.” When He had dipped the bread, He gave it to Judas Iscariot, the son of Simon. "},{"num":27,"verse":"After receiving the piece of bread, Satan entered him."},{"num":28,"verse":"But no one at the table knew why He said this to him. "},{"num":29,"verse":"Since Judas had the moneybox, some thought that Jesus said to him, “Buy what we need for the feast,” or that he should give something to the poor. "},{"num":30,"verse":"Having received the piece of bread, he then left immediately. And it was night."},{"header":"The New Commandment"},{"num":31,"verse":"When he had gone out, Jesus then said, “Now is the Son of Man glorified, and in Him God is glorified. "},{"num":32,"verse":"If God is glorified in Him, God will also glorify Him in Himself and will immediately glorify Him."},{"num":33,"verse":"“Little children, yet a little while I am with you. You will seek Me. And as I said to the Jews, so now I tell you, ‘Where I am going, you cannot come.’"},{"num":34,"verse":"“A new commandment I give to you, that you love one another, even as I have loved you, that you also love one another. "},{"num":35,"verse":"By this all men will know that you are My disciples, if you have love for one another.”"},{"header":"Peter’s Denial Foretold(B)"},{"num":36,"verse":"Simon Peter said to Him, “Lord, where are You going?”"},{"num":37,"verse":"Peter said to Him, “Lord, why can I not follow You now? I will lay down my life for Your sake.”"},{"num":38,"verse":"Jesus answered Him, “Will you lay down your life for My sake? Truly, truly I say to you, the rooster shall not crow until you have denied Me three times.”"}]