[[],[{"type":"header","content":"The Lord’s Supper"},{"type":"prose","content":"Now before the Feast of the Passover, Jesus, knowing that His hour had come that He would depart from this world to the Father, having loved His own who were in the world, He loved them to the end."}],[{"type":"prose","content":"And during supper, the devil having already put into the heart of Judas Iscariot,  of Simon, to betray Him,"}],[{"type":"prose","content":", knowing that the Father had handed all things over to Him, and that He had come forth from God and was going  to God,"}],[{"type":"prose","content":"*got up from supper and *laid His outer garments ; and He took a towel and tied it around Himself."},{"type":"header","content":"Jesus Washes the Disciples’ Feet"}],[{"type":"prose","content":"Then He *poured water into the basin, and began washing the disciples’ feet and wiping them with the towel which He had tied around Himself."}],[{"type":"prose","content":"So He *came to Simon Peter. He *said to Him, “Lord, You are washing my feet?”"}],[{"type":"prose","content":"Jesus answered and said to him, "}],[{"type":"prose","content":"Peter *said to Him, “Never shall You wash my feet!” Jesus answered him, "}],[{"type":"prose","content":"Simon Peter *said to Him, “Lord,  not only my feet, but also my hands and my head!”"}],[{"type":"prose","content":"Jesus *said to him, "}],[{"type":"prose","content":"For He knew the one who was betraying Him;  for this reason  He said, "}],[{"type":"prose","content":"Then, when He had washed their feet, and taken His garments and reclined  again, He said to them, "},{"type":"header","content":"Jesus Predicts His Betrayal"}],[{"type":"prose","content":"When Jesus had said these things, He became troubled in spirit, and testified and said, "}],[{"type":"prose","content":"The disciples  looking at one another, at a loss  of which one He was speaking."}],[{"type":"prose","content":"Lying back on Jesus’ chest was one of His disciples, whom Jesus loved."}],[{"type":"prose","content":"So Simon Peter *nodded to this  and *said to him, “Tell  who it is of whom He is speaking.”"}],[{"type":"prose","content":"He then simply leaned back on Jesus’ chest and *said to Him, “Lord, who is it?”"}],[{"type":"prose","content":"Jesus then *answered,  So when He had dipped the piece , He *took and *gave  to Judas,  of Simon Iscariot."}],[{"type":"prose","content":"After this, Satan then entered him. Therefore Jesus *said to him, "}],[{"type":"prose","content":"Now none of those reclining  knew for what purpose He had said this to him."}],[{"type":"prose","content":"For some were assuming, since Judas kept the money box, that Jesus was saying to him, “Buy the things we need for the feast”; or else, that he was to give something to the poor."}],[{"type":"prose","content":"So after receiving the piece , he left immediately; and it was night."}],[{"type":"prose","content":"Therefore when he had left, Jesus *said, "}],[{"type":"prose","content":"Simon Peter *said to Him, “Lord, where are You going?” Jesus answered, "}],[{"type":"prose","content":"Peter *said to Him, “Lord, why can I not follow You right now? I will lay down my life for You.”"}],[{"type":"prose","content":"Jesus *replied, "}]]