[{"header":"Washing the Disciples’ Feet"},{"num":13,"verse":"Just before the Passover Feast, Jesus knew that his time had come to depart from this world to the Father. Having loved his own who were in the world, he now loved them to the very end. "},{"num":2,"verse":"The evening meal was in progress, and the devil had already put into the heart of Judas Iscariot, Simon’s son, that he should betray Jesus. "},{"num":3,"verse":"Because Jesus knew that the Father had handed all things over to him, and that he had come from God and was going back to God, "},{"num":4,"verse":"he got up from the meal, removed his outer clothes, took a towel and tied it around himself. "},{"num":5,"verse":"He poured water into the washbasin and began to wash the disciples’ feet and to dry them with the towel he had wrapped around himself."},{"num":6,"verse":"Then he came to Simon Peter. Peter said to him, “Lord, are you going to wash my feet?” "},{"num":7,"verse":"Jesus replied, “You do not understand what I am doing now, but you will understand after these things.” "},{"num":8,"verse":"Peter said to him, “You will never wash my feet!” Jesus replied, “If I do not wash you, you have no share with me.” "},{"num":9,"verse":"Simon Peter said to him, “Lord, wash not only my feet, but also my hands and my head!” "},{"num":10,"verse":"Jesus replied, “The one who has bathed needs only to wash his feet, but is completely clean. And you disciples are clean, but not every one of you.” "},{"num":11,"verse":"(For Jesus knew the one who was going to betray him. For this reason he said, “Not every one of you is clean.”)"},{"num":12,"verse":"So when Jesus had washed their feet and put his outer clothing back on, he took his place at the table again and said to them, “Do you understand what I have done for you? "},{"num":13,"verse":"You call me ‘Teacher’ and ‘Lord,’ and do so correctly, for that is what I am. "},{"num":14,"verse":"If I then, your Lord and Teacher, have washed your feet, you too ought to wash one another’s feet. "},{"num":15,"verse":"For I have given you an example—you should do just as I have done for you. "},{"num":16,"verse":"I tell you the solemn truth, the slave is not greater than his master, nor is the one who is sent as a messenger greater than the one who sent him. "},{"num":17,"verse":"If you understand these things, you will be blessed if you do them."},{"header":"The Announcement of Jesus’ Betrayal"},{"num":18,"verse":"“What I am saying does not refer to all of you. I know the ones I have chosen. But this is to fulfill the scripture, ‘The one who eats my bread has turned against me.’ "},{"num":19,"verse":"I am telling you this now, before it happens, so that when it happens you may believe that I am he. "},{"num":20,"verse":"I tell you the solemn truth, whoever accepts the one I send accepts me, and whoever accepts me accepts the one who sent me.”"},{"num":21,"verse":"When he had said these things, Jesus was greatly distressed in spirit, and testified, “I tell you the solemn truth, one of you will betray me.” "},{"num":22,"verse":"The disciples began to look at one another, worried and perplexed to know which of them he was talking about. "},{"num":23,"verse":"One of his disciples, the one Jesus loved, was at the table to the right of Jesus in a place of honor. "},{"num":24,"verse":"So Simon Peter gestured to this disciple to ask Jesus who it was he was referring to. "},{"num":25,"verse":"Then the disciple whom Jesus loved leaned back against Jesus’ chest and asked him, “Lord, who is it?” "},{"num":26,"verse":"Jesus replied, “It is the one to whom I will give this piece of bread after I have dipped it in the dish.” Then he dipped the piece of bread in the dish and gave it to Judas Iscariot, Simon’s son. "},{"num":27,"verse":"And after Judas took the piece of bread, Satan entered into him. Jesus said to him, “What you are about to do, do quickly.” "},{"num":28,"verse":"(Now none of those present at the table understood why Jesus said this to Judas. "},{"num":29,"verse":"Some thought that, because Judas had the money box, Jesus was telling him to buy whatever they needed for the feast, or to give something to the poor.) "},{"num":30,"verse":"Judas took the piece of bread and went out immediately. (Now it was night.)"},{"header":"The Prediction of Peter’s Denial"},{"num":31,"verse":"When Judas had gone out, Jesus said, “Now the Son of Man is glorified, and God is glorified in him. "},{"num":32,"verse":"If God is glorified in him, God will also glorify him in himself, and he will glorify him right away. "},{"num":33,"verse":"Children, I am still with you for a little while. You will look for me, and just as I said to the Jewish religious leaders, ‘Where I am going you cannot come,’ now I tell you the same."},{"num":34,"verse":"“I give you a new commandment—to love one another. Just as I have loved you, you also are to love one another. "},{"num":35,"verse":"Everyone will know by this that you are my disciples—if you have love for one another.”"},{"num":36,"verse":"Simon Peter said to him, “Lord, where are you going?” Jesus replied, “Where I am going, you cannot follow me now, but you will follow later.” "},{"num":37,"verse":"Peter said to him, “Lord, why can’t I follow you now? I will lay down my life for you!” "},{"num":38,"verse":"Jesus answered, “Will you lay down your life for me? I tell you the solemn truth, the rooster will not crow until you have denied me three times!"}]