[[],[{"type":"header","content":"Jesus Washes His Disciples’ Feet"},{"type":"prose","content":"Before the Passover celebration, Jesus knew that his hour had come to leave this world and return to his Father. He had loved his disciples during his ministry on earth, and now he loved them to the very end."}],[{"type":"prose","content":"It was time for supper, and the devil had already prompted Judas, son of Simon Iscariot, to betray Jesus."}],[{"type":"prose","content":"Jesus knew that the Father had given him authority over everything and that he had come from God and would return to God."}],[{"type":"prose","content":"So he got up from the table, took off his robe, wrapped a towel around his waist,"}],[{"type":"prose","content":"and poured water into a basin. Then he began to wash the disciples’ feet, drying them with the towel he had around him."}],[{"type":"prose","content":"When Jesus came to Simon Peter, Peter said to him, “Lord, are you going to wash my feet?”"}],[{"type":"prose","content":"Jesus replied, "}],[{"type":"prose","content":"“No,” Peter protested, “you will never ever wash my feet!”Jesus replied, "}],[{"type":"prose","content":"Simon Peter exclaimed, “Then wash my hands and head as well, Lord, not just my feet!”"}],[{"type":"prose","content":"Jesus replied, "}],[{"type":"prose","content":"For Jesus knew who would betray him. That is what he meant when he said, "}],[{"type":"prose","content":"After washing their feet, he put on his robe again and sat down and asked, "}],[],[],[],[],[],[],[],[],[{"type":"header","content":"Jesus Predicts His Betrayal"},{"type":"prose","content":"Now Jesus was deeply troubled, and he exclaimed, "}],[{"type":"prose","content":"The disciples looked at each other, wondering whom he could mean."}],[{"type":"prose","content":"The disciple Jesus loved was sitting next to Jesus at the table."}],[{"type":"prose","content":"Simon Peter motioned to him to ask, “Who’s he talking about?”"}],[{"type":"prose","content":"So that disciple leaned over to Jesus and asked, “Lord, who is it?”"}],[{"type":"prose","content":"Jesus responded,  And when he had dipped it, he gave it to Judas, son of Simon Iscariot."}],[{"type":"prose","content":"When Judas had eaten the bread, Satan entered into him. Then Jesus told him, "}],[{"type":"prose","content":"None of the others at the table knew what Jesus meant."}],[{"type":"prose","content":"Since Judas was their treasurer, some thought Jesus was telling him to go and pay for the food or to give some money to the poor."}],[{"type":"prose","content":"So Judas left at once, going out into the night."}],[{"type":"header","content":"Jesus Predicts Peter’s Denial"},{"type":"prose","content":"As soon as Judas left the room, Jesus said, "}],[],[],[],[],[{"type":"prose","content":"Simon Peter asked, “Lord, where are you going?”And Jesus replied, "}],[{"type":"prose","content":"“But why can’t I come now, Lord?” he asked. “I’m ready to die for you.”"}],[{"type":"prose","content":"Jesus answered, "}]]