[{"num":13,"verse":"Before the feast of Passover, when Jesus knew that his hour had come to depart out of this world to the Father, having loved his own who were in the world, to the end he loved them. "},{"num":2,"verse":"And when supper was ended, after the devil had put in the heart of Judas Iscariot, Simon’s son, to betray him, "},{"num":3,"verse":"Jesus, knowing that the Father had given all things into his hands, and that he had come from God and was going to God,"},{"num":4,"verse":"arose from supper and laid aside his upper garments, and took a towel and girded himself. "},{"num":5,"verse":"After that, he poured water into a basin and began to wash his disciples’ feet, and to wipe them with the towel with which he was girded."},{"num":6,"verse":"Then he came to Simon Peter. And Peter said to him, Lord, shall you wash my feet? "},{"num":7,"verse":"Jesus answered and said to him, What I am doing, you do not understand now, but you will know hereafter. "},{"num":8,"verse":"Peter said to him, You shall not wash my feet while the world stands! Jesus answered him, If I do not wash you, you will have no part with me. "},{"num":9,"verse":"Simon Peter said to him, Lord, not my feet only, but also my hands and my head! "},{"num":10,"verse":"Jesus said to him, He who is washed needs not but to wash his feet, and is clean every whit. And you my disciples are clean – but not all. "},{"num":11,"verse":"For he knew his betrayer. Therefore he said, you are not all clean."},{"num":12,"verse":"After he had washed their feet and received his clothes and was seated again, he said to them, Do you understand what I have done to you? "},{"num":13,"verse":"You call me Teacher and Lord, and you say well, for so I am. "},{"num":14,"verse":"If I then, your Lord and Teacher, have washed your feet, you also ought to wash one another’s feet. "},{"num":15,"verse":"For I have given you an example, so that you will do as I have done to you. "},{"num":16,"verse":"Truly truly I say to you, the servant is not greater than his master, nor the messenger greater than he who sent him. "},{"num":17,"verse":"If you understand these things, happy are you if you do them."},{"num":18,"verse":"I am not speaking of you all. I know whom I have chosen. But so that the scripture may be fulfilled, he who eats bread with me has lifted up his heel against me. "},{"num":19,"verse":"Now I tell you before it happens, so that when it has come to pass, you may believe that I am he. "},{"num":20,"verse":"Truly truly I say to you, he who receives whomever I send, receives me. And he who receives me, receives him who sent me."},{"num":21,"verse":"When Jesus had said these things, he was troubled in the spirit and testified, saying, Truly truly I say to you, that one of you will betray me."},{"num":22,"verse":"And then the disciples looked on one another, doubting of whom he spoke. "},{"num":23,"verse":"There was one of his disciples who leaned on Jesus’ bosom, whom Jesus loved. "},{"num":24,"verse":"Simon Peter motioned to him, that he should ask of whom he spoke. "},{"num":25,"verse":"He then, as he leaned on Jesus’ breast, said to him, Lord, who is it? "},{"num":26,"verse":"Jesus answered, It is he to whom I give a sop when I have dipped it. And he wet a sop and gave it to Judas Iscariot, Simon’s son. "},{"num":27,"verse":"And after the sop, Satan entered into him."},{"num":28,"verse":"But no one at the table understood for what intent he spoke to him. "},{"num":29,"verse":"Some of them thought that because Judas had the bag, Jesus had said to him, Buy those things that we need for the feast, or that he should give something to the poor."},{"num":30,"verse":"As soon then as he had received the sop, Judas went immediately out. And it was night. "},{"num":31,"verse":"When he had gone out, Jesus said, Now is the Son of man glorified, and God is glorified by him. "},{"num":32,"verse":"If God is glorified by him, God will also glorify him in himself, and will straightaway glorify him."},{"num":33,"verse":"Dear children, yet a little while I am with you. You will seek me, and as I said to the Jews, where I am going, you cannot come. "},{"num":34,"verse":"Also I say to you now, a new commandment I give to you: to love together. As I have loved you, so also should you love one another. "},{"num":35,"verse":"By this shall all men know that you are my disciples, if you have love for one another."},{"num":36,"verse":"Simon Peter said to him, Lord, where are you going? Jesus answered him, Where I am going you cannot follow me now, but you will follow me afterwards. "},{"num":37,"verse":"Peter said to him, Lord, why can I not follow you now? I will give my life for your sake. "},{"num":38,"verse":"Jesus answered him, Will you give your life for my sake? Truly truly I say to you, the cock will not crow till you have denied me three times."}]