[{"num":13,"verse":"Now before the Chag (Feast) of the Pesach, Rebbe, Melech HaMoshiach, having da’as that his sha’ah (hour, time) had come, his sha’ah when he should pass from the Olam Hazeh to HaAv, having had ahavah for his own in the Olam Hazeh, he had ahavah for them to HaKetz."},{"num":2,"verse":"And seudah taking place, Hasatan already having put into the lev of Yehuda Ben Shimon from K’riot that he should betray him,"},{"num":3,"verse":"And Rebbe, Melech HaMoshiach having had da’as that HaAv had given into his hands all things, and that from Hashem Rebbe, Melech HaMoshiach came forth and to Hashem he is going,"},{"num":4,"verse":"He rises from the seudah and put aside his kaftan, and having girded himself with a towel,"},{"num":5,"verse":"He puts mayim (water) into the basin and began to wash the raglei hatalmidim and to wipe them with the towel with which he had been girded."},{"num":6,"verse":"Rebbe, Melech HaMoshiach comes then to Shimon Kefa. Kefa says to Rebbe, Melech HaMoshiach, Adoni, you wash my feet?"},{"num":7,"verse":"In reply, Rebbe, Melech HaMoshiach says to him, Of what I am doing you do not have da’as now, but you will receive binah after these things."},{"num":8,"verse":"Kefa says to him, Never will you wash my feet l’Olam! Rebbe, Melech HaMoshiach answered him, Unless I wash you, you do not have a chelek [alloted portion of inheritance] with me. [DEVARIM 12:12; YESHAYAH 53:10; VAYIKRA 5:15-16]"},{"num":9,"verse":"Shimon Kefa says to Rebbe, Melech HaMoshiach, Adoni, then not my feet only but also my hands and my head."},{"num":10,"verse":"Rebbe, Melech HaMoshiach says to him, The one having been bathed does not have need except his feet to wash, but is wholly tahor, and you are tehorim, though not all."},{"num":11,"verse":"For Rebbe, Melech HaMoshiach had da’as of the one betraying him. Therefore, he said, Not all are tehorim."},{"num":12,"verse":"Therefore, when he washed their feet and resuited himself into his kaftan, Rebbe, Melech HaMoshiach reclined at tish again and said to them, Do you have da’as of what I have done for you?"},{"num":13,"verse":"You call me Rabbeinu and Adoneinu, and you say well, for Ani Hu."},{"num":14,"verse":"If, therefore, I, being Rebbe and Adon, washed your feet, you ought to wash the feet of one another also."},{"num":15,"verse":"For I gave you a mofet that as I did to you, you may do also."},{"num":16,"verse":"Omein, omein, I say to you, an eved is not greater than his Adon, nor is a shliach (one sent) greater than his Meshalle’ach (Sender)."},{"num":17,"verse":"If you have da’as of these things, happy are you, if you put them into practice."},{"num":18,"verse":"I do not speak about all of you—I have da’as of whom I chose—But it is to fulfill the Kitvei Hakodesh, OKHEL LAKHEMI HIGDIL ALAI AKEV (the one eating my bread he lifted up his heel against me. [TEHILLIM 41:9 (10)]"},{"num":19,"verse":"From now on I tell you before the occurrence that you may have emunah (faith) when it occurs, that Ani Hu. [YESHAYAH 41:4; 46:10; 43:10]"},{"num":20,"verse":"Omein, omein, I say to you, the one receiving whomever I may send receives me, and the one receiving me [Moshiach], receives the One having sent me [Hashem]."},{"num":21,"verse":"Having said these things, Rebbe, Melech HaMoshiach was spiritually troubled and he gave solemn edut (testimony), and said, Omein, omein, I say to you, that one of you will betray me."},{"num":22,"verse":"Moshiach’s talmidim were looking at one another, being uncertain about whom he speaks."},{"num":23,"verse":"One of his talmidim was reclining at tish near the kheyk (bosom) of Rebbe, Melech HaMoshiach—the talmid haahuv."},{"num":24,"verse":"Therefore Shimon Kefa nods to this one to inquire who it may be about whom Rebbe, Melech HaMoshiach speaks."},{"num":25,"verse":"Having leaned back, then, that one thus near the kheyk Rebbe, Melech HaMoshiach, says to him, Adoni, who is it?"},{"num":26,"verse":"He answers, That one it is to whom I will dip the [maror into the charoset] morsel and will give to him. Having dipped, therefore, he takes the [maror, charoset, matzah] morsel and gives to Yehuda Ben Shimon from K’riot."},{"num":27,"verse":"And after he received the [maror, charoset, matzah] morsel, then Hasatan entered into that man; therefore, Rebbe, Melech HaMoshiach says to him, What you are bent on doing, do quickly."},{"num":28,"verse":"But no one reclining at tish had da’as of why he said this to him."},{"num":29,"verse":"For some were thinking vi-bahlt (since) Yehuda from K’riot had the aron otzaram (chest of treasury), that he says to him, Buy the things which we need for the Chag (Feast) or that he should give ma’ot chittim (money for wheat financial contributions) for haAniyim (the poor)."},{"num":30,"verse":"Therefore, having taken the morsel, that man went out immediately. And it was lailah (night)."},{"num":31,"verse":"When, therefore that man went out, Rebbe, Melech HaMoshiach says, Now the Ben HaAdam [DANIEL 7:13-14] receives kavod and Hashem is given kavod in him."},{"num":32,"verse":"If Hashem receives kavod in him, Hashem will also give him kavod in himself, and Hashem will give him kavod immediately."},{"num":33,"verse":"Yeladim, yet a little while I am with you; you will seek me, and as I said to those of Yehudah, Where I go away, you are not able to come. Also to you I say this now."},{"num":34,"verse":"A mitzvah chadasha I give to you, that you have ahavah (agape) one for the other, as I have had ahavah (agape) for you, so also you have ahavah (agape) one for the another. [VAYIKRA 19:18]"},{"num":35,"verse":"By this will kol Bnei Adam have da’as that my talmidim you are, if ahavah you have one for the other."},{"num":36,"verse":"Shimon Kefa says to Rebbe, Melech HaMoshiach, Adoni, where are you going? In reply, Rebbe, Melech HaMoshiach answered him, Where I go, you are not able now to follow me, but you will follow later."},{"num":37,"verse":"Kefa says to Rebbe, Melech HaMoshiach, Adoni, why am I not able to follow you now? I will lay down my neshamah for you."},{"num":38,"verse":"Rebbe, Melech HaMoshiach answers, Your neshamah for me will you lay down? Omein, omein, I say to you, a tarnegol will not crow until you make hakhchashah (denial) of me [as Rebbe, Melech HaMoshiach] shloshah times."}]