[{"header":"The King Leaves Galilee For Judea. Large Crowds Follow Him And He Heals Them"},{"num":19,"verse":"And it came about that when Jesus finished these words, He went-away from Galilee and came into the districts of Judea, beyond the Jordan. "},{"num":2,"verse":"And large crowds followed Him, and He cured them there."},{"header":"The Pharisees Test Jesus With a Question About Divorce. Divorce Is Not God’s Will"},{"num":3,"verse":"And Pharisees came to Him— testing Him, and saying, “Is it lawful for a man to send-away his wife for any reason?” "},{"num":4,"verse":"And the One, having responded, said, “Did you not read [in Gen 1:27] that the One having created from the beginning ‘made them male and female’? "},{"num":5,"verse":"And He said [in Gen 2:24], ‘For this reason a man will leave-behind his father and his mother and will be joined to his wife. And the two will be one flesh’. "},{"num":6,"verse":"So then, they are no longer two, but one flesh. Therefore what God paired-together, let a person not separate”. "},{"num":7,"verse":"They say to Him, “Why then did Moses command us to give a certificate of divorce and send her away?” "},{"num":8,"verse":"He says to them that “Moses permitted you to send-away your wives because of your hardness-of-heart. But from the beginning it has not been so. "},{"num":9,"verse":"And I say to you that whoever sends-away his wife not based on sexual-immorality, and marries another, is committing-adultery”."},{"header":"The Disciples Conclude It Is Better Not To Marry. Jesus Says This Is Right For Some"},{"num":10,"verse":"His disciples say to Him, “If the case of the man with the wife is like this, it is not expedient to marry!” "},{"num":11,"verse":"But the One said to them, “Not all give-way-to this statement, but [only] ones to whom it has been given. "},{"num":12,"verse":"For there are eunuchs who were born thus from a mother’s womb. And there are eunuchs who were made-eunuchs by people. And there are eunuchs who made themselves eunuchs for the sake of the kingdom of the heavens. Let the one being able to give way, give way”."},{"header":"Don’t Forbid The Children To Come To Me. Of Such Is The Kingdom of God"},{"num":13,"verse":"Then children were brought to Him in order that He might lay His hands on them and pray. But the disciples rebuked them. "},{"num":14,"verse":"But Jesus said, “Permit the children, and do not be forbidding them to come to Me. For the kingdom of the heavens is of  such ones”. "},{"num":15,"verse":"And having laid His hands on them, He proceeded from there."},{"header":"A Rich Man Asks What To Do To Enter Heaven. Jesus Says, Sell Everything And Follow Me"},{"num":16,"verse":"And behold— one having come to Him said, “Teacher, what good thing should I do in order that I may have eternal life?” "},{"num":17,"verse":"And the One said to him, “Why do you ask Me about what is good? There is One Who is good. But if you wish to enter into life, keep the commandments”. "},{"num":18,"verse":"He says to Him, “Which ones?” And Jesus said, “You shall not murder. You shall not commit-adultery. You shall not steal. You shall not give-false-testimony. "},{"num":19,"verse":"Be honoring your father and your mother”. And, “You shall love your neighbor as yourself ”. "},{"num":20,"verse":"The young man says to Him, “I kept all these things. What am I still lacking?” "},{"num":21,"verse":"Jesus said to him, “If you wish to be perfect, go, sell your possessions and give it to the poor, and you will have treasure in the heavens. And come, be following Me”. "},{"num":22,"verse":"But having heard the statement, the young man went away grieving. For he was having many properties."},{"header":"It Is Hard For The Rich To Enter. But All Who Leave Anything Will Inherit More"},{"num":23,"verse":"And Jesus said to His disciples, “Truly I say to you that a rich one will enter with-difficulty into the kingdom of the heavens. "},{"num":24,"verse":"And again I say to you, it is easier that a camel go through a hole of a needle than that a rich one enter into the kingdom of God”. "},{"num":25,"verse":"And having heard it, the disciples were extremely astounded, saying, “Who then can be saved?” "},{"num":26,"verse":"And having looked at them, Jesus said to them, “With humans, this is impossible. But with God, all things are possible”. "},{"num":27,"verse":"Then Peter, having responded, said to Him, “Behold— we left everything and followed You. What then will there be for us?” "},{"num":28,"verse":"And Jesus said to them, “Truly I say to you that you, the ones having followed Me— at the regeneration when the Son of Man sits on the throne of His glory, you also will sit on twelve thrones, judging the twelve tribes of Israel. "},{"num":29,"verse":"And everyone who left houses or brothers or sisters or father or mother or children or fields for the sake of My name will receive a hundred-fold, and will inherit eternal life."},{"header":"The First In This World Will Be Last And The Last Will Be First"},{"num":30,"verse":"“But many first ones will be last, and last ones, first. "}]