[{"header":"Jesus Teaches About Divorce"},{"num":19,"verse":"When Jesus finished saying these things, he left Galilee. He went into the area of Judea on the other side of the Jordan River. "},{"num":2,"verse":"Large crowds followed him. He healed them there."},{"num":3,"verse":"Some Pharisees came to test Jesus. They asked, “Does the Law allow a man to divorce his wife for any reason at all?”"},{"num":4,"verse":"Jesus replied, “Haven’t you read that in the beginning the Creator ‘made them male and female’? (Genesis 1:27) "},{"num":5,"verse":"He said, ‘That’s why a man will leave his father and mother and be joined to his wife. The two will become one.’ (Genesis 2:24) "},{"num":6,"verse":"They are no longer two, but one. So no one should separate what God has joined together.”"},{"num":7,"verse":"They asked, “Then why did Moses command that a man can give his wife a letter of divorce and send her away?”"},{"num":8,"verse":"Jesus replied, “Moses let you divorce your wives because you were stubborn. But it was not this way from the beginning. "},{"num":9,"verse":"Here is what I tell you. Anyone who divorces his wife and marries another woman commits adultery. A man may divorce his wife only if she has not been faithful to him.”"},{"num":10,"verse":"Here is what the disciples said to him. “If that’s the way it is between a husband and wife, it is better not to get married.”"},{"num":11,"verse":"Jesus replied, “Not everyone can accept the idea of staying single. Only those who have been helped to live without getting married can accept it. "},{"num":12,"verse":"Some men are not able to have children because they were born that way. Some have been made that way by other people. Others have chosen to live that way in order to serve the kingdom of heaven. The one who can accept this should accept it.”"},{"header":"Little Children Are Brought to Jesus"},{"num":13,"verse":"Some people brought little children to Jesus. They wanted him to place his hands on the children and pray for them. But the disciples told them not to do it."},{"num":14,"verse":"Jesus said, “Let the little children come to me. Don’t keep them away. The kingdom of heaven belongs to people like them.” "},{"num":15,"verse":"Jesus placed his hands on them to bless them. Then he went on from there."},{"header":"Rich People and the Kingdom of God"},{"num":16,"verse":"Just then, a man came up to Jesus. He asked, “Teacher, what good thing must I do to receive eternal life?”"},{"num":17,"verse":"“Why do you ask me about what is good?” Jesus replied. “There is only one who is good. If you want to enter the kingdom, obey the commandments.”"},{"num":18,"verse":"“Which ones?” the man asked."},{"num":19,"verse":"Honor your father and mother.’ (Exodus 20:12–16; Deuteronomy 5:16–20) And ‘love your neighbor as you love yourself.’ ” (Leviticus 19:18)"},{"num":20,"verse":"“I have obeyed all those commandments,” the young man said. “What else do I need to do?”"},{"num":21,"verse":"Jesus answered, “If you want to be perfect, go and sell everything you have. Give the money to those who are poor. You will have treasure in heaven. Then come and follow me.”"},{"num":22,"verse":"When the young man heard this, he went away sad. He was very rich."},{"num":23,"verse":"Then Jesus said to his disciples, “What I’m about to tell you is true. It is hard for someone who is rich to enter the kingdom of heaven. "},{"num":24,"verse":"Again I tell you, it is hard for a camel to go through the eye of a needle. But it is even harder for someone who is rich to enter the kingdom of God.”"},{"num":25,"verse":"When the disciples heard this, they were really amazed. They asked, “Then who can be saved?”"},{"num":26,"verse":"Jesus looked at them and said, “With people, this is impossible. But with God, all things are possible.”"},{"num":27,"verse":"Peter answered him, “We have left everything to follow you! What reward will be given to us?”"},{"num":28,"verse":"“What I’m about to tell you is true,” Jesus said to them. “When all things are made new, the Son of Man will sit on his glorious throne. Then you who have followed me will also sit on 12 thrones. You will judge the 12 tribes of Israel. "},{"num":29,"verse":"Suppose anyone has left houses, brothers or sisters, father or mother, husband or wife, children or fields because of me. Anyone who has done that will receive 100 times as much. They will also receive eternal life. "},{"num":30,"verse":"But many who are first will be last. And many who are last will be first."}]