[{"header":"The Doom of Sodom"},{"num":19,"verse":"It was evening when the two angels came to Sodom. Lot was sitting at Sodom’s [city] gate. Seeing them, Lot got up to meet them and bowed down with his face to the ground. "},{"num":2,"verse":"And he said, “See here, my lords, please turn aside and come into your servant’s house, and spend the night, and wash your feet; then you may get up early and go on your way.” But they said, “No, we shall spend the night in the open plaza [of the city].” "},{"num":3,"verse":"However, Lot strongly urged them, so they turned aside and entered his house; and he prepared a feast for them [with wine], and baked unleavened bread, and they ate. "},{"num":4,"verse":"But before they lay down [to sleep], the men of the city, the men of Sodom, both young and old, surrounded the house, all the men from every quarter; "},{"num":5,"verse":"and they called out to Lot and said to him, “Where are the men who came to you tonight? Bring them out to us so that we may know them [intimately].” "},{"num":6,"verse":"But Lot went out of the doorway to the men, and shut the door after him, "},{"num":7,"verse":"and said, “Please, my brothers, do not do something so wicked. "},{"num":8,"verse":"See here, I have two daughters who have not known a man [intimately]; please let me bring them out to you [instead], and you can do as you please with them; only do nothing to these men, because they have in fact come under the shelter of my roof [for protection].” "},{"num":9,"verse":"But they said, “Get out of the way!” And they said, “This man (Lot) came [as an outsider] to live here temporarily, and now he is acting like a judge. Now we will treat you worse than your visitors!” So they rushed forward and pressed violently against Lot and came close to breaking down the door [of his house]. "},{"num":10,"verse":"But the men (angels) reached out with their hands and pulled Lot into the house with them, and shut the door [after him]. "},{"num":11,"verse":"They struck (punished) the men who were at the doorway of the house with blindness, from the young men to the old men, so that they exhausted themselves trying to find the doorway."},{"num":12,"verse":"And the [two] men (angels) asked Lot, “Have you any others here [in Sodom]—a son-in-law, and your sons, and your daughters? Whomever you have in the city, take them out of here; "},{"num":13,"verse":"for we are destroying this place, because the outcry [for judgment] against them has grown so great before the Lord that the Lord has sent us to destroy and ruin it.” "},{"num":14,"verse":"So Lot went out and spoke to his sons-in-law, who were [betrothed, and legally promised] to marry his daughters, and said, “Get up, get out of this place, for the Lord is about to destroy this city!” But to his sons-in-law he appeared to be joking."},{"num":15,"verse":"When morning dawned, the angels urged Lot [to hurry], saying, “Get up! Take your wife and two daughters who are here [and go], or you will be swept away in the punishment of the city.” "},{"num":16,"verse":"But Lot hesitated and lingered. The men took hold of his hand and the hand of his wife and the hands of his two daughters, because the Lord was merciful to him [for Abraham’s sake]; and they brought him out, and left him outside the city [with his family]. "},{"num":17,"verse":"When they had brought them outside, one [of the angels] said, “Escape for your life! Do not look behind you, or stop anywhere in the entire valley; escape to the mountains [of Moab], or you will be consumed and swept away.” "},{"num":18,"verse":"But Lot said to them, “Oh no, [not that place] my lords! "},{"num":19,"verse":"Please listen, your servant has found favor in your sight, and you have magnified your lovingkindness (mercy) to me by saving my life; but I cannot escape to the mountains, because the disaster will overtake me and I will be killed. "},{"num":20,"verse":"Now look, this town [in the distance] is near enough for us to flee to, and it is small [with only a few people]. Please, let me escape there (is it not small?) so that my life will be saved.” "},{"num":21,"verse":"And the angel said to him, “Behold, I grant you this request also; I will not destroy this town of which you have spoken. "},{"num":22,"verse":"Hurry and take refuge there, for I cannot do anything [to punish Sodom] until you arrive there.” For this reason the town was named Zoar (few, small)."},{"num":23,"verse":"The sun had risen over the earth when Lot came to Zoar. "},{"num":24,"verse":"Then the Lord rained down brimstone (flaming sulfur) and fire on Sodom and on Gomorrah from the Lord out of heaven, "},{"num":25,"verse":"and He overthrew (demolished, ended) those cities, and the entire valley, and all the inhabitants of the cities, and whatever grew on the ground. "},{"num":26,"verse":"But Lot’s wife, from behind him, [foolishly, longingly] looked [back toward Sodom in an act of disobedience], and she became a pillar of salt."},{"num":27,"verse":"Abraham started out early the next morning to the place where he [only the day before] had stood before the Lord; "},{"num":28,"verse":"and he looked down toward Sodom and Gomorrah, and toward all the land of the valley [of the Dead Sea]; and he saw, and behold, the smoke of the land went up like the smoke of a kiln (pottery furnace)."},{"num":29,"verse":"Now when God ravaged and destroyed the cities of the plain [of Siddim], He remembered Abraham [and for that reason], and He sent [Abraham’s nephew] Lot out of the midst of the destruction, when He destroyed the cities in which Lot had lived."},{"header":"Lot Is Debased"},{"num":30,"verse":"Now Lot went up from Zoar, and lived in the mountain together with his two daughters, for he was afraid to stay [any longer] in Zoar; and he lived in a cave with his two daughters. "},{"num":31,"verse":"The firstborn said to the younger, “Our father is aging, and there is not a man on earth [available] to be intimate with us in the customary way [so that we may have children]. "},{"num":32,"verse":"Come, let us make our father drunk with wine, and we will lie with him so that we may preserve our family through our father.” "},{"num":33,"verse":"So they gave their father wine that night, and the firstborn went in and lay with her father; and he did not know when she lay down or when she got up [because he was completely intoxicated]. "},{"num":34,"verse":"Then the next day, the firstborn said to the younger, “Behold, I lay with my father last night; let us make him drunk with wine tonight also, and then you go in and lie with him, so that we may preserve our family through our father.” "},{"num":35,"verse":"So they gave their father wine that night also, and the younger got up and lay with him; and again he did not know when she lay down or when she got up. "},{"num":36,"verse":"Thus both the daughters of Lot conceived by their father. "},{"num":37,"verse":"The firstborn gave birth to a son, and named him Moab (from father); he is the father of the Moabites to this day. "},{"num":38,"verse":"The younger also gave birth to a son and named him Ben-ammi (son of my people); he is the father of the Ammonites to this day."}]