[{"header":"Lot leaves Sodom"},{"num":19,"verse":"The two messengers entered Sodom in the evening. Lot, who was sitting at the gate of Sodom, saw them, got up to greet them, and bowed low."},{"num":2,"verse":"He said, “Come to your servant’s house, spend the night, and wash your feet. Then you can get up early and go on your way.”"},{"num":3,"verse":"He pleaded earnestly with them, so they went with him and entered his house. He made a big meal for them, even baking unleavened bread, and they ate."},{"num":4,"verse":"Before they went to bed, the men of the city of Sodom—everyone from the youngest to the oldest—surrounded the house"},{"num":5,"verse":"and called to Lot, “Where are the men who arrived tonight? Bring them out to us so that we may have sex with them.”"},{"num":6,"verse":"Lot went out toward the entrance, closed the door behind him,"},{"num":7,"verse":"and said, “My brothers, don’t do such an evil thing."},{"num":8,"verse":"I’ve got two daughters who are virgins. Let me bring them out to you, and you may do to them whatever you wish. But don’t do anything to these men because they are now under the protection of my roof.”"},{"num":9,"verse":"They said, “Get out of the way!” And they continued, “Does this immigrant want to judge us? Now we will hurt you more than we will hurt them.” They pushed Lot back and came close to breaking down the door."},{"num":10,"verse":"The men inside reached out and pulled Lot back into the house with them and slammed the door."},{"num":11,"verse":"Then the messengers blinded the men near the entrance of the house, from the youngest to the oldest, so that they groped around trying to find the entrance."},{"num":12,"verse":"The men said to Lot, “Who’s still with you here? Take away from this place your sons-in-law, your sons, your daughters, and everyone else you have in the city"},{"num":13,"verse":"because we are about to destroy this place. The Lord has found the cries of injustice so serious that the Lord sent us to destroy it.”"},{"num":14,"verse":"Lot went to speak to his sons-in-law, married to his daughters, and said, “Get up and get out of this place because the Lord is about to destroy the city.” But his sons-in-law thought he was joking."},{"num":15,"verse":"When dawn broke, the messengers urged Lot, “Get up and take your wife and your two daughters who are here so that you are not swept away because of the evil in this city.”"},{"num":16,"verse":"He hesitated, but because the Lord intended to save him, the men grabbed him, his wife, and two daughters by the hand, took him out, and left him outside the city."},{"num":17,"verse":"After getting them out, the men said, “Save your lives! Don’t look back! And don’t stay in the valley. Escape to the mountains so that you are not swept away.”"},{"num":18,"verse":"But Lot said to them, “No, my lords, please."},{"num":19,"verse":"You’ve done me a favor and have been so kind to save my life. But I can’t escape to the mountains since the catastrophe might overtake me there and I’d die."},{"num":20,"verse":"This city here is close enough to flee to, and it’s small. It’s small, right? Let me escape there, and my life will be saved.”"},{"num":21,"verse":"He said to Lot, “I’ll do this for you as well; I won’t overthrow the city that you have described."},{"num":22,"verse":"Hurry! Escape to it! I can’t do anything until you get there.” That is why the name of the city is Zoar."},{"header":"Sodom and Gomorrah destroyed"},{"num":23,"verse":"As the sun rose over the earth, Lot arrived in Zoar;"},{"num":24,"verse":"and the Lord rained down burning asphalt from the skies onto Sodom and Gomorrah."},{"num":25,"verse":"The Lord destroyed these cities, the entire valley, everyone who lived in the cities, and all of the fertile land’s vegetation."},{"num":26,"verse":"When Lot’s wife looked back, she turned into a pillar of salt."},{"num":27,"verse":"Abraham set out early for the place where he had stood with the Lord,"},{"num":28,"verse":"and looked out over Sodom and Gomorrah and over all the land of the valley. He saw the smoke from the land rise like the smoke from a kiln."},{"header":"Origin of Moab and Ammon"},{"num":29,"verse":"When God destroyed the cities in the valley, God remembered Abraham and sent Lot away from the disaster that overtook the cities in which Lot had lived."},{"num":30,"verse":"Since Lot had become fearful of living in Zoar, he and his two daughters headed up from Zoar and settled in the mountains where he and his two daughters lived in a cave."},{"num":31,"verse":"The older daughter said to the younger, “Our father is old, and there are no men in the land to sleep with us as is the custom everywhere."},{"num":32,"verse":"Come on, let’s give our father wine to drink, lie down with him, and we’ll have children from our father.”"},{"num":33,"verse":"That night they served their father wine, and the older daughter went in and lay down with her father, without him noticing when she lay down or got up."},{"num":34,"verse":"The next day the older daughter said to the younger, “Since I lay down with our father last night, let’s serve him wine tonight too, and you go in and lie down with him so that we will both have children from our father.”"},{"num":35,"verse":"They served their father wine that night also, and the younger daughter lay down with him, without him knowing when she lay down or got up."},{"num":36,"verse":"Both of Lot’s daughters became pregnant by their father."},{"num":37,"verse":"The older daughter gave birth to a son and named him Moab. He is the ancestor of today’s Moabites."},{"num":38,"verse":"The younger daughter also gave birth to a son and named him Ben-ammi. He is the ancestor of today’s Ammonites."}]