[{"header":"Sodom’s Depravity"},{"num":19,"verse":"The two angels entered Sodom at sunset while Lot was sitting in the gate area of the city. When Lot saw them, he got up, greeted them, bowed low with his face to the ground, "},{"num":2,"verse":"and said, “Look, my lords! Please come inside your servant’s house, wash your feet, and spend the night. Then you can get up early and be on your way.”"},{"num":3,"verse":"But Lot kept urging them strongly, so they turned aside and entered his house. He prepared a festival and baked unleavened flat bread for them, and they ate."},{"num":4,"verse":"Before they could lie down, all the men of Sodom and its outskirts, both young and old, surrounded the house. "},{"num":5,"verse":"They called out to Lot and asked, “Where are the men who came to visit you tonight? Bring them out to us so we can have sex with them!”"},{"num":6,"verse":"Lot went outside to them, shut the door behind him, "},{"num":7,"verse":"and said, “I urge you, my brothers, don’t do such a wicked thing. "},{"num":8,"verse":"Look here, I have two daughters who are virgins. Let me bring them out to you, and you may do to them whatever you wish, only don’t do anything to these men, because they’re here under my protection.”"},{"num":9,"verse":"But they replied, “Get out of the way! This man came here as a foreigner, and now he’s acting like a judge! So we’re going to deal more harshly with you than with them.” Then they pushed hard against the man (that is, against Lot), intending to break down the door."},{"num":10,"verse":"But the angels inside reached out, dragged Lot back into the house with them, shut the door, "},{"num":11,"verse":"and blinded the men who were at the entrance of the house, from the least important to the greatest, so they were unable to find the doorway."},{"header":"Lot Negotiates with the Angels"},{"num":12,"verse":"“Do you have anyone else here in the city?” the angels asked Lot. “A son-in-law? Sons? Daughters? Get them out of this place, "},{"num":13,"verse":"because we’re going to destroy it. Their outcry has come to the attention of the Lord, so he sent us here to destroy it!”"},{"num":14,"verse":"Lot then went out and told his sons-in-law (they had married his daughters), “Get out of here! The Lord is going to destroy this city!” But his sons-in-law thought he was joking."},{"num":15,"verse":"As dawn was breaking, the angels pressured Lot. “Get going!” they told him. “Take your wife and your two daughters who are here, or you will be engulfed by the devastation that’s coming to this city.”"},{"num":16,"verse":"But Lot kept lingering in the city, so the men grabbed his hand and the hands of his wife and two daughters (because of the Lord’s compassion for him!), brought them out of the city, and left them outside. "},{"num":17,"verse":"Then one of them said, “Flee for your lives! Don’t look back or stop anywhere on the plain. Escape to the hills, or you’ll be swept away!”"},{"num":18,"verse":"“No! Please, my lords!” Lot pleaded with them. "},{"num":19,"verse":"“Your servant has found favor in your sight, and you have shown me your gracious love in how you have dealt with me by keeping me alive. I cannot escape to the hills, because I’m afraid the disaster will overtake me, and I’ll die. "},{"num":20,"verse":"Look, there is a town nearby where I can flee, and it’s a small one. Let me escape there! It’s a small one, isn’t it? That way I’ll stay alive!”"},{"num":21,"verse":"“All right,” the angel replied to Lot, “I’ll agree with your request! I won’t overthrow the town that you mentioned. "},{"num":22,"verse":"Hurry up and flee there, because I cannot do anything until you get to that town.” Therefore the name of the town was called Zoar."},{"header":"Lot’s Wife Becomes a Pillar of Salt"},{"num":23,"verse":"The sun had risen over the land about the time Lot reached Zoar. "},{"num":24,"verse":"Then the Lord rained sulfur and fire out of the sky from the Lord on Sodom and Gomorrah, "},{"num":25,"verse":"overthrowing those cities, all of the plain, and everyone who lived in the cities. He also destroyed the plants that grew out of the ground. "},{"num":26,"verse":"But Lot’s wife looked back as she lingered behind him, and she became a pillar of salt."},{"num":27,"verse":"Abraham went early in the morning to the place where he had stood before the Lord earlier. "},{"num":28,"verse":"He looked off toward Sodom, Gomorrah, and the entire plain, and he saw smoke rising from the land like smoke from a furnace. "},{"num":29,"verse":"And so it was that, when God destroyed the cities of the plain, he remembered Abraham and brought Lot out from the midst of the destruction when he overthrew the cities where Lot had lived."},{"header":"The Origin of Moab and Ammon"},{"num":30,"verse":"Later on, Lot and his two daughters abandoned Zoar and settled in the hills because Lot was afraid to live in Zoar. He lived there in a cave, along with his two daughters. "},{"num":31,"verse":"One day the firstborn told the younger one, “Our father is old, and there’s no man in the land to have sex with us, as everybody else throughout all the earth does. "},{"num":32,"verse":"Come on! Let’s make our father drink wine, and then we’ll have sex with him so we can preserve our father’s lineage.”"},{"num":33,"verse":"So they had their father drink wine that night, and the older one had sexual relations with her father, but he was not aware when she lay down or when she got up. "},{"num":34,"verse":"The next day the firstborn told the younger one, “Look! I had sex with my father last night. Let’s make him drink wine tonight again as well. Then you have sex with him, too. That way we’ll preserve our father’s lineage.” "},{"num":35,"verse":"So they made their father drink wine that night as well, so he was not aware when she lay down or when she got up."},{"num":36,"verse":"That’s how both of Lot’s daughters became pregnant by their father. "},{"num":37,"verse":"The firstborn gave birth to a son and named him Moab, and he is the ancestor of the Moabites to this day. "},{"num":38,"verse":"The younger daughter also gave birth to a son and named him Ben-ammi, and he is the ancestor of the Ammonites to this day."}]