[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:11-22 Why did the law make a corpse a defiling thing? Because death is the wages of sin, which entered into the world by it, and reigns by the power of it. The law could not conquer death, nor abolish it, as the gospel does, by bringing life and immortality to light, and so introducing a better hope. As the ashes of the heifer signified the merit of Christ, so the running water signified the power and grace of the blessed Spirit, who is compared to rivers of living water; and it is by his work that the righteousness of Christ is applied to us for our cleansing. Those who promise themselves benefit by the righteousness of Christ, while they submit not to the grace and influence of the Holy Spirit, do but deceive themselves; we cannot be purified by the ashes, otherwise than in the running water. What use could there be in these appointments, if they do not refer to the doctrines concerning the sacrifice of Christ? But comparing them with the New Testament, the knowledge to be got from them is evident. The true state of fallen man is shown in these institutions. Here we learn the defiling nature of sin, and are warned to avoid evil communications.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "One practical effect of attaching defilement to a dead body, and to all that touched it, etc., would be to insure early burial, and to correct a practice not uncommon in the East, of leaving the deal to be devoured by the wild beasts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21. he that sprinkleth … ; and he that toucheth the water of separation shall be unclean until even—The opposite effects ascribed to the water of separation—of cleansing one person and defiling another—are very singular, and not capable of very satisfactory explanation. One important lesson, however, was thus taught, that its purifying efficacy was not inherent in itself, but arose from the divine appointment, as in other ordinances of religion, which are effectual means of salvation, not from any virtue in them, or in him that administers them, but solely through the grace of God communicated thereby.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall wash his clothes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because he is unclean, as it here follows. It is strange that the same water should cleanse one person, and defile another; but God would have it so, partly, to teach us that it did not cleanse by any virtue in itself, or in the work done, but only by virtue of God’s appointment; partly, to mind the Jews of the imperfection of their priesthood, and their ritual purifications and expiations, and consequently of the necessity of a better priest and sacrifice and way of purifying, which these outward rites did point at; and partly, to show that the efficacy of God’s ordinances doth not depend upon the person or quality of his ministers, because the same person who was polluted himself could and did cleanse others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He that toucheth the water of separation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either by sprinkling of it, or by being sprinkled with it; for even he that was cleansed by it, was not fully cleansed as soon as he was sprinkled, but only at the even of that day, as is said here and above, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 19:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 19:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it shall be a perpetual statute unto them,.... To the children of Israel, throughout their generations, unto the coming of the Messiah, when the ceremonial law, which stood in divers washings and purifications, was abolished: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that he that sprinkleth the water of separation shall wash his clothes; the priest that sprinkled, according to the Targum of Jonathan, or any other person that did it; so that the same purifying water, which made an unclean person clean, defiled a clean one; for though it was purifying, it had uncleanness in it; having the ashes not only of the cow itself, but of its skin, blood, and dung; and so a lye made of ashes is impure in itself, and yet serves to scour cloth: Ainsworth thinks this signifies the imperfection and insufficiency of legal rites, which, in their greatest virtue, only sanctified to the purifying of the flesh, and left the purifier himself in uncleanness he had not before; by consideration of which, the people might be led to Christ, and his Spirit, for cleansing, Hebrews 9:13 but it rather signifies, that the blood of Christ, which cleanses from all sin, and answers to this purifying water, that its cleansing virtue is owing to Christ being made sin for his people; and that some may be instruments of directing souls to the blood of Christ for cleansing, and yet be defiled themselves: it does not appear that this man, thus unclean, was to have the water of purification sprinkled on him, but was only to wash his clothes; see Revelation 7:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that he that sprinkleth the water of separation shall wash his clothes; the priest that sprinkled, according to the Targum of Jonathan, or any other person that did it; so that the same purifying water, which made an unclean person clean, defiled a clean one; for though it was purifying, it had uncleanness in it; having the ashes not only of the cow itself, but of its skin, blood, and dung; and so a lye made of ashes is impure in itself, and yet serves to scour cloth: Ainsworth thinks this signifies the imperfection and insufficiency of legal rites, which, in their greatest virtue, only sanctified to the purifying of the flesh, and left the purifier himself in uncleanness he had not before; by consideration of which, the people might be led to Christ, and his Spirit, for cleansing, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but it rather signifies, that the blood of Christ, which cleanses from all sin, and answers to this purifying water, that its cleansing virtue is owing to Christ being made sin for his people; and that some may be instruments of directing souls to the blood of Christ for cleansing, and yet be defiled themselves: it does not appear that this man, thus unclean, was to have the water of purification sprinkled on him, but was only to wash his clothes; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and he that toucheth the water of separation shall be unclean until even: but was not clean until he had washed, as Aben Ezra observes, though not expressed; for if one that only sprinkled it had need to be washed, much more one that touched it, and which was unavoidable, if, when he mixed the water and ashes together, he stirred them with his finger; see Gill on Numbers 19:17, though Maimonides (t) understands this of sprinkling and touching the water when there was no necessity for it, when a person was not employed in doing the duty of this law. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he that toucheth the water of separation shall be unclean until even: but was not clean until he had washed, as Aben Ezra observes, though not expressed; for if one that only sprinkled it had need to be washed, much more one that touched it, and which was unavoidable, if, when he mixed the water and ashes together, he stirred them with his finger; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 19:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", though Maimonides (t) understands this of sprinkling and touching the water when there was no necessity for it, when a person was not employed in doing the duty of this law. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Hilchot Parah Adumah, c. 15. sect. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Hilchot Parah Adumah, c. 15. sect. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it shall be a perpetual statute unto them, that he that sprinkleth the water of separation shall wash his clothes; and he that toucheth the water of separation shall be unclean until even.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The man who sprinkles the sacred water becomes ‘unclean’; and in the next clause it is stated more generally that the man who touches it becomes unclean. The uncleanness in this case is slight; it lasts until the evening and can be removed by simply washing the clothes. Gray cites a Buddhist parallel from Max Müller, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sacred Books of the East",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ii. 250. A close connexion existed in the Semitic mind between ‘uncleanness’ and ‘holiness.’ ‘Holiness’ or ‘sacredness’ was a contagious quality which debarred its possessor from ordinary intercourse with others until the contagion had been removed. Inanimate objects could also receive the contagion: see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It shall be a perpetual statute.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This formula usually emphasizes something of solemn importance. In this case, as apparently above in verse 10, the regulations thus enforced might seem of trifling moment. But the whole design of this ordinance, down to its minutest detail, was to stamp upon physical death a far-reaching power of defiling and separating from God, which extended even to the very means Divinely appointed as a remedy. The Jew, whose religious feelings were modeled upon this law, must have felt himself entangled in the meshes of a net so widely cast about him that he could hardly quite escape it by extreme caution and multiplied observances; he might indeed exclaim, unless habit hardened him to it, \"Who shall deliver me from the body of this death?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Numbers 19:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This also was to be an everlasting statute, that he who sprinkled the water of purification, or even touched it (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 19:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), and he who was touched by a person defiled (by a corpse), and also the person who touched him, should be unclean till the evening, - a rule which also applied to other forms of uncleanness. ",
        "children": []
      }
    ]
  }
]