[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And Eleazar the priest shall take of her blood . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The appointed rites were to be discharged by Eleazar, not by Aaron, who would otherwise have been temporarily disqualified by legal impurity from the discharge of his high-priestly functions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Before the tabernacle of the congregation . . . —i.e., opposite to the entrance of the Tabernacle, but, as stated in the preceding verse, outside the camp, because the act had reference to the uncleanness of death.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Before the tabernacle of the congregation . . . —",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "opposite to the entrance of the Tabernacle, but, as stated in the preceding verse, outside the camp, because the act had reference to the uncleanness of death.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 19:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 19:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sprinkle of her blood directly before the tabernacle — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This made it in some sort an ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "expiation ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of sin; for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sprinkling of the blood ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "before the Lord was the chief solemnity in all the sacrifices of atonement: therefore, though this was not done at the altar, yet, being done toward the sanctuary, it was intimated hereby that the virtue and validity of it depended upon the sanctuary, and were derived from it. Thus, in the satisfaction that was made to God by the death of Christ, our great High- Priest, who, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by the eternal Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "finger of God,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "offered himself without spot to God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he did, as it were, sprinkle his own blood directly before the sanctuary, when he said, “Father, into thy hands I commit my spirit.” This also signifies how necessary it was, to the purifying our hearts, that satisfaction should be made to divine justice. This sprinkling of the blood put virtue into the ashes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-10 The heifer was to be wholly burned. This typified the painful sufferings of our Lord Jesus, both in soul and body, as a sacrifice made by fire, to satisfy God's justice for man's sin. These ashes are said to be laid up as a purification for sin, because, though they were only to purify from ceremonial uncleanness, yet they were a type of that purification for sin which our Lord Jesus made by his death. The blood of Christ is laid up for us in the word and sacraments, as a fountain of merit, to which by faith we may have constant recourse, for cleansing our consciences.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The work would necessarily require a priest; yet as it rendered him unclean for the day ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 19:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the high priest was relieved from performing it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Without the camp - The defilement was viewed as transferred to the victim that was to be offered for its removal. Under these circumstances the victim, like the defiled persons themselves, would be removed outside the camp. The particular pollution to be remedied by this ordinance was the indirect one resulting from contact with tokens and manifestations of sin, not the direct and personal one arising from actual commission of sin. So too the sinless antitype had to bear the reproach of associating with sinners Luke 5:30; Luke 15:2. And as the red heifer was expelled from the precincts of the camp, so was the Saviour cut off in no small measure during His Life from the fellowship of the chief representatives of the theocracy, and put to death outside Jerusalem between two thieves. Compare Hebrews 13:11-12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Without the camp - The defilement was viewed as transferred to the victim that was to be offered for its removal. Under these circumstances the victim, like the defiled persons themselves, would be removed outside the camp. The particular pollution to be remedied by this ordinance was the indirect one resulting from contact with tokens and manifestations of sin, not the direct and personal one arising from actual commission of sin. So too the sinless antitype had to bear the reproach of associating with sinners ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 5:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And as the red heifer was expelled from the precincts of the camp, so was the Saviour cut off in no small measure during His Life from the fellowship of the chief representatives of the theocracy, and put to death outside Jerusalem between two thieves. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3-6. ye shall give her unto Eleazar the priest that he may bring her forth without the camp—He was the second or deputy high priest, and he was selected for this duty because the execution of it entailed temporary defilement, from which the acting high priest was to be preserved with the greatest care. It was led \"forth without the camp,\" in accordance with the law regarding victims laden with the sins of the people, and thus typical of Christ (Heb 13:12; also Le 24:14). The priest was to sprinkle the blood \"seven times\" before—literally, \"towards\" or \"near\" the tabernacle, a description which seems to imply either that he carried a portion of the blood in a basin to the door of the tabernacle (Le 4:17), or that in the act of sprinkling he turned his face towards the sacred edifice, being disqualified through the defiling influence of this operation from approaching close to it. By this attitude he indicated that he was presenting an expiatory sacrifice, for the acceptance of which he hoped, in the grace of God, by looking to the mercy seat. Every part of it was consumed by fire except the blood used in sprinkling, and the ingredients mixed with the ashes were the same as those employed in the sprinkling of lepers (Le 14:4-7). It was a water of separation—that is, of \"sanctification\" for the people of Israel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Directly before the tabernacle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "towards or over against the tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Near to it; and so we must suppose that he took some of the blood in a basin, and carried it from without the camp to the tabernacle, and then returned to this place again; which might be done, though it be not here expressed. And this seems to agree best with other places, where this sprinkling seven times was performed in or near the tabernacle, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 4:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 4:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Standing at a good distance from it, even without the camp, yet turning and looking towards it. For here is no intimation that he went into the camp before this work was done, but rather the contrary is implied, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 19:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 19:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And because being defiled by this work he could not come near to the tabernacle, it was sufficient for him to turn and took towards it. Either way this posture signified his presenting of this blood before the Lord by way of atonement and satisfaction for his and the people’s sins, and his expectation of acceptance and pardon only from God, and from his mercy-seat in the tabernacle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Eleazar the priest shall take of her blood with his finger,.... He took the blood in his left hand, and sprinkled it with the finger of his right hand, as Maimonides says (a); and so the Targum of Jonathan, which says, he did not receive it into a vessel, but into the palm of his hand, and from thence sprinkled it with his finger (b): which Ainsworth thinks signified the Spirit of Christ, our high priest, called \"the finger of God\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 11:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; who takes the blood of Christ, and sprinkles it on the hearts of his people, whereby they are freed from an evil conscience: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and sprinkle of her blood directly before the tabernacle of the congregation seven times; or \"towards the tabernacle\", so Noldius (c); as sprinkling of the blood was the principal action in sacrifices, this was to be done directly before the tabernacle, from whence its purifying virtue was expected, though it was not shed in it, that it might have all the appearance of a sacrifice it could have; and being done seven times, denotes the perfection of it: the priest, when he sprinkled, stood on the east side, with his face to the west. When the temple was built at Jerusalem, this affair was transacted on the mount of Olives, which was east of Jerusalem. Jarchi says, the priest stood in the east of Jerusalem, and placed himself so that he might see the door of the temple at the time of sprinkling the blood. Now it appears, as Maimonides says (d), that the floor of the temple was higher than the floor of the eastern gate of the mountain of the house twenty two cubits, and the height of the gate of the mountain of the house was twenty cubits; wherefore one that stood over against the eastern gate could not see the door of the temple, therefore they made the wall, which was over the top of this gate (the battlement of it), low, so that he (the priest), that stood on the mount of Olives, might see the door of the temple, at the time he sprinkled the blood of the cow over against the temple; otherwise he could only have seen the eighth step of the porch of the temple, as the same writer observes (e), with which agrees the Misnah (f), that all the walls there (about the mountain of the house) were high, except the eastern wall, that so the priest that burnt the cow might stand on the top of the mount of Olives, and look and behold the door of the temple, when he sprinkled the blood. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Hilchot Parah Adumah, c. 3. sect. 2.((b) Vid. Misn. Parah, c. 3. sect. 7. (c) P. 81. No. 379. (d) Hilchot Beth Habechirah, c. 6. sect. 2.((e) In Misn, Middot, c. 2. sect. 4. (f) Misn. ib. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Hilchot Parah Adumah, c. 3. sect. 2.((b) Vid. Misn. Parah, c. 3. sect. 7. (c) P. 81. No. 379. (d) Hilchot Beth Habechirah, c. 6. sect. 2.((e) In Misn, Middot, c. 2. sect. 4. (f) Misn. ib. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Eleazar the priest shall take of her blood with his finger, and sprinkle of her blood directly before the tabernacle of the congregation seven times:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Eleazar...  shall...  sprinkle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of her blood directly before",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אֵל־נֹכַח פְּנֵי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the tabernacle.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " By this act the death of the heifer became a sacrificial offering. The sprinkling in the direction of the sanctuary intimated that the offering was made to him that dwelt therein, and the \"seven times\" was the ordinary number of perfect perform",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.). Numbers 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The sacrifice itself was to be superintended by Eleazar the priest, the eldest son of the high priest, and his presumptive successor in office; because Aaron, or the high priest, whose duty it was to present the sin-offerings for the congregation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), could not, according to his official position, which required him to avoid all uncleanness of death (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 21:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), perform such an act as this, which stood in the closest relation to death and the uncleanness of death, and for that very reason had to be performed outside the camp. The subject, to \"bring her forth\" and \"slay her,\" is indefinite; since it was not the duty of the priest to slay the sacrificial animal, but of the offerer himself, or in the case before us, of the congregation, which would appoint one of its own number for the purpose. All that the priest had to do was to sprinkle the blood; at the same time the slaying was to take place לפניו, before him, i.e., before his eyes. Eleazar was to sprinkle some of the blood seven times \"towards the opposite,\" i.e., toward the front of the tabernacle (seven times, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Through this sprinkling of the blood the slaying became a sacrifice, being brought thereby into relation to Jehovah and the sanctuary; whilst the life, which was sacrificed for the sin of the congregation, was given up to the Lord, and offered up in the only way in which a sacrifice, prepared like this, outside the sanctuary, could possibly be offered.",
        "children": []
      }
    ]
  }
]