[{"num":5,"verse":"Hear this, O you priests! And listen, O house of Israel! And give ear, O house of the king! For the judgment pronounced pertains to you and is meant for you, because you have been a snare at Mizpah and a net spread upon Tabor [military strongholds on either side of the Jordan River]."},{"num":2,"verse":"The revolters are deeply sunk in corruption and slaughter, but I [the Lord God] am a rebuke and a chastisement for them all."},{"num":3,"verse":"I know Ephraim, and Israel is not hid from Me; for now, O Ephraim, you have played the harlot and have worshiped idols; Israel is defiled."},{"num":4,"verse":"Their doings will not permit them to return to their God, for the spirit of harlotry is within them and they know not the Lord [they do not recognize, appreciate, give heed to, or cherish the Lord]."},{"num":5,"verse":"But the pride and self-reliance of Israel testifies before his [own] face. Therefore shall [all] Israel, and [especially] Ephraim [the northern ten tribes], totter and fall in their iniquity and guilt, and Judah shall stumble and fall with them."},{"num":6,"verse":"They shall go with their flocks and with their herds to seek the Lord [inquiring for and requiring Him], but they will not find Him; He has withdrawn Himself from them."},{"num":7,"verse":"They have dealt faithlessly and treacherously with the Lord [their espoused Husband], for they have borne alien children. Now shall a [single] New Moon (one month) devour them with their fields."},{"num":8,"verse":"Blow the horn in Gibeah and the trumpet in Ramah [both lofty hills on Benjamin’s northern border]. Sound the alarm at Beth-aven: [the enemy is] behind you and after you, O Benjamin [be on your guard]!"},{"num":9,"verse":"Ephraim shall become a desolation in the day of rebuke and punishment. Among the tribes of Israel I declare what shall surely be."},{"num":10,"verse":"The princes of Judah are like those who remove the landmark [the barrier between right and wrong]; I will pour out My wrath upon them like water."},{"num":11,"verse":"Ephraim is oppressed; he is broken and crushed by [divine] judgment, because he was content to walk after idols (images) and man’s [evil] command (vanities and filth)."},{"num":12,"verse":"Therefore I am like a moth to Ephraim and like dry rot to the house of Judah [in My judgment against them]."},{"num":13,"verse":"When Ephraim saw his sickness and Judah saw his wound, then Ephraim went to Assyria and sent to [Assyria’s] great King Jareb [for help]. Yet he cannot heal you nor will he cure you of your wound [received in divine judgment]."},{"num":14,"verse":"For I will be to Ephraim like a lion, and like a young lion to the house of Judah. I, even I, will rend and go on [rending]; I will carry off and there will be no one to deliver."},{"num":15,"verse":"I will return to My place [on high] until they acknowledge their offense and feel their guilt and seek My face; in their affliction and distress they will seek, inquire for, and require Me earnestly, saying,"}]