[{"header":"Philistines Take the Ark in Victory"},{"num":4,"verse":"So the word of Samuel came to all Israel. Now Israel went out to meet the Philistines in battle, and they camped beside Ebenezer, while the Philistines camped in Aphek."},{"num":2,"verse":"Then the Philistines drew up in battle formation to meet Israel. When the battle spread, Israel was defeated by the Philistines, who killed about four thousand men on the battlefield."},{"num":3,"verse":"When the people came into the camp, the elders of Israel said, “Why has the Lord defeated us today before the Philistines? Let’s take the ark of the covenant of the Lord from Shiloh, so that He may come among us and save us from the power of our enemies.”"},{"num":4,"verse":"So the people sent men to Shiloh, and from there they carried the ark of the covenant of the Lord of armies who is enthroned above the cherubim; and the two sons of Eli, Hophni and Phinehas, were there with the ark of the covenant of God."},{"num":5,"verse":"And as the ark of the covenant of the Lord was coming into the camp, all Israel shouted with a great shout, so that the earth resounded."},{"num":6,"verse":"And when the Philistines heard the noise of the shout, they said, “What does the noise of this great shout in the camp of the Hebrews mean?” Then they understood that the ark of the Lord had come into the camp."},{"num":7,"verse":"So the Philistines were afraid, for they said, “God has come into the camp!” And they said, “Woe to us! For nothing like this has happened before."},{"num":8,"verse":"Woe to us! Who will save us from the hand of these mighty gods? These are the gods who struck the Egyptians with all kinds of plagues in the wilderness."},{"num":9,"verse":"Take courage and be men, Philistines, or you will become slaves to the Hebrews, as they have been slaves to you; so be men and fight!”"},{"num":10,"verse":"So the Philistines fought and Israel was defeated, and every man fled to his tent; and the defeat was very great, for thirty thousand foot soldiers of Israel fell."},{"num":11,"verse":"Moreover, the ark of God was taken; and the two sons of Eli, Hophni and Phinehas, died."},{"num":12,"verse":"Now a man of Benjamin ran from the battle line and came to Shiloh the same day with his clothes torn, and dust on his head."},{"num":13,"verse":"When he came, behold, Eli was sitting on his seat by the road keeping watch, because his heart was anxious about the ark of God. And the man came to give a report in the city, and all the city cried out."},{"num":14,"verse":"When Eli heard the noise of the outcry, he said, “What does the noise of this commotion mean?” Then the man came hurriedly and told Eli."},{"num":15,"verse":"Now Eli was ninety-eight years old, and his eyes were fixed and he could not see."},{"num":16,"verse":"The man said to Eli, “I am the one who came from the battle line. Indeed, I escaped from the battle line today.” And he said, “How are things, my son?”"},{"num":17,"verse":"Then the one who brought the news replied, “Israel has fled before the Philistines and there has also been a great defeat among the people, and your two sons, Hophni and Phinehas are also dead; and the ark of God has been taken.”"},{"num":18,"verse":"When he mentioned the ark of God, Eli fell off the seat backward beside the gate, and his neck was broken and he died, for he was old and heavy. And so he judged Israel for forty years."},{"num":19,"verse":"Now his daughter-in-law, Phinehas’ wife, was pregnant and about to give birth; and when she heard the news that the ark of God had been taken and that her father-in-law and her husband had died, she kneeled down and gave birth, because her pains came upon her."},{"num":20,"verse":"And about the time of her death the women who were standing by her said to her, “Do not be afraid, for you have given birth to a son.” But she did not answer or pay attention."},{"num":21,"verse":"And she named the boy Ichabod, saying, “The glory has departed from Israel,” because the ark of God had been taken and because of her father-in-law and her husband."},{"num":22,"verse":"So she said, “The glory has departed from Israel, because the ark of God has been taken.”"}]