[{"header":"Chapter 4[a]"},{"num":1,"verse":"The Defeat of the Israelites. Samuel’s word came to all of Israel. Now the Israelites went out to fight against the Philistines. They were camped at Ebenezer, and the Philistines were encamped in Aphek."},{"num":2,"verse":"The Philistines drew up in battle line against the Israelites, and when they joined up in battle, the Israelites were defeated by the Philistines who killed about four thousand of them on the battlefield."},{"num":3,"verse":"When the soldiers came back into camp, the elders of Israel asked, “Why has the Lord brought defeat upon us today at the hands of the Philistines? Let us go get the Ark of the Covenant from Shiloh so that it can go out before us and save us from the hands of our enemies.”"},{"num":4,"verse":"The Ark Is Captured. So the people sent to Shiloh to bring the Ark of the Covenant of the Lord of hosts who is enthroned between the cherubim. The two sons of Eli, Hophni and Phinehas, were there with the Ark of the Covenant of God."},{"num":5,"verse":"When the Ark of the Covenant of the Lord came into the camp, all of the Israelites raised such a loud shout that it shook the earth."},{"num":6,"verse":"When the Philistines heard the uproar, they asked, “What is this great uproar in the Hebrew camp?” When they found out that the Ark of the Lord had come into the camp,"},{"num":7,"verse":"the Philistines became frightened. They said, “A god has come into the camp!” They said, “Woe to us, for nothing like this has happened before."},{"num":8,"verse":"Woe to us! Who will deliver us out of the hands of these mighty gods? These are the gods who struck the Egyptians with all kinds of plagues in the desert."},{"num":9,"verse":"Be strong. Act manfully, O Philistines, or you will end up as slaves to the Hebrews, just like they were to you. Act manfully and fight!”"},{"num":10,"verse":"So the Philistines fought, and the Israelites were defeated, and each man fled to his own tent. The slaughter was great, for Israel lost thirty thousand foot soldiers."},{"num":11,"verse":"The Ark of God was captured and Eli’s two sons, Hophni and Phinehas, were killed."},{"num":12,"verse":"The Death of Eli. That same day a Benjaminite ran from the battle line to Shiloh. His clothes were torn and there was dust on his head."},{"num":13,"verse":"He came upon Eli who was sitting by the side of the road. He was watching, concerned about the Ark of God. When the man entered the city and told them what had happened, the entire city raised up a cry."},{"num":14,"verse":"When Eli heard the uproar, he said, “What is the meaning of this outcry?” The man hurried over and explained it to Eli."},{"num":15,"verse":"Now Eli was ninety-eight years old, and his eyesight was so poor that he could barely see."},{"num":16,"verse":"The man said to Eli, “I am the one who came from the battle. I escaped from the battle today.” He asked, “How did things go, my son?”"},{"num":17,"verse":"The messenger answered, “Israel has fled from before the Philistines, and there has been a great slaughter. Your two sons, Hophni and Phinehas, are dead, and the Ark of God has been captured.”"},{"num":18,"verse":"At the mention of the Ark of God, he fell over backwards off his seat beside the gate, and he broke his neck and died, for he was a very old man and quite heavy. He had been a judge of Israel for forty years."},{"num":19,"verse":"His daughter-in-law, the wife of Phinehas, was pregnant. When she heard the news that the Ark of God had been captured, and that her father-in-law and her husband were dead, she sunk to her knees and gave birth, for she was overcome by her labor pains."},{"num":20,"verse":"As she was dying, the women who were standing around her said to her, “Do not fear, for you have borne a son.” But she gave no response, nor did she even look at it."},{"num":21,"verse":"Then she named the child Ichabod, for she said, “The glory of God has departed from Israel,” for the Ark of God had been captured and also because of what had happened to her father-in-law and her husband."},{"num":22,"verse":"For this she said, “The glory of God has departed from Israel, for the Ark of God has been captured.”"}]