[{"header":"The Music Groups"},{"num":25,"verse":"David and the commanders of the army chose some of the sons of Asaph, Heman, and Jeduthun to preach and play harps, lyres, and cymbals. Here is a list of the men who served in this way:"},{"num":2,"verse":"Asaph’s sons who served were Zaccur, Joseph, Nethaniah, and Asarelah. King David chose Asaph to preach, and Asaph directed his sons."},{"num":3,"verse":"Jeduthun’s sons who served were Gedaliah, Zeri, Jeshaiah, Shimei, Hashabiah, and Mattithiah. There were six of them, and Jeduthun directed them. He preached and used a harp to give thanks and praise to the Lord."},{"num":4,"verse":"Heman’s sons who served were Bukkiah, Mattaniah, Uzziel, Shubael, Jerimoth, Hananiah, Hanani, Eliathah, Giddalti, Romamti-Ezer, Joshbekashah, Mallothi, Hothir, and Mahazioth. "},{"num":5,"verse":"All these were sons of Heman, David’s seer. God promised to make Heman strong, so Heman had many sons. God gave him fourteen sons and three daughters. "},{"num":6,"verse":"Heman directed all his sons in making music for the Temple of the Lord with cymbals, lyres, and harps; that was their way of serving in the Temple of God. King David was in charge of Asaph, Jeduthun, and Heman. "},{"num":7,"verse":"These men and their relatives were trained and skilled in making music for the Lord. There were two hundred eighty-eight of them. "},{"num":8,"verse":"Everyone threw lots to choose the time his family was to serve at the Temple. The young and the old, the teacher and the student, had to throw lots."},{"num":9,"verse":"First, the lot fell to Joseph, from the family of Asaph."},{"num":10,"verse":"Third, twelve men were chosen from Zaccur, his sons and relatives."},{"num":11,"verse":"Fourth, twelve men were chosen from Izri, his sons and relatives."},{"num":12,"verse":"Fifth, twelve men were chosen from Nethaniah, his sons and relatives."},{"num":13,"verse":"Sixth, twelve men were chosen from Bukkiah, his sons and relatives."},{"num":14,"verse":"Seventh, twelve men were chosen from Jesarelah, his sons and relatives."},{"num":15,"verse":"Eighth, twelve men were chosen from Jeshaiah, his sons and relatives."},{"num":16,"verse":"Ninth, twelve men were chosen from Mattaniah, his sons and relatives."},{"num":17,"verse":"Tenth, twelve men were chosen from Shimei, his sons and relatives."},{"num":18,"verse":"Eleventh, twelve men were chosen from Azarel, his sons and relatives."},{"num":19,"verse":"Twelfth, twelve men were chosen from Hashabiah, his sons and relatives."},{"num":20,"verse":"Thirteenth, twelve men were chosen from Shubael, his sons and relatives."},{"num":21,"verse":"Fourteenth, twelve men were chosen from Mattithiah, his sons and relatives."},{"num":22,"verse":"Fifteenth, twelve men were chosen from Jerimoth, his sons and relatives."},{"num":23,"verse":"Sixteenth, twelve men were chosen from Hananiah, his sons and relatives."},{"num":24,"verse":"Seventeenth, twelve men were chosen from Joshbekashah, his sons and relatives."},{"num":25,"verse":"Eighteenth, twelve men were chosen from Hanani, his sons and relatives."},{"num":26,"verse":"Nineteenth, twelve men were chosen from Mallothi, his sons and relatives."},{"num":27,"verse":"Twentieth, twelve men were chosen from Eliathah, his sons and relatives."},{"num":28,"verse":"Twenty-first, twelve men were chosen from Hothir, his sons and relatives."},{"num":29,"verse":"Twenty-second, twelve men were chosen from Giddalti, his sons and relatives."},{"num":30,"verse":"Twenty-third, twelve men were chosen from Mahazioth, his sons and relatives."},{"num":31,"verse":"Twenty-fourth, twelve men were chosen from Romamti-Ezer, his sons and relatives."}]