[{"header":"David Weeps Over Absalom"},{"num":19,"verse":"The king was shaken. So he went up to the chamber over the gate and wept. As he walked he cried, “My son Absalom! O my son, my son Absalom! If only I had died instead of you! Absalom, my son, my son!”"},{"num":2,"verse":"Then Joab was told, “Look, the king is weeping and mourning over Absalom!” "},{"num":3,"verse":"So the victory that day was turned into mourning for all the troops, for the troops heard it said that day, “The king is grieving over his son.” "},{"num":4,"verse":"So the troops entered into the city stealthily that day, like troops who are ashamed after running away in battle."},{"num":5,"verse":"The king covered his face and cried with a loud voice, “My son Absalom, O Absalom, my son, my son!”"},{"num":6,"verse":"Then Joab came into the house to the king and said, “Today you have humiliated all your servants—who this day have saved your life, the lives of your sons and daughters, and the lives of your wives and the lives of your concubines—"},{"num":7,"verse":"by loving those who hate you, and hating those who love you! For you have shown today that officers and officials are nothing to you. For today I realize that if Absalom were alive and all of us were dead, then it would have pleased you well. "},{"num":8,"verse":"So now arise, go out, and speak to the heart of your servants! For I swear by Adonai that if you do not go out, not a single man will stay with you tonight, and that would be worse for you than all the evil that has befallen you from your youth until now.”"},{"num":9,"verse":"So the king arose and sat in the gate. When they told all the troops saying, “See, the king is sitting at the gate,” all the troops presented themselves before the king."},{"header":"David’s Restoration and Grace"},{"num":10,"verse":"All the people throughout all the tribes of Israel were at strife saying, “The king delivered us from the hand of our enemies and he saved us from the hand of the Philistines. Yet now he had to flee from the land because of Absalom, "},{"num":11,"verse":"but Absalom, whom we anointed over us, has died in battle. So why are we silent about restoring the king?”"},{"num":12,"verse":"Then King David sent word to Zadok and Abiathar the kohanim saying, “Speak to the elders of Judah saying, ‘Why should you be the last to bring the king back to his palace? The talk of all Israel had reached the king at his residence. "},{"num":13,"verse":"‘You are my kinsmen, my bone and my flesh! Why then should you be the last to bring back the king?’"},{"num":14,"verse":"“Also say to Amasa, ‘Are you not my bone and my flesh? May God do so to me and even more if you do not become my army commander before me continually, in place of Joab!’”"},{"num":15,"verse":"Thus he turned the heart of all the men of Judah as one man, and then they sent word to the king, “Come back, you and all your servants.” "},{"num":16,"verse":"So the king returned and reached the Jordan. Meanwhile, Judah came to Gilgal in order to meet the king, to escort the king over the Jordan."},{"num":17,"verse":"Then Shimei son of Gera, the Benjamite who was from Bahurim, hurried and came down with the men of Judah to meet King David "},{"num":18,"verse":"accompanied by 1,000 men of Benjamin. Also Ziba the servant of Saul’s household, with his 15 sons and 20 slaves, rushed to the Jordan ahead of the king. "},{"num":19,"verse":"They ferried across the ford to bring the king’s household and they did whatever seemed good in his eyes. Now, Shimei son of Gera fell down before the king when he was crossing over the Jordan, "},{"num":20,"verse":"so he implored the king, “Let my lord not hold me guilty, and not remember the iniquity that your servant committed on the day my lord the king left Jerusalem. Let the king not take it to his heart. "},{"num":21,"verse":"For your servant knows that I have sinned. So behold, I have come today the first of all the house of Joseph to go down to meet my lord the king.”"},{"num":22,"verse":"But Abishai son of Zeruiah answered and said, “Shouldn’t Shimei be put to death for this, because he cursed Adonai’s anointed?”"},{"num":23,"verse":"But David said, “What have I to do with you sons of Zeruiah that you should be my adversary today? Should any man be put to death in Israel this day? Don’t I know that today I am king over Israel?” "},{"num":24,"verse":"Then the king said to Shimei, “You shall not die,” and the king swore it to him."},{"num":25,"verse":"Then Mephibosheth son of Saul came down to meet the king. Now he had neither dressed his feet nor trimmed his beard nor washed his clothes from the day the king departed until the day he came home in shalom. "},{"num":26,"verse":"Now it came to pass when he came from Jerusalem to meet the king, the king asked him, “Why did you not go with me Mephibosheth?”"},{"num":27,"verse":"“My lord the king, my own servant deceived me,” he answered. “For your servant had said, ‘I will saddle a donkey for myself, ride on it and go with the king,’ because your servant is lame. "},{"num":28,"verse":"However, he has slandered your servant to my lord the king. But my lord the king is like an angel of God. So do what is good in your eyes. "},{"num":29,"verse":"For all my father’s household deserved only death at the hand of my lord the king; yet you set your servant among those eating at your own table! What right do I have yet to cry to the king?”"},{"num":30,"verse":"Then the king said to him, “Why do you still speak of your affairs? I have decreed, ‘You and Ziba shall divide the land.’”"},{"num":31,"verse":"“So let him take all,” Mephibosheth replied to the king, “as long as my lord the king has come back to his own home in shalom.”"},{"num":32,"verse":"Then Barzillai the Gileadite came down from Rogelim, and he approached the Jordan with the king to escort him over the Jordan. "},{"num":33,"verse":"Now Barzillai was a very aged man—80 years old—and he had provided for the king during his residence at Mahanaim, for he was a very wealthy man. "},{"num":34,"verse":"The king said to Barzillai, “Cross over with me, and I will provide for you with me in Jerusalem.” "},{"num":35,"verse":"But Barzillai said to the king, “How many years are left of my life that I should go up with the king to Jerusalem? "},{"num":36,"verse":"I am now 80 years old. Can I distinguish between good and bad? Can your servant taste what I eat or what I drink? Can I listen any more to the voice of singing men and women? Why then should your servant be yet a burden to my lord the king? "},{"num":37,"verse":"Your servant would merely cross over the Jordan with the king. But why should the king reward me with such a reward? "},{"num":38,"verse":"Please let your servant go back, and let me die in my own hometown, near the grave of my father and my mother. But look, here is your servant Chimham—let him cross over with my lord the king, and do for him what seems good in your eyes.”"},{"num":39,"verse":"The king answered, “Chimham will cross over with me, and I will do for him what seems good in your eyes. Whatever you ask of me, I will do for you.” "},{"num":40,"verse":"When all the people had crossed over the Jordan and as the king was about to cross over, the king kissed Barzillai and blessed him, so he returned to his own place."},{"num":41,"verse":"Then the king crossed over to Gilgal, and Chimham and all the people of Judah crossed over with him, and also half the people of Israel escorted the king over. "},{"num":42,"verse":"Then all the men of Israel came to the king and said to him, “Why did our brothers, the men of Judah, steal you away by escorting the king and his household over the Jordan, along with all David’s men that were with him?”"},{"num":43,"verse":"Then all the men of Judah answered the men of Israel, “Because the king is our close relative. So why are you angry over this matter? Have we eaten at all at the king’s cost? Or has he given us any gifts?”"},{"num":44,"verse":"Then the men of Israel answered the men of Judah and said, “We have ten shares in the king, so in David we have even more than you. Why then did you despise us? Weren’t we the first to speak of restoring our king?” Yet the words of the men of Judah were harsher than the words of the men of Israel."}]