[{"num":20,"verse":"Then Zophar the Naamathite answered,"},{"num":2,"verse":"Therefore do my thoughts give me an answer, and I make haste [to offer it] for this reason."},{"num":3,"verse":"I have heard the reproof which puts me to shame, but out of my understanding my spirit answers me."},{"num":4,"verse":"Do you not know from of old, since the time that man was placed on the earth,"},{"num":5,"verse":"That the triumphing of the wicked is short, and the joy of the godless and defiled is but for a moment?"},{"num":6,"verse":"Though his [proud] height mounts up to the heavens and his head reaches to the clouds,"},{"num":7,"verse":"Yet he will perish forever like his own dung; those who have seen him will say, Where is he?"},{"num":8,"verse":"He will fly away like a dream and will not be found; yes, he will be chased away as a vision of the night."},{"num":9,"verse":"The eye which saw him will see him no more, neither will his [accustomed] place any more behold him."},{"num":10,"verse":"The poor will oppress his children, and his hands will give back his [ill-gotten] wealth."},{"num":11,"verse":"His bones are full of youthful energy, but it will lie down with him in the dust."},{"num":12,"verse":"Though wickedness is sweet in his mouth, though he hides it under his tongue,"},{"num":13,"verse":"Though he is loath to let it go but keeps it still within his mouth,"},{"num":14,"verse":"Yet his food turns [to poison] in his stomach; it is the venom of asps within him."},{"num":15,"verse":"He has swallowed down [his ill-gotten] riches, and he shall vomit them up again; God will cast them out of his belly."},{"num":16,"verse":"He shall suck the poison of asps [which ill-gotten wealth contains]; the viper’s tongue shall slay him."},{"num":17,"verse":"He shall not look upon the rivers, the flowing streams of honey and butter [to enjoy his wealth]."},{"num":18,"verse":"That which he labored for shall he give back and shall not swallow it down [to enjoy it]; according to his wealth shall the restitution be, and he shall not rejoice in it."},{"num":19,"verse":"For he has oppressed and forsaken the poor; he has violently taken away a house which he did not build."},{"num":20,"verse":"Because his desire and greed knew no quietness within him, he will not save anything of that in which he delights."},{"num":21,"verse":"There was nothing left that he did not devour; therefore his prosperity will not endure."},{"num":22,"verse":"In the fullness of his sufficiency [in the time of his great abundance] he shall be poor and in straits; every hand of everyone who is in misery shall come upon him [he is but a wretch on every side]."},{"num":23,"verse":"When he is about to fill his belly [as in the wilderness when God sent the quails], God will cast the fierceness of His wrath upon him and will rain it upon him while he is eating."},{"num":24,"verse":"He will flee from the iron weapon, but the bow of bronze shall strike him through."},{"num":25,"verse":"[The arrow] is drawn forth and it comes out after passing through his body; yes, the glittering point comes out of his gall. Terrors march in upon him;"},{"num":26,"verse":"Every misfortune is laid up for his treasures. A fire not blown by man shall devour him; it shall consume what is left in his tent [and it shall go ill with him who remains there]."},{"num":27,"verse":"The heavens shall reveal his iniquity, and the earth shall rise up against him."},{"num":28,"verse":"The produce and increase of his house will go into exile [with the victors], dragged away in the day of [God’s] wrath."},{"num":29,"verse":"This is the wicked man’s portion from God, and the heritage appointed to him by God."}]