[{"num":20,"verse":"Then answered Tzophar the Na’amati, and said,"},{"num":2,"verse":"Therefore do my thoughts cause me to answer, and ba’avur (because of [this]) I make haste."},{"num":3,"verse":"I hear the musar that insults me, and the ruach of my understanding causeth me to answer."},{"num":4,"verse":"Knowest thou not this of old, since adam was placed upon earth,"},{"num":5,"verse":"That the triumphing of the resha’im is short, and the simchat chanef (joy of the hypocrite) but for a moment?"},{"num":6,"verse":"Though his excellency mount up to Shomayim, and his rosh reach unto the clouds;"},{"num":7,"verse":"Yet he shall perish lanetzach (forever) like his own dung; they which have seen him shall say, Where is he?"},{"num":8,"verse":"He shall fly away as a chalom, and shall not be found; yea, he shall be chased away as a chezyon lailah."},{"num":9,"verse":"The ayin also which saw him shall see him no more; neither shall his makom any more behold him."},{"num":10,"verse":"His banim shall seek the favor of the poor, and his hands shall restore their goods."},{"num":11,"verse":"His atzmot are full of youthful vigor, which shall lie down with him in the aphar."},{"num":12,"verse":"Though wickedness be sweet in his mouth, though he hide it under his leshon;"},{"num":13,"verse":"Though he savor it, and forsake it not, but keep it still betoch (within) his mouth;"},{"num":14,"verse":"Yet his lechem in his stomach is turned sour; it is the venom of vipers within him."},{"num":15,"verse":"He hath swallowed down riches, and he shall vomit them up again; El shall drive them out of his beten."},{"num":16,"verse":"He shall suck the venom of asps; the viper’s leshon shall slay him."},{"num":17,"verse":"He shall not see the rivers, the floods, the brooks of devash and khemah (butter, curds)."},{"num":18,"verse":"That which he labored for shall he give back, and shall not swallow it down; he shall not rejoice according to his chayil temurah (business profit)."},{"num":19,"verse":"Because he hath oppressed and hath forsaken the destitute; because he hath violently seized a bais which he built not;"},{"num":20,"verse":"Surely he knew no quiet in his beten; he shall not save anything which he desired."},{"num":21,"verse":"There shall none of his ochel be left; therefore his posterity will not endure."},{"num":22,"verse":"In the fulness of his sufficiency he shall be in distress; kol yad of misery shall come upon him."},{"num":23,"verse":"When he is about to fill his beten, He shall cast the charon af (fury of His wrath) upon him, and shall rain it upon him while he is eating."},{"num":24,"verse":"He shall flee from the weapon of barzel (iron), and the keshet of bronze shall strike him through."},{"num":25,"verse":"It is drawn, and cometh out of their body; yea, the glittering point cometh out of his gall; emim (terrors [of death]) are upon them."},{"num":26,"verse":"Kol choshech is reserved for his treasures; an eish not fanned shall consume him; it shall go ill with him that is left in his ohel."},{"num":27,"verse":"Shomayim shall reveal his iniquity; and eretz shall rise up against him."},{"num":28,"verse":"The increase of his bais shall depart, and his goods shall flow away in [G-d’s] Yom Af."},{"num":29,"verse":"This is the chelek of an adam rasha from Elohim, and the nachalah decreed unto him by El (G-d)."}]