[{"num":8,"verse":"And Hashem said unto Yehoshua, Fear not, neither be thou discouraged; take kol Am HaMilchamah with thee, and arise, go up to Ai; see, I have given into thy yad the melech HaAi, and his people, and his city, and his land;"},{"num":2,"verse":"And thou shalt do to Ai and her melech just as thou didst unto Yericho and her melech; only the plunder thereof, and the livestock thereof, shall ye carry off for yourselves. Behind it set thee an ambush for the Ir (city [of Ai])."},{"num":3,"verse":"So Yehoshua arose, and kol Am HaMilchamah, to go up against Ai; and Yehoshua chose out shloshim elef ish gibborei hachayil, and sent them out by lailah."},{"num":4,"verse":"And he commanded them, saying, See, ye shall set an ambush against the Ir, even behind the Ir; go not very far from the Ir, but be ye all nekhonim (ready, on alert, set, prepared);"},{"num":5,"verse":"And I, and Kol HaAm that are with me, will approach unto the Ir; and it shall come to pass, when they come out against us, as at the rishonah, that we will flee before them,"},{"num":6,"verse":"(For they will come out after us) until we have drawn them from the Ir; for they will say, They flee before us, just as at the rishonah; therefore we will flee before them."},{"num":7,"verse":"Then ye shall rise up from the ambush, and seize upon the Ir; for Hashem Eloheichem will deliver it into your yad."},{"num":8,"verse":"And it shall be, when ye have taken the Ir, that ye shall set eish to the Ir; according to the Davar Hashem shall ye do. See, I have commanded you."},{"num":9,"verse":"Yehoshua therefore sent them forth; and they went to the place of ambush, and waited between Beit-El and Ai, on the west side of Ai; but Yehoshua spent that lailah among HaAm."},{"num":10,"verse":"And Yehoshua rose up early in the boker, and mustered HaAm, and went up, he and the Ziknei Yisroel, before HaAm to Ai."},{"num":11,"verse":"And Kol HaAm HaMilchamah that were with him, went up, and drew near, and came before the Ir, and encamped on the north side of Ai; now there was the gey (valley) between them and Ai."},{"num":12,"verse":"And he took about chameshet alafim ish, and set them to lie in ambush between Beit-El and Ai, on the west side of the Ir."},{"num":13,"verse":"And when they had set HaAm, even Kol HaMachaneh that was on the north of the Ir, and the ambush to the west of the Ir, Yehoshua went that lailah into the midst of the emek (valley)."},{"num":14,"verse":"And it came to pass, when the melech of Ai saw it, that they hastened and rose up early, and the anshei HaIr went out against Yisroel in the milchamah, he and all his people, at the place, before the Aravah; but he had no da’as that there was an ambush against him set up behind the Ir."},{"num":15,"verse":"And Yehoshua and kol Yisroel let themselves be driven before them, and fled by the derech hamidbar."},{"num":16,"verse":"And kol HaAm that were in Ai were called together to pursue after them; and they pursued after Yehoshua, and were lured from the Ir."},{"num":17,"verse":"And there was not an ish left in Ai or Beit-El, that went not out after Yisroel; and they left the Ir open, and pursued after Yisroel."},{"num":18,"verse":"And Hashem said unto Yehoshua, Stretch out the kidon (javelin) that is in thy yad toward Ai; for I will give it into thine yad. And Yehoshua stretched out the kidon that he had in his yad toward the Ir."},{"num":19,"verse":"And the ambush arose quickly out of their makom, and they ran as soon as he had stretched out his yad; and they entered into the Ir, and took it, and hastened and set eish to the Ir."},{"num":20,"verse":"And when the men of Ai looked behind them, they saw, and, hinei, the ashan HaIr (smoke of the city) ascended up to Shomayim, and they had no way to flee here or there; and HaAm that fled to the midbar turned back upon the pursuers."},{"num":21,"verse":"And when Yehoshua and kol Yisroel saw that the ambush had taken the Ir, and that the ashan HaIr ascended, then they turned again, and attacked the anshei HaAi."},{"num":22,"verse":"Then these came out of the Ir against them; so they were in the midst of Yisroel, some on this side, and some on that side; and they struck them down, until they left none of them sarid (remnant, survivor) or palit (refugee, fugitive)."},{"num":23,"verse":"And the melech HaAi (literally, the King of Ruin) they took alive, and brought him to Yehoshua."},{"num":24,"verse":"And it came to pass, when Yisroel had made an end of slaying all the inhabitants of Ai in the sadeh, in the midbar wherein they chased them, and when they were all fallen on the edge of the cherev, until they were consumed, that kol Yisroel returned unto Ai, and struck it with the edge of the cherev."},{"num":25,"verse":"And so it was, that all that fell that yom, both of ish and isha, were sheneym asar elef, even kol anshei HaAi."},{"num":26,"verse":"For Yehoshua drew not his yad back, wherewith he stretched out the kidon, until he had utterly destroyed kol yoshvei HaAi."},{"num":27,"verse":"Only the behemah and the plunder of that Ir Yisroel carried off for themselves, according to the Davar Hashem which He commanded Yehoshua."},{"num":28,"verse":"And Yehoshua burned Ai, and made it a tel olam (heap forever), even a desolation unto yom hazeh."},{"num":29,"verse":"And the melech HaAi he hanged on HaEtz until the time of erev; and as soon as the shemesh was down, Yehoshua commanded that they should take his nevelah (body) down from HaEtz, and cast it at the petach sha’ar HaIr, and raised thereon a pile of avanim, that remaineth unto Yom Hazeh."},{"num":30,"verse":"Then Yehoshua built a Mizbe’ach unto Hashem Elohei Yisroel in Har Eval,"},{"num":31,"verse":"Just as Moshe Eved Hashem commanded the Bnei Yisroel, as it is written in the Sefer Torah Moshe, a Mizbe’ach avanim shelemot, over which no man hath lift up any barzel (iron); and they offered thereon olot unto Hashem, and sacrificed shelamim."},{"num":32,"verse":"And he wrote there upon the avanim a mishneh (copy) Torat Moshe, which he wrote in the presence of the Bnei Yisroel."},{"num":33,"verse":"And Kol Yisroel, and their Zekenim, and shoterim, and their shofetim, stood on this side the Aron and on that side facing the Kohanim the Levi’im, which bore the Aron Brit Hashem, as well the ger as the ezrach (he that was born among them); half of them over against Har Gerizim, and half of them over against Har Eval; just as Moshe Eved Hashem had commanded before, in connection with the blessing of HaAm Yisroel."},{"num":34,"verse":"And afterward he read kol divrei HaTorah, the brocha and kelalah, according to all that is written in the Sefer HaTorah."},{"num":35,"verse":"There was not a davar of all that Moshe commanded, which Yehoshua read not before kol Kehal Yisroel, with the nashim, and the little ones, and the ger that were living among them."}]