[{"header":"Jesus Returns To Galilee And Feeds The 5000"},{"num":6,"verse":"After these things, Jesus went away to the other side of the Sea of Galilee— of Tiberias. "},{"num":2,"verse":"And a large crowd was following Him, because they were seeing the signs which He was doing on the ones being sick. "},{"num":3,"verse":"And Jesus went up on the mountain, and was sitting there with His disciples. "},{"num":4,"verse":"And the Passover, the Feast of the Jews, was near. "},{"num":5,"verse":"Then Jesus, having lifted-up His eyes and seen that a large crowd was coming to Him, says to Philip, “From where may we buy bread in order that these ones may eat?” "},{"num":6,"verse":"Now He was saying this testing him. For He Himself knew what He was going to do. "},{"num":7,"verse":"Philip answered Him, “Loaves worth two-hundred denarii are not enough for them, in order that each one may receive a little bit”. "},{"num":8,"verse":"One of His disciples— Andrew, the brother of Simon Peter— says to Him, "},{"num":9,"verse":"“There is a boy here who has five barley loaves and two fish, but what are these for so many?” "},{"num":10,"verse":"Jesus said, “Make the people fall-back [to eat]”. And there was much grass in the place. So the men— about five-thousand as to the number— fell back [to eat]. "},{"num":11,"verse":"Then Jesus took the loaves. And having given-thanks, He distributed them to the ones reclining-back [to eat]— likewise also from the fish— as much as they were wanting. "},{"num":12,"verse":"And when they were filled, He says to His disciples, “Gather the left-over fragments so that nothing may be lost”. "},{"num":13,"verse":"So they gathered, and filled twelve baskets of fragments from the five barley loaves, which were left over by the ones having eaten. "},{"num":14,"verse":"Therefore the people, having seen the sign which He did, were saying that “This One is truly the Prophet coming into the world”. "},{"num":15,"verse":"Then Jesus, having known that they were about to come and take Him away-by-force in order that they might make Him king, withdrew again to the mountain, Himself alone."},{"header":"Jesus Walks On Water To Capernaum"},{"num":16,"verse":"Now when it became evening, His disciples went down to the sea. "},{"num":17,"verse":"And having gotten into a boat, they were going to the other side of the sea, to Capernaum. And darkness already had come, and Jesus had not-yet come to them. "},{"num":18,"verse":"And the sea was becoming aroused from a great wind blowing. "},{"num":19,"verse":"So having rowed about twenty five or thirty stades, they see Jesus walking on the sea and becoming near the boat. And they became afraid. "},{"num":20,"verse":"But the One says to them, “I am the One. Do not be afraid”. "},{"num":21,"verse":"So they were willing to take Him into the boat. And immediately the boat came-to-be at the land to which they were going."},{"header":"The Crowd Follows Him There"},{"num":22,"verse":"On the next day the crowd standing on the other side of the sea saw that there had not been another small boat there except [the] one, and that Jesus had not entered into the boat with His disciples, but His disciples had gone away alone. "},{"num":23,"verse":"Other small-boats came from Tiberias near the place where they ate the bread, the Lord having given-thanks. "},{"num":24,"verse":"So when the crowd saw that Jesus was not there, nor His disciples, they got into the small boats, and went to Capernaum seeking Jesus."},{"header":"Jesus Says, Work For The Food Leading To Eternal Life, Which The Son Will Give You"},{"num":25,"verse":"And having found Him on the other side of the sea, they said to Him, “Rabbi, when have You come here?” "},{"num":26,"verse":"Jesus responded to them and said, “Truly, truly, I say to you— you are seeking Me not because you saw signs, but because you ate of the loaves-of-bread and were filled-to-satisfaction. "},{"num":27,"verse":"Do not be working for the food which is perishing, but for the food which is remaining to eternal life— which the Son of Man will give to you. For God the Father certified this One”."},{"header":"The Work God Requires of You Is To Believe In The One Sent Forth By God"},{"num":28,"verse":"So they said to Him, “What may we be doing in order that we may be working the works of God?” "},{"num":29,"verse":"Jesus responded and said to them, “This is the work of God: that you be believing in the One Whom that One sent-forth”."},{"header":"My Father Is Giving You The True Bread From Heaven, Which Came To Give Life"},{"num":30,"verse":"So they said to Him, “What then do You do as a sign, in order that we may see it and believe You? What thing do you work? "},{"num":31,"verse":"Our fathers ate the manna in the wilderness, just as it has been written [in Ps 78:24]: ‘He gave them bread from heaven to eat’”. "},{"num":32,"verse":"So Jesus said to them, “Truly, truly, I say to you, Moses has not given you the bread from heaven, but My Father is giving you the true Bread from heaven. "},{"num":33,"verse":"For the bread of God is the One coming down from heaven and giving life to the world”."},{"header":"I Am The Bread of Life Come From Heaven. He Who Believes In Me Has Eternal Life"},{"num":34,"verse":"So they said to Him, “Master, give us this bread always”. "},{"num":35,"verse":"Jesus said to them, “I am the bread of life. The one coming to Me will never hunger, and the one believing in Me will never ever thirst. "},{"num":36,"verse":"But I said to you that you have indeed seen Me, and you are not believing. "},{"num":37,"verse":"All that the Father gives to Me will come to Me, and I will never throw outside the one coming to Me. "},{"num":38,"verse":"Because I have come down from heaven not in order that I may be doing My will, but the will of the One having sent Me. "},{"num":39,"verse":"And this is the will of the One having sent Me: that as to all that He has given to Me, I will not lose anything from it, but I will raise it up on the last day. "},{"num":40,"verse":"For this is the will of My Father: that everyone seeing the Son and believing in Him may have eternal life, and I will raise him up on the last day”."},{"header":"I Am The Living Bread From Heaven: Eat And Live Forever. The Bread Is My Flesh"},{"num":41,"verse":"Then the Jews were grumbling about Him because He said, “I am the bread having come down from heaven”. "},{"num":42,"verse":"And they were saying, “Is this One not Jesus, the son of Joseph, whose father and mother we know? How does He now say that ‘I have come down from heaven’?” "},{"num":43,"verse":"Jesus responded and said to them, “Do not be grumbling with one another. "},{"num":44,"verse":"No one is able to come to Me unless the Father having sent Me draws him. And I will raise him up on the last day. "},{"num":45,"verse":"It has been written in the prophets [in Isa 54:13]: ‘and they shall all be taught ones of God’. Everyone having heard from the Father and having learned, comes to Me— "},{"num":46,"verse":"not that anyone has seen the Father, except the One being from God; this One has seen the Father. "},{"num":47,"verse":"Truly, truly, I say to you— the one believing has eternal life. "},{"num":48,"verse":"I am the bread of life. "},{"num":49,"verse":"Your fathers ate the manna in the wilderness and died. "},{"num":50,"verse":"This is the bread coming down from heaven in order that anyone may eat of it and not die. "},{"num":51,"verse":"I am the living bread having come down from heaven. If anyone eats of this bread, he will live forever. And indeed the bread which I will give for the life of the world is My flesh”."},{"header":"My Flesh Is True Food; My Blood Is True Drink. Partake And Live Forever"},{"num":52,"verse":"Then the Jews were fighting with one another, saying, “How can this One give us His flesh to eat?” "},{"num":53,"verse":"So Jesus said to them, “Truly, truly, I say to you, unless you eat the flesh of the Son of Man and drink His blood, you do not have life in yourselves. "},{"num":54,"verse":"The one eating My flesh and drinking My blood has eternal life, and I will raise him up on the last day. "},{"num":55,"verse":"For My flesh is true food, and My blood is true drink. "},{"num":56,"verse":"The one eating My flesh and drinking My blood abides in Me, and I in him. "},{"num":57,"verse":"Just as the living Father sent Me forth, and I live because of the Father, indeed the one eating Me— that one also will live because of Me. "},{"num":58,"verse":"This is the bread having come down from heaven; not as the manna the fathers ate and died. The one eating this bread will live forever”. "},{"num":59,"verse":"He said these things in a synagogue while teaching in Capernaum."},{"header":"These Words Are Spirit And Life. But Some of You Disciples Do Not Believe"},{"num":60,"verse":"Then many of His disciples, having heard, said, “This statement is hard. Who can hear it?” "},{"num":61,"verse":"But Jesus, knowing in Himself that His disciples are grumbling about this, said to them, “Does this offend you? "},{"num":62,"verse":"Then what if you see the Son of Man going up where He was formerly? "},{"num":63,"verse":"The Spirit is the One giving-life. The flesh profits nothing. The words which I have spoken to you are spirit, and are life. "},{"num":64,"verse":"But there are some of you who do not believe”. For Jesus knew from the beginning who the ones not believing were, and who the one who will hand Him over was. "},{"num":65,"verse":"And He was saying, “For this reason I have said to you that no one is able to come to Me unless it has been granted to him from the Father”."},{"header":"From This Time, Many of His Disciples No Longer Followed Him"},{"num":66,"verse":"From this time, many of His disciples went back, and were no longer walking with Him. "},{"num":67,"verse":"So Jesus said to the twelve, “You also are not wanting to go-away, are you?” "},{"num":68,"verse":"Simon Peter answered Him, “Lord, to whom shall we go? You have the words of eternal life. "},{"num":69,"verse":"And we have believed, and have come-to-know that You are the Holy One of God”. "},{"num":70,"verse":"Jesus answered them, “Did I not choose you, the twelve, and one of you is the devil?” "},{"num":71,"verse":"Now He was speaking-of Judas, son of Simon Iscariot. For this one, one of the twelve, was going to hand Him over."}]