[{"num":6,"verse":"After these things, Jesus went away to the other side of the sea of Galilee, which is also called the Sea of Tiberias. "},{"num":2,"verse":"A great multitude followed him, because they saw his signs which he did on those who were sick. "},{"num":3,"verse":"Jesus went up into the mountain, and he sat there with his disciples. "},{"num":4,"verse":"Now the Passover, the feast of the Jews, was at hand. "},{"num":5,"verse":"Jesus therefore lifting up his eyes, and seeing that a great multitude was coming to him, said to Philip, “Where are we to buy bread, that these may eat?” "},{"num":6,"verse":"He said this to test him, for he himself knew what he would do."},{"num":7,"verse":"Philip answered him, “Two hundred denarii worth of bread is not sufficient for them, that every one of them may receive a little.”"},{"num":8,"verse":"One of his disciples, Andrew, Simon Peter’s brother, said to him, "},{"num":9,"verse":"“There is a boy here who has five barley loaves and two fish, but what are these among so many?”"},{"num":10,"verse":"Jesus said, “Have the people sit down.” Now there was much grass in that place. So the men sat down, in number about five thousand. "},{"num":11,"verse":"Jesus took the loaves; and having given thanks, he distributed to the disciples, and the disciples to those who were sitting down; likewise also of the fish as much as they desired. "},{"num":12,"verse":"When they were filled, he said to his disciples, “Gather up the broken pieces which are left over, that nothing be lost.” "},{"num":13,"verse":"So they gathered them up, and filled twelve baskets with broken pieces from the five barley loaves, which were left over by those who had eaten. "},{"num":14,"verse":"When therefore the people saw the sign which Jesus did, they said, “This is truly the prophet who comes into the world.” "},{"num":15,"verse":"Jesus therefore, perceiving that they were about to come and take him by force to make him king, withdrew again to the mountain by himself."},{"num":16,"verse":"When evening came, his disciples went down to the sea. "},{"num":17,"verse":"They entered into the boat, and were going over the sea to Capernaum. It was now dark, and Jesus had not come to them. "},{"num":18,"verse":"The sea was tossed by a great wind blowing. "},{"num":19,"verse":"When therefore they had rowed about twenty-five or thirty stadia, they saw Jesus walking on the sea,See Job 9:8 and drawing near to the boat; and they were afraid. "},{"num":20,"verse":"But he said to them, “It is I. Don’t be afraid.” "},{"num":21,"verse":"They were willing therefore to receive him into the boat. Immediately the boat was at the land where they were going."},{"num":22,"verse":"On the next day, the multitude that stood on the other side of the sea saw that there was no other boat there, except the one in which his disciples had embarked, and that Jesus hadn’t entered with his disciples into the boat, but his disciples had gone away alone. "},{"num":23,"verse":"However boats from Tiberias came near to the place where they ate the bread after the Lord had given thanks. "},{"num":24,"verse":"When the multitude therefore saw that Jesus wasn’t there, nor his disciples, they themselves got into the boats, and came to Capernaum, seeking Jesus. "},{"num":25,"verse":"When they found him on the other side of the sea, they asked him, “Rabbi, when did you come here?”"},{"num":26,"verse":"Jesus answered them, “Most certainly I tell you, you seek me, not because you saw signs, but because you ate of the loaves, and were filled. "},{"num":27,"verse":"Don’t work for the food which perishes, but for the food which remains to eternal life, which the Son of Man will give to you. For God the Father has sealed him.”"},{"num":28,"verse":"They said therefore to him, “What must we do, that we may work the works of God?”"},{"num":29,"verse":"Jesus answered them, “This is the work of God, that you believe in him whom he has sent.”"},{"num":30,"verse":"They said therefore to him, “What then do you do for a sign, that we may see and believe you? What work do you do? "},{"num":31,"verse":"Our fathers ate the manna in the wilderness. As it is written, ‘He gave them bread out of heaven to eat.’”Exodus 16:4; Nehemiah 9:15; Psalm 78:24-25"},{"num":32,"verse":"Jesus therefore said to them, “Most certainly, I tell you, it wasn’t Moses who gave you the bread out of heaven, but my Father gives you the true bread out of heaven. "},{"num":33,"verse":"For the bread of God is that which comes down out of heaven, and gives life to the world.”"},{"num":34,"verse":"They said therefore to him, “Lord, always give us this bread.”"},{"num":35,"verse":"Jesus said to them, “I am the bread of life. Whoever comes to me will not be hungry, and whoever believes in me will never be thirsty. "},{"num":36,"verse":"But I told you that you have seen me, and yet you don’t believe. "},{"num":37,"verse":"All those whom the Father gives me will come to me. He who comes to me I will in no way throw out. "},{"num":38,"verse":"For I have come down from heaven, not to do my own will, but the will of him who sent me. "},{"num":39,"verse":"This is the will of my Father who sent me, that of all he has given to me I should lose nothing, but should raise him up at the last day. "},{"num":40,"verse":"This is the will of the one who sent me, that everyone who sees the Son, and believes in him, should have eternal life; and I will raise him up at the last day.”"},{"num":41,"verse":"The Jews therefore murmured concerning him, because he said, “I am the bread which came down out of heaven.” "},{"num":42,"verse":"They said, “Isn’t this Jesus, the son of Joseph, whose father and mother we know? How then does he say, ‘I have come down out of heaven?’”"},{"num":43,"verse":"Therefore Jesus answered them, “Don’t murmur among yourselves. "},{"num":44,"verse":"No one can come to me unless the Father who sent me draws him, and I will raise him up in the last day. "},{"num":45,"verse":"It is written in the prophets, ‘They will all be taught by God.’ Isaiah 54:13 Therefore everyone who hears from the Father and has learned, comes to me. "},{"num":46,"verse":"Not that anyone has seen the Father, except he who is from God. He has seen the Father. "},{"num":47,"verse":"Most certainly, I tell you, he who believes in me has eternal life. "},{"num":48,"verse":"I am the bread of life. "},{"num":49,"verse":"Your fathers ate the manna in the wilderness and they died. "},{"num":50,"verse":"This is the bread which comes down out of heaven, that anyone may eat of it and not die. "},{"num":51,"verse":"I am the living bread which came down out of heaven. If anyone eats of this bread, he will live forever. Yes, the bread which I will give for the life of the world is my flesh.”"},{"num":52,"verse":"The Jews therefore contended with one another, saying, “How can this man give us his flesh to eat?”"},{"num":53,"verse":"Jesus therefore said to them, “Most certainly I tell you, unless you eat the flesh of the Son of Man and drink his blood, you don’t have life in yourselves. "},{"num":54,"verse":"He who eats my flesh and drinks my blood has eternal life, and I will raise him up at the last day. "},{"num":55,"verse":"For my flesh is food indeed, and my blood is drink indeed. "},{"num":56,"verse":"He who eats my flesh and drinks my blood lives in me, and I in him. "},{"num":57,"verse":"As the living Father sent me, and I live because of the Father; so he who feeds on me, he will also live because of me. "},{"num":58,"verse":"This is the bread which came down out of heaven—not as our fathers ate the manna, and died. He who eats this bread will live forever.” "},{"num":59,"verse":"He said these things in the synagogue, as he taught in Capernaum."},{"num":60,"verse":"Therefore many of his disciples, when they heard this, said, “This is a hard saying! Who can listen to it?”"},{"num":61,"verse":"But Jesus knowing in himself that his disciples murmured at this, said to them, “Does this cause you to stumble? "},{"num":62,"verse":"Then what if you would see the Son of Man ascending to where he was before? "},{"num":63,"verse":"It is the spirit who gives life. The flesh profits nothing. The words that I speak to you are spirit, and are life. "},{"num":64,"verse":"But there are some of you who don’t believe.” For Jesus knew from the beginning who they were who didn’t believe, and who it was who would betray him. "},{"num":65,"verse":"He said, “For this cause I have said to you that no one can come to me, unless it is given to him by my Father.”"},{"num":66,"verse":"At this, many of his disciples went back, and walked no more with him. "},{"num":67,"verse":"Jesus said therefore to the twelve, “You don’t also want to go away, do you?”"},{"num":68,"verse":"Simon Peter answered him, “Lord, to whom would we go? You have the words of eternal life. "},{"num":69,"verse":"We have come to believe and know that you are the Christ, the Son of the living God.”"},{"num":70,"verse":"Jesus answered them, “Didn’t I choose you, the twelve, and one of you is a devil?” "},{"num":71,"verse":"Now he spoke of Judas, the son of Simon Iscariot, for it was he who would betray him, being one of the twelve."}]