[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To do justly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—God “setteth more by mercy than by sacrifice.” So also in Ecclesiastes: “Let us hear the conclusion of the whole matter. Fear God and keep His commandments, for this is the whole of man.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Micah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "GOD’S REQUIREMENTS AND GOD’S GIFTMicah 6:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "GOD’S REQUIREMENTS AND GOD’S GIFT",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is the Prophet’s answer to a question which he puts into the mouth of his hearers. They had the superstitious estimate of the worth of sacrifice, which conceives that the external offering is pleasing to God, and can satisfy for sin. Micah, like his great contemporary Isaiah, and the most of the prophets, wages war against that misconception of sacrifice, but does not thereby protest against its use. To suppose that he does so is to misunderstand his whole argument. Another misuse of the words of my text is by no means uncommon to-day. One has heard people say, ‘We are plain men; we do not understand your theological subtleties; we do not quite see what you mean by “Repentance toward God, and faith in Jesus Christ.” “To do justly, and to love mercy, and to walk humbly with my God,” that is my religion, and I leave all the rest to you.’ That is our religion too, but notice that word ‘require.’ It is a harsh word, and if it is the last word to be said about God’s relation to men, then a great shadow has fallen upon life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is another word which Micah but dimly caught uttered amidst the thunders of Sinai, and which you and I have heard far more clearly. The Prophet read off rightly God’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "requirements",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but he had not anything to say about God’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gifts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So his word is a half-truth, and the more clearly it is seen, and the more earnestly a man tries to live up to the standard of the requirements laid down here, the more will he feel that there is something else needed, and the more will he see that the great central peculiarity and glory of Christianity is not that it reiterates or alters God’s requirements, but that it brings into view God’s gifts. ‘To do justly, to love mercy, to walk humbly with our God,’ is possible only through repentance towards God, and faith in our Lord Jesus Christ. And if you suppose that these words of my text disclose the whole truth about God’s relation to men, and men’s to God, you have failed to apprehend the flaming centre of the Light that shines from heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. So, then, the first thing that I wish to suggest is God’s requirements. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. So, then, the first thing that I wish to suggest is God’s requirements.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, I do not need to say more than just a word or two about the summing-up in my text of the plain, elementary duties of morality and religion. It covers substantially the same ground, in a condensed form, as does the Decalogue, only that Moses began with the deepest thing and worked outwards, as it were; laying the foundation in a true relation to God, which is the most important, and from which will follow the true relation to men. Micah begins at the other end, and starting with the lesser, the more external, the purely human, works his way inwards to that which is the centre and the source of all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘To do justly,’ that is elementary morality in two words. Whatever a man has a right to claim from you, give him; that is the sum of duty. And yet not altogether so, for we all know the difference between a righteous man and a good man, and how, if there is only rigidly righteous action, there is something wanting to the very righteousness of the action and to the completeness of the character. ‘To do’ is not enough; we must get to the heart, and so ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mercy.’ Justice is not all. If each man gets his deserts, as Shakespeare says, ‘who of us shall scape whipping?’ There must be the mercy as well as the justice. In a very deep sense no man renders to his fellows all that his fellows have a right to expect of him, who does not render to them mercy. And so in a very deep sense, mercy is part of justice, and you have not given any poor creature all that that poor creature has a right to look for from you, unless you have given him all the gracious and gentle charities of heart and hand. Justice and mercy do, in the deepest view, run into one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then Micah goes deeper. ‘And to walk humbly with thy God.’ Some people would say that this summary of the divine requirements is defective, because there is nothing in it about a man’s duty to himself, which is as much a duty as his duty to his fellows, or his duty to God. But there is a good deal of my duty to myself crowded into that one word, ‘humbly.’ For I suppose we might almost say that the basis of all our obligations to our own selves lies in this, that we shall take the right view-that is, the lowly view-of ourselves. But I pass that.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘To walk humbly with thy God.’ ‘Can two walk together unless they be agreed?’ For walking with God there must be communion, based in love, and resulting in imitation. And that communion must be constant, and run through all the life, like a golden thread through some web. So, then, here is the minimum of the divine requirements, to give everybody what he has a right to, including the mercy to which he has a right, to have a lowly estimate of myself, and to live continually grasping the hand of God, and conscious of His overshadowing wing at all moments, and of conformity to His will at every step of the road. That is the minimum; and the people who so glibly say, ‘That is my religion,’ have little consciousness of how far-reaching and how deep-down-going the requirements of this text are. The requirements result from the very nature of God, and our relation to Him, and they are endorsed by our own consciences, for we all know that these, and nothing less than these are the duties that we owe to God. So much for God’s requirements.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Our failure. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Our failure.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is not one of us that has come up to the standard. Man after man may be conceived of as bringing in his hands the actions of his life, and laying them in the awful scales which God’s hand holds. In the one are God’s requirements, in the other my life; and in every case down goes the weight, and ‘weighed in the balances we are altogether lighter than vanity.’ We stand before the great Master in the school, and one by one we take up our copybooks; and there is not one of them that is not black with blots and erasures and swarming with errors. The great cliff stands in front of us with the victor’s prize on its topmost ledge, and man after man tries to climb, and falls bruised and broken at the base. ‘There is none righteous, no, not one.’ Micah’s requirements come to every man that will honestly take stock of his life and his character as the statement of an unreached and unreachable ideal to which he never has climbed nor ever can climb.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh, brethren! if these words are all the words that are to be said about God and me, then I know not what lies before the enlightened conscience except shuddering despair, and a paralysing consciousness of inevitable failure. I beseech you, take these words, and go apart with them, and test your daily life by them. God requires me to do justly. Does there not rise before my memory many an act in which, in regard to persons and in regard to circumstances, I have fallen beneath that requirement? He requires me ‘to love mercy.’ He requires me ‘to walk humbly,’ and I have often been inflated and self-conceited and presumptuous. He requires me to walk with Himself, and I have shaken away His hand from me, and passed whole days without ever thinking of Him, and ‘the God in whose hands’ my ‘breath is, and whose are all’ my ‘ways,’ I have ‘not glorified.’ I cannot hammer this truth into your consciences. You have to do it for yourselves. But I beseech you, recognise the fact that you are implicated in the universal failure, and that God’s requirement is God’s condemnation of each of us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If, then, that is true, that all have come short of the requirement, then there should follow a universal sense of guilt, for there is the universal fact of guilt, whether there be the sense of it or not. There must follow, too, consequences resulting from the failure of each of us to comply with these divine requirements, consequences very alarming, very fatal; and there must follow a darkening of the thought of God. ‘I knew thee that thou wert an austere man, reaping where thou didst not sow, and gathering where thou didst not straw.’ That is the God of all the people who take my text as the last word of their religion-God ‘requires of me. The blessed sun in the heavens becomes a lurid ball of fire when it is seen through the mist of such a conception of the divine character, and its relation to men. There is nothing that so drapes the sky in darkness, and hides out the great light of God, as the thought of His requirements as the last thought we cherish concerning Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There follows, too, upon this conception, and the failure that results to fulfil the requirements, a hopelessness as to ever accomplishing that which is demanded of us. Who amongst us is there that, looking back upon his past in so far as it has been shaped by his own effort and his own unaided strength, can look forward to a future with any hope that it will mend the past? Brethren! experience teaches us that we have not fulfilled, and cannot fulfil, what remains our plain duty, notwithstanding our inability to discharge it-viz., ‘To do justly, and to love mercy, and to walk humbly with our God.’ To think of God’s requirements, and of my own failure, is the sure way to paralyse all activity; just as that man in the parable who said, ‘Thou art an austere man,’ went away and hid his talent in the earth. To think of God’s requirements and my own failures, if heaven has nothing more to say to me than this stern ‘Thou shalt,’ is the short way to despair. And that is why most of us prefer to be immersed in the trivialities of daily life rather than to think of God, and of what He asks from us. For the only way by which some of us can keep our equanimity and our cheerfulness is by ignoring Him and forgetting what He demands, and never taking stock of our own lives.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, my text leads us to think of God’s gift. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, my text leads us to think of God’s gift.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I said it is a half-truth, for it only tells us of what He desires us to be, and does not tell us of how we may be it. It is meant, like the law of which it is a condensation, to be the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pedagogue",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to lead the child to Jesus Christ, the true Master, and the true Gift of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God ‘requires.’ Yes, and He requires, in order that we should say to Him, ‘Lord, Thou hast a right to ask this, and it is my blessedness to give it, but I cannot. Do Thou give me what Thou dost require, and then I can.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The gift of God is Jesus Christ, and that gift meets all our failures. I have spoken of the sense of guilt that rises from the consciousness of failure to keep the requirements of the divine law; and the gift of God deals with that. It comes to us as we lie wounded, bruised, conscious of failure, alarmed for results, sensible of guilt, and dreading the penalties, and it says to us, ‘Thine iniquity is taken away, and thy sin purged.’ ‘God requires of thee what thou hast not done. Trust yourselves to Me, and all iniquity is passed from your souls.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I spoke of the hopelessness of future performance, which results from experience of past failures; and the gift of God deals with that. You cannot meet the requirements. Christ will put His Spirit into your spirits, if you will trust yourselves to Him, and then you will meet them, for the things which are impossible with men are possible with God. So, if led by Micah, we pass from God’s requirements to His gifts, look at the change in the aspect which God bears to us. He is no longer standing strict to mark, and stern to judge and condemn: but bending down graciously to help. His last word to us is not ‘Thou shalt do’ but ‘I will give.’ His utterance in the Gospel is not ‘do,’ but it is ‘take’; and the vision of God, which shines out upon us from the life and from the Cross of Jesus Christ, is not that of a great Taskmaster, but that of Him who helps all our weakness, and makes it strength. A God who ‘requires’ paralyses men, shuts men out from hope and joy and fellowship; a God who gives draws men to His heart, and makes them diligent in fulfilling all His blessed requirements.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Think of the difference which the conception of God as giving makes to the spirit in which we work. No longer, like the Israelites in Egypt, do we try to make bricks without straw, and break our hearts over our failures, or desperately abandon the attempt, and live in neglect of God and His will; but joyfully, with the clear confidence that ‘our labour is not in vain in the Lord,’ we seek to keep the commandments which we have learned to be the expressions of His love. One of the Fathers puts all in one lovely sentence: ‘Give what Thou commandest, and command what Thou wilt.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Think, too, of the difference which this conception of the giving rather than of the requiring God brings into what we have to do. We have not to begin with effort, we have to begin with faith. The fountain must be filled from the spring before it can send up its crystal pillar flashing in the sunlight; and we must receive by our trust the power to will and to do. First fill the lamp with oil, and let the Master light it, and then let its blaze beam forth. First, we have to go to the giving God, with thanks ‘unto Him for His unspeakable gift’; and then we have to say to Him, ‘Thou hast given me Thy Son. What dost Thou desire that I shall give to Thee?’ We have first to accept the gift, and then, moved by the mercy of God, to ask, ‘Lord I what wilt Thou have me to do?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 6:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath showed thee, O man, what is good — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He hath showed thee that there is no forgiveness without repentance, and that repentance is but a name, unless there be a ceasing to do evil, and learning to do well: and that this implies the practice of every branch of piety and virtue; the performance of every duty that we owe to God, our neighbour, and ourselves; 1st, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To do justly — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To render to all their dues, to superiors, equals, inferiors; to be true and just to all, and to oppress none, in their persons, property, or reputation; in our dealings with others to carry a chancery in our own breasts, and to act according to equity. 2d, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To love mercy — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not to use severity, or exercise malice, envy, revenge, enmity, or hatred toward any, but to be compassionate, merciful, forgiving, kind, and beneficent toward all, according to our ability. And, 3d, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To walk humbly with thy God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To humble thyself before the holy and just God, under a deep sense of thy past guilt and present unworthiness, renouncing all high thoughts of thyself, and all dependance on thy own righteousness for justification before him, but relying solely on his mercy, through the Mediator. The words imply, too, that we should keep up constant communion with God, by the exercise of an humble, holy, loving, and obedient faith, serving the Lord, as the apostle says of himself, in all humility of mind, and with continual reverence and godly fear. “See here the true spirit of the divine law! See here what makes a true Israelite! a truth which the carnal Jews could never comprehend: in vain did their legislator and their prophets inculcate it upon every occasion. They always had recourse to their gross conceptions, their attachment to sacrifices, and merely external services: herein they imagined their perfection to consist; while they neglected the more essential duties of man, and the practice of the most solid virtues, justice, benevolence, and piety.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:6-8 These verses seem to contain the substance of Balak's consultation with Balaam how to obtain the favour of Israel's God. Deep conviction of guilt and wrath will put men upon careful inquiries after peace and pardon, and then there begins to be some ground for hope of them. In order to God's being pleased with us, our care must be for an interest in the atonement of Christ, and that the sin by which we displease him may be taken away. What will be a satisfaction to God's justice? In whose name must we come, as we have nothing to plead as our own? In what righteousness shall we appear before him? The proposals betray ignorance, though they show zeal. They offer that which is very rich and costly. Those who are fully convinced of sin, and of their misery and danger by reason of it, would give all the world, if they had it, for peace and pardon. Yet they do not offer aright. The sacrifices had value from their reference to Christ; it was impossible that the blood of bulls and goats should take away sin. And all proposals of peace, except those according to the gospel, are absurd. They could not answer the demands of Divine justice, nor satisfy the wrong done to the honour of God by sin, nor would they serve at all in place of holiness of the heart and reformation of the life. Men will part with any thing rather than their sins; but they part with nothing so as to be accepted of God, unless they do part with their sins. Moral duties are commanded because they are good for man. In keeping God's commandments there is a great reward, as well as after keeping them. God has not only made it known, but made it plain. The good which God requires of us is, not the paying a price for the pardon of sin and acceptance with God, but love to himself; and what is there unreasonable, or hard, in this? Every thought within us must be brought down, to be brought into obedience to God, if we would walk comfortably with him. We must do this as penitent sinners, in dependence on the Redeemer and his atonement. Blessed be the Lord that he is ever ready to give his grace to the humble, waiting penitent.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath shewed thee - Micah does not tell them now, as for the first time; which would have excused them. He says, \"He hath shewed thee;\" He, about whose mind and will and pleasure they were pretending to enquire, the Lord their God. He had shewn it to them. The law was full of it. He shewed it to them, when He said, \"And now, Israel, what doth the Lord thy God require of thee, but to fear the Lord thy God, to walk in all His ways, and to love Him and to serve the Lord, thy God with all thy heart and with all thy soul, to keep the commandments of the Lord and His statutes which I command thee this day for thy good?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They had asked, \"with what outward thing shall I come before the Lord;\" the prophet tells them, \"what thing is good,\" the inward man of the heart, righteousness, love, humility.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And what doth the Lord require (search, seek) of thee? - The very word implies an earnest search within. He would say (Rup.), \"Trouble not thyself as to any of these things, burnt-offerings, rams, calves, without thee. For God seeketh not thine, but thee; not thy substance, but thy spirit; not ram or goat, but thy heart.\" : \"Thou askest, what thou shouldest offer for thee? Other thyself. For what else doth the Lord seek of thee, but thee? Because, of all earthly creatures, He hath made nothing better than thee, He seeketh thyself from thyself, because thou hadst lost thyself.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To do judgment - are chiefly all acts of equity; \"to love mercy,\" all deeds of love. Judgment, is what right requires; mercy, what love. Yet, secondarily, \"to do judgment\" is to pass righteous judgments in all cases; and so, as to others, \"judge not according to the appearance, but judge righteous judgment\" John 7:24; and as to one's self also. Judge equitably and kindly of others, humbly of thyself. : \"Judge of thyself in thyself without acceptance of thine own person, so as not to spare thy sins, nor take pleasure in them, because thou hast done them. Neither praise thyself in what is good in thee, nor accuse God in what is evil in thee. For this is wrong judgment, and so, not judgment at all. This thou didst, being evil; reverse it, and it will be right. Praise God in what is good in thee; accuse thyself in what is evil. So shalt thou anticipate the judgment of God, as He saith, \"If we would judge ourselves, we should not be judged of the Lord\" 1 Corinthians 11:31. He addeth, love mercy; being merciful, out of love, \"not of necessity, for God loveth a cheerful giver\" 2 Corinthians 9:7. These acts together contain the whole duty to man, corresponding with and formed upon the mercy and justice of God Psalm 101:1; Psalm 61:7. All which is due, anyhow or in any way, is of judgment; all which is free toward man, although not free toward God, is of mercy. There remains, walk humbly with thy God; not, bow thyself only before Him, as they had offered Micah 6:6, nor again walk with Him only, as did Enoch, Noah Abraham, Job; but walk humbly (literally, bow down the going) yet still with thy God; never lifting up thyself, never sleeping, never standing still, but ever walking on, yet ever casting thyself down; and the more thou goest on in grace, the more cast thyself down; as our Lord saith, \"When ye have done all these things which are commanded you, say, We are unprofitable servants; we have done that which was our duty to do\" Luke 17:10.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To do judgment - are chiefly all acts of equity; \"to love mercy,\" all deeds of love. Judgment, is what right requires; mercy, what love. Yet, secondarily, \"to do judgment\" is to pass righteous judgments in all cases; and so, as to others, \"judge not according to the appearance, but judge righteous judgment\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 7:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and as to one's self also. Judge equitably and kindly of others, humbly of thyself. : \"Judge of thyself in thyself without acceptance of thine own person, so as not to spare thy sins, nor take pleasure in them, because thou hast done them. Neither praise thyself in what is good in thee, nor accuse God in what is evil in thee. For this is wrong judgment, and so, not judgment at all. This thou didst, being evil; reverse it, and it will be right. Praise God in what is good in thee; accuse thyself in what is evil. So shalt thou anticipate the judgment of God, as He saith, \"If we would judge ourselves, we should not be judged of the Lord\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 11:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He addeth, love mercy; being merciful, out of love, \"not of necessity, for God loveth a cheerful giver\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". These acts together contain the whole duty to man, corresponding with and formed upon the mercy and justice of God ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 101:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 61:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". All which is due, anyhow or in any way, is of judgment; all which is free toward man, although not free toward God, is of mercy. There remains, walk humbly with thy God; not, bow thyself only before Him, as they had offered ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", nor again walk with Him only, as did Enoch, Noah Abraham, Job; but walk humbly (literally, bow down the going) yet still with thy God; never lifting up thyself, never sleeping, never standing still, but ever walking on, yet ever casting thyself down; and the more thou goest on in grace, the more cast thyself down; as our Lord saith, \"When ye have done all these things which are commanded you, say, We are unprofitable servants; we have done that which was our duty to do\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It is not a \"crouching before God\" displeased, (such as they had thought of,) but the humble love of the forgiven; \"walk humbly,\" as the creature with the Creator, but in love, with thine own God. Humble thyself with God, who humbled himself in the flesh: walk on with Him, who is thy Way. Neither humility nor obedience alone would be true graces; but to cleave fast to God, because He is thine All, and to bow thyself down, because thou art nothing, and thine All is He and of Him. It is altogether a Gospel-precept; bidding us, \"Be ye perfect, as your Father which is in Heaven is perfect\" Matthew 5:48; \"Be merciful, as your Father also is merciful;\" Luke 6:36; and yet, in the end, have \"that same mind which was also in Christ Jesus, who made Himself of no reputation\" Philippians 2:5, Philippians 2:7, Philippians 2:9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is not a \"crouching before God\" displeased, (such as they had thought of,) but the humble love of the forgiven; \"walk humbly,\" as the creature with the Creator, but in love, with thine own God. Humble thyself with God, who humbled himself in the flesh: walk on with Him, who is thy Way. Neither humility nor obedience alone would be true graces; but to cleave fast to God, because He is thine All, and to bow thyself down, because thou art nothing, and thine All is He and of Him. It is altogether a Gospel-precept; bidding us, \"Be ye perfect, as your Father which is in Heaven is perfect\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"Be merciful, as your Father also is merciful;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 6:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and yet, in the end, have \"that same mind which was also in Christ Jesus, who made Himself of no reputation\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The offers of the people, stated in the bare nakedness in which Micah exhibits them, have a character of irony. But it is the irony of the truth and of the fact itself. The creature has nothing of its own to offer; \"the blood of bulls and goats cannot take away sin\" Hebrews 10:4; and the offerings, as they rise in value, become, not useless only but, sinful. Such offerings would bring down anger, not mercy. Micah's words then are, for their vividness, an almost proverbial expression of the nothingness of all which we sinners could offer to God. : \"We, who are of the people of God, knowing that \"in His sight shall no man living be justified\" Psalm 143:2, and saying, \"I am a beast with Thee\" Psalm 73:22, trust in no pleas before His judgment-seat, but pray; yet we put no trust in our very prayers. For there is nothing worthy to be offered to God for sin, and no humility can wash away the stains of offences.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The offers of the people, stated in the bare nakedness in which Micah exhibits them, have a character of irony. But it is the irony of the truth and of the fact itself. The creature has nothing of its own to offer; \"the blood of bulls and goats cannot take away sin\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the offerings, as they rise in value, become, not useless only but, sinful. Such offerings would bring down anger, not mercy. Micah's words then are, for their vividness, an almost proverbial expression of the nothingness of all which we sinners could offer to God. : \"We, who are of the people of God, knowing that \"in His sight shall no man living be justified\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and saying, \"I am a beast with Thee\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", trust in no pleas before His judgment-seat, but pray; yet we put no trust in our very prayers. For there is nothing worthy to be offered to God for sin, and no humility can wash away the stains of offences.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In penitence for our sins, we hesitate and say, Wherewith shall I come before the Lord? how shall I come, so as to be admitted into familiar intercourse with my God? One and the same spirit revolveth these things in each of us or of those before us, who have been pricked to repentance, 'what worthy offering can I make to the Lord?' This and the like we revolve, as the Apostle saith; \"We know not what to pray for as we ought; but the Spirit itself maketh intercession for us with groanings which cannot be uttered\" Romans 8:20. \"Should I offer myself wholly as a burnt-offering to Him?' If, understanding spiritually all the Levitical sacrifices, I should present them in myself, and offer my first-born, that is, what is chief in me, my soul, I should find nothing worthy of His greatness. Neither in ourselves, nor in ought earthtly, can we find anything worthy to be offered to reconcile us with God. For the sin of the soul, blood alone is worthy to be offered; not the blood of calves, or rams, or goats, but our own; yet our own too is not offered, but given back, being due already Psalm 116:8. The Blood of Christ alone sufficeth to do away all sin.\" Dionysius: \"The whole is said, in order to instruct us, that, without the shedding of the Blood of Christ and its Virtue and Merits, we cannot please God, though we offered ourselves and all that we have, within and without; and also, that so great are the benefits bestowed upon us by the love of Christ, that we can repay nothing of them.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In penitence for our sins, we hesitate and say, Wherewith shall I come before the Lord? how shall I come, so as to be admitted into familiar intercourse with my God? One and the same spirit revolveth these things in each of us or of those before us, who have been pricked to repentance, 'what worthy offering can I make to the Lord?' This and the like we revolve, as the Apostle saith; \"We know not what to pray for as we ought; but the Spirit itself maketh intercession for us with groanings which cannot be uttered\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Should I offer myself wholly as a burnt-offering to Him?' If, understanding spiritually all the Levitical sacrifices, I should present them in myself, and offer my first-born, that is, what is chief in me, my soul, I should find nothing worthy of His greatness. Neither in ourselves, nor in ought earthtly, can we find anything worthy to be offered to reconcile us with God. For the sin of the soul, blood alone is worthy to be offered; not the blood of calves, or rams, or goats, but our own; yet our own too is not offered, but given back, being due already ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Blood of Christ alone sufficeth to do away all sin.\" Dionysius: \"The whole is said, in order to instruct us, that, without the shedding of the Blood of Christ and its Virtue and Merits, we cannot please God, though we offered ourselves and all that we have, within and without; and also, that so great are the benefits bestowed upon us by the love of Christ, that we can repay nothing of them.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But then it is clear that there is no teaching in this passage in Micah which there is not in the law . The developments in the prophets relate to the Person and character of the Redeemer. The law too contained both elements:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) the ritual of sacrifice, impressing on the Jew the need of an Atoner;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) the moral law, and the graces inculcated in it, obedience, love of God and man, justice, mercy, humility, and the rest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There was no hint in the law, that half was acceptable to God instead of the whole; that sacrifice of animals would supersede self-sacrifice or obedience. There was nothing on which the Pharisee could base his heresy. What Micah said, Moses had said. The corrupt of the people offered a half-service, what cost them least, as faith without love always does. Micah, in this, reveals to them nothing new; but tells them that this half-service is contrary to the first principles of their law. \"He bath shewed thee, O man, what is good.\" Sacrifice, without love of God and man, was not even so much as the body without the soul. It was an abortion, a monster. For one end of sacrifice was to inculcate the insufficiency of all our good, apart from the Blood of Christ; that, do what we would, \"all came short of the glory of God\" Romans 3:23. But to substitute sacrifice, which was a confession that at best we were miserable sinners, unable, of ourselves, to please God, for any efforts to please Him or to avoid displeasing Him, would be a direct contradiction of the law, antinomianism under the dispensation of the law itself.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There was no hint in the law, that half was acceptable to God instead of the whole; that sacrifice of animals would supersede self-sacrifice or obedience. There was nothing on which the Pharisee could base his heresy. What Micah said, Moses had said. The corrupt of the people offered a half-service, what cost them least, as faith without love always does. Micah, in this, reveals to them nothing new; but tells them that this half-service is contrary to the first principles of their law. \"He bath shewed thee, O man, what is good.\" Sacrifice, without love of God and man, was not even so much as the body without the soul. It was an abortion, a monster. For one end of sacrifice was to inculcate the insufficiency of all our good, apart from the Blood of Christ; that, do what we would, \"all came short of the glory of God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But to substitute sacrifice, which was a confession that at best we were miserable sinners, unable, of ourselves, to please God, for any efforts to please Him or to avoid displeasing Him, would be a direct contradiction of the law, antinomianism under the dispensation of the law itself.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Micah changes the words of Moses, in order to adapt them to the crying sins of Israel at that time. He then upbraids them in detail, and that, with those sins which were patent, which, when brought home to them, they could not deny, the sins against their neighbor. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Micah changes the words of Moses, in order to adapt them to the crying sins of Israel at that time. He then upbraids them in detail, and that, with those sins which were patent, which, when brought home to them, they could not deny, the sins against their neighbor. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. He—Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hath showed thee—long ago, so that thou needest not ask the question as if thou hadst never heard (Mic 6:6; compare De 10:12; 30:11-14).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "what is good—\"the good things to come\" under Messiah, of which \"the law had the shadow.\" The Mosaic sacrifices were but suggestive foreshadowings of His better sacrifice (Heb 9:23; 10:1). To have this \"good\" first \"showed,\" or revealed by the Spirit, is the only basis for the superstructure of the moral requirements which follow. Thus the way was prepared for the Gospel. The banishment of the Jews from Palestine is designed to preclude the possibility of their looking to the Mosaic rites for redemption, and shuts them up to Messiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "justly … mercy—preferred by God to sacrifices. For the latter being positive ordinances, are only means designed with a view to the former, which being moral duties are the ends, and of everlasting obligation (1Sa 15:22; Ho 6:6; 12:6; Am 5:22, 24). Two duties towards man are specified—justice, or strict equity; and mercy, or a kindly abatement of what we might justly demand, and a hearty desire to do good to others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to walk humbly with thy God—passive and active obedience towards God. The three moral duties here are summed up by our Lord (Mt 23:23), \"judgment, mercy, and faith\" (in Lu 11:42, \"the love of God\"). Compare Jas 1:27. To walk with God implies constant prayer and watchfulness, familiar yet \"humble\" converse with God (Ge 5:24; 17:1).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The prophet answers the inquiry made ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 6:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " otherwise than these inquirers did expect: You who make this inquiry might have spared this pains. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God himself, hath already plainly enough told you this. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " O Jews, every one of you, might from the law of God know what would please your God, and with what you ought to come before him; you might have read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 15:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 15:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that he delighteth in your obeying his word; and more early, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 10:12 13,20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 13,20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". the same practical rule was laid down. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What is good",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in itself for you, and well-pleasing to your God; from his own mouth your holy and righteous fathers did know, and so might you, what is that good with which you should appear before God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What doth the Lord require of thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what so much? or what without? or doth he require any thing without? It is a question that must be resolved in a negative, comparative, or absolute; the Lord doth not require sacrifice without moral duties, nor doth he require sacrifice so much as such duties after mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To do justly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to render to every one what is their due, superiors, equals, inferiors, to be equal to all, and oppress none, in body, goods, or name; in all your dealings with men carry a chancery in your own breasts, and do according to equity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To love mercy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be kind, merciful, and compassionate towards all that need your kindness, do not use severity towards any; though the laws of man did not require you to remit of your pretences, and if you exacted all your right you did not break the laws of men, yet you should have respect to the law of love, and show mercy with delight in showing it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 12:8 2 Corinthians 9:7 Hebrews 13:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To walk humbly with thy God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in all duties which immediately refer to the precepts of the first table, in all religious exercise and deportment toward God, keep the heart sincerely humble toward God; think highly of him, his laws and determinations, murmur not against the final determinations God by his providence makes, complain not of any of his precepts; know and own it, thou art an unprofitable servant if thou hast done all, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 17:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 17:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath showed me, O man, what is good,.... This is not the answer of the prophet to the body of the people, or to any and every one of the people of Israel; but of Balaam to Balak, a single man, that consulted with him, and put questions to him; particularly what he should do to please the Lord, and what righteousness he required of him, that would be acceptable to him; and though he was a king, he was but a man, and he would have him know it that he was no more, and as such addresses him; and especially when he is informing him of his duty to God; which lay not in such things as he had proposed, but in doing that which was good, and avoiding that which was evil, in a moral sense: and this the Lord had shown him by the light of nature; which is no other than the work of the law of God written in the hearts of the Heathens, by which they are directed to do the good commanded in the law, and to shun the evil forbidden by it; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and what doth the Lord require of thee but to do justly; or \"judgment\" (e); to exercise public judgment and justice, as a king, among his subjects; to do private and personal justice between man and man; to hurt no man's person, property, and character; to give to everyone their due, and do as he would desire to be done by; which as it is agreeable to the law of God, so to the light of nature, and what is shown, required, and taught by it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to love mercy; not only to show mercy to miserable objects, to persons in distress; to relieve the poor and indigent; to clothe the naked, and feed the hungry; but to delight in such exercises; and which a king especially should do, whose throne is established by mercy, and who is able, and should be munificent; and some Heathen princes, by their liberality, have gained the name of benefactors, \"Euergetes\", as one of the Ptolemies did; see Luke 22:25; such advice Daniel gave to Nebuchadnezzar, a Heathen prince, as agreeable to the light of nature; see Daniel 4:27; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and to love mercy; not only to show mercy to miserable objects, to persons in distress; to relieve the poor and indigent; to clothe the naked, and feed the hungry; but to delight in such exercises; and which a king especially should do, whose throne is established by mercy, and who is able, and should be munificent; and some Heathen princes, by their liberality, have gained the name of benefactors, \"Euergetes\", as one of the Ptolemies did; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; such advice Daniel gave to Nebuchadnezzar, a Heathen prince, as agreeable to the light of nature; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and to walk humbly with thy God? his Creator and Benefactor, from whom he had his being, and all the blessings of life, and was dependent upon him; and therefore, as a creature, should behave with humility towards his Creator, acknowledging his distance from him, and the obligations he lay under to him; and even though a king, yet his God and Creator was above him, King of kings, and Lord of lords, to whom he owed his crown, sceptre, and kingdom, and was accountable to him for all his administrations: and this \"walking humbly\" is opposed to \"walking in pride\", which kings are apt to do; but God can humble them, and bring them low, as Heathen kings have been obliged to own; see Daniel 2:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and to walk humbly with thy God? his Creator and Benefactor, from whom he had his being, and all the blessings of life, and was dependent upon him; and therefore, as a creature, should behave with humility towards his Creator, acknowledging his distance from him, and the obligations he lay under to him; and even though a king, yet his God and Creator was above him, King of kings, and Lord of lords, to whom he owed his crown, sceptre, and kingdom, and was accountable to him for all his administrations: and this \"walking humbly\" is opposed to \"walking in pride\", which kings are apt to do; but God can humble them, and bring them low, as Heathen kings have been obliged to own; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) \"judicium\", V. L. Munster; \"jus\", Junius & Tremellius, Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) \"judicium\", V. L. Munster; \"jus\", Junius & Tremellius, Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He hath shewed thee, O man, what is good; and what doth the LORD require of thee, {g} but to do justly, and to love mercy, and to walk humbly with thy God?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He hath shewed thee, O man, what ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " good; and what doth the LORD require of thee, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but to do justly, and to love mercy, and to walk humbly with thy God?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) The Prophet in few words calls them to the observation of the second table of the ten commandments, to know if they will obey God correctly or not, saying that God has commanded them to do this.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet denies that any external forms will make up for the want of spiritual qualities. The sacrifice of the heart is what God demands; but “man convinced of sin is ready to sacrifice what is dearest to him rather than give up his own will and give himself to God” (W. Robertson Smith). The passage reminds us of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:10-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Evidently Hezekiah’s reformation had been purely external (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath shewed thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] viz. Moses in the Law, especially in Deuteronomy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what doth the Lord require of thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …] Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘And now, Israel, what doth the Lord thy God require of thee, but to fear the Lord thy God, to walk in all his ways, and to love him, and to serve the Lord thy God with all thy heart and with all thy soul?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to do justly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …] The opposite of Israel’s present characteristics (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Micah 6:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to walk humbly with thy God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Humility is the primary religious virtue in the Old Testament (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The prophet answers in his own person the questions in vers. 6 and 7, by showing the worthlessness of outward observances when the moral precepts and not observed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath showed thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "one has told thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "it has been told thee, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by Moses and in the Law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Αἰ ἀνηγγέλη σοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\"Hath it not been told thee?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "What doth the Lord require of thee?",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "What doth the Lord require of thee?",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The prophets often enforce the truth that the principles of righteous conduct are required from men, and not mere formal worship. This might well be a comfort to the Israelites when they heard that they were doomed to be cast out of their country, and that the temple was to be destroyed, and that the ritual on which they laid such stress would for a time become impracticable. So the inculcation of moral virtues is often connected with the prediction of woe or captivity. (For the prophetic view of the paramount importance of righteousness, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.: 1. 8, etc.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:11-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; see on Zechariah 7:7.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To do justly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " To act equitably, to hurt nobody by word or deed, which was the exact contrary of the conduct previously mentioned (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:1, 2, 8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To love mercy.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " To be guided in conduct to others by loving kindness. These two rules contain the whole duty to the neighbour. Compare Christ's description of genuine religion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To walk humbly with thy God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This precept comprises man's duty to God, humility and obedience. \"To walk\" is an expression implying \"to live and act\" as the patriarchs are said to have \"walked with God,\" denoting that they lived as consciously under his eye and referred all their actions to him. Humility is greatly enforced in the Scriptures (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἕτοιμον εϊναι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τοῦ πορεύεσθαι μετὰ Κυρίου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"to be ready to walk with the Lord;\" Vulgate, S",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "olicitum ambulare",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "cum Deo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Syriac, \"Be prepared to follow thy God.\" But our version is doubtless correct. Micah 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prophet therefore proceeds in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to overthrow these outward means of reconciliation with God, and reminds the people of the moral demands of the law. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"They have told thee, O man, what is good, and what Jehovah requires of thee, simply to do right, and love good, and walk humbly with thy God.\" הגּיד, impersonal, \"one has told,\" or they have told thee, namely Moses in the law. The opinion that Jehovah should be supplied as the subject is a very improbable one, for the simple reason that Jehovah is expressly mentioned in the second dependent clause. The use of כּי אם, nisi, as in the similar connection of thought in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", may be accounted for from the retrospective allusion to the gifts mentioned by the people: not outward sacrifices of any kind, but only the fulfilment of three following duties: namely, above all things, doing righteousness and exercising love. These two embrace all the commandments of the second table, of whose fulfilment Israel thought so little, that it was addicted to the very opposite, - namely, injustice, oppression, and want of affection (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.). There is also a third: humble walk with God, i.e., in fellowship with God, as Israel, being a holy priestly nation, ought to walk. Without these moral virtues, sacrificial worship was a spiritless opus operatum, in which God had no pleasure (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]