[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord God . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A new section begins in the form of an abruptly introduced soliloquy. As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the speaker is the Servant of Jehovah, not Isaiah, though we may legitimately trace in what follows some echoes of the prophet’s own experience. The union of the two names Adonai Jahveh (or Jehovah) indicates, as elsewhere, a special solemnity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The tongue of the learned.—Better, of a disciple, or, well-trained scholar.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The tongue of the learned.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "of a disciple, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or, well-trained scholar.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "That I should know how to speak.—Better, that I should know how to sustain (or, refresh) the weary with a word.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "That I should know how to speak.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "that I should know how to sustain ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "refresh",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": " the weary with a word.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He wakeneth.—The daily teaching of the morning communion with God is contrasted by implication with the dreams and night visions of a less perfect inspiration. An illustration, perhaps a conscious fulfilment, may be found in Mark 1:35; Luke 4:42.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "He wakeneth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The daily teaching of the morning communion with God is contrasted by implication with the dreams and night visions of a less perfect inspiration. An illustration, perhaps a conscious fulfilment, may be found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 1:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 4:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To hear as the learned.—Read disciples, as before. The true Servant is also as a scholar, studious of the Master’s will, as are other scholars.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "To hear as the learned.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Read ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "disciples, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as before. The true Servant is also as a scholar, studious of the Master’s will, as are other scholars.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SERVANT’S WORDS TO THE WEARYIsaiah 50:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SERVANT’S WORDS TO THE WEARY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the beginning of the continuous section of which these verses are part, a transition is made from Israel as collectively the ideal servant of the Lord, to a personal Servant, whose office it is ‘to bring Jacob again to Him.’ We see the ideal in the very act of passing to its highest form, and that in which it is finally fulfilled in history, namely, by the person Jesus. That Jesus was ‘Thy Holy Servant’ was the earliest gospel preached by Peter and John before people and rulers. It is not the most vital conception of our Lord’s nature and work. The prophet does not here pierce to the core, as in his fifty-third chapter with its vision of the Suffering Servant, but this is prelude to that, and the office assigned here to the Servant cannot be fully discharged without that ascribed to Him there, as the prophet begins to discern almost immediately. The text gives us a striking view of the purpose of Messiah’s mission and of His training and preparation for it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The purpose of Christ’s mission. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The purpose of Christ’s mission.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is a remarkable contrast between the stately prelude to the section of the prophecy in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the ideal in this text. There the Servant calls the isles and the distant peoples to listen, and declares that His mouth is ‘like a sharp sword’; here all that is keen and smiting in His word has softened into gentle whispers of comfort to sustain the weary.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A mission addressed to ‘the weary’ is addressed to every man, for who is not ‘weighed upon with sore distress,’ or loaded with the burden and the weight of tasks beyond his power or distasteful to his inclinations, or monotonous to nausea, or prolonged to exhaustion, or toiled at with little hope and less interest? Who is not weary of himself and of his load? What but universal weariness does the universal secret desire for rest betray? We are all ‘pilgrims weary of time,’ and some of us are weary of even prosperity, and some of us are worn out with work, and some of us buffeted to all but exhaustion by sorrow, and all of us long for rest, though many of us do not know where to look for it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Jesus may have had this word in mind, when He called to Him all them ‘that labour and are heavy laden.’ At all events, the prophet’s ideal and the evangelists’ story accurately correspond. Christ’s words have other characteristics, but are eminently words that sustain the weary and comfort the down-hearted. Who can ever calculate the new strength poured by them into fainting hearts and languid hands, the all but dead hopes that they have reanimated, the sorrows they have comforted, the wounds they have stanched?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What a lesson here as to the noblest use of high endowments! What a contrast to the use that so many of those to whom God has given ‘the tongue of them that are taught’ make of their great gifts! Literature yields but few examples of great writers who have faithfully employed their powers for that purpose, which seems so humble and is so lofty, the help of the weary, the comfort of the sad. Many pages in famous books would be cancelled if all that had been written without consideration for these classes were obliterated, as it will be one day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But Christ not only speaks by outward words, but has other ways of lodging sustenance and comfort in souls than by vocables audible to the ear or visible to the eye on the page. ‘The words that I speak unto you, they are spirit and they are life.’ He spoke by His deeds on earth, and in one and the same set of facts, He ‘began to do and to teach,’ the doing being named first. He ‘now speaketh from Heaven’ by many an inward whisper, by the communication of His own Spirit, on Whom this very office of ministering sustenance and comfort is laid, and whose very name of the Comforter means One who by his being with a man strengthens him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The training and preparation of the Messiah for His mission. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The training and preparation of the Messiah for His mission.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Messiah is here represented as having the tongue of ‘them that are taught,’ and as having it, because morning by morning He has been wakened to hear God’s lessons. He is thus God’s scholar-a thought of which an unreflecting orthodoxy has been shy, but which it is necessary to admit unhesitatingly and ungrudgingly, if we would not reduce the manhood of Jesus to a mere phantasm. He Himself has said, ‘As the Father taught Me, I speak these things.’ With emphatic repetition, He was continually making that assertion, as, for instance, ‘I have not spoken of Myself, but the Father which sent Me, He gave Me a commandment what I should say, and what I should speak . . . the things therefore which I speak, even as the Father hath said unto Me, so I speak.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Gospels tell us of the prayers of Jesus, and of rare occasions in which a voice from heaven spoke to Him. But while these are palpable instances of His communion with God, and precious tokens of His true brotherhood with us in the indispensable characteristics of the life of faith, they are but the salient points on which the light falls, and behind them, all unknown by us, stretches an unbroken chain of like acts of fellowship. In that subordination as of a scholar to teacher, both His divine and His human nature concurred, the former in filial submission, the latter in continual, truly human derivation and reception. The man Jesus was taught and, like the boy Jesus, ‘increased in wisdom.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But while He learned as truly as we learn from God, and exercised the same communion with the Father, the same submission to Him, which other men have to exercise, and called ‘us brethren, saying, I will put my trust in Him,’ the difference in degree between His close fellowship with God the Father, and our broken and always partial fellowship, between His completeness of reception of God’s words and our imperfect comprehension, between His perfect reproduction of the words He had heard and our faint, and often mistaken echo of them, is so immense as to amount to a difference in kind. His unity of will and being with the Father ensured that all His words were God’s. ‘Never man spake like this man.’ The man who speaks to us once for all God’s words must be more than man. Other men, the highest, give us fragments of that mighty voice; Jesus speaks its whole message, and nothing but its message. Of that perfect reproduction He is calmly conscious, and claims to give it, in words which are at once lowly and instinct with more than human authority: ‘All things that I have heard of My Father I have made known unto you.’ Who besides Him dare make such a claim? Who besides Him could make it without being met by incredulous scorn? His utterance of the Father’s words was unmarred by defect on the one hand, and by additions on the other. It was like pure water which tastes of no soil. His soul was like an open vessel plunged in a stream, filled by the flow and giving forth again its whole contents.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That divine communication to Jesus was no mere impartation of abstractions or ‘truths,’ still less of the poor words of man’s speech, but was the flowing into His spirit of the living Father by whom He lived. And it was unbroken. ‘Morning by morning’ it was going on. The line was continuous, whereas for the rest of us, at the best, it is a series of points more or less contiguous, but with dark spaces between. ‘God giveth not the Spirit by measure unto Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, then, let us hold fast by Him, the Son in whom God has spoken to us, and to all voices without and within that would woo us to listen, let us answer with the only wise answer: ‘To whom shall we go? Thou hast the words of eternal life.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 50:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord God hath given me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The second discourse of the fifth part of Isaiah’s prophecies, according to Vitringa, begins here, and is continued to the seventeenth verse of the following chapter. God having, in the preceding paragraph, asserted his own power; to manifest the unreasonableness of the infidelity of the Jews, and that it was without all excuse, he proceeds to show what excellent and powerful means he used to bring them to repentance and salvation. This and the following passages may be, in some sort, understood of the Prophet Isaiah, but they are far more evidently and eminently verified in Christ, and indeed seem to be meant directly of him. To understand them in this light seems to suit best with the context, for, according to this exposition, the same person speaks here, who is the chief subject of the preceding chapter, and who has spoken in the foregoing verses of this chapter. There, indeed, he speaks as God, but here as man, being both God and man, as is abundantly evident from many passages, both of the Old and New Testaments. By ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tongue of the learned ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is meant, an ability of speaking plainly, convincingly, persuasively, and in all points, so as becomes a person taught of God, and filled with all divine and heavenly wisdom and knowledge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That I should know how to speak, &c., to him that is weary ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, burdened with the sense of his sin and misery, in which case a word of comfort is most seasonable and acceptable. This was the principal design of Christ’s ministry, namely, to give rest and comfort to the weary and heavy laden, according to what is said ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And all the doctrines, reproofs, and threatenings of Christ were directed to this end, to prepare men for receiving comfort and salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He wakeneth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine ear, morning by morning ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— From time to time, and continually. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He wakeneth mine ear to hear as the learned ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Either, first, as learned men, or teachers, use to awaken their scholars to hear and learn of them from time to time: or, rather, second, as those that are, or desire to be, learned, use to hear with all possible attention and diligence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "50:4-9 As Jesus was God and man in one person, we find him sometimes speaking, or spoken of, as the Lord God; at other times, as man and the servant of Jehovah. He was to declare the truths which comfort the broken, contrite heart, those weary of sin, harassed with afflictions. And as the Holy Spirit was upon him, that he might speak as never man spake; so the same Divine influence daily wakened him to pray, to preach the gospel, and to receive and deliver the whole will of the Father. The Father justified the Son when he accepted the satisfaction he made for the sin of man. Christ speaks in the name of all believers. Who dares to be an enemy to those unto whom he is a Friend? or who will contend with those whom he is an Advocate? Thus St. Paul applies it, Ro 8:33.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord God hath given me - This verse commences a new subject, and the deliverer is directly introduced as himself speaking. The reasons why this is supposed to refer to the Messiah, have been given in the analysis to the chapter. Those reasons will be strengthened by the examination of the particular expressions in the passage, and by showing, as we proceed in the exposition, in what way they are applicable to him. It will be assumed that the reference is to the Messiah; and we shall find that it is a most beautiful description of his character, and of some of the principal events of his life. This verse is designed to state how he was suited for the special work to which he was called. The whole endowment is traced to Yahweh. It was he who had called him; he who had given him the tongue of the learned, and he who had carefully and attentively qualified him for his work.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The tongue of the learned - Hebrew, 'The tongue of those who are instructed;' that is, of the eloquent; or the tongue of instruction (παιδείας  paideias, Septuagint); that is, he has qualified me to instruct others. It does not mean human science or learning; nor does it mean that any other had been qualified as he was, or that there were any others who were learned like him. But it means that on the subject of religion he was eminently endowed with intelligence, and with eloquence. In regard to the Redeemer's power of instruction, the discourses which he delivered, as recorded in the New Testament, and especially his sermon on the mount, may be referred to. None on the subject of religion ever spake like him; none was ever so well qualified to instruct mankind (compare Matthew 13:54).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The tongue of the learned - Hebrew, 'The tongue of those who are instructed;' that is, of the eloquent; or the tongue of instruction (παιδείας  paideias, Septuagint); that is, he has qualified me to instruct others. It does not mean human science or learning; nor does it mean that any other had been qualified as he was, or that there were any others who were learned like him. But it means that on the subject of religion he was eminently endowed with intelligence, and with eloquence. In regard to the Redeemer's power of instruction, the discourses which he delivered, as recorded in the New Testament, and especially his sermon on the mount, may be referred to. None on the subject of religion ever spake like him; none was ever so well qualified to instruct mankind (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "That I should know how to speak a word in season - The Hebrew here is, 'That I might know how to strengthen with a word the weary;' that is, that he might sustain, comfort, and refresh them by his promises and his counsels. How eminently he was suited to alleviate those who were heavy laden with sin and to comfort those who were burdened with calamities and trials, may be seen by the slightest reference to the New Testament, and the most partial acquaintance with his instructions and his life. The weary here are those who are burdened with a sense of guilt; who feel that they have no strength to bear up under the mighty load, and who therefore seek relief (see Matthew 11:28).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That I should know how to speak a word in season - The Hebrew here is, 'That I might know how to strengthen with a word the weary;' that is, that he might sustain, comfort, and refresh them by his promises and his counsels. How eminently he was suited to alleviate those who were heavy laden with sin and to comfort those who were burdened with calamities and trials, may be seen by the slightest reference to the New Testament, and the most partial acquaintance with his instructions and his life. The weary here are those who are burdened with a sense of guilt; who feel that they have no strength to bear up under the mighty load, and who therefore seek relief (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He wakeneth morning by morning - That is, he wakens me every morning early. The language is taken from an instructor who awakens his pupils early, in order that they may receive instruction. The idea is, that the Redeemer would be eminently endowed, under the divine instruction and guidance, for his work. He would be one who was, so to speak, in the school of God; and who would be qualified to impart instruction to others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He wakeneth mine ear - To awaken the ear is to prepare one to receive instruction. The expressions, to open the ear, to uncover the ear, to awaken the ear, often occur in the Scriptures, in the sense of preparing to receive instruction, or of disposing to receive divine communications. The sense here is plain. The Messiah would be taught of God, and would be inclined to receive all that he imparted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To hear as the learned - Many translate the phrase here 'as disciples,' that is, as those who are learning. So Lowth; 'With the attention of a learner.' So Noyes; 'In the manner of a disciple.' The Septuagint renders it, 'He has given me an ear to hear.' The idea is, probably, that he was attentive as they are who wish to learn; that is, as docile disciples. The figure is taken from a master who in the morning summons his pupils around him, and imparts instruction to them. And the doctrine which is taught is, that the Messiah would be eminently qualified, by divine teaching, to be the instructor of mankind. The Chaldee paraphrases this, 'Morning by morning, he anticipates (the dawn), that he may send his prophets, if perhaps they my open the ears of sinners, and receive instruction.' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To hear as the learned - Many translate the phrase here 'as disciples,' that is, as those who are learning. So Lowth; 'With the attention of a learner.' So Noyes; 'In the manner of a disciple.' The Septuagint renders it, 'He has given me an ear to hear.' The idea is, probably, that he was attentive as they are who wish to learn; that is, as docile disciples. The figure is taken from a master who in the morning summons his pupils around him, and imparts instruction to them. And the doctrine which is taught is, that the Messiah would be eminently qualified, by divine teaching, to be the instructor of mankind. The Chaldee paraphrases this, 'Morning by morning, he anticipates (the dawn), that he may send his prophets, if perhaps they my open the ears of sinners, and receive instruction.' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. Messiah, as \"the servant of Jehovah\" (Isa 42:1), declares that the office has been assigned to Him of encouraging the \"weary\" exiles of Israel by \"words in season\" suited to their case; and that, whatever suffering it is to cost Himself, He does not shrink from it (Isa 50:5, 6), for that He knows His cause will triumph at last (Isa 50:7, 8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "learned—not in mere human learning, but in divinely taught modes of instruction and eloquence (Isa 49:2; Ex 4:11; Mt 7:28, 29; 13:54).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "speak a word in season—(Pr 15:23; 25:11). Literally, \"to succor by words,\" namely, in their season of need, the \"weary\" dispersed ones of Israel (De 28:65-67). Also, the spiritual \"weary\" (Isa 42:3; Mt 11:28).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wakeneth morning by morning, &c.—Compare \"daily rising up early\" (Jer 7:25; Mr 1:35). The image is drawn from a master wakening his pupils early for instruction.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wakeneth … ear—prepares me for receiving His divine instructions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as the learned—as one taught by Him. He \"learned obedience,\" experimentally, \"by the things which He suffered\"; thus gaining that practical learning which adapted Him for \"speaking a word in season\" to suffering men (Heb 5:8).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " God having asserted his own power, to show the groundlessness of the infidelity of the Jews, he proceeds to show what excellent and effectual means he used to bring them to repentance and salvation; which he mentions as a great aggravation of their unbelief and rebellion, which by this means was without all excuse. This and the following passages may be in some sort understood of the prophet Isaiah, though but obscurely and imperfectly; but they are far more evidently and eminently verified in Christ, and indeed seem to be meant directly of him. For seeing there are many other passages in this prophecy which are directly meant of Christ, and of his ministry, and not at all of the prophet, why may not this be added to the number of them? especially considering that there is nothing here which forceth us to understand this place of Isaiah, and several of these passages are expounded of Christ in the New Testament, as is confessed. Besides, this seems to suit best with the coherence; for according to this exposition the same person speaketh here who hath spoken in all the foregoing verses of the chapter, even the Lord himself considered as man, because he was both God and man, as is abundantly evident from many scriptures, both of the Old and New Testament, as hath been already proved, and will hereafter be more fully evinced. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The tongue of the learned; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " an ability of speaking plainly, and convincingly, and persuadingly, and in all points so as becometh a person taught of God, and filled with all Divine and heavenly wisdom and knowledge, and with a singular skill of winning souls, and of working upon men’s hearts and consciences. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Him that is weary; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " burdened with the sense of his sad and deplorable condition, in which case a word of comfort is most seasonable and acceptable. This was the proper and principal design of Christ’s ministry, to give rest and comfort to distressed souls, according to what is said with respect to this place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 11:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and all the doctrines, reproofs, and threatenings of Christ were directed to this end, to make men fit for comfort and salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He wakeneth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, me, the pronoun being oft understood; or, as it follows, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine ear. Morning by morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; from time to time, and continually. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He wakeneth mine ear to hear; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because human nature is of itself weak and slothful, he by his Divine power assisteth and stirreth me up to the observation and practice of all his commands and my duties. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As the learned; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. As learned men or teachers use to awaken their scholars to hear and learn of them from time to time; or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. As those that are or desire and endeavour, up to be learned use to hear with all possible attention and diligence; for this title of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "learned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is in the former part of the verse given not to the teacher, who is said to be God, but to the person taught by him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord God hath given me the tongue of the learned,.... These are not the words of the prophet, as Aben Ezra, Kimchi, and others think; though what is here said is applicable to ministers of the word, who have to do with weary souls, and it is their work to comfort and refresh them; and which work requires knowledge and experience of their case, a good degree of elocution to speak aptly and with propriety, even to have the tongue of the learned, especially in a spiritual sense; as such have who have learned of the Father, and have been taught by the Spirit of God, and are well versed in the Scriptures, and can speak in the taught words of the Holy Ghost, comparing spiritual things with spiritual; and they have need of great prudence to time things right, to speak fitly and opportunely, and give to each their portion in due season, to whom they minister; and also great diligence and assiduity in prayer, reading, and meditation; and such as are teachers of others must be the Lord's hearers, and should be very diligent and attentive ones; all which are gifts from the Lord, and to be ascribed to him. But the words are to be understood of Christ, the same person that is speaking in the preceding verses; who being anointed by the Spirit of the Lord God, as man, whose gifts and graces he received without measure, he was abundantly qualified for the discharge of his prophetic office; and was capable of speaking as never man did, and with such power and authority as the Scribes and Pharisees did not, and with so much wisdom and eloquence as were surprising to all that heard him; he had the Spirit of wisdom on him, and the treasures of wisdom and knowledge hid in him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I should know how to speak a word in season to him that is weary; not only saints, weary with sin, their own and others, and with troubles from the world, from Satan, and by afflictive providences; but sinners under first awakenings, distressed and uneasy in their minds at a sight of sin, in its exceeding sinfulness; pressed with the guilt of it, filled with a sense of divine wrath on account of it, and terrified with the thoughts of death, and a future judgment; and are weary with labouring for bread which satisfies not, for righteousness and life, and in seeking for resting places, being in want of spiritual rest, peace, and comfort; and who are hungry and thirsting after righteousness, after pardoning grace and mercy, after Christ and salvation by him, after his word and ordinances, after communion with him, and conformity to him; who are weak and without strength, and ready to faint for want of refreshment. The word for \"weary\" signifies \"thirsty\", according to Jarchi, Kimchi, and Ben Melech; who explain it of persons that thirst after hearing the word of the Lord: the Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"to know how to teach the righteous that weary themselves at the words of the law;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or, as some render it, that pant after the words of the law: but not the law, but the Gospel, is \"the word in season\", to be spoken to weary souls; which proclaims pardon, preaches peace, is the word of righteousness and salvation; which directs hungry and thirsty souls to Christ, as the bread and water of life, and invites weary ones to him for rest. That word of his, Matthew 11:28 is a word in season to such persons: such a word Christ spoke when he was here on earth in his own person, and now speaks by his ministers in the preaching of the Gospel, and by his Spirit applying it to his people. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or, as some render it, that pant after the words of the law: but not the law, but the Gospel, is \"the word in season\", to be spoken to weary souls; which proclaims pardon, preaches peace, is the word of righteousness and salvation; which directs hungry and thirsty souls to Christ, as the bread and water of life, and invites weary ones to him for rest. That word of his, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is a word in season to such persons: such a word Christ spoke when he was here on earth in his own person, and now speaks by his ministers in the preaching of the Gospel, and by his Spirit applying it to his people. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He wakeneth morning by morning; one after another continually, meaning himself; the allusion is to masters calling their scholars early to their studies; the morning being the fittest season for instruction and learning. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He wakeneth mine ear to hear as the learned; who hear attentively, and with great pleasure and profit. This and the preceding clause seem to denote both the earliness in which Christ entered on his prophetic office, and his attentiveness in hearkening to all that was said in the eternal council and covenant by his divine Father; which he, as the Prophet of his church, makes known unto his people, John 15:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He wakeneth mine ear to hear as the learned; who hear attentively, and with great pleasure and profit. This and the preceding clause seem to denote both the earliness in which Christ entered on his prophetic office, and his attentiveness in hearkening to all that was said in the eternal council and covenant by his divine Father; which he, as the Prophet of his church, makes known unto his people, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 15:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The Lord GOD hath given {g} me the tongue of the learned, that I should know how to speak a word in season to him that is {h} weary: he awakeneth morning by morning, he awakeneth my ear to hear {i} as the learned.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord GOD hath given ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " me the tongue of the learned, that I should know how to speak a word in season to ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "him that is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " weary: he awakeneth morning by morning, he awakeneth my ear to hear ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the learned.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) The prophet represents here the person and charge of them that are justly called to the ministry by God's word.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) To him that is oppressed by affliction and misery.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) As they who are taught, and made meet by him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4, 5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The relation of the Servant to Jehovah is that of a favourite disciple to his master; from Him he had learned the art of persuasive and consoling speech, and to Him he daily looks for the substance of his message. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the Servant’s endowment with prophetic eloquence), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the gentleness of his ministry).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tongue of the learned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a disciples’ tongue",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e. a disciplined tongue (R.V. “of them that are taught”). The stress laid on the Divine education of the Servant is connected with the fact that his ministry of consolation was almost a new departure in prophecy. In the hands of the earlier prophets the word of Jehovah had been like a hammer breaking the rock in pieces (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 23:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") rather than a dew reviving the spirit of the humble.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should know … weary",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A difficult clause. The verb rendered “speak in season” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘ûth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is unknown in Hebrew. The A.V., following the Jewish interpreters, takes it to be a denominative from the word for “time” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘çth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but that is an impossible etymology. The LXX. gives a similar sense (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ γνῶναι ἡνίκα δεῖ εἰπεῖν λόγον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") but based on a different text. Of the traditional interpretations the most suitable is perhaps that of the Vulg. and Aquila (which is followed by the R.V.): ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that I should know how to sustain the weary with a word",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Modern authorities who adopt this rendering support it by an Arabic verb meaning “to help,” which however is not an exact philological equivalent. Another Arabic analogy has suggested the translation “water” (i.e. “refresh”). It is impossible to get beyond conjecture, although the general sense is clear.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he wakeneth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (sc. my ear) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "morning by morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). A far simpler sentence results if we omit with Cheyne the first word of the Heb. (or with Duhm the first two words) as an uncorrected slip of a copyist, reading the adverbial expression with the following verb; thus: “morning by morning (or “in the morning”) he wakeneth my ear to hear” &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as the learned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "after the manner of disciples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 50:4-11",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Lord’s Servant made perfect through Sufferings",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 50:4-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:4-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " the Servant is again introduced, speaking of himself and his work, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He describes in the first place the close and intimate and continuous communion with God through which he has learned the ministry of comfort by the Divine word, and his own complete self-surrender to the voice that guides him (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 50:4-5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:4-5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); next, his acceptance of the persecution and obloquy which he had to encounter in the discharge of his commission (6); and lastly he expresses his unwavering confidence in the help of Jehovah and the victory of his righteous cause and the discomfiture of all his enemies (7–9).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 50:10-11",
        "children": [
          {
            "element": "span",
            "class": "ital",
            "text": "Isaiah 50:10-11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " are an appendix to the preceding description, drawing lessons for the encouragement of believers (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 50:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the warning of unbelievers (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 50:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 50:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). They contain expressions and even thoughts which are unlike those of the second Isaiah; and are possibly (with Duhm and Cheyne) to be regarded as a later insertion in the prophecy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Although the word “Servant” never occurs in this passage, its resemblance to the three other “servant-passages” makes it certain that the speaker is none other than the ideal character who comes before us in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Isa 52:13–53:15. The passage, indeed, forms an almost indispensable link of connexion between the first two and the last of these. Whilst it takes up and developes certain ideas thrown out in the earlier sections, and in its dramatic form most resembles the second of them, its closest affinities are with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. Common to both is the new conception of the Servant as a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sufferer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here at the hands of men, there at the hands of men and God alike. In the present passage we have the Servant’s own consciousness with regard to his sufferings, these being regarded from an ethical point of view as brought on him by fidelity to his Divine mission. In ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. it is the religious aspect of them that is mainly dwelt upon: their value in the sight of God, and their efficacy for the salvation of men.—The view, therefore, that the prophet here speaks in his own name cannot be maintained, although it is no doubt the one that would be most readily suggested if the verses stood alone. So also the further question whether the Servant be the ideal Israel must be considered with due regard to the other places where the same idea is presented (see Appendix, Note I). Here it is only necessary to observe that the conception cannot in any case be applied to Israel as a whole and its sufferings from other nations. We have seen from ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that the Servant has two spheres of activity, one within Israel, and the other directed to the world at large; and there can be no reasonable doubt that the persecutions referred to belong to the narrower sphere, representing the experience of the godly minority in whom the true ideal of Israel was partly realised, in conflict with their unregenerate fellow-countrymen.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 4-9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - A SOLILOQUY OF THE SERVANT OF JEHOVAH. The separateness of this passage has been maintained in the opening paragraph. That it is not of himself that the prophet here speaks, appears ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the self-assertion (vers, 4, 5, 9); ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the depth of humiliation declared in ver. 6, which is beyond anything recorded of Isaiah. But if he does not speak of himself, he can scarcely speak of any other besides \"the Servant,\" of whom he has already said much (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and of whom he has still much more to say (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:13-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord God hath given me the tongue of the learned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the tongue of disciples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a trained tongue, a well-taught tongue. Christ \"did nothing of himself; as the Father had ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "taught",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " him,\" so he spoke (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That I should know how to speak a word in season",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to him that is weary; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that I shall know how to sustain by a word him that is weary.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Compare, \"Come unto me, all ye that labour and are heavy laden, and I will give you rest\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He wakeneth morning by morning...  mine ear.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God held immediate and constant communication with the \"Servant\" - not enlightening him occasionally, as he did the prophets, by dreams and visions, but continually whispering in his ear. At no time did the Father \"leave him alone\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or cease to speak to him. \"Morning by morning\" is not to be narrowed to the bare literal meaning, but to be taken in the sense of \"un-interruptedly.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "hear as the learned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to hear as disciples hear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " attentively, submissively, gladly. Isaiah 50:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He in whom Jehovah came to His nation, and proclaimed to it, in the midst of its self-induced misery, the way and work of salvation, is He who speaks in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 50:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"The Lord Jehovah hath given me a disciple's tongue, that I may know how to set up the wearied with words: He wakeneth every morning; wakeneth mine ear to attend in disciple's manner.\" The word limmūdı̄m, which is used in the middle of the verse, and which is the older word for the later talmidı̄m, μαθηταί, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is repeated at the close of the verse, according to the figure of palindromy, which is such a favourite figure in both parts of the book of Isaiah; and the train of thought, \"He wakeneth morning by morning, wakeneth mine ear,\" recals to mind the parallelism with reservation which is very common in the Psalms, and more especially the custom of a \"triolet-like\" spinning out of the thoughts, from which the songs of \"degrees\" (or ascending steps, shı̄r hamma‛ălōth) have obtained their name. The servant of Jehovah affords us a deep insight here into His hidden life. The prophets received special revelations from God, for the most part in the night, either in dreams or else in visions, which were shown them in a waking condition, but yet in the more susceptible state of nocturnal quiet and rest. Here, however, the servant of Jehovah receives the divine revelations neither in dreams nor visions of the night; but every morning (babbōqer babbōqer as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., when his sleep is over, Jehovah comes to him, awakens his ear, by making a sign to him to listen, and then takes him as it were into the school after the manner of a pupil, and teaches him what and how he is to preach. Nothing indicates a tongue befitting the disciples of God, so much as the gift of administering consolation; and such a gift is possessed by the speaker here. \"To help with words him that is exhausted\" (with suffering and self-torture): עוּת, Arab. gât̬, med. Vav, related to אוּשׁ, חוּשׁ, signifies to spring to a person with words to help, Aq. ὑποστηρίσαι, Jer. sustentare. The Arabic gât̬, med. Je, to rain upon or water (Ewald, Umbreit, etc.), cannot possibly be thought of, since this has no support in the Hebrew; still less, however, can we take עוּת as a denom. from עת, upon which Luther has founded his rendering, \"to speak to the weary in due season\" (also Eng. ver.). דּבר is an accusative of more precise definition, like אשׁר in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 50:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jerome has given the correct rendering: \"that I may know how to sustain him that is weary with a word.\" ",
        "children": []
      }
    ]
  }
]