[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:28-36 Christ's transfiguration was a specimen of that glory in which he will come to judge the world; and was an encouragement to his disciples to suffer for him. Prayer is a transfiguring, transforming duty, which makes the face to shine. Our Lord Jesus, even in his transfiguration, was willing to speak concerning his death and sufferings. In our greatest glories on earth, let us remember that in this world we have no continuing city. What need we have to pray to God for quickening grace, to make us lively! Yet that the disciples might be witnesses of this sign from heaven, after awhile they became awake, so that they were able to give a full account of what passed. But those know not what they say, that talk of making tabernacles on earth for glorified saints in heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jesus was found alone - That is, the two men had left him. In respect to \"them\" he was alone. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "36. Jesus was found alone—Moses and Elias are gone. Their work is done, and they have disappeared from the scene, feeling no doubt with their fellow servant the Baptist, \"He must increase, but I must decrease.\" The cloud too is gone, and the naked majestic Christ, braced in spirit, and enshrined in the reverent affection of His disciples, is left—to suffer!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "kept it close—feeling, for once at least, that such things were unmeet as yet for the general gaze.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 36. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 9:28\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "8\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when, the voice was past,.... The above words were delivered, and it was heard no more: Jesus was found alone; by his disciples; Moses and Elias being gone, and he in the same form in which he was before his transfiguration. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And they kept it close; as Christ strictly charged them, when coming down from the mount with them; Matthew 17:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And they kept it close; as Christ strictly charged them, when coming down from the mount with them; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And told no man in those days any of those things which they had seen; no, not any of their fellow disciples, until that Christ was risen from the dead. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And told no man in those days any of those things which they had seen; no, not any of their fellow disciples, until that Christ was risen from the dead. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when the voice was past, Jesus was found alone. And they kept it close, and told no man in {i} those days any of those things which they had seen.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when the voice was past, Jesus was found alone. And they kept ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " close, and told no man in ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " those days any of those things which they had seen.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Until Christ was risen again from the dead.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐσίγησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", they were silent; “in those days,” it is added, implying that afterwards (after the resurrection) they spoke of the experience. Lk. does not mention the injunction of Jesus to keep silence, nor the conversation on the way down the hill about Elijah and John the Baptist.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they kept it close",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] until after the resurrection, in accordance with the express command of Jesus given them as they were descending the hill. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". During the descent there also occurred the conversation about Elijah and John the Baptist. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:9-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:9-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 36.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they kept it close, and told no man in those days any of those things which they had seen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reasons of this silence for the present have been already discussed. The scene, doubtless, had done its work in the education of the three. Without telling their companions what they had seen and heard on the mount, we may assume that the sight of the serene confidence and renewed trust on the part of Peter, James, and John did its effectual work in strengthening their brethren. No doubt directly after the Resurrection, possibly during the days of darkness and gloom which followed the day of the cross, the chosen three related at length their experience of the Transfiguration mystery. The narrative of the Transfiguration and its attendant circumstances, as might have been expected, has been a favourite subject for hostile criticism. It does not, however, lend itself to any probable, or even possible, explanation which refers the story to some exaggerated report of a mistaken natural phenomenon. The whole story, as we have it thrice - with very slight variation in the details - repeated in the synoptical Gospels, must stand as we have it, or else must be wholly rejected as a myth. But, if a myth, whence did it spring? for nothing in the Jewish expectation of Messiah could possibly have suggested the \"legend.\" The strange and even childish interruption of Peter could never have been ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "invented.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " No one ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "friendly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the apostle would have chronicled such a saying had there been any doubt resting on its authenticity; and a writer ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hostile",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the apostle would scarcely have invented a narrative which treated of the Divine glory of the apostle's adored Master. If it be an invention, whence comes it? in whose interest was it composed? and how did it find its way into the very heart of the three synoptical Gospels? for there we find it woven into that marvellous tapestry of  revelation and teaching which has at once charmed and influenced so many millions of men and women now for more than eighteen hundred years. Something of the purpose which the Transfiguration was intended to serve in the education of the twelve has been already discussed in the foregoing notes. Dr. Lange, who has made this difficult passage in the story of Jesus a subject of deep and earnest study, has given us some beautiful thoughts on the real signification of the Lord's transfiguration. This scholar and divine considers that, just at this period of his public ministry, Jesus had reached the zenith of his power. This is indicated by the grandeur of his recent miracles. There was nothing higher and more sublime to be reached by him. From this moment, therefore, earthly existence became too narrow a sphere. There only remained death; but death is, as St. Paul says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the wages of sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " For the sinless Man the issue of life is not the sombre passage of the tomb, rather is it the. royal road of a glorious transformation. Had the hour of this glorification struck for Jesus? and was the Transfiguration the beginning of the heavenly renewal? Gess, quoted by Godet  - from whose ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "precis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Lange's note these observations are derived - gives expression to Lange's thoughts in these words: \"This event (the Transfiguration) indicates the ripe preparation of Jesus for immediate entrance upon eternity.\" \"Had not Jesus himself,\" goes on Godet to say, thus con-eluding this very beautiful and suggestive, if somewhat fanciful note, \"voluntarily suspended this change which was on the point of being wrought in him, this moment, the moment of his glorious transfiguration would have become the moment of his ascension.\" Luke 9:36",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the voice was past (ἐν τῷ γενέσθαι τὴν φωνὴν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., in the coming to pass of the voice. Rev., when the voice came, with A. V. in margin.",
        "children": []
      }
    ]
  }
]