[{"header":"Chapter 13"},{"num":1,"verse":"War Between Abijah and Jeroboam. In the eighteenth year of King Jeroboam, Abijah became king of Judah; "},{"num":2,"verse":"he reigned three years in Jerusalem. His mother was named Micaiah, daughter of Uriel of Gibeah. There was war between Abijah and Jeroboam."},{"num":3,"verse":"Abijah joined battle with a force of four hundred thousand picked warriors, while Jeroboam lined up against him in battle with eight hundred thousand picked and valiant warriors. "},{"num":4,"verse":"Abijah stood on Mount Zemaraim, which is in the highlands of Ephraim, and said: “Listen to me, Jeroboam and all Israel! "},{"num":5,"verse":"Do you not know that the Lord, the God of Israel, has given David kingship over Israel forever, to him and to his sons, by a covenant of salt? "},{"num":6,"verse":"Yet Jeroboam, son of Nebat, the servant of Solomon, son of David, arose and rebelled against his lord! "},{"num":7,"verse":"Worthless men, scoundrels, joined him and overcame Rehoboam, son of Solomon, when Rehoboam was young and inexperienced, and no match for them. "},{"num":8,"verse":"But now, do you think you are a match for the kingdom of the Lord led by the descendants of David, simply because you are a huge multitude and have with you the golden calves which Jeroboam made you for gods? "},{"num":9,"verse":"Have you not expelled the priests of the Lord, the sons of Aaron, and the Levites, and made for yourselves priests like the peoples of other lands? Everyone who comes to consecrate himself with a young bull and seven rams becomes a priest of no-gods. "},{"num":10,"verse":"But as for us, the Lord is our God, and we have not abandoned him. The priests ministering to the Lord are sons of Aaron, and the Levites also have their offices. "},{"num":11,"verse":"They sacrifice burnt offerings to the Lord and fragrant incense morning after morning and evening after evening; they set out the showbread on the pure table, and the lamps of the golden menorah burn evening after evening; for we observe our duties to the Lord, our God, but you have abandoned him. "},{"num":12,"verse":"See, God is with us, at our head, and his priests are here with trumpets to sound the attack against you. Israelites, do not fight against the Lord, the God of your ancestors, for you will not succeed!”"},{"num":13,"verse":"But Jeroboam had an ambush go around them to come at them from the rear; so that while his army faced Judah, his ambush lay behind them. "},{"num":14,"verse":"When Judah turned and saw that they had to battle on both fronts, they cried out to the Lord and the priests sounded the trumpets. "},{"num":15,"verse":"Then the Judahites shouted; and when they shouted, God struck down Jeroboam and all Israel before Abijah and Judah. "},{"num":16,"verse":"The Israelites fled before Judah, and God delivered them into their power. "},{"num":17,"verse":"Abijah and his people inflicted a severe defeat upon them; five hundred thousand picked men of Israel fell slain. "},{"num":18,"verse":"The Israelites were humbled on that occasion, while the Judahites were victorious because they relied on the Lord, the God of their ancestors. "},{"num":19,"verse":"Abijah pursued Jeroboam and seized cities from him: Bethel and its dependencies, Jeshanah and its dependencies, and Ephron and its dependencies. "},{"num":20,"verse":"Jeroboam did not regain power during Abijah’s time; the Lord struck him down and he died, "},{"num":21,"verse":"while Abijah continued to grow stronger. He married fourteen wives and fathered twenty-two sons and sixteen daughters."},{"num":22,"verse":"Death of Abijah. The rest of the acts of Abijah, his deeds and his words, are recorded in the midrash of the prophet Iddo. "},{"num":23,"verse":"Abijah rested with his ancestors; they buried him in the City of David and his son Asa succeeded him as king. During his time, the land had ten years of peace."}]