[{"header":"Chapter 13"},{"num":1,"verse":"Abijah and Jeroboam Go to War. In the eighteenth year of King Jeroboam, Abijah became king of Judah."},{"num":2,"verse":"He reigned for three years in Jerusalem. His mother’s name was Micaiah, the daughter of Uriel of Gibeah."},{"num":3,"verse":"Abijah prepared to engage in battle with an army of valiant warriors composed of four hundred thousand picked men, while Jeroboam took the field against him with eight hundred thousand chosen mighty warriors."},{"num":4,"verse":"Then Abijah stood up on the slopes of Mount Zemaraim in the hill country of Ephraim and cried out: “Listen to me, Jeroboam and all Israel!"},{"num":5,"verse":"Do you not know that the Lord, the God of Israel, gave the kingship over Israel to David and his sons forever by a covenant of salt?"},{"num":6,"verse":"Yet Jeroboam, the son of Nebat, a servant of Solomon, the son of David, rose up and rebelled against his lord,"},{"num":7,"verse":"and certain worthless scoundrels gathered around him and proved to be too strong for Rehoboam, the son of Solomon, since at that time Rehoboam was far too young and inexperienced and was unable to withstand them."},{"num":8,"verse":"“And now you believe that you can withstand the kingdom of the Lord that is in the hands of David’s descendants, you with your multitude of supporters and the golden calves that Jeroboam made as gods for you."},{"num":9,"verse":"Have you not driven out the priests of the Lord, the descendants of Aaron and the Levites, and made priests of your own like the peoples of foreign countries? Anyone who comes with an offering of a young bull and seven rams is automatically accepted as a priest of these gods that are no gods."},{"num":10,"verse":"But as for us, the Lord is our God, and we have not forsaken him. The priests who are ministering to the Lord are descendants of Aaron, and the Levites assist them."},{"num":11,"verse":"Every morning and evening they present burnt offerings and fragrant incense to the Lord, display the rows of bread on the table of pure gold, and light the lamps on the golden lampstand every evening. For we indeed observe our responsibilities toward the Lord, our God, but you have abandoned him."},{"num":12,"verse":"God is with us. He is our leader. His priests with their trumpets are prepared to sound the call to battle against you. O Israelites, do not engage in conflict against the Lord, the God of your ancestors, for you will not succeed.”"},{"num":13,"verse":"Meanwhile Jeroboam had sent a detachment of troops to attack them from behind. His main force was stationed in front of the forces of Judah, while the ambush lay behind them."},{"num":14,"verse":"When the men of Judah turned around, they realized that they were surrounded and that they had to engage in battle on both fronts. Then they cried out to the Lord while the priests blew the trumpets."},{"num":15,"verse":"After that, the men of Judah sounded their battle cry, and when they shouted, God routed Jeroboam and all Israel before Abijah and Judah."},{"num":16,"verse":"The Israelites fled before the Judahites, and God delivered them into the Judahites’ hands."},{"num":17,"verse":"Abijah and his army inflicted heavy losses upon the Israelites. Five hundred thousand picked men of Israel fell during the battle."},{"num":18,"verse":"The Israelites were thoroughly defeated at that time by the forces of Judah, because the Judahites relied on the Lord, the God of their ancestors."},{"num":19,"verse":"Abijah pursued Jeroboam and captured three cities from him: Bethel with its dependencies, Jeshanah with its dependencies, and Ephron with its dependencies."},{"num":20,"verse":"Jeroboam did not regain his power during the reign of Abijah. Finally the Lord struck him down, and he died."},{"num":21,"verse":"However, Abijah continued to grow ever stronger. He married fourteen wives and became the father of twenty-two sons and sixteen daughters."},{"num":22,"verse":"The Death of Abijah. The rest of the acts of Abijah’s reign, what he did and what he said, are recorded in the midrash of the prophet Iddo."},{"num":23,"verse":"Abijah rested with his ancestors and was buried in the City of David. His son Asa succeeded him, and during his reign the country was at peace for ten years."}]