[{"num":3,"verse":"(iv) “‘If his offering is a sacrifice of peace offerings, then, if he offers before Adonai an animal from the herd, then, no matter whether it is male or female, it must be without defect. "},{"num":2,"verse":"He is to lay his hand on the head of his offering and slaughter it at the entrance to the tent of meeting; and the sons of Aharon, the cohanim, are to splash the blood against all sides of the altar. "},{"num":3,"verse":"He is to present the sacrifice of the peace offerings as an offering made by fire to Adonai; it is to consist of the fat covering the inner organs, all the fat above the inner organs, "},{"num":4,"verse":"the two kidneys, the fat on them near the flanks, and the covering of the liver, which he will remove with the kidneys. "},{"num":5,"verse":"Aharon’s sons will make it go up in smoke on the altar on top of the burnt offering which is on the wood on the fire; it is an offering made by fire, a fragrant aroma for Adonai."},{"num":6,"verse":"“‘If his offering for a sacrifice of peace offerings to Adonai is from the flock, then, when he offers it, no matter whether it is male or female, it must be without defect. "},{"num":7,"verse":"If he brings a lamb for his offering, then he is to present it before Adonai. "},{"num":8,"verse":"He is to lay his hand on the head of his offering and slaughter it at the entrance to the tent of meeting, and the sons of Aharon are to splash its blood against all sides of the altar. "},{"num":9,"verse":"From the sacrifices made as peace offerings, he is to present Adonai with an offering made by fire; it is to consist of its fat, the entire fat tail, which he will remove close to the lower backbone, the fat covering the inner organs, all the fat above the inner organs, "},{"num":10,"verse":"the two kidneys, the fat on them near the flanks, and the covering of the liver, which he will remove with the kidneys. "},{"num":11,"verse":"The cohen will make it go up in smoke on the altar; it is food, an offering made by fire to Adonai."},{"num":12,"verse":"“‘If his offering is a goat, then he is to present it before Adonai. "},{"num":13,"verse":"He is to lay his hand on its head and slaughter it in front of the tent of meeting, and the sons of Aharon are to splash its blood against all sides of the altar. "},{"num":14,"verse":"He is to present from it his offering, an offering made by fire to Adonai ; it is to consist of the fat covering the inner organs, all the fat above the inner organs, "},{"num":15,"verse":"the two kidneys, the fat on them near the flanks, and the covering of the liver, which he will remove with the kidneys. "},{"num":16,"verse":"The cohen will make them go up in smoke on the altar; it is food, an offering made by fire to be a fragrant aroma; all the fat belongs to Adonai. "},{"num":17,"verse":"It is to be a permanent regulation through all your generations wherever you live that you will eat neither fat nor blood.’”"}]