[{"header":"Fellowship Offerings"},{"num":3,"verse":"“If you offer one of your cattle as a fellowship offering, it can be a bull or a cow. But the animal you offer to the Lord must have nothing wrong with it."},{"num":2,"verse":"You must put your hand on the animal’s head and kill the animal at the entrance of the Meeting Tent. Then Aaron’s sons, the priests, will splash the blood on all four sides of the altar."},{"num":3,"verse":"The priest will take a part of that fellowship offering as a gift to the Lord. He will take the fat that is over and around the inner parts."},{"num":4,"verse":"He will take the two kidneys and the fat covering them near the lower back muscle. He will also remove the fat part of the liver that is near the kidneys."},{"num":5,"verse":"Then Aaron’s sons will bring the fat to the altar and put it on the burnt offering that is on the wood on the fire. It is a sweet-smelling gift to the Lord."},{"num":6,"verse":"“If you offer a sheep or a goat as a fellowship offering to the Lord, whether it is a male or a female, it must have nothing wrong with it."},{"num":7,"verse":"If you bring a lamb as an offering to the Lord,"},{"num":8,"verse":"you must put your hand on the animal’s head and kill it in front of the Meeting Tent. Then Aaron’s sons will splash the animal’s blood on all four sides of the altar."},{"num":9,"verse":"The priest will take part of the fellowship offering to the altar as a gift to the Lord. The priest must cut off the tail close to the backbone. Then he will offer the tail with all its fat and the fat that is over and around the animal’s inner parts."},{"num":10,"verse":"He will also offer the two kidneys and the fat covering them near the lower back muscles. He will also offer the fat part of the liver. He must remove it with the kidneys."},{"num":11,"verse":"Then the priest will take that part to the altar to be burned up as food, a gift to the Lord."},{"num":12,"verse":"“If the offering is a goat, you must bring it before the Lord."},{"num":13,"verse":"You must put your hand on the goat’s head and kill it in front of the Meeting Tent. Then Aaron’s sons, the priests, must splash the goat’s blood on all four sides of the altar."},{"num":14,"verse":"The priest will give part of the fellowship offering as a gift to the Lord. He will offer the fat that is over and around the animal’s inner parts."},{"num":15,"verse":"He will offer the two kidneys and the fat covering them near the lower back muscle. He will also offer the fat part of the liver. He will remove it with the kidneys."},{"num":16,"verse":"Then the priest will bring that food as a sweet-smelling gift to the Lord. The fat belongs to the Lord."},{"num":17,"verse":"This rule will continue forever through all your generations. Wherever you live, you must never eat fat or blood.”"}]