[{"header":"Judah’s Sin and Its Consequence"},{"header":"Two Ways Contrasted"},{"header":"The Deceitfulness of the Human Heart"},{"header":"The Lord: The Hope of Israel"},{"header":"The Prophet’s Call for Help and Justice"},{"header":"A Test Case: Keeping the Sabbath"},{"num":19,"verse":"The Lord told me, “Go, stand in the gate of the people, where the kings of Judah come in and go out, and in the other gates of Jerusalem as well. "},{"num":20,"verse":"Say to them, ‘Kings of Judah, all Judah, and all the residents of Jerusalem entering these gates, hear this message from the Lord. "},{"num":21,"verse":"This is what the Lord says: “Be careful! On the Sabbath day, don’t carry any load or bring anything through the gates of Jerusalem. "},{"num":22,"verse":"Don’t bring any load out of your houses on the Sabbath day, nor are you to do any work. You are to consecrate the Sabbath day, just as I commanded your ancestors. "},{"num":23,"verse":"But they didn’t listen, nor did they pay attention. They were determined not to listen and not to accept instruction. "},{"num":24,"verse":"If you listen to me carefully,” declares the Lord, “and don’t bring a load through the gates of this city on the Sabbath day, and you consecrate the Sabbath day and don’t do any work on it, "},{"num":25,"verse":"then kings and princes, sitting on the throne of David will come through the gates of this city. They, their princes, the men of Judah, and the residents of Jerusalem will come riding in chariots and on horses, and this city will be inhabited forever. "},{"num":26,"verse":"They’ll come from the cities of Judah, from the places around Jerusalem, from the territory of Benjamin, from the Shephelah, from the hill country, and from the Negev, bringing burnt offerings, sacrifices, grain offerings, and incense, and bringing thanksgiving offerings to the Lord’s Temple. "},{"num":27,"verse":"But if you don’t listen to me, to consecrate the Sabbath day and not carry any load as you enter the gates of Jerusalem on the Sabbath day, then I’ll start a fire in its gates. It will consume the palaces of Jerusalem and won’t be extinguished.”’”"}]