[{"header":"The Deceitful Heart"},{"header":"The Sabbath Must Be Kept"},{"num":19,"verse":"This is what the Lord said to me: “Go and stand at the public gate, through which the kings of Judah come in and go out, as well as at all the gates of Jerusalem;"},{"num":20,"verse":"and say to them, ‘Listen to the word of the Lord, you kings of Judah, and all Judah, and all inhabitants of Jerusalem who come in through these gates."},{"num":21,"verse":"This is what the Lord says: “Take care for yourselves, and do not carry any load on the Sabbath day or bring anything in through the gates of Jerusalem."},{"num":22,"verse":"You shall not bring a load out of your houses on the Sabbath day nor do any work, but keep the Sabbath day holy, just as I commanded your forefathers."},{"num":23,"verse":"Yet they did not listen or incline their ears, but stiffened their necks so as not to listen or accept discipline."},{"num":24,"verse":"“But it will come about, if you give your attention to Me,” declares the Lord, “to bring no load in through the gates of this city on the Sabbath day, but to keep the Sabbath day holy by doing no work on it,"},{"num":25,"verse":"then there will come in through the gates of this city kings and officials sitting on the throne of David, riding in chariots and on horses, they and their officials, the men of Judah and the inhabitants of Jerusalem, and this city will be inhabited forever."},{"num":26,"verse":"They will come in from the cities of Judah and from the areas surrounding Jerusalem, from the land of Benjamin, from the lowland, from the hill country, and from the Negev, bringing burnt offerings, sacrifices, grain offerings, and frankincense, and bringing sacrifices of thanksgiving to the house of the Lord."},{"num":27,"verse":"But if you do not listen to Me, to keep the Sabbath day holy by not carrying a load and coming in through the gates of Jerusalem on the Sabbath day, then I will set fire to its gates, and it will devour the palaces of Jerusalem and not go out.”’”"}]