[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sing unto the Lord a new song.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words are familiar in the Psalms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and are probably quoted from them. The only touch of definite localisation is found in the mention of Kedar. (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 21:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Starting from this, the other terms gain a more defined significance. The proclamation seems to be addressed to the nations of the Eastern, not the Western world, as if to the ships that sailed from Elath or Ezion-geber down the Elanitic Gulf. The rock, or Sela (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is the Petra of Roman Idumæa; the ships are those that trade to Ophir or the land of Sinim. The cities and the nomad tribes are all invited to join in the hymn of praise, and it is to be echoed in the far-off “islands,” or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "coasts, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the Indian Ocean.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 42:10; Isaiah 42:12. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sing unto the Lord a new song — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Upon this new and great occasion, the salvation of the world by Christ. It is with peculiar propriety and elegance that the nations are here called upon and exhorted to praise and extol Jehovah, for the singular blessing conferred upon them by the gospel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And his praise from the end of the earth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— All nations, from one end of the earth to another. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye that go down to the sea ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— You that go by sea, carry these glad tidings from Judea, where Christ was born, and lived, and died, and published the gospel, unto the remotest parts of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let the wilderness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Those parts of the world which are now desolate and forsaken of God, and barren of all good fruits. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The villages that Kedar doth inhabit ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The Arabians, who were a heathen and barbarous people, and are put for all nations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let them shout from the top of the mountains ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Whose inhabitants are commonly more savage and ignorant than others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let them declare his praise in the islands ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In the remotest parts of the world, as well as in Arabia, which was near to them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:5-12 The work of redemption brings back man to the obedience he owes to God as his Maker. Christ is the light of the world. And by his grace he opens the understandings Satan has blinded, and sets at liberty from the bondage of sin. The Lord has supported his church. And now he makes new promises, which shall as certainly be fulfilled as the old ones were. When the Gentiles are brought into the church, he is glorified in them and by them. Let us give to God those things which are his, taking heed that we do not serve the creature more than the Creator.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sing unto the Lord a new song - It is common, as we have seen, to celebrate the goodness of God in a hymn of praise on the manifestation of any special act of mercy (see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 12:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 26) Here the prophet calls upon all people to celebrate the divine mercy in a song of praise in view of his goodness in providing a Redeemer. The sentiment is, that God's goodness in providing a Saviour demands the thanksgiving of all the world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A new song - A song hitherto unsung; one that shall be expressive of the goodness of God in this new manifestation of his mercy. None of the hymns of praise that had been employed to express his former acts of goodness would appropriately express this. The mercy was so great that it demanded a song expressly made for the occasion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his praise frown the end of the earth - From all parts of the earth. Let the most distant nations who are to be interested in this great",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ye that go down to the sea - That is, traders, navigators, merchants, seamen; such as do business in the great waters. The sense is, that they would be interested in the plan of mercy through a Redeemer; and hence, they are called on to celebrate the goodness of God (compare the notes at Isaiah 60:5). This is referred to by the prophet, first, because of the great multitude who thus go down to the sea; and, secondly, because their conversion will have so important an influence in diffusing the true religion to distant nations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ye that go down to the sea - That is, traders, navigators, merchants, seamen; such as do business in the great waters. The sense is, that they would be interested in the plan of mercy through a Redeemer; and hence, they are called on to celebrate the goodness of God (compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This is referred to by the prophet, first, because of the great multitude who thus go down to the sea; and, secondly, because their conversion will have so important an influence in diffusing the true religion to distant nations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And all that is therein - Margin, as Hebrew, 'The fullness thereof.' All that fill it; that is, either in ships, or by dwelling on the islands and coasts. The meaning is, that all who were upon the sea - the completeness, the wholeness of the maritime population, being equally interested with all others in the great salvation, should join in celebrating the goodness of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The isles - A large portion of the inhabitants of the world are dwellers upon islands. In modern times, some of the most signal displays of the divine mercy, and some of the most remarkable conversions to Christianity, have been there. In the Sandwich Islands, and in Ceylon, God has poured out his Spirit, and their inhabitants have been among the first in the pagan world to embrace the gospel. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The isles - A large portion of the inhabitants of the world are dwellers upon islands. In modern times, some of the most signal displays of the divine mercy, and some of the most remarkable conversions to Christianity, have been there. In the Sandwich Islands, and in Ceylon, God has poured out his Spirit, and their inhabitants have been among the first in the pagan world to embrace the gospel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. new song—such as has never before been sung, called for by a new manifestation of God's grace, to express which no hymn for former mercies would be appropriate. The new song shall be sung when the Lord shall reign in Jerusalem, and all \"nations shall flow unto it\" (Isa 2:2; 26:1; Re 5:9; 14:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ye that go down to the sea—whose conversion will be the means of diffusing the Gospel to distant lands.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "all … therein—all the living creatures that fill the sea (Ps 96:11) [Maurer]. Or, all sailors and voyagers [Gesenius]. But these were already mentioned in the previous clause: there he called on all who go upon the sea; in this clause all animals in the sea; so in Isa 42:11, he calls on the inanimate wilderness to lift up its voice. External nature shall be so renovated as to be in unison with the moral renovation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sing unto the Lord a new song, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " upon this new and great occasion, the calling and salvation of the world by Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From the end of the earth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all nations, from one end of the earth. to another, who shall be sharers in this mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye that go down to the sea, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c.; you that go by sea, carry these glad tidings from Judea, where Christ was born, and lived, and died, and published the gospel, unto the remotest parts of the earth, that they may join with you in singing forth God’s praises for his marvellous kindness and grace to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sing unto the Lord a new song,.... On account of the new things before prophesied of, and now done; on account of redemption and salvation by Christ, and the conversion of the Gentiles through the light of the Gospel brought among them; the song of redeeming love, and for the Gospel, and regenerating grace; and not the Jews only, but the Gentiles also, are called upon to sing this song, as having a special share in the blessings, the subject of it: hence it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and his praise from the end of the earth; thither the Gospel being sent, and there made effectual to the conversion of many, these are exhorted to sing and show forth the praises of him who had called them out of Heathenish blindness and darkness into the marvellous light of the Gospel and grace of God: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ye that go down into the sea; in ships, that trade by sea; such as the Phoenicians, Tyrians, and Sidonians, to whom the Gospel came, and where it was preached with success, to the conversion of many of them, and therefore had reason to join in this new song; see Acts 11:19 or such that went by sea to distant parts, on purpose to publish the Gospel, as Paul, Barnabas, Silas, and Timothy; and who, succeeding in their work, had reason to rejoice; see Acts 13:4, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ye that go down into the sea; in ships, that trade by sea; such as the Phoenicians, Tyrians, and Sidonians, to whom the Gospel came, and where it was preached with success, to the conversion of many of them, and therefore had reason to join in this new song; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or such that went by sea to distant parts, on purpose to publish the Gospel, as Paul, Barnabas, Silas, and Timothy; and who, succeeding in their work, had reason to rejoice; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 13:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and all that is therein: or \"the fulness of it\" (s); meaning not the fishes in it, but the islands of it, as next explained: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the isles, and the inhabitants thereof; as Cyprus, Crete, and other isles, which heard the joyful sound of the Gospel, and embraced it, Acts 13:4, and, as the sea often denotes the western part of the world from Judea, this may design the European parts of it, and the islands in it, particularly ours of Great Britain and Ireland, whither the Gospel came very early. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the isles, and the inhabitants thereof; as Cyprus, Crete, and other isles, which heard the joyful sound of the Gospel, and embraced it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 13:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and, as the sea often denotes the western part of the world from Judea, this may design the European parts of it, and the islands in it, particularly ours of Great Britain and Ireland, whither the Gospel came very early. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) \"et plenitudo ejus\", Munster, Pagainus, Montanus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s) \"et plenitudo ejus\", Munster, Pagainus, Montanus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Sing unto the LORD a new song, and his praise from the end of the earth, ye that go down to the sea, and all that is therein; the isles, and the inhabitants thereof.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10–13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The mention of “new things” in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 42:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " suggests this “new song,” in which the creation is called to celebrate Jehovah’s redemption of His people. The expression is common in the Psalms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 96:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 149:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These Psalmists probably borrowed the term from our prophet, whose use of it bears the stamp of originality. It is a song “such as has never been heard in the heathen world” (Delitzsch). see ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:14-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the end of the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] means (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") “from end to end.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye that go down to the sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "seafarers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is some awkwardness in the following words: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and all that is therein",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (lit. “and the fulness thereof”), which are naturally parallel to “the sea” and not to “those who go down to it.” The harshness is removed by a plausible emendation of Lowth, who reads the whole clause in accordance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 96:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "let the sea roar and the fulness thereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "יִרְעם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "יו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "̇",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "רְדֵי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the isles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The mention of the sea and its coasts before the land is one indication of the prominence which the western lands have in the mind of this prophet.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Sing unto the Lord a new song",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The call for a \"new song\" is based upon the ground that the mercy vouchsafed was a \"new\" one (see ver. 9). The expression is frequent in the Psalms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 96:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 149:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His praise from the end of the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"let his praise be sung by all the inhabitants of the earth to its remotest bounds.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Sea and land are called upon equally to proclaim God's praise; the sea, \"and its fulness\" (margin) - those who frequent it in ships, and those who dwell on its shores and islands. The last clause, \"the isles and the inhabitants thereof,\" is exegetical of the preceding one - \" all that is therein.\" Isaiah 42:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prediction of these \"new things,\" which now follows, looks away from all human mediation. They are manifestly the work of Jehovah Himself, and consist primarily in the subjugation of His enemies, who are holding His people in captivity. \"Sing ye to Jehovah a new song, His praise from the end of the earth, ye navigators of the sea, and its fulness; ye islands, and their inhabitants. Let the desert and the cities thereof strike up, the villages that Kedar doth inhabit; the inhabitants of the rock-city may rejoice, shout from the summits of the mountains. Let them give glory to Jehovah, and proclaim His praise in the islands. Jehovah, like a hero will He go forth, kindle jealousy like a man of war; He will breath forth into a war-cry, a yelling war-cry, prove Himself a hero upon His enemies.\" The \"new things\" furnish the impulse and materials of \"a new song,\" such as had never been heard in the heathen world before. This whole group of vv. is like a variation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The standing-place, whence the summons is uttered, is apparently Ezion-geber, at the head of the Elanitic Gulf, that seaport town from which in the time of the kings the news of the nations reached the Holy Land through the extensive commerce of Israel. From this point the eye stretches to the utmost circle of the earth, and then returns from the point where it meets with those who \"go down to the sea,\" i.e., who navigate the ocean which lies lower than the solid ground. These are to sing, and everything that lives and moves in the sea is to join in the sailors' song. The islands and coast lands, that are washed by the sea, are likewise to sing together with their inhabitants. After the summons has drawn these into the net of the song of praise, it moves into the heart of the land. The desert and its cities are to lift up (viz., \"their voice\"), the villages which Kedar inhabits. The reference to Sela', the rock-city of Edomitish Nabataea, which is also mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the Wadi Musa, which is still celebrated for its splendid ruins), shows by way of example what cities are intended. Their inhabitants are to ascend the steep mountains by which the city is surrounded, and to raise a joyful cry (yitsvâchū, to cry out with a loud noise; cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Along with the inhabitants of cities, the stationary Arabs, who are still called Hadariye in distinction from Wabariye, the Arabs of the tents, are also summoned; hadar (châtsēr) is a fixed abode, in contrast to bedû, the steppe, where the tents are pitched for a short time, now in one place and now in another. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the summons becomes more general. The subject is the heathen universally and in every place; they are to give Jehovah the glory (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and declare His praise upon the islands, i.e., to the remotest ends of the whole world of nations. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there follows the reason for this summons, and the theme of the new song in honour of the God of Israel, viz., His victory over His enemies, the enemies of His people. The description is anthropomorphically dazzling and bold, such as the self-assurance and vividness of the Israelitish idea of God permitted, without any danger of misunderstanding. Jehovah goes out into the conflict like a hero; and like a \"man of war,\" i.e., like one who has already fought many battles, and is therefore ready for war, and well versed in warfare, He stirs up jealousy (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). His jealousy has slumbered as it were for a long time, as if smouldering under the ashes; but now He stirs it up, i.e., makes it burn up into a bright flame. Going forward to the attack, יריע, \"He breaks out into a cry,\" אף־יצריח, \"yea, a yelling cry\" (kal ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to cry with a yell; hiphil, to utter a yelling cry). In the words, \"He will show Himself as a hero upon His enemies,\" we see Him already engaged in the battle itself, in which He proves Himself to possess the strength and boldness of a hero (hithgabbar only occurs again in the book of Job). The overthrow which heathenism here suffers at the hand of Jehovah is, according to our prophet's view, the final and decisive one. The redemption of Israel, which is thus about to appear, is redemption from the punishment of captivity, and at the same time from all the troubles that arise from sin. The period following the captivity and the New Testament times here flow into one. ",
        "children": []
      }
    ]
  }
]