[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:5-12 The work of redemption brings back man to the obedience he owes to God as his Maker. Christ is the light of the world. And by his grace he opens the understandings Satan has blinded, and sets at liberty from the bondage of sin. The Lord has supported his church. And now he makes new promises, which shall as certainly be fulfilled as the old ones were. When the Gentiles are brought into the church, he is glorified in them and by them. Let us give to God those things which are his, taking heed that we do not serve the creature more than the Creator.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let the wilderness - (See the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The word here denotes the most uncultivated countries, intimating that even the most rude and barbarous people would have occasion to rejoin, and would be interested in the mercy of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the cities thereof - To us there seems to be something incongruous in speaking of the 'cities' in a 'wilderness.' But we are to remember that the Hebrews gave the name wilderness or desert to those regions that were mostly uncultivated, or sparsely inhabited. They were places that were chiefly devoted to pasturage, and not cultivated by the plow, or regions of vast plains of sand and far-extended barrenness, with here and there an oasis on which a city might be built. Josephus, speaking of the desert or wilderness lying between Jerusalem and Jericho enumerates several villages or towns in it, showing that though it was mainly a waste, yet that it was not wholly without towns or inhabitants. We are to remember also that large towns or cities for commercial purposes, or thorough fares, were often built in the few fertile or advantageous places which were found in the midst of desert wastes. Thus we are told of Solomon 2 Chronicles 8:4, that 'he built Tadmor in the wilderness;' and we know that Palmyra, and Bozrah, and Sela, were large cities that were built in the midst of regions that were generally to be regarded as deserts, or wastes.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the cities thereof - To us there seems to be something incongruous in speaking of the 'cities' in a 'wilderness.' But we are to remember that the Hebrews gave the name wilderness or desert to those regions that were mostly uncultivated, or sparsely inhabited. They were places that were chiefly devoted to pasturage, and not cultivated by the plow, or regions of vast plains of sand and far-extended barrenness, with here and there an oasis on which a city might be built. Josephus, speaking of the desert or wilderness lying between Jerusalem and Jericho enumerates several villages or towns in it, showing that though it was mainly a waste, yet that it was not wholly without towns or inhabitants. We are to remember also that large towns or cities for commercial purposes, or thorough fares, were often built in the few fertile or advantageous places which were found in the midst of desert wastes. Thus we are told of Solomon ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that 'he built Tadmor in the wilderness;' and we know that Palmyra, and Bozrah, and Sela, were large cities that were built in the midst of regions that were generally to be regarded as deserts, or wastes.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The villages that Kedar doth inhabit - Where the inhabitants of Kedar dwell. Kedar was a son of Ishmael Genesis 25:13, the father of the Kedarenians or Cedrei, mentioned by Pliny (Nat. Hist. v. 2), who dwell in the vicinity of the Nabathaeans in Arabia Deserta. They often changed their place, though it would seem that they usually dwelt in the neighborhood of Petra, or Sela. The name Kedar is often given to Arabia Deserta, and the word may in some instances denote Arabia in general. The inhabitants of those countries usually dwell in tents, and lead a nomadic and wandering life.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The villages that Kedar doth inhabit - Where the inhabitants of Kedar dwell. Kedar was a son of Ishmael ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the father of the Kedarenians or Cedrei, mentioned by Pliny (Nat. Hist. v. 2), who dwell in the vicinity of the Nabathaeans in Arabia Deserta. They often changed their place, though it would seem that they usually dwelt in the neighborhood of Petra, or Sela. The name Kedar is often given to Arabia Deserta, and the word may in some instances denote Arabia in general. The inhabitants of those countries usually dwell in tents, and lead a nomadic and wandering life.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Let the inhabitants of the rock sing - It is uncertain whether the word 'rock' here (Hebrew, סלע  sela‛, Greek Πέτραν  Petran, 'Petra' or 'rock') is to be regarded as a proper name, or to denote in a general sense those who dwell in the rocky part of Arabia. Sela, or Petra, was the name of the celebrated city that was the capital of Idumea (see the notes at Isaiah 16:1); and the connection here would rather lead us to suppose that this city was intended here, and that the inhabitants of the capital were called upon to join with the dwellers in the surrounding cities and villages in celebrating the goodness of God. But it may denote in general those who inhabited the desolate and stony region of Arabia Petrea, or whose home was among the cliffs of the rocks. If so, it is a call upon Arabia in general to rejoice in the mercy of God, and to give glory to him for providing a plan of redemption - an intimation that to the descendants of Ishmael the blessings of the gospel would be extended.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Let the inhabitants of the rock sing - It is uncertain whether the word 'rock' here (Hebrew, סלע  sela‛, Greek Πέτραν  Petran, 'Petra' or 'rock') is to be regarded as a proper name, or to denote in a general sense those who dwell in the rocky part of Arabia. Sela, or Petra, was the name of the celebrated city that was the capital of Idumea (see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the connection here would rather lead us to suppose that this city was intended here, and that the inhabitants of the capital were called upon to join with the dwellers in the surrounding cities and villages in celebrating the goodness of God. But it may denote in general those who inhabited the desolate and stony region of Arabia Petrea, or whose home was among the cliffs of the rocks. If so, it is a call upon Arabia in general to rejoice in the mercy of God, and to give glory to him for providing a plan of redemption - an intimation that to the descendants of Ishmael the blessings of the gospel would be extended.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Let them shout from the top of the mountains - They who had taken refuge there, or who had made their permanent abode there. Vitringa supposes that the mountains of Paran are meant, which are situated on the north of Mount Sinai. The idea in the verse is, that all the dwellers in Arabia would celebrate the goodness of God, and join in praising him for his mercy in giving a deliverer. They were yet to partake of the benefits of his coming, and to have occasion of joy at his advent. It is possible that Cowper may have had this passage in his eye in the following description of the final and universal prevalence of the gospel:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The dwellers in the vales and on the rocks,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shout to each other, sad the mountain-tops,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From distant mountains catch the flying joy:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Till nation after nation taught the strain,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Earth rolls the rapturous hosannas round.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Task. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Task. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. cities—in a region not wholly waste, but mainly so, with an oasis here and there.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Kedar—in Arabia-Deserta (Isa 21:16; Ge 25:13). The Kedarenians led a nomadic, wandering life. So Kedar is here put in general for that class of men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "rock—Sela, that is, Petra, the metropolis of Idumea and the Nabathœan Ishmaelites. Or it may refer in general to those in Arabia-Petræa, who had their dwellings cut out of the rock.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the mountains—namely, of Paran, south of Sinai, in Arabia-Petræa [Vitringa].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The wilderness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those parts of the world which are now like a wilderness; not literally, for he speaks of their cities in the next clause, but spiritually, desolate and forsaken of God, dry and destitute of the waters of God’s grace, and barren of all good fruits. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Kedar; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Arabians; which were a heathenish and barbarous people, and well known to the Jews, and are synecdochically put for all nations in the same circumstances. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let the inhabitants of the rock sing, let them shout from the top of the mountains:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " having mentioned cities and villages, he now adds those who dwell upon rocks and mountains, which are commonly more savage and ignorant than others, and therefore harder to be taught and reformed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let the wilderness and the cities thereof lift up their voice,.... The eastern part of the world, Arabia Deserta, and the inhabitants of the cities which were in it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the villages that Kedar doth inhabit; or the \"courts\" (t), or tents, the Kedarenes inhabited, who were Arabians, and dwelt in tents, which they pitched here and there, for the convenience of their flocks; and so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the Arabians that inhabit the wilderness shall praise:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "let the inhabitants of the rock sing: or of Petra, which Jerom says was a city of Palestine. It was the metropolis of Arabia Petraea, which whole country may be here meant, and the inhabitants of it, who had reason to sing for joy, when the Gospel was preached unto them; as it was by the Apostle Paul in Arabia, Galatians 1:17, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "let the inhabitants of the rock sing: or of Petra, which Jerom says was a city of Palestine. It was the metropolis of Arabia Petraea, which whole country may be here meant, and the inhabitants of it, who had reason to sing for joy, when the Gospel was preached unto them; as it was by the Apostle Paul in Arabia, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "let them shout from the top of the mountains; the wild, savage, and barbarous people that dwell there, but now become civilized, as well as evangelized, by the Gospel; or the messengers and ministers of the word, whose feet on those mountains were beautiful, bringing the good tidings of peace and salvation by Christ. The Targum interprets this of the resurrection of the dead, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the dead, when they shall go out of the house of their world, from the tops of the mountains shall lift up their voice (u).'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) \"atria\", Montanus; \"tentoria\", Grotius. (u) Ben Melech interprets the rocks and mountains of towers built on rocks and mountains, where men dwelt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) \"atria\", Montanus; \"tentoria\", Grotius. (u) Ben Melech interprets the rocks and mountains of towers built on rocks and mountains, where men dwelt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Let the wilderness and its cities lift up their voice, the villages that {q} Kedar doth inhabit: let the inhabitants of the rock sing, let them shout from the top of the mountains.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Let the wilderness and its cities lift up ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "their voice",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the villages ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Kedar doth inhabit: let the inhabitants of the rock sing, let them shout from the top of the mountains.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Meaning, the Arabians, under whom he comprehends all the people of the East.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the wilderness and the cities thereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The “cities,” like the “villages” of the next line, are those in the oases, occupied by the settled Arabs; the former are probably the great centres of the caravan trade, like Tadmor and Petra. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Kedar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 21:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is sometimes referred to as a tribe of nomadic, tent-dwelling Arabs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 120:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.); here they are villagers, what the modern Arabs call ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ḥaḍarîya",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (connected with the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ḥâc̨çr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", used here) as opposed to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wabarîya",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or nomads (Delitzsch). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Kedar stands, as here, in opposition to the Mediterranean countries.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the inhabitants of the rock",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] (i.e. “the rock-dwellers”). R.V. has “the inhabitants of Sela,” which would probably be Petra. It is difficult to say which translation is preferable. It should be mentioned that the identification of Sela, in any O.T. passage, with Petra is resisted by many scholars (see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "exult",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",—a different word at any rate from that used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 42:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The wilderness and the cities thereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The desert had its cities, built on some more or less fertile oases, where at any rate water was procurable. Instances of such cities are Tudmor, Petra, Kadesh (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Its villages were probably collections of tents, which were moved from time to time, since the Beni-Kedar were nomads (ch. 21:16; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 120:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The call is upon both the stationary and the wandering inhabitants of the Syro-Arabian desert to join in the song of praise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The inhabitants of the rock",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the iahabitants of Sela",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Petra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the rock-city, which was the capital of Idumaea, or Edom (see the comment on ch. 16. l). It is assumed that the return of the Israelites to their land ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ought",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to be a subject of rejoicing to all their neighbours. Isaiah 42:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prediction of these \"new things,\" which now follows, looks away from all human mediation. They are manifestly the work of Jehovah Himself, and consist primarily in the subjugation of His enemies, who are holding His people in captivity. \"Sing ye to Jehovah a new song, His praise from the end of the earth, ye navigators of the sea, and its fulness; ye islands, and their inhabitants. Let the desert and the cities thereof strike up, the villages that Kedar doth inhabit; the inhabitants of the rock-city may rejoice, shout from the summits of the mountains. Let them give glory to Jehovah, and proclaim His praise in the islands. Jehovah, like a hero will He go forth, kindle jealousy like a man of war; He will breath forth into a war-cry, a yelling war-cry, prove Himself a hero upon His enemies.\" The \"new things\" furnish the impulse and materials of \"a new song,\" such as had never been heard in the heathen world before. This whole group of vv. is like a variation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The standing-place, whence the summons is uttered, is apparently Ezion-geber, at the head of the Elanitic Gulf, that seaport town from which in the time of the kings the news of the nations reached the Holy Land through the extensive commerce of Israel. From this point the eye stretches to the utmost circle of the earth, and then returns from the point where it meets with those who \"go down to the sea,\" i.e., who navigate the ocean which lies lower than the solid ground. These are to sing, and everything that lives and moves in the sea is to join in the sailors' song. The islands and coast lands, that are washed by the sea, are likewise to sing together with their inhabitants. After the summons has drawn these into the net of the song of praise, it moves into the heart of the land. The desert and its cities are to lift up (viz., \"their voice\"), the villages which Kedar inhabits. The reference to Sela', the rock-city of Edomitish Nabataea, which is also mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the Wadi Musa, which is still celebrated for its splendid ruins), shows by way of example what cities are intended. Their inhabitants are to ascend the steep mountains by which the city is surrounded, and to raise a joyful cry (yitsvâchū, to cry out with a loud noise; cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Along with the inhabitants of cities, the stationary Arabs, who are still called Hadariye in distinction from Wabariye, the Arabs of the tents, are also summoned; hadar (châtsēr) is a fixed abode, in contrast to bedû, the steppe, where the tents are pitched for a short time, now in one place and now in another. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the summons becomes more general. The subject is the heathen universally and in every place; they are to give Jehovah the glory (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and declare His praise upon the islands, i.e., to the remotest ends of the whole world of nations. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there follows the reason for this summons, and the theme of the new song in honour of the God of Israel, viz., His victory over His enemies, the enemies of His people. The description is anthropomorphically dazzling and bold, such as the self-assurance and vividness of the Israelitish idea of God permitted, without any danger of misunderstanding. Jehovah goes out into the conflict like a hero; and like a \"man of war,\" i.e., like one who has already fought many battles, and is therefore ready for war, and well versed in warfare, He stirs up jealousy (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). His jealousy has slumbered as it were for a long time, as if smouldering under the ashes; but now He stirs it up, i.e., makes it burn up into a bright flame. Going forward to the attack, יריע, \"He breaks out into a cry,\" אף־יצריח, \"yea, a yelling cry\" (kal ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to cry with a yell; hiphil, to utter a yelling cry). In the words, \"He will show Himself as a hero upon His enemies,\" we see Him already engaged in the battle itself, in which He proves Himself to possess the strength and boldness of a hero (hithgabbar only occurs again in the book of Job). The overthrow which heathenism here suffers at the hand of Jehovah is, according to our prophet's view, the final and decisive one. The redemption of Israel, which is thus about to appear, is redemption from the punishment of captivity, and at the same time from all the troubles that arise from sin. The period following the captivity and the New Testament times here flow into one. ",
        "children": []
      }
    ]
  }
]