[{"num":17,"verse":"¶ And the LORD spoke unto Moses, saying,"},{"num":2,"verse":"Speak unto Aaron and unto his sons and unto all the sons of Israel and say unto them: This is what the LORD has commanded, saying,"},{"num":3,"verse":"any man of the house of Israel that kills an ox or lamb or goat in the camp or that kills it out of the camp"},{"num":4,"verse":"and does not bring it unto the door of the tabernacle of the testimony to offer an offering unto the LORD before the tabernacle of the LORD, blood shall be imputed unto that man; he has shed blood, and that man shall be cut off from among his people:"},{"num":5,"verse":"to the end that the sons of Israel may bring their sacrifices which they sacrifice in the open field, even that they may bring them unto the LORD unto the door of the tabernacle of the testimony, unto the priest and sacrifice sacrifices of peace unto the LORD."},{"num":6,"verse":"And the priest shall sprinkle the blood upon the altar of the LORD at the door of the tabernacle of the testimony and incense the fat in a very acceptable aroma unto the LORD."},{"num":7,"verse":"And they shall never again offer their sacrifices unto devils, after whom they fornicate. They shall have this as a perpetual statute throughout their ages."},{"num":8,"verse":"And thou shalt also say unto them: Any man of the house of Israel or of the strangers who sojourn among you that offers a burnt offering or sacrifice"},{"num":9,"verse":"and does not bring it unto the door of the tabernacle of the testimony to offer it unto the LORD, even that man shall be cut off from among his people."},{"num":10,"verse":"¶ And any man of the house of Israel or of the strangers that sojourn among you that eats any blood at all, I will set my face against that person that eats blood and will cut them off from among his people."},{"num":11,"verse":"For the soul (or life) of the flesh is in the blood, and I have given it to you to reconcile your persons (or souls) upon the altar; therefore the same blood reconciles the person."},{"num":12,"verse":"Therefore I have said unto the sons of Israel: No person of you shall eat blood; neither shall any stranger that sojourns among you eat blood."},{"num":13,"verse":"And any man of the sons of Israel or of the strangers that sojourn among you who hunts and catches any beast or fowl that may be eaten, he shall pour out its blood and cover it with dust."},{"num":14,"verse":"For the soul of all flesh, its life, is in its blood; therefore, I have said unto the sons of Israel, Ye shall not eat the blood of any flesh, for the soul (or the life) of all flesh is its blood; whoever eats it shall be cut off."},{"num":15,"verse":"And any person that eats that which died of itself or that which was torn by beasts whether it is a natural of your own country or a stranger, he shall both wash his clothes and bathe himself in water and be unclean until the evening; then he shall be clean."},{"num":16,"verse":"But if he washes them not, nor bathes his flesh; then he shall bear his iniquity."}]