[{"header":"Blood Must Not Be Eaten"},{"num":17,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Say to Aaron and his sons and to all the people of Israel, ‘This is what the Lord has told us to do. "},{"num":3,"verse":"If any man of the house of Israel kills a bull, lamb or goat, among the tents or away from the tents, "},{"num":4,"verse":"and has not brought it to the door of the meeting tent to give it to the Lord, he will be guilty for that blood, and will not be among God’s people. "},{"num":5,"verse":"The reason is so that the people of Israel may bring their gifts which were killed in the open field to the Lord, to the religious leader at the door of the meeting tent. Then they can be given as peace gifts to the Lord. "},{"num":6,"verse":"The religious leader will put the blood on the altar of the Lord at the door of the meeting tent. And he will burn the fat for a pleasing smell to the Lord. "},{"num":7,"verse":"So they will no longer give their gifts to the goat-like gods to whom they sell themselves. This will be a Law to them for all their people forever.’"},{"num":8,"verse":"“Then say to them, ‘Any man of the house of Israel, or visiting from another land, who gives a burnt gift or other gift, "},{"num":9,"verse":"and does not bring it to the door of the meeting tent to give it to the Lord, will be cut off from his people."},{"num":10,"verse":"‘If any man of the house of Israel, or visiting from another land, eats any blood, I will turn against that person who eats blood, and he will not be among God’s people. "},{"num":11,"verse":"For the life of the flesh is in the blood. I have given it to you on the altar to make your souls free from sin. For the blood makes you free from sin because of the life in it.’ "},{"num":12,"verse":"So I have said to the people of Israel, ‘None of you should eat blood. And the man who visits you from another land should not eat blood.’ "},{"num":13,"verse":"If any man from the people of Israel, or from other people living among them, catches an animal or bird which may be eaten, he should pour out its blood and cover it with dust."},{"num":14,"verse":"“For blood is the life of every living thing. So I said to the people of Israel, ‘Do not eat the blood of any living thing. For the life of every living thing is its blood. Whoever eats it will be cut off.’ "},{"num":15,"verse":"Every person, both living in the land or one who has come from another land, who eats an animal that dies or is killed by wild animals, must wash his clothes and wash himself in water. He will be unclean until evening. Then he will be clean. "},{"num":16,"verse":"But if he does not wash them or wash his body, he will suffer for his own sin.”"}]