[{"num":14,"verse":"You are the children of the Lord your God."},{"num":2,"verse":"because you are set apart as holy people for the Lord your God, and the Lord your God has chosen you out of all the people that are on the face of the earth, to be his people that are his treasured possession."},{"header":"Clean and Unclean Foods"},{"num":3,"verse":"Do not eat any detestable thing."},{"num":4,"verse":"These are the animals that you may eat: cattle, sheep, and goats; "},{"num":5,"verse":"deer, gazelle, roebuck, wild goat, ibex, antelope, and mountain sheep. "},{"num":6,"verse":"Every animal that has divided hoofs with splits in the middle and that rechews its food among the animals—you may eat them."},{"num":7,"verse":"But these you are not to eat from among those that either rechew their food or have divided hoofs with splits in the middle: the camel, the hare, and the rock badger, because even though they rechew their food, their hoofs are not divided. They are unclean for you. "},{"num":8,"verse":"The pig, because it has divided hoofs but does not rechew its food, is unclean for you. You are not to eat their flesh and you are not to touch their carcasses."},{"num":9,"verse":"These you may eat of all the creatures that live in the water: Any that have fins and scales you may eat. "},{"num":10,"verse":"Any that do not have fins and scales you are not to eat. They are unclean for you."},{"num":11,"verse":"Any clean bird you may eat. "},{"num":12,"verse":"But you are not to eat the following: the eagle, the black vulture, and the bearded vulture, "},{"num":13,"verse":"the red kite, the black kite, and falcons of every kind, "},{"num":14,"verse":"ravens and crows of every kind, "},{"num":15,"verse":"the eagle owl, the short-eared owl, the long-eared owl, all species of hawks, "},{"num":16,"verse":"the tawny owl, the fisher owl, the screech owl, "},{"num":17,"verse":"the white owl, and the scops owl, the osprey, "},{"num":18,"verse":"the stork and herons of every kind, the hoopoe, and the bat. "},{"num":19,"verse":"Any swarming insect that flies is unclean for you. None of them are to be eaten. "},{"num":20,"verse":"Any clean winged creature you may eat."},{"num":21,"verse":"Do not eat the carcass of any animal that is found dead. You may give it to the alien who resides in your town, and he may eat it or sell it to a foreigner, but you are a people who are set apart as holy for the Lord your God."},{"header":"Tithes"},{"num":22,"verse":"Give a tenth of all the yield from your seed that comes out of the field every year."},{"num":23,"verse":"Eat the tithe in the presence of the Lord your God in the place that he will choose to establish his name—the tenth of your grain, your new wine, and your fresh oil, as well as the firstborn of your herd and flock, so that you may learn to fear the Lord your God always."},{"num":24,"verse":"When the Lord your God blesses you, if the distance of your journey is so long that you cannot carry the tithe with you, because the place that the Lord your God will choose to establish his name is far away from you, "},{"num":25,"verse":"then you may exchange the tithe for silver and take the silver in your hand and travel to the place that the Lord your God will choose for himself. "},{"num":26,"verse":"There exchange the silver for anything that you desire—animals from the herd or the flock, or wine or beer, or anything that you may want. Then eat it there before the Lord your God and rejoice, both you and your household."},{"num":27,"verse":"But you must not neglect the Levites who reside within the gates of your cities, because they do not have an allotted inheritance among you. "},{"num":28,"verse":"At the end of every third year, bring out the entire tithe of your produce from that year and store it in your towns. "},{"num":29,"verse":"Then the Levites may come, because they do not have an allotted inheritance among you, and also the aliens and the fatherless and the widows within your towns, and they may eat and be satisfied, so that the Lord your God may bless you in all the work that your hands perform."}]