[{"header":"God’s Special People"},{"num":14,"verse":"You are the children of the Lord your God. When someone dies, do not cut yourselves or shave your heads to show your sadness. "},{"num":2,"verse":"You are holy people. You belong to the Lord your God. He has chosen you from all the people on earth to be his very own."},{"num":3,"verse":"Do not eat anything the Lord hates. "},{"num":4,"verse":"These are the animals you may eat: ox, sheep, goats, "},{"num":5,"verse":"deer, gazelle, roe deer, wild goats, ibex, antelope and mountain sheep. "},{"num":6,"verse":"You may eat any animal that has a split hoof and chews the cud. "},{"num":7,"verse":"But you may not eat camels, rabbits or rock badgers. These animals chew the cud, but their feet are not divided. So they are unclean for you. "},{"num":8,"verse":"Pigs are also unclean for you. They have split hooves, but they do not chew the cud. Do not eat their meat or touch their dead bodies."},{"num":9,"verse":"There are many things that live in the water. You may eat anything that has fins and scales. "},{"num":10,"verse":"But do not eat anything that does not have fins and scales. It is unclean for you."},{"num":11,"verse":"You may eat any clean bird. "},{"num":12,"verse":"But do not eat these birds: eagles, vultures, black vultures, "},{"num":13,"verse":"red kites, falcons, any kind of kite, "},{"num":14,"verse":"any kind of raven, "},{"num":15,"verse":"horned owls, screech owls, seagulls, any kind of hawk, "},{"num":16,"verse":"little owls, great owls, white owls, "},{"num":17,"verse":"desert owls, ospreys, cormorants, "},{"num":18,"verse":"storks, any kind of heron, the hoopoes or bats."},{"num":19,"verse":"All insects with wings are unclean for you. Do not eat them. "},{"num":20,"verse":"Other things with wings are clean. You may eat them."},{"num":21,"verse":"Do not eat anything you find that is already dead. You may give it to a foreigner living in your town. He may eat it. Or you may sell it to a foreigner. But you are holy people. You belong to the Lord your God."},{"header":"Giving One-Tenth"},{"num":22,"verse":"Be sure to save one-tenth of all your crops each year. "},{"num":23,"verse":"Take it to the place the Lord your God will choose where he is to be worshiped. There you will be together with the Lord. There eat the tenth of your grain, new wine and oil. And eat the animals born first to your herds and flocks. Then you will learn to respect the Lord your God always. "},{"num":24,"verse":"But the place the Lord will choose to be worshiped might be too far away. And he may have blessed you so much you cannot carry a tenth. "},{"num":25,"verse":"If so, exchange your one-tenth for silver. Then take the silver with you to the place the Lord your God shall choose. "},{"num":26,"verse":"Use the silver to buy anything you wish. You may buy cattle, sheep, wine, beer or anything you wish. Then you and your family will eat and celebrate there before the Lord your God. "},{"num":27,"verse":"Do not forget the Levites in your town. They have no land of their own among you."},{"num":28,"verse":"At the end of every third year, everyone should bring one-tenth of that year’s crop. Store it in your towns. "},{"num":29,"verse":"This is for the Levites so they may eat and be full. (They have no land of their own among you.) It is also for strangers, orphans and widows who live in your towns. All of them may eat and be full. Then the Lord your God will bless you and all the work you do."}]