[{"num":1,"verse":"You are children of God, your God, so don’t mutilate your bodies or shave your heads in funeral rites for the dead. You only are a people holy to God, your God; God chose you out of all the people on Earth as his cherished personal treasure."},{"num":3,"verse":"Don’t eat anything abominable. These are the animals you may eat: ox, sheep, goat, deer, gazelle, roebuck, wild goat, ibex, antelope, mountain sheep—any animal that has a cloven hoof and chews the cud. But you may not eat camels, rabbits, and rock badgers because they chew the cud but they don’t have a cloven hoof—that makes them ritually unclean. And pigs: Don’t eat pigs—they have a cloven hoof but don’t chew the cud, which makes them ritually unclean. Don’t even touch a pig’s carcass."},{"num":9,"verse":"This is what you may eat from the water: anything that has fins and scales. But if it doesn’t have fins or scales, you may not eat it. It’s ritually unclean."},{"num":11,"verse":"You may eat any ritually clean bird. These are the exceptions, so don’t eat these: eagle, vulture, black vulture, kite, falcon, the buzzard family, the raven family, ostrich, nighthawk, the hawk family, little owl, great owl, white owl, pelican, osprey, cormorant, stork, the heron family, hoopoe, bat."},{"num":19,"verse":"Winged insects are ritually unclean; don’t eat them. But ritually clean winged creatures are permitted."},{"num":21,"verse":"Because you are a people holy to God, your God, don’t eat anything that you find dead. You can, though, give it to a foreigner in your neighborhood for a meal or sell it to a foreigner."},{"num":22,"verse":"Make an offering of ten percent, a tithe, of all the produce which grows in your fields year after year. Bring this into the Presence of God, your God, at the place he designates for worship and there eat the tithe from your grain, wine, and oil and the firstborn from your herds and flocks. In this way you will learn to live in deep reverence before God, your God, as long as you live. But if the place God, your God, designates for worship is too far away and you can’t carry your tithe that far, God, your God, will still bless you: exchange your tithe for money and take the money to the place God, your God, has chosen to be worshiped. Use the money to buy anything you want: cattle, sheep, wine, or beer—anything that looks good to you. You and your family can then feast in the Presence of God, your God, and have a good time."},{"num":27,"verse":"Meanwhile, don’t forget to take good care of the Levites who live in your towns; they won’t get any property or inheritance of their own as you will."},{"num":28,"verse":"At the end of every third year, gather the tithe from all your produce of that year and put it aside in storage. Keep it in reserve for the Levite who won’t get any property or inheritance as you will, and for the foreigner, the orphan, and the widow who live in your neighborhood. That way they’ll have plenty to eat and God, your God, will bless you in all your work."}]