[{"header":"Chapter 14"},{"num":1,"verse":"You are the children of the Lord, your God. Do not slash yourselves nor shave the front of your heads on account of the dead."},{"num":2,"verse":"You are a people who are holy to the Lord, your God, and the Lord has picked you out from among all the peoples on the earth to be a chosen people."},{"num":3,"verse":"Clean and Unclean Food. You are not to eat any abominable thing."},{"num":4,"verse":"These are the animals that you can eat: the ox, the sheep, the goat,"},{"num":5,"verse":"the gazelle, the roebuck, the deer, the wild goat, the antelope, the wild ox, and the mountain sheep."},{"num":6,"verse":"Every animal that has a cleft hoof, its hoof is divided in two parts, and that chews its cud is an animal that you can eat."},{"num":7,"verse":"However, there are animals that chew their cud, or that have a cleft hoof that you cannot eat: the camel, the hare, and the rock badger, for they chew their cud but do not have a cleft hoof, so they are unclean for you."},{"num":8,"verse":"Likewise, pigs have a cleft hoof, but they do not chew their cud, so they are unclean for you. You are not to eat their meat, nor even touch their dead carcasses."},{"num":9,"verse":"You can eat any water creature that has fins and scales; those you can eat."},{"num":10,"verse":"Whatever does not have fins or scales, you are not to eat. It is unclean for you."},{"num":11,"verse":"You can eat any clean bird."},{"num":12,"verse":"These are the birds you shall not eat: the eagle, the bearded vulture, the osprey,"},{"num":13,"verse":"the hawk, the kite, any type of vulture,"},{"num":14,"verse":"any kind of raven,"},{"num":15,"verse":"the owl, the night hawk, the gull, any type of falcon,"},{"num":16,"verse":"the little owl, the great owl, the barn owl,"},{"num":17,"verse":"the desert owl, the carrion vulture, the cormorant,"},{"num":18,"verse":"the stork, any type of heron, the hoopoe, and the bat."},{"num":19,"verse":"Every type of flying insect is unclean for you. You shall not eat it,"},{"num":20,"verse":"but you can eat any type of clean bird."},{"num":21,"verse":"Do not eat anything that died on its own. You can give it to a foreigner who is living in your town, and he can eat it, or you can sell it to a foreigner. But you are a people who are holy to the Lord, your God. You shall not eat a kid goat boiled in its mother’s milk."},{"num":22,"verse":"Tithes.Each year you are to tithe the yield of your seed that has grown in the field."},{"num":23,"verse":"This is what you shall eat in the presence of the Lord, your God, in the place that he has established that his name be placed: the tithe of your grain, wine, and oil, the firstborn of your herd and flock. This will be a lesson to fear the Lord, your God, always."},{"num":24,"verse":"If the distance is so great that you cannot carry it to the place that the Lord, your God, has chosen to set his name, and the Lord, your God, has blessed you,"},{"num":25,"verse":"then you shall exchange it for money, and carry the money to the place that the Lord, your God, has chosen."},{"num":26,"verse":"You can use that money to buy whatever you wish, oxen, or sheep, or wine, or strong drink, whatever you wish. You and your family will consume it in the presence of the Lord, your God, and you will rejoice."},{"num":27,"verse":"You are not to neglect the Levite who lives in your town, for he has no portion or inheritance among you."},{"num":28,"verse":"Every third year you are to bring all of your tithes from your produce for that year and you will deposit them in your town."},{"num":29,"verse":"The Levite, who has no portion nor inheritance among you, the foreigner, the orphan, and the widow who live in your town will consume it until they are full. Thus, the Lord, your God, will bless you in every endeavor you pursue."}]