[{"num":14,"verse":"Ye are the bnei Hashem Eloheichem; ye shall not cut yourselves, nor make any baldness between your eyes for the dead."},{"num":2,"verse":"For thou art an Am Kadosh unto Hashem Eloheicha, and Hashem hath chosen thee to be an Am Segullah (treasured people) unto Himself, above kol haamim that are upon ha’adamah."},{"num":3,"verse":"Thou shalt not eat any to’evah (detestable thing)."},{"num":4,"verse":"These are the beasts which ye shall eat: the shor, the seh, and the izzim,"},{"num":5,"verse":"The deer, and the gazelle, and the yachmur, and the akko, and the antelope, and the wild ox, and the wild goat."},{"num":6,"verse":"And every beast that parteth the hoof, and is separated in two hooves, and cheweth the cud among the beasts, that ye shall eat."},{"num":7,"verse":"Nevertheless, these ye shall not eat of them that only chew the cud, or of them that only divide the cloven hoof; as the camel, and the hare, and the coney; for they chew the cud, but divide not the hoof; therefore they are tameh (unclean) unto you."},{"num":8,"verse":"And the chazir, because it divideth the hoof, yet cheweth not the cud, it is tameh (unclean) unto you; ye shall not eat of their basar, nor touch their nevelah (dead carcass)."},{"num":9,"verse":"These ye shall eat of all that are in the waters: all that have fins and scales shall ye eat,"},{"num":10,"verse":"And whatsoever hath not fins and scales ye may not eat; it is tameh (unclean) unto you."},{"num":11,"verse":"Of all tahorah (clean) birds ye shall eat."},{"num":12,"verse":"But these are they of which ye shall not eat: the nesher, and the vulture, and the bearded vulture,"},{"num":13,"verse":"And the kite, and the buzzard after its kind,"},{"num":14,"verse":"And every raven after its kind,"},{"num":15,"verse":"And the owl, and the night hawk, and the seagull, and the hawk after its kind,"},{"num":16,"verse":"The little owl, and the great owl, and the horned owl,"},{"num":17,"verse":"And the pelican, and the osprey, and the cormorant,"},{"num":18,"verse":"And the stork, and the heron after its kind, and the hoopoe, and the bat."},{"num":19,"verse":"And every creeping thing that flieth is tameh (unclean) unto you; they shall not be eaten."},{"num":20,"verse":"But of all tahor (clean) fowls ye may eat."},{"num":21,"verse":"Ye shall not eat of anything that dieth of itself; thou shalt give it unto the ger that is in thy she’arim, that he may eat it; or thou mayest sell it unto an alien; for thou art an Am Kadosh unto Hashem Eloheicha. Thou shalt not boil a young goat in its mother’s cholov."},{"num":22,"verse":"Thou shalt truly give ma’aser (tithe) of all the increase of thy zera, that the sadeh bringeth forth year by year."},{"num":23,"verse":"And thou shalt eat before Hashem Eloheicha, in the place which He shall choose to place Shmo there, the ma’aser (tithe) of thy dagan (grain), of thy tirosh (new wine), and of thine yitzhar (fresh oil), and the bekhorot (firstlings) of thy herds and of thy flocks; that thou mayest learn to stand in awe of Hashem Eloheicha always."},{"num":24,"verse":"And if the journey be too long for thee, so that thou art not able to carry it; or if the place be too far from thee, which Hashem Eloheicha shall choose to set Shmo there, when Hashem Eloheicha hath blessed thee;"},{"num":25,"verse":"Then shalt thou exchange it for kesef, and bind up the money in thine hand, and shalt go unto the place which Hashem Eloheicha shall choose;"},{"num":26,"verse":"And thou shalt spend that kesef for whatsoever thy nefesh desireth after, for cattle, or for sheep, or for yayin, or for shekhar (fermented drink), or for whatsoever thy nefesh desireth; and thou shalt eat there before Hashem Eloheicha, and thou shalt rejoice, thou, and thine household,"},{"num":27,"verse":"And the Levi that is within thy she’arim; thou shalt not forsake him; for he hath no chelek nor nachalah with thee."},{"num":28,"verse":"At the end of shalosh shanim thou shalt bring forth all the ma’aser (tithe) of thine increase the same year, and shalt store it up within thy she’arim:"},{"num":29,"verse":"And the Levi (because he hath no chelek nor nachalah with thee) and the ger, and the yatom, and the almanah, which are within thy she’arim, shall come, and shall eat and be satisfied; that Hashem Eloheicha may bless thee in all the work of thine hand which thou doest."}]