[{"header":"Clean Foods for a Holy People"},{"num":14,"verse":"“You are the children of Adonai your God. You are not to cut yourselves or shave your forehead for the dead. "},{"num":2,"verse":"For you are a holy people to Adonai your God—from all the peoples on the face of the earth, Adonai has chosen you to be His treasured people. "},{"num":3,"verse":"You are not to eat any detestable thing. "},{"num":4,"verse":"These are the animals you may eat: the ox, the sheep, the goat, "},{"num":5,"verse":"the deer, the gazelle, the roebuck, the wild goat, the ibex, the antelope, and the mountain sheep. "},{"num":6,"verse":"Among the animals, you may eat any animal that splits the hoof—the hoof completely split in two—and chews the cud. "},{"num":7,"verse":"Yet of those that chew the cud or have a split hoof, you are not to eat the camel, the hare, and the rabbit—because they chew the cud but do not split the hoof, they are unclean to you. "},{"num":8,"verse":"The pig, because it splits the hoof but does not chew the cud, is unclean to you—you are not to eat their meat or touch their carcasses. "},{"num":9,"verse":"Of all that are in the waters, these you may eat: whatever has fins and scales you may eat, "},{"num":10,"verse":"but whatever does not have fins and scales you are not to eat—it is unclean to you. "},{"num":11,"verse":"You may eat all clean birds, "},{"num":12,"verse":"but these are the ones you are not to eat: the eagle, the vulture, the buzzard, "},{"num":13,"verse":"the red kite, the black kite, and any bird of prey of that kind, "},{"num":14,"verse":"every raven of any kind, "},{"num":15,"verse":"the ostrich, the owl, the seagull, a hawk of any kind, "},{"num":16,"verse":"the little owl, the great owl, the white owl, "},{"num":17,"verse":"the pelican, the Egyptian vulture, the cormorant, "},{"num":18,"verse":"the stork, a heron of any kind, the hoopoe, and the bat. "},{"num":19,"verse":"All winged insects are unclean to you—they are not to be eaten. "},{"num":20,"verse":"You may eat any clean bird. "},{"num":21,"verse":"You are not to eat anything that dies of itself. You may give it to the outsider within your gates so that he may eat it or you may sell it to a foreigner. For you are a holy people to Adonai your God. You are not to boil a young goat in its mother’s milk."},{"header":"Tithe and Remember the Levite"},{"num":22,"verse":"“You will surely set aside a tenth of all the yield of your seed that comes from the field year by year. "},{"num":23,"verse":"You are to eat the tithe of your grain, your new wine, your oil, and the firstborn of your herd and flock, before Adonai your God in the place He chooses to make His Name dwell, so that you may learn to fear Adonai your God always. "},{"num":24,"verse":"Now suppose the way is too long for you, for you cannot carry the tithe because the place Adonai your God chooses to set His Name is too far from you. When Adonai your God blesses you, "},{"num":25,"verse":"then you are to exchange the tithe for silver, bind up the silver in your hand, and go to the place that Adonai your God chooses. "},{"num":26,"verse":"You may spend the money for whatever your soul desires—cattle, sheep, wine, strong drink, or whatever your soul asks of you. Then you will eat there before Adonai your God and rejoice—you and your household. "},{"num":27,"verse":"But you are not to neglect the Levite within your gates, for he has no portion or inheritance with you. "},{"num":28,"verse":"At the end of every three years, you are to bring out all the tithe of your produce in that year and store it within your gates. "},{"num":29,"verse":"Then the Levite, because he has no portion or inheritance with you, along with the outsider, the orphan and the widow within your gates, will come and eat and be satisfied, so that Adonai your God may bless you in all the work of your hand that you do."}]