[{"num":4,"verse":"And Ishbosheth, the son of Saul, heard that Abner had fallen down in Hebron; and his hands were discomforted, and all Israel was troubled. (And Ishbosheth, the son of Saul, heard that Abner had been killed in Hebron; and his hands were enfeebled, that is, he was afraid, and all Israel was troubled.)"},{"num":2,"verse":"And two men, princes of (raiding) companies, were to the son of Saul; name to the one was Baanah, and name to the tother was Rechab, the sons of Rimmon (the) Beerothite, of the sons of Benjamin; for also Beeroth is areckoned in Benjamin. (And two men, leaders of raiding parties, were officers for Saul’s son; one was named Baanah, and the other was named Rechab; they were the sons of Rimmon the Beerothite, of the sons of Benjamin, for Beeroth is reckoned as part of Benjamin.)"},{"num":3,"verse":"And men of Beeroth fled into Gittaim; and they were comelings there till to that time. (And the Beerothites had fled to Gittaim; and they had lived there until that time.)"},{"num":4,"verse":"And a son feeble in his feet was to Jonathan, the son of Saul; and he was five years eld, when the messenger came from Saul and Jonathan, from Jezreel, telling that they were dead (and he was five years old, when a message came from Jezreel about Saul and Jonathan, saying that they were dead). Therefore his nurse took him, and fled; and when she hasted to flee, she felled down, and the child was made lame; and the name of the child was Mephibosheth."},{"num":5,"verse":"Therefore Rechab and Baanah, the sons of Rimmon of Beeroth, came, and entered in the hot (of the) day into the house of Ishbosheth, that slept upon his bed at midday; and the woman that kept the doors of the house, (who had been) purging wheat, (now also) slept fast. (And so Rechab and Baanah, the sons of Rimmon of Beeroth, came, and in the heat of the day entered into Ishbosheth’s house, while he slept on his bed at midday; and the woman who kept the doors of the house, had been purging wheat, but now she was also asleep.)"},{"num":6,"verse":"And they came till to the midst of the house, and took wheat; and Rechab, and Baanah, his brother, smote Ishbosheth in the share-bone, and fled. (And they came into the midst of the house, carrying wheat; and Rechab, and his brother Baanah, struck, or stabbed, Ishbosheth in the belly, and then fled.)"},{"num":7,"verse":"Soothly when they had entered into the house, he slept on his bed in a (bed-)closet; and they smited and killed him; and when they had taken [off] his head, they went by the way of desert in all that night. (Yea, when they entered into the house, he slept on his bed in the bed-chamber; and they struck, or stabbed, him and killed him; and when they had cut off his head, they left, and went by the way of the wilderness all that night.)"},{"num":8,"verse":"And they brought the head of Ishbosheth to David, in Hebron, and they said to the king, Lo! the head of Ishbosheth, the son of Saul, thine enemy, that sought thy life; and the Lord hath given today to our lord the king vengeance of Saul, and of his seed (yea, today the Lord hath avenged our lord the king upon Saul, and upon his descendants, or his family)."},{"num":9,"verse":"And David answered to Rechab, and Baanah, his brother, the sons of Rimmon of Beeroth, and said to them, The Lord liveth, that hath delivered my life from all anguish (As the Lord liveth, who hath delivered my life from all anguish);"},{"num":10,"verse":"for I held him that told to me, and said, Saul is dead, which man guessed himself to tell prosperities, and I killed him in Ziklag, to whom (he thought) it behooved me (to) give meed for (his) message; (for I took hold of him who told me, and said, Saul is dead, which man thought that he told good news, and I killed him in Ziklag, yea, he who thought it behooved me to give him a reward for his message;)"},{"num":11,"verse":"how much more now, when wicked men have slain a guiltless man in his house upon his bed, shall I not seek his blood of your hand, and shall not I do away you from the earth? (how much more now, when you wicked men have killed an innocent man in his own house on his own bed, will I not avenge his blood upon you, and shall I not do you away from the face of the earth?)"},{"num":12,"verse":"Therefore David commanded to his servants, and they killed them; and they cut off their hands and their feet, and hanged them over the cistern in Hebron (and hung them up near the pool in Hebron). Forsooth they took the head of Ishbosheth, and they buried it in the sepulchre of Abner, in Hebron."}]