[{"header":"Be Imitators of Me"},{"num":11,"verse":"Imitate me, as I do the Messiah. "},{"num":2,"verse":"I praise you for remembering everything I told you and for holding to the traditions that I passed on to you."},{"header":"Advice about Head Coverings"},{"num":3,"verse":"Now I want you to realize that the Messiah is the head of every man, and man is the head of the woman, and God is the head of the Messiah. "},{"num":4,"verse":"Every man who prays or prophesies with something on his head dishonors his head, "},{"num":5,"verse":"and every woman who prays or prophesies with her head uncovered dishonors her head, which is the same as having her head shaved. "},{"num":6,"verse":"So if a woman does not cover her head, she should cut off her hair. If it is a disgrace for a woman to cut off her hair or shave her head, let her cover her own head."},{"num":7,"verse":"A man should not cover his head, because he exists as God’s image and glory. But the woman is man’s glory. "},{"num":8,"verse":"For man did not come from woman, but woman from man; "},{"num":9,"verse":"and man was not created for woman, but woman for man. "},{"num":10,"verse":"This is why a woman should have authority over her own head: because of the angels."},{"num":11,"verse":"In the Lord, however, woman is not independent of man, nor is man of woman. "},{"num":12,"verse":"For as woman came from man, so man comes through woman. But everything comes from God. "},{"num":13,"verse":"Decide for yourselves: Is it proper for a woman to pray to God with her head uncovered? "},{"num":14,"verse":"Nature itself teaches you neither that it is disgraceful for a man to have long hair "},{"num":15,"verse":"nor that hair is a woman’s glory, since hair is given as a substitute for coverings. "},{"num":16,"verse":"But if anyone wants to argue about this, we do not have any custom like this, nor do any of God’s churches."},{"header":"Concerning the Lord’s Supper(A)"},{"num":17,"verse":"Now I am not praising you in giving you the following instructions. When you gather, it is not for the better but for the worse. "},{"num":18,"verse":"For in the first place, I hear that when you gather as a church there are divisions among you, and I partly believe it. "},{"num":19,"verse":"Of course, there must be factions among you to show which of you are genuine!"},{"num":20,"verse":"When you gather in the same place, it is not to eat the Lord’s Supper. "},{"num":21,"verse":"For as you eat, each of you rushes to eat his own supper, and one person goes hungry while another gets drunk. "},{"num":22,"verse":"You have homes in which to eat and drink, don’t you? Or do you despise God’s church and humiliate those who have nothing? What should I say to you? Should I praise you? I will not praise you for this!"},{"num":23,"verse":"For I received from the Lord what I also passed on to you—how the Lord Jesus, on the night he was betrayed, took a loaf of bread, "},{"num":24,"verse":"gave thanks for it, and broke it in pieces, saying, “This is my body that is for you. Keep doing this in memory of me.” "},{"num":25,"verse":"He did the same with the cup after the supper, saying, “This cup is the new covenant in my blood. As often as you drink from it, keep doing this in memory of me.” "},{"num":26,"verse":"For as often as you eat this bread and drink from this cup, you proclaim the Lord’s death until he comes."},{"num":27,"verse":"Therefore, whoever eats the bread or drinks from the cup in an unworthy manner will be held responsible for the Lord’s body and blood. "},{"num":28,"verse":"A person must examine himself and then eat the bread and drink from the cup, "},{"num":29,"verse":"because whoever eats and drinks without recognizing the body, eats and drinks judgment on himself. "},{"num":30,"verse":"That’s why so many of you are weak and sick and a considerable number are dying. "},{"num":31,"verse":"But if we judged ourselves correctly, we would not be judged. "},{"num":32,"verse":"Now, while we are being judged by the Lord, we are being disciplined so we won’t be condemned along with the world."},{"num":33,"verse":"Therefore, my brothers, when you gather to eat, wait for each other. "},{"num":34,"verse":"If anyone is hungry, he should eat at home, so that when you gather it may not bring judgment on you. And when I come I will give instructions concerning the other matters."}]