[{"num":11,"verse":"Copy me, my brothers, as I copy Christ himself."},{"header":"The reasons that lie behind some of the traditions"},{"num":2,"verse":"I must give you credit for remembering what I taught you and adhering to the traditions I passed on to you."},{"num":3,"verse":"But I want you to know that Christ is the head of every individual man, just as a man is the “head” of the woman and God is the head of Christ. Thus it follows that if a man prays or preaches with his head covered, he is, symbolically, dishonouring him who is his real head. But in the case of a woman, if she prays or preaches with her head uncovered it is just as much a disgrace as if she had it closely shaved. For if a woman does not cover her head she might just as well have her hair cropped. And if to be cropped or closely shaven is a sign of disgrace to women, then that is all the more reason for her to cover the head. A man ought not to cover his head, for he represents the very person and glory of God, while the woman reflects the person and glory of the man. For man does not exist because woman exists, but vice versa. Man was not created originally for the sake of woman, but woman was created for the sake of man. For this reason a woman ought to bear on her head an outward sign of man’s authority for all the angels to see."},{"num":11,"verse":"Of course, in the sight of God neither “man” nor “woman” has any separate existence. For if woman was made originally for man, no man is now born except by a woman, and both man and woman, like everything else, owe their existence to God. But use your own judgment, do you think it right and proper for a woman to pray to God bare-headed? Isn’t there a natural principle here, that makes us feel that long hair is disgraceful to a man, but of glorious beauty to a woman? We feel this because the long hair is the cover provided by nature for the woman’s head. But if anyone wants to be argumentative about it, I can only say that we and the churches of God generally hold this ruling on the matter."},{"header":"I must mention serious faults in your Church"},{"num":17,"verse":"But in giving you the following rules, I cannot commend your conduct, for it seems that your church meetings do you more harm than good! For first, when you meet for worship I hear that you split up into small groups, and I think there must be truth in what I hear. For there must be cliques among you or your favourite leaders would not be so conspicuous. It follows, then, that when you are assembled in one place you do not eat the Lord’s supper. For everyone tries to grab his food before anyone else, with the result that one goes hungry and another has too much to drink! Haven’t you houses of your own to have your meals in, or are you making a convenience of the church of God and causing acute embarrassment to those who have no other home? Am I to commend this sort of conduct? Most certainly not!"},{"header":"To partake of the Lord’s supper is a supremely serious thing"},{"num":23,"verse":"The teaching I gave you was given me personally by the Lord himself, and it was this: the Lord Jesus, in the same night in which he was betrayed, took bread and when he had given thanks he broke it and said, “Take, eat, this is my body which is being broken for you. Do this in remembrance of me.” Similarly when supper was ended, he took the cup saying, “This cup is the new agreement in my blood: do this, whenever you drink it, in remembrance of me."},{"num":26,"verse":"This can only mean that whenever you eat this bread or drink of this cup, you are proclaiming that the Lord has died for you, and you will do that until he comes again. So that, whoever eats the bread or drinks the wine without due thought is making himself like one of those who allowed the Lord to be put to death without discerning who he was."},{"num":28,"verse":"No, a man should thoroughly examine himself, and only then should he eat the bread or drink of the cup. He that eats and drinks carelessly is eating and drinking a judgment on himself, for he is blind to the presence of the Lord’s body."},{"header":"Careless communion means spiritual weakness: let us take due care"},{"num":30,"verse":"It is this careless participation which is the reason for many feeble and sickly Christians in your church, and the explanation of the fact that many of you are spiritually asleep."},{"num":31,"verse":"If we were closely to examine ourselves beforehand, we should avoid the judgment of God. But when God does judge us, he disciplines us as his own sons, that we may not be involved in the general condemnation of the world."},{"num":33,"verse":"Now, my brothers, when you come together to eat this bread, wait your proper turn. If a man is really hungry let him satisfy his appetite at home. Don’t let your communions be God’s judgment upon you! The other matters, I will settle in person, when I come."}]