[{"num":11,"verse":"Be imitators of me, just as I also am of Messiah."},{"header":"Headship and Coverings"},{"num":2,"verse":"Now I praise you because you remember me in everything and hold firm the traditions just as I passed them on to you. "},{"num":3,"verse":"But I want you to know that the head of every man is Messiah, and the head of the woman is the man, and the head of Messiah is God. "},{"num":4,"verse":"Every man praying or prophesying with his head covered dishonors his head. "},{"num":5,"verse":"But every woman praying or prophesying with her head uncovered dishonors her head. For it is one and the same as having been shaved. "},{"num":6,"verse":"For if a woman does not cover her head, let her cut off her hair. But if it is shameful for a woman to have her hair cut off or to be shaved, let her cover her head."},{"num":7,"verse":"For surely a man ought not to cover his head, since he is the image and glory of God. But the woman is the glory of man. "},{"num":8,"verse":"For man is not from woman, but woman from man. "},{"num":9,"verse":"Neither was man created for the woman’s sake, but woman for the man’s sake."},{"num":10,"verse":" For this reason the woman ought to have a symbol of authority on her head, because of the angels. "},{"num":11,"verse":"In any case—in the Lord—woman is not independent of man and man is not independent of woman. "},{"num":12,"verse":"For just as the woman came from the man, so also the man comes through the woman—but all things are from God."},{"num":13,"verse":"Judge for yourselves—is it proper for a woman to pray to God with her head uncovered? "},{"num":14,"verse":"Doesn’t the natural order of things teach you—if a man has long hair, it is a disgrace for him; "},{"num":15,"verse":"but if a woman has long hair, it is her glory, for her hair was given to her as a covering. "},{"num":16,"verse":"But if anyone intends to be contentious, we have no such custom—nor do God’s communities."},{"header":"Unity at the Lord’s Table"},{"num":17,"verse":"But in giving you this instruction I do not praise you, for when you meet together it does more harm than good. "},{"num":18,"verse":"For first of all, when you come together as Messiah’s community, I hear that there are divisions among you; and to some extent I believe it—"},{"num":19,"verse":"for there must be factions among you, so that those among you who are tried and true may be evident. "},{"num":20,"verse":"Therefore, when you meet together in the same place, it is not to eat the Lord’s Supper—"},{"num":21,"verse":"for each one takes his own supper beforehand, and one goes hungry while another gets drunk. "},{"num":22,"verse":"What! It is certainly not that you do not have houses, is it? Don’t you have houses to eat and drink in? Or do you despise God’s community and try to humiliate those who have nothing? What shall I say to you? Shall I praise you? I don’t praise you for this!"},{"num":23,"verse":"For I received from the Lord what I also passed on to you—that the Lord Yeshua, on the night He was betrayed, took matzah;"},{"num":24,"verse":" and when He had given thanks, He broke it and said, “This is My body, which is for you. Do this in memory of Me.” "},{"num":25,"verse":"In the same way, He also took the cup, after supper, saying, “This cup is the new covenant in My blood. Do this, as often as you drink it, in memory of Me.” "},{"num":26,"verse":"For as often as you eat this bread and drink this cup, you proclaim the Lord’s death until He comes."},{"num":27,"verse":"Therefore whoever eats the bread or drinks the Lord’s cup in an unworthy manner will be guilty of the body and the blood of the Lord. "},{"num":28,"verse":"But a man must examine himself, and then let him eat of the bread and drink from the cup. "},{"num":29,"verse":"For the one who eats and drinks without recognizing the body, eats and drinks judgment on himself. "},{"num":30,"verse":"For this reason many among you are weak and sick, and quite a few have died."},{"num":31,"verse":" For if we were judging ourselves thoroughly, we wouldn’t be coming under judgment. "},{"num":32,"verse":"But when we are judged, we are being disciplined by the Lord so that we might not be condemned along with the world."},{"num":33,"verse":"So then, my brothers and sisters, when you come together to eat, wait for one another. "},{"num":34,"verse":"If anyone is hungry let him eat at home, so that when you meet it doesn’t lead to judgment. And the rest I will put in order when I come."}]