[{"header":"Head Coverings"},{"num":11,"verse":"I want you to pattern your lives after me, just as I pattern mine after Christ. "},{"num":2,"verse":"And I give you full credit for always keeping me in mind as you follow carefully the substance of my instructions that I’ve taught you. "},{"num":3,"verse":"But I want you to understand that Christ is the head of every person, and Adam was the head of Eve, and God is the head of the Messiah."},{"num":4,"verse":"Any man who leads public worship, and prays or prophesies with a shawl hanging down over his head, shows disrespect to his head, which is Christ. "},{"num":5,"verse":"And if any woman in a place of leadership within the church prays or prophesies in public with her long hair disheveled, she shows disrespect to her head, which is her husband, for this would be the same as having her head shaved. "},{"num":6,"verse":"If a woman who wants to be in leadership will not conform to the customs of what is proper for women, she might as well cut off her hair. But if it’s disgraceful for her to have her hair cut off or her head shaved, let her cover her head."},{"num":7,"verse":"A man in leadership is under no obligation to have his head covered in the public gatherings, because he is the portrait of God and reflects his glory. The woman, on the other hand, reflects the glory of her husband, "},{"num":8,"verse":"for man was not created from woman but woman from man. "},{"num":9,"verse":"By the same token, the man was not created because the woman needed him; the woman was created because the man needed her. "},{"num":10,"verse":"For this reason she should have authority over the head because of the angels."},{"num":11,"verse":"So then, I have to insist that in the Lord, neither is woman inferior to man nor is man inferior to woman. "},{"num":12,"verse":"For just as woman was taken from the side of man, in the same way man is taken from the womb of woman. God, as the source of all things, designed it this way."},{"num":13,"verse":"So then you can decide for yourselves—is it proper for a woman to pray to God with her hair unbound? "},{"num":14,"verse":"Doesn’t our long-established cultural tradition teach us that if a man has long hair that is ornamentally arranged it invites disgrace, but if a woman has long hair that is ornamentally arranged it is her glory? "},{"num":15,"verse":"This is because long hair is the endowment that God has given her as a head covering."},{"num":16,"verse":"If someone wants to quarrel about this, I want you to know that we have no intention to start an argument, neither I nor the congregations of God."},{"header":"The Lord’s Table"},{"num":17,"verse":"Now, on this next matter, I wish I could commend you, but I cannot, because when you meet together as a church family it is doing more harm than good! "},{"num":18,"verse":"I’ve been told many times that when you meet as a congregation, divisions and cliques emerge—and to some extent, this doesn’t surprise me. "},{"num":19,"verse":"Differences of opinion are unavoidable, yet they will reveal which ones among you truly have God’s approval."},{"num":20,"verse":"When all of your house churches gather as one church family, you are not really properly celebrating the Lord’s Supper. "},{"num":21,"verse":"For when it comes time to eat, some gobble down their food before anything is given to others—one is left hungry while others become drunk! "},{"num":22,"verse":"Don’t you all have homes where you can eat and drink? Don’t you realize that you’re showing a superior attitude by humiliating those who have nothing? Are you trying to show contempt for God’s beloved church? How should I address this appropriately? If you’re looking for my approval, you won’t find it!"},{"num":23,"verse":"I have handed down to you what came to me by direct revelation from the Lord himself. The same night in which he was handed over, he took bread "},{"num":24,"verse":"and gave thanks. Then he distributed it to the disciples and said, “Take it and eat your fill. It is my body, which is given for you. Do this to remember me.” "},{"num":25,"verse":"He did the same with the cup of wine after supper and said, “This cup seals the new covenant with my blood. Drink it—and whenever you drink this, do it to remember me.”"},{"num":26,"verse":"Whenever you eat this bread and drink this cup, you are retelling the story, proclaiming our Lord’s death until he comes. "},{"num":27,"verse":"For this reason, whoever eats the bread or drinks the cup of the Lord in the wrong spirit will be guilty of dishonoring the body and blood of the Lord. "},{"num":28,"verse":"So let each individual first evaluate his own attitude and only then eat the bread and drink the cup. "},{"num":29,"verse":"For continually eating and drinking with a wrong spirit will bring judgment upon yourself by not recognizing the body. "},{"num":30,"verse":"This insensitivity is why many of you are weak, chronically ill, and some even dying. "},{"num":31,"verse":"If we have examined ourselves, we should not be judged. "},{"num":32,"verse":"But when we are judged, it is the Lord’s training so that we will not be condemned along with the world."},{"num":33,"verse":"So then, my fellow believers, when you assemble as one to share a meal, show respect for one another and wait for all to be served. "},{"num":34,"verse":"If you are that hungry, eat at home first, so that when you gather together you will not bring judgment upon yourself."}]