[[],[{"type":"header","content":"Paul’s Defense before the Jews"},{"type":"prose","content":"“Brothers and fathers, hear my defense  now  to you.”"}],[{"type":"prose","content":"And when they heard that he was addressing them in the Hebrew dialect, they became  more quiet; and he *said,"}],[{"type":"prose","content":"“I am a Jew, born in Tarsus of Cilicia, but brought up in this city, educated under Gamaliel, strictly according to the Law of our fathers, being zealous for God just as you all are today."}],[{"type":"prose","content":"I persecuted this Way to the death, binding and putting both men and women into prisons,"}],[{"type":"prose","content":"as also the high priest and all the Council of the elders can testify. From them I also received letters to the brothers, and started off for Damascus in order to bring even those who were there to Jerusalem as prisoners to be punished."}],[{"type":"prose","content":"“But it happened that as I was on my way, approaching Damascus at about noon, a very bright light suddenly flashed from heaven all around me,"}],[{"type":"prose","content":"and I fell to the ground and heard a voice saying to me, "}],[{"type":"prose","content":"And I answered, ‘Who are You, Lord?’ And He said to me, "}],[{"type":"prose","content":"And those who were with me saw the light, but did not understand the voice of the One who was speaking to me."}],[{"type":"prose","content":"And I said, ‘What shall I do, Lord?’ And the Lord said to me, "}],[{"type":"prose","content":"But since I could not see because of the brightness of that light, I came into Damascus being led by the hand by those who were with me."}],[{"type":"prose","content":"“Now a certain Ananias, a man who was devout by the standard of the Law  well spoken of by all the Jews who lived ,"}],[{"type":"prose","content":"came to me, and standing nearby he said to me, ‘Brother Saul, receive your sight!’ And at that very moment I looked up at him."}],[{"type":"prose","content":"And he said, ‘The God of our fathers has appointed you to know His will and to see the Righteous One and to hear a message from His mouth."}],[{"type":"prose","content":"For you will be a witness for Him to all people of what you have seen and heard."}],[{"type":"prose","content":"Now why do you delay? Get up and be baptized, and wash away your sins by calling on His name.’"}],[{"type":"prose","content":"“It happened when I returned to Jerusalem and was praying in the temple, that I fell into a trance,"}],[{"type":"prose","content":"and I saw Him saying to me, "}],[{"type":"prose","content":"And I said, ‘Lord, they themselves understand that in one synagogue after another I used to imprison and beat those who believed in You."}],[{"type":"prose","content":"And when the blood of Your witness Stephen was being shed, I also was standing nearby and approving, and watching over the cloaks of those who were killing him.’"}],[{"type":"prose","content":"And He said to me, ”"}],[{"type":"prose","content":"They listened to him up to this statement, and  they raised their voices and said, “Away with such a man from the earth, for he should not be allowed to live!”"}],[{"type":"prose","content":"And as they were shouting and throwing off their cloaks and tossing dust into the air,"}],[{"type":"prose","content":"the commander ordered that he be brought into the barracks, saying that he was to be interrogated by flogging so that he would find out the reason why they were shouting against him that way."}],[{"type":"prose","content":"But when they stretched him out with straps, Paul said to the centurion who was standing by, “Is it lawful for you to flog a man who is a Roman and uncondemned?”"}],[{"type":"prose","content":"When the centurion heard , he went to the commander and told , saying, “What are you about to do? For this man is a Roman.”"}],[{"type":"prose","content":"The commander came and said to Paul, “Tell me, are you a Roman?” And he said, “Yes.”"}],[{"type":"prose","content":"The commander answered, “I acquired this citizenship for a large sum of money.” And Paul said, “But I was actually born .”"}],[{"type":"prose","content":"Therefore, those who were about to interrogate him immediately backed away from him; and the commander also was afraid when he found out that he was a Roman, and because he had put him in chains."}],[{"type":"prose","content":"Now on the next day, wanting to know for certain why  had been accused by the Jews, he released him and ordered the chief priests and all the Council to assemble, and he brought Paul down and placed him before them."}]]