[{"num":2,"verse":"The Davar that Yeshayah ben Amotz saw concerning Yehudah and Yerushalayim."},{"num":2,"verse":"And it shall come to pass in the acharit hayamim, that the Har Beis Hashem shall be established as the rosh of the mountains, and shall be exalted above the hills; and all the Goyim shall flow unto it."},{"num":3,"verse":"And amim rabbim (many peoples) shall come and say, Come ye, and let us go up to Har Hashem, to the Beis Elohei Ya’akov; and He will teach us of His Derakhim, and we will walk in His Orakhot; for out of Tziyon shall go forth the torah, and the Devar Hashem from Yerushalayim."},{"num":4,"verse":"And He shall judge among the Goyim, and shall arbitrate for amim rabbim; and they shall beat their swords into plowshares, and their spears into pruning hooks; Goy shall not lift up cherev against Goy, neither shall they train for milchamah any more."},{"num":5,"verse":"O Bais Ya’akov, come ye, and let us walk in the Ohr Hashem."},{"num":6,"verse":"Therefore Thou hast abandoned Thy people Bais Ya’akov, because they have found their fullness from Kedem (the East), and practice divination like the Pelishtim, and they clasp hands contentedly with yaldei nochrim (children of foreigners)."},{"num":7,"verse":"Their land also is full of kesef and zahav, neither is there any end of their otzarot; their land is also full of susim, neither is there any end of their merkevot:"},{"num":8,"verse":"Their land also is full of elilim; they worship the work of their own hands, that which their own etzbe’ot have made;"},{"num":9,"verse":"And adam are humbled and ish are brought low; therefore forgive them not."},{"num":10,"verse":"Enter into the Tzur, and hide thee in the aphar, for pachad Hashem, and for the hadar of His majesty."},{"num":11,"verse":"The lofty looks of adam shall be humbled, and the haughtiness of anashim shall be brought low, and Hashem alone shall be exalted in Yom Hahu."},{"num":12,"verse":"For the Yom L’Hashem Tzva’os shall be upon every one that is proud and lofty, and upon every one that is lifted up; and he shall be brought low:"},{"num":13,"verse":"And upon all the cedars of Levanon, that are high and lofty, and upon all the oaks of Bashan,"},{"num":14,"verse":"And upon kol heharim, and upon all the hills that are lifted up,"},{"num":15,"verse":"And upon every lofty migdal, and upon every fortified chomah (wall),"},{"num":16,"verse":"And upon all the oniyyot of Tarshish, and upon all the beautiful ships."},{"num":17,"verse":"And the haughtiness of adam shall be humbled, and the pride of anashim shall be brought low; and Hashem alone shall be exalted in Yom Hahu."},{"num":18,"verse":"And the elilim shall utterly pass away."},{"num":19,"verse":"And they shall go into the holes of the rocks, and into the caves of aphar, for pachad (terror of) Hashem, and for the hadar of His majesty, when He ariseth to shake ha’aretz."},{"num":20,"verse":"In Yom Hahu a man shall cast his elilei kesef, and his elilei zahav, which they made each one for himself to worship, to the moles and to the bats;"},{"num":21,"verse":"To go into the clefts of the rocks, and into the tops of the crags before pachad (terror) of Hashem, and for the hadar of His majesty, when He ariseth to shake ha’aretz."},{"num":22,"verse":"Cease ye from HaAdam, whose neshamah is in his nostrils: for of what account is he?"}]