[{"num":2,"verse":"This is another message to Isaiah from the Lord concerning Judah and Jerusalem:"},{"num":2,"verse":"In the last days Jerusalem and the Temple of the Lord will become the world’s greatest attraction, and people from many lands will flow there to worship the Lord."},{"num":3,"verse":"“Come,” everyone will say, “let us go up the mountain of the Lord, to the Temple of the God of Israel; there he will teach us his laws, and we will obey them.” For in those days the world will be ruled from Jerusalem. "},{"num":4,"verse":"The Lord will settle international disputes; all the nations will convert their weapons of war into implements of peace. Then at the last all wars will stop and all military training will end. "},{"num":5,"verse":"O Israel, come, let us walk in the light of the Lord and be obedient to his laws!"},{"num":6,"verse":"The Lord has rejected you because you welcome foreigners from the East who practice magic and communicate with evil spirits, as the Philistines do."},{"num":7,"verse":"Israel has vast treasures of silver and gold, and great numbers of horses and chariots "},{"num":8,"verse":"and idols—the land is full of them! They are man-made, and yet you worship them! "},{"num":9,"verse":"Small and great, all bow before them; God will not forgive you for this sin."},{"num":10,"verse":"Crawl into the caves in the rocks and hide in terror from his glorious majesty, "},{"num":11,"verse":"for the day is coming when your proud looks will be brought low; the Lord alone will be exalted. "},{"num":12,"verse":"On that day the Lord Almighty will move against the proud and haughty and bring them to the dust. "},{"num":13,"verse":"All the tall cedars of Lebanon and all the mighty oaks of Bashan shall bend low, "},{"num":14,"verse":"and all the high mountains and hills, "},{"num":15,"verse":"and every high tower and wall, "},{"num":16,"verse":"and all the proud ocean ships and trim harbor craft—all shall be crushed before the Lord that day. "},{"num":17,"verse":"All the glory of mankind will bow low; the pride of men will lie in the dust, and the Lord alone will be exalted. "},{"num":18,"verse":"And all idols will be utterly abolished and destroyed."},{"num":19,"verse":"When the Lord stands up from his throne to shake up the earth, his enemies will crawl with fear into the holes in the rocks and into the caves because of the glory of his majesty. "},{"num":20,"verse":"Then at last they will abandon their gold and silver idols to the moles and bats "},{"num":21,"verse":"and crawl into the caverns to hide among the jagged rocks at the tops of the cliffs, to try to get away from the terror of the Lord and the glory of his majesty when he rises to terrify the earth. "},{"num":22,"verse":"Puny man! Frail as his breath! Don’t ever put your trust in him!"}]