[[],[{"type":"header","content":"Five Thousand Fed"},{"type":"prose","content":"After this, Jesus went to the other side of the Sea of Galilee or Sea of Tiberias. "}],[{"type":"prose","content":"A large crowd was following Him because they had seen the signs (attesting miracles) which He  performed on those who were sick. "}],[{"type":"prose","content":"And Jesus went up on the mountainside and sat down there with His disciples. "}],[{"type":"prose","content":"Now the Passover, the feast of the Jews, was approaching. "}],[{"type":"prose","content":"Jesus looked up and saw that a large crowd was coming toward Him, and He said to Philip,  "}],[{"type":"prose","content":"But He said this to test Philip, because He knew what He was about to do. "}],[{"type":"prose","content":"Philip answered, “Two hundred denarii (200 days’ wages) worth of bread is not enough for each one to receive even a little.” "}],[{"type":"prose","content":"One of His disciples, Andrew, Simon Peter’s brother, said to Him, "}],[{"type":"prose","content":"“There is a little boy here who has five barley loaves and two fish; but what are these for so many people?” "}],[{"type":"prose","content":"Jesus said,  [to eat].” Now [the ground] there was [covered with] an abundance of grass, so the men sat down, about 5,000 in number. "}],[{"type":"prose","content":"Then Jesus took the loaves, and when He had given thanks, He distributed them to those who were seated; the same also with the fish, as much as they wanted. "}],[{"type":"prose","content":"When they had eaten enough, He said to His disciples,  "}],[{"type":"prose","content":"So they gathered them up, and they filled twelve large baskets with pieces from the five barley loaves which were left over by those who had eaten. "}],[{"type":"prose","content":"When the people saw the sign (attesting miracle) that He had done, they  saying, “This is without a doubt the promised Prophet who is to come into the world!”"},{"type":"header","content":"Jesus Walks on the Water"}],[{"type":"prose","content":"Then Jesus, knowing that they were going to come and take Him by force to make Him king, withdrew again to the mountainside by Himself."}],[{"type":"prose","content":"When evening came, His disciples went down to the sea, "}],[{"type":"prose","content":"and they got into a boat and started to cross the sea to Capernaum. It was already dark, and Jesus had still not come [back] to them. "}],[{"type":"prose","content":"The sea was getting rough  rising high because a strong wind was blowing. "}],[{"type":"prose","content":"Then, when they had rowed three or four miles [and were near the center of the sea], they saw Jesus walking on the sea and approaching the boat; and they were [terribly] frightened. "}],[{"type":"prose","content":"But Jesus said to them,  "}],[{"type":"prose","content":"Then they were willing to take Him on board the boat, and immediately the boat reached the [shore of the] land to which they were going."}],[{"type":"prose","content":"The next day the crowd that stood on the other side of the sea realized that there had been only one small boat there, and that Jesus had not boarded the boat with His disciples, but that His disciples had gone away alone. "}],[{"type":"prose","content":"[Now some] other small boats from Tiberias had come in near the place where they ate the bread after the Lord had given thanks. "}],[{"type":"prose","content":"So when the crowd saw that neither Jesus nor His disciples were there, they boarded the small boats themselves and came to Capernaum looking for Jesus. "}],[{"type":"prose","content":"And when they found Him on the other side of the sea, they asked Him, “Rabbi, when did You get here?”"},{"type":"header","content":"Words to the People"}],[{"type":"prose","content":"Jesus answered,   [and leads]  "}],[{"type":"prose","content":"Then they asked Him, “What are we to do, so that we may  be doing the works of God?” "}],[{"type":"prose","content":"Jesus answered,  [adhere to, trust in, rely on, and have faith]  "}],[{"type":"prose","content":"So they said to Him, “What sign (attesting miracle) will You do that we may see it and believe You? What [supernatural] work will You do [as proof]? "}],[{"type":"prose","content":"Our fathers ate the manna in the wilderness; as it is written [in Scripture], ‘.’” "}],[{"type":"prose","content":"Then Jesus said to them,   "}],[{"type":"prose","content":"Then they said to Him, “Lord, always give us this bread.”"}],[{"type":"prose","content":"Jesus replied to them,  [as Savior]  [for that one will be sustained spiritually].   [I will never, never reject anyone who follows Me].   [give new life and]   [as Savior]  [from the dead] "},{"type":"header","content":"Words to the Jews"}],[{"type":"prose","content":"Now the Jews murmured  found fault with Him because He said,  "}],[{"type":"prose","content":"They kept saying, “Is this not Jesus, the son of Joseph, whose father and mother we know? How does He now [have the arrogance to] say,  "}],[{"type":"prose","content":"So Jesus answered,   [giving him the desire to come to Me];  [from the dead]    [who was with the Father and]  [alone]   [in Me as Savior—whoever adheres to, trusts in, relies on, and has faith in Me—already]  [that is, now possesses it].  [the Living Bread which gives and sustains life].    [believes in Me, accepts Me as Savior], "}],[{"type":"prose","content":"Then the Jews  to argue with one another, saying, “How can this man give us His flesh to eat?” "}],[{"type":"prose","content":"And Jesus said to them,  [unless you believe in Me as Savior and believe in the saving power of My blood which will be shed for you],   [believes in Me, accepts Me as Savior]  [that is, now possesses it],  [from the dead]   [spiritual]  [spiritual]   [believes in Me, accepts Me as Savior]  [in the same way remain]   [believes in Me, accepts Me as Savior]   [the manna that]  [eventually]  [believes in Me, accepts Me as Savior] "},{"type":"header","content":"Words to the Disciples"}],[{"type":"prose","content":"He said these things in a synagogue while He was teaching in Capernaum."}],[{"type":"prose","content":"When many of His disciples heard , they said, “This is a difficult  harsh  offensive statement. Who can [be expected to] listen to it?” "}],[{"type":"prose","content":"But Jesus, aware that His disciples were complaining about it, asked them,   [will you think]  [the realm]   [it is of no account].  [providing eternal life].  [still]  For Jesus knew from the beginning who did not believe, and who would betray Him. "}],[{"type":"prose","content":"And He was saying,  [that is, unless he is enabled to do so] "},{"type":"header","content":"Peter’s Confession of Faith"}],[{"type":"prose","content":"As a result of this many of His disciples abandoned Him, and no longer walked with Him. "}],[{"type":"prose","content":"So Jesus said to the twelve [disciples],  "}],[{"type":"prose","content":"Simon Peter answered, “Lord, to whom shall we go? You [alone] have the words of eternal life [you are our only hope]. "}],[{"type":"prose","content":"We have believed  confidently trusted, and [even more] we have come to know [by personal observation and experience] that You are the Holy One of God [the Christ, the Son of the living God].” "}],[{"type":"prose","content":"Jesus answered them,  [disciples]?  "}],[{"type":"prose","content":"Now He was speaking of Judas,  of Simon Iscariot; for he, one of the twelve [disciples], was about to betray Him."}]]