[{"num":6,"verse":"5 Five thousand are fed with five loaves and two fishes. 15 Christ goeth apart from the people. 17 As his disciples were rowing, 19 he cometh to them walking on the water. 26 He reasoneth of the true 27 and everlasting, 35 bread of life. 42, 52 The Jews murmur, 60 and many of the disciples, 66 depart from him. 69 The Apostles confess him to be the Son of God."},{"num":1,"verse":"After these things, Jesus went his way over the sea of Galilee, which is Tiberias."},{"num":2,"verse":"And a great multitude followed him, because they saw his miracles, which he did on them that were diseased."},{"num":3,"verse":"Then Jesus went up into a mountain, and there he sat with his disciples."},{"num":4,"verse":"Now the Passover a feast of the Jews was near."},{"num":5,"verse":"Then Jesus lift up his eyes, and seeing that a great multitude came unto him, he said unto Philip, Whence shall we buy bread, that these might eat? "},{"num":6,"verse":"(And this he said to prove him: for he himself knew what he would do.)"},{"num":7,"verse":"Philip answered him, Two hundred pennyworth of bread is not sufficient for them, that everyone of them may take a little."},{"num":8,"verse":"Then said unto him one of his disciples, Andrew, Simon Peter’s brother,"},{"num":9,"verse":"There is a little boy here, which hath five barley loaves, and two fishes: but what are they among so many?"},{"num":10,"verse":"And Jesus said, Make the people sit down. (Now there was much grass in that place.) Then the men sat down, in number about five thousand."},{"num":11,"verse":"And Jesus took the bread, and gave thanks, and gave to the disciples, and the disciples to them that were set down: and likewise of the fishes as much as they would."},{"num":12,"verse":"And when they were satisfied, he said unto his disciples, Gather up the broken meat which remaineth, that nothing be lost. "},{"num":13,"verse":"Then they gathered it together, and filled twelve baskets with the broken meat of the five barley loaves, which remained unto them that had eaten."},{"num":14,"verse":"Then the men, when they had seen the miracle that Jesus did, said, This is of a truth that Prophet that should come into the world."},{"num":15,"verse":"When Jesus therefore perceived that they would come, and take him to make him a king, he departed again into a mountain himself alone."},{"num":16,"verse":"¶ When even was now come, his disciples went down unto the sea,"},{"num":17,"verse":"And entered into a ship, and went over the sea, towards Capernaum: and now it was dark, and Jesus was not come to them."},{"num":18,"verse":"And the Sea arose with a great wind that blew."},{"num":19,"verse":"And when they had rowed about five and twenty, or thirty furlongs, they saw Jesus walking on the sea, and drawing near unto the ship: so they were afraid."},{"num":20,"verse":"But he said unto them, It is I: be not afraid. "},{"num":21,"verse":"Then willingly they received him into the ship, and the ship was by and by at the land, whither they went."},{"num":22,"verse":"¶ The day following, the people which stood on the other side of the sea, saw that there was none other ship there, save that one, where into his disciples were entered, and that Jesus went not with his disciples in the ship, but that his disciples were gone alone,"},{"num":23,"verse":"And that there came other ships from Tiberias near unto the place where they ate the bread, after the Lord had given thanks."},{"num":24,"verse":"Now when the people saw that Jesus was not there, neither his disciples, they also took shipping, and came to Capernaum, seeking for Jesus."},{"num":25,"verse":"And when they had found him on the other side of the sea, they said unto him, Rabbi, when camest thou hither?"},{"num":26,"verse":"Jesus answered them, and said, Verily, verily I say unto you, Ye seek me not, because ye saw the miracles, but because ye ate of the loaves, and were filled. "},{"num":27,"verse":"Labor not for the meat which perisheth, but for the meat that endureth unto everlasting life, which the Son of man shall give unto you: for him hath God the Father sealed. "},{"num":28,"verse":"Then said they unto him, What shall we do, that we might work the works of God?"},{"num":29,"verse":"Jesus answered, and said unto them, This is the work of God, that ye believe in him, whom he hath sent. "},{"num":30,"verse":"They said therefore unto him, What sign showest thou then, that we may see it, and believe thee? what dost thou work?"},{"num":31,"verse":"Our fathers did eat Manna in the desert, as it is written, He gave them bread from heaven to eat."},{"num":32,"verse":"Then Jesus said unto them, Verily, verily I say unto you, Moses gave you not that bread from heaven, but my Father giveth you that true bread from heaven. "},{"num":33,"verse":"For the bread of God is he which cometh down from heaven, and giveth life unto the world. "},{"num":34,"verse":"Then they said unto him, Lord, evermore give us this bread."},{"num":35,"verse":"And Jesus said unto them, I am that bread of life: he that cometh to me, shall not hunger, and he that believeth in me, shall never thirst. "},{"num":36,"verse":"But I said unto you, that ye also have seen me, and believe not. "},{"num":37,"verse":"All that the Father giveth me, shall come to me: and him that cometh to me, I cast not away. "},{"num":38,"verse":"For I came down from heaven, not to do mine own will, but his will which hath sent me. "},{"num":39,"verse":"And this is the Father’s will which hath sent me, that of all which he hath given me, I should lose nothing, but should raise it up again at the last day. "},{"num":40,"verse":"And this is the will of him that sent me, that every man which seeth the Son, and believeth in him, should have everlasting life: and I will raise him up at the last day. "},{"num":41,"verse":"The Jews then murmured at him because he said, I am that bread, which is come down from heaven."},{"num":42,"verse":"And they said, Is not this Jesus that son of Joseph, whose father and mother we know? how then saith he, I came down from heaven?"},{"num":43,"verse":"Jesus then answered, and said unto them, Murmur not among yourselves. "},{"num":44,"verse":"No man can come to me, except the Father, which hath sent me, draw him: and I will raise him up at the last day. "},{"num":45,"verse":"It is written in the Prophets, And they shall be all taught of God. Every man therefore that hath heard, and hath learned of the Father, cometh unto me: "},{"num":46,"verse":"Not that any man hath seen the Father, save he which is of God, he hath seen the Father. "},{"num":47,"verse":"Verily, verily I say unto you, he that believeth in me, hath everlasting life. "},{"num":48,"verse":"I am that bread of life. "},{"num":49,"verse":"Your fathers did eat Manna in the wilderness, and are dead. "},{"num":50,"verse":"This is that bread, which cometh down from heaven, that he which eateth of it, should not die. "},{"num":51,"verse":"I am that living bread, which came down from heaven: if any man eat of this bread, he shall live forever: and the bread that I will give is my flesh, which I will give for the life of the world. "},{"num":52,"verse":"Then the Jews strove among themselves, saying, How can this man give us his flesh to eat?"},{"num":53,"verse":"Then Jesus said unto them, Verily, verily I say unto you, Except ye eat the flesh of the Son of man, and drink his blood, ye have no life in you. "},{"num":54,"verse":"Whosoever eateth my flesh, and drinketh my blood, hath eternal life, and I will raise him up at the last day. "},{"num":55,"verse":"For my flesh is meat indeed, and my blood is drink indeed. "},{"num":56,"verse":"He that eateth my flesh, and drinketh my blood, dwelleth in me, and I in him. "},{"num":57,"verse":"As that living Father hath sent me, so live I by the Father, and he that eateth me, even he shall live by me. "},{"num":58,"verse":"This is that bread which came down from heaven: not as your fathers have eaten Manna, and are dead. He that eateth of this bread, shall live forever. "},{"num":59,"verse":"These things spake he in the Synagogue, as he taught in Capernaum."},{"num":60,"verse":"Many therefore of his disciples (when they heard this) said, This is an hard saying: who can hear it?"},{"num":61,"verse":"But Jesus knowing in himself, that his disciples murmured at this, said unto them, Doth this offend you? "},{"num":62,"verse":"What then if ye should see that Son of man ascend up where he was before? "},{"num":63,"verse":"It is the spirit that quickeneth: the flesh profiteth nothing: the words that I speak unto you, are spirit and life. "},{"num":64,"verse":"But there are some of you that believe not: for Jesus knew from the beginning, which they were that believed not, and who should betray him."},{"num":65,"verse":"And he said, Therefore said I unto you, that no man can come unto me, except it be given unto him of my Father."},{"num":66,"verse":"From that time, many of his disciples went back, and walked no more with him."},{"num":67,"verse":"Then said Jesus to the twelve, Will ye also go away? "},{"num":68,"verse":"Then Simon Peter answered him, Master, to whom shall we go? thou hast the words of eternal life:"},{"num":69,"verse":"And we believe and know that thou art that Christ that Son of the living God."},{"num":70,"verse":"Jesus answered them, Have not I chosen you twelve, and one of you is a devil? "},{"num":71,"verse":"Now he spake it of Judas Iscariot the son of Simon: for he it was that should betray him, though he was one of the twelve."}]