[{"header":"The Feeding of the Five Thousand(A)"},{"num":6,"verse":"After these things Jesus went across the Sea of Galilee, which is the Sea of Tiberias. "},{"num":2,"verse":"And a great crowd followed Him, because they saw His signs which He did for the sick. "},{"num":3,"verse":"Then Jesus went up on a mountain, and He sat there with His disciples. "},{"num":4,"verse":"Now the Passover, the feast of the Jews, was near."},{"num":5,"verse":"When Jesus looked up and saw a great crowd coming to Him, He said to Philip, “Where shall we buy bread that these may eat?” "},{"num":6,"verse":"He said this to test him, for He Himself knew what He would do."},{"num":7,"verse":"Philip answered Him, “Two hundred denarii worth of bread is not sufficient for each of them to receive but a little.”"},{"num":8,"verse":"One of His disciples, Andrew, Simon Peter’s brother, said to Him, "},{"num":9,"verse":"“There is a boy here who has five barley loaves and two small fish. But what are they among so many?”"},{"num":10,"verse":"Jesus said, “Make the people sit down.” Now there was much grass in the place. So the men sat down, numbering about five thousand. "},{"num":11,"verse":"Jesus then took the loaves, and when He had given thanks, He distributed them to the disciples, and the disciples to those who were sitting down; and likewise, they distributed the fish, as much as they wanted."},{"num":12,"verse":"When they were filled, He told His disciples, “Collect the fragments that remain, that nothing may be lost.” "},{"num":13,"verse":"So they collected them and filled twelve baskets with the fragments of the five barley loaves which were left over by those who had eaten."},{"num":14,"verse":"When those men saw the sign which He had done, they then said, “This is truly the Prophet who is to come into the world.” "},{"num":15,"verse":"Therefore, knowing that they would come and take Him by force to make Him king, Jesus departed again to a mountain by Himself alone."},{"header":"Walking on the Water(B)"},{"num":16,"verse":"Now when evening came, His disciples went down to the sea. "},{"num":17,"verse":"They got into a boat and went across the sea toward Capernaum. It was now dark, and Jesus had not come to them. "},{"num":18,"verse":"The sea was stirred up because a strong wind was blowing. "},{"num":19,"verse":"So when they had rowed about three or four miles, they saw Jesus walking on the sea and coming near the boat. And they were afraid. "},{"num":20,"verse":"But He said to them, “It is I. Do not be afraid.” "},{"num":21,"verse":"Then they gladly received Him into the boat, and immediately the boat was at the land to which they were going."},{"header":"Jesus the Bread of Life"},{"num":22,"verse":"The following day the people who stood on the other side of the sea saw that there was no other boat there, except the one which His disciples had entered, and that Jesus had not entered the boat with His disciples, but that His disciples had gone away alone. "},{"num":23,"verse":"However, other boats came from Tiberias near the place where they ate bread when the Lord had given thanks. "},{"num":24,"verse":"When the people therefore saw that neither Jesus nor His disciples were there, they also got into boats and came to Capernaum, looking for Jesus."},{"num":25,"verse":"When they found Him on the other side of the sea, they said to Him, “Rabbi, when did You come here?”"},{"num":26,"verse":"Jesus answered them, “Truly, truly I say to you, you seek Me not because you saw signs, but because you ate of the loaves and were filled. "},{"num":27,"verse":"Do not work for the food which perishes, but for that food which endures to eternal life, which the Son of Man will give you. For God the Father has set His seal on Him.”"},{"num":28,"verse":"Then they asked Him, “What shall we do that we may work the works of God?”"},{"num":29,"verse":"Jesus answered them, “This is the work of God, that you believe in Him whom He has sent.”"},{"num":30,"verse":"Therefore they said to Him, “What sign do You show then, that we may see and believe You? What work will You perform? "},{"num":31,"verse":"Our fathers ate manna in the desert. As it is written, ‘He gave them bread from heaven to eat.’”"},{"num":32,"verse":"Then Jesus said, “Truly, truly I say to you, Moses did not give you the bread from heaven, but My Father gives you the true bread from heaven. "},{"num":33,"verse":"For the bread of God is He who comes down from heaven and gives life to the world.”"},{"num":34,"verse":"Then they said to Him, “Lord, give us this bread always.”"},{"num":35,"verse":"Jesus said to them, “I am the bread of life. Whoever comes to Me shall never hunger, and whoever believes in Me shall never thirst. "},{"num":36,"verse":"But I told you that you have seen Me, and yet do not believe. "},{"num":37,"verse":"All whom the Father gives Me will come to Me, and he who comes to Me I will never cast out. "},{"num":38,"verse":"For I came down from heaven, not to do My own will, but the will of Him who sent Me. "},{"num":39,"verse":"This is the will of the Father who has sent Me, that of all whom He has given Me, I should lose nothing, but should raise it up at the last day. "},{"num":40,"verse":"This is the will of Him who sent Me, that everyone who sees the Son and believes in Him may have eternal life, and I will raise him up on the last day.”"},{"num":41,"verse":"The Jews then murmured about Him, because He said, “I am the bread which came down from heaven.” "},{"num":42,"verse":"They said, “Is this not Jesus, the son of Joseph, whose father and mother we know? How is it then that He says, ‘I have come down from heaven’? ”"},{"num":43,"verse":"Jesus therefore answered them, “Do not murmur among yourselves. "},{"num":44,"verse":"No one can come to Me unless the Father who has sent Me draws him. And I will raise him up on the last day. "},{"num":45,"verse":"It is written in the Prophets, ‘They shall all be taught by God.’ Therefore everyone who has heard and has learned of the Father comes to Me. "},{"num":46,"verse":"Not that anyone has seen the Father, except He who is from God. He has seen the Father. "},{"num":47,"verse":"Truly, truly I say to you, whoever believes in Me has eternal life. "},{"num":48,"verse":"I am the bread of life. "},{"num":49,"verse":"Your fathers ate manna in the wilderness, and they died. "},{"num":50,"verse":"This is the bread which comes down from heaven, that one may eat of it and not die. "},{"num":51,"verse":"I am the living bread which came down from heaven. If anyone eats of this bread, he will live forever. The bread which I shall give for the life of the world is My flesh.”"},{"num":52,"verse":"The Jews therefore quarreled among themselves, saying, “How can this Man give us His flesh to eat?”"},{"num":53,"verse":"Jesus said to them, “Truly, truly I say to you, unless you eat the flesh of the Son of Man and drink His blood, you have no life in you. "},{"num":54,"verse":"Whoever eats My flesh and drinks My blood has eternal life. And I will raise him up on the last day. "},{"num":55,"verse":"For My flesh is food indeed, and My blood is drink indeed. "},{"num":56,"verse":"Whoever eats My flesh and drinks My blood remains in Me, and I in him. "},{"num":57,"verse":"As the living Father sent Me, and I live because of the Father, so whoever feeds on Me also will live because of Me. "},{"num":58,"verse":"This is the bread which came down from heaven, not as your fathers ate manna and died. He who eats this bread will live forever.” "},{"num":59,"verse":"He said these things in the synagogue, as He taught in Capernaum."},{"header":"The Words of Eternal Life"},{"num":60,"verse":"When they heard this, many of His disciples said, “This is a hard saying. Who can listen to it?”"},{"num":61,"verse":"Knowing in Himself that His disciples murmured about it, Jesus said to them, “Does this offend you? "},{"num":62,"verse":"Then what if you see the Son of Man ascend to where He was before? "},{"num":63,"verse":"It is the Spirit who gives life. The flesh profits nothing. The words that I speak to you are spirit and are life. "},{"num":64,"verse":"But there are some of you who do not believe.”  For Jesus knew from the beginning who they were who did not believe, and who it was who would betray Him. "},{"num":65,"verse":"Then He said, “For this reason I have said to you that no one can come to Me unless it were given him by My Father.”"},{"num":66,"verse":"From that time many of His disciples went back and walked no more with Him."},{"num":67,"verse":"So Jesus said to the twelve, “Do you also want to go away?”"},{"num":68,"verse":"Simon Peter answered Him, “Lord, to whom shall we go? You have the words of eternal life. "},{"num":69,"verse":"We have believed and have come to know that You are the Christ, the Son of the living God.”"},{"num":70,"verse":"Jesus answered them, “Have I not chosen you, the twelve, and yet one of you is a devil?” "},{"num":71,"verse":"He spoke of Judas Iscariot, the son of Simon. For it was he who would betray Him, being one of the twelve."}]