[{"header":"Jesus shows his power over material things"},{"num":1,"verse":"After this Jesus crossed the Lake of Galilee (or Lake Tiberias), and a great crowd followed him because they had seen signs which he gave in his dealings with the sick. But Jesus went up the hillside and sat down there with his disciples. The Passover, the Jewish festival, was near. So Jesus, raising his eyes and seeing a great crowd on the way towards him, said to Philip, “Where can we buy food for these people to eat?” (He said this to test Philip, for he himself knew what he was going to do.)"},{"num":7,"verse":"“Ten pounds’ worth of bread would not be enough for them,” Philip replied, “even if they had only a little each.”"},{"num":8,"verse":"Then Andrew, Simon Peter’s brother, another disciple, put in, “There is a boy here who has five small barley loaves and a couple of fish, but what’s the good of that for such a crowd?”"},{"num":10,"verse":"Then Jesus said, “Get the people to sit down.”"},{"num":10,"verse":"There was plenty of grass there, and the men, some five thousand of them, sat down. Then Jesus took the loaves, gave thanks for them and distributed them to the people sitting on the grass, and he distributed the fish in the same way, giving them as much as they wanted. When they had eaten enough, Jesus said to his disciples, “Collect the pieces that are left over so that nothing is wasted.”"},{"num":13,"verse":"So they did as he suggested and filled twelve baskets with the broken pieces of the five barley loaves, which were left over after the people had eaten! When the men saw this sign of Jesus’ power, they kept saying, “This certainly is the Prophet who was to come into the world!”"},{"num":15,"verse":"Then Jesus, realising that they were going to carry him off and make him their king, retired once more to the hill-side quite alone."},{"num":16,"verse":"In the evening, his disciples went down to the lake, embarked on the boat and made their way across the lake to Capernaum. Darkness had already fallen and Jesus had not returned to them. A strong wind sprang up and the water grew very rough. When they had rowed about three or four miles, they saw Jesus walking on the water, and coming towards the boat, and they were terrified. But he spoke to them, “Don’t be afraid: it is I myself.”"},{"num":21,"verse":"So they gladly took him aboard, and at once the boat reached the shore they were making for."},{"header":"Jesus teaches about the true bread"},{"num":22,"verse":"The following day, the crowd, who had remained on the other side of the lake, noticed that only the one boat had been there, and that Jesus had not embarked on it with the disciples, but that they had in fact gone off by themselves. Some other small boats from Tiberias had landed quite near the place where they had eaten the food and the Lord had given thanks. When the crowd realised that neither Jesus nor the disciples were there any longer, they themselves got into the boats and went off to Capernaum to look for Jesus. When they had found him on the other side of the lake, they said to him, “Master, when did you come here?”"},{"num":26,"verse":"“Believe me,” replied Jesus, “you are looking for me now not because you saw my signs but because you ate that food and had all you wanted. You should not work for the food which does not last but for the food which lasts on into eternal life. This is the food the Son of Man will give you, and he is the one who bears the stamp of God the Father.”"},{"num":28,"verse":"This made them ask him, “What must we do to carry out the work of God?”"},{"num":29,"verse":"“The work of God for you,” replied Jesus, “is to believe in the one whom he has sent to you.”"},{"num":30,"verse":"Then they asked him, “Then what sign can you give us that will make us believe in you? What work are you doing? Our forefathers ate manna in the desert just as the scripture says, ‘He gave them bread out of Heaven to eat.’”"},{"num":32,"verse":"To which Jesus replied, “Yes, but what matters is not that Moses gave you bread from Heaven, but that my Father is giving you the true bread from Heaven. For the bread of God which comes down from Heaven gives life to the world.”"},{"num":34,"verse":"This made them say to him, “Lord, please give us this bread, always!”"},{"num":35,"verse":"Then Jesus said to them, “I myself am the bread of life. The man who comes to me will never be hungry and the man who believes in me will never again be thirsty. Yet I have told you that you have seen me and do not believe. Everything that my Father gives me will come to me and I will never refuse anyone who comes to me. For I have come down from Heaven, not to do what I want, but to do the will of him who sent me. The will of him who sent me is that I should not lose anything of what he has given me, but should raise it up when the last day comes. And this is the will of the one who sent me, that everyone who sees the Son and trusts in him should have eternal life, and I will raise him up when the last day comes.”"},{"num":41,"verse":"At this, the Jews began grumbling at him because he said, “I am the bread which came down from Heaven”, remarking “Is not this Jesus, the son of Joseph, whose parents we know? How can he say that ‘I have come down from Heaven’?”"},{"num":43,"verse":"So Jesus answered them, “Do not grumble among yourselves. Nobody comes to me unless he is drawn to me by the Father who sent me, and I will raise him up when the last day comes. In the prophets it is written—‘And they shall all be taught by God,’ and this means that everybody who has heard the Father’s voice and learned from him will come to me. Not that anyone has ever seen the Father except the one who comes from God—he has seen the Father. I assure you that the man who trusts in him has eternal life already. I myself am the bread of life. Your forefathers ate manna in the desert, and they died. This is bread that comes down from Heaven, so that a man may eat it and not die. I myself am the living bread which came down from Heaven, and if anyone eats this bread he will live for ever. The bread which I will give is my body and I shall give it for the life of the world.”"},{"num":52,"verse":"This led to a fierce argument among the Jews, some of them saying, “How can this man give us his body to eat?”"},{"num":53,"verse":"So Jesus said to them, “Unless you do eat the body of the Son of Man and drink his blood, you are not really living at all. The man who eats my flesh and drinks my blood has eternal life and I will raise him up when the last day comes. For my body is real food and my blood is real drink. The man who eats my body and drinks my blood shares my life and I share his. Just as the living Father sent me and I am alive because of the Father, so the man who lives on me will live because of me. This is the bread which came down from Heaven! It is not like the manna which your forefathers used to eat, and died. The man who eats this bread will live for ever.”"},{"num":59,"verse":"Jesus said all these things while teaching in the synagogue at Capernaum. Many of his disciples heard him say these things, and commented, “This is hard teaching indeed; who could accept that?”"},{"num":61,"verse":"Then Jesus, knowing intuitively that his disciples were complaining about what he had just said, went on, “Is this too much for you? Then what would happen if you were to see the Son of Man going up to the place where he was before? It is the Spirit which gives life. The flesh will not help you. The things which I have told you are spiritual and are life. But some of you will not believe me.”"},{"num":64,"verse":"For Jesus knew from the beginning which of his followers did not trust him and who was the man who would betray him. Then he added, “This is why I said to you, ‘No one can come to me unless my Father puts it into his heart to come.’”"},{"num":66,"verse":"As a consequence of this, many of his disciples withdrew and no longer followed him. So Jesus said to the twelve, “And are you too wanting to go away?”"},{"num":68,"verse":"“Lord,” answered Simon Peter, “who else should we go to? Your words have the ring of eternal life! And we believe and are convinced that you are the holy one of God.”"},{"num":70,"verse":"Jesus replied, “Did I not choose you twelve—and one of you has the devil in his heart?”"},{"num":71,"verse":"He was speaking of Judas, the son of Simon Iscariot, one of the twelve, who was planning to betray him."}]