[{"header":"Daily Offerings"},{"num":28,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Give this command to the Israelites. Tell them: ‘Bring me food offerings made by fire. The smell is pleasing to me. Be sure to bring them at the right time.’ "},{"num":3,"verse":"Say to them: ‘These are the offerings you must bring to the Lord. Bring two year-old lambs as a burnt offering each day. They must have nothing wrong with them. "},{"num":4,"verse":"Offer one lamb in the morning and the other lamb at twilight. "},{"num":5,"verse":"Also bring a grain offering of two quarts of fine flour. It must be mixed with one quart of oil from pressed olives. "},{"num":6,"verse":"This is the daily burnt offering which began at Mount Sinai. The smell is pleasing to the Lord. "},{"num":7,"verse":"Offer one quart of wine with each lamb as a drink offering. Pour it out to the Lord at the Holy Place. "},{"num":8,"verse":"Offer the second lamb at twilight. As in the morning, also give a grain offering and a drink offering. This offering is made by fire. Its smell is pleasing to the Lord."},{"header":"Sabbath Offerings"},{"num":9,"verse":"“‘On the Sabbath day you must give two year-old lambs. They must have nothing wrong with them. Also give a drink offering and a grain offering. The grain offering must be four quarts of fine flour mixed with olive oil. "},{"num":10,"verse":"This is the burnt offering for the Sabbath. It is in addition to the daily burnt offering and drink offering."},{"header":"Monthly Offerings"},{"num":11,"verse":"“‘On the first day of each month bring a burnt offering to the Lord. This will be two young bulls, one male sheep and seven male lambs a year old. They all must have nothing wrong with them. "},{"num":12,"verse":"Give a grain offering with each bull. It must be six quarts of fine flour mixed with olive oil. Also give a grain offering with the male sheep. It must be four quarts of fine flour mixed with olive oil. "},{"num":13,"verse":"Also give a grain offering with each lamb. It must be two quarts of fine flour mixed with olive oil. This is a burnt offering. And its smell is pleasing to the Lord. "},{"num":14,"verse":"The drink offering with each bull will be two quarts of wine. With the male sheep it will be one and one-half quarts. And with each lamb it will be one quart of wine. This is the burnt offering that must be offered each month of the year. "},{"num":15,"verse":"Besides the daily burnt offerings and drink offerings, bring a sin offering to the Lord. It must be one male goat."},{"header":"Passover"},{"num":16,"verse":"“‘The Lord’s Passover will be on the fourteenth day of the first month. "},{"num":17,"verse":"The Feast of Unleavened Bread begins on the fifteenth day of that month. It lasts for seven days. You may eat only bread made without yeast. "},{"num":18,"verse":"Have a holy meeting on the first day of the festival. Don’t work that day. "},{"num":19,"verse":"Bring these burnt offerings to the Lord: two young bulls, one male sheep and seven male lambs a year old. They all must have nothing wrong with them. "},{"num":20,"verse":"Also give a grain offering with each bull. It must be six quarts of fine flour mixed with olive oil. Give a grain offering with the male sheep. It must be four quarts of fine flour mixed with oil. "},{"num":21,"verse":"Give a grain offering with each of the seven lambs. It must be two quarts of fine flour mixed with oil. "},{"num":22,"verse":"Bring one goat as a sin offering. It will remove your sins so you will belong to God. "},{"num":23,"verse":"Bring these offerings in addition to the burnt offerings you give every morning. "},{"num":24,"verse":"So bring food offerings each day for seven days. The offering is made by fire. And its smell is pleasing to the Lord. Do it in addition to the daily burnt offering and its drink offering. "},{"num":25,"verse":"On the seventh day have a holy meeting. Don’t work that day."},{"header":"Feast of Weeks"},{"num":26,"verse":"“‘On the day of firstfruits offer new grain to the Lord. This is during the Feast of Weeks. Have a holy meeting. Don’t work that day. "},{"num":27,"verse":"Give this burnt offering to the Lord: two young bulls, one male sheep and seven male lambs a year old. This smell is pleasing to the Lord. "},{"num":28,"verse":"Also give a grain offering with each bull. It must be six quarts of fine flour mixed with oil. With the male sheep, it must be four quarts of flour. "},{"num":29,"verse":"With each of the seven lambs offer two quarts of flour. "},{"num":30,"verse":"Offer one male goat to remove your sins so you will belong to God. "},{"num":31,"verse":"Bring these offerings and their drink offerings. These are in addition to the daily burnt offering and its grain offering. The animals must have nothing wrong with them."}]