[{"header":"Daily Offerings"},{"num":28,"verse":"The Lord spoke to Moses, saying: "},{"num":2,"verse":"Command the Israelites, and say to them: My offering, the food for my offerings by fire, my pleasing odour, you shall take care to offer to me at its appointed time. "},{"num":3,"verse":"And you shall say to them, This is the offering by fire that you shall offer to the Lord: two male lambs a year old without blemish, daily, as a regular offering. "},{"num":4,"verse":"One lamb you shall offer in the morning, and the other lamb you shall offer at twilight; "},{"num":5,"verse":"also one-tenth of an ephah of choice flour for a grain-offering, mixed with one-fourth of a hin of beaten oil. "},{"num":6,"verse":"It is a regular burnt-offering, ordained at Mount Sinai for a pleasing odour, an offering by fire to the Lord. "},{"num":7,"verse":"Its drink-offering shall be one-fourth of a hin for each lamb; in the sanctuary you shall pour out a drink-offering of strong drink to the Lord. "},{"num":8,"verse":"The other lamb you shall offer at twilight with a grain-offering and a drink-offering like the one in the morning; you shall offer it as an offering by fire, a pleasing odour to the Lord."},{"header":"Sabbath Offerings"},{"num":9,"verse":"On the sabbath day: two male lambs a year old without blemish, and two-tenths of an ephah of choice flour for a grain-offering, mixed with oil, and its drink-offering— "},{"num":10,"verse":"this is the burnt-offering for every sabbath, in addition to the regular burnt-offering and its drink-offering."},{"header":"Monthly Offerings"},{"num":11,"verse":"At the beginnings of your months you shall offer a burnt-offering to the Lord: two young bulls, one ram, seven male lambs a year old without blemish; "},{"num":12,"verse":"also three-tenths of an ephah of choice flour for a grain-offering, mixed with oil, for each bull; and two-tenths of choice flour for a grain-offering, mixed with oil, for the one ram; "},{"num":13,"verse":"and one-tenth of choice flour mixed with oil as a grain-offering for every lamb—a burnt-offering of pleasing odour, an offering by fire to the Lord. "},{"num":14,"verse":"Their drink-offerings shall be half a hin of wine for a bull, one-third of a hin for a ram, and one-fourth of a hin for a lamb. This is the burnt-offering of every month throughout the months of the year. "},{"num":15,"verse":"And there shall be one male goat for a sin-offering to the Lord; it shall be offered in addition to the regular burnt-offering and its drink-offering."},{"header":"Offerings at Passover"},{"num":16,"verse":"On the fourteenth day of the first month there shall be a passover-offering to the Lord. "},{"num":17,"verse":"And on the fifteenth day of this month is a festival; for seven days shall unleavened bread be eaten. "},{"num":18,"verse":"On the first day there shall be a holy convocation. You shall not work at your occupations. "},{"num":19,"verse":"You shall offer an offering by fire, a burnt-offering to the Lord: two young bulls, one ram, and seven male lambs a year old; see that they are without blemish. "},{"num":20,"verse":"Their grain-offering shall be of choice flour mixed with oil: three-tenths of an ephah shall you offer for a bull, and two-tenths for a ram; "},{"num":21,"verse":"one-tenth shall you offer for each of the seven lambs; "},{"num":22,"verse":"also one male goat for a sin-offering, to make atonement for you. "},{"num":23,"verse":"You shall offer these in addition to the burnt-offering of the morning, which belongs to the regular burnt-offering. "},{"num":24,"verse":"In the same way you shall offer daily, for seven days, the food of an offering by fire, a pleasing odour to the Lord; it shall be offered in addition to the regular burnt-offering and its drink-offering. "},{"num":25,"verse":"And on the seventh day you shall have a holy convocation; you shall not work at your occupations."},{"header":"Offerings at the Festival of Weeks"},{"num":26,"verse":"On the day of the first fruits, when you offer a grain-offering of new grain to the Lord at your festival of weeks, you shall have a holy convocation; you shall not work at your occupations. "},{"num":27,"verse":"You shall offer a burnt-offering, a pleasing odour to the Lord: two young bulls, one ram, seven male lambs a year old. "},{"num":28,"verse":"Their grain-offering shall be of choice flour mixed with oil, three-tenths of an ephah for each bull, two-tenths for one ram, "},{"num":29,"verse":"one-tenth for each of the seven lambs; "},{"num":30,"verse":"with one male goat, to make atonement for you. "},{"num":31,"verse":"In addition to the regular burnt-offering with its grain-offering, you shall offer them and their drink-offering. They shall be without blemish."}]