[{"header":"Gifts for the Lord"},{"num":25,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Tell the Israelites to bring me gifts. Receive for me the gifts each man wants to give. "},{"num":3,"verse":"These are the gifts that you should receive from them: gold, silver, bronze, "},{"num":4,"verse":"blue, purple and red thread, and fine linen. Receive cloth made of goat hair. "},{"num":5,"verse":"Receive the male sheep skins that are dyed red. Receive fine leather, acacia wood "},{"num":6,"verse":"and olive oil to burn in the lamps. And receive spices for sweet-smelling incense and the special olive oil poured on a person’s head to make him a priest. "},{"num":7,"verse":"Also accept onyx stones and other jewels to be put on the holy vest and the chest covering."},{"num":8,"verse":"“The people must build a holy place for me. Then I can live among them. "},{"num":9,"verse":"Build this Holy Tent and everything in it by the plan I will show you."},{"header":"The Ark of the Covenant"},{"num":10,"verse":"“Use acacia wood and build an Ark. It must be 45 inches long, 27 inches wide and 27 inches high. "},{"num":11,"verse":"Cover the Ark of the Covenant inside and out with pure gold. And put a gold strip all around it. "},{"num":12,"verse":"Make four gold rings for the Ark of the Covenant. Attach the gold rings to its four feet, two rings on each side. "},{"num":13,"verse":"Then make poles from acacia wood and cover them with gold. "},{"num":14,"verse":"Put the poles through the rings on the sides of the Ark. Use these poles to carry the Ark of the Covenant. "},{"num":15,"verse":"These poles must always stay in the rings of the Ark of the Covenant. Do not take the poles out. "},{"num":16,"verse":"Then put the two flat stones in the Ark of the Covenant. I will give you these stones on which the commands are written."},{"num":17,"verse":"“Then make a lid of pure gold for the Ark of the Covenant. This lid is the mercy seat. Make it 45 inches long and 27 inches wide. "},{"num":18,"verse":"Then hammer gold to make two creatures with wings. Put one on each end of the lid. "},{"num":19,"verse":"Put one creature with wings on one end of the lid. And put the other creature with wings on the other end. Attach the creatures with wings to the lid so that they will all be one piece. "},{"num":20,"verse":"The creatures’ wings should be spread out over the lid. The creatures are to face each other across the lid. "},{"num":21,"verse":"Put this lid on top of the Ark of the Covenant. Also put in this Ark of the Covenant the agreement which I will make with you. "},{"num":22,"verse":"I will meet with you there, above the lid between the two creatures with wings. These are on the Ark of the Covenant. There I will give you all my commands for the Israelites."},{"header":"The Table"},{"num":23,"verse":"“Make a table out of acacia wood. It must be 36 inches long, 18 inches wide and 27 inches high. "},{"num":24,"verse":"Cover it with pure gold. Put a gold strip around it. "},{"num":25,"verse":"Then make a frame three inches high that stands up all around the edge. Put a gold strip around the frame. "},{"num":26,"verse":"Then make four gold rings. Attach them to the four corners of the table where the four legs are. "},{"num":27,"verse":"Put the rings close to the frame around the top of the table. These rings will hold the poles for carrying the table. "},{"num":28,"verse":"Make the poles out of acacia wood and cover them with gold. Carry the table with these poles. "},{"num":29,"verse":"Make the plates and bowls for the table out of pure gold. Make the jars and cups out of pure gold. They will be used for pouring out the drink offerings. "},{"num":30,"verse":"On this table put the bread that shows you are in my presence. It must always be there in front of me."},{"header":"The Lampstand"},{"num":31,"verse":"“Hammer pure gold to make a lampstand. Its base, stand, flower-like cups, buds and petals must all be joined together in one piece. "},{"num":32,"verse":"The lampstand must have three branches on one side and three branches on the other. "},{"num":33,"verse":"Each branch must have three cups shaped like almond flowers on it. Each cup must have a bud and a petal. "},{"num":34,"verse":"And there must be four more cups made like almond flowers on the lampstand itself. These cups must also have buds and petals. "},{"num":35,"verse":"Put a bud under each pair of branches that goes out from the lampstand. "},{"num":36,"verse":"The branches, buds and lampstand must be one piece of pure, hammered gold."},{"num":37,"verse":"“Then make seven small oil lamps and put them on the lampstand. They will give light to the area in front of the lampstand. "},{"num":38,"verse":"The wick trimmers and trays must be made of pure gold. "},{"num":39,"verse":"Use 75 pounds of pure gold to make the lampstand and everything with it. "},{"num":40,"verse":"Be very careful to make them by the plan I showed you on the mountain."}]