[[],[{"type":"header","content":"Daniel’s Prayer for His People"},{"type":"prose","content":"In the first year of Darius the son of Ahasuerus, of Median descent, who was made king over the kingdom of the Chaldeans—"}],[{"type":"prose","content":"in the first year of his reign, I, Daniel, observed in the books the number of the years which was  the word of the  to Jeremiah the prophet for the completion of the desolations of Jerusalem, , seventy years."}],[{"type":"prose","content":"So I gave my attention to the Lord God, to seek  prayer and pleading, with fasting, sackcloth, and ashes."}],[{"type":"prose","content":"I prayed to the  my God and confessed, and said, “Oh, Lord, the great and awesome God, who keeps His covenant and faithfulness for those who love Him and keep His commandments,"}],[{"type":"prose","content":"we have sinned, we have done wrong, and acted wickedly and rebelled, even turning aside from Your commandments and ordinances."}],[{"type":"prose","content":"Moreover, we have not listened to Your servants the prophets, who spoke in Your name to our kings, our leaders, our fathers, and all the people of the land."}],[{"type":"prose","content":"“Righteousness  to You, Lord, but to us open shame, as  this day—to the men of Judah, the inhabitants of Jerusalem, and all Israel, those who are nearby and those who are far away in all the countries to which You have driven them, because of their unfaithful deeds which they have committed against You."}],[{"type":"prose","content":"Open shame  to us, , to our kings, our leaders, and our fathers, because we have sinned against You."}],[{"type":"prose","content":"To the Lord our God  compassion and forgiveness, because we have rebelled against Him;"}],[{"type":"prose","content":"and we have not obeyed the voice of the  our God, to walk in His teachings which He set before us through His servants the prophets."}],[{"type":"prose","content":"Indeed, all Israel has violated Your Law and turned aside, not obeying Your voice; so the curse has gushed forth on us, along with the oath which is written in the Law of Moses the servant of God, because we have sinned against Him."}],[{"type":"prose","content":"So He has confirmed His words which He had spoken against us and against our rulers who ruled us, to bring on us great disaster; for under the entire heaven there has not been done  like what was done in Jerusalem."}],[{"type":"prose","content":"Just as it is written in the Law of Moses, all this disaster has come on us; yet we have not sought the favor of the  our God by turning from our wrongdoing and giving attention to Your truth."}],[{"type":"prose","content":"So the  has kept the disaster in store and brought it on us; for the  our God is righteous with respect to all His deeds which He has done, but we have not obeyed His voice."}],[{"type":"prose","content":"“And now, Lord, our God,  who brought Your people out of the land of Egypt with a mighty hand and made a name for Yourself, as  this day—we have sinned, we have been wicked."}],[{"type":"prose","content":"Lord, in accordance with all Your righteous acts, let now Your anger and Your wrath turn away from Your city Jerusalem, Your holy mountain; for because of our sins and the wrongdoings of our fathers, Jerusalem and Your people  an object of taunting to all those around us."}],[{"type":"prose","content":"So now, our God, listen to the prayer of Your servant and to his pleas, and for Your sake, Lord, let Your face shine on Your desolate sanctuary."}],[{"type":"prose","content":"My God, incline Your ear and hear! Open Your eyes and see our desolations and the city which is called by Your name; for we are not presenting our pleas before You based on any merits of our own, but based on Your great compassion."}],[{"type":"prose","content":"Lord, hear! Lord, forgive! Lord, listen and take action! For Your own sake, my God, do not delay, because Your city and Your people are called by Your name.”"},{"type":"header","content":"Gabriel Brings an Answer"}],[{"type":"prose","content":"While I was still speaking and praying, and confessing my sin and the sin of my people Israel, and presenting my plea before the  my God in behalf of the holy mountain of my God,"}],[{"type":"prose","content":"while I was still speaking in prayer, the man Gabriel, whom I had seen in the vision previously, came to me in  extreme weariness about the time of the evening offering."}],[{"type":"prose","content":"And he instructed  and talked with me and said, “Daniel, I have come now to give you insight with understanding."}],[{"type":"prose","content":"At the beginning of your pleas the command was issued, and I have come to tell , because you are highly esteemed; so pay attention to the message and gain understanding of the vision."},{"type":"header","content":"Seventy Weeks and the Messiah"}],[{"type":"prose","content":"“Seventy weeks have been decreed for your people and your holy city, to finish the wrongdoing, to make an end of sin, to make atonement for guilt, to bring in everlasting righteousness, to seal up vision and prophecy, and to anoint the Most Holy Place."}],[{"type":"prose","content":"So you are to know and understand  from the issuing of a decree to restore and rebuild Jerusalem, until Messiah the Prince,  seven weeks and sixty-two weeks; it will be built again,  streets and moat, even in times of distress."}],[{"type":"prose","content":"Then after the sixty-two weeks, the Messiah will be cut off and have nothing, and the people of the prince who is to come will destroy the city and the sanctuary. And its end  with a flood; even to the end there will be war; desolations are determined."}],[{"type":"prose","content":"And he will confirm a covenant with the many for one week, but in the middle of the week he will put a stop to sacrifice and grain offering; and on the wing of abominations  the one who makes desolate, until a complete destruction, one that is decreed, gushes forth on the one who makes desolate.”"}]]