[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If I say . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If, thought I, I should reason thus, I should be faithless to the generation of thy sons. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, perhaps, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if it ever occurred to my mind to speak thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the Hebrew often using two finite verbs to express one thought. (See, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 73:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If I say, I will speak thus — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I will give sentence for the ungodly in this manner. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I should offend against the generation of thy children —",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "By grieving, discouraging, and condemning them, and by tempting them to revolt from thee and thy service. By the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "generation of God’s children ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "must be understood all true believers; those who have undertaken the service of God, and entered into covenant with him; part of which covenant and profession is to believe in God’s providence; which, therefore, to deny, question, or doubt of, is to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "break ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the covenant, to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prevaricate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "deal perfidiously; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "according to the meaning of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "בגד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bagad, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "offend. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The reader will observe, that “the psalmist,” having particularly described the disease, “proceeds now, like a skilful physician of the soul, to prescribe a medicine for it, which is compounded of many salutary ingredients. And first, to the suggestions of nature, grace opposes the examples of the children of God, who never fell from their hope in another world, because of their sufferings in this. For a man, therefore, to distrust the divine goodness on that account, is to belie their hope, renounce their faith, and strike his name out of their list.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "73:15-20 The psalmist having shown the progress of his temptation, shows how faith and grace prevailed. He kept up respect for God's people, and with that he restrained himself from speaking what he had thought amiss. It is a sign that we repent of the evil thoughts of the heart, if we suppress them. Nothing gives more offence to God's children, than to say it is vain to serve God; for there is nothing more contrary to their universal experience. He prayed to God to make this matter plain to him; and he understood the wretched end of wicked people; even in the height of their prosperity they were but ripening for ruin. The sanctuary must be the resort of a tempted soul. The righteous man's afflictions end in peace, therefore he is happy; the wicked man's enjoyments end in destruction, therefore he is miserable. The prosperity of the wicked is short and uncertain, slippery places. See what their prosperity is; it is but a vain show, it is only a corrupt imagination, not substance, but a mere shadow; it is as a dream, which may please us a little while we are slumbering, yet even then it disturbs our repose.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If I say, I will speak thus - If I should resolve to give expression to my feelings. If I should utter all that is passing in my mind and my heart. It is implied here that he had \"not\" given utterance to these thoughts, but had confined them to his own bosom. He knew how they might be regarded by others; how others might be led to feel as if no confidence was to be placed in God; how this might suggest thoughts to them which would not otherwise occur to them, and which would only tend to fill their minds with distress; how such thoughts might unsettle the foundations of their faith, their peace, their hope, and their joy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I should offend against the generation of thy children - The word rendered \"I should offend,\" means to treat perfidiously, or in a faithless or treacherous manner. Then it means, \"to deal falsely with.\" And this is the meaning here; \"I should not be \"true\" to them; I should not be \"faithful\" to their real interests; I should do that which would be equivalent to dealing with them in a false and perfidious manner.\" The idea is, that he \"ought\" not to say or do anything which would tend to lessen their confidence in God, or which would suggest to their minds grounds of distrust in God, or which would disturb their peace and hope. This was alike an act of justice and benevolence on his part. Whatever might be his own troubles and doubts, he had no \"right\" to fill their minds with doubts and distrust of God; and he felt that, as it was desirable that the minds of others should not be harassed as his own had been, it could not be kind to suggest such thoughts.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This, however, should not forbid anyone from mentioning such difficulties to another for the purpose of having them removed. If they occur to the mind, as they may to the minds of any, however sincere and pious they may be, nothing can make it improper that they should be laid before one of greater age, or longer experience, or wider opportunities of knowledge, in order that the difficulties may be solved. Nothing can make it improper for a child to have recourse thus to a parent - or a member of a church, to a pastor. If, however, these doubts can be calmed down otherwise, it is better that they should be mentioned to no one. Some little additional strength may be given them even by dwelling on them long enough to mention them to another, and by putting them in such a form that they would be understood by another; and the true way is to go to God with them by prayer, and to spread them out before the mercy-seat. Prayer, and a careful study of the word of God may calm them down without their being suggested to any human being. At any rate, they should not be suggested at all to the young, or to those with fewer advantages of education, or of less experience than we have had, on whom the only effect would be to fill their minds with doubts which they could not solve - and with thoughts tending only to perplexity and unbelief - such as would never have occurred to themselves. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This, however, should not forbid anyone from mentioning such difficulties to another for the purpose of having them removed. If they occur to the mind, as they may to the minds of any, however sincere and pious they may be, nothing can make it improper that they should be laid before one of greater age, or longer experience, or wider opportunities of knowledge, in order that the difficulties may be solved. Nothing can make it improper for a child to have recourse thus to a parent - or a member of a church, to a pastor. If, however, these doubts can be calmed down otherwise, it is better that they should be mentioned to no one. Some little additional strength may be given them even by dwelling on them long enough to mention them to another, and by putting them in such a form that they would be understood by another; and the true way is to go to God with them by prayer, and to spread them out before the mercy-seat. Prayer, and a careful study of the word of God may calm them down without their being suggested to any human being. At any rate, they should not be suggested at all to the young, or to those with fewer advantages of education, or of less experience than we have had, on whom the only effect would be to fill their minds with doubts which they could not solve - and with thoughts tending only to perplexity and unbelief - such as would never have occurred to themselves. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. Freed from idiomatic phrases, this verse expresses a supposition, as, \"Had I thus spoken, I should,\" &c., intimating that he had kept his troubles to himself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "generation of thy children—Thy people (1Jo 3:1).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "offend—literally, \"deceive, mislead.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "offend—literally, \"deceive, mislead.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15 If I say, I will speak thus; behold, I should offend against the generation of thy children.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16 When I thought to know this, it was too painful for me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 Until I went into the sanctuary of God; then understood I their end.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 73:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:15",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"If I say, I will speak thus.\" It is not always wise to speak one's thoughts; if they remain within, they will only injure ourselves; but, once uttered, their mischief may be great. From such a man as the Psalmist, the utterance which his discontent suggested would have been a heavy blow and deep discouragement to the whole brotherhood. He dared not, therefore, come to such a resolution, but paused, and would not decide to declare his feelings. It was well, for in his case second thoughts were by far the best. \"I should offend against the generation of thy children.\" I should scandalise them, grieve them, and perhaps cause them to offend also. We ought to look at the consequences of our speech to all others, and especially to the church of God. Woe unto the man by whom offence cometh! Rash, undigested, ill-considered speech, is responsible for much of the heart-burning and trouble in the churches. Would to God that, like Asaph, men would bridle their tongues. Where we have any suspicion of being wrong, it is better to be silent; it can do no harm to be quiet, and it may do serious damage to spread abroad our hastily formed opinions. To grieve the children of God by appearing to act perfidiously and betray the truth, is a sin so heinous, that if the consciences of heresy-mongers were not seared as with a hot iron, they would not be so glib as they are to publish abroad their novelties. Expressions which convey the impression that the Lord acts unjustly or unkindly, especially if they fall from the lips of men of known character and experience, are as dangerous as firebrands among stubble; they are used for blasphemous purposes by the ill-disposed; and the timid and trembling are sure to be cast down thereby, and to find reason for yet deeper distress of soul.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 73:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:16",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"When I thought to know this, it was too painful for me.\" The thought of scandalising the family of God he could not bear, and yet his inward thoughts seethed and fermented, and caused an intolerable anguish within. To speak might have relieved one sorrow, but, as it would have created another, he forbore so dangerous a remedy; yet this did not remove the first pangs, which grew even worse and worse, and threatened utterly to overwhelm him. A smothered grief is hard to endure. The triumph of conscience which compels us to keep the wolf hidden beneath our own garments, does not forbid its gnawing at our vitals. Suppressed fire in the bones rages more fiercely than if it could gain a vent at the mouth. Those who know Asaph's dilemma will pity him as none others can.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 73:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Until I went into the sanctuary of. God.\" His mind entered the eternity where God dwells as in a holy place, he left the things of sense for the things invisible, his heart gazed within the veil, he stood where the thrice holy God stands. Thus he shifted his point of view, and apparent disorder resolved itself into harmony, The motions of the planets appear most discordant from this world which is itself a planet; they appear as \"progressive, retrograde, and standing still;\" but could we fix our observatory in the sun, which is the centre of the system, we should perceive all the planets moving in perfect circle around the head of the great solar family. \"Then understood I their end.\" He had seen too little to be able to judge; a wider view changed his judgment; he saw with his mind's enlightened eye the future of the wicked, and his soul was in debate no longer as to the happiness of their condition. No envy gnaws now at his heart, but a holy horror both of their impending doom, and of their present guilt, fills his soul. He recoils from being dealt with in the same manner as the proud sinners, whom just now he regarded with admiration. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will speak thus; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will give sentence for the ungodly in this manner. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I should offend against the generation of thy children, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by grieving, and discouraging, and condemning them, and by tempting them to revolt from God and godliness. But because the Hebrew verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bagad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in this sense is always, so far as I have observed, construed with the preposition ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is not here, and is constantly put before that preposition and word which it governs, and not after, as here it is, I rather join with them who render the place thus; which is more agreeable to the words and order of the text; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold the generation of thy children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", these are ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the generation of thy children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as appears by thy fatherly care of and indulgence and kindness to them, whilst thou dost at present seem to treat them like bastards who are more truly called thy children, dealing roughly and severely with them,)",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " I shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, in speaking so) transgress, or prevaricate, speak against the truth, and against my own conscience, which assureth me that these are the haters of God, and hated and cursed by him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If I say, I will speak thus,.... Either as the wicked do, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or rather as he had thought in his own mind, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", wherefore he kept it all to himself, and did not make known to others the reasonings of his mind, and the temptations he laboured under: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold, I should offend against the generation of thy children; of whom care should be taken, above all things, that they be not offended, Matthew 18:6, or \"should condemn\"; as the Targum; or as Jarchi, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "behold, I should offend against the generation of thy children; of whom care should be taken, above all things, that they be not offended, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or \"should condemn\"; as the Targum; or as Jarchi, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I should make them transgressors, and wicked persons;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "should represent them as if they were men hated and rejected of God, because of their afflictions: the words may be rendered, \"behold the generation of thy children, I have transgressed\" (q); by giving way to the above temptation, which might have been prevented by considering the church, children, and people of God, and the care he has taken of them, the regard he has shown to them, and the preservation of them in all ages. The words are an apostrophe to God, who has children by adopting grace, and which appear so by their regeneration; and there is a generation of them in all ages; when one goes, another comes; there is always a seed, a spiritual offspring, to serve him, which is counted for a generation. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q)    \"ecce generatio filiorum tuorum, praevaricatus sum\", Pagninus, Montanus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q)    \"ecce generatio filiorum tuorum, praevaricatus sum\", Pagninus, Montanus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "If I say, {g} I will speak thus; behold, I should offend against the generation of thy children.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If I say, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I will speak thus; behold, I should offend ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "against",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the generation of thy children.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) If I give place to this wicked thought, I offend against your providence, seeing you do all things most wisely and preserve your children in their greatest dangers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If I had said, I will speak thus;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Behold, I had dealt treacherously with the generation of thy children (R.V.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If he had paraded his perplexities, and made open profession of the wicked man’s creed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 21:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he would have been faithless to the interests of God’s family. In the O.T. Israel as a people is called Jehovah’s son (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or Jehovah’s sons (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but the individual does not yet claim for himself the title of son except in an official and representative capacity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The recognition of that closer personal relation is reserved for the N.T. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "15–17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of parading his doubts, he wrestled with them until in the sanctuary the solution of them was revealed to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "15–28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Faith triumphant in the conviction of an ultimate judgement and the consciousness of the supreme blessedness of fellowship with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If I say, I will speak thus; behold, I should offend against the generation of thy children;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "if I had said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). If, when these feelings assailed me, and the lot of the ungodly man seemed to me much better than my own, I had resolved to speak out all my thoughts, and let them be generally known, then should I have ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "dealt treacherously with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version) the generation of thy children. I should have deserted their cause; I should have hurt their feelings; I should have put a stumbling block in their way. Therefore, the psalmist implies, he said nothing - a reticence well worthy of imitation. Psalm 73:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To such, doubt is become the transition to apostasy. The poet has resolved the riddle of such an unequal distribution of the fortunes of men in a totally different way. Instead of כּמו in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to read כּמוהם (Bצttcher), or better, by taking up the following הנה, which even Saadia allows himself to do, contrary to the accents (Arab. mṯl hḏâ), כּמו הנּה (Ewald), is unnecessary, since prepositions are sometimes used elliptically (כּעל, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 59:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or even without anything further (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as adverbs, which must therefore be regarded as possible also in the case of כּמו (Aramaic, Arabic כּמא, Aethiopic kem). The poet means to say, If I had made up my mind to the same course of reasoning, I should have faithlessly forsaken the fellowship of the children of God, and should consequently also have forfeited their blessings. The subjunctive signification of the perfects in the hypothetical protasis and apodosis, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 23:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), follows solely from the context; futures instead of perfects would signify si dicerem...perfide agerem. דּור בּניך is the totality of those, in whom the filial relationship in which God has placed Isreal in relation to Himself is become an inward or spiritual reality, the true Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the \"righteous generation,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is an appellative, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For on the point of the uhiothesi'a the New Testament differs from the Old Testament in this way, viz., that in the Old Testament it is always only as a people that Israel is called בן, or as a whole בנים, but that the individual, and that in his direct relationship to God, dared not as yet call himself \"child of God.\" The individual character is not as yet freed from its absorption in the species, it is not as yet independent; it is the time of the minor's νηπιότης, and the adoption is as yet only effected nationally, salvation is as yet within the limits of the nationality, its common human form has not as yet appeared. The verb בּגד with בּ signifies to deal faithlessly with any one, and more especially (whether God, a friend, or a spouse) faithlessly to forsake him; here, in this sense of malicious desertion, it contents itself with the simple accusative.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "On the one side, by joining in the speech of the free-thinkers he would have placed himself outside the circle of the children of God, of the truly pious; on the other side, however, when by meditation he sought to penetrate it (לדעת), the doubt-provoking phenomenon (זאת) still continued to be to him עמל, trouble, i.e., something that troubled him without any result, an unsolvable riddle (cf. Ecclesiastes 8:17). Whether we read הוּא or היא, the sense remains the same; the Ker הוּא prefers, as in Job 31:11, the attractional gender. Neither here nor in Job 30:26 and elsewhere is it to be supposed that ואחשׁבה is equivalent to ואחשׁבה (Ewald, Hupfeld). The cohortative from of the future here, as frequently (Ges. 128, 1), with or without a conditional particle (Psalm 139:8; 2 Samuel 22:38; Job 16:6; Job 11:17; Job 19:18; Job 30:26), forms a hypothetical protasis: and (yet) when I meditated; Symmachus (according to Montfaucon), ει ̓ ἐλογιζόμην. As Vaihinger aptly observes, \"thinking alone will give neither the right light nor true happiness.\" Both are found only in faith. The poet at last struck upon the way of faith, and there he found light and peace. The future after עד frequently has the signification of the imperfect subjunctive, Job 32:11; Ecclesiastes 2:3, cf. Proverbs 12:19 (donec nutem  equals  only a moment); also in an historical connection like Joshua 10:13; 2 Chronicles 29:34, it is conceived of as subjunctive (donec ulciseretur, se sanctificarent), sometimes, however, as indicative, as in Exodus 15:16 (donec transibat) and in our passage, where אד introduces the objective goal at which the riddle found its solution: until I went into the sanctuary of God, (purposely) attended to (ל as in the primary passage Deuteronomy 32:29, cf. Job 14:21) their life's end. The cohortative is used here exactly as in ואבינה, but with the collateral notion of that which is intentional, which here fully accords with the connection. He went into God's dread sanctuary (plural as in Psalm 68:36, cf. מקדּשׁ in the Psalms of Asaph, Psalm 67:7; Psalm 78:69); here he prayed for light in the darkness of his conflict, here were his eyes opened to the holy plans and ways of God (Psalm 77:14), here the sight of the sad end of the evil-doers was presented to him. By \"God's sanctuaries\" Ewald and Hitzig understand His secrets; but this meaning is without support in the usage of the language. And is it not a thought perfectly in harmony with the context and with experience, that a light arose upon him when he withdrew from the bustle of the world into the quiet of God's dwelling - place, and there devoutly gave his mind to the matter?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "On the one side, by joining in the speech of the free-thinkers he would have placed himself outside the circle of the children of God, of the truly pious; on the other side, however, when by meditation he sought to penetrate it (לדעת), the doubt-provoking phenomenon (זאת) still continued to be to him עמל, trouble, i.e., something that troubled him without any result, an unsolvable riddle (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 8:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Whether we read הוּא or היא, the sense remains the same; the Ker הוּא prefers, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the attractional gender. Neither here nor in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and elsewhere is it to be supposed that ואחשׁבה is equivalent to ואחשׁבה (Ewald, Hupfeld). The cohortative from of the future here, as frequently (Ges. 128, 1), with or without a conditional particle (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 22:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), forms a hypothetical protasis: and (yet) when I meditated; Symmachus (according to Montfaucon), ει ̓ ἐλογιζόμην. As Vaihinger aptly observes, \"thinking alone will give neither the right light nor true happiness.\" Both are found only in faith. The poet at last struck upon the way of faith, and there he found light and peace. The future after עד frequently has the signification of the imperfect subjunctive, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 32:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 12:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (donec nutem  equals  only a moment); also in an historical connection like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 29:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is conceived of as subjunctive (donec ulciseretur, se sanctificarent), sometimes, however, as indicative, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (donec transibat) and in our passage, where אד introduces the objective goal at which the riddle found its solution: until I went into the sanctuary of God, (purposely) attended to (ל as in the primary passage ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") their life's end. The cohortative is used here exactly as in ואבינה, but with the collateral notion of that which is intentional, which here fully accords with the connection. He went into God's dread sanctuary (plural as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. מקדּשׁ in the Psalms of Asaph, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 67:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:69",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); here he prayed for light in the darkness of his conflict, here were his eyes opened to the holy plans and ways of God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), here the sight of the sad end of the evil-doers was presented to him. By \"God's sanctuaries\" Ewald and Hitzig understand His secrets; but this meaning is without support in the usage of the language. And is it not a thought perfectly in harmony with the context and with experience, that a light arose upon him when he withdrew from the bustle of the world into the quiet of God's dwelling - place, and there devoutly gave his mind to the matter?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The strophe closes with a summary confession of the explanation received there. שׁית is construed with Lamed inasmuch as collocare is equivalent to locum assignare (vid., Psalm 73:6). God makes the evil-doers to stand on smooth, slippery places, where one may easily lose one's footing (cf. Psalm 35:6; Jeremiah 23:12). There, then, they also inevitably fall; God casts them down למשּׁוּאות, into ruins, fragores  equals  ruinae, from שׁוא  equals  שׁאה, to be confused, desolate, to rumble. The word only has the appearance of being from נשׁא: ensnarings, sudden attacks (Hitzig), which is still more ill suited to Psalm 74:3 than to this passage; desolation and ruin can be said even of persons, as הרס, Psalm 28:5, ונשׁבּרוּ, Isaiah 8:15, נפּץ, Jeremiah 51:21-23. The poet knows no other theodicy but this, nor was any other known generally in the pre-exilic literature of Israel (vid., Psalm 37; Psalm 39:1-13, Jeremiah 12, and the Job 1:1). The later prophecy and the Chokma were much in advance of this, inasmuch as they point to a last universal judgment (vid., more particularly Malachi 3:13.), but not one that breaks off this present state; the present state and the future state, time and eternity, are even there not as yet thoroughly separated. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The strophe closes with a summary confession of the explanation received there. שׁית is construed with Lamed inasmuch as collocare is equivalent to locum assignare (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). God makes the evil-doers to stand on smooth, slippery places, where one may easily lose one's footing (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 35:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). There, then, they also inevitably fall; God casts them down למשּׁוּאות, into ruins, fragores  equals  ruinae, from שׁוא  equals  שׁאה, to be confused, desolate, to rumble. The word only has the appearance of being from נשׁא: ensnarings, sudden attacks (Hitzig), which is still more ill suited to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 74:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " than to this passage; desolation and ruin can be said even of persons, as הרס, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 28:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ונשׁבּרוּ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", נפּץ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:21-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The poet knows no other theodicy but this, nor was any other known generally in the pre-exilic literature of Israel (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 39:1-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The later prophecy and the Chokma were much in advance of this, inasmuch as they point to a last universal judgment (vid., more particularly ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), but not one that breaks off this present state; the present state and the future state, time and eternity, are even there not as yet thoroughly separated. ",
            "children": []
          }
        ]
      }
    ]
  }
]