[{"header":"Satan Tempts The Son of God To Act Contrary To His Father’s Will"},{"num":4,"verse":"Then Jesus was led-up into the wilderness by the Spirit to be tempted by the devil. "},{"num":2,"verse":"And having fasted for forty days and forty nights, afterward He was hungry. "},{"num":3,"verse":"And having come to Him, the one tempting said to Him, “If You are God’s Son, say that these stones should become loaves-of-bread”. "},{"num":4,"verse":"But the One, having responded, said, “It has been written [in Deut 8:3]: ‘Mankind shall live not on bread alone, but on every word proceeding-out through the mouth of God’” "},{"num":5,"verse":"Then the devil takes Him into the holy city. And he stood Him on the pinnacle of the temple. "},{"num":6,"verse":"And he says to Him, “If You are God’s Son, throw Yourself down. For it has been written: ‘Because He will command His angels concerning You, and they will lift You up on their hands that You may not ever strike Your foot against a stone’” [Ps 91:11-12]. "},{"num":7,"verse":"Jesus said to him, “Again, it has been written: ‘You shall not put the Lord your God to the test’” [Deut 6:16]. "},{"num":8,"verse":"Again, the devil takes Him to a very high mountain and shows Him all the kingdoms of the world and their glory. "},{"num":9,"verse":"And he said to Him, “I will give all these things to You if, having fallen-down, You give-worship to me”. "},{"num":10,"verse":"Then Jesus says to him, “Go-away, Satan! For it has been written: ‘You shall worship the Lord your God, and serve Him only’” [Deut 6:13]. "},{"num":11,"verse":"Then the devil leaves Him. And behold— angels came to Him and were ministering to Him."},{"header":"Jesus Begins His Ministry In Capernaum of Galilee, Fulfilling Isaiah"},{"num":12,"verse":"And having heard that John was handed-over [to prison], He went-back into Galilee. "},{"num":13,"verse":"And having left-behind Nazareth, having come, He dwelled in Capernaum, the one by-the-sea in the districts of Zebulun and Naphtali, "},{"num":14,"verse":"in order that the thing might be fulfilled having been spoken through Isaiah the prophet saying "},{"num":15,"verse":"“Land of Zebulun and land of Naphtali, the way of the sea, beyond the Jordan, Galilee of the Gentiles— "},{"num":16,"verse":"the people sitting in darkness saw a great Light. And for the ones sitting in the region and shadow of death, a Light rose for them” [Isa 9:1-2]. "},{"num":17,"verse":"From that time on Jesus began to proclaim and say, “Repent, for the kingdom of the heavens has drawn-near”."},{"header":"Jesus Calls Peter And Andrew And Then James And John To Follow Him"},{"num":18,"verse":"And while walking beside the Sea of Galilee He saw two brothers— Simon (the one being called Peter) and Andrew, his brother— throwing a casting-net into the sea, for they were fishermen. "},{"num":19,"verse":"And He says to them, “Come after Me and I will make you fishermen of people”. "},{"num":20,"verse":"And immediately the ones, having left the nets, followed Him. "},{"num":21,"verse":"And having gone on from there He saw two other brothers— James (the son of Zebedee) and John, his brother— preparing their nets in the boat with Zebedee their father. And He called them. "},{"num":22,"verse":"And immediately the ones, having left the boat and their father, followed Him."},{"header":"Jesus Goes Around All Galilee Teaching And Healing Every Disease"},{"num":23,"verse":"And He was going around in all Galilee— teaching in their synagogues and proclaiming the good-news of the kingdom and curing every disease and every infirmity among the people. "},{"num":24,"verse":"And the report of Him went into all Syria. And they brought to Him all the ones being ill, being gripped with various diseases and torments, and being demon-possessed, and having seizures, and paralytics. And He cured them."},{"header":"The Teachings of The King: True Righteousness Expounded With Divine Authority"},{"num":25,"verse":"And large crowds from Galilee and Decapolis and Jerusalem and Judea and beyond the Jordan followed Him. "}]