[{"header":"The Temptation of Jesus(A)"},{"num":4,"verse":"Then the Spirit led Jesus into the desert. He was taken there to be tempted by the devil."},{"num":2,"verse":"Jesus ate nothing for 40 days and nights. After this, he was very hungry."},{"num":3,"verse":"The devil came to tempt him and said, “If you are the Son of God, tell these rocks to become bread.”"},{"num":4,"verse":"Jesus answered him, “The Scriptures say,"},{"num":5,"verse":"Then the devil led Jesus to the holy city of Jerusalem and put him on a high place at the edge of the Temple area."},{"num":6,"verse":"He said to Jesus, “If you are the Son of God, jump off, because the Scriptures say,"},{"num":7,"verse":"Jesus answered, “The Scriptures also say, ‘You must not test the Lord your God.’”"},{"num":8,"verse":"Then the devil led Jesus to the top of a very high mountain and showed him all the kingdoms of the world and all the wonderful things in them."},{"num":9,"verse":"The devil said, “If you will bow down and worship me, I will give you all these things.”"},{"num":10,"verse":"Jesus said to him, “Get away from me, Satan! The Scriptures say,"},{"num":11,"verse":"So the devil left him. Then some angels came to Jesus and helped him."},{"header":"Jesus Begins His Work in Galilee(E)"},{"num":12,"verse":"Jesus heard that John was put in prison, so he went back to Galilee."},{"num":13,"verse":"But he did not stay in Nazareth. He went to live in Capernaum, a town near Lake Galilee in the area near Zebulun and Naphtali."},{"num":14,"verse":"He did this to give full meaning to what the prophet Isaiah said:"},{"num":17,"verse":"From that time Jesus began to tell people his message: “Change your hearts and lives, because God’s kingdom is now very near.”"},{"header":"Jesus Chooses Some Followers(G)"},{"num":18,"verse":"As Jesus was walking by Lake Galilee, he saw two brothers, Simon (called Peter) and Simon’s brother Andrew. These brothers were fishermen, and they were fishing in the lake with a net."},{"num":19,"verse":"Jesus said to them, “Come, follow me, and I will make you a different kind of fishermen. You will bring in people, not fish.”"},{"num":20,"verse":"Simon and Andrew immediately left their nets and followed him."},{"num":21,"verse":"Jesus continued walking by Lake Galilee. He saw two other brothers, James and John, the sons of Zebedee. They were in a boat with their father Zebedee. They were preparing their nets to catch fish. Jesus told the brothers to come with him."},{"num":22,"verse":"So they immediately left the boat and their father, and they followed Jesus."},{"header":"Jesus Teaches and Heals the People(H)"},{"num":23,"verse":"Jesus went everywhere in the country of Galilee. He taught in the synagogues and told the Good News about God’s kingdom. And he healed all the people’s diseases and sicknesses."},{"num":24,"verse":"The news about Jesus spread all over Syria, and people brought to him all those who were sick. They were suffering from different kinds of diseases and pain. Some had demons inside them, some suffered from seizures, and some were paralyzed. Jesus healed them all."},{"num":25,"verse":"Large crowds followed him—people from Galilee, the Ten Towns, Jerusalem, Judea, and the area across the Jordan River."}]