[{"header":"The Temptation of Jesus(A)"},{"num":4,"verse":"Then the Spirit led Jesus into the desert to be tempted by the Devil. "},{"num":2,"verse":"After spending forty days and nights without food, Jesus was hungry. "},{"num":3,"verse":"Then the Devil came to him and said, “If you are God's Son, order these stones to turn into bread.”"},{"num":4,"verse":"But Jesus answered, “The scripture says, ‘Human beings cannot live on bread alone, but need every word that God speaks.’”"},{"num":5,"verse":"Then the Devil took Jesus to Jerusalem, the Holy City, set him on the highest point of the Temple, "},{"num":6,"verse":"and said to him, “If you are God's Son, throw yourself down, for the scripture says,"},{"num":7,"verse":"Jesus answered, “But the scripture also says, ‘Do not put the Lord your God to the test.’”"},{"num":8,"verse":"Then the Devil took Jesus to a very high mountain and showed him all the kingdoms of the world in all their greatness. "},{"num":9,"verse":"“All this I will give you,” the Devil said, “if you kneel down and worship me.”"},{"num":10,"verse":"Then Jesus answered, “Go away, Satan! The scripture says, ‘Worship the Lord your God and serve only him!’”"},{"num":11,"verse":"Then the Devil left Jesus; and angels came and helped him."},{"header":"Jesus Begins His Work in Galilee(G)"},{"num":12,"verse":"When Jesus heard that John had been put in prison, he went away to Galilee. "},{"num":13,"verse":"He did not stay in Nazareth, but went to live in Capernaum, a town by Lake Galilee, in the territory of Zebulun and Naphtali. "},{"num":14,"verse":"This was done to make come true what the prophet Isaiah had said,"},{"num":17,"verse":"From that time Jesus began to preach his message: “Turn away from your sins, because the Kingdom of heaven is near!”"},{"header":"Jesus Calls Four Fishermen(L)"},{"num":18,"verse":"As Jesus walked along the shore of Lake Galilee, he saw two brothers who were fishermen, Simon (called Peter) and his brother Andrew, catching fish in the lake with a net. "},{"num":19,"verse":"Jesus said to them, “Come with me, and I will teach you to catch people.” "},{"num":20,"verse":"At once they left their nets and went with him."},{"num":21,"verse":"He went on and saw two other brothers, James and John, the sons of Zebedee. They were in their boat with their father Zebedee, getting their nets ready. Jesus called them, "},{"num":22,"verse":"and at once they left the boat and their father, and went with him."},{"header":"Jesus Teaches, Preaches, and Heals(M)"},{"num":23,"verse":"Jesus went all over Galilee, teaching in the synagogues, preaching the Good News about the Kingdom, and healing people who had all kinds of disease and sickness. "},{"num":24,"verse":"The news about him spread through the whole country of Syria, so that people brought to him all those who were sick, suffering from all kinds of diseases and disorders: people with demons, and epileptics, and paralytics—and Jesus healed them all. "},{"num":25,"verse":"Large crowds followed him from Galilee and the Ten Towns, from Jerusalem, Judea, and the land on the other side of the Jordan."}]