[{"num":4,"verse":"1 Christ is tempted. 4 He vanquisheth the devil with Scripture. 11 The Angels minister unto him. 12 He preacheth repentance, and that himself is come. 18 The calling of Peter, Andrew. 21 James and John. 24 He preacheth the Gospel, and healeth the diseased."},{"num":1,"verse":"Then was Jesus led aside of the Spirit into the wilderness, to be tempted of the devil."},{"num":2,"verse":"And when he had fasted forty days, and forty nights, he was afterward hungry."},{"num":3,"verse":"Then came to him the tempter, and said, If thou be the Son of God, command that these stones be made bread."},{"num":4,"verse":"But he answering, said, It is written, Man shall not live by bread only, but by every word that proceedeth out of the mouth of God. "},{"num":5,"verse":"Then the devil took him up into the holy city, and set him on a pinnacle of the Temple."},{"num":6,"verse":"And said unto him, If thou be the Son of God, cast thyself down, for it is written, that he will give his Angels charge over thee, and with their hands they shall lift thee up, lest at any time thou shouldest dash thy foot against a stone."},{"num":7,"verse":"Jesus said unto him, It is written again, Thou shalt not tempt the Lord thy God. "},{"num":8,"verse":"Again the devil took him up into an exceeding high mountain, and showed him all the kingdoms of the world, and the glory of them,"},{"num":9,"verse":"And said to him, All these will I give thee, if thou wilt fall down, and worship me."},{"num":10,"verse":"Then said Jesus unto him, Avoid Satan: for it is written, Thou shalt worship the Lord thy God, and him only shalt thou serve. "},{"num":11,"verse":"Then the devil left him: and behold, the Angels came, and ministered unto him."},{"num":12,"verse":"¶ And when Jesus had heard that John was committed to prison, he returned into Galilee,"},{"num":13,"verse":"And leaving Nazareth, went and dwelt in Capernaum, which is near the sea in the borders of Zebulun and Naphtali,"},{"num":14,"verse":"That it might be fulfilled which was spoken by Isaiah the Prophet, saying,"},{"num":15,"verse":"The land of Zebulun, and the land of Naphtali by the way of the sea, beyond Jordan, Galilee of the Gentiles:"},{"num":16,"verse":"The people which sat in darkness, saw great light: and to them which sat in the region and shadow of death, light is risen up."},{"num":17,"verse":"From that time Jesus began to preach, and to say, Amend your lives: for the kingdom of heaven is at hand. "},{"num":18,"verse":"¶ And Jesus walking by the sea of Galilee saw two brethren, Simon, which was called Peter, and Andrew his brother, casting a net into the sea (for they were fishers.)"},{"num":19,"verse":"And he said unto them, Follow me, and I will make you fishers of men. "},{"num":20,"verse":"And they straightway leaving the nets, followed him."},{"num":21,"verse":"And when he was gone forth from thence, he saw other two brethren, James the son of Zebedee, and John his brother in a ship with Zebedee their father, mending their nets, and he called them."},{"num":22,"verse":"And they without tarrying, leaving the ship and their father, followed him."},{"num":23,"verse":"So Jesus went about all Galilee, teaching in their Synagogues, and preaching the Gospel of the kingdom, and healing every sickness, and every disease among the people."},{"num":24,"verse":"And his fame spread abroad through all Syria: and they brought unto him all sick people, that were taken with divers diseases, and torments, and them that were possessed with devils, and those which were lunatic, and those that had the palsy: and he healed them."},{"num":25,"verse":"And there followed him great multitudes out of Galilee, and Decapolis, and Jerusalem, and Judea, and from beyond Jordan."}]