[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Were there not ten cleansed?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There is, it is clear, a tone of mingled surprise, and grief, and indignation, in the question thus asked. Looking to the facts of the case, an ethical question of some difficulty presents itself. If the nine had had faith to be healed—and the fact that they were healed implies it—how was it that faith did not show itself further in gratitude and love? The answer is to be found in the analogous phenomena of the spiritual life which are found at times in cases that are as the cleansing of the soul’s leprosy. Men have the faith which justifies; they are pardoned, and they have the sense of freedom from the burden and the disease of sin, and yet their lives show no glow of loving gratitude. They shrink from fellowship with those who, having been sharers in the same blessing with themselves, are separated from them by outward lines of demarcation. We may, perhaps, think, without being over-bold, of the twelve disciples of the Baptist, who continued in their separatist life at Ephesus, without knowing the warmth and love and joy of the indwelling of the Spirit, as presenting such analogous phenomena. (See Notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 19:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The history of most churches or smaller religious societies, perhaps also that of most individual men, presents many more.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:11-19 A sense of our spiritual leprosy should make us very humble whenever we draw near to Christ. It is enough to refer ourselves to the compassions of Christ, for they fail not. We may look for God to meet us with mercy, when we are found in the way of obedience. Only one of those who were healed returned to give thanks. It becomes us, like him, to be very humble in thanksgivings, as well as in prayers. Christ noticed the one who thus distinguished himself, he was a Samaritan. The others only got the outward cure, he alone got the spiritual blessing.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Where are the nine? - Jesus had commanded them to go to the priest, and they were probably \"literally\" obeying the commandment. They were impatient to be healed and \"selfish\" in wishing it, and had no gratitude to God or their Benefactor. Jesus did not \"forbid\" their expressing gratitude to him for his mercy; he rather seems to reprove them for \"not\" doing it. One of the first feelings of the sinner cleansed from sin is a desire to praise his Great Benefactor; and a \"real\" willingness to obey his commandments is not inconsistent with a wish to render thanks to him for his mercy. With what singular propriety may this question now be asked, \"Where are the nine?\" And what a striking illustration is this of human nature, and of the ingratitude of man! One had come back to give thanks for the favor bestowed on him; the others were heard of no more. So now. When people are restored from dangerous sickness, here and there one comes to give thanks to God; but \"where are the nine?\" When people are defended from danger; when they are recovered from the perils of the sea; when a steamboat is destroyed, and a large part of crew and passengers perish, here and there one of those who are saved acknowledges the goodness of God and renders him praise; but where is the mass of them? They give no thanks; they offer no praise. They go about their usual employments, to mingle in the scenes of pleasure and of sin as if nothing had occurred. Few, few of all who have been rescued from \"threatening graves\" feel their obligation to God, or ever express it. They forget their Great Benefactor; perhaps the mention of his name is unpleasant, and they scorn the idea that they are under any obligations to him. Such, alas! is man, ungrateful man!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This stranger - This foreigner; or, rather, this alien, or this man of another tribe. In the \"Syraic\" version, \"this one who is of a foreign people.\" This man, who might have been least \"expected\" to express gratitude to God. The most unlikely characters are often found to be most consistent and grateful. Men from whom we would expect \"least\" in religion, are often so entirely changed as to disappoint all our expectations, and to put to shame those who have been most highly favored. The poor often thus put to shame the rich; the ignorant the learned; the young the aged. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This stranger - This foreigner; or, rather, this alien, or this man of another tribe. In the \"Syraic\" version, \"this one who is of a foreign people.\" This man, who might have been least \"expected\" to express gratitude to God. The most unlikely characters are often found to be most consistent and grateful. Men from whom we would expect \"least\" in religion, are often so entirely changed as to disappoint all our expectations, and to put to shame those who have been most highly favored. The poor often thus put to shame the rich; the ignorant the learned; the young the aged. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17, 18. Were there not ten cleansed—rather, were not the ten cleansed? that is, the whole of them—an example (by the way) of Christ's omniscience [Bengel].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 17,18. These ten lepers were a representation of all mankind; not more than one of ten that receive signal mercies from the bountiful hand of Divine Providence cometh to give God any suitable homage. Thus he maketh his sun to shine and his rain to fall upon the just and upon the unjust. Men howl to God upon their beds, but glorify him not when they are raised up. But this increpation of our Saviour lets us know, that this their way is their folly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jesus answering, said,.... After the Samaritan had paid his respects to him, and made his acknowledgments in this grateful way: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "were there not ten cleansed? so many applied for a cure, and so many had it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but where are the nine? or nine of them; here was one, but where were the rest? they went and showed themselves to the priests, and then returned to their several places of abode, and took no notice of their physician and Saviour, to make any returns to him. They are many, that are cleansed by the blood of Christ; his blood was shed for many, for the remission of sins; and by his righteousness, he justifies many; at least there are many who profess themselves to be cleansed by him, and yet there are but few that glorify him, by keeping close to the rule of his word, by giving up themselves to the churches of Christ, and by walking with them in the ordinances of the Gospel: Christ's flock, which is separated from the world, and walks in Gospel order, within the inclosures of it, is but a little flock; they are but a few names in Sardis, who have not defiled themselves, with corruptions in doctrine and discipline; and these few are often such, who have been the worst of men, the vilest of sinners, from whom it has been least expected, they should glorify Christ: publicans and harlots go into the kingdom of heaven, the Gospel church state, embrace its doctrines, and submit to its ordinances, when the Scribes and Pharisees, self-righteous persons, do not: ingratitude is a crime many are guilty of, and it is highly resented by Christ; instances of gratitude are few, but as one in ten; now and then a single Samaritan, a stranger, one that has been a vile sinner, comes and acknowledges the grace of Christ in cleansing him; comes to the ministers of Christ, and to the churches, and tells them what God has done for his soul: but where are the rest, the many others, who have received spiritual advantages, and never come to relate them, and express by words and deeds, thankfulness for them? ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but where are the nine? or nine of them; here was one, but where were the rest? they went and showed themselves to the priests, and then returned to their several places of abode, and took no notice of their physician and Saviour, to make any returns to him. They are many, that are cleansed by the blood of Christ; his blood was shed for many, for the remission of sins; and by his righteousness, he justifies many; at least there are many who profess themselves to be cleansed by him, and yet there are but few that glorify him, by keeping close to the rule of his word, by giving up themselves to the churches of Christ, and by walking with them in the ordinances of the Gospel: Christ's flock, which is separated from the world, and walks in Gospel order, within the inclosures of it, is but a little flock; they are but a few names in Sardis, who have not defiled themselves, with corruptions in doctrine and discipline; and these few are often such, who have been the worst of men, the vilest of sinners, from whom it has been least expected, they should glorify Christ: publicans and harlots go into the kingdom of heaven, the Gospel church state, embrace its doctrines, and submit to its ordinances, when the Scribes and Pharisees, self-righteous persons, do not: ingratitude is a crime many are guilty of, and it is highly resented by Christ; instances of gratitude are few, but as one in ten; now and then a single Samaritan, a stranger, one that has been a vile sinner, comes and acknowledges the grace of Christ in cleansing him; comes to the ministers of Christ, and to the churches, and tells them what God has done for his soul: but where are the rest, the many others, who have received spiritual advantages, and never come to relate them, and express by words and deeds, thankfulness for them? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jesus answering said, Were there not ten cleansed? but where are the nine?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 17:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐχ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐχὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", T.R.): asking a question and implying an affirmative answer. Yet the fact of asking the question implies a certain measure of doubt. No direct information as to what happened had reached Jesus presumably, and He naturally desires explanation of the non-appearance of all but one. Were not all the ten (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ δέκα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", now a familiar number) healed, that you come back alone?—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ποῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": emphatic position: the nine—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "where",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? expressing the suspicion that not lack of healing but lack of gratitude was the matter the nine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Were there not ten cleansed? but where are the nine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "?] Literally, “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Were not the ten cleansed? but the nine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "where?”",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " What worse leprosy of superstition, ignorance, eager selfishness, or more glaring ingratitude had kept back the others? We do not know.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 17:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Οἱ δέκα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the ten",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A specimen of His omniscience.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Where are the nine?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It has been suggested that the priests, in their hostility to Jesus, hindered the return of the nine. The one who was a Samaritan would naturally pay little heed to a remonstrance from such a quarter. From the terms of the narrative it is, however, more likely that the strange Samaritan, as soon as he felt he was really cured, moved by intense, adoring gratitude, at once turned back to offer his humble, heartfelt thanks to his Deliverer. The others, now they had got what they so earnestly required, forgot to be grateful, and hurried off to the priests to procure their certificate of health, that they might plunge at once again into the varied distractions of everyday life - into business, pleasure, and the like. The Master appears especially moved by this display. He seems to see in the thanklessness of the nine, contrasted with the conduct of the one, the ingratitude of men as a whole, \"as a prophetic type of what will also ever take place\" (Stier). Luke 17:17",
        "children": []
      }
    ]
  }
]