[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-8 The nations have not yet so submitted to the Prince of Peace, as to beat their swords into ploughshares, nor has war ceased. But very precious promises these are, relating to the gospel church, which will be more and more fulfilled, for He is faithful that has promised. There shall be a glorious church for God set up in the world, in the last days, in the days of the Messiah. Christ himself will build it upon a rock. The Gentiles worshipped their idol gods; but in the period spoken of, the people will cleave to the Lord with full purpose of heart, and delight in doing his will. The word halteth, describes those who walk not according to the Divine word. The collecting the captives from Babylon was an earnest of healing, purifying, and prospering the church; and the reign of Christ shall continue till succeeded by the everlasting kingdom of heaven. Let us stir up each other to attend the ordinances of God, that we may learn his holy ways, and walk in them, receiving the law from his hands, which, being written in our hearts by his Spirit, may show our interest in the Redeemer's righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And her that was cast off a strong nation - The prophecy, that there should be a remnant, was depressing. Yet what a remnant should it be! A remnant, which should multiply like the stars of heaven or the sand on the sea-shore. Israel had never been \"a strong nation,\" as a kingdom of this world. At its best estate, under David, it had subdued the petty nations around it, who were confederated to destroy it. It had never competed with the powers of this world, East or West, Egypt or Nineveh, although God had at times marvelously saved it from being swallowed up by them. Now, the remnant of Judah, which itself was but a remnant of the undivided people, was to become \"a strong nation.\" So Isaiah prophesied, \"A little one shall become a thousand, and a small one a strong nation\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Plainly not in temporal greatness, both because human strength was not, and could not be, its characteristic, and because the prophet had been speaking of spiritual restoration.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": ": \"'Strong' are they, whom neither torture nor allurements can separate from the love of Christ.\" \"Strong are they, who are strong against themselves.\" Strong were they who said,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"We ought to obey God rather than men Acts 5:29, and, \"who shall separate us from the love of Christ? shall tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword? Nay, in all these things we are more than conquerors through Him that loved us\" Romans 8:35, Romans 8:37. God does not only restore in the Gospel; He multiplies exceedingly. Rup.: \"I will so clothe her with the spirit of might, that, as she shall be fruitful in number, so shall she be glorious in victories, so that of her it shall be said, \"who is she that looketh forth as the morning, fair as the moon, clear as the sun, terrible as an army with banners?\" Sol 6:10. For, not to name those, whose whole life is one warfare against invisible enemies and the evil desires of the flesh, who shall count the martyrs of Christ? We know that that \"remnant\" and \"strong nation\" owe wholly to grace all which they are, as they themselves in the Revelations give thanks; \"Thou wast slain and hast redeemed us to God by Thy Blood, out of every kindred and tongue and people and nation, and hast made us unto our God kings and priests, and we shall reign on the earth\" Revelation 5:9-10; that same Lord, of whom it is here said,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"We ought to obey God rather than men ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 5:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and, \"who shall separate us from the love of Christ? shall tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword? Nay, in all these things we are more than conquerors through Him that loved us\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God does not only restore in the Gospel; He multiplies exceedingly. Rup.: \"I will so clothe her with the spirit of might, that, as she shall be fruitful in number, so shall she be glorious in victories, so that of her it shall be said, \"who is she that looketh forth as the morning, fair as the moon, clear as the sun, terrible as an army with banners?\" Sol 6:10. For, not to name those, whose whole life is one warfare against invisible enemies and the evil desires of the flesh, who shall count the martyrs of Christ? We know that that \"remnant\" and \"strong nation\" owe wholly to grace all which they are, as they themselves in the Revelations give thanks; \"Thou wast slain and hast redeemed us to God by Thy Blood, out of every kindred and tongue and people and nation, and hast made us unto our God kings and priests, and we shall reign on the earth\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; that same Lord, of whom it is here said,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord shall reign over them in Zion from henceforth even forever - The visible kingdom of God in Judah was often obscured, kings, princes, priests, and false prophets combining to encourage one another in rebellion against God. In the captivity it even underwent an almost total eclipse by the over-shadowing of earthly power, save when the divine light flashed forth for an instant in the deeds or words of power and wisdom, related by Daniel. \"Henceforth,\" that is, from the time, when the law should go forth out of Zion, God should indeed reign, and that kingdom should have no end. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord shall reign over them in Zion from henceforth even forever - The visible kingdom of God in Judah was often obscured, kings, princes, priests, and false prophets combining to encourage one another in rebellion against God. In the captivity it even underwent an almost total eclipse by the over-shadowing of earthly power, save when the divine light flashed forth for an instant in the deeds or words of power and wisdom, related by Daniel. \"Henceforth,\" that is, from the time, when the law should go forth out of Zion, God should indeed reign, and that kingdom should have no end. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. I will make her that halted a remnant—I will cause a remnant to remain which shall not perish.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lord shall reign … in … Zion—David's kingdom shall be restored in the person of Messiah, who is the seed of David and at the same time Jehovah (Isa 24:23).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for ever—(Isa 9:6, 7; Da 7:14, 27; Lu 1:33; Re 11:15).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Her that halted:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see this phrase opened, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Zephaniah 3:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 3:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in this chapter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 4:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A remnant; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which, as they were preserved for a seed, so they should as fruitful seed take root and increase, and continue to the coming of the Messiah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That was cast far off; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that was cast off by God, and by the hands of Babylonians were carried away captives into remotest parts of the Babylonish kingdom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A strong nation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so the Jews did grow up in multitudes and strength, as appears by the Jewish wars which were by them waged in the days of the Maccabees. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord shall reign over them in Mount Zion; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the true God, Lord of heaven and earth, shall be their God alone, him they shall obey in his worship, law, and temple in Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From henceforth, even for ever, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. to the end or period fixed for the Mosaic and legal institutions, for a very long time, not simply for ever. This was partly fulfilled to this people in their return, and reestablishment ill their own land arid in Jerusalem; but the final, full, and eternal accomplishment hereof is now fulfilling, and shall continue so, under the Messiah, till fulfilled in the gathering all the elect to Christ in grace on earth, and in glory in heaven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will make her that halted a remnant,.... That is, make a reserve of her, and not utterly cut her off for her halting or sinning; that there may be a seed, a posterity descending from her, that shall serve the Lord, and appear to be a remnant according to the election of grace; which will be the persons called and gathered in the latter day: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and her that was cast afar off a strong nation; Kimchi thinks this refers to the ten tribes that were carried far off into Media and other parts, 2 Kings 17:6; who shall now be a mighty and numerous people; and especially shall be strong in a spiritual sense in the Lord, and in the power of his might, in Christ and his grace, and in the faith of him; see Isaiah 60:22; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and her that was cast afar off a strong nation; Kimchi thinks this refers to the ten tribes that were carried far off into Media and other parts, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; who shall now be a mighty and numerous people; and especially shall be strong in a spiritual sense in the Lord, and in the power of his might, in Christ and his grace, and in the faith of him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Lord shall reign over them in Mount Zion from henceforth, even for ever; that is, Christ, who is Jehovah our righteousness, shall reign over the converted Jews and Israelites in the church of God, often signified by Mount Zion; where they shall be assembled, and shall acknowledge him as their King, and be subject to his word and ordinances, and never more depart from him; nor will his government over them ever cease more, Luke 1:32. This shows that this prophecy refers not to the that times of the Gospel; for then the Jews would not have him to reign over them; but to times yet to come, the last days of the Gospel dispensation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Lord shall reign over them in Mount Zion from henceforth, even for ever; that is, Christ, who is Jehovah our righteousness, shall reign over the converted Jews and Israelites in the church of God, often signified by Mount Zion; where they shall be assembled, and shall acknowledge him as their King, and be subject to his word and ordinances, and never more depart from him; nor will his government over them ever cease more, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This shows that this prophecy refers not to the that times of the Gospel; for then the Jews would not have him to reign over them; but to times yet to come, the last days of the Gospel dispensation. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I will make her that halted {h} a remnant, and her that was cast far off a strong nation: and the LORD shall reign over them in mount Zion from henceforth, even for ever.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I will make her that halted ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a remnant, and her that was cast far off a strong nation: and the LORD shall reign over them in mount Zion from henceforth, even for ever.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) I will cause that Israel, who is now as one lame and halting, and so almost destroyed, to live again, and grow into a great people.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I will make … a remnant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. I will treat Israel, in spite of her ‘halting’ condition, as the ‘remnant’ to which the Messianic promises belong.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall reign",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Strictly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "will have become king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; i.e. will have assumed the royal functions, without the dubious intervention of a merely human representative. So ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will make her that halted a remnant.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The\" remnant\" is \"the election,\" that portion of Israel which accepts the offered redemption (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and God declares that he will treat this section, now miserable and depressed, as sharers in the Messianic promises (see note on Zephaniah 3:19). As commonly, the restoration from captivity and the privileges of Messiah's kingdom are combined in one foreshortened view. But this \"remnant\" shall be made into a strong nation, which no power shall overthrow (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 55:22). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord shall reign over them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not through an earthly representative, but by himself (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In Mount Zion.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This prophecy does not necessarily point to any literal earthly fulfilment, but rather to the establishment of Christ's spiritual kingdom, and the revelation of that new Jerusalem which St. John saw \"descending out of heaven from God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Micah 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "From this salvation even the Israel that may be in misery or scattered abroad will not be excluded. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"In that day, is the saying of Jehovah, will I assemble that which limps, and gather together that which has been thrust out, and which I have afflicted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I will make that which limps into a remnant, and that which is far removed into a strong nation; and Jehovah will rule over them from henceforth, even for ever.\" \"In that day\" points back to the end of the days in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At the time when many nations shall go on pilgrimage to the highly exalted mountain of the Lord, and therefore Zion-Jerusalem will not only be restored, but greatly glorified, the Lord will assemble that which limps and is scattered abroad. The feminines הצּלעה and הנּדּחה are neuters, and to be understood collectively. Limping denotes the miserable condition into which the dispersed have been brought (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And this misery is inflicted by God. The limping and dispersed are those whom Jehovah has afflicted, whom He has punished for their sins. The gathering together of the nation has already been promised in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but there the assembling of all Israel was foretold, whereas here it is merely the assembling of the miserable, and of those who are scattered far and wide. There is no discrepancy in these two promises. The difference may easily be explained from the different tendencies of the two addressed. \"All Jacob\" referred to the two separate kingdoms into which the nation was divided in the time of the prophet, viz., Israel and Judah, and it was distinctly mentioned there, because the banishment of both had been foretold. This antithesis falls into the background here; and, on the other hand, prominence is given, in connection with what precedes, to the idea of happiness in the enjoyment of the blessings of the holy land. The gathering together involves reinstatement in the possession and enjoyment of these blessings. Hence only the miserable and dispersed are mentioned, to express the thought that no one is to be excluded from the salvation which the Lord will bestow upon His people in the future, though now he may be pining in the misery of the exile inflicted upon them. But just as the whole of the nation of Israel to be gathered together, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", consists of the remnant of the nation only, so does the gathering together referred to here point only to the restoration of the remnant, which is to become a strong nation, over which Jehovah reigns as King in Zion. מלך is emphatic, expressing the setting up of the perfected monarchy, as it has never yet existed, either in the present or the past.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"Micah does not mention the descendants of David here, but Jehovah Himself, not to exclude the kingdom of David, but to show that God will prove that He was the author of that kingdom, and that all the power is His. For although God governed the ancient people by the hand of David, and by the hand of Josiah and Hezekiah, yet there was as it were a cloud interposed, so that God then reigned obscurely. The prophet therefore indicates a certain difference here between that shadowy kingdom and the new kingdom which God will openly manifest at the advent of the Messiah.\" - Calvin.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This dominion will never be interrupted again, as it formerly was, by the banishment of the nation into exile on account of its sins, but will endure מעתּה (henceforth), i.e., from the future, which is regarded as present, even for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So far as the realization of this exceedingly glorious promise is concerned, the expression standing at the head, be'achărı̄th hayyâmı̄m (at the end of the days), already points to the Messianic times: and the substance of the promise itself points to the times of the completion of the Messianic kingdom, i.e., to the establishment of the kingdom of glory (Matthew 19:28). The temple mountain is a type of the kingdom of God in its New Testament form, which is described by all the prophets after the forms of the Old Testament kingdom of God. Accordingly, the going of the nations to the mountain of the house of Jehovah is, as a matter of fact, the entrance of the heathen who have been brought to the faith into the kingdom of Christ. This commenced with the spread of the gospel among the Gentiles, and has been continued through all the ages of the Christian church. But however many nations have hitherto entered into the Christian church, the time has not yet come for them to be so entirely pervaded with the spirit of Christ, as to allow their disputes to be settled by the Lord as their King, or to renounce war, and live in everlasting peace. Even for Israel the time has not yet come for the limping and exiled to be gathered together and made into a strong nation, however many individual Jews have already found salvation and peace within the bosom of the Christian church. The cessation of war and establishment of eternal peace can only take place after the destruction of all the ungodly powers on earth, at the return of Christ to judgment and for the perfecting of His kingdom. But even then, when, according to Romans 11:25., the pleroma of the Gentiles shall have entered into the kingdom of God, and Israel as a nation (πᾶς Ἰσραήλ  equals  יעקב כּלּו in Micah 2:12) shall have turned to its Redeemer, and shall be assembled or saved, no physical elevation of the mountain of Zion will ensue, nor any restoration of the temple in Jerusalem, or return of the dispersed of Israel to Palestine. The kingdom of glory will be set up on the new earth, in the Jerusalem which was shown to the holy seer on Patmos in the Spirit, on a great and lofty mountain (Revelation 21:10). In this holy city of God there will be no temple, \"for the Lord, the Almighty God, and the Lamb, are the temple thereof\" (Revelation 21:22). The word of the Lord to the Samaritan woman concerning the time when men would neither worship God on this mountain, nor yet in Jerusalem, but worship Him in spirit and in truth (John 4:21, John 4:23), applies not only to the kingdom of God in its temporal development into the Christian church, but also to the time of the completion of the kingdom of God in glory. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So far as the realization of this exceedingly glorious promise is concerned, the expression standing at the head, be'achărı̄th hayyâmı̄m (at the end of the days), already points to the Messianic times: and the substance of the promise itself points to the times of the completion of the Messianic kingdom, i.e., to the establishment of the kingdom of glory (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 19:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The temple mountain is a type of the kingdom of God in its New Testament form, which is described by all the prophets after the forms of the Old Testament kingdom of God. Accordingly, the going of the nations to the mountain of the house of Jehovah is, as a matter of fact, the entrance of the heathen who have been brought to the faith into the kingdom of Christ. This commenced with the spread of the gospel among the Gentiles, and has been continued through all the ages of the Christian church. But however many nations have hitherto entered into the Christian church, the time has not yet come for them to be so entirely pervaded with the spirit of Christ, as to allow their disputes to be settled by the Lord as their King, or to renounce war, and live in everlasting peace. Even for Israel the time has not yet come for the limping and exiled to be gathered together and made into a strong nation, however many individual Jews have already found salvation and peace within the bosom of the Christian church. The cessation of war and establishment of eternal peace can only take place after the destruction of all the ungodly powers on earth, at the return of Christ to judgment and for the perfecting of His kingdom. But even then, when, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., the pleroma of the Gentiles shall have entered into the kingdom of God, and Israel as a nation (πᾶς Ἰσραήλ  equals  יעקב כּלּו in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") shall have turned to its Redeemer, and shall be assembled or saved, no physical elevation of the mountain of Zion will ensue, nor any restoration of the temple in Jerusalem, or return of the dispersed of Israel to Palestine. The kingdom of glory will be set up on the new earth, in the Jerusalem which was shown to the holy seer on Patmos in the Spirit, on a great and lofty mountain (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In this holy city of God there will be no temple, \"for the Lord, the Almighty God, and the Lamb, are the temple thereof\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The word of the Lord to the Samaritan woman concerning the time when men would neither worship God on this mountain, nor yet in Jerusalem, but worship Him in spirit and in truth (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), applies not only to the kingdom of God in its temporal development into the Christian church, but also to the time of the completion of the kingdom of God in glory. ",
            "children": []
          }
        ]
      }
    ]
  }
]