[{"header":"Promise and Warning"},{"num":9,"verse":"Now it came to pass, when Solomon had finished building the House of Adonai, the royal palace and all that Solomon was pleased to do, "},{"num":2,"verse":"that Adonai appeared to Solomon a second time, just as He had appeared to him at Gibeon. "},{"num":3,"verse":"Adonai said to him: “I have heard your prayer and your petition that you made before Me. I have consecrated this House, which you have built, to put My Name there forever, and My eyes and My heart will be there every day."},{"num":4,"verse":"“As for you, if you will walk before Me as your father David walked—in integrity of heart and uprightness, doing all I commanded you, keeping My statutes and My ordinances—"},{"num":5,"verse":"then I will establish the throne of your kingship over Israel forever, as I promised your father David saying: ‘You shall not lack a man on the throne of Israel.’"},{"num":6,"verse":"“But if you or your sons will indeed turn away from following Me—not keeping My mitzvot and My statutes that I set before you—and go and serve other gods and worship them, "},{"num":7,"verse":"then will I cut off Israel from the land which I have given them, and this House which I have consecrated for My Name, I will cast out of My sight. So Israel will become a proverb and a byword among all peoples. "},{"num":8,"verse":"This House, now so exalted—everyone passing by it will gasp in shock and hiss, saying: ‘Why has Adonai done thus to this land and to this House?’ "},{"num":9,"verse":"They will be told: ‘Because they forsook Adonai their God who brought their fathers out of the land of Egypt, and embraced other gods, worshipped them and served them, therefore Adonai has brought all this evil on them.’”"},{"header":"Solomon’s Economic Achievements"},{"num":10,"verse":"Now at the end of 20 years during which Solomon had built the two houses—Adonai’s House and the royal palace—"},{"num":11,"verse":"since King Hiram of Tyre had furnished Solomon with cedar and cypress logs and with gold for all his desire—in return King Solomon gave Hiram 20 cities in the land of Galilee. "},{"num":12,"verse":"So Hiram came out from Tyre to see the cities that Solomon had given him, but he was not pleased with them. "},{"num":13,"verse":"He said, “What are these cities that you’ve given me, my brother?” So they have been called the land of Kabul to this day. "},{"num":14,"verse":"(Hiram had also sent to the king 120 talents of gold.)"},{"num":15,"verse":"Now this was the purpose of the forced labor that King Solomon had imposed to build Adonai’s House, his own house, the Millo, the wall of Jerusalem, Hazor, Megiddo and Gezer. "},{"num":16,"verse":"Pharaoh king of Egypt had gone up, captured Gezer, burned it with fire, killed the Canaanites who dwelt in the city, and given it as a dowry for his daughter, Solomon’s wife. "},{"num":17,"verse":"So Solomon rebuilt Gezer, lower Beth-horon, "},{"num":18,"verse":"Baalath and Tadmor in the wilderness in the land, "},{"num":19,"verse":"as well as all the storage cities, chariot cities and cavalry cities and that it pleased Solomon to build in Jerusalem, in Lebanon, and in all the land of his dominion."},{"num":20,"verse":"As for all the people that were left of the Amorites, the Hittites, the Perizzites, the Hivites, and the Jebusites, who were not of the children of Israel, "},{"num":21,"verse":"even their children who remained in the land after them whom the children of Israel were not able to destroy utterly, on them Solomon imposed forced labor until this day."},{"num":22,"verse":"But Solomon did not make slaves of the children of Israel, for they were the men of war, his servants, his officials, his captains, his charioteers and his horsemen."},{"num":23,"verse":"These were the chief officers who were over Solomon’s work, 550 who supervised the people who did the work. "},{"num":24,"verse":"As soon as Pharaoh’s daughter came up out of the city of David to her house built for her, he built the Millo."},{"num":25,"verse":"Now three times a year Solomon offered burnt offerings and fellowship offerings on the altar that he built for Adonai, burning incense with them on the altar that was before Adonai. When he finished the House, "},{"num":26,"verse":"King Solomon also built a fleet of ships in Ezion-geber, which is near Eloth on the shore of the Sea of Reeds in the land of Edom. "},{"num":27,"verse":"Hiram sent his servants with the fleet—sailors who knew the sea—along with Solomon’s servants. "},{"num":28,"verse":"So they went to Ophir and took from there 420 talents of gold, and brought it to King Solomon."}]