[{"num":21,"verse":"Just as water is turned into irrigation ditches, so the Lord directs the king’s thoughts. He turns them wherever he wants to."},{"num":2,"verse":"We can justify our every deed, but God looks at our motives."},{"num":3,"verse":"God is more pleased when we are just and fair than when we give him gifts."},{"num":4,"verse":"Pride, lust, and evil actions are all sin."},{"num":5,"verse":"Steady plodding brings prosperity; hasty speculation brings poverty."},{"num":6,"verse":"Dishonest gain will never last, so why take the risk?"},{"num":7,"verse":"Because the wicked are unfair, their violence boomerangs and destroys them."},{"num":8,"verse":"A man is known by his actions. An evil man lives an evil life; a good man lives a godly life."},{"num":9,"verse":"It is better to live in the corner of an attic than with a crabby woman in a lovely home."},{"num":10,"verse":"An evil man loves to harm others; being a good neighbor is out of his line."},{"num":11,"verse":"The wise man learns by listening; the simpleton can learn only by seeing scorners punished."},{"num":12,"verse":"God, the Righteous One, knows what is going on in the homes of the wicked and will bring the wicked to judgment."},{"num":13,"verse":"He who shuts his ears to the cries of the poor will be ignored in his own time of need."},{"num":14,"verse":"An angry man is silenced by giving him a gift!"},{"num":15,"verse":"A good man loves justice, but it is a calamity to evildoers."},{"num":16,"verse":"The man who strays away from common sense will end up dead!"},{"num":17,"verse":"A man who loves pleasure becomes poor; wine and luxury are not the way to riches!"},{"num":18,"verse":"The wicked will finally lose; the righteous will finally win."},{"num":19,"verse":"Better to live in the desert than with a quarrelsome, complaining woman."},{"num":20,"verse":"The wise man saves for the future, but the foolish man spends whatever he gets."},{"num":21,"verse":"The man who tries to be good, loving, and kind finds life, righteousness, and honor."},{"num":22,"verse":"The wise man conquers the strong man and levels his defenses."},{"num":23,"verse":"Keep your mouth closed and you’ll stay out of trouble."},{"num":24,"verse":"Mockers are proud, haughty, and arrogant."},{"num":25,"verse":"The lazy man longs for many things, but his hands refuse to work. He is greedy to get, while the godly love to give!"},{"num":27,"verse":"God loathes the gifts of evil men, especially if they are trying to bribe him!"},{"num":28,"verse":"No one believes a liar, but everyone respects the words of an honest man."},{"num":29,"verse":"An evil man is stubborn, but a godly man will reconsider."},{"num":30,"verse":"No one, regardless of how shrewd or well-advised he is, can stand against the Lord."},{"num":31,"verse":"Go ahead and prepare for the conflict, but victory comes from God."}]