[{"header":"Worshipping the gold bull calf"},{"num":32,"verse":"The people saw that Moses was taking a long time to come down from the mountain. They gathered around Aaron and said to him, “Come on! Make us gods who can lead us. As for this man Moses who brought us up out of the land of Egypt, we don’t have a clue what has happened to him.”"},{"num":2,"verse":"Aaron said to them, “All right, take out the gold rings from the ears of your wives, your sons, and your daughters, and bring them to me.”"},{"num":3,"verse":"So all the people took out the gold rings from their ears and brought them to Aaron."},{"num":4,"verse":"He collected them and tied them up in a cloth. Then he made a metal image of a bull calf, and the people declared, “These are your gods, Israel, who brought you up out of the land of Egypt!”"},{"num":5,"verse":"When Aaron saw this, he built an altar in front of the calf. Then Aaron announced, “Tomorrow will be a festival to the Lord!”"},{"num":6,"verse":"They got up early the next day and offered up entirely burned offerings and brought well-being sacrifices. The people sat down to eat and drink and then got up to celebrate."},{"num":7,"verse":"The Lord spoke to Moses: “Hurry up and go down! Your people, whom you brought up out of the land of Egypt, are ruining everything!"},{"num":8,"verse":"They’ve already abandoned the path that I commanded. They have made a metal bull calf for themselves. They’ve bowed down to it and offered sacrifices to it and declared, ‘These are your gods, Israel, who brought you up out of the land of Egypt!’”"},{"num":9,"verse":"The Lord said to Moses, “I’ve been watching these people, and I’ve seen how stubborn they are."},{"num":10,"verse":"Now leave me alone! Let my fury burn and devour them. Then I’ll make a great nation out of you.”"},{"num":11,"verse":"But Moses pleaded with the Lord his God, “Lord, why does your fury burn against your own people, whom you brought out of the land of Egypt with great power and amazing force?"},{"num":12,"verse":"Why should the Egyptians say, ‘He had an evil plan to take the people out and kill them in the mountains and so wipe them off the earth’? Calm down your fierce anger. Change your mind about doing terrible things to your own people."},{"num":13,"verse":"Remember Abraham, Isaac, and Israel, your servants, whom you yourself promised, ‘I’ll make your descendants as many as the stars in the sky. And I’ve promised to give your descendants this whole land to possess for all time.’”"},{"num":14,"verse":"Then the Lord changed his mind about the terrible things he said he would do to his people."},{"num":15,"verse":"Moses then turned around and came down the mountain. He carried the two covenant tablets in his hands. The tablets were written on both sides, front and back."},{"num":16,"verse":"The tablets were God’s own work. What was written there was God’s own writing inscribed on the tablets."},{"num":17,"verse":"When Joshua heard the noise of the people as they shouted, he said to Moses, “It sounds like war in the camp.”"},{"num":18,"verse":"But Moses said,"},{"num":19,"verse":"When he got near the camp and saw the bull calf and the dancing, Moses was furious. He hurled the tablets down and shattered them in pieces at the foot of the mountain."},{"num":20,"verse":"He took the calf that they had made and burned it in a fire. Then he ground it down to crushed powder, scattered it on the water, and made the Israelites drink it."},{"num":21,"verse":"Moses said to Aaron, “What did these people do to you that you led them to commit such a terrible sin?”"},{"num":22,"verse":"Aaron replied, “Don’t get angry with me, sir. You know yourself that these people are out of control."},{"num":23,"verse":"They said to me, ‘Make us gods who can lead us. As for this man Moses who brought us up out of the land of Egypt, we don’t have a clue what has happened to him.’"},{"num":24,"verse":"So I said to them, ‘Whoever has gold, take it off!’ So they gave it to me, I threw it into the fire, and out came this bull calf!”"},{"num":25,"verse":"Moses saw that the people were out of control because Aaron had let them get out of control, making them an easy target for their enemies."},{"num":26,"verse":"So Moses stood at the camp’s gate and said, “Whoever is on the Lord’s side, come to me!” All the Levites gathered around him."},{"num":27,"verse":"Moses said to them, “This is what the Lord, Israel’s God, says: Each of you, strap on your sword! Go back and forth from one end of the camp to the other. Each of you, kill your brother, your friend, and your neighbor!”"},{"num":28,"verse":"The Levites did as Moses commanded. About three thousand people were killed that day."},{"num":29,"verse":"Moses said, “Today you’ve been ordained to the Lord, each one of you at the cost of a son or a brother. Today you’ve gained a special blessing for yourselves.”"},{"num":30,"verse":"The next day Moses said to the people, “You’ve committed a terrible sin. So now I will go up to the Lord. Maybe I can arrange reconciliation on account of your sin.”"},{"num":31,"verse":"So Moses went back to the Lord and said, “Oh, what a terrible sin these people have committed! They made for themselves gods of gold."},{"num":32,"verse":"But now, please forgive their sin! And if not, then wipe me out of your scroll that you’ve written.”"},{"num":33,"verse":"But the Lord said to Moses, “The ones I’ll wipe out of my scroll are those who sinned against me."},{"num":34,"verse":"Now go and lead the people to the place I described to you. My messenger here will go in front of you. When the day of reckoning comes, I’ll count their sin against them.”"},{"num":35,"verse":"Then the Lord sent a plague on the people because of what they did with the bull calf that Aaron made."}]