[{"header":"The Golden Calf"},{"num":32,"verse":"Now when the people saw that Moses delayed coming down from the mountain, the people gathered themselves together around Aaron and said to him, “Come, make us gods which will go before us. As for this Moses, the man who brought us up out of the land of Egypt, we do not know what has become of him.”"},{"num":2,"verse":"Aaron said to them, “Break off the gold earrings that are in the ears of your wives, your sons, and your daughters, and bring them to me.” "},{"num":3,"verse":"So all the people broke off the gold earrings that were in their ears and brought them to Aaron. "},{"num":4,"verse":"He received them from their hand, and fashioned it with an engraving tool, and made it into a molded calf. Then they said, “This is your god, O Israel, who brought you up from the land of Egypt.”"},{"num":5,"verse":"When Aaron saw it, he built an altar before it. And Aaron made a proclamation and said, “Tomorrow will be a feast to the Lord.” "},{"num":6,"verse":"So they rose up early on the next day, and offered burnt offerings, and brought peace offerings. And the people sat down to eat and to drink, and rose up to play."},{"num":7,"verse":"The Lord spoke to Moses, “Go, and get down, for your people, whom you brought out of the land of Egypt, have corrupted themselves. "},{"num":8,"verse":"They have quickly turned aside from the way which I commanded them. They have made for themselves a molded calf, and have worshipped it, and have sacrificed to it, and said, ‘This is your god, O Israel, which has brought you up from the land of Egypt.’ ”"},{"num":9,"verse":"Then the Lord said to Moses, “I have seen this people, and certainly, it is a stiff-necked people. "},{"num":10,"verse":"Now therefore let Me alone, so that My wrath may burn against them and I may destroy them. And I will make of you a great nation.”"},{"num":11,"verse":"But Moses sought the favor of the Lord his God, and said, “Lord, why does Your wrath burn against Your people, whom You have brought forth from the land of Egypt with great power and with a mighty hand? "},{"num":12,"verse":"Why should the Egyptians speak, saying, ‘With evil intent He brought them out, to kill them in the mountains and to destroy them from the face of the earth’? Turn from Your fierce wrath and relent of this harm against Your people. "},{"num":13,"verse":"Remember Abraham, Isaac, and Israel, Your servants, to whom You swore by Yourself, and said to them, ‘I will multiply your descendants as the stars of the heavens, and all this land that I have spoken of will I give to your descendants, and they will inherit it forever.’ ” "},{"num":14,"verse":"Then the Lord relented of the harm which He said He would do to His people."},{"num":15,"verse":"Moses turned and went down from the mountain with the two tablets of testimony in his hand. The tablets were written on both their sides. They were written on one side and on the other. "},{"num":16,"verse":"The tablets were God’s work, and the writing was God’s writing, engraved on the tablets."},{"num":17,"verse":"When Joshua heard the noise of the people as they shouted, he said to Moses, “There is a sound of war in the camp.”"},{"num":18,"verse":"But he said:"},{"num":19,"verse":"As soon as he came near the camp, he saw the calf and the dancing, and Moses’ anger burned, so he threw the tablets from his hands and shattered them at the bottom of the mountain. "},{"num":20,"verse":"Then he took the calf which they had made and burned it in the fire, ground it to powder, and scattered it on the water, and made the children of Israel drink it."},{"num":21,"verse":"Moses said to Aaron, “What did this people do to you, that you have brought so great a sin upon them?”"},{"num":22,"verse":"Aaron said, “Do not let the anger of my lord burn. You know that the people are set on evil. "},{"num":23,"verse":"For they said to me, ‘Make a god for us which will go before us, for this Moses, the man that brought us up from the land of Egypt, we do not know what has become of him.’ "},{"num":24,"verse":"I said to them, ‘Whoever has any gold, let them break it off.’ So they gave it to me, and then I threw it into the fire, and this calf came out.’ ”"},{"num":25,"verse":"Now when Moses saw the people were in a frenzy, for Aaron had let them get completely out of control, causing derision from their enemies, "},{"num":26,"verse":"then Moses stood in the gate of the camp and said, “Whoever is on the Lord’s side, come to me.” And all the Levites gathered themselves together around him."},{"num":27,"verse":"He said to them, “Thus says the Lord, the God of Israel, ‘Every man fasten his sword on his side, and go back and forth from gate to gate throughout the camp, and let every man kill his brother, and every man his friend, and every man his neighbor.’ ” "},{"num":28,"verse":"The Levites did according to the word of Moses, and about three thousand men of the people died that day. "},{"num":29,"verse":"For Moses had said, “Consecrate yourselves today to the Lord, that He may bestow a blessing on you this day, for every man opposes his son and his brother.”"},{"num":30,"verse":"On the next day Moses said to the people, “You have committed a great sin, and now I will go up to the Lord. Perhaps I can make atonement for your sin.”"},{"num":31,"verse":"Then Moses returned to the Lord and said, “Oh, this people has committed a great sin and have made a god of gold for themselves. "},{"num":32,"verse":"Yet now, if You will, forgive their sin, but if not, I pray, blot me out of Your book which You have written.”"},{"num":33,"verse":"Then the Lord said to Moses, “Whoever has sinned against Me, I will blot him out of My book. "},{"num":34,"verse":"So go now, lead the people to the place of which I have spoken to you. Indeed, My angel will go before you. Nevertheless in the day when I punish, I will indeed punish them for their sin.”"},{"num":35,"verse":"And the Lord plagued the people because they had made the calf, the one that Aaron made."}]