[{"header":"The Gold Calf"},{"num":32,"verse":"When the people saw that Moses was staying a long time before coming down from the mountain, they gathered around Aaron, and said, “Come, make a god for us who will go in front of us. For we do not know what has become of Moses, the man who brought us out of the land of Egypt.” "},{"num":2,"verse":"Aaron said to them, “Take the objects of gold from the ears of your wives, your sons and your daughters, and bring them to me.” "},{"num":3,"verse":"So all the people took the gold objects from their ears and brought them to Aaron. "},{"num":4,"verse":"He took the gold from their hands, worked on it with a sharp tool, and by melting it, made it into a calf. Then they said, “This is your god, O Israel, who brought you out of the land of Egypt.” "},{"num":5,"verse":"When Aaron saw this, he built an altar in front of it. Aaron said to all the people, “Tomorrow will be a special supper to the Lord.” "},{"num":6,"verse":"So the next day they got up early and gave burnt gifts and peace gifts. The people sat down to eat and drink, and got up to play."},{"num":7,"verse":"Then the Lord said to Moses, “Go down. For your people, whom you brought out of the land of Egypt, have turned to sin. "},{"num":8,"verse":"They have been quick to turn aside from the way I have told them. They have melted gold and made a calf for themselves. They have worshiped it, have given gifts to it, and have said, ‘This is your god, O Israel, who brought you out of the land of Egypt!’” "},{"num":9,"verse":"The Lord said to Moses, “I have seen this people, and see, they are a strong-willed people. "},{"num":10,"verse":"Now let Me alone, so My anger may be against them and I may destroy them. But I will make you into a great nation.”"},{"num":11,"verse":"Then Moses begged the Lord his God, saying, “O Lord, why are you very angry against Your people whom You brought out of the land of Egypt with great power and a strong hand? "},{"num":12,"verse":"Why should the Egyptians say, ‘He brought them out to kill them in the mountains and destroy them from the earth’? Turn from Your anger and change Your mind about destroying Your people. "},{"num":13,"verse":"Remember Abraham, Isaac and Israel, who were your servants. You promised them by Yourself, saying, ‘I will make your children become as many as the stars of the heavens. And I will give all this land I have spoken about to your children. It will be theirs forever.’” "},{"num":14,"verse":"So the Lord changed His mind about the things He said He would do to His people."},{"num":15,"verse":"Then Moses turned and went down from the mountain with the two stone writings of the Law in his hand. The stones were written on both sides, on one side and the other. "},{"num":16,"verse":"The stone writings were God’s work. The writing was God’s writing cut into the stones. "},{"num":17,"verse":"When Joshua heard the sound of the people as they made noise, he said to Moses, “There is a sound of war at the tents.” "},{"num":18,"verse":"But Moses said, “It is not the sound of winning, or the sound of losing. It is the sound of singing I hear.” "},{"num":19,"verse":"As soon as Moses came near the tents, he saw the calf and the dancing. Moses became very angry. He threw the stone writings from his hands and broke them at the base of the mountain. "},{"num":20,"verse":"And he took the calf they had made and burned it with fire, ground it to dust, spread it over the top of the water, and made the people of Israel drink it."},{"num":21,"verse":"Then Moses said to Aaron, “What did this people do to you to make you bring such great sin upon them?” "},{"num":22,"verse":"Aaron said, “Do not let my lord be angry. You know the people yourself and how sinful they are."},{"num":23,"verse":"They said to me, ‘Make a god for us who will go in front of us. For we do not know what has become of Moses, the man who brought us out of the land of Egypt.’ "},{"num":24,"verse":"And I said to them, ‘Whoever has any gold, let them take it off.’ So they gave it to me. I threw it into the fire and out came this calf.”"},{"num":25,"verse":"Moses saw that Aaron had let the people go wild and become a shame to those who hated them. "},{"num":26,"verse":"So Moses stood in the gate of the place where they had set up their tents and said, “Whoever is for the Lord, come to me!” And all the sons of Levi came together around him. "},{"num":27,"verse":"He said to them, “This is what the Lord, the God of Israel, says: ‘Every man put his sword on his thigh. And go from one end of the tents to the other, and each one kill his brother, his friend, and his neighbor.’” "},{"num":28,"verse":"So the sons of Levi did as Moses said. About 3,000 men fell that day. "},{"num":29,"verse":"Then Moses said, “Today you have set yourselves apart for the Lord. For each man has been against his son and against his brother, so the Lord may bring good to you today.”"},{"num":30,"verse":"The next day Moses said to the people, “You have sinned. Now I am going up to the Lord. It might be that I can have your sin forgiven.” "},{"num":31,"verse":"Then Moses returned to the Lord and said, “O, this people have sinned. They have made a god of gold for themselves. "},{"num":32,"verse":"But now, if You will, forgive their sin. If not, then take my name out of Your book which You have written.” "},{"num":33,"verse":"The Lord said to Moses, “I will put out of My book whoever has sinned against Me. "},{"num":34,"verse":"But go now. Lead the people where I told you. See, My angel will go before you. But in the day when I punish, I will punish them for their sin.” "},{"num":35,"verse":"Then the Lord sent trouble upon the people, because of what they did with the calf Aaron had made."}]