[{"num":32,"verse":"And when HaAm saw that Moshe delayed to come down from HaHar, HaAm gathered themselves together unto Aharon, and said unto him, Up, make us elohim (g-ds), which shall go before us; for as for this Moshe, the ish that brought us up out of Eretz Mitzrayim, we know not what is become of him."},{"num":2,"verse":"And Aharon said unto them, Take off the rings of zahav in the ears of your nashim, of your banim, and of your banot, and bring them unto me."},{"num":3,"verse":"And kol HaAm removed the rings of zahav which were in their ears, and brought them unto Aharon."},{"num":4,"verse":"And he received them at their yad, and fashioned it with a cheret, after he had made it an Egel Masekhah (Molten Calf); and they said, These be thy elohim, O Yisroel, which brought thee up out of Eretz Mitzrayim."},{"num":5,"verse":"And when Aharon saw it, he built a Mizbe’ach before it; and Aharon made proclamation, and said, Tomorrow is a chag (feast) to Hashem."},{"num":6,"verse":"And they rose up early the next day, and offered olot, and brought shelamim; and HaAm sat down to eat and to drink, and rose up letzachek (to revel)."},{"num":7,"verse":"And Hashem said unto Moshe, Go, get thee down; for thy people, which thou broughtest out of Eretz Mitzrayim, have corrupted themselves;"},{"num":8,"verse":"They have turned aside quickly from HaDerech which I commanded them; they have made them an Egel Masekhah, and have bowed down to it, and have sacrificed thereunto, and said, These be thy elohim, O Yisroel, which have brought thee up out of the Eretz Mitzrayim."},{"num":9,"verse":"And Hashem said unto Moshe, I have seen this people, and, hinei, it is an Am Kesheh Oref (stiffnecked, obstinate people);"},{"num":10,"verse":"Now therefore let Me alone, that My wrath may burn hot against them, and that I may consume them; I will make of thee a Goy Gadol."},{"num":11,"verse":"And Moshe besought Hashem Elohav, and said, Hashem, why doth Thy wrath burn hot against Thy people, which Thou hast brought forth out of Eretz Mitzrayim with ko’ach gadol, and with a yad chazakah?"},{"num":12,"verse":"Why should the Egyptians speak, and say, For ra’ah (evil intent) did He bring them out, to slay them in the mountains, and to consume them from the face of ha’adamah? Turn from Thy fierce wrath, and relent of the ra’ah against Thy people."},{"num":13,"verse":"Remember Avraham, Yitzchak, and Yisroel, Thy avadim, to whom Thou swore by Thine own Self, and saidst unto them, I will multiply your zera as the kokhavim of Shomayim, and kol haaretz hazot that I have spoken of will I give unto your zera, and they shall inherit it l’olam."},{"num":14,"verse":"And Hashem relented of the ra’ah which He thought to do unto His people."},{"num":15,"verse":"And Moshe turned, and went down from HaHar, and the two Luchot HaEdut were in his yad; the Luchot were written on both their sides; on the one side and on the other were they written."},{"num":16,"verse":"And the Luchot were the ma’aseh Elohim, the writing was the Mikhtav Elohim, engraved upon the Luchot."},{"num":17,"verse":"And when Yehoshua heard the kol HaAm as they shouted, he said unto Moshe, There is a noise of milchamah in the machaneh."},{"num":18,"verse":"And he said, It is not the voice of them that shout for gevurah, neither is it the voice of them that cry of chalushah; but the noise of them that sing that I hear."},{"num":19,"verse":"And it came to pass, as soon as he came nigh unto the machaneh, that he saw the Egel, and the mecholot (dancing); and the anger of Moshe burned hot, and he threw the Luchot out of his hands, and broke them at the foot of HaHar."},{"num":20,"verse":"And he took the Egel which they had made, and burned it in the eish, and ground it to powder, and scattered it upon the mayim, and made the Bnei Yisroel drink of it."},{"num":21,"verse":"And Moshe said unto Aharon, What did this people unto thee, that thou hast brought so chata’ah gedolah upon them?"},{"num":22,"verse":"And Aharon said, Let not the anger of adoni burn hot; thou knowest HaAm, that they are prone to rah (evil)."},{"num":23,"verse":"For they said unto me, Make for us elohim, which shall go before us; for as for this Moshe, the ish that brought us up out of Eretz Mitzrayim, we know not what is become of him."},{"num":24,"verse":"And I said unto them, Whosoever hath any zahav, let them remove it. So they gave it me; then I cast it into the eish, and there came out this Egel."},{"num":25,"verse":"And when Moshe saw that HaAm were exposed; (for Aharon had exposed them to derision among their enemies;)"},{"num":26,"verse":"Then Moshe stood in the sha’ar of the machaneh, and said, Who is on Hashem’s side? Let him rally unto me. And all the Bnei Levi gathered themselves together unto him."},{"num":27,"verse":"And he said unto them, Thus saith Hashem Elohei Yisroel, Put every man his cherev by his side, and go in and out from sha’ar to sha’ar throughout the machaneh, and slay every man his brother, and every man his companion, and every man his neighbor."},{"num":28,"verse":"And the Bnei Levi did according to the word of Moshe; and there fell of HaAm that day about three thousand men."},{"num":29,"verse":"For Moshe had said, Consecrate yourselves today to Hashem, even every man against his ben, and against his brother; that He may bestow upon you a brocha this day."},{"num":30,"verse":"And it came to pass on the next day, that Moshe said unto HaAm, Ye have sinned a chata’ah gedolah; and now I will go up unto Hashem; perhaps I can make kapporah for your chattat."},{"num":31,"verse":"And Moshe returned unto Hashem, and said, Oh, this people have sinned a chata’ah gedolah, and have made for themselves elohei zahav."},{"num":32,"verse":"Yet now, if Thou wilt forgive their chattat but if not, blot me, now, out of Thy Sefer which Thou hast written."},{"num":33,"verse":"And Hashem said unto Moshe, Whosoever hath sinned against Me, him will I blot out of My Sefer."},{"num":34,"verse":"Therefore now go, lead HaAm unto the place of which I have spoken unto thee; hinei, Malachi shall go before thee; nevertheless in the yom when I visit I will visit their sin upon them."},{"num":35,"verse":"And Hashem plagued HaAm, because they made the Egel, which Aharon made."}]