[{"header":"The Sons of Aaron"},{"num":3,"verse":"These are the people of Aaron and Moses at the time when the Lord spoke with Moses on Mount Sinai. "},{"num":2,"verse":"The names of the sons of Aaron are Nadab the first-born, Abihu, Eleazar and Ithamar. "},{"num":3,"verse":"These are the names of the sons of Aaron, the chosen religious leaders. Aaron set them apart to work as religious leaders. "},{"num":4,"verse":"But Nadab and Abihu died before the Lord when they made a fire that was not holy to the Lord in the Desert of Sinai. And they had no children. So Eleazar and Ithamar worked as religious leaders during the life-time of their father Aaron."},{"header":"The Levites Serve in the Meeting Tent"},{"num":5,"verse":"Then the Lord said to Moses, "},{"num":6,"verse":"“Bring the family of Levi near. Set them in front of Aaron the religious leader so they may serve him. "},{"num":7,"verse":"They will do the duties for him and for all the people in front of the meeting tent. They will do the work around the meeting tent, "},{"num":8,"verse":"and will keep all the things that belong to the meeting tent. They will take care of the duties for the people of Israel as they work around the meeting tent. "},{"num":9,"verse":"You will give the Levites to Aaron and his sons. They are all given to him from among the people of Israel. "},{"num":10,"verse":"Set apart Aaron and his sons to do the work of religious leaders. But if anyone comes near who is not a religious leader, he must be put to death.”"},{"num":11,"verse":"The Lord said to Moses, "},{"num":12,"verse":"“See, I have taken the Levites from among the people of Israel instead of every first-born among the people of Israel. The Levites will be Mine. "},{"num":13,"verse":"For all the first-born are Mine. On the day that I killed all the first-born in the land of Egypt, I set apart for My own all the first-born in Israel, both man and animal. They will be Mine. I am the Lord.”"},{"header":"The Levites Are Numbered"},{"num":14,"verse":"Then the Lord said to Moses in the Desert of Sinai, "},{"num":15,"verse":"“Number the sons of Levi by their fathers’ houses and by their families. Number every male a month old and older.” "},{"num":16,"verse":"So Moses numbered them just as he had been told by the word of the Lord. "},{"num":17,"verse":"The names of the sons of Levi are Gershon, Kohath and Merari. "},{"num":18,"verse":"The names of the sons of Gershon by their families are Libni and Shimei. "},{"num":19,"verse":"The sons of Kohath by their families are Amram, Izhar, Hebron and Uzziel. "},{"num":20,"verse":"The sons of Merari by their families are Mahli and Mushi. These are the families of the Levites by their fathers’ houses."},{"num":21,"verse":"Of Gershon were the families of the Libnites and the Shimeites. These were the families of the Gershonites. "},{"num":22,"verse":"The number of their men, every male a month old and older, was 7,500. "},{"num":23,"verse":"The families of the Gershonites were to set up their tents behind the meeting tent on the west side. "},{"num":24,"verse":"The leader of the fathers’ houses of the Gershonites was Eliasaph the son of Lael. "},{"num":25,"verse":"The sons of Gershon were to take care of the meeting tent, its covering, and the curtain for the door of the meeting tent. "},{"num":26,"verse":"And they were to take care of the curtains for the door of the open space, and all curtains around the meeting tent and the altar and their ropes. They did all the work having to do with them."},{"num":27,"verse":"Of Kohath were the families of the Amramites, the Izharites, the Hebronites and the Uzzielites. These were the families of the Kohathites. "},{"num":28,"verse":"The number of every male a month old and older was 8,600. They did the duties of the holy place. "},{"num":29,"verse":"The families of the sons of Kohath were to set up their tents on the south side of the meeting tent. "},{"num":30,"verse":"The leader of the fathers’ houses of the Kohathite families was Elizaphan the son of Uzziel. "},{"num":31,"verse":"They took care of the special box with the Law, and the table, the lamp-stand, the altars, the things used in the holy place, and the curtain. They did all the work having to do with them. "},{"num":32,"verse":"Eleazar, the son of Aaron the religious leader, was the head of the leaders of Levi. He watched over those who did the duties of the holy place."},{"num":33,"verse":"Of Merari were the families of the Mahlites and the Mushites. These were the families of Merari. "},{"num":34,"verse":"The number of their men, every male a month old and older, was 6,200. "},{"num":35,"verse":"The leader of the fathers’ houses of the families of Merari was Zuriel the son of Abihail. They were to set up their tents on the north side of the meeting tent. "},{"num":36,"verse":"The duties given to the sons of Merari were to take care of the parts made of wood of the meeting tent, its cross pieces, its pillars, its bases, and all the pieces that had to do with them. They took care of all these things, "},{"num":37,"verse":"and of the pillars around the open space and their bases and their nails and their ropes."},{"num":38,"verse":"Moses and Aaron and his sons were to set up their tents on the east side in front of the meeting tent, toward the sunrise. They did the duties of the meeting tent, whatever had to be done for the people of Israel. But the one who came near who was not a religious leader was to be put to death. "},{"num":39,"verse":"The number of all the Levite men a month old and older, whom Moses and Aaron numbered by their families as the Lord told them, was 22,000."},{"header":"Levites Take the Place of First-Born Sons"},{"num":40,"verse":"The Lord said to Moses, “Number every first-born male of the sons of Israel a month old and older. Write down their names. "},{"num":41,"verse":"Take the Levites for Me, instead of all the first-born among the sons of Israel. I am the Lord. And take the cattle of the Levites instead of all the first-born among the cattle of the people of Israel.” "},{"num":42,"verse":"So Moses numbered all the first-born among the sons of Israel, just as the Lord had told him. "},{"num":43,"verse":"The number of names of all the first-born males a month old and older was 22,273."},{"num":44,"verse":"Then the Lord said to Moses, "},{"num":45,"verse":"“Take the Levites instead of all the first-born sons of Israel, and the cattle of the Levites. The number of the Levites will be Mine. I am the Lord. "},{"num":46,"verse":"There are 273 first-born of the sons of Israel, who are more in number than the Levites. You must pay the price for each of them. "},{"num":47,"verse":"Take five pieces of silver for each, by the weight of silver agreed upon for the meeting tent. "},{"num":48,"verse":"Give the money, the price of those who are more in number than the Levites, to Aaron and his sons.” "},{"num":49,"verse":"So Moses took the money to pay for those who were more in number than the Levites. "},{"num":50,"verse":"He took the money from the first-born sons of Israel, by the weight agreed upon for the meeting tent. He took 1,365 pieces of silver. "},{"num":51,"verse":"Then Moses gave the money to Aaron and his sons, just as the Lord had told Moses by His Word."}]