[{"num":3,"verse":"At that time (when the Eternal One spoke with Moses on Mount Sinai), the lineage of Aaron and Moses went like this: "},{"num":2,"verse":"Aaron’s sons were Nadab (the eldest), Abihu, Eleazar, and Ithamar—"},{"num":3,"verse":"actually, they were his sons who were anointed as priests, who were supposed to work as priests. "},{"num":4,"verse":"But Nadab and Abihu perished in the presence of the Eternal when they failed to follow God’s instructions and offered profane fire at Sinai. They didn’t have any children. The other two, Eleazar and Ithamar, carried on as priests for Aaron’s lifetime."},{"num":5,"verse":"Then the Eternal One told Moses,"},{"num":11,"verse":"And the Eternal One spoke later to Moses."},{"num":14,"verse":"God formerly gave these instructions to Moses in the wild desert area of Sinai."},{"num":16,"verse":"So Moses did just as the Eternal One told him. "},{"num":17,"verse":"Levi’s three sons were Gershon, Kohath, and Merari. "},{"num":18,"verse":"Gershon’s sons, by their clans, were Libni and Shimei. "},{"num":19,"verse":"Kohath’s sons, by their clans, were Amram, Izhar, Hebron, and Uzziel. "},{"num":20,"verse":"Merari’s sons, by their clans, were Mahli and Mushi. These, remember, are specifically the Levite clans by their extended families."},{"num":21,"verse":"So within Gershon were the Libnite and Shimeite clans. "},{"num":22,"verse":"Counting just the males one month old and older, 7,500 were organized. "},{"num":23,"verse":"They camped in the area behind the congregation tent on the west. "},{"num":24,"verse":"Eliasaph (Lael’s son) served as head of the Gershonite extended family. "},{"num":25,"verse":"Their jobs were to take care of everything related to the congregation tent, both the place of revelation and its covering, the screen for the congregation tent’s entrance, "},{"num":26,"verse":"the curtains for the court surrounding the place of revelation and the altar, its entrance screen, the ropes, and anything else for the tent."},{"num":27,"verse":"Within Kohath were the Amramite, Izharite, Hebronite, and Uzzielite clans. "},{"num":28,"verse":"Counting just the males one month old and older, there were 8,600 who worked for the sacred place. "},{"num":29,"verse":"They camped on the south side of the congregation tent. "},{"num":30,"verse":"Uzziel’s son, Elizaphan, was their head. "},{"num":31,"verse":"These Kohathites were to take care of everything associated with the chest, the table, the lampstand, the altars, and the furnishings of the sanctuary that the priests use, the screen, and anything else inside the sacred place. "},{"num":32,"verse":"Priest Aaron’s son, Eleazar, was head of the Levite leaders. He was in charge of overseeing the people who took care of the sacred place."},{"num":33,"verse":"Within Merari were the Mahlite and Mushite clans, "},{"num":34,"verse":"of whom 6,200 males one month or older were organized. "},{"num":35,"verse":"Abihail’s son, Zuriel, was their leader. They were instructed to camp on the northern side of the tent area, "},{"num":36,"verse":"and their work was to maintain the planks of the tent, its bars, posts, and sockets; plus all the furnishings and any other wood items; "},{"num":37,"verse":"as well as the posts surrounding the courtyard together with their sockets, pegs, and ropes."},{"num":38,"verse":"Moses, Aaron, and Aaron’s sons camped in front of the congregation tent, on the east facing sunrise, where they worked according to the needs of the sanctuary and on behalf of the Israelites. If an outsider trespassed in this area, he would be killed. "},{"num":39,"verse":"The total number of Levites whom Moses and Aaron organized, according to the Eternal’s command, were 22,273. These males, one month or older, Moses listed by name."},{"num":49,"verse":"So Moses did all that concerning the substitute price, just as the Eternal commanded, and it amounted to 47,775 pounds of metal."}]