[[],[{"type":"prose","content":"And these [are] births of Aaron and Moses, in the day of Jehovah's speaking with Moses in mount Sinai."}],[{"type":"prose","content":"And these [are] the names of the sons of Aaron: the first-born Nadab, and Abihu, Eleazar, and Ithamar;"}],[{"type":"prose","content":"these [are] the names of the sons of Aaron, the anointed priests, whose hand he hath consecrated for acting as priest."}],[{"type":"prose","content":"And Nadab dieth -- Abihu also -- before Jehovah, in their bringing near strange fire before Jehovah, in the wilderness of Sinai, and sons they had not; and Eleazar -- Ithamar also -- acteth as priest in the presence of Aaron their father."}],[{"type":"prose","content":"And Jehovah speaketh unto Moses, saying,"}],[{"type":"prose","content":"`Bring near the tribe of Levi, and thou hast caused it to stand before Aaron the priest, and they have served him,"}],[{"type":"prose","content":"and kept his charge, and the charge of all the company before the tent of meeting, to do the service of the tabernacle;"}],[{"type":"prose","content":"and they have kept all the vessels of the tent of meeting, and the charge of the sons of Israel, to do the service of the tabernacle;"}],[{"type":"prose","content":"and thou hast given the Levites to Aaron and to his sons; they are surely given to him out of the sons of Israel."}],[{"type":"prose","content":"`And Aaron and his sons thou dost appoint, and they have kept their priesthood, and the stranger who cometh near is put to death.'"}],[{"type":"prose","content":"And Jehovah speaketh unto Moses, saying,"}],[{"type":"prose","content":"`And I, lo, I have taken the Levites from the midst of the sons of Israel instead of every first-born opening a womb among the sons of Israel, and the Levites have been Mine;"}],[{"type":"prose","content":"for Mine [is] every first-born, in the day of My smiting every first-born in the land of Egypt I have sanctified to Myself every first-born in Israel, from man unto beast; Mine they are; I [am] Jehovah.'"}],[{"type":"prose","content":"And Jehovah speaketh unto Moses in the wilderness of Sinai, saying,"}],[{"type":"prose","content":"`Number the sons of Levi by the house of their fathers, by their families; every male from a son of a month and upward thou dost number them.'"}],[{"type":"prose","content":"And Moses numbereth them according to the command of Jehovah, as he hath been commanded."}],[{"type":"prose","content":"And these are sons of Levi by their names: Gershon, and Kohath, and Merari."}],[{"type":"prose","content":"And these [are] the names of the sons of Gershon by their families: Libni and Shimei."}],[{"type":"prose","content":"And the sons of Kohath, by their families, [are] Amram and Izhar, Hebron and Uzziel."}],[{"type":"prose","content":"And the sons of Merari by their families [are] Mahli and Mushi; these are the families of the Levites, by the house of their fathers."}],[{"type":"prose","content":"Of Gershon [is] the family of the Libnite, and the family of the Shimite; these are the families of the Gershonite."}],[{"type":"prose","content":"Their numbered ones, in number, every male from a son of a month and upward, their numbered ones [are] seven thousand and five hundred."}],[{"type":"prose","content":"The families of the Gershonite, behind the tabernacle, do encamp westward."}],[{"type":"prose","content":"And the prince of a father's house for the Gershonite [is] Eliasaph son of Lael."}],[{"type":"prose","content":"And the charge of the sons of Gershon in the tent of meeting [is] the tabernacle, and the tent, its covering, and the vail at the opening of the tent of meeting,"}],[{"type":"prose","content":"and the hangings of the court, and the vail at the opening of the court, which [is] by the tabernacle and by the altar round about, and its cords, to all its service."}],[{"type":"prose","content":"And of Kohath [is] the family of the Amramite, and the family of the Izharite, and the family of the Hebronite, and the family of the Uzzielite; these are families of the Kohathite."}],[{"type":"prose","content":"In number, all the males, from a son of a month and upward, [are] eight thousand and six hundred, keeping the charge of the sanctuary."}],[{"type":"prose","content":"The families of the sons of Kohath encamp by the side of the tabernacle southward."}],[{"type":"prose","content":"And the prince of a father's house for the families of the Kohathite [is] Elizaphan son of Uzziel."}],[{"type":"prose","content":"And their charge [is] the ark, and the table, and the candlestick, and the altars, and the vessels of the sanctuary with which they serve, and the vail, and all its service."}],[{"type":"prose","content":"And [to] the prince of the princes of the Levites, Eleazar son of Aaron the priest, [is] the oversight of the keepers of the charge of the sanctuary."}],[{"type":"prose","content":"Of Merari [is] the family of the Mahlite, and the family of the Mushite; these [are] the families of Merari."}],[{"type":"prose","content":"And their numbered ones, in number, all the males from a son of a month and upward, [are] six thousand and two hundred."}],[{"type":"prose","content":"And the prince of a father's house for the families of Merari [is] Zuriel son of Abihail; by the side of the tabernacle they encamp northward."}],[{"type":"prose","content":"And the oversight -- the charge of the sons of Merari -- [is] the boards of the tabernacle, and its bars, and its pillars, and its sockets, and all its vessels, and all its service,"}],[{"type":"prose","content":"and the pillars of the court round about, and their sockets, and their pins, and their cords."}],[{"type":"prose","content":"And those encamping before the tabernacle eastward, before the tent of meeting, at the east, [are] Moses and Aaron, and his sons, keeping the charge of the sanctuary for the charge of the sons of Israel, and the stranger who cometh near is put to death."}],[{"type":"prose","content":"All those numbered of the Levites whom Moses numbered -- Aaron also -- by the command of Jehovah, by their families, every male from a son of a month and upward, [are] two and twenty thousand."}],[{"type":"prose","content":"And Jehovah saith unto Moses, `Number every first-born male of the sons of Israel from a son of a month and upward, and take up the number of their names;"}],[{"type":"prose","content":"and thou hast taken the Levites for Me (I [am] Jehovah), instead of every first-born among the sons of Israel, and the cattle of the Levites instead of every firstling among the cattle of the sons of Israel.'"}],[{"type":"prose","content":"And Moses numbereth, as Jehovah hath commanded him, all the first-born among the sons of Israel."}],[{"type":"prose","content":"And all the first-born -- male -- by the number of names, from a son of a month and upward, of their numbered ones, are two and twenty thousand two hundred and seventy and three."}],[{"type":"prose","content":"And Jehovah speaketh unto Moses, saying,"}],[{"type":"prose","content":"`Take the Levites instead of every first-born among the sons of Israel, and the cattle of the Levites instead of their cattle; and the Levites have been Mine; I [am] Jehovah."}],[{"type":"prose","content":"`And [from] those ransomed of the two hundred and seventy and three (who are more than the Levites) of the first-born of the sons of Israel,"}],[{"type":"prose","content":"thou hast even taken five shekels a-piece by the poll -- by the shekel of the sanctuary thou takest; twenty gerahs the shekel [is];"}],[{"type":"prose","content":"and thou hast given the money to Aaron, and to his sons, whereby those over and above are ransomed.'"}],[{"type":"prose","content":"And Moses taketh the ransom money from those over and above those ransomed by the Levites;"}],[{"type":"prose","content":"from the first-born of the sons of Israel he hath taken the money, a thousand and three hundred and sixty and five -- by the shekel of the sanctuary;"}],[{"type":"prose","content":"and Moses giveth the money of those ransomed to Aaron, and to his sons, according to the command of Jehovah, as Jehovah hath commanded Moses."}]]