[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall burn them with fire seven years.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The representation of this and the following verse, that the weapons of the army of Gog shall furnish the whole nation of Israel with fuel for seven years, cannot, of course, be understood literally, and seems to have been inserted by the prophet to show that we are to look for the meaning of his prophecy beyond any literal event of earthly warfare.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 39:11-16 again present the magnitude of the attack upon the Church by describing the burial of the host after it is slain. The language, if it could be supposed it was meant to be literally understood, would be even more extravagant than that of Ezekiel 39:9-10. The whole nation of Israel is represented as engaged for seven months in burying the bodies (Ezekiel 39:12-13); after this an indefinite time is to be occupied by one corps of men appointed to search the land for still remaining bones, and by another who are to bury them.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:11-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " again present the magnitude of the attack upon the Church by describing the burial of the host after it is slain. The language, if it could be supposed it was meant to be literally understood, would be even more extravagant than that of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The whole nation of Israel is represented as engaged for seven months in burying the bodies (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); after this an indefinite time is to be occupied by one corps of men appointed to search the land for still remaining bones, and by another who are to bury them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39:1-10 The Lord will make the most careless and hardened transgressors know his holy name, either by his righteous anger, or by the riches of his mercy and grace. The weapons formed against Zion shall not prosper. Though this prophecy is to be fulfilled in the latter days, it is certain. From the language used, it seems that the army of Gog will be destroyed by miracle.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Zechariah has a similar figure, as descriptive of the time of the Messiah:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rejoice greatly, O daughter of Zion;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shout, O daughter of Jerusalem;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold, thy king cometh unto thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And I will cut off the chariot from Ephraim,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the horse from Jerusalem,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the battle bow shal be cut off, etc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 39:9Burn them with fire - Or, \"kindle fire with them;\" or, as in the margin. The weapons of the army left on the field of battle shall be so numerous as to supply fuel for the people of the land for seven years. Seven was a number connected with cleansing after contact with the dead (Numbers 19:11 ff), and this purification of the land by the clearance of paganish spoils was a holy work (compare Ezekiel 39:12). ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Burn them with fire - Or, \"kindle fire with them;\" or, as in the margin. The weapons of the army left on the field of battle shall be so numerous as to supply fuel for the people of the land for seven years. Seven was a number connected with cleansing after contact with the dead (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 19:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ff), and this purification of the land by the clearance of paganish spoils was a holy work (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9, 10. The burning of the foe's weapons implies that nothing belonging to them should be left to pollute the land. The seven years (seven being the sacred number) spent on this work, implies the completeness of the cleansing, and the people's zeal for purity. How different from the ancient Israelites, who left not merely the arms, but the heathen themselves, to remain among them [Fairbairn], (Jud 1:27, 28; 2:2, 3; Ps 106:34-36). The desolation by Antiochus began in the one hundred and forty-first year of the Seleucidæ. From this date to 148, a period of six years and four months (\"2300 days,\" Da 8:14), when the temple-worship was restored (1 Maccabees 4:52), God vouchsafed many triumphs to His people; from this time to the death of Antiochus, early in 149, a period of seven months, the Jews had rest from Antiochus, and purified their land, and on the twenty-fifth day of the ninth month celebrated the Encænia, or feast of dedication (Joh 10:22) and purification of the temple. The whole period, in round numbers, was seven years. Mattathias was the patriotic Jewish leader, and his third son, Judas, the military commander under whom the Syrian generals were defeated. He retook Jerusalem and purified the temple. Simon and Jonathan, his brothers, succeeded him: the independence of the Jews was secured, and the crown vested in the Asmonean family, in which it continued till Herod the Great.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall go forth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " out of their houses and out of the cities, with joy to see and admire the great goodness of God towards them, and the greatness of his power against their enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall set on fire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": this expression seems to intimate that they should burn these things in the open field or mountains, where they found them; here is no mention made of the carrying any into city or houses, to burn in their chimneys: it may be they should make those fires in token of joy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The weapons; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the warlike provision, instruments, engines, carriages, and waggons, &c., as well as those recounted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The shields:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 38:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The hand-staves, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that either their leaders used, like our halfpikes, or perhaps such as they cast like darts at the enemy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall burn them with fire seven years:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it may be wondered they burn these weapons, which might be of use to them for defence and safety; but it was done, partly, because they were weapons of the uncircumcised; partly, because they were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "anathemata",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as all Jericho was; but chiefly, in testimony that God was their safety and defence, on which they relied, and would ever since he had so wonderfully delivered, We might read the words thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they shall kindle with them a fire of seven years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and then the sense would be plain, that there should be such store of weapons and warlike utensils, that, heaped together, they would last so long, being cast into the fire still by such as found them; for it is not unlike they gathered up the weapons, as they did scattered bones, on their walks, as they lighted on them. Others tell us it is a certain number for an uncertain; others, that it is somewhat a proverbial speech, they shall have enough by the spoil of the enemy to make them and keep them warm, much as we sometimes say of one well provided, He is a warm gentleman; and some others tell us it is an expression of the Jews, who love to use this number in extraordinary cases, though they intend not precisely the same, as we say of a thing delayed, It will be seven years ere it come, or of a thing that will serve us a good while, It will last seven years. Or else, since the Hebrew hath not a distinct way of declaring what might be, or the potential mood, as the Latin, but they express possible by future, and say, that shall be, which we express by that may be, the meaning of these futures, they shall, in this and the next verse, is no more than, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "they may or might burn for seven years; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and so Kimchi glosseth it as to countenance this last guess. They shall be sufficient; and in such a country, where the need of fire is much less than with us, it will not seem very incredible that the warlike utensils of so numerous an army might be enough to furnish them with fuel for so many years, or more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they that dwell in the cities of Israel shall go forth,.... Out of their houses into the streets, where Gog's soldiers will lie dead, and their armour by them; or rather out of their cities, where they dwelt safely, and where they kept themselves, and were secure from the enemy: these seem to be distinct from the militia of Israel, engaged in battle with Gog; these were the inhabitants that will stay at home, and yet share in the spoil and plunder; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", these, after the battle is over, and the victory obtained, of which they will have information, will then march out without fear into the open fields and mountains, where the army of Gog will fall, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 39:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall set on fire and burn the weapons; the armour of Gog's army, which they shall find lie by the dead, or upon them; or which they that flee will cast away; these they shall gather together, and lay on a heap, and burn, as sometimes has been the practice of conquerors; or rather they shall take them to their own houses, and make fuel of them, and burn them, instead of wood out of the fields and forests, as the following verse shows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "both the shields and the bucklers, the bows and the arrows; which were the weapons that Gog and his associates used; see Ezekiel 38:4, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "both the shields and the bucklers, the bows and the arrows; which were the weapons that Gog and his associates used; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the handstaves, and the spears; the \"handstaves\" were either half pikes or truncheons, as some think; or javelins, as others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall burn them with fire seven years; which some take to be a certain number for an uncertain, and others an hyperbolical expression; but when it is considered what a vast army this of Gog's will be, and what prodigious numbers of weapons of all sorts must be carried by them, and the little use of fire in those hot countries: it may be very well taken in a literal sense, and the meaning be, that so great will be the quantity of warlike weapons that will be found and gathered, that they will serve for fuel for the space of seven years. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they shall burn them with fire seven years; which some take to be a certain number for an uncertain, and others an hyperbolical expression; but when it is considered what a vast army this of Gog's will be, and what prodigious numbers of weapons of all sorts must be carried by them, and the little use of fire in those hot countries: it may be very well taken in a literal sense, and the meaning be, that so great will be the quantity of warlike weapons that will be found and gathered, that they will serve for fuel for the space of seven years. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they that dwell in the cities of Israel shall {e} go forth, and shall set on fire and burn the weapons, both the shields and the bucklers, the bows and the arrows, and the javelins, and the spears, and they shall burn them with fire seven years:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And they that dwell in the cities of Israel shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " go forth, and shall set on fire and burn the weapons, both the shields and the bucklers, the bows and the arrows, and the javelins, and the spears, and they shall burn them with fire seven years:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) After this destruction the Church will have great peace and tranquillity and burn all their weapons because they will no more fear the enemies. This chiefly refers to the accomplishment of Christ's kingdom when by their head Christ all enemies will be overcome.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The wood of the weapons of Gog’s warriors shall serve the people of Israel as fuel for seven years, they shall go neither to gather faggots for fire in the fields nor to cut down any wood out of the forests (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 39:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "set on fire and burn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "make fire of the weapons and burn them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—i.e. they shall use them as fuel. The “handstaves” are probably those with which the animals ridden upon or others were driven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "burn them with fire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "make fire of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 9, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " set forth as the first proof of the greatness of Gog's overthrow the immense booty in the shape of weapons of war which should be obtained by the inhabitants of the cities of Israel. So huge should be the quantity of weapons left behind by the slain, that the Israelites should ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "burn them with fire seven years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This burning of the weapons has been explained by Havernick, on the ground that weapons of war, as incompatible with Messianic times, should be no more required (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); by Ewald, as in accordance with the custom of the Hebrews (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and other ancient peoples (Livy, 38:23; Virgil, 'AEneid,' 8:562); by Hitzig and Smend, as prompted by the consideration that Israel, for whom Jehovah had fought, should have no further need of weapons; by Schroder, as indicating that for Israel these warlike instruments should then so completely lose their power to terrify that they might be looked upon simply as so much firewood; and by Keil, as designed to annihilate the enemy and remove every trace of him. Kliefoth appears nearest the mark, in suggesting that the emphasis lies upon the length of time the burning should continue; and that this was intended, by conveying an idea of the vastness of the spoil, to represent the thoroughness of Gog's destruction and of Israel's deliverance. That the whole delineation is symbolical appears from the number of years the weapons are said to serve for fuel, viz. seven, and from the character of the weapons themselves, which, if not entirely wooden, were at least all combustible. Of the \"armor\" generally (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נֶשֶׁק",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"something joined,\" from a root signifying \"to join\") the pieces mentioned - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the shields and the bucklers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the bows and arrows",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see ver. 3), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the hand-staves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "javelins",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (margin), perhaps, as Hitzig and Smend suggest, the staff with which a horseman strikes his beast (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and the spears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - were mostly composed of timber. When all should have been given to the flames, it would then appear that on their late owners the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "lex talionis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had worked out its literal avengement, that they who had intended to despoil Israel were themselves spoiled; and they who hoped to plunder Israel were themselves plundered (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Ezekiel 39:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Total Destruction of Gog and his Hosts",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 39:9. Then will the inhabitants of the cities of Israel go forth, and burn and heat with armour and shield and target, with bow and arrows and hand-staves and spears, and will burn fire with them for seven years; Ezekiel 39:10. And will not fetch wood from the field, nor cut wood out of the forests, but will burn fire with the armour, and will spoil those who spoiled them, and plunder those who plundered them, is the saying of the Lord Jehovah. Ezekiel 39:11. And it will come to pass in that day, that I will give Gog a place where his grave in Israel shall be, the valley of the travellers, and there will they bury Gog and all his multitude, and will call it the valley of Gog's multitude. Ezekiel 39:12. They of the house of Israel will bury them, to purify the land for seven months. V.1 3. And all the people of the land will bury, and it will be to them for a name on the day when I glorify myself, is the saying of the Lord Jehovah. Ezekiel 39:14. And they will set apart constant men, such as rove about in the land, and such as bury with them that rove about those who remain upon the surface of the ground, to cleanse it, after the lapse of seven months will they search it through. Ezekiel 39:15. And those who rove about will pass through the land; and if one sees a man's bone, he will set up a sign by it, till the buriers of the dead bury it in the valley of the multitude of Gog. Ezekiel 39:16. The name of a city shall also be called Hamonah (multitude). And thus will they cleanse the land. Ezekiel 39:17. And thou, son of man, thus saith the Lord Jehovah, Say to the birds of every plumage, and to all the beasts of the field, Assemble yourselves, and come, gather together from round about to my sacrifice, which I slaughter for you, to a great sacrifice upon the mountains of Israel, and eat flesh and drink blood. Ezekiel 39:18. Flesh of heroes shall ye eat, and drink blood of princes of the earth; rams, lambs, and he-goats, bullocks, all fattened in Bashan. Ezekiel 39:9. And ye shall eat fat to satiety, and drink blood to intoxication, of my sacrifice which I have slaughtered for you. Ezekiel 39:20. And ye shall satiate yourselves at my table with horses and riders, heroes and all kinds of men of war, is the saying of the Lord Jehovah. - To show how terrible the judgment upon Gog will be, Ezekiel depicts in three special ways the total destruction of his powerful forces. In the first place, the burning of all the weapons of the fallen foe will furnish the inhabitants of the land of Israel with wood for firing for seven years, so that there will be no necessity for them to fetch fuel from the field or from the forest (Ezekiel 39:9 and Ezekiel 39:10). But Hvernick is wrong in supposing that the reason for burning the weapons is that, according to Isaiah 9:5, weapons of war are irreconcilable with the character of the Messianic times of peace. This is not referred to here; but the motive is the complete annihilation of the enemy, the removal of every trace of him. The prophet therefore crowds the words together for the purpose of enumerating every kind of weapon that was combustible, even to the hand-staves which men were accustomed to carry (cf. Numbers 22:27). The quantity of the weapons will be so great, that they will supply the Israelites with all the fuel they need for seven years. The number seven in the seven years as well as in the seven months of burying (Ezekiel 39:11) is symbolical, stamping the overthrow as a punishment inflicted by God, the completion of a divine judgment.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Then will the inhabitants of the cities of Israel go forth, and burn and heat with armour and shield and target, with bow and arrows and hand-staves and spears, and will burn fire with them for seven years; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And will not fetch wood from the field, nor cut wood out of the forests, but will burn fire with the armour, and will spoil those who spoiled them, and plunder those who plundered them, is the saying of the Lord Jehovah. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And it will come to pass in that day, that I will give Gog a place where his grave in Israel shall be, the valley of the travellers, and there will they bury Gog and all his multitude, and will call it the valley of Gog's multitude. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They of the house of Israel will bury them, to purify the land for seven months. V.1 3. And all the people of the land will bury, and it will be to them for a name on the day when I glorify myself, is the saying of the Lord Jehovah. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And they will set apart constant men, such as rove about in the land, and such as bury with them that rove about those who remain upon the surface of the ground, to cleanse it, after the lapse of seven months will they search it through. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And those who rove about will pass through the land; and if one sees a man's bone, he will set up a sign by it, till the buriers of the dead bury it in the valley of the multitude of Gog. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The name of a city shall also be called Hamonah (multitude). And thus will they cleanse the land. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And thou, son of man, thus saith the Lord Jehovah, Say to the birds of every plumage, and to all the beasts of the field, Assemble yourselves, and come, gather together from round about to my sacrifice, which I slaughter for you, to a great sacrifice upon the mountains of Israel, and eat flesh and drink blood. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Flesh of heroes shall ye eat, and drink blood of princes of the earth; rams, lambs, and he-goats, bullocks, all fattened in Bashan. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And ye shall eat fat to satiety, and drink blood to intoxication, of my sacrifice which I have slaughtered for you. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And ye shall satiate yourselves at my table with horses and riders, heroes and all kinds of men of war, is the saying of the Lord Jehovah. - To show how terrible the judgment upon Gog will be, Ezekiel depicts in three special ways the total destruction of his powerful forces. In the first place, the burning of all the weapons of the fallen foe will furnish the inhabitants of the land of Israel with wood for firing for seven years, so that there will be no necessity for them to fetch fuel from the field or from the forest (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But Hvernick is wrong in supposing that the reason for burning the weapons is that, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", weapons of war are irreconcilable with the character of the Messianic times of peace. This is not referred to here; but the motive is the complete annihilation of the enemy, the removal of every trace of him. The prophet therefore crowds the words together for the purpose of enumerating every kind of weapon that was combustible, even to the hand-staves which men were accustomed to carry (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 22:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The quantity of the weapons will be so great, that they will supply the Israelites with all the fuel they need for seven years. The number seven in the seven years as well as in the seven months of burying (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is symbolical, stamping the overthrow as a punishment inflicted by God, the completion of a divine judgment.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "With the gathering of the weapons for burning there is associated the plundering of the fallen foe (Ezekiel 39:10), by which the Israelites do to the enemy what he intended to do to them (Ezekiel 38:12), and the people of God obtain possession of the wealth of their foes (cf. Jeremiah 30:16). In the second place, God will assign a large burying-place for the army of Gog in a valley of Israel, which is to be named in consequence \"the multitude of Gog;\" just as a city in that region will also be called Hamonah from this event. The Israelites will bury the fallen of Gog there for seven months long, and after the expiration of that time they will have the land explored by men specially appointed for the purpose, and bones that may still have been left unburied will be sought out, and they will have them interred by buriers of the dead, that the land may be thoroughly cleansed (Ezekiel 39:11-16). מקום שׁם, a place where there was a grave in Israel, i.e., a spot in which he might be buried in Israel. There are different opinions as to both the designation and the situation of this place. There is no foundation for the supposition that גּי העברים derives its name from the mountains of Abarim in Numbers 27:12 and Deuteronomy 32:49 (Michaelis, Eichhorn), or that it signifies valley of the haughty ones (Ewald), or that there is an allusion to the valley mentioned in Zechariah 14:4 (Hitzig), or the valley of Jehoshaphat (Kliefoth). The valley cannot even have derived its name (העברים) from the עברים, who passed through the land to search out the bones of the dead that still remained unburied, and have them interred (Ezekiel 39:14, Ezekiel 39:15). For העברים cannot have any other meaning here than that which it has in the circumstantial clause which follows, where those who explored the land cannot possibly be intended, although even this clause is also obscure. The only other passage in which חסם occurs is Deuteronomy 25:4, where it signifies a muzzle, and in the Arabic it means to obstruct, or cut off; and hence, in the passage before us, probably, to stop the way. העברים are not the Scythians (Hitzig), for the word עבר is never applied to their invasion of the land, but generally the travellers who pass through the land, or more especially those who cross from Peraea to Canaan. The valley of העברים is no doubt the valley of the Jordan above the Dead Sea. The definition indicates this, viz., קדמת, on the front of the sea; not to the east of the sea, as it is generally rendered, for קדמת never has this meaning (see the comm. on Genesis 2:14). By היּם we cannot understand \"the Mediterranean,\"as the majority of the commentators have done, as there would then be no meaning in the words, since the whole of the land of Israel was situated to the east of the Mediterranean Sea. היּם is the Dead Sea, generally called היּם הקּדמוני (Ezekiel 47:18); and קדמת, \"on the front side of the (Dead) Sea,\" as looked at from Jerusalem, the central point of the land, is probably the valley of the Jordan, the principal crossing place from Gilead into Canaan proper, and the broadest part of the Jordan-valley, which was therefore well adapted to be the burial-place for the multitude of slaughtered foes. But in consequence of the army of Gog having there found its grave, this valley will in future block up the way to the travellers who desire to pass to and fro. This appears to be the meaning of the circumstantial clause.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With the gathering of the weapons for burning there is associated the plundering of the fallen foe (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), by which the Israelites do to the enemy what he intended to do to them (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the people of God obtain possession of the wealth of their foes (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In the second place, God will assign a large burying-place for the army of Gog in a valley of Israel, which is to be named in consequence \"the multitude of Gog;\" just as a city in that region will also be called Hamonah from this event. The Israelites will bury the fallen of Gog there for seven months long, and after the expiration of that time they will have the land explored by men specially appointed for the purpose, and bones that may still have been left unburied will be sought out, and they will have them interred by buriers of the dead, that the land may be thoroughly cleansed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:11-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). מקום שׁם, a place where there was a grave in Israel, i.e., a spot in which he might be buried in Israel. There are different opinions as to both the designation and the situation of this place. There is no foundation for the supposition that גּי העברים derives its name from the mountains of Abarim in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 27:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Michaelis, Eichhorn), or that it signifies valley of the haughty ones (Ewald), or that there is an allusion to the valley mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Hitzig), or the valley of Jehoshaphat (Kliefoth). The valley cannot even have derived its name (העברים) from the עברים, who passed through the land to search out the bones of the dead that still remained unburied, and have them interred (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For העברים cannot have any other meaning here than that which it has in the circumstantial clause which follows, where those who explored the land cannot possibly be intended, although even this clause is also obscure. The only other passage in which חסם occurs is ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it signifies a muzzle, and in the Arabic it means to obstruct, or cut off; and hence, in the passage before us, probably, to stop the way. העברים are not the Scythians (Hitzig), for the word עבר is never applied to their invasion of the land, but generally the travellers who pass through the land, or more especially those who cross from Peraea to Canaan. The valley of העברים is no doubt the valley of the Jordan above the Dead Sea. The definition indicates this, viz., קדמת, on the front of the sea; not to the east of the sea, as it is generally rendered, for קדמת never has this meaning (see the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). By היּם we cannot understand \"the Mediterranean,\"as the majority of the commentators have done, as there would then be no meaning in the words, since the whole of the land of Israel was situated to the east of the Mediterranean Sea. היּם is the Dead Sea, generally called היּם הקּדמוני (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 47:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and קדמת, \"on the front side of the (Dead) Sea,\" as looked at from Jerusalem, the central point of the land, is probably the valley of the Jordan, the principal crossing place from Gilead into Canaan proper, and the broadest part of the Jordan-valley, which was therefore well adapted to be the burial-place for the multitude of slaughtered foes. But in consequence of the army of Gog having there found its grave, this valley will in future block up the way to the travellers who desire to pass to and fro. This appears to be the meaning of the circumstantial clause.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From the fact that Gog's multitude is buried there, the valley itself will receive the name of Hamon-Gog. The Israelites will occupy seven months in burying them, so enormously great will be the number of the dead to be buried (Ezekiel 39:12), and this labour will be for a name, i.e., for renown, to the whole nation. This does not mean, of course, \"that it will be a source of honour to them to assist in this work;\" nor is the renown to be sought in the fact, that as a privileged people, protected by God, they can possess the grave of Gog in their land (Hitzig), - a thought which is altogether remote, and perfectly foreign to Israelitish views; but the burying of Gog's multitude of troops will be for a name to the people of Israel, inasmuch as they thereby cleanse the land and manifest their zeal to show themselves a holy people by sweeping all uncleanness away. יום is an accusative of time: on the day when I glorify myself. - Ezekiel 39:14, Ezekiel 39:15. The effort made to cleanse the land perfectly from the uncleanness arising from the bones of the dead will be so great, that after the great mass of the slain have been buried in seven months, there will be men specially appointed to bury the bones of the dead that still lie scattered here and there about the land. אנשׁי תּמיד are people who have a permanent duty to discharge. The participles עברים and מקבּרים are co-ordinate, and are written together asyndetos, men who go about the land, and men who bury with those who go about. That the words are to be understood in this sense is evident from Ezekiel 39:15, according to which those who go about do not perform the task of burying, but simply search for bones that have been left, and put up a sign for the buriers of the dead. ראה, with the subject indefinite; if one sees a human bone, he builds (erects) a ציּוּן, or stone, by the side of it (cf. 2 Kings 23:17). - Ezekiel 39:16. A city shall also receive the name of Hamonah, i.e., multitude or tumult. To שׁם־עיר we may easily supply יהיה from the context, since this puts in the future the statement, \"the name of the city is,\" for which no verb was required in Hebrew. In the last words, וטהרוּ הארץ, the main thought is finally repeated and the picture brought to a close. - Ezekiel 39:17-20. In the third place, God will provide the birds of prey and beasts of prey with an abundant meal from this slaughter. This cannot be understood as signifying that only what remain of the corpses, and have not been cleared away in the manner depicted in Ezekiel 39:11-16, will become the prey of wild beasts; but the beasts of prey will make their meal of the corpses before it is possible to bury them, since the burying cannot be effected immediately or all at once. - The several features in the picture, of the manner in which the enemies are to be destroyed till the last trace of them is gone, are not arranged in chronological order, but according to the subject-matter; and the thought that the slaughtered foes are to become the prey of wild beasts is mentioned last as being the more striking, because it is in this that their ignominious destruction culminates. To give due prominence to this thought, the birds and beasts of prey are summoned by God to gather together to the meal prepared for them. The picture given of it as a sacrificial meal is based upon Isaiah 34:6 and Jeremiah 46:10. In harmony with this picture the slaughtered foes are designated as fattened sacrificial beasts, rams, lambs, he-goats, bullocks; on which Grotius has correctly remarked, that \"these names of animals, which were generally employed in the sacrifices, are to be understood as signifying different orders of men, chiefs, generals, soldiers, as the Chaldee also observes.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From the fact that Gog's multitude is buried there, the valley itself will receive the name of Hamon-Gog. The Israelites will occupy seven months in burying them, so enormously great will be the number of the dead to be buried (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and this labour will be for a name, i.e., for renown, to the whole nation. This does not mean, of course, \"that it will be a source of honour to them to assist in this work;\" nor is the renown to be sought in the fact, that as a privileged people, protected by God, they can possess the grave of Gog in their land (Hitzig), - a thought which is altogether remote, and perfectly foreign to Israelitish views; but the burying of Gog's multitude of troops will be for a name to the people of Israel, inasmuch as they thereby cleanse the land and manifest their zeal to show themselves a holy people by sweeping all uncleanness away. יום is an accusative of time: on the day when I glorify myself. - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The effort made to cleanse the land perfectly from the uncleanness arising from the bones of the dead will be so great, that after the great mass of the slain have been buried in seven months, there will be men specially appointed to bury the bones of the dead that still lie scattered here and there about the land. אנשׁי תּמיד are people who have a permanent duty to discharge. The participles עברים and מקבּרים are co-ordinate, and are written together asyndetos, men who go about the land, and men who bury with those who go about. That the words are to be understood in this sense is evident from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", according to which those who go about do not perform the task of burying, but simply search for bones that have been left, and put up a sign for the buriers of the dead. ראה, with the subject indefinite; if one sees a human bone, he builds (erects) a ציּוּן, or stone, by the side of it (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A city shall also receive the name of Hamonah, i.e., multitude or tumult. To שׁם־עיר we may easily supply יהיה from the context, since this puts in the future the statement, \"the name of the city is,\" for which no verb was required in Hebrew. In the last words, וטהרוּ הארץ, the main thought is finally repeated and the picture brought to a close. - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:17-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In the third place, God will provide the birds of prey and beasts of prey with an abundant meal from this slaughter. This cannot be understood as signifying that only what remain of the corpses, and have not been cleared away in the manner depicted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:11-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", will become the prey of wild beasts; but the beasts of prey will make their meal of the corpses before it is possible to bury them, since the burying cannot be effected immediately or all at once. - The several features in the picture, of the manner in which the enemies are to be destroyed till the last trace of them is gone, are not arranged in chronological order, but according to the subject-matter; and the thought that the slaughtered foes are to become the prey of wild beasts is mentioned last as being the more striking, because it is in this that their ignominious destruction culminates. To give due prominence to this thought, the birds and beasts of prey are summoned by God to gather together to the meal prepared for them. The picture given of it as a sacrificial meal is based upon ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 34:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In harmony with this picture the slaughtered foes are designated as fattened sacrificial beasts, rams, lambs, he-goats, bullocks; on which Grotius has correctly remarked, that \"these names of animals, which were generally employed in the sacrifices, are to be understood as signifying different orders of men, chiefs, generals, soldiers, as the Chaldee also observes.\" ",
            "children": []
          }
        ]
      }
    ]
  }
]