[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-7 Faith in God's promises ought not to do away, but to encourage our diligence in the use of proper means. The providence of God directed the spies to the house of Rahab. God knew where there was one that would be true to them, though they did not. Rahab appears to have been an innkeeper; and if she had formerly been one of bad life, which is doubtful, she had left her evil courses. That which seems to us most accidental, is often overruled by the Divine providence to serve great ends. It was by faith that Rahab received those with peace, against whom her king and country had war. We are sure this was a good work; it is so spoken of by the apostle, Jas 2:25; and she did it by faith, such a faith as set her above the fear of man. Those only are true believers, who find in their hearts to venture for God; they take his people for their people, and cast in their lot among them. The spies were led by the special providence of God, and Rahab entertained them out of regard to Israel and Israel's God, and not for lucre or for any evil purpose. Though excuses may be offered for the guilt of Rahab's falsehood, it seems best to admit nothing which tends to explain it away. Her views of the Divine law must have been very dim: a falsehood like this, told by those who enjoy the light of revelation, whatever the motive, would deserve heavy censure.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I wist not whence they were - Rahab acted as she did from the belief in God's declared word, and conviction that resistance to His will would be both vain and wicked ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus, she manifested a faith both sound and practical, and is praised accordingly ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 2:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The falsehood to which she had recourse may be excused by the pressure of circumstances and by her own antecedents, but cannot be defended. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. the time of shutting of the gates—The gates of all Oriental cities are closed at sunset, after which there is no possibility either of admission or egress.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the men went out—This was a palpable deception. But, as lying is a common vice among heathen people, Rahab was probably unconscious of its moral guilt, especially as she resorted to it as a means for screening her guests; and she might deem herself bound to do it by the laws of Eastern hospitality, which make it a point of honor to preserve the greatest enemy, if he has once eaten one's salt. Judged by the divine law, her answer was a sinful expedient; but her infirmity being united with faith, she was graciously pardoned and her service accepted (Jas 2:25).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The time of shutting of the gate; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either of her house, or rather of the city, which was shut at a certain time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass, about the time of the shutting of the gate,.... Of the city, which was done every night, and at a certain time: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when it was dark; the sun set, and night come on: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that the men went out; out of her house, and out of the city too, as she said, though it was a downright lie, as well as what follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whither the men went I wot not; though she knew they were not gone, but were now in her house; she might not scruple telling a lie, being brought up a Heathen, and being done with a design to save the lives of persons that belonged to a people she was persuaded were the people of God, and to whom he had given the land; though her lies are not to be justified; evil is not to be done that good may come; nor are men to tell lies one to another upon any account; but these sins, with others, the Lord forgave her: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "pursue after them quickly, and ye shall overtake them; this she encouraged them to do, to get rid of them the sooner, and to remove all suspicion of her having any respect for them, and of being concerned in concealing them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "pursue after them quickly, and ye shall overtake them; this she encouraged them to do, to get rid of them the sooner, and to remove all suspicion of her having any respect for them, and of being concerned in concealing them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it came to pass about the time of shutting of the gate, when it was dark, that the men went out: whither the men went I wot not: pursue after them quickly; for ye shall overtake them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shutting of the gate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A necessary precaution owing to the absence of all artificial light from the streets of Oriental towns.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when it was dark",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In the East, night comes on soon after sundown, and the evening twilight is of very short duration.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I wot not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Strict truth was a virtue but little known or practised in ancient times, and Rahab must not be judged by the same standard of morality as we should apply to our own days. “By faith the harlot Rahab perished not with them that believed not” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). “It would be a mistake, an anachronism, to apply to a dweller in one of the old Canaanite cities, amidst the worshippers of false and cruel deities, destitute of one ray either of Law or Gospel light, principles of conduct and character which we owe to the Revelation of all truth and all duty by our Lord Jesus Christ. The Epistle is content to say only this, Behold in the example of this woman the working of that faith which grasps the unseen. Behold the action of faith upon evidence presented and upon an alternative of conduct. Behold the inference of truth honestly drawn, and the preference, on the strength of it, of the future to the present. Behold, St James adds (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 2:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), how faith differs from opinion, and evidences its existence by the sign of work. The hearts of other inhabitants of Jericho were melting, she tells us, with the terror of Israel,—she alone acted upon the conviction, and added another element to the ‘great cloud of witnesses.’ ” Dr Vaughan’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Heroes of Faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 263, 264.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I wot not.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Much has Been said about Rahab's falsehood which is little to the point. The sacred historian simply narrates the fact, and makes no comment whatever upon it. But the fact that Rahab afterwards became the wife of Salmon, a prince of the tribe of Judah, as the genealogy in St. Matthew informs us (though Knobel denies this, asserting that between Joshua and David there were more than three generations, forgetting that Boaz, when he married Ruth, was an old man, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ruth 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), shows that neither her falsehood nor her mode of life excited much disapprobation among the Jews. Nor need this surprise us. There is no need, with Keil, to repudiate energetically the assertion of Hauff that the author of this Book regarded Rahab's deception as not only allowable, but praiseworthy, any more than we need scruple to confess that Jael's base treachery met with the approval of Deborah and Barak. The tone of feeling in Jewish society in Rahab's day must have differed enormously in many respects from what obtains in our own time, in the light of the dispensation of the Spirit. We may take, as an instance of what that tone of feeling was, even before Israel had been corrupted by their sojourn in Egypt, the narrative in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And we may be sure that in a Phoenician city the tone was many degrees lower still. Rahab, therefore, was no doubt absolutely ignorant that there was any sin, either in her mode of living or in the lie she told to save the men's lives. She acted from a twofold motive, and her course, both of thought and action, was a most surprising instance of faith and insight, in one brought up as she had been. She not only followed an instinct of humanity, at a time when human life was thought of little value, in preserving the lives of the men who had sought shelter under her roof, but she could discern in the wonderful successes of Israel the hand of a higher power than that of the gods whom she had been brought up to worship. In her subsequent conduct she betrayed an affection for her kindred somewhat uncommon in persons situated similarly to herself. And we may be sure, from the fact that she was chosen to be a \"mother in Israel,\" that she forsook the sins of her country and her education as soon as she came within the range of a higher light (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 2:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). From what has been said we may learn that, though Rahab's faith was \"as a grain of mustard seed,\" her conduct showed that she possessed it; and in hers, as in every case, to walk by the light she had was a sure prelude to the possession of more. And as regards her departure from truth here, it must be shown, before she can be blamed, that she had any idea that truthfulness was a duty. Such a duty does not appear to have been clearly recognised until He who was Himself the truth came among men. \"However the guilt of Rahab's falsehood may be extenuated, it seems best to admit nothing which may tend to explain it away. We are sure that God discriminated between what was good in her conduct and what was bad; rewarding the former, and pardoning the latter. Her views of the Divine law must have been exceedingly dim and contracted. A similar falsehood, told by those who enjoy the light of revelation, however laudable the motive, would of course deserve a much heavier censure\" (Matthew Henry). So also Calvin ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in loc.,\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Vitium virtuti admistum non imputatur.\" Joshua 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the king of Jericho was informed of the fact that these strange men had entered the house of Rahab, and suspecting their reason for coming, summoned Rahab to give them up, she hid them (lit., hid him, i.e., each one of the spies: for this change from the plural to the singular see Ewald, 219), and said to the king's messengers: כּן, recte, \"It is quite correct, the men came to me, but I do not know where they were from; and when in the darkness the gate was at the shutting (i.e., ought to be shut: for this construction, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), they went out again, I know not whither. Pursue them quickly, you will certainly overtake them.\" The writer then adds this explanation in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : she had hidden them upon the roof of her house among stalks of flax. The expression \"to-night\" (lit., the night) in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is more precisely defined in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz., as night was coming on, before the town-gate was shut, after which it would have been in vain for them to attempt to leave the town. \"Stalks of flax,\" not \"cotton pods\" (Arab., J. D. Mich. ), or \"tree-flax, i.e., cotton,\" as Thenius explains it, but flax stalks or stalk-flax, as distinguished from carded flax, in which there is no wood left, λινοκαλάμη, stipula lini (lxx, Vulg.). Flax stalks, which grow to the height of three or four feet in Egypt, and attain the thickness of a reed, and would probably be quite as large in the plain of Jericho, the climate of which resembles that of Egypt, would form a very good hiding-place for the spies if they were piled up upon the roof to dry in the sun. The falsehood by which Rahab sought not only to avert all suspicion from herself of any conspiracy with the Israelitish men who had entered her house, but to prevent any further search for them in her house, and to frustrate the attempt to arrest them, is not to be justified as a lie of necessity told for a good purpose, nor, as Grotius maintains, by the unfounded assertion that, \"before the preaching of the gospel, a salutary lie was not regarded as a fault even by good men.\" Nor can it be shown that it was thought \"allowable,\" or even \"praiseworthy,\" simply because the writer mentions the fact without expressing any subjective opinion, or because, as we learn from what follows (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), Rahab was convinced of the truth of the miracles which God had wrought for His people, and acted in firm faith that the true God would give the land of Canaan to the Israelites, and that all opposition made to them would be vain, and would be, in fact, rebellion against the Almighty God himself. For a lie is always a sin. Therefore even if Rahab was not actuated at all by the desire to save herself and her family from destruction, and the motive from which she acted had its roots in her faith in the living God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so that what she did for the spies, and thereby for the cause of the Lord, was counted to her for righteousness (\"justified by works,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 2:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), yet the course which she adopted was a sin of weakness, which was forgiven her in mercy because of her faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Calvin's estimate is also a correct one: \"It has often happened, that even when good men have endeavoured to keep a straight course, they have turned aside into circuitous paths. Rahab acted wrongly when she told a lie and said that the spies had gone; and the action was acceptable to God only because the evil that was mixed with the good was not imputed to her. Yet, although God wished the spies to be delivered, He did not sanction their being protected by a lie.\" Augustine also pronounces the same opinion concerning Rahab as that which he expressed concerning the Hebrew midwives (see the comm. on Exodus 1:21).) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Calvin's estimate is also a correct one: \"It has often happened, that even when good men have endeavoured to keep a straight course, they have turned aside into circuitous paths. Rahab acted wrongly when she told a lie and said that the spies had gone; and the action was acceptable to God only because the evil that was mixed with the good was not imputed to her. Yet, although God wished the spies to be delivered, He did not sanction their being protected by a lie.\" Augustine also pronounces the same opinion concerning Rahab as that which he expressed concerning the Hebrew midwives (see the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").) ",
            "children": []
          }
        ]
      }
    ]
  }
]