[{"num":145,"verse":"Praise by David. I exalt Thee, my God, O king, And bless Thy name to the age and for ever."},{"num":2,"verse":"Every day do I bless Thee, And praise Thy name to the age and for ever."},{"num":3,"verse":"Great [is] Jehovah, and praised greatly, And of His greatness there is no searching."},{"num":4,"verse":"Generation to generation praiseth Thy works, And Thy mighty acts they declare."},{"num":5,"verse":"The honour -- the glory of Thy majesty, And the matters of Thy wonders I declare."},{"num":6,"verse":"And the strength of Thy fearful acts they tell, And Thy greatness I recount."},{"num":7,"verse":"The memorial of the abundance of Thy goodness they send forth. And Thy righteousness they sing."},{"num":8,"verse":"Gracious and merciful [is] Jehovah, Slow to anger, and great in kindness."},{"num":9,"verse":"Good [is] Jehovah to all, And His mercies [are] over all His works."},{"num":10,"verse":"Confess Thee O Jehovah, do all Thy works, And Thy saints do bless Thee."},{"num":11,"verse":"The honour of Thy kingdom they tell, And [of] Thy might they speak,"},{"num":12,"verse":"To make known to sons of men His mighty acts, The honour of the majesty of His kingdom."},{"num":13,"verse":"Thy kingdom [is] a kingdom of all ages, And Thy dominion [is] in all generations."},{"num":14,"verse":"Jehovah is supporting all who are falling, And raising up all who are bowed down."},{"num":15,"verse":"The eyes of all unto Thee do look, And Thou art giving to them their food in its season,"},{"num":16,"verse":"Opening Thy hand, and satisfying The desire of every living thing."},{"num":17,"verse":"Righteous [is] Jehovah in all His ways, And kind in all His works."},{"num":18,"verse":"Near [is] Jehovah to all those calling Him, To all who call Him in truth."},{"num":19,"verse":"The desire of those fearing Him He doth, And their cry He heareth, and saveth them."},{"num":20,"verse":"Jehovah preserveth all those loving Him, And all the wicked He destroyeth."},{"num":21,"verse":"The praise of Jehovah my mouth speaketh, And all flesh doth bless His holy name, To the age and for ever!"}]