[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32:28-42 Concerning the settlement of these tribes, observe, that they built the cities, that is, repaired them. They changed the names of them; probably they were idolatrous, therefore they should be forgotten. A spirit of selfishness, of seeking our own, not the things of Christ, when each one ought to assist others, is as dangerous as it is common. It is impossible to be sincere in the faith, sensible of the goodness of God, constrained by the love of Christ, sanctified by the power of the Holy Ghost, and yet be indifferent to the progress of religion, and the spiritual success of others, through love of ease, or fear of conflict. Let then your light so shine before men, that they may see your good works, and glorify your Father which is in heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Before the Lord - i. e., immediately in front of the sacred tokens of the Lord's presence; compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28-32. concerning them Moses commanded—The arrangement itself, as well as the express terms on which he assented to it, was announced by the leader to the public authorities. The pastoral country the two tribes had desired was to be granted them on condition that they would lend their aid to their brethren in the approaching invasion of Canaan. If they refused or failed to perform their promise, those possessions should be forfeited, and they themselves compelled to go across the Jordan and fight for a settlement like the rest of their brethren.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Moses said unto them,.... To Eleazar, Joshua, and the princes of the congregation: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "if the children of Gad and the children of Reuben will pass with you over Jordan, every man armed to battle before the Lord; as they have promised they will: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the land shall be subdued before you; which must be done before their return: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then ye shall give them the land of Gilead for a possession; which, no doubt, included that of Jazer too, since Jaazer, which is the same, is after mentioned as one of the cities built by the children of Gad, Numbers 32:35. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then ye shall give them the land of Gilead for a possession; which, no doubt, included that of Jazer too, since Jaazer, which is the same, is after mentioned as one of the cities built by the children of Gad, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 32:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Moses said unto them, If the children of Gad and the children of Reuben will pass with you over Jordan, every man armed to battle, before the LORD, and the land shall be subdued before you; then ye shall give them the land of Gilead for a possession:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Moses thereupon commanded Eleazar, Joshua, and the heads of the tribes of Israel, i.e., the persons entrusted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 34:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". with the division of the land of Canaan, to give the Gadites and Reubenites the land of Gilead for a possession, after the conquest of Canaan, if they should go along with them across the Jordan equipped for battle. But if they should not do this, they were to be made possessors (i.e., to be settled; נאחז in a passive sense, whereas in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 34:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is reflective, to fix oneself firmly, to settle) in the land of Canaan along with the other tribes. In the latter case, therefore, they were not only to receive no possession in the land to the east of the Jordan, but were to be compelled to go over the Jordan with their wives and children, and to receive an inheritance there for the purpose of preventing a schism of the nation. ",
        "children": []
      }
    ]
  }
]