[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 16:14-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 16:14-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt rejoice — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In God, and in the effects of his favour, serving and praising him with a glad heart. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall all thy males appear before the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, from twenty to fifty years of age. The women were not obliged to be present at these solemnities; 1st, Because the weakness of their sex rendered them unable to bear so long a journey as many of them would have had to take, without more fatigue than would have been consistent with their health. 2d, Because the care of their children and servants demanded their presence at home. 3d, Because they were represented in the men. No doubt the chief intention of these sacred feasts was to promote piety toward God, and mutual love toward each other, among the Israelites. By the various solemn services in which they were engaged at these seasons, their minds would be awakened to a sense of the infinite importance of religion, and excited to reverence and stand in awe of the Divine Majesty, while many would be inspired unfeignedly to praise and love the Author of all their mercies. By being brought so often together from all parts of the country, their acquaintance with, and regard for each other, would be both continued and increased, and the bond of union among them, as a community, greatly strengthened. Thus also they would be preserved from the idolatrous rites and superstitious practices of their heathen neighbours, and their attachment to their own happy constitution, both civil and religious, would be confirmed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:1-17 The laws for the three yearly feasts are here repeated; that of the Passover, that of the Pentecost, that of Tabernacles; and the general law concerning the people's attendance. Never should a believer forget his low estate of guilt and misery, his deliverance, and the price it cost the Redeemer; that gratitude and joy in the Lord may be mingled with sorrow for sin, and patience under the tribulations in his way to the kingdom of heaven. They must rejoice in their receivings from God, and in their returns of service and sacrifice to him; our duty must be our delight, as well as our enjoyment. If those who were under the law must rejoice before God, much more we that are under the grace of the gospel; which makes it our duty to rejoice evermore, to rejoice in the Lord always. When we rejoice in God ourselves, we should do what we can to assist others also to rejoice in him, by comforting the mourners, and supplying those who are in want. All who make God their joy, may rejoice in hope, for He is faithful that has promised.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Feast of Weeks; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:13-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Feast of Tabernacles. Nothing is here added to the rules given in Leviticus and Numbers except the clauses so often recurring in Deuteronomy and so characteristic of it, which restrict the public celebration of the festivals to the sanctuary, and enjoin that the enjoyments of them should be extended to the Levites, widows, orphans, etc. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-17. Thou shalt observe the feast of tabernacles seven days—(See on [147]Ex 23:14; [148]Le 23:34; [149]Nu 29:12). Various conjectures have been formed to account for the appointment of this feast at the conclusion of the whole harvest. Some imagine that it was designed to remind the Israelites of the time when they had no cornfields to reap but were daily supplied with manna; others think that it suited the convenience of the people better than any other period of the year for dwelling in booths; others that it was the time of Moses' second descent from the mount; while a fourth class are of opinion that this feast was fixed to the time of the year when the Word was made flesh and dwelt—literally, \"tabernacled\"—among us (Joh 1:14), Christ being actually born at that season.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And thou shalt rejoice in thy feast,.... At this feast of tabernacles and ingathering of the fruits of the earth, in token of gratitude and thankfulness for the goodness of God bestowed on them; the Targum of Jonathan adds, with the flute and the pipe, making use of instrumental music to increase the joy on this occasion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou and thy son, &c. See Gill on Deuteronomy 16:11 ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou and thy son, &c. See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And thou shalt rejoice in thy feast, thou, and thy son, and thy daughter, and thy manservant, and thy maidservant, and the Levite, the stranger, and the fatherless, and the widow, that are within thy gates.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and thou shalt rejoice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 16:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 16:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " but slightly varied.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In connection with the Feast of Tabernacles also, he simply enforces the observance of it at the central sanctuary, and exhorts the people to rejoice at this festival, and not only to allow their sons and daughters to participate in this joy, but also the man-servant and maid-servant, and the portionless Levites, strangers, widows, and orphans. After what had already been stated, Moses did not consider it necessary to mention expressly that this festal rejoicing was also to be manifested in joyous sacrificial meals; it was enough for him to point to the blessing which God had bestowed upon their cultivation of the corn, the olive, and the vine, and upon all the works of their hands, i.e., upon their labour generally (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:13-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as there was nothing further to remark after the instructions which had already been given with reference to this feast also (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:34-36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:39-43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:12-38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]