[{"num":12,"verse":"O Lord, you always give me justice when I bring a case before you to decide. Now let me bring you this complaint: Why are the wicked so prosperous? Why are evil men so happy? "},{"num":2,"verse":"You plant them. They take root and their business grows. Their profits multiply, and they are rich. They say, “Thank God!” But in their hearts they give no credit to you. "},{"num":3,"verse":"But as for me—Lord, you know my heart—you know how much it longs for you. (And I am poor, O Lord!) Lord, drag them off like helpless sheep to the slaughter. Judge them, O God!"},{"num":4,"verse":"How long must this land of yours put up with all their goings-on? Even the grass of the field groans and weeps over their wicked deeds! The wild animals and birds have moved away, leaving the land deserted. Yet the people say, “God won’t bring judgment on us. We’re perfectly safe!”"},{"num":5,"verse":"The Lord replied to me: If racing with mere men—these men of Anathoth—has wearied you, how will you race against horses, against the king, his court, and all his evil priests? If you stumble and fall on open ground, what will you do in Jordan’s jungles? "},{"num":6,"verse":"Even your own brothers, your own family, have turned against you. They have plotted to call for a mob to lynch you. Don’t trust them, no matter how pleasantly they speak. Don’t believe them."},{"num":7,"verse":"Then the Lord said: I have abandoned my people, my inheritance; I have surrendered my dearest ones to their enemies. "},{"num":8,"verse":"My people have roared at me like a lion of the forest, so I have treated them as though I hated them. "},{"num":9,"verse":"My people have fallen. I will bring upon them swarms of vultures and wild animals to pick the flesh from their corpses."},{"num":10,"verse":"Many foreign rulers have ravaged my vineyard, trampling down the vines, and turning all its beauty into barren wilderness. "},{"num":11,"verse":"They have made it desolate; I hear its mournful cry. The whole land is desolate and no one cares. "},{"num":12,"verse":"Destroying armies plunder the land; the sword of the Lord devours from one end of the nation to the other; nothing shall escape. "},{"num":13,"verse":"My people have sown wheat but reaped thorns; they have worked hard, but it does them no good. They shall harvest a crop of shame, for the fierce anger of the Lord is upon them."},{"num":14,"verse":"And now the Lord says this to the evil nations, the nations surrounding the land God gave his people Israel: See, I will force you from your land just as Judah will be forced from hers; "},{"num":15,"verse":"but afterwards I will return and have compassion on all of you and will bring you home to your own land again, each man to his inheritance. "},{"num":16,"verse":"And if these heathen nations quickly learn my people’s ways and claim me as their God instead of Baal (whom they taught my people to worship), then they shall be strong among my people. "},{"num":17,"verse":"But any nation refusing to obey me will be expelled again and finished, says the Lord."}]