[{"header":"God reassures Moses"},{"num":6,"verse":"The Lord replied to Moses, “Now you will see what I’ll do to Pharaoh. In fact, he’ll be so eager to let them go that he’ll drive them out of his land by force.”"},{"num":2,"verse":"God also said to Moses: “I am the Lord."},{"num":3,"verse":"I appeared to Abraham, Isaac, and Jacob as God Almighty, but I didn’t reveal myself to them by my name ‘The Lord.’"},{"num":4,"verse":"I also set up my covenant with them to give them the land of Canaan where they lived as immigrants."},{"num":5,"verse":"I’ve also heard the cry of grief of the Israelites, whom the Egyptians have turned into slaves, and I’ve remembered my covenant."},{"num":6,"verse":"Therefore, say to the Israelites, ‘I am the Lord. I’ll bring you out from Egyptian forced labor. I’ll rescue you from your slavery to them. I’ll set you free with great power and with momentous events of justice."},{"num":7,"verse":"I’ll take you as my people, and I’ll be your God. You will know that I, the Lord, am your God, who has freed you from Egyptian forced labor."},{"num":8,"verse":"I’ll bring you into the land that I promised to give to Abraham, Isaac, and Jacob. I’ll give it to you as your possession. I am the Lord.’”"},{"num":9,"verse":"Moses told this to the Israelites. But they didn’t listen to Moses, because of their complete exhaustion and their hard labor."},{"num":10,"verse":"Then the Lord said to Moses,"},{"num":11,"verse":"“Go and tell Pharaoh, Egypt’s king, to let the Israelites out of his land.”"},{"num":12,"verse":"But Moses said to the Lord, “The Israelites haven’t even listened to me. How can I expect Pharaoh to listen to me, especially since I’m not a very good speaker?”"},{"num":13,"verse":"Nevertheless, the Lord spoke to Moses and Aaron about the Israelites and Pharaoh, Egypt’s king, giving them orders to let the Israelites go from the land of Egypt."},{"header":"Family line of Moses and Aaron"},{"num":14,"verse":"These were the leaders of their households."},{"num":15,"verse":"The Simeonites: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, a Canaanite woman’s son. These were Simeon’s clans."},{"num":16,"verse":"These were the Levites’ names by their generations: Gershon, Kohath, and Merari. Levi lived 137 years."},{"num":17,"verse":"The Gershonites: Libni and Shimei and their clans."},{"num":18,"verse":"The Kohathites: Amram, Izhar, Hebron, and Uzziel. Kohath lived 133 years."},{"num":19,"verse":"The Merarites: Mahli and Mushi. These were the Levite clans by their generations."},{"num":20,"verse":"Amram married Jochebed, his father’s sister. She gave birth to Aaron and Moses. Amram lived 137 years."},{"num":21,"verse":"The Izharites: Korah, Nepheg, and Zichri."},{"num":22,"verse":"The Uzzielites: Mishael, Elzaphan, and Sithri."},{"num":23,"verse":"Aaron married Elisheba, Amminadab’s daughter and Nahshon’s sister. She gave birth to Nadab, Abihu, Eleazar, and Ithamar."},{"num":24,"verse":"The Korahites: Assir, Elkanah, and Abiasaph. These were the Korahite clans."},{"num":25,"verse":"Aaron’s son Eleazar married one of Putiel’s daughters. She gave birth to Phinehas. These were the leaders of Levite households by their clans."},{"num":26,"verse":"It was this same Aaron and Moses whom the Lord commanded, “Bring the Israelites out of the land of Egypt in military formation.”"},{"num":27,"verse":"It was also this same Moses and Aaron who spoke to Pharaoh king of Egypt to bring the Israelites out of Egypt."},{"num":28,"verse":"At the time the Lord spoke to Moses in the land of Egypt,"},{"num":29,"verse":"the Lord said to him, “I am the Lord. Tell Pharaoh, Egypt’s king, everything that I’ve said to you.”"},{"num":30,"verse":"But Moses replied to the Lord, “Look, I’m not a very good speaker. How is Pharaoh ever going to listen to me?”"}]