[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will love thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dearly do I love thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The line is wanting in Samuel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My strength.—This strikes the keynote of the whole poem. The strong, mighty God is the object in David’s thought throughout. It is a warrior’s song, and his conception of Jehovah is a warrior’s conception.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "My strength.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This strikes the keynote of the whole poem. The strong, mighty God is the object in David’s thought throughout. It is a warrior’s song, and his conception of Jehovah is a warrior’s conception.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 18:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will love thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ארחמךְ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "erchamecha, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I will love thee most affectionately, and with my whole soul. I can make thee no better return for all thy favours than my love, which I pray thee to accept. By ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "loving ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the Lord, however, here and elsewhere, we are not only to understand giving him the inward affection of the soul, but also all the proper outward expressions and testimonies of it, in praising, glorifying, and serving him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Lord, my strength — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From whom alone I have received all my strength, and success, and my establishment in the peaceable possession of the kingdom, and in whom alone I trust, as it follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord is my rock and my fortress — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To which I flee for refuge, as the Israelites did to their rocks and strong holds; and as David himself did when driven into banishment by Saul, and forced to conceal himself in rocks and caverns, and to retreat for safety to steep hills and precipices rendered by nature almost inaccessible. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 23:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 23:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My buckler — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shield, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "by whom I have been protected, amidst the dangers of those perilous wars in which I have been engaged, as the soldier is by the shield in his hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The horn of my salvation — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By which I have both defended myself and subdued my enemies: a metaphor taken from the horns of animals, which are their ornament and strength; by which they both protect themselves, and assault those who oppose or injure them. The horn is frequently put for strength and power, by the sacred writers, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 92:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and elsewhere, as also for riches and dignity. The reader will observe that this verse contains a continued chain of metaphors, and is a sublime paraphrase on the first commandment, declaring that Jehovah, the God of Israel, alone, was the foundation of his confidence, and the author of his security and happiness: by whom he had been supported under his troubles, and delivered out of them; whose protection had secured him, and whose power had broken and scattered his enemies; by whose mercy and truth he was now set up on high above them all. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will call — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I did call, and was saved. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For the future tense is commonly used for that which is past. And this seems best to agree with the whole context.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-19 The first words, I will love thee, O Lord, my strength, are the scope and contents of the psalm. Those that truly love God, may triumph in him as their Rock and Refuge, and may with confidence call upon him. It is good for us to observe all the circumstances of a mercy which magnify the power of God and his goodness to us in it. David was a praying man, and God was found a prayer-hearing God. If we pray as he did, we shall speed as he did. God's manifestation of his presence is very fully described, ver. 7-15. Little appeared of man, but much of God, in these deliverances. It is not possible to apply to the history of the son of Jesse those awful, majestic, and stupendous words which are used through this description of the Divine manifestation. Every part of so solemn a scene of terrors tells us, a greater than David is here. God will not only deliver his people out of their troubles in due time, but he will bear them up under their troubles in the mean time. Can we meditate on ver. 18, without directing one thought to Gethsemane and Calvary? Can we forget that it was in the hour of Christ's deepest calamity, when Judas betrayed, when his friends forsook, when the multitude derided him, and the smiles of his Father's love were withheld, that the powers of darkness prevented him? The sorrows of death surrounded him, in his distress he prayed, Heb 5:7. God made the earth to shake and tremble, and the rocks to cleave, and brought him out, in his resurrection, because he delighted in him and in his undertaking.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will love thee, O Lord - This verse is not found in the song in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It appears to have been added after the first composition of the psalm, either by David as expressive of his ardent love for the Lord in view of his merciful interpositions in his behalf, and on the most careful and most mature review of those mercies, or by the collector of the Psalms when they were adapted to purposes of public worship, as a proper commencement of the psalm - expressive of the feeling which the general tenor of the psalm was fitted to inspire. It is impossible now to determine by whom it was added; but no one can doubt that it is a proper commencement of a psalm that is designed to recount so many mercies. It is the feeling which all should have when they recall the goodness of God to them in their past lives.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My strength - The source of my strength, or from whom all my strength is derived. So Psalm 27:1, \"The Lord is the strength of my life.\" Psalm 28:8, \"he is the saving strength of his anointed.\" Compare Psalm 29:11; Psalm 46:1; Psalm 73:26; Psalm 81:1; Psalm 140:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "My strength - The source of my strength, or from whom all my strength is derived. So ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"The Lord is the strength of my life.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 28:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"he is the saving strength of his anointed.\" Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 29:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 81:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 140:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 18",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 18:1-50. \"The servant of the Lord,\" which in the Hebrew precedes \"David,\" is a significant part of the title (and not a mere epithet of David), denoting the inspired character of the song, as the production of one entrusted with the execution of God's will. He was not favored by God because he served Him, but served Him because selected and appointed by God in His sovereign mercy. After a general expression of praise and confidence in God for the future, David gives a sublimely poetical description of God's deliverance, which he characterizes as an illustration of God's justice to the innocent and His righteous government. His own prowess and success are celebrated as the results of divine aid, and, confident of its continuance, he closes in terms of triumphant praise. 2Sa 22:1-51 is a copy of this Psalm, with a few unimportant variations recorded there as a part of the history, and repeated here as part of a collection designed for permanent use.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. I will love thee—with most tender affection.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. I will love thee—with most tender affection.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 I will love thee, O Lord, my strength.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 The Lord is my rock, and my fortress, and my deliverer; my God, my strength, in whom I will trust; my buckler, and the horn of my salvation, and my high tower.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 I will call upon the Lord, who is worthy to be praised so shall I be saved from mine enemies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 18:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I will love thee, O Lord.\" With strong, hearty affection will I cling to thee; as a child to its parent, or a spouse to her husband. The word is intensely forcible, the love is of the deepest kind. \"I will love heartily, with my inmost bowels.\" Here is a fixed resolution to abide in the nearest and most intimate union with the Most High. Our triune God deserves the warmest love of all our hearts. Father, Son and Spirit have each a claim upon our love. The solemn purpose never to cease loving naturally springs from present fervour of affection. It is wrong to make rash resolutions, but this when made in the strength of God is most wise and fitting. \"My strength.\" Our God is the strength of our life, our graces, our works, our hopes, our conflicts, our victories. This verse is not found in 1 Samuel 22, and is a most precious addition, placed above all and after all to form the pinnacle of the temple, the apex of the pyramid. Love is still the crowning grace.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"I will love thee, O Lord.\" With strong, hearty affection will I cling to thee; as a child to its parent, or a spouse to her husband. The word is intensely forcible, the love is of the deepest kind. \"I will love heartily, with my inmost bowels.\" Here is a fixed resolution to abide in the nearest and most intimate union with the Most High. Our triune God deserves the warmest love of all our hearts. Father, Son and Spirit have each a claim upon our love. The solemn purpose never to cease loving naturally springs from present fervour of affection. It is wrong to make rash resolutions, but this when made in the strength of God is most wise and fitting. \"My strength.\" Our God is the strength of our life, our graces, our works, our hopes, our conflicts, our victories. This verse is not found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and is a most precious addition, placed above all and after all to form the pinnacle of the temple, the apex of the pyramid. Love is still the crowning grace.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 18:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The Lord is my rock and my fortress.\" Dwelling among the crags and mountain fastnesses of Judea, David had escaped the malice of Saul, and here he compares his God to such a place of concealment and security. Believers are often hidden in their God from the strife of tongues and the fury of the storm of trouble. The clefts of the Rock of Ages are safe abodes. \"My deliverer,\" interposing in my hour of peril. When almost captured the Lord's people are rescued from the hand of the mighty by him who is mightier still. This title of \"deliverer\" has many sermons in it, and is well worthy of the study of all experienced saints. \"My God;\" this is all good things in one. There is a boundless wealth in this expression; it means, my perpetual, unchanging, infinite, eternal good. He who can say truly \"my God,\" may well add, \"my heaven, my all.\" \"My strength;\" this word is really \"my rock,\" in the sense of strength and immobility. My sure, unchanging, eternal confidence and support. Thus the word rock occurs twice, but it is no tautology, for the first time it is a rock for concealment, but here a rock for firmness and immutability. \"In whom I will trust.\" Faith must be exercised, or the preciousness of God is not truly known; and God must be the object of faith, or faith is mere presumption. \"My buckler, warding off the blows of my enemy, shielding me from arrow or sword. The Lord furnishes his warriors with weapons both offensive and defensive. Our armoury is completely stored so that none need go to battle unarmed. \"The horn of my salvation,\" enabling me to push down my foes, and to triumph over them with holy exultation. \"My high tower,\" a citadel high planted on a rocky eminence beyond the reach of my enemies, from the heights of which I look down upon their fury without alarm, and survey a wide landscape of mercy reaching even unto the goodly land beyond Jordan. Here are many words, but none too many; we might profitably examine each one of them had we leisure, but summing up the whole, we may conclude with Calvin, that David here equips the faithful from head to foot.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 18:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In this verse the happy poet resolves to invoke the Lord in joyful song, believing that in all future conflicts his God would deal as well with him as in the past. It is well to pray to God as to one who deserves to be praised, for then we plead in a happy and confident manner. If I feel that I can and do bless the Lord for all his past goodness, I am bold to ask great things of him. That word So has much in it. To be saved singing is to be saved indeed. Many are saved mourning and doubting; but David had such faith that he could fight singing, and win the battle with a song still upon his lips. How happy a thing to receive fresh mercy with a heart already sensible of mercy enjoyed, and to anticipate new trials with a confidence based upon past experiences of divine love!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"No fearing or doubting with Christ on our side,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We hope to die shouting, 'The Lord will provide.'\" THE ARGUMENT This Psalm, with some few and small variations, is written 2 Samuel 22. It was composed by David towards the end of his reign and life upon the occasion here mentioned. The servant of the Lord;  who esteemeth it a greater honour to be thy servant, than to be king of Israel, and who doth entirely devote himself to thy service and glory. In the day that the Lord delivered him,  i.e. after the death of Saul, and the conquest of all his succeeding enemies, and his own firm establishment in his kingdom. David professeth his love to God, Psalm 18:1, and his confidence in his attributes, Psalm 18:2. He praises God for deliverance out of trouble, Psalm 18:3-5. His experience of God’s hearing him in an awful manner, Psalm 18:6-31. He acknowledgeth God’s help against his enemies, Psalm 18:32-50.  Most affectionately and with my whole soul; as the Hebrew word signifies. I can return thee no better thing for all thy favours than my love and heart, which I pray thee to accept. By loving him he understands not only his inward affection, but also all the outward expressions and testimonies of it, praising, and glorifying, and serving of him. O Lord, my strength;  from whom alone I have received all my strength, and success, and settlement, and in whom alone I trust, as it follows, Psalm 18:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We hope to die shouting, 'The Lord will provide.'\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This Psalm, with some few and small variations, is written ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2 Samuel 22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It was composed by David towards the end of his reign and life upon the occasion here mentioned. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The servant of the Lord; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " who esteemeth it a greater honour to be thy servant, than to be king of Israel, and who doth entirely devote himself to thy service and glory. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "In the day that the Lord delivered him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i.e. after the death of Saul, and the conquest of all his succeeding enemies, and his own firm establishment in his kingdom. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David professeth his love to God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 18:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and his confidence in his attributes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He praises God for deliverance out of trouble, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 18:3-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His experience of God’s hearing him in an awful manner, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 18:6-31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He acknowledgeth God’s help against his enemies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 18:32-50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Most affectionately and with my whole soul; as the Hebrew word signifies. I can return thee no better thing for all thy favours than my love and heart, which I pray thee to accept. By ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "loving",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " him he understands not only his inward affection, but also all the outward expressions and testimonies of it, praising, and glorifying, and serving of him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "O Lord, my strength; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from whom alone I have received all my strength, and success, and settlement, and in whom alone I trust, as it follows, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will love thee, O Lord, my strength. These words are not in twenty second chapter of Second Samuel: the psalm there begins with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The psalmist here expresses his love to the Lord, and his continuance in it; that Jehovah the Father was, is, and ever will be the object of Christ's love, is certain; and which has appeared by his readiness in the council and covenant of grace to do his will; by his coming down from heaven to earth for that purpose; by his delight in it, it being his meat and drink to do it; and by his sufferings and death, which were in compliance with, and obedience to it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 14:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and as in David, so in all regenerate ones, there is love to God; Jehovah is loved by them in all his persons; Jehovah the Father is loved, and to be loved, for the perfections of his nature, because of the works of his hands, of creation and providence; and particularly because of his works of special grace and goodness, and especially because of his love wherewith he has loved his people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jehovah the Son is loved, and to be loved, above all creatures and things whatever, sincerely and heartily, fervently and constantly; because of the loveliness of his person, the love of his heart, and his works of grace and redemption; all of him is lovely; and he is to be loved, and is loved, in his person, offices, relations, people, word, and ordinances: Jehovah the Spirit is loved, and to be loved, because of his person and perfections, and operations of grace; as a sanctifier, comforter, the spirit of adoption, the earnest and pledge of eternal glory. The word here used signifies the most intimate, tender, and affectionate love; it often designs mercy and bowels of mercy; so Aben Ezra interprets it of seeking mercy of God: the reasons are as follow in this verse and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because \"the Lord is my strength\"; so he was to Christ as man, who as such was the man of his right hand, the Son of Man, whom he made strong for himself, to do his work, and for his glory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; he promised to strengthen him, and he did, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and so he is the strength of all his saints, even Jehovah, Father, Son, and Spirit; he is the strength of their hearts both in life and at death; he is the strength of their graces, who strengthens that which he has wrought for them, and in them; he strengthens them to do their duty, to bear the cross, and every affliction, and against every enemy of their souls; and this renders him very lovely and amiable to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I will love thee, O LORD, my strength.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will love thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Fervently do I love thee, a word occurring nowhere else in this form, and denoting tender and intimate affection. This verse is omitted in 2 Sam.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Introductory prelude, in which one title is heaped upon another to express all that experience had proved Jehovah to be to David.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will love thee, O Lord, my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Strength.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This opening is very remarkable. The verb translated \"I will love\" expresses the very tenderest affection, and is elsewhere never used to denote the love of man towards God, but only that of God towards man. The entire verse, moreover, is withdrawn from the \"second edition\" of the psalm (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) - which was perhaps prepared for liturgical use - as too sacred and too private to suit a public occasion. Psalm 18:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 18:2-4) The poet opens with a number of endearing names for God, in which he gratefully comprehends the results of long and varied experience. So far as regards the parallelism of the members, a monostich forms the beginning of this Psalm, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and many others. Nevertheless the matter assumes a somewhat different aspect, if ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not, with Maurer, Hengstenberg and Hupfeld, taken as two predicate clauses (Jahve is..., my God is...), but as a simple vocative-a rendering which alone corresponds to the intensity with which this greatest of the Davidic hymns opens-God being invoked by ה, ה, אלי, and each of these names being followed by a predicative expansion of itself, which increases in fulness of tone and emphasis. The ארחמך (with ā, according to Ew. ֗251, b), which carries the three series of the names of God, makes up in depth of meaning what is wanting in compass. Elsewhere we find only the Piel רחם of tender sympathising love, but here the Kal is used as an Aramaism. Hence the Jalkut on this passages explains it by רחמאי יתך \"I love thee,\" or ardent, heartfelt love and attachment. The primary signification of softness (root רח, Arab. rḥ, rch, to be soft, lax, loose), whence רחם, uterus, is transferred in both cases to tenderness of feeling or sentiment. The most general predicate חזפי (from חזק according to a similar inflexion to אמר, בּסר, עמק, plur. עמקי ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is followed by those which describe Jahve as a protector and deliverer in persecution on the one hand, and on the other as a defender and the giver of victory in battle. They are all typical names symbolising what Jahve is in Himself; hence instead of וּמפלּטי it would perhaps have been more correct to point וּמפלטי (and my refuge). God had already called Himself a shield to Abram, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and He is called צוּר (cf. אבן ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the great Mosaic song, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the latter verse is distinctly echoed here).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "סלע from סלע, Arab. sl‛, findere, means properly a cleft in a rock (Arabic סלע, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Neshwn defines thus: Arab. 'l-sal‛ is a cutting in a mountain after the manner of a gorge; and Jkt, who cites a number of places that are so called: a wide plain (Arab. fḍ') enclosed by steep rocks, which is reached through a narrow pass (Arab. ša‛b), but can only be descended on foot. Accordingly, in סלעי the idea of a safe (and comfortable) hiding-place preponderates; in צוּרי that of firm ground and inaccessibility. The one figure calls to mind the (well-watered) Edomitish סלע surrounded with precipitous rocks, Isaiah 16:1; Isaiah 42:11, the Πέτρα described by Strabo, xvi. 4, 21; the other calls to mind the Phoenician rocky island צור, Ṣûr (Tyre), the refuge in the sea.))",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Neshwn defines thus: Arab. 'l-sal‛ is a cutting in a mountain after the manner of a gorge; and Jkt, who cites a number of places that are so called: a wide plain (Arab. fḍ') enclosed by steep rocks, which is reached through a narrow pass (Arab. ša‛b), but can only be descended on foot. Accordingly, in סלעי the idea of a safe (and comfortable) hiding-place preponderates; in צוּרי that of firm ground and inaccessibility. The one figure calls to mind the (well-watered) Edomitish סלע surrounded with precipitous rocks, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Πέτρα described by Strabo, xvi. 4, 21; the other calls to mind the Phoenician rocky island צור, Ṣûr (Tyre), the refuge in the sea.))",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "then a cleft rock, and צוּר, like the Arabic sachr, a great and hard mass of rock (Aramaic טוּר, a mountain). The figures of the מצוּדה (מצודה, מצד) and the משׂגּב are related; the former signifies properly specula, a watch-tower, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In Arabic maṣâdun signifies (1) a high hill (a signification that is wanting in Freytag), (2) the summit of a mountain, and according to the original lexicons it belongs to the root Arab. maṣada, which in outward appearance is supported by the synonymous forms Arab. maṣadun and maṣdun, as also by their plurals Arab. amṣidatun and muṣdânun, wince these can only be properly formed from those singulars on the assumption of the m being part of the root. Nevertheless, since the meanings of Arab. maṣada all distinctly point to its being formed from the root Arab. mṣ contained in the reduplicated stem Arab. maṣṣa, to suck, but the meanings of Arab. maṣâdun, maṣsadun, and maṣdun do not admit of their being referred to it, and moreover there are instances in which original nn. loci from vv. med. Arab. w and y admit of the prefixed m being treated as the first radical through forgetfulness or disregard of their derivation, and with the retention of its from secondary roots (as Arab. makana, madana, maṣṣara), it is highly probable that in maṣâd, maṣad and maṣd we have an original מצד, מצודה, מצוּדה. These Hebrew words, however, are to be referred to a צוּד in the signification to look out, therefore properly specula. - Fleischer.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the latter, a steep height. The horn, which is an ancient figure of victorious and defiant power in Deuteronomy 33:17; 1 Samuel 2:1, is found here applied to Jahve Himself: \"horn of my salvation\" is that which interposes on the side of my feebleness, conquers, and saves me. All these epithets applied to God are the fruits of the affliction out of which David's song has sprung, viz., his persecution by Saul, when, in a country abounding in rugged rocks and deficient in forest, he betook himself to the rocks for safety, and the mountains served him as his fortresses. In the shelter which the mountains, by their natural conformations, afforded him at that time, and in the fortunate accidents, which sometimes brought him deliverance when in extreme peril, David recognises only marvellous phenomena of which Jahve Himself was to him the final cause. The confession of the God tried and known in many ways is continued in Psalm 18:5 by a general expression of his experience. מהלּל is a predicate accusative to יהוה: As one praised (worthy to be praised) do I call upon Jahve, - a rendering that is better suited to the following clause, which expresses confidence in the answer coinciding with the invocation, which is to be thought of as a cry for help, than Olshausen's, \"Worthy of praise, do I cry, is Jahve,\" though this latter certainly is possible so far as the style is concerned (vid., on Isaiah 45:24, cf. also Genesis 3:3; Micah 2:6). The proof of this fact, viz., that calling upon Him who is worthy to be praised, who, as the history of Israel shows, is able and willing to help, is immediately followed by actual help, as events that are coincident, forms the further matter of the Psalm. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the latter, a steep height. The horn, which is an ancient figure of victorious and defiant power in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is found here applied to Jahve Himself: \"horn of my salvation\" is that which interposes on the side of my feebleness, conquers, and saves me. All these epithets applied to God are the fruits of the affliction out of which David's song has sprung, viz., his persecution by Saul, when, in a country abounding in rugged rocks and deficient in forest, he betook himself to the rocks for safety, and the mountains served him as his fortresses. In the shelter which the mountains, by their natural conformations, afforded him at that time, and in the fortunate accidents, which sometimes brought him deliverance when in extreme peril, David recognises only marvellous phenomena of which Jahve Himself was to him the final cause. The confession of the God tried and known in many ways is continued in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by a general expression of his experience. מהלּל is a predicate accusative to יהוה: As one praised (worthy to be praised) do I call upon Jahve, - a rendering that is better suited to the following clause, which expresses confidence in the answer coinciding with the invocation, which is to be thought of as a cry for help, than Olshausen's, \"Worthy of praise, do I cry, is Jahve,\" though this latter certainly is possible so far as the style is concerned (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The proof of this fact, viz., that calling upon Him who is worthy to be praised, who, as the history of Israel shows, is able and willing to help, is immediately followed by actual help, as events that are coincident, forms the further matter of the Psalm. ",
            "children": []
          }
        ]
      }
    ]
  }
]