[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He drew me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—By an exquisite transition from the real to the figurative the poet conceives of these parted waters as the “floods of affliction” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from which Jehovah has rescued him by means of the very storm which was sent, in answer to his prayer, to overwhelm his enemies. Render at once more literally and forcibly, “He laid hold of me and drew me out of great waters.” The conception undoubtedly is that the “gates of death” are under these floods, and those being now parted, the sufferer can be reached and rescued.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 18:17-19 show trifling variations between the two copies of the psalm.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:17-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " show trifling variations between the two copies of the psalm.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 18:16-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:16-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He sent from above — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This may either denote, in general, that God assisted him by his divine power to overcome and deliver himself from his enemies, and thereby extricate himself from his troubles, or that he sent his angels from heaven to protect and rescue him from the many dangers that surrounded him; which he figuratively calls ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "drawing him out of great waters — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Afflictions and great calamities being frequently represented by deep waters and floods in the sacred writings. Or, as Theodoret thinks, by these waters, he means the strong enemies mentioned in the next verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They prevented me in the day of my calamity — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They were too crafty for me, and had almost surprised me, coming upon me suddenly, unawares, when I was unprepared and helpless; and would have destroyed me, had not God upheld and supported me when I was in danger of perishing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But God was my stay ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— They could not prevent him; and, what a staff is to one who is ready to fall, that was God to me in the time of my extremity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-19 The first words, I will love thee, O Lord, my strength, are the scope and contents of the psalm. Those that truly love God, may triumph in him as their Rock and Refuge, and may with confidence call upon him. It is good for us to observe all the circumstances of a mercy which magnify the power of God and his goodness to us in it. David was a praying man, and God was found a prayer-hearing God. If we pray as he did, we shall speed as he did. God's manifestation of his presence is very fully described, ver. 7-15. Little appeared of man, but much of God, in these deliverances. It is not possible to apply to the history of the son of Jesse those awful, majestic, and stupendous words which are used through this description of the Divine manifestation. Every part of so solemn a scene of terrors tells us, a greater than David is here. God will not only deliver his people out of their troubles in due time, but he will bear them up under their troubles in the mean time. Can we meditate on ver. 18, without directing one thought to Gethsemane and Calvary? Can we forget that it was in the hour of Christ's deepest calamity, when Judas betrayed, when his friends forsook, when the multitude derided him, and the smiles of his Father's love were withheld, that the powers of darkness prevented him? The sorrows of death surrounded him, in his distress he prayed, Heb 5:7. God made the earth to shake and tremble, and the rocks to cleave, and brought him out, in his resurrection, because he delighted in him and in his undertaking.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He sent from above - He interposed to save me. All these manifestations of the divine interposition were from above, or from heaven; all came from God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He took me - He took hold on me; he rescued me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He drew me out of many waters - Margin, great waters. Waters are often expressive of calamity and trouble, Psalm 46:3; Psalm 69:1; Psalm 73:10; Psalm 124:4-5. The meaning here is, that God had rescued him out of the many troubles and dangers that encompassed him, as if he had fallen into the sea and was in danger of perishing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He drew me out of many waters - Margin, great waters. Waters are often expressive of calamity and trouble, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 69:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 124:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning here is, that God had rescued him out of the many troubles and dangers that encompassed him, as if he had fallen into the sea and was in danger of perishing. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16-19. from above—As seated on a throne, directing these terrible scenes, God—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "sent—His hand (Ps 144:7), reached down to His humble worshipper, and delivered him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "many waters—calamities (Job 30:14; Ps 124:4, 5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He sent angels, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or assistance otherwise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He sent from above,.... Either his hand, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; he exerted and displayed his mighty power in raising Christ from the dead; or he sent help from his sanctuary; as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and helped and strengthened him in a day of salvation; or when he wrought out the salvation of his people; or \"he sent his word\", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; his word of command, to take up his life again, as he had given it to lay it down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Targum is, he sent his prophets; but it may be much better supplied, he sent his angels, or an angel; as he did at his resurrection, who rolled away the stone from the sepulchre, as a token of his justification and discharge: so Jarchi interprets it, he sent his angels; and Aben Ezra supplies it thus, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"he sent his word or his angel:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "unless the sense should be, as Cocceius suggests, he sent a cloud from above, which was done at Christ's ascension, and which received him out of the sight of the apostles, Acts 1:9. Since it follows, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "unless the sense should be, as Cocceius suggests, he sent a cloud from above, which was done at Christ's ascension, and which received him out of the sight of the apostles, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Since it follows, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "he took me; that is, up to heaven; thither Christ was carried in a cloud, one of God's chariots, he sent for him; and where he is received, and will be retained until his second coming; though rather the sense is, he took me by the hand: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he drew me out of many waters. This is said either in allusion to Moses, who had his name from his being drawn out of the water, Exodus 2:10; and who was an eminent type of Christ; and this is the only place where the Hebrew word is made use of from whence he had his name; or else to a man plunged in water ready to be drowned; see Psalm 69:1. By these \"many waters\" may be meant the many afflictions, sorrows, and sufferings from which Christ was freed, when raised from the dead, and highly exalted and crowned with glory and honour; and the torrent of sins which flowed in upon him at the time he was made sin for his people, from which he was justified when risen; and so will appear a second time without sin unto salvation; and the wrath of God, the waves and billows of which went over him, and compassed him about as water, at the time of his sufferings; from which he was delivered when he was shown the path of life, and entered into the presence of God, and sat at his right hand, where are joys and pleasures for evermore; and also his grand enemy Satan, with his principalities and powers, who came in like a flood upon him; but he destroyed him and spoiled them; and particularly the floods of ungodly men, spoken of in Psalm 18:4; seem to be here designed; compare with this Psalm 144:7; \"so many waters\" signify many people and nations, Revelation 17:15; and accordingly the Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he drew me out of many waters. This is said either in allusion to Moses, who had his name from his being drawn out of the water, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and who was an eminent type of Christ; and this is the only place where the Hebrew word is made use of from whence he had his name; or else to a man plunged in water ready to be drowned; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 69:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". By these \"many waters\" may be meant the many afflictions, sorrows, and sufferings from which Christ was freed, when raised from the dead, and highly exalted and crowned with glory and honour; and the torrent of sins which flowed in upon him at the time he was made sin for his people, from which he was justified when risen; and so will appear a second time without sin unto salvation; and the wrath of God, the waves and billows of which went over him, and compassed him about as water, at the time of his sufferings; from which he was delivered when he was shown the path of life, and entered into the presence of God, and sat at his right hand, where are joys and pleasures for evermore; and also his grand enemy Satan, with his principalities and powers, who came in like a flood upon him; but he destroyed him and spoiled them; and particularly the floods of ungodly men, spoken of in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; seem to be here designed; compare with this ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"so many waters\" signify many people and nations, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and accordingly the Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"he delivered me from many people.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This was true of Christ when risen and ascended; he was then separate from sinners, and made higher than the heavens; and this sense is confirmed by the following words, where what is expressed figuratively here is there literally explained. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This was true of Christ when risen and ascended; he was then separate from sinners, and made higher than the heavens; and this sense is confirmed by the following words, where what is expressed figuratively here is there literally explained. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He sent from above, he took me, he drew me out of many {m} waters.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He sent from above, he took me, he drew me out of many ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " waters.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Out of many great dangers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He sent from above",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V., He sent from on high: but it seems better to render, He reached forth from on high, as the writer of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " understood the words. He stretched out His hand and caught hold of the sinking man, and drew him out of the floods of calamity which were overwhelming him (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 18:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "drew me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word is found elsewhere only in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to which there may be an allusion. ‘He drew me out of the great waters of distress, as He drew Moses out of the waters of the Nile, to be the deliverer of His people.’ For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "many",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great waters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as an emblem of danger, cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 66:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "16–19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The deliverance which was the object of Jehovah’s manifestation of His power.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "- He sent from above, he took me, he drew me out of many waters.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " While destruction thus came upon David's enemies (vers. 12-14), God's protecting hand was stretched out to save David himself, who was carefully \"taken\" and tenderly \"drawn\" forth from among the \"many waters,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the dangers and difficulties which threatened him. Some commentators see in the words used - \"he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "took",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " me, he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "drew",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " me\" - a tacit reference to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:5, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and, by implication, a sort of parallel between the deliverance of David from his foes and that of Moses from the waters of the Nile (Kay, Hengstenberg, 'Speaker's Commentary'). Psalm 18:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 18:17-20) Then Jahve stretches out His hand from above into the deep chasm and draws up the sinking one. The verb שׁלח occurs also in prose (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") without יד (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 57:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. on the other hand the borrowed passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the signification to reach (after anything). The verb משׁה, however, is only found in one other instance, viz., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the root (transferred from the Egyptian into the Hebrew) of the name of Moses, and even Luther saw in it an historical allusion, \"He hath made a Moses of me,\" He hath drawn me out of great (many) waters, which had well nigh swallowed me up, as He did Moses out of the waters of the Nile, in which he would have perished. This figurative language is followed, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by its interpretation, just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the \"great waters\" are explained by מיּד בּני נכר, which, however, is not suitable here, or at least is too limited.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With Psalm 18:17 the hymn has reached the climax of epic description, from which it now descends in a tone that becomes more and more lyrical. In the combination איבי עז, עז is not an adverbial accusative, but an adjective, like רוּחך טובה Psalm 143:10, and ὁ ἀνὴρ ἀγαθός (Hebrerbrief S. 353). כּי introduces the reason for the interposition of the divine omnipotence, viz., the superior strength of the foe and the weakness of the oppressed one. On the day of his איד, i.e., (vid., on Psalm 31:12) his load or calamity, when he was altogether a homeless and almost defenceless fugitive, they came upon him (קדּם Psalm 17:13), cutting off all possible means of delivering himself, but Jahve became the fugitive's staff (Psalm 23:4) upon which he leaned and kept himself erect. By the hand of God, out of straits and difficulties he reached a broad place, out of the dungeon of oppression to freedom, for Jahve had delighted in him, he was His chosen and beloved one. חפץ has the accent on the penult here, and Metheg as a sign of the lengthening (העמדה) beside the ē, that it may not be read ĕ.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the hymn has reached the climax of epic description, from which it now descends in a tone that becomes more and more lyrical. In the combination איבי עז, עז is not an adverbial accusative, but an adjective, like רוּחך טובה ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ὁ ἀνὴρ ἀγαθός (Hebrerbrief S. 353). כּי introduces the reason for the interposition of the divine omnipotence, viz., the superior strength of the foe and the weakness of the oppressed one. On the day of his איד, i.e., (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") his load or calamity, when he was altogether a homeless and almost defenceless fugitive, they came upon him (קדּם ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 17:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), cutting off all possible means of delivering himself, but Jahve became the fugitive's staff (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") upon which he leaned and kept himself erect. By the hand of God, out of straits and difficulties he reached a broad place, out of the dungeon of oppression to freedom, for Jahve had delighted in him, he was His chosen and beloved one. חפץ has the accent on the penult here, and Metheg as a sign of the lengthening (העמדה) beside the ē, that it may not be read ĕ.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In like manner Metheg is placed beside the ee of the final closed syllable that has lost the tone in חפץ Psalm 22:9, ותּחולל Psalm 90:2, vid., Isaiah S. 594 note.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: In like manner Metheg is placed beside the ee of the final closed syllable that has lost the tone in חפץ ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ותּחולל ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 90:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", vid., Isaiah S. 594 note.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The following strophe tells the reason of his pleasing God and of His not allowing him to perish. This כּי חפץ בּי (for He delighted in me) now becomes the primary thought of the song. ",
        "children": []
      }
    ]
  }
]