[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20-23) for this protestation of innocence comp. Psalms 7, 17 and Job, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "passim. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Self-righteous pride and vindication of one’s character under calumny are very different things. If taken of the nation at large, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here, also, the text in Samuel offers one or two trifling variations from ours.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 18:20-24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:20-24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord rewarded me according to my righteousness — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“Commentators have been much perplexed,” says Dr. Horne, “to account for these unlimited claims to righteousness made by David, and that long after the matter of Uriah, and toward the close of life. Certain, indeed, it is,” adds he, “that the expressions considered as David’s must be confined, either to his steadfast adherence to the true worship, in opposition to idolatry, or to his innocence with regard to some particular crimes falsely alleged against him by his adversaries. But if the Psalm be prophetical, and sung by the victorious monarch in the person of King Messiah, then do the verses now before us no less exactly than beautifully delineate that all- perfect righteousness wrought by the Redeemer, in consequence of which he obtained deliverance for himself and his people.” Most commentators, however, are, and have always been, of opinion, that David spoke here in his own person, and not in the person of the Messiah, to whom no part of the Psalm, upon a fair construction, except the last two verses, appears to have any reference. But as, by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rewarding ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "recompensing ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "him, David chiefly meant the Lord’s delivering him from Saul and his other enemies that then were, and exalting him to the throne of Judah and Israel; so he must of necessity be understood as speaking principally of his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the cleanness of his hands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "prior to that period. And, certainly, in that former part of his life, “no instance can be alleged against him,” as Dr. Dodd observes, “in which he violated the known precepts of religion and virtue, enjoined by that constitution he was under;” and therefore, conscious of his integrity thus far, he might justly glory and rejoice that God, who was a witness to it, had thus bountifully rewarded it. And, as to his great sin in the matter of Uriah, wherein he highly offended and greatly dishonoured God, and for which God chastised him for many years, by various calamities, his repentance for that dreadful crime, or rather, for that complication of crimes, was so sincere, and the fruits and proofs of it were so manifest, that God was pleased to remove the judgments by which he had corrected him, and to deliver him from his rebellious son Absalom and his party, and from all the other enemies that rose up against him. Many learned men, however, are of opinion that David did not compose this Psalm after his sin in the matter of Uriah, much less in his old age, but rather in his younger days upon his deliverance from Saul, and the other enemies who persecuted him in Saul’s days, and opposed his advancement to the crown. This, they suppose, appears from the title of the Psalm, compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Dr. Delaney thinks he wrote the greater part of it soon after the deliverance he obtained from Saul’s messengers, when they were sent to his house to take him, and when he was let down by Michal out of the window, and escaped over the garden or city-wall: and he thinks the 29th verse refers to this escape, and is a proof that he penned the Psalm on that occasion. But Dr. Dodd, and many others think it was composed some time after he was put in peaceable possession of the kingdom, and had introduced the ark into Jerusalem. If either of these opinions be correct, he wrote the Psalm before his fall, and while his character was quite unblemished. But be this as it may, if he wrote it even after that unhappy event, it must also have been written after his repentance, and after he was become a new creature in heart and life: and it does not appear, on a candid examination of the particulars included in the account which he here gives of the uprightness of his conduct, that there is any clause or expression contained in it which will not admit of a fair and easy interpretation, in perfect consistency with his real character, according to the delineation which the inspired writers of his history have given of it. The following short explication of the passage, chiefly taken from Bishop Patrick’s paraphrase, it is thought, makes this evident.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord rewarded me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The Lord knew that I was unjustly persecuted, and therefore rewarded me according to the integrity and purity of my actions, as I was never guilty of that whereof they accused me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have kept the ways of the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I never took any unlawful courses for my deliverance; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and have not wickedly departed from my God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But when Saul, my great enemy, (who maliciously and unweariedly sought my life,) fell into my hands, and I had it in my power and was urged to kill him, I would not do it, because he was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord’s anointed: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "nor did I ever injure him or his party. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all his ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(God’s) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judgments were before me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — I laid his precepts before me as the rule of my actions, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "did not put ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "away, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or bid them, as it were, stand aside. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I was also ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upright before him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I chose rather to suffer any thing than lose my integrity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and I kept myself from mine iniquity — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "How unjustly soever my enemies dealt with me, I would not imitate them, but though I could not hinder ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "iniquity, I kept myself from that, which, if I had committed it, would have been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "guarding especially against that sin to which I was most inclined or tempted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath the Lord recompensed me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He who administers all things with the greatest justice and the greatest goodness heard my prayer, and dealt with me according to my innocent intentions, which would not suffer me to act unmercifully or unjustly toward Saul in any respect, much less to defile my hands with his blood.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:20-28 Those that forsake the ways of the Lord, depart from their God. But though conscious to ourselves of many a false step, let there not be a wicked departure from our God. David kept his eye upon the rule of God's commands. Constant care to keep from that sin, whatever it be, which most easily besets us, proves that we are upright before God. Those who show mercy to others, even they need mercy. Those who are faithful to God, shall find him all that to them which he has promised to be. The words of the Lord are pure words, very sure to be depended on, and very sweet to be delighted in. Those who resist God, and walk contrary to him, shall find that he will walk contrary to them, Le 26:21-24. The gracious recompence of which David spoke, may generally be expected by those who act from right motives. Hence he speaks comfort to the humble, and terror to the proud; Thou wilt bring down high looks. And he speaks encouragement to himself; Thou wilt light my candle: thou wilt revive and comfort my sorrowful spirit; thou wilt guide my way, that I may avoid the snares laid for me. Thou wilt light my candle to work by, and give me an opportunity of serving thee. Let those that walk in darkness, and labour under discouragements, take courage; God himself will be a Light to them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord rewarded me according to my righteousness - That is, he saw that I did not deserve the treatment which I received from my enemies, and therefore he interposed to save me. Compare the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "According to the cleanness of my hands - So far as my fellow-men are concerned. I have done them no wrong.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hath he recompensed me - By rescuing me from the power of my enemies. It is not inconsistent with proper views of piety - with true humility before God - to feel and to say, that so far as our fellow-men are concerned, we have not deserved ill-treatment at their hands; and, when we are delivered from their power, it is not improper to say and to feel that the interposition in the case has been according to justice and to truth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hath he recompensed me - By rescuing me from the power of my enemies. It is not inconsistent with proper views of piety - with true humility before God - to feel and to say, that so far as our fellow-men are concerned, we have not deserved ill-treatment at their hands; and, when we are delivered from their power, it is not improper to say and to feel that the interposition in the case has been according to justice and to truth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20-24. The statements of innocence, righteousness, &c., refer, doubtless, to his personal and official conduct and his purposes, during all the trials to which he was subjected in Saul's persecutions and Absalom's rebellions, as well as the various wars in which he had been engaged as the head and defender of God's Church and people.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20 The Lord rewarded me according to my righteousness; according to the cleanness of my hands hath he recompensed me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21 For I have kept the ways of the Lord, and have not wickedly departed from my God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22 For all his judgments were before me, and I did not put away his statutes from me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23 I was also upright before him, and I kept myself from mine iniquity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24 Therefore hath the Lord recompensed me according to my righteousness, according to the cleanness of my hands in his eyesight.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25 With the merciful thou wilt shew thyself merciful; with an upright man thou wilt shew thyself upright;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "26 With the pure thou wilt shew thyself pure; and with the froward thou wilt shew thyself froward.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "27 For thou wilt save the afflicted people; but wilt bring down high looks.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "28 For thou wilt light my candle: the Lord my God will enlighten my darkness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 18:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:20",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The Lord rewarded me according to my righteousness.\" Viewing this Psalm as prophetical of the Messiah, these strongly-expressed claims to righteousness are readily understood, for his garments were white as snow; but considered as the language of David they have perplexed many. Yet the case is clear, and if the words be not strained beyond their original intention, no difficulty need occur. Albeit that the dispensations of divine grace are to the fullest degree Sovereign and irrespective of human merit, yet in the dealings of Providence there is often discernible a rule of justice by which the injured are at length avenged, and the righteous ultimately delivered. David's early troubles arose from the wicked malice of envious Saul, who no doubt prosecuted his persecutions under cover of charges brought against the character of \"the man after God's own heart.\" These charges David declares to have been utterly false, and asserts that he possessed a grace-given righteousness which the Lord had graciously rewarded in defiance of all his calumniators. Before God the man after God's own heart was a humble sinner, but before his slanderers he could with unblushing face speak of the \"cleanness of his hands\" and the righteousness of his life. He knows little of the sanctifying power of divine grace who is not at the bar of human equity able to plead innocence. There is no self-righteousness in an honest man knowing that he is honest, nor even in his believing that God rewards him in providence because of his honesty, for such is often a most evident matter of fact; but it would be self-righteousness indeed if we transferred such thoughts from the region of providential government into the spiritual kingdom, for there grace reigns not only supreme but sole in the distribution of divine favours. It is not at all an opposition to the doctrine of salvation by grace, and no sort of evidence of a Pharisaic spirit, when a gracious man, having been slandered, stoutly maintains his integrity, and vigorously defends his character. A godly man has a clear conscience, and knows himself to be upright; is he to deny his own consciousness, and to despise the work of the Holy Ghost, by hypocritically making himself out to be worse than he is? A godly man prizes his integrity very highly, or else he would not be a godly man at all; is he to be called proud because he will not readily lose the jewel of a reputable character? A godly man can see that in divine providence uprightness and truth are in the long run sure to bring their own reward; may he not, when he sees that reward bestowed in his own case, praise the Lord for it? Yea rather, must he not show forth the faithfulness and goodness of his God? Read the cluster of expressions in this and the following verses as the song of a good conscience, after having safely outridden a storm of obloquy, persecution, and abuse, and there will be no fear of our upbraiding the writer as one who set too high a price upon his own moral character.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 18:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:21",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Here the assertion of purity is repeated, both in a positive and a negative form. There is \"I have\" and \"I have not,\" both of which must be blended in a truly sanctified life; constraining and restraining grace must each take its share. The words of this verse refer to the saint as a traveller carefully keeping to \"the ways of the Lord,\" and \"not wickedly,\" that is, designedly, wilfully, persistently, defiantly forsaking the ordained pathway in which God favours the pilgrim with his presence. Observe how it is implied in the expression \"and have not wickedly departed from my God,\" that David lived habitually in communion with God, and knew him to be his own God, whom he might speak of as \"my God.\" God never departs from his people, let them take heed of departing from him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 18:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:22",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " As I had a just cause, and made it my care and business to deal righteously with God, and with Saul, and all others; so God (who hath engaged himself by his promise to suceour and reward them that are such) was graciously pleased to own me, and to plead my cause against my unrighteous enemies. And because I would not deliver myself from straits and miseries by unrighteous means, namely, by killing Saul, as I was advised to do, God was pleased to deliver me in a more honourable and effectual manner. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The cleanness of my hands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the innocency of my actions and carriage towards Saul, from whose blood I kept my hands pure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord rewarded me according to my righteousness,.... Which, if applied to David, cannot be understood of his own personal righteousness, or of works of righteousness done by him, for these merit nothing at the hand of God; no reward, in strict justice, is due to them, or given to them: a man's own righteousness is imperfect, and by the law of God is not accounted a righteousness; and it is unprofitable to God, is no gain to him, and so not rewardable by him; and were it perfect, it is but man's duty, and what God has a prior right to, and so is not recompensed by him; though it is so far from being pure and perfect, that it is attended with much sin, and is no other than rags, and filthy ones, which can never recommend a person to God; it is what will not bear the sight of God, and can never be called cleanness in his eyesight: by it no man is justified before him; and though God does, indeed, reward the works of his people, which are fruits of his grace, yet the reward is not of debt, but of grace. This, therefore, must be understood of the righteousness of David's cause, and of his innocence with respect to the things he was charged with by his enemies; of his righteousness towards Saul; and of \"the cleanness of his hands\", in not defiling them with his blood, when it was in his power to take away his life; therefore God rewarded him by delivering him out of his hands, and setting him upon the throne, and causing his kingdom to flourish and prosper; for this respects temporal blessings, and not eternal glory and happiness; and is something that had been and was then enjoyed, and not anything future, or in another world: though it is best of all to apply it to Christ, and understand it of his righteousness, which he, as Mediator, has wrought out for his people; this is perfect, pure, and spotless, and entirely agreeable to the law of God; what will bear the sight of God, is satisfying to his justice, is well pleasing to him, and is what he accepts of, and imputes to them that believe in Christ, and by which they are justified from all things. Now, according to this righteousness, Christ in strict justice has been rewarded in his own person; as he had the work of man's redemption assigned him, and he agreed to do it, he had a reward promised him, and which he claimed, when he had glorified his Father and finished his work; and which he received when he was set down at the right hand of God, crowned with glory and honour, in consequence of his obedience, sufferings, and death; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Philippians 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and he is rewarded in his members according to his righteousness, they being justified by it, and made heirs of eternal life on account of it, and are or will be glorified with him for evermore; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "according to the cleanness of my hands hath he recompensed me; which signifies the same thing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "according to the cleanness of my hands hath he recompensed me; which signifies the same thing. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The LORD rewarded me according to my {q} righteousness; according to the cleanness of my hands hath he recompensed me.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The LORD rewarded me according to my ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " righteousness; according to the cleanness of my hands hath he recompensed me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) David was sure of his righteous cause and good behaviour toward Saul and his enemies and therefore was assured of God's favour and deliverance.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rewarded me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, dealt with me, for the primary idea of the word is not that of recompence, although this lies in the context. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the cleanness of my hands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] = the innocence of my conduct. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 24:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 26:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "20–23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The language is inspired by the courage of a childlike simplicity. It is no vainglorious boasting of his own merits, but a testimony to the faithfulness of Jehovah to guard and reward His faithful servants. David does not lay claim to a sinless righteousness, but to single-hearted sincerity in his devotion to God. Compare his own testimony (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), God’s testimony (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the testimony of history (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to his essential integrity. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and see Introd. p. lxxxvii f.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Is not this conscious rectitude, this “princely heart of innocence,” a clear indication that the Psalm was written before his great fall?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord rewarded me according to my righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". David has spoken of his \"righteousness\" already in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We must not suppose him to mean absolute blamelessness, any more than Job means such blamelessness by his \"integrity\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 27:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He means honesty of purpose, the sincere endeavour to do right, such conduct as brings about \"the answer of a good conscience before God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 3:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "According to the cleanness of my hands hath he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "recompensed me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 27:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 24:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"Clean hands\" are hands unstained by any wicked action. Psalm 18:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 18:21-24) On גּמל (like שׁלּם with the accusative not merely of the thing, but also of the person, e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), εὐ or κακῶς πράττειν τινά, vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". שׁמר, to observe  equals  to keep, is used in the same way in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 22:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". רשׁע מן is a pregnant expression of the malitiosa desertio. \"From God's side,\" i.e., in His judgment, would be contrary to the general usage of the language (for the מן in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has a different meaning) and would be but a chilling addition. On the poetical form מנּי, in pause מנּי, vid., Ew. 263, b. The fut. in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", close after the substantival clause ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is not intended of the habit in the past, but at the present time: he has not wickedly forsaken God, but (כּי  equals  imo, sed) always has God's commandments present before him as his rule of conduct, and has not put them far away out of his sight, in order to be able to sin with less compunction; and thus then (fut. consec.) in relation (עם, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to God he was תמים, with his whole soul undividedly devoted to Him, and he guarded himself against his iniquity (עון, from עוה, Arab. 'wâ, to twist, pervert, cf. Arab. gwâ, of error, delusion, self-enlightenment), i.e., not: against acquiescence in his in-dwelling sin, but: against iniquity becoming in any way his own; מעוני equivalent to מעותי (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), cf. מחיּי  equals  than that I should live, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this strophe, this Psalm strikes a cord that harmonises with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:1-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", after which it is therefore placed. We may compare David's own testimony concerning himself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., the testimony of God in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the testimony of history in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]