[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Out Of his temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Rather, Place—plainly, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the heavenly abode of Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My cry.—In Samuel only, “my cry in his ears.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "My cry.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—In Samuel only, “my cry in his ears.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 18:6-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:6-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He heard out of his temple — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either, 1st, Out of his sanctuary, where he was represented as dwelling between the cherubim, in the most holy place, and where he promised to hear and answer the prayers of his people, which were either made in or directed to it. Or, 2d, Out of his heavenly habitation, which is often called his temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then the earth shook and trembled — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Then God appeared on my behalf in a miraculous and glorious manner, and to the great terror and confusion of all mine enemies, as though they had been surprised with an earthquake, in which the earth was shaken from its foundations, and all its rocks and mountains trembled. David proceeds, in this and the eight following verses, to describe, by the sublimest expressions, the awful manner in which Jehovah came to his assistance. The imagery employed, Dr. Horne thinks, is borrowed from mount Sinai, and those tremendous circumstances which attended the delivery of the law from thence. When a monarch is angry and prepares for war, the whole kingdom is instantly in commotion. Thus universal nature is here represented as feeling the effects of its great Sovereign’s displeasure, and all the visible elements appear disordered. The description must be allowed, by all skilful and impartial judges, to be truly noble and sublime, and in the genuine spirit of poetry. “The majesty of God, and the manner in which he is represented as coming to the aid of his favourite king, surrounded with all the powers of nature as his attendants and ministers, and arming heaven and earth to fight his battles and execute his vengeance, are described in the loftiest and most striking terms. The shaking of the earth, the trembling of the mountains and pillars of heaven; the smoke that ascended out of his nostrils; the flames of devouring fire that flashed from his mouth; the heavens bending down to convey him to the battle; his riding upon a cherub, and rapidly flying on the wings of a whirlwind; his concealing his majesty in the thick clouds of heaven; the bursting of the lightnings from the horrid darkness; the uttering his voice in peals of thunder; the storm of fiery hail; the melting of the heavens, and their dissolving into floods of tempestuous rains; the cleaving of the earth, and disclosing the bottom of the hills, and the subterraneous channels, or torrents of water, by the very breath of the nostrils of the Almighty; are all of them circumstances which create admiration, excite a kind of horror, and exceed every thing of this nature that is to be found in any of the remains of heathen antiquity. The grandest pieces thereof will be found, upon comparison, infinitely short of this description of the psalmist; throughout the whole of which God is represented as a mighty warrior, going forth to fight the battles of David, and highly incensed at the opposition his enemies made to his power and authority. When he descended to the engagement, the very heavens bowed down to render his descent more awful; his military tent was substantial darkness; the voice of his thunder was the warlike alarm which sounded to the battle; the chariot in which he rode were the thick clouds of heaven, conducted by cherubs, and carried on by the irresistible force and rapid wings of an impetuous tempest; and the darts and weapons he employed were thunder-bolts, lightnings, fiery hail, deluging rains, and stormy winds! No wonder that when God thus arose, all his enemies should be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "scattered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "those who hated him should flee before him! ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It does not appear, from any part of David’s history, that there ever was literally such a storm as is here described, which proved destructive to his enemies, and salutary to himself. There might, indeed, have been such a one, though there be no particular mention of it.” But it is more probable that the whole passage is to be understood figuratively, and that by these metaphorical and lofty expressions, and this sublime description, David only meant to set forth that storm of wrath and vengeance which God had poured upon his enemies and the glorious deliverance he had thereby wrought for him. See Dodd and Chandler.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-19 The first words, I will love thee, O Lord, my strength, are the scope and contents of the psalm. Those that truly love God, may triumph in him as their Rock and Refuge, and may with confidence call upon him. It is good for us to observe all the circumstances of a mercy which magnify the power of God and his goodness to us in it. David was a praying man, and God was found a prayer-hearing God. If we pray as he did, we shall speed as he did. God's manifestation of his presence is very fully described, ver. 7-15. Little appeared of man, but much of God, in these deliverances. It is not possible to apply to the history of the son of Jesse those awful, majestic, and stupendous words which are used through this description of the Divine manifestation. Every part of so solemn a scene of terrors tells us, a greater than David is here. God will not only deliver his people out of their troubles in due time, but he will bear them up under their troubles in the mean time. Can we meditate on ver. 18, without directing one thought to Gethsemane and Calvary? Can we forget that it was in the hour of Christ's deepest calamity, when Judas betrayed, when his friends forsook, when the multitude derided him, and the smiles of his Father's love were withheld, that the powers of darkness prevented him? The sorrows of death surrounded him, in his distress he prayed, Heb 5:7. God made the earth to shake and tremble, and the rocks to cleave, and brought him out, in his resurrection, because he delighted in him and in his undertaking.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In my distress - This refers, most probably, not to any particular case, but rather indicates his general habit of mind, that when he was in deep distress and danger he had uniformly called upon the Lord, and had found him ready to help.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I called upon the Lord - I prayed. That is, he invoked God to help him in his trouble. He relied not on his own strength; he looked not for human aid; he looked to God alone.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And cried unto my God - The word used here denotes an earnest cry for help. Compare Job 35:9; Job 36:13.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And cried unto my God - The word used here denotes an earnest cry for help. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He heard my voice out of his temple - That is, he, being in his temple, heard my voice. The word rendered temple (compare the notes at Psalm 5:7) cannot refer here to the temple at Jerusalem, for that was built after the death of David, but it refers either to heaven, considered as the temple, or dwelling-place of God, or to the tabernacle, considered as his abode on earth. The sense is not materially varied, whichever interpretation is adopted. Compare Psalm 11:4.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He heard my voice out of his temple - That is, he, being in his temple, heard my voice. The word rendered temple (compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") cannot refer here to the temple at Jerusalem, for that was built after the death of David, but it refers either to heaven, considered as the temple, or dwelling-place of God, or to the tabernacle, considered as his abode on earth. The sense is not materially varied, whichever interpretation is adopted. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And my cry came before him - He heard my cry. It was not intercepted on the way, but came up to him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Even into his ears - Indicating that he certainly heard it. Compare Genesis 23:10; Genesis 44:18; Genesis 50:4; Exodus 10:2 : Psalm 34:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Even into his ears - Indicating that he certainly heard it. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 23:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 44:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 50:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 34:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. He relates his methods to procure relief when distressed, and his success.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "temple—(Compare Ps 11:4).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Out of his temple; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, 1. Out of his sanctuary; whence he promised to hear and answer the prayers of his people, which are either made there or directed thither. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Out of his heavenly habitation, which is oft called his temple: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"Psalm 11:4\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In my distress I called upon the Lord,.... The great Jehovah, the everlasting I AM, who is the most High in all the earth, and who is able to save, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and cried unto my God; as Jesus did, Matthew 27:46; so the members of Christ, when in distress, as they often are, through sin and Satan, through the hidings of God's face, a variety of afflictions, and the persecutions of men, betake themselves to the Lord, and call upon their God: a time of distress is a time for prayer; and sometimes the end God has in suffering them to be in distress is to bring them to the throne of his grace; and a great privilege it is they have that they have such a throne to come to for grace and mercy to help them in time of need, and such a God to sympathize with them, and help them; and their encouragement to call upon him, and cry unto him, is, that he is Jehovah, omniscient, omnipotent, and omnipresent; who knows their wants, is able to help them, and is a God at hand to do it; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and cried unto my God; as Jesus did, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:46",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; so the members of Christ, when in distress, as they often are, through sin and Satan, through the hidings of God's face, a variety of afflictions, and the persecutions of men, betake themselves to the Lord, and call upon their God: a time of distress is a time for prayer; and sometimes the end God has in suffering them to be in distress is to bring them to the throne of his grace; and a great privilege it is they have that they have such a throne to come to for grace and mercy to help them in time of need, and such a God to sympathize with them, and help them; and their encouragement to call upon him, and cry unto him, is, that he is Jehovah, omniscient, omnipotent, and omnipresent; who knows their wants, is able to help them, and is a God at hand to do it; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He heard my voice out of his temple; that is, out of heaven his dwelling place; for the temple at Jerusalem was not built in David's time; and it may be observed, that the prayer of the psalmist, or whom he represents, was a vocal one, and not merely mental; and hearing it intends a gracious regard unto it, an acceptance of it, and an agreeable answer: for it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and my cry came before him, even into his ears; God did not cover himself with a cloud, that his prayer could not pass through; but it was admitted and received; it came up before him with acceptance; it reached his ears, and even entered into them, and was delightful music to them: see John 11:41. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and my cry came before him, even into his ears; God did not cover himself with a cloud, that his prayer could not pass through; but it was admitted and received; it came up before him with acceptance; it reached his ears, and even entered into them, and was delightful music to them: see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "In my distress I called upon the LORD, and cried unto my God: he heard my voice out of his temple, and my cry came before him, even into his ears.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "called … cried",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The tense in the original denotes ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "frequent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "repeated",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " prayer. The text of 2 Sam. has ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "called",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " twice, no doubt by an error of transcription.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of his temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The palace-temple of heaven, where He sits enthroned. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 18:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and my cry",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] R.V., and my cry before him came into his ears. But the terse vigour of the text in 2 Sam. is preferable: “and my cry was in his ears.” An alternative reading or an explanatory gloss has crept into the text here, to the detriment of the rhythm.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In my distress I called upon the Lord,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and cried unto my God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " At this supreme moment, when he is entangled in the snares, and on the point of being slain, the psalmist represents himself as invoking the aid of the Almighty. As HengstenBerg notes, \"While the manifold distresses are united in the beginning of the verse into one great 'distress,' so the manifold Divine hearings and helps are united into a single grand hearing and help\" - and, we may add, the manifold cries into one great cry. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He heard my voice out of his temple;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his tabernacle, since the temple was not yet built (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or perhaps, \"out of heaven \"(Cheyne). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And my cry came before him, even into his ears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same word is used for the \"cry\" of the children of Israel in Egypt). Psalm 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 18:5-7) In these verses David gathers into one collective figure all the fearful dangers to which he had been exposed during his persecution by Saul, together with the marvellous answers and deliverances he experienced, that which is unseen, which stands in the relation to that which is visible of cause and effect, rendering itself visible to him. David here appears as passive throughout; the hand from out of the clouds seizes him and draws him out of mighty waters: while in the second part of the Psalm, in fellowship with God and under His blessing, he comes forward as a free actor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The description begins in Psalm 18:5 with the danger and the cry for help which is not in vain. The verb אפף according to a tradition not to be doubted (cf. אופן a wheel) signifies to go round, surround, as a poetical synonym of סבב, הקּיף, כּתּר, and not, as one might after the Arabic have thought: to drive, urge. Instead of \"the bands of death,\" the lxx (cf. Acts 2:24) renders it ὠδῖνες (constrictive pains) θανάτου; but Psalm 18:6 favours the meaning bands, cords, cf. Psalm 119:61 (where it is likewise חבלי instead of the הבלי, which one might have expected, Joshua 17:5; Job 36:8), death is therefore represented as a hunter with a cord and net, Psalm 91:3. בליּעל, compounded of בּלי and יעל (from יעל, ועל, root על), signifies unprofitableness, worthlessness, and in fact both deep-rooted moral corruption and also abysmal destruction (cf. 2 Corinthians 6:15, Βελίαρ  equals  Βελίαλ as a name of Satan and his kingdom). Rivers of destruction are those, whose engulfing floods lead down to the abyss of destruction (Jonah 2:7). Death, Belı̂jáal, and Sheôl are the names of the weird powers, which make use of David's persecutors as their instruments. Futt. in the sense of imperfects alternate with praett. בּעת ( equals  Arab. bgt) signifies to come suddenly upon any one (but compare also Arab. b‛ṯ, to startle, excitare, to alarm), and קדּם, to rush upon; the two words are distinguished from one another like ׬berfallen and anfallen. The היכל out of which Jahve hears is His heavenly dwelling-place, which is both palace and temple, inasmuch as He sits enthroned there, being worshipped by blessed spirits. לפניו belongs to ושׁועתי: my cry which is poured forth before Him (as e.g., in Psalm 102:1), for it is tautological if joined with תּבא beside ושׁועתי. Before Jahve's face he made supplication and his prayer urged its way into His ears. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The description begins in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with the danger and the cry for help which is not in vain. The verb אפף according to a tradition not to be doubted (cf. אופן a wheel) signifies to go round, surround, as a poetical synonym of סבב, הקּיף, כּתּר, and not, as one might after the Arabic have thought: to drive, urge. Instead of \"the bands of death,\" the lxx (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") renders it ὠδῖνες (constrictive pains) θανάτου; but ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " favours the meaning bands, cords, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:61",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (where it is likewise חבלי instead of the הבלי, which one might have expected, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 17:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), death is therefore represented as a hunter with a cord and net, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 91:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". בליּעל, compounded of בּלי and יעל (from יעל, ועל, root על), signifies unprofitableness, worthlessness, and in fact both deep-rooted moral corruption and also abysmal destruction (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 6:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Βελίαρ  equals  Βελίαλ as a name of Satan and his kingdom). Rivers of destruction are those, whose engulfing floods lead down to the abyss of destruction (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Death, Belı̂jáal, and Sheôl are the names of the weird powers, which make use of David's persecutors as their instruments. Futt. in the sense of imperfects alternate with praett. בּעת ( equals  Arab. bgt) signifies to come suddenly upon any one (but compare also Arab. b‛ṯ, to startle, excitare, to alarm), and קדּם, to rush upon; the two words are distinguished from one another like ׬berfallen and anfallen. The היכל out of which Jahve hears is His heavenly dwelling-place, which is both palace and temple, inasmuch as He sits enthroned there, being worshipped by blessed spirits. לפניו belongs to ושׁועתי: my cry which is poured forth before Him (as e.g., in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 102:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), for it is tautological if joined with תּבא beside ושׁועתי. Before Jahve's face he made supplication and his prayer urged its way into His ears. ",
            "children": []
          }
        ]
      }
    ]
  }
]