[{"header":"Manasseh King of Judah"},{"num":33,"verse":"Manasseh was 12 years old when he became king of Judah. And he was king for 55 years in Jerusalem. "},{"num":2,"verse":"He did what the Lord said was wrong. He did the hated things the other nations had done. And the Lord had forced these nations out of the land ahead of Israel. "},{"num":3,"verse":"Manasseh’s father, Hezekiah, had torn down the places where false gods were worshiped. But Manasseh rebuilt them. Manasseh also built altars for the Baal gods and made Asherah idols. He bowed down to the stars and worshiped them. "},{"num":4,"verse":"The Lord had said about the Temple, “I will be worshiped in Jerusalem forever.” But Manasseh built altars for false gods in the Temple of the Lord. "},{"num":5,"verse":"He built altars to worship the stars in the two courtyards of the Temple of the Lord. "},{"num":6,"verse":"He burned his sons as sacrifices in the Valley of Ben Hinnom. He practiced magic and witchcraft. He told the future by explaining signs and dreams. He got advice from mediums and fortune-tellers. He did many things the Lord said were wrong. And this made the Lord angry."},{"num":7,"verse":"He carved an idol and put it in the Temple of God. God had spoken to David and his son Solomon about the Temple. He had said, “I will be worshiped in this Temple and in Jerusalem forever. I have chosen Jerusalem from all the tribes of Israel. "},{"num":8,"verse":"I will never again make the Israelites leave the land I gave to their ancestors. But they must obey everything I commanded them. They must obey all the teachings, rules and commands I gave them through Moses.” "},{"num":9,"verse":"But Manasseh led the people of Judah and Jerusalem to do wrong. They did more evil than the nations the Lord had destroyed ahead of the Israelites."},{"num":10,"verse":"The Lord spoke to Manasseh and his people, but they did not listen. "},{"num":11,"verse":"So the Lord brought the king of Assyria’s army commanders to attack Judah. They captured Manasseh and put hooks in him. They put bronze chains on his hands. They made him their prisoner and took him to Babylon. "},{"num":12,"verse":"As Manasseh suffered, he begged the Lord his God for help. He became very sorry for what he had done before the God of his ancestors. "},{"num":13,"verse":"When Manasseh prayed, the Lord heard him and had pity for him. So the Lord let him return to Jerusalem and to his kingdom. Then Manasseh knew that the Lord is the true God."},{"num":14,"verse":"After that happened, Manasseh rebuilt the outer wall for Jerusalem. It was in the valley on the west side of the Gihon spring. It went to the entrance of the Fish Gate and around the hill of Ophel. He also made the wall higher. Then he put commanders in all the strong, walled cities in Judah."},{"num":15,"verse":"Manasseh removed the idols of other nations. And he took the idol out of the Temple of the Lord. He removed all the altars he had built on the Temple hill and in Jerusalem. And he threw them out of the city. "},{"num":16,"verse":"Then he set up the Lord’s altar. And he sacrificed on it fellowship offerings and offerings to show thanks to the Lord. Manasseh commanded all the people of Judah to serve the Lord, the God of Israel. "},{"num":17,"verse":"The people continued to offer sacrifices at the places of worship. But their sacrifices were only to the Lord their God. "},{"num":18,"verse":"The other things Manasseh did as king are written down. His prayer to his God is recorded. And what the seers said to him in the name of the Lord, the God of Israel, is recorded. They are all in the book of the history of the kings of Israel. "},{"num":19,"verse":"Manasseh’s prayer and God’s pity for him are written down. Also all of Manasseh’s sins and how he was unfaithful to the Lord are recorded. The places he built for worshiping false gods and for the Asherah idols are recorded. He did all these things but later became sorry for them. They are all in the book of the seers. "},{"num":20,"verse":"Manasseh died and was buried in his palace. Then Manasseh’s son Amon became king in his place."},{"header":"Amon King of Judah"},{"num":21,"verse":"Amon was 22 years old when he became king. And he was king for two years in Jerusalem. "},{"num":22,"verse":"He did what the Lord said was wrong. He did as his father Manasseh had done. Amon worshiped and offered sacrifices to all the carved idols Manasseh had made. "},{"num":23,"verse":"Amon was not sorry for what he did wrong before the Lord. He was not sorry as his father Manasseh had been. Instead, Amon sinned even more."},{"num":24,"verse":"Amon’s officers made plans against him and killed him in his palace. "},{"num":25,"verse":"But the people of Judah killed all those who had made plans to kill King Amon. And they made his son Josiah to be king in his place."}]