[{"header":"Reign of Manasseh"},{"num":33,"verse":"Manas′seh was twelve years old when he began to reign, and he reigned fifty-five years in Jerusalem. "},{"num":2,"verse":"He did what was evil in the sight of the Lord, according to the abominable practices of the nations whom the Lord drove out before the people of Israel. "},{"num":3,"verse":"For he rebuilt the high places which his father Hezeki′ah had broken down, and erected altars to the Ba′als, and made Ashe′rahs, and worshiped all the host of heaven, and served them. "},{"num":4,"verse":"And he built altars in the house of the Lord, of which the Lord had said, “In Jerusalem shall my name be for ever.” "},{"num":5,"verse":"And he built altars for all the host of heaven in the two courts of the house of the Lord. "},{"num":6,"verse":"And he burned his sons as an offering in the valley of the son of Hinnom, and practiced soothsaying and augury and sorcery, and dealt with mediums and with wizards. He did much evil in the sight of the Lord, provoking him to anger. "},{"num":7,"verse":"And the image of the idol which he had made he set in the house of God, of which God said to David and to Solomon his son, “In this house, and in Jerusalem, which I have chosen out of all the tribes of Israel, I will put my name for ever; "},{"num":8,"verse":"and I will no more remove the foot of Israel from the land which I appointed for your fathers, if only they will be careful to do all that I have commanded them, all the law, the statutes, and the ordinances given through Moses.” "},{"num":9,"verse":"Manas′seh seduced Judah and the inhabitants of Jerusalem, so that they did more evil than the nations whom the Lord destroyed before the people of Israel."},{"header":"Manasseh Restored after Repentance"},{"num":10,"verse":"The Lord spoke to Manas′seh and to his people, but they gave no heed. "},{"num":11,"verse":"Therefore the Lord brought upon them the commanders of the army of the king of Assyria, who took Manas′seh with hooks and bound him with fetters of bronze and brought him to Babylon. "},{"num":12,"verse":"And when he was in distress he entreated the favor of the Lord his God and humbled himself greatly before the God of his fathers. "},{"num":13,"verse":"He prayed to him, and God received his entreaty and heard his supplication and brought him again to Jerusalem into his kingdom. Then Manas′seh knew that the Lord was God."},{"num":14,"verse":"Afterwards he built an outer wall for the city of David west of Gihon, in the valley, and for the entrance into the Fish Gate, and carried it round Ophel, and raised it to a very great height; he also put commanders of the army in all the fortified cities in Judah. "},{"num":15,"verse":"And he took away the foreign gods and the idol from the house of the Lord, and all the altars that he had built on the mountain of the house of the Lord and in Jerusalem, and he threw them outside of the city. "},{"num":16,"verse":"He also restored the altar of the Lord and offered upon it sacrifices of peace offerings and of thanksgiving; and he commanded Judah to serve the Lord the God of Israel. "},{"num":17,"verse":"Nevertheless the people still sacrificed at the high places, but only to the Lord their God."},{"header":"Death of Manasseh"},{"num":18,"verse":"Now the rest of the acts of Manas′seh, and his prayer to his God, and the words of the seers who spoke to him in the name of the Lord the God of Israel, behold, they are in the Chronicles of the Kings of Israel. "},{"num":19,"verse":"And his prayer, and how God received his entreaty, and all his sin and his faithlessness, and the sites on which he built high places and set up the Ashe′rim and the images, before he humbled himself, behold, they are written in the Chronicles of the Seers. "},{"num":20,"verse":"So Manas′seh slept with his fathers, and they buried him in his house; and Amon his son reigned in his stead."},{"header":"Amon’s Reign and Death"},{"num":21,"verse":"Amon was twenty-two years old when he began to reign, and he reigned two years in Jerusalem. "},{"num":22,"verse":"He did what was evil in the sight of the Lord, as Manas′seh his father had done. Amon sacrificed to all the images that Manas′seh his father had made, and served them. "},{"num":23,"verse":"And he did not humble himself before the Lord, as Manas′seh his father had humbled himself, but this Amon incurred guilt more and more. "},{"num":24,"verse":"And his servants conspired against him and killed him in his house. "},{"num":25,"verse":"But the people of the land slew all those who had conspired against King Amon; and the people of the land made Josi′ah his son king in his stead."}]