[{"header":"The Land Yet to Be Conquered"},{"num":13,"verse":"When Joshua was an old man, the Lord said to him, “You are growing old, and much land remains to be conquered."},{"num":2,"verse":"This is the territory that remains: all the regions of the Philistines and the Geshurites,"},{"num":3,"verse":"and the larger territory of the Canaanites, extending from the stream of Shihor on the border of Egypt, northward to the boundary of Ekron. It includes the territory of the five Philistine rulers of Gaza, Ashdod, Ashkelon, Gath, and Ekron. The land of the Avvites"},{"num":4,"verse":"in the south also remains to be conquered. In the north, the following area has not yet been conquered: all the land of the Canaanites, including Mearah (which belongs to the Sidonians), stretching northward to Aphek on the border of the Amorites;"},{"num":5,"verse":"the land of the Gebalites and all of the Lebanon mountain area to the east, from Baal-gad below Mount Hermon to Lebo-hamath;"},{"num":6,"verse":"and all the hill country from Lebanon to Misrephoth-maim, including all the land of the Sidonians."},{"num":7,"verse":"Include all this territory as Israel’s possession when you divide this land among the nine tribes and the half-tribe of Manasseh.”"},{"header":"The Land Divided East of the Jordan"},{"num":8,"verse":"Half the tribe of Manasseh and the tribes of Reuben and Gad had already received their grants of land on the east side of the Jordan, for Moses, the servant of the Lord, had previously assigned this land to them."},{"header":"An Allotment for the Tribe of Levi"},{"num":14,"verse":"Moses did not assign any allotment of land to the tribe of Levi. Instead, as the Lord had promised them, their allotment came from the offerings burned on the altar to the Lord, the God of Israel."},{"header":"The Land Given to the Tribe of Reuben"},{"num":15,"verse":"Moses had assigned the following area to the clans of the tribe of Reuben."},{"header":"The Land Given to the Tribe of Gad"},{"num":24,"verse":"Moses had assigned the following area to the clans of the tribe of Gad."},{"header":"The Land Given to the Half-Tribe of Manasseh"},{"num":29,"verse":"Moses had assigned the following area to the clans of the half-tribe of Manasseh."},{"num":32,"verse":"These are the allotments Moses had made while he was on the plains of Moab, across the Jordan River, east of Jericho."},{"num":33,"verse":"But Moses gave no allotment of land to the tribe of Levi, for the Lord, the God of Israel, had promised that he himself would be their allotment."}]