[{"num":18,"verse":"He that will go away from a friend, seeketh occasions, that is, feigneth causes, (or looketh for reasons); in all time he shall be despisable."},{"num":2,"verse":"A fool receiveth not the words of prudence; no but thou say those things, that be turned (over) in his heart."},{"num":3,"verse":"A wicked man, when he cometh into (the) depth of sins, despiseth wholesome lore, (or discipline,) and commandment; but scandal and shame followeth him."},{"num":4,"verse":"Deep water is the words of the mouth of a man; and a strand floating over is the well of wisdom. (Words from a person’s mouth can be like deep water/can be as deep as the water; and the well of wisdom is like a stream flowing over.)"},{"num":5,"verse":"It is not good to take the person of a wicked man in doom, that thou bow away from the truth of doom. (It is not good to favour a wicked person, so that thou turn away from the truth in judgement.)"},{"num":6,"verse":"The lips of a fool meddle themselves with chidings; and his mouth stirreth strives. (A fool’s lips mix, or mingle, themselves in with arguments; and his mouth stirreth up strife.)"},{"num":7,"verse":"The mouth of a fool is [the] defouling of him; and his lips be the falling of his soul."},{"num":8,"verse":"The words of a double-tongued man be as simple; and they come unto the inner things of the womb. Dread casteth down a slow man; forsooth the souls of men turned into women’s condition shall have hunger. (A gossip’s words be tasty; and they go down into the innermost parts. Fear casteth down the lazy; and those who be timid shall have hunger.)"},{"num":9,"verse":"He that is nesh, and dissolute, either unsteadfast, in his work, is the brother of a man destroying his works."},{"num":10,"verse":"A full strong tower is the name of the Lord; a just man runneth to him, and [he] shall be enhanced. (The Lord’s name is a full strong tower; the righteous run to it, and they shall be safe.)"},{"num":11,"verse":"The chattel of a rich man is the city of his strength; and as a strong wall compassing him. (A rich person’s possessions is the city of his strength; and they be like a strong wall surrounding him, or so he thinketh.)"},{"num":12,"verse":"The heart of man is enhanced, before that it be broken; and it is made meek, before that it be glorified. (A person’s heart is raised up in pride, before that it is broken; and it is humbled, before that it is glorified.)"},{"num":13,"verse":"He that answereth before that he heareth, showeth himself to be a fool; and worthy of shame."},{"num":14,"verse":"The spirit of a man sustaineth (him in) his feebleness; but who may sustain a spirit light to be wroth? (A person’s spirit can sustain him in sickness; but who can endure with a broken spirit?)"},{"num":15,"verse":"The heart of a prudent man shall hold steadfastly knowing; and the ear of wise men seeketh teaching. (The heart of a person with understanding shall steadfastly hold onto knowledge; and the ears of the wise seek out teaching, or instruction.)"},{"num":16,"verse":"The gift of a man alargeth his way; and maketh space to him before princes. (Giving a gift openeth, or smootheth, one’s way; and maketh an opening for thee among the leaders, or among the powerful.)"},{"num":17,"verse":"A just man is the first accuser of himself; his friend cometh, and shall search him. (He who is the first to speak for a cause seemeth right; but then his opponent shall come, and shall search him out.)"},{"num":18,"verse":"Lot ceaseth against-sayings; and deemeth also among mighty men. (Casting lots ceaseth arguments; and also judgeth, or decideth, among the mighty.)"},{"num":19,"verse":"A brother that is helped of a brother, is as a steadfast city; and [the] dooms be as the bars of cities. (A brother helped by a brother, is like protection from the wall of a steadfast city; but arguments be like the bars of a city, preventing entry.)"},{"num":20,"verse":"A man’s womb shall be [ful]filled of the fruit of his mouth (A man’s belly shall be fulfilled, or satisfied, by the fruit of his mouth); and the seeds of his lips shall fill him."},{"num":21,"verse":"Death and life be in the works of [the] tongue; they that love it, shall eat the fruits thereof (they who nurture it, shall eat its fruits)."},{"num":22,"verse":"He that findeth a good woman, findeth a good thing; and of the Lord he shall draw up mirth (and he receiveth favour from the Lord). He that putteth away a good woman, putteth away a good thing; but he that holdeth (onto an) adulteress, is a fool and unwise."},{"num":23,"verse":"A poor man shall speak with beseechings, (or with pleadings); and a rich man shall speak sternly."},{"num":24,"verse":"A man friendly to fellowship shall more be a friend, than a brother. (A man given to fellowship with thee, can be more of a friend, than even thy own brother.)"}]