[{"header":"The Tribes on the East Side of the Jordan River"},{"num":32,"verse":"The tribes of Reuben and Gad had very large herds and flocks. They looked at the lands of Jazer and Gilead. They saw that those lands were just right for livestock. "},{"num":2,"verse":"So they came to Moses and Eleazar the priest. They also came to the leaders of the community. They said, "},{"num":3,"verse":"“We have seen the cities of Ataroth, Dibon, Jazer, Nimrah and Heshbon. We’ve seen Elealeh, Sebam, Nebo and Beon. "},{"num":4,"verse":"All of them are in the land the Lord has brought under Israel’s control. This land is just right for livestock. And we have livestock. "},{"num":5,"verse":"We hope you are pleased with us,” they continued. “If you are, please give us this land. Then it will belong to us. But don’t make us go across the Jordan River.”"},{"num":6,"verse":"Moses spoke to the people of Gad and Reuben. He said, “Should the rest of us go to war while you stay here? "},{"num":7,"verse":"The Lord has given the land of Canaan to the Israelites. So why would you want to keep them from going over into it? "},{"num":8,"verse":"That’s what your fathers did. I sent them from Kadesh Barnea to check out the land. "},{"num":9,"verse":"They went up to the Valley of Eshkol and looked at the land. Then they talked the Israelites out of entering the land the Lord had given them. "},{"num":10,"verse":"The Lord’s anger was stirred up that day. So he made a promise. He said, "},{"num":11,"verse":"‘Not one of those who were 20 years old or more when they came up out of Egypt will see the land. They have not followed me with their whole heart. I promised to give the land to Abraham, Isaac and Jacob. "},{"num":12,"verse":"But not one of the people who came up out of Egypt will see the land except Caleb and Joshua. Caleb is the son of Jephunneh, the Kenizzite. And Joshua is the son of Nun. They will see the land. They followed the Lord with their whole heart.’ "},{"num":13,"verse":"The Lord became very angry with Israel. He made them wander around in the desert for 40 years. They wandered until all the people who had done evil in his sight had died."},{"num":14,"verse":"“Now here you are, you bunch of sinners! You have taken the place of your fathers. And you are making the Lord even angrier with Israel. "},{"num":15,"verse":"What if you turn away from following him? Then he’ll leave all these people in the desert again. And it will be your fault when they are destroyed.”"},{"num":16,"verse":"Then they came up to Moses. They said, “We would like to build pens here for our livestock. We would also like to build cities for our women and children. "},{"num":17,"verse":"But we will prepare ourselves for battle. We’re even ready to go ahead of the Israelites. We’ll march out with them until we’ve brought them to their place. While we’re gone, our women and children will live in cities that have high walls around them. That will keep them safe from the people living in this land. "},{"num":18,"verse":"We won’t return to our homes until each of the Israelites has received their share of the land. "},{"num":19,"verse":"We won’t receive any share with them on the west side of the Jordan River. We’ve already received our share here on the east side.”"},{"num":20,"verse":"Then Moses said to them, “Do what you have promised to do. Get ready to fight for the Lord. "},{"num":21,"verse":"Prepare yourselves and go across the Jordan River. Fight for the Lord until he has driven out his enemies in front of him. "},{"num":22,"verse":"When the land is under the Lord’s control, you can come back here. Your duty to the Lord and Israel will be over. Then the Lord will give you this land as your own."},{"num":23,"verse":"“But what if you fail to do your duty? Then you will be sinning against the Lord. And you may be sure that your sin will be discovered. It will be brought out into the open. "},{"num":24,"verse":"So build up cities for your women and children. Make sheep pens for your flocks. But do what you have promised to do.”"},{"num":25,"verse":"The people of Gad and Reuben spoke to Moses. They said, “We will do just as you command. "},{"num":26,"verse":"Our children and wives will remain here in the cities of Gilead. So will our flocks and herds. "},{"num":27,"verse":"But we will prepare ourselves for battle. We’ll go across the Jordan River and fight for the Lord. We will do just as you have said.”"},{"num":28,"verse":"Then Moses gave orders about them to Eleazar the priest. He gave the same orders to Joshua, the son of Nun. He also spoke to the family leaders of the Israelite tribes. "},{"num":29,"verse":"He said, “The men of Gad and Reuben must get ready for battle. They must go across the Jordan River with you. They must help you fight for the Lord. They must stay with you until the land has been brought under your control. If they do, you must give them the land of Gilead as their own. "},{"num":30,"verse":"But what if they don’t get ready for battle? What if they don’t go across the Jordan with you? Then they must accept a share with you in Canaan.”"},{"num":31,"verse":"The people of Gad and Reuben gave their answer. They said, “We will do what the Lord has said. "},{"num":32,"verse":"We’ll get ready for battle. We’ll go across the Jordan into Canaan. We’ll fight for the Lord there. But the property we receive will be on this side of the Jordan River.”"},{"num":33,"verse":"Then Moses gave their land to them. He gave it to the tribes of Gad and Reuben and half of the tribe of Manasseh. Manasseh was Joseph’s son. One part of that land had belonged to the kingdom of Sihon. He was the king of the Amorites. The other part had belonged to the kingdom of Og. He was the king of Bashan. Moses gave that whole land to those two and a half tribes. It included its cities and the territory around them."},{"num":34,"verse":"The people of Gad built up the cities of Dibon, Ataroth and Aroer. "},{"num":35,"verse":"They built up Atroth Shophan, Jazer, Jogbehah, "},{"num":36,"verse":"Beth Nimrah and Beth Haran. They built a high wall around each of those cities. They also built sheep pens for their flocks. "},{"num":37,"verse":"The people of Reuben built up Heshbon, Elealeh and Kiriathaim. "},{"num":38,"verse":"They also built up Nebo, Baal Meon and Sibmah. They gave new names to the cities they had built up."},{"num":39,"verse":"The people of Makir, the son of Manasseh, went to the land of Gilead. They captured it. They drove out the Amorites living there. "},{"num":40,"verse":"So Moses gave Gilead to the people of Makir, the son of Manasseh. And they settled there. "},{"num":41,"verse":"Jair was from the family line of Manasseh. Jair captured Gilead’s settlements. He called them Havvoth Jair. "},{"num":42,"verse":"Nobah captured Kenath and the settlements around it. He named it after himself."}]