[{"num":12,"verse":"Now Miriam and Aaron talked against Moses [their brother] because of his Cushite wife, for he had married a Cushite woman."},{"num":2,"verse":"And they said, Has the Lord indeed spoken only by Moses? Has He not spoken also by us? And the Lord heard it."},{"num":3,"verse":"Now the man Moses was very meek (gentle, kind, and humble) or above all the men on the face of the earth."},{"num":4,"verse":"Suddenly the Lord said to Moses, Aaron, and Miriam, Come out, you three, to the Tent of Meeting. And the three of them came out."},{"num":5,"verse":"The Lord came down in a pillar of cloud, and stood at the Tent door and called Aaron and Miriam, and they came forward."},{"num":6,"verse":"And He said, Hear now My words: If there is a prophet among you, I the Lord make Myself known to him in a vision and speak to him in a dream."},{"num":7,"verse":"But not so with My servant Moses; he is entrusted and faithful in all My house."},{"num":8,"verse":"With him I speak mouth to mouth [directly], clearly and not in dark speeches; and he beholds the form of the Lord. Why then were you not afraid to speak against My servant Moses?"},{"num":9,"verse":"And the anger of the Lord was kindled against them, and He departed."},{"num":10,"verse":"And when the cloud departed from over the Tent, behold, Miriam was leprous, as white as snow. And Aaron looked at Miriam, and, behold, she was leprous!"},{"num":11,"verse":"And Aaron said to Moses, Oh, my lord, I plead with you, lay not the sin upon us in which we have done foolishly and in which we have sinned."},{"num":12,"verse":"Let her not be as one dead, already half decomposed when he comes out of his mother’s womb."},{"num":13,"verse":"And Moses cried to the Lord, saying, Heal her now, O God, I beseech You!"},{"num":14,"verse":"And the Lord said to Moses, If her father had but spit in her face, should she not be ashamed for seven days? Let her be shut up outside the camp for seven days, and after that let her be brought in again."},{"num":15,"verse":"So Miriam was shut up without the camp for seven days, and the people did not journey on until Miriam was brought in again."},{"num":16,"verse":"Afterward [they] removed from Hazeroth and encamped in the Wilderness of Paran."}]