[{"header":"Miriam and Aaron Speak Against Moses"},{"num":12,"verse":"Miriam [Ex. 15:20] and Aaron [Moses’ sister and brother] began to talk against Moses because of his Cushite wife (he had married a Cushite [perhaps Zipporah (Hab. 3:7), but more likely an Ethiopian]). "},{"num":2,"verse":"They said, “Is Moses the only one the Lord speaks through? Doesn’t he also speak through us?” And the Lord heard this."},{"num":3,"verse":"(Now Moses was very ·humble [or devout]. He was the ·least proud [most humble; or most devout] person on earth.)"},{"num":4,"verse":"So the Lord suddenly spoke to Moses, Aaron, and Miriam and said, “All three of you come to the Meeting Tent.” So they went. "},{"num":5,"verse":"The Lord came down in a pillar of cloud [representing his presence; Ex. 13:21] and stood at the entrance to the Tent. He called to Aaron and Miriam, and they both came near. "},{"num":6,"verse":"He said, “Listen to my words:"},{"num":9,"verse":"The Lord was very angry with them, and he left."},{"num":10,"verse":"When the cloud lifted from the Tent and Aaron turned toward Miriam, she was as white as snow; she had a skin disease [rendering her ritually unclean; Num. 5:2; Lev. 13:2]. "},{"num":11,"verse":"Aaron said to Moses, “Please, my ·master [lord], ·forgive us for our foolish sin [do not punish us for our foolish sin; do not lay sin on us that we foolishly committed]. "},{"num":12,"verse":"Don’t let her be like a baby who is ·born dead [stillborn]. (Sometimes a baby is born with half of its flesh eaten away.)”"},{"num":13,"verse":"So Moses cried out to the Lord, “God, please heal her!”"},{"num":14,"verse":"The Lord answered Moses, “If her father had spit in her face, ·she would [would she not…?] have been shamed for seven days, so ·put her [she was shut] outside the camp for seven days. After that, she may come back.” "},{"num":15,"verse":"So Miriam was ·put [shut] outside of the camp for seven days, and the people did not move on until she came back."},{"num":16,"verse":"After that, the people left Hazeroth and camped in the ·Desert [Wilderness] of Paran."}]