[[],[{"type":"prose","content":"And Miriam speaketh -- Aaron also -- against Moses concerning the circumstance of the Cushite woman whom he had taken: for a Cushite woman he had taken;"}],[{"type":"prose","content":"and they say, `Only by Moses hath Jehovah spoken? also by us hath he not spoken?' and Jehovah heareth."}],[{"type":"prose","content":"And the man Moses [is] very humble, more than any of the men who [are] on the face of the ground."}],[{"type":"prose","content":"And Jehovah saith suddenly unto Moses, and unto Aaron, and unto Miriam, `Come out ye three unto the tent of meeting;' and they three come out."}],[{"type":"prose","content":"And Jehovah cometh down in the pillar of the cloud, and standeth at the opening of the tent, and calleth Aaron and Miriam, and they come out both of them."}],[{"type":"prose","content":"And He saith, `Hear, I pray you, My words: If your prophet is of Jehovah -- in an appearance unto him I make Myself known; in a dream I speak with him;"}],[{"type":"prose","content":"not so My servant Moses; in all My house he [is] stedfast;"}],[{"type":"prose","content":"mouth unto mouth I speak with him, and [by] an appearance, and not in riddles; and the form of Jehovah he beholdeth attentively; and wherefore have ye not been afraid to speak against My servant -- against Moses?'"}],[{"type":"prose","content":"And the anger of Jehovah burneth against them, and He goeth on,"}],[{"type":"prose","content":"and the cloud hath turned aside from off the tent, and lo, Miriam [is] leprous as snow; and Aaron turneth unto Miriam, and lo, leprous!"}],[{"type":"prose","content":"And Aaron saith unto Moses, `O, my lord, I pray thee, lay not upon us sin [in] which we have been foolish, and [in] which we have sinned;"}],[{"type":"prose","content":"let her not, I pray thee, be as [one] dead, when in his coming out from the womb of his mother -- the half of his flesh is consumed.'"}],[{"type":"prose","content":"And Moses crieth unto Jehovah, saying, `O God, I pray Thee, give, I pray Thee, healing to her.'"}],[{"type":"prose","content":"And Jehovah saith unto Moses, `And her father had but spat in her face -- is she not ashamed seven days? she is shut out seven days at the outside of the camp, and afterwards she is gathered.'"}],[{"type":"prose","content":"And Miriam is shut out at the outside of the camp seven days, and the people hath not journeyed till Miriam is gathered;"}],[{"type":"prose","content":"and afterwards have the people journeyed from Hazeroth, and they encamp in the wilderness of Paran."}]]