[{"num":38,"verse":"1 David lying sick of some grievous disease, acknowledgeth himself to be chastised of the Lord for his sins, and therefore prayeth God to turn away his wrath. 5 He uttereth the greatness of his grief by many words and circumstances, as wounded with the arrows of God’s ire, forsaken of his friends, evil intreated of his enemies. 22 But in the end with firm confidence he commendeth his cause to God, and hopeth for speedy help at his hand."},{"num":1,"verse":"O Lord, rebuke me not in thine anger, neither chastise me in thy wrath."},{"num":2,"verse":"For thine arrows have light upon me, and thine hand lieth upon me."},{"num":3,"verse":"There is nothing sound in my flesh, because of thine anger: neither is there rest in my bones, because of my sin."},{"num":4,"verse":"For mine iniquities are gone over mine head, and as a weighty burden they are too heavy for me."},{"num":5,"verse":"My wounds are putrefied, and corrupt because of my foolishness."},{"num":6,"verse":"I am bowed, and crooked very sore: I go mourning all the day."},{"num":7,"verse":"For my reins are full of burning, and there is nothing sound in my flesh."},{"num":8,"verse":"I am weakened and sore broken: I roar for the very grief of mine heart."},{"num":9,"verse":"Lord, I pour my whole desire before thee, and my sighing is not hid from thee."},{"num":10,"verse":"Mine heart panteth: my strength faileth me, and the light of mine eyes, even they are not mine own."},{"num":11,"verse":"My lovers and my friends stand aside from my plague, and my kinsmen stand afar off."},{"num":12,"verse":"They also that seek after my life, lay snares, and they that go about to do me evil, talk wicked things and imagine deceit continually."},{"num":13,"verse":"But I as a deaf man heard not, and am as a dumb man, which openeth not his mouth."},{"num":14,"verse":"Thus am I as a man, that heareth not, and in whose mouth are no reproofs."},{"num":15,"verse":"For on thee, O Lord, do I wait: thou wilt hear me, my Lord, my God."},{"num":16,"verse":"For I said, Hear me, lest they rejoice over me: for when my foot slippeth, they extol themselves against me."},{"num":17,"verse":"Surely I am ready to halt, and my sorrow is ever before me."},{"num":18,"verse":"When I declare my pain, and am sorry for my sin,"},{"num":19,"verse":"Then mine enemies are alive, and are mighty, and they that hate me wrongfully are many."},{"num":20,"verse":"They also, that reward evil for good, are mine adversaries, because I follow goodness."},{"num":21,"verse":"Forsake me not, O Lord, be not thou far from me, my God."},{"num":22,"verse":"Haste thee, to help me, O my Lord, my salvation."}]