[{"num":1,"verse":"¶ O LORD, rebuke me not in thy wrath: neither chasten me in thy hot displeasure."},{"num":2,"verse":"For thine arrows stick fast in me, and thy hand presses me sore."},{"num":3,"verse":"There is no soundness in my flesh because of thine anger; neither is there any rest in my bones because of my sin."},{"num":4,"verse":"For my iniquities are gone over my head; as a heavy burden they are too heavy for me."},{"num":5,"verse":"My wounds stink and are corrupt because of my foolishness."},{"num":6,"verse":"I am troubled; I am bowed down greatly; I go mourning all the day long."},{"num":7,"verse":"For my loins are filled with a loathsome disease, and there is no soundness in my flesh."},{"num":8,"verse":"I am feeble and sore broken; I roar by reason of the disquietness of my heart."},{"num":9,"verse":"Lord, all my desire is before thee, and my groaning is not hid from thee."},{"num":10,"verse":"My heart pants, my strength fails me; as for the light of my eyes, it also is gone from me."},{"num":11,"verse":"My friends and my companions stand aloof from my sore, and my kinsmen stand afar off."},{"num":12,"verse":"¶ Those that seek after my life lay snares for me, and those that seek my hurt speak calamities and imagine deceits all the day long."},{"num":13,"verse":"But I, as a deaf man heard not, and was as a dumb man that did not open his mouth."},{"num":14,"verse":"Thus I was as a man that does not hear, and in whose mouth are no reproofs."},{"num":15,"verse":"For thee, O LORD, do I wait; thou wilt respond, O Lord my God."},{"num":16,"verse":"For I said, Let them not rejoice over me; let them not magnify themselves against me when my foot slips."},{"num":17,"verse":"For I am ready to halt, and my sorrow is continually before me."},{"num":18,"verse":"Therefore I will declare my iniquity; I will be sorry for my sin."},{"num":19,"verse":"For my enemies are alive, and they are strong, and those that hate me wrongfully are multiplied;"},{"num":20,"verse":"rendering evil for good they are against me because I follow that which is good."},{"num":21,"verse":"Forsake me not, O LORD; O my God, be not far from me."},{"num":22,"verse":"Make haste to help me, O Lord my salvation."}]