[{"num":38,"verse":"The psalm of David, to bethink on the sabbath. Lord, reprove thou not me in thy strong vengeance; neither chastise thou me in thine ire. (The song of David, to remember the sabbath. Lord, rebuke thou me not in thy fury; nor chastise thou me in thy anger.)"},{"num":2,"verse":"For thine arrows be fixed in me; and thou hast made steadfast thine hand on me."},{"num":3,"verse":"None health is in my flesh from the face of thine ire; no peace is to my bones from the face of my sins. (There is no health in my flesh, because of thy anger; there is no peace for my bones, because of my sins.)"},{"num":4,"verse":"For my wickednesses be gone over mine head; as an heavy burden, those be made heavy on me (like a heavy weight, they be made heavy upon me)."},{"num":5,"verse":"Mine healed wounds were rotten, and be broken; from the face of mine unwisdom. (My wounds became rotten, and broken; because of my folly, or my foolishness.)"},{"num":6,"verse":"I am made a wretch, and I am bowed down till into the end; all day I entered sorrowful. (I am made a wretch, and I am bent down to the ground; I go about in sorrow all day long.)"},{"num":7,"verse":"For my loins be filled with scornings; and health is not in my flesh. (For my loins be filled with sickness; and there is no health in my flesh.)"},{"num":8,"verse":"I am tormented, and made low full greatly (I am tormented, and brought down so very low); I roared for the wailing of mine heart."},{"num":9,"verse":"Lord, all my desire is before thee; and my wailing is not hid from thee."},{"num":10,"verse":"Mine heart is troubled in me, my virtue forsook me; and the light of mine eyes, and it is not with me. (My heart is troubled within me, my strength deserted me; and the light in my eyes, it hath also left me.)"},{"num":11,"verse":"My friends and my neighbours nighed; and stood (over) against me. And they that were beside me stood afar; (My friends and my neighbours stand far away from me; because of my sickness, or my sores. And even my family members stand far away from me;)"},{"num":12,"verse":"and they did violence, that sought my life. And they that sought evils to me, spake vanities; and thought guiles all day. (and they who sought my life, did violence to me. Yea, they who sought evil for me, spoke empty gossip; and they thought up lies and slander about me, all day long.)"},{"num":13,"verse":"But I, as a deaf man, heard not; and as a dumb man not opening his mouth. (But I, like a deaf man, did not listen to them; and like a dumb man, I did not open my mouth.)"},{"num":14,"verse":"And I am made as a man not hearing; and not having reprovings in his mouth. (And I am made like a deaf man; yea, one not speaking any rebuke, or reply.)"},{"num":15,"verse":"For, Lord, I hoped in thee (For, Lord, I trusted in thee); my Lord God, thou shalt hear me."},{"num":16,"verse":"For I said, (Hear me,) Lest any time mine enemies have joy on me; and the while my feet be moved/and while my feet were moved, they spake great things on me. (For I said, Hear me, lest any time my enemies have joy over me; for when my feet slipped, or stumbled, they spoke many things against me.)"},{"num":17,"verse":"For I am ready to beatings; and my sorrow is ever[more] in my sight. (For I am about to fall; and my sorrow is before me forevermore.)"},{"num":18,"verse":"For I shall tell my wickedness; and I shall think for my sin. (For I shall tell out my wickedness; and I am afraid, when I think of my sin.)"},{"num":19,"verse":"But mine enemies live, and they be confirmed on me; and they be multiplied, that hate me wickedly. (But my enemies live, and they be strong against me; yea, there be many who wickedly hate me.)"},{"num":20,"verse":"They that yield evils for goods, backbited me; for I followed goodness. (Those who give back evil in return for good, backbite me; because I do what is right, or good.)"},{"num":21,"verse":"My Lord God, forsake thou not me (do not thou desert me); go thou not away from me."},{"num":22,"verse":"Lord God of mine health; behold thou into mine help. (Lord God of my salvation, or of my deliverance, hasten thou to help me.)"}]