[{"header":"Chapter 4"},{"num":1,"verse":"Vanity of Toil. Again I saw all the oppressions that take place under the sun: the tears of the victims with none to comfort them! From the hand of their oppressors comes violence, and there is none to comfort them! "},{"num":2,"verse":"And those now dead, I declared more fortunate in death than are the living to be still alive. "},{"num":3,"verse":"And better off than both is the yet unborn, who has not seen the wicked work that is done under the sun. "},{"num":4,"verse":"Then I saw that all toil and skillful work is the rivalry of one person with another. This also is vanity and a chase after wind."},{"num":7,"verse":"Companions and Successors. Again I saw this vanity under the sun: "},{"num":8,"verse":"those all alone with no companion, with neither child nor sibling—with no end to all their toil, and no satisfaction from riches. For whom do I toil and deprive myself of good things? This also is vanity and a bad business. "},{"num":9,"verse":"Two are better than one: They get a good wage for their toil. "},{"num":10,"verse":"If the one falls, the other will help the fallen one. But woe to the solitary person! If that one should fall, there is no other to help. "},{"num":11,"verse":"So also, if two sleep together, they keep each other warm. How can one alone keep warm? "},{"num":12,"verse":"Where one alone may be overcome, two together can resist. A three-ply cord is not easily broken."},{"num":13,"verse":"Better is a poor but wise youth than an old but foolish king who no longer knows caution; "},{"num":14,"verse":"for from a prison house he came forth to reign; despite his kingship he was born poor. "},{"num":15,"verse":"I saw all the living, those who move about under the sun, with the second youth who will succeed him. "},{"num":16,"verse":"There is no end to all this people, to all who were before them; yet the later generations will not have joy in him. This also is vanity and a chase after wind."},{"num":17,"verse":"Vanity of Many Words. Guard your step when you go to the house of God. Draw near for obedience, rather than for the fools’ offering of sacrifice; for they know not how to keep from doing evil."}]