[[],[{"type":"header","content":"The Evils of Oppression"},{"type":"prose","content":"Then I looked again at all the acts of oppression which were being done under the sun. And behold,  the tears of the oppressed and  they had no one to comfort ; and power was on the side of their oppressors, but they had no one to comfort ."}],[{"type":"prose","content":"So I congratulated the dead who are already dead, more than the living who are still living."}],[{"type":"prose","content":"But better  than both of them is the one who has never existed, who has never seen the evil activity that is done under the sun."}],[{"type":"prose","content":"I have seen that every labor and every skill which is done is  rivalry between a person and his neighbor. This too is futility and striving after wind."}],[{"type":"prose","content":"The fool folds his hands and consumes his own flesh."}],[{"type":"prose","content":"One hand full of rest is better than two fists full of labor and striving after wind."}],[{"type":"prose","content":"Then I looked again at futility under the sun."}],[{"type":"prose","content":"There was a man without a dependent, having neither a son nor a brother, yet there was no end to all his labor. Indeed, his eyes were not satisfied with riches, , “And for whom do I labor and deprive myself of pleasure?” This too is futility, and it is an unhappy task."}],[{"type":"prose","content":"Two are better than one because they have a good return for their labor;"}],[{"type":"prose","content":"for if either of them falls, the one will lift up his companion. But woe to the one who falls when there is not another to lift him up!"}],[{"type":"prose","content":"Furthermore, if two lie down together they keep warm, but how can one be warm ?"}],[{"type":"prose","content":"And if one can overpower him who is alone, two can resist him. A cord of three  is not quickly torn apart."}],[{"type":"prose","content":"A poor yet wise youth is better than an old and foolish king who no longer knows  to receive instruction—"}],[{"type":"prose","content":"for he has come out of prison to become king, even though he was born poor in his kingdom."}],[{"type":"prose","content":"I have seen all those living under the sun move to the side of the second youth who replaces him."}],[{"type":"prose","content":"There is no end to all the people, to all who were before them. Even the ones who will come later will not be happy with him; for this too is futility and striving after wind."}]]