[{"num":4,"verse":"I turned me to other things, and I saw false challenges, that be done under the sun (and I saw much oppression, that is done under the sun), and the tears of the guiltless, and (that) no man (was a) comforter; and that they destitute, either forsaken, of the help of all men, may not against-stand the violence of them."},{"num":2,"verse":"And I praised more dead men than living men; (And I praised the dead more than the living;)"},{"num":3,"verse":"and I deemed him, that was not born yet, and saw not the evils that be done under the sun, to be more blessed than ever either. (and I judged him, who was not yet born, and saw not the evils that be done under the sun, to be more blessed than either the living or the dead.)"},{"num":4,"verse":"Again I beheld all the travails of men, and busynesses; and I perceived that those be open to [the] envy of the neighbour; and therefore in this is vanity (and so this is emptiness and futility), and superfluous busyness."},{"num":5,"verse":"A fool foldeth together his hands, and eateth his flesh (and eateth his meat),"},{"num":6,"verse":"and saith, Better is an handful, with rest, than ever either hand full, with travail and torment of soul."},{"num":7,"verse":"I beheld and found also another vanity under the sun; (I looked and found more emptiness and futility under the sun;)"},{"num":8,"verse":"one there is, and he hath not a second; neither a son, nor a brother; and nevertheless he ceaseth not to travail, neither his eyes be (ful)filled with riches; neither he bethinketh (to) him(self), and saith, To whom travail I, and deceive my soul in goods? In this also is vanity, and the worst torment. (one is alone, and he hath not a second, or someone with him; neither a son, nor a brother; and yet he ceaseth not to labour, and his eyes be not fulfilled with his riches; nor he thinketh to himself, and saith, For whom do I labour, and deprive myself of the enjoyment of good things? This is also empty and futile, and the worst torment.)"},{"num":9,"verse":"Therefore it is better, that two be together than one; for they have profit of their fellowship. (And so it is better, that two be together, rather than that they be alone; for they shall have profit, or shall benefit, from their fellowship.)"},{"num":10,"verse":"If one falleth down, he shall be underset of the tother; woe to him that is alone, for when he falleth, he hath none to raise him up. (If one falleth down, he shall be helped up by the other; woe to him who is alone, for when he falleth, he hath no one to raise him up again.)"},{"num":11,"verse":"And if twain sleep together, they shall be nourished together; (but) how shall one be made hot?"},{"num":12,"verse":"And if any man hath [the] mastery against one, twain against-stand him; a threefold cord is broken of hard (a threefold cord is much harder to break)."},{"num":13,"verse":"A poor man and wise is better than an eld king and fool(ish), that cannot before-see into time to coming. (A poor person who is wise, is better than an old king who is foolish, and who cannot foresee into the time to come, or who will not listen to good advice.)"},{"num":14,"verse":"For sometime a man goeth out, both from prison and chains, to a realm (and becometh a king); and another, born into a realm, is wasted by neediness."},{"num":15,"verse":"I saw all men living that go under the sun, with the second young waxing man, that shall rise (up) for him. (I saw all the living who go under the sun, and yet for each, someone young shall rise up, and shall take their place.)"},{"num":16,"verse":"The number of people, of all that were before him, is great without measure, and they that shall come afterward, shall not be glad in him; but also this is vanity and torment of the spirit. (The number of all the people, who be under him, is great without measure, and yet they who shall come after, shall not be grateful to him; but this is also empty and futile, like chasing the wind.)"}]