[{"header":"The People of Israel Are Counted"},{"num":1,"verse":"The Lord spoke to Moses in the Meeting Tent. This was in the Desert of Sinai. It was on the first day of the second month. This was in the second year after the people of Israel left Egypt. The Lord said to Moses: "},{"num":2,"verse":"“Count all the people of Israel. List the name of each man with his family and family group. "},{"num":3,"verse":"You and Aaron must count all the men of Israel 20 years old or older. They will serve in the army of Israel. List them by their divisions. "},{"num":4,"verse":"One man from each tribe will help you. He is to be the leader of his family. "},{"num":5,"verse":"These are the names of the men who will help you:"},{"num":16,"verse":"All these men were chosen by the people to be leaders of their tribes. They were the leaders of their family groups."},{"num":17,"verse":"Moses and Aaron took these men who had been picked. "},{"num":18,"verse":"And Moses and Aaron called all the people of Israel together. This was the first day of the second month. Then the people were listed by their families and family groups. All the men who were 20 years old or older were listed by name. "},{"num":19,"verse":"Moses did exactly what the Lord had commanded. Moses listed the people while they were in the Desert of Sinai."},{"num":20,"verse":"The tribe of Reuben was counted. Reuben was the first son born to Israel. All the men 20 years old or older who were able to serve in the army were listed. They were each listed by name with their families and family groups. "},{"num":21,"verse":"The tribe of Reuben totaled 46,500 men."},{"num":22,"verse":"The tribe of Simeon was counted. All the men 20 years old or older who were able to serve in the army were listed. They were each listed by name with their families and family groups. "},{"num":23,"verse":"The tribe of Simeon totaled 59,300 men."},{"num":24,"verse":"The tribe of Gad was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":25,"verse":"The tribe of Gad totaled 45,650 men."},{"num":26,"verse":"The tribe of Judah was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":27,"verse":"The tribe of Judah totaled 74,600 men."},{"num":28,"verse":"The tribe of Issachar was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":29,"verse":"The tribe of Issachar totaled 54,400 men."},{"num":30,"verse":"The tribe of Zebulun was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":31,"verse":"The tribe of Zebulun totaled 57,400 men."},{"num":32,"verse":"The tribe of Ephraim was counted. (Ephraim was a son of Joseph.) All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":33,"verse":"The tribe of Ephraim totaled 40,500 men."},{"num":34,"verse":"The tribe of Manasseh was counted. (Manasseh was also a son of Joseph.) All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":35,"verse":"The tribe of Manasseh totaled 32,200 men."},{"num":36,"verse":"The tribe of Benjamin was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":37,"verse":"The tribe of Benjamin totaled 35,400 men."},{"num":38,"verse":"The tribe of Dan was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":39,"verse":"The tribe of Dan totaled 62,700 men."},{"num":40,"verse":"The tribe of Asher was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":41,"verse":"The tribe of Asher totaled 41,500 men."},{"num":42,"verse":"The tribe of Naphtali was counted. All the men 20 years old or older who were able to serve in the army were listed. They were listed by name with their families and family groups. "},{"num":43,"verse":"The tribe of Naphtali totaled 53,400 men."},{"num":44,"verse":"Moses, Aaron and the 12 leaders of Israel counted these men. There was 1 leader from each of the families. "},{"num":45,"verse":"Every man of Israel 20 years old or older who was able to serve in the army was counted. Each man was listed with his family. "},{"num":46,"verse":"The total number of men was 603,550."},{"num":47,"verse":"The families from the tribe of Levi were not listed with the others. "},{"num":48,"verse":"The Lord had told Moses: "},{"num":49,"verse":"“Do not count the tribe of Levi or include them with the other Israelites. "},{"num":50,"verse":"But make the Levites responsible for the Holy Tent of the Agreement. They must take care of it and everything that is with it. They must carry the Holy Tent and everything in it. They must take care of it and make their camp around it. "},{"num":51,"verse":"Any time the Holy Tent is moved, the Levites must take it down. Any time it is set up, the Levites must do it. If anyone else goes near the Holy Tent, he will be put to death. "},{"num":52,"verse":"The Israelites will make their camps in separate divisions, each man near his family flag. "},{"num":53,"verse":"But the Levites must make their camp around the Holy Tent of the Agreement. Then I will not be angry with the Israelites. The Levites will take care of the Holy Tent of the Agreement.”"},{"num":54,"verse":"So the Israelites did everything the Lord commanded Moses."}]