[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And David laid up these words.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Now, for the first time, David saw how widely travelled was a renown of which he in his humbleness of heart had thought so little, and at once a deadly fear took possession of him. The life he held so cheaply when in battle with the enemies of his country now, strange to say, in his deep degradation and poverty, became of real value to him, and he adopted the piteous and humiliating device of feigning madness, hoping thus to change the wondering admiration of the servants of Achish into pitying scorn. What David hoped took place, and he was driven out of Gath with ignominy; but there is no reason for supposing that had he maintained a quiet dignity of behaviour any evil would have happened to him. The Philistines, for those wild times, seem to have been a cultured people, and by no means devoid of generous instincts. Not one word, strangely enough, is reported to have been spoken about the great injury he had done to the Philistine nation when he slew Goliath. It has been suggested with considerable ingenuity that the great name of the dead champion, the hero of so many battle-fields, was never brought forward here, perhaps out of a natural indisposition to recall a grievous calamity, but more likely out of regard for Goliath’s family and friends. Singularly little is told us, in fact, about this renowned hero, whom tradition hints at as the great warrior in the decisive battle when the Ark was captured and the sons of Eli were slain. The Talmud has a curious comment on this strange silence—“Not half the praises of Goliath are related in Scripture; hence it follows that it is wrong to tell the praises of the wicked.”—Treatise ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Soteh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "fol. 42, Colossians 2.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 21:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 21:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "David laid up these words in his heart ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— It is probable he had been at first well received, but this discourse deeply affected him, and made him think himself not safe there. For, when he found that his fame was spread among them, as having slain such numbers of the Philistines, he concluded that they would be instigated to take revenge on him now they had him in their power. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And was sore afraid — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Lest either their revenge or policy should prompt them to kill him. Perhaps he was the more apprehensive, because he wore Goliath’s sword, which was, probably, well known at Gath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:10-15 God's persecuted people have often found better usage from Philistines than from Israelites. David had reason to put confidence in Achish, yet he began to be afraid. His conduct was degrading, and discovered wavering in his faith and courage. The more simply we depend on God, and obey him, the more comfortably and surely we shall walk through this troublesome world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The king of the land - The Philistines gave him the title which their own lords bore. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 21:10-15. At Gath He Feigns Himself Mad.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10. David … fled … to Achish the king of Gath—which was one of the five principalities of the Philistines. In this place his person must have been known, and to venture into that country, he their greatest enemy, and with the sword of Goliath in his hand, would seem to have been a perilous experiment; but, doubtless, the protection he received implies that he had been directed by the divine oracle. Achish was generous (1Sa 27:6). He might wish to weaken the resources of Saul, and it was common in ancient times for great men to be harbored by neighboring princes.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Lest either their revenge or policy should prompt them to kill him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And David laid up these words in his heart,.... Pondered upon them, and thought them over in his mind, finding that he was known, and his character also, and considered with himself what might be the consequence of this: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and was sore afraid of Achish the king of Gath; lest he should be set against him, and be prevailed upon by his servants to take away his life, or deliver him up into the hands of Saul. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and was sore afraid of Achish the king of Gath; lest he should be set against him, and be prevailed upon by his servants to take away his life, or deliver him up into the hands of Saul. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And David laid up these words in his heart, and was sore afraid of Achish the king of Gath.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But David took these words to heart, and was in great fear of Achish, lest he should treat him as an enemy, and kill him. In order to escape this danger, \"he disguised his understanding (i.e., pretended to be out of his mind) in their eyes (i.e., before the courtiers of Achish), behaved insanely under their hands (when they tried to hold him as a madman), scribbled upon the door-wings, and let his spittle run down into his beard.\" The suffix to וישׁנּו is apparently superfluous, as the object, את־טעמו, follows immediately afterwards. But it may be accounted for from the circumstantiality of the conversation of every-day life, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and (though these cases are not perfectly parallel) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 5:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. Gesenius' Gramm. 121, 6, Anm. 3). ויתו, from תּוה, to make signs, i.e., to scribble. The lxx and Vulgate render it ἐτυμπανίζειν, impingebat, he drummed, smote with his fists upon the wings of the door, which would make it appear as if they had read ויּתף (from תּפף), which seems more suitable to the condition of a madman whose saliva ran out of his mouth. ",
        "children": []
      }
    ]
  }
]