[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There is no common bread.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The condition of the priests in these days of Saul was evidently a pitiable one. The terrible massacre related in the next chapter seems not to have excited the wail of indignation and woe which such a wholesale murder of the priests of the living God should naturally have called out from the entire people. They were evidently held in little esteem, and their murder was regarded at the time, not as an awful act of sacrilege, but simply as an act of political vengeance—of punishment for what the king was pleased to style treason. Here the almost destitute condition of the ministers of the principal sanctuary of Israel appears from the quiet answer of the high priest to David, telling him they had positively no bread but the stale bread removed from before “the Presence” in the holy building.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This “hallowed bread,” or shewbread, five loaves of which David petitioned for, consisted of twelve loaves, one for each tribe, which were placed in the Tabernacle fresh every Sabbath Day. The law of Moses was that this bread, being most holy, could only be eaten by the priests in the holy place. It is probable that this regulation had been relaxed, and that the bread was now often being carried away and eaten in the homes of the ministering priests, and on urgent occasions, perhaps, was even given to the “laity,” as in this case, the proviso only being made that the consumers of the bread should be ceremonially pure. Our Saviour, in Matthew 12:3, especially uses this example, drawn from the Tabernacle’s honoured customs, to justify a violation of the letter of the law, when its strict observance would stand in the way of the fulfilment of man’s sacred duty to his neighbour.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This “hallowed bread,” or shewbread, five loaves of which David petitioned for, consisted of twelve loaves, one for each tribe, which were placed in the Tabernacle fresh every Sabbath Day. The law of Moses was that this bread, being most holy, could only be eaten by the priests in the holy place. It is probable that this regulation had been relaxed, and that the bread was now often being carried away and eaten in the homes of the ministering priests, and on urgent occasions, perhaps, was even given to the “laity,” as in this case, the proviso only being made that the consumers of the bread should be ceremonially pure. Our Saviour, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", especially uses this example, drawn from the Tabernacle’s honoured customs, to justify a violation of the letter of the law, when its strict observance would stand in the way of the fulfilment of man’s sacred duty to his neighbour.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The natural inference from this incident would be that such a violation of the Mosaic Law was not an uncommon occurrence, as Ahimelech at once gave him the hallowed bread, only making a conditional inquiry about ceremonial purity—a condition which came out so readily that we feel it had often been made before. The Talmud, however, is most anxious that this inference should not be drawn, and points out in the treatise Menachoth, “Meat-offerings” (Seder Kodashim), that this bread was not newly taken out of the sanctuary, but had been removed on some previous day, and that as, after a week’s exposure, it was stale and dry, the priests ate but little of it, and the rest was left. (See Treatise Yoma, 39.) It also points out that had such violation of the Levitical Law been common, so much importance would not have been attached to this incident.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The natural inference from this incident would be that such a violation of the Mosaic Law was not an uncommon occurrence, as Ahimelech at once gave him the hallowed bread, only making a conditional inquiry about ceremonial purity—a condition which came out so readily that we feel it had often been made before. The Talmud, however, is most anxious that this inference should not be drawn, and points out in the treatise ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Menachoth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "“Meat-offerings” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Seder Kodashim",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that this bread was not newly taken out of the sanctuary, but had been removed on some previous day, and that as, after a week’s exposure, it was stale and dry, the priests ate but little of it, and the rest was left. (See Treatise ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Yoma, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "39.) It also points out that had such violation of the Levitical Law been common, so much importance would not have been attached to this incident.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:1-9 David, in distress, fled to the tabernacle of God. It is great comfort in a day of trouble, that we have a God to go to, to whom we may open our cases, and from whom we may ask and expect direction. David told Ahimelech a gross untruth. What shall we say to this? The Scripture does not conceal it, and we dare not justify it; it was ill done, and proved of bad consequence; for it occasioned the death of the priests of the Lord. David thought upon it afterward with regret. David had great faith and courage, yet both failed him; he fell thus foully through fear and cowardice, and owing to the weakness of his faith. Had he trusted God aright, he would not have used such a sorry, sinful shift for his own preservation. It is written, not for us to do the like, no, not in the greatest straits, but for our warning. David asked of Ahimelech bread and a sword. Ahimelech supposed they might eat the shew-bread. The Son of David taught from it, that mercy is to be preferred to sacrifice; that ritual observances must give way to moral duties. Doeg set his foot as far within the tabernacle as David did. We little know with what hearts people come to the house of God, nor what use they will make of pretended devotion. If many come in simplicity of heart to serve their God, others come to observe their teachers and to prove accusers. Only God and the event can distinguish between a David and a Doeg, when both are in the tabernacle.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Common - As opposed to holy. (See the marginal references, and compare the use of the word in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 10:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 10:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) It gives an idea of the depressed and poor condition of the priesthood at that time, that Ahimelech should have had no bread at hand except the showbread. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. there is hallowed bread—There would be plenty of bread in his house; but there was no time to wait for it. \"The hallowed bread\" was the old shew-bread, which had been removed the previous day, and which was reserved for the use of the priests alone (Le 24:9). Before entertaining the idea that this bread could be lawfully given to David and his men, the high priest seems to have consulted the oracle (1Sa 22:10) as to the course to be followed in this emergency. A dispensation to use the hallowed bread was specially granted by God Himself.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Under mine hand, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, here in the tabernacle; though doubtless he had enough of that and of other provisions in his house; but David was in great haste, and in fear of Doeg, whom he saw and knew there, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 22:22",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 22:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and therefore would not stay till any thing could be fetched thence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hallowed bread; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the shew-bread, which was appropriated to the priests; of which see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 25:30 Leviticus 24:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 25:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 24:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "At least from women; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either from uncleanness by women, which might be divers ways contracted; or from conjugal converse with their wives; which though it did not defile them, yet he thought might debar them from the participation of such very sacred things; which he gathered by the analogy of that precept, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 19:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 19:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". There was a double impediment to the giving of this bread to them: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Its sacredness in itself; which the priest implies, and David answers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 21:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 21:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the priest was satisfied therein by David’s extraordinary occasions and great necessities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The purity and abstinence from all women, which he supposeth should be in those that use it; concerning which he now inquires. And though he mention this only concerning David’s young men, and out of modesty and reverence to David forbears to name him; yet he is also included in the number, as David’s answer shows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the priest answered David, and said, there is no common bread under mine hand,.... In the tabernacle, though he might have such in his own house; which was common for any man to eat of, even such as were not priests; but he had none there, and David was in haste to be gone because of Doeg, and could not stay till such was fetched: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but there is hallowed bread; such as was devoted to sacred use. Kimchi's father thinks this was the bread of the thank offering, to which Ben Gersom inclines; otherwise the Jewish writers in general understand it of the shewbread; and it is clear it was that from 1 Samuel 21:6 and from what our Lord says, Matthew 12:4. Now this the priest had under his hand, being just taken off of the shewbread table, and was the perquisite of the priests; and which, though it was not lawful for any but priests to eat of, yet in this case of necessity he seemed willing to give it to David and his men, on this condition: if the young men have kept themselves at least from women; from their wives or others, and from any pollution by them, in any way or manner; but as this was also only of a ceremonial kind, it might as well have been dispensed with, had this been the case, as the other. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but there is hallowed bread; such as was devoted to sacred use. Kimchi's father thinks this was the bread of the thank offering, to which Ben Gersom inclines; otherwise the Jewish writers in general understand it of the shewbread; and it is clear it was that from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 21:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and from what our Lord says, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Now this the priest had under his hand, being just taken off of the shewbread table, and was the perquisite of the priests; and which, though it was not lawful for any but priests to eat of, yet in this case of necessity he seemed willing to give it to David and his men, on this condition: if the young men have kept themselves at least from women; from their wives or others, and from any pollution by them, in any way or manner; but as this was also only of a ceremonial kind, it might as well have been dispensed with, had this been the case, as the other. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the priest answered David, and said, There is no common bread under mine hand, but there is hallowed bread; if the young men have kept themselves at least from {c} women.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the priest answered David, and said, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "There is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no common bread under mine hand, but there is hallowed bread; if the young men have kept themselves at least from ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " women.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) If they have not accompanied with their wives.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "common",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. profane or unholy, i.e. unconsecrated. Vulg. “laicos panes.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 21:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The priest answered that he had no common bread, but only holy bread, viz., according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", shew-bread that had been removed, which none but priests were allowed to eat, and that in a sacred place; but that he was willing to give him some of these loaves, as David had said that he was travelling upon an important mission from the king, provided only that \"the young men had kept themselves at least from women,\" i.e., had not been defiled by sexual intercourse (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 15:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If they were clean at any rate in this respect, he would in such a case of necessity depart from the Levitical law concerning the eating of the shew-bread, for the sake of observing the higher commandment of love to a neighbour (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:25-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: When Mark (Mark 2:26) assigns this action to the days of Abiathar the high priest, the statement rests upon an error of memory, in which Ahimelech is confounded with Abiathar.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: When Mark (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") assigns this action to the days of Abiathar the high priest, the statement rests upon an error of memory, in which Ahimelech is confounded with Abiathar.) ",
            "children": []
          }
        ]
      }
    ]
  }
]