[{"header":"People Will Turn from Their Faith"},{"num":4,"verse":"God’s Spirit clearly says that in the last days many people will turn from their faith. They will be fooled by evil spirits and by teachings that come from demons. "},{"num":2,"verse":"They will also be fooled by the false claims of liars whose consciences have lost all feeling. These liars "},{"num":3,"verse":"will forbid people to marry or to eat certain foods. But God created these foods to be eaten with thankful hearts by his followers who know the truth. "},{"num":4,"verse":"Everything God created is good. And if you give thanks, you may eat anything. "},{"num":5,"verse":"What God has said and your prayer will make it fit to eat."},{"header":"Paul’s Advice to Timothy"},{"num":6,"verse":"If you teach these things to other followers, you will be a good servant of Christ Jesus. You will show that you have grown up on the teachings about our faith and on the good instructions you have obeyed. "},{"num":7,"verse":"Don’t have anything to do with worthless, senseless stories. Work hard to be truly religious. "},{"num":8,"verse":"As the saying goes,"},{"num":10,"verse":"We have put our hope in the living God, who is the Savior of everyone, but especially of those who have faith. That’s why we work and struggle so hard."},{"num":11,"verse":"Teach these things and tell everyone to do what you say. "},{"num":12,"verse":"Don’t let anyone make fun of you, just because you are young. Set an example for other followers by what you say and do, as well as by your love, faith, and purity."},{"num":13,"verse":"Until I arrive, be sure to keep on reading the Scriptures in worship, and don’t stop preaching and teaching. "},{"num":14,"verse":"Use the gift you were given when the prophets spoke and the group of church leaders blessed you by placing their hands on you. "},{"num":15,"verse":"Remember these things and think about them, so everyone can see how well you are doing. "},{"num":16,"verse":"Be careful about the way you live and about what you teach. Keep on doing this, and you will save not only yourself, but the people who hear you."}]