[{"header":"False Teaching in the Last Days"},{"num":4,"verse":"The Holy Spirit tells us in plain words that in the last days some people will turn away from the faith. They will listen to what is said about spirits and follow the teaching about demons. "},{"num":2,"verse":"Those who teach this tell it as the truth when they know it is a lie. They do it so much that their own hearts no longer say it is wrong. "},{"num":3,"verse":"They will say, “Do not get married. Do not eat some kinds of food.” But God gave these things to Christians who know the truth. We are to thank God for them. "},{"num":4,"verse":"Everything God made is good. We should not put anything aside if we can take it and thank God for it. "},{"num":5,"verse":"It is made holy by the Word of God and prayer."},{"header":"Christians Are to Grow"},{"num":6,"verse":"If you keep telling these things to the Christians, you will be a good worker for Jesus Christ. You will feed your own soul on these words of faith and on this good teaching which you have followed. "},{"num":7,"verse":"Have nothing to do with foolish stories old women tell. Keep yourself growing in God-like living. "},{"num":8,"verse":"Growing strong in body is all right but growing in God-like living is more important. It will not only help you in this life now but in the next life also. "},{"num":9,"verse":"These words are true and they can be trusted. "},{"num":10,"verse":"Because of this, we work hard and do our best because our hope is in the living God, the One Who would save all men. He saves those who believe in Him."},{"header":"Paul’s Helpful Words to Young Timothy"},{"num":11,"verse":"Tell people that this is what they must do. "},{"num":12,"verse":"Let no one show little respect for you because you are young. Show other Christians how to live by your life. They should be able to follow you in the way you talk and in what you do. Show them how to live in faith and in love and in holy living. "},{"num":13,"verse":"Until I come, read and preach and teach the Word of God to the church. "},{"num":14,"verse":"Be sure to use the gift God gave you. The leaders saw this in you when they laid their hands on you and said what you should do. "},{"num":15,"verse":"Think about all this. Work at it so everyone may see you are growing as a Christian. "},{"num":16,"verse":"Watch yourself how you act and what you teach. Stay true to what is right. If you do, you and those who hear you will be saved from the punishment of sin."}]