[{"header":"Death of John the Baptist"},{"num":14,"verse":"At that time Herod the ruler heard the news about Jesus."},{"num":2,"verse":"He said to his servants, “This is John the Baptist. He’s been raised from the dead. This is why these miraculous powers are at work through him.”"},{"num":3,"verse":"Herod had arrested John, bound him, and put him in prison because of Herodias, the wife of Herod’s brother Philip."},{"num":4,"verse":"That’s because John told Herod, “It’s against the law for you to marry her.”"},{"num":5,"verse":"Although Herod wanted to kill him, he feared the crowd because they thought John was a prophet."},{"num":6,"verse":"But at Herod’s birthday party Herodias’ daughter danced in front of the guests and thrilled Herod."},{"num":7,"verse":"Then he swore to give her anything she asked."},{"num":8,"verse":"At her mother’s urging, the girl said, “Give me the head of John the Baptist here on a plate.”"},{"num":9,"verse":"Although the king was upset, because of his solemn pledge and his guests he commanded that they give it to her."},{"num":10,"verse":"Then he had John beheaded in prison."},{"num":11,"verse":"They brought his head on a plate and gave it to the young woman, and she brought it to her mother."},{"num":12,"verse":"But John’s disciples came and took his body and buried it. Then they went and told Jesus what had happened."},{"header":"Feeding the five thousand"},{"num":13,"verse":"When Jesus heard about John, he withdrew in a boat to a deserted place by himself. When the crowds learned this, they followed him on foot from the cities."},{"num":14,"verse":"When Jesus arrived and saw a large crowd, he had compassion for them and healed those who were sick."},{"num":15,"verse":"That evening his disciples came and said to him, “This is an isolated place and it’s getting late. Send the crowds away so they can go into the villages and buy food for themselves.”"},{"num":16,"verse":"But Jesus said to them, “There’s no need to send them away. You give them something to eat.”"},{"num":17,"verse":"They replied, “We have nothing here except five loaves of bread and two fish.”"},{"num":18,"verse":"He said, “Bring them here to me.”"},{"num":19,"verse":"He ordered the crowds to sit down on the grass. He took the five loaves of bread and the two fish, looked up to heaven, blessed them and broke the loaves apart and gave them to his disciples. Then the disciples gave them to the crowds."},{"num":20,"verse":"Everyone ate until they were full, and they filled twelve baskets with the leftovers."},{"num":21,"verse":"About five thousand men plus women and children had eaten."},{"header":"Walking on the water"},{"num":22,"verse":"Right then, Jesus made the disciples get into the boat and go ahead to the other side of the lake while he dismissed the crowds."},{"num":23,"verse":"When he sent them away, he went up onto a mountain by himself to pray. Evening came and he was alone."},{"num":24,"verse":"Meanwhile, the boat, fighting a strong headwind, was being battered by the waves and was already far away from land."},{"num":25,"verse":"Very early in the morning he came to his disciples, walking on the lake."},{"num":26,"verse":"When the disciples saw him walking on the lake, they were terrified and said, “It’s a ghost!” They were so frightened they screamed."},{"num":27,"verse":"Just then Jesus spoke to them, “Be encouraged! It’s me. Don’t be afraid.”"},{"num":28,"verse":"Peter replied, “Lord, if it’s you, order me to come to you on the water.”"},{"num":29,"verse":"And Jesus said, “Come.”"},{"num":30,"verse":"But when Peter saw the strong wind, he became frightened. As he began to sink, he shouted, “Lord, rescue me!”"},{"num":31,"verse":"Jesus immediately reached out and grabbed him, saying, “You man of weak faith! Why did you begin to have doubts?”"},{"num":32,"verse":"When they got into the boat, the wind settled down."},{"num":33,"verse":"Then those in the boat worshipped Jesus and said, “You must be God’s Son!”"},{"header":"Healing the sick"},{"num":34,"verse":"When they had crossed the lake, they landed at Gennesaret."},{"num":35,"verse":"When the people who lived in that place recognized him, they sent word throughout that whole region, and they brought to him everyone who was sick."},{"num":36,"verse":"Then they begged him that they might just touch the edge of his clothes. Everyone who touched him was cured."}]