[{"num":14,"verse":"Around that time, Herod, the regional governor, heard of the fame of Yeshua "},{"num":2,"verse":"and said to his attendants, “This must be Yochanan the Immerser. He has been raised from the dead; that is why these miraculous powers are at work in him.”"},{"num":3,"verse":"For Herod had arrested Yochanan, put him in chains and thrown him in prison because of Herodias, the wife of his brother Philip; "},{"num":4,"verse":"since Yochanan had told Herod, “It violates the Torah for you to have her as your wife.” "},{"num":5,"verse":"Herod had wanted to put Yochanan to death; but he was afraid of the people, in whose eyes Yochanan was a prophet. "},{"num":6,"verse":"However, at Herod’s birthday celebration, Herodias’ daughter danced before the company and pleased Herod so much "},{"num":7,"verse":"that he promised with an oath to give her whatever she asked. "},{"num":8,"verse":"Prompted by her mother, she said, “Give me here on a platter the head of Yochanan the Immerser.” "},{"num":9,"verse":"The king became deeply upset; but out of regard for the oaths he had sworn before his dinner guests, he ordered that her wish be granted, "},{"num":10,"verse":"and sent and had Yochanan beheaded in prison. "},{"num":11,"verse":"The head was brought on a platter to the girl, and she gave it to her mother. "},{"num":12,"verse":"Yochanan’s talmidim came, took the body and buried it; then they went and told Yeshua."},{"num":13,"verse":"On hearing about this, Yeshua left in a boat to be by himself in the wilderness. But the people learned of it and followed him from the towns by land. "},{"num":14,"verse":"So when he came ashore, he saw a huge crowd; and, filled with compassion for them, he healed those of them who were sick."},{"num":15,"verse":"As evening approached, the talmidim came to him and said, “This is a remote place and it’s getting late. Send the crowds away, so that they can go and buy food for themselves in the villages.” "},{"num":16,"verse":"But Yeshua replied, “They don’t need to go away. Give them something to eat, yourselves!” "},{"num":17,"verse":"“All we have with us,” they said, “is five loaves of bread and two fish.” "},{"num":18,"verse":"He said, “Bring them here to me.” "},{"num":19,"verse":"After instructing the crowds to sit down on the grass, he took the five loaves and the two fish and, looking up toward heaven, made a b’rakhah. Then he broke the loaves and gave them to the talmidim, who gave them to the crowds. "},{"num":20,"verse":"They all ate as much as they wanted, and they took up twelve baskets full of the pieces left over. "},{"num":21,"verse":"Those eating numbered about five thousand men, plus women and children."},{"num":22,"verse":"Immediately he had the talmidim get in the boat and go on ahead of him to the other side, while he sent the crowds away. "},{"num":23,"verse":"After he had sent the crowds away, he went up into the hills by himself to pray. Night came on, and he was there alone. "},{"num":24,"verse":"But by this time, the boat was several miles from shore, battling a rough sea and a headwind. "},{"num":25,"verse":"Around four o’clock in the morning, he came toward them, walking on the lake! "},{"num":26,"verse":"When the talmidim saw him walking on the lake, they were terrified. “It’s a ghost!” they said and screamed with fear. "},{"num":27,"verse":"But at once Yeshua spoke to them. “Courage,” he said, “it is I. Stop being afraid.” "},{"num":28,"verse":"Then Kefa called to him, “Lord, if it is really you, tell me to come to you on the water.” "},{"num":29,"verse":"“Come!” he said. So Kefa got out of the boat and walked on the water toward Yeshua. "},{"num":30,"verse":"But when he saw the wind, he became afraid; and as he began to sink, he yelled, “Lord! Save me!” "},{"num":31,"verse":"Yeshua immediately stretched out his hand, took hold of him, and said to him, “Such little trust! Why did you doubt?” "},{"num":32,"verse":"As they went up into the boat, the wind ceased. "},{"num":33,"verse":"The men in the boat fell down before him and exclaimed, “You really are God’s son!”"},{"num":34,"verse":"Having made the crossing, they landed at Ginosar. "},{"num":35,"verse":"When the people of the place recognized him, they sent word throughout the neighborhood and brought him everyone who was ill. "},{"num":36,"verse":"They begged him that the sick people might only touch the tzitzit on his robe, and all who touched it were completely healed."}]