[{"num":14,"verse":"About en that ekeinos · ho time kairos Herod hērōdēs the ho tetrarch tetraarchēs heard akouō the ho report akoē about  Jesus Iēsous. "},{"num":2,"verse":"And kai he  said legō to ho his autos servants pais, “ This houtos is eimi John Iōannēs the ho Baptist baptistēs;  he autos has  risen egeirō from apo the ho dead nekros;  and kai that  is  why dia · ho miraculous dynamis powers  are  at  work energeō in en him autos.” "},{"num":3,"verse":"· ho For gar Herod hērōdēs had  arrested krateō · ho John Iōannēs,  bound deō him autos,  and kai put  him apotithēmi in en prison phylakē because dia of  Herodias hērōidias,  the ho wife gynē of ho his autos brother adelphos Philip Philippos; "},{"num":4,"verse":"because gar John Iōannēs had  been  telling legō · ho him autos, “It is  not ou lawful  for  you sy to  have echō her autos.” "},{"num":5,"verse":"And kai though  Herod  wanted thelō to  put  him autos to  death apokteinō,  he  feared phobeomai the ho people ochlos because hoti they  considered echō him autos to  be hōs a  prophet prophētēs. "},{"num":6,"verse":"But de when  Herod’ s hērōdēs birthday genesia came ginomai,  · ho the ho daughter thugatēr of ho Herodias hērōidias danced orcheomai before en · ho them mesos and kai pleased areskō · ho Herod hērōdēs. "},{"num":7,"verse":"So hothen he  promised homologeō with meta an  oath horkos to  give didōmi her autos whatever hos ean she  asked aiteō. "},{"num":8,"verse":"· ho · de Prompted probibazō by hypo · ho her autos mother mētēr,  she  said phēmi, “ Give didōmi me egō the ho head kephalē of  John Iōannēs the ho Baptist baptistēs here hōde on epi a  platter pinax.” "},{"num":9,"verse":"And kai although  the ho king basileus was  distressed lypeō,  because dia of  his ho oaths horkos and kai his ho dinner synanakeimai guests ,  he  commanded keleuō it  to  be  given didōmi to her. "},{"num":10,"verse":"So kai he  sent pempō and  had  John Iōannēs beheaded apokephalizō · ho in en the ho prison phylakē. "},{"num":11,"verse":"And kai his autos head kephalē was  brought pherō · ho on epi a  platter pinax and kai given didōmi to  the ho girl korasion,  and kai she  brought pherō it  to ho her autos mother mētēr. "},{"num":12,"verse":"· kai John’ s autos disciples mathētēs came proserchomai · ho and  took airō the ho corpse ptōma and kai buried thaptō it autos;  then kai they  went erchomai and  told apangellō · ho Jesus Iēsous. "},{"num":13,"verse":"Now de when  Jesus Iēsous heard akouō about  · ho John,  he  left anachōreō there ekeithen by en boat ploion to eis a  deserted erēmos place topos to be  alone kata idios;  but kai when  the ho crowds ochlos heard akouō about  it,  they  followed akoloutheō him autos on  foot pezē from apo the ho towns polis. "},{"num":14,"verse":"And kai when  he  came exerchomai ashore , he saw a  great polys crowd ochlos;  and kai he  had  compassion splanchnizomai on epi them autos and kai healed therapeuō · ho their autos sick arrōstos. "},{"num":15,"verse":"When  evening opsia · de came ginomai,  the ho disciples mathētēs approached proserchomai him autos,  saying legō, “ This  is eimi a  deserted erēmos place topos · ho and kai the ho hour hōra is  now ēdē late parerchomai;  send apolyō the ho crowds ochlos away  so hina they  can  go aperchomai into eis the ho villages kōmē and  buy agorazō food brōma for  themselves heautou.” "},{"num":16,"verse":"· ho But de Jesus Iēsous said legō to  them autos, “ They  have echō no ou need chreia to  go aperchomai away ;  you hymeis give didōmi them autos something  to  eat esthiō.” "},{"num":17,"verse":"And de they ho said legō to  him autos, “ We  have echō nothing ou here hōde but ei mē five pente loaves artos and kai two dyo fish ichthus.” "},{"num":18,"verse":"And de he ho said legō, “ Bring pherō them autos here hōde to  me egō.” "},{"num":19,"verse":"Then kai he  ordered keleuō the ho crowds ochlos to  sit anaklinō down  on epi the ho grass chortos, and  taking lambanō the ho five pente loaves artos and kai the ho two dyo fish ichthus, he  looked anablepō up  to eis · ho heaven ouranos,  said eulogeō a  blessing ,  and kai broke klaō the loaves.  He  gave didōmi the ho loaves artos to  the ho disciples mathētēs,  and de the ho disciples mathētēs gave them  to  the ho crowds ochlos. "},{"num":20,"verse":"And kai they  all pas ate esthiō and kai were  filled chortazō;  and kai they  picked airō up  what ho remained perisseuō of  the ho broken klasma pieces ,  twelve dōdeka baskets kophinos full plērēs. "},{"num":21,"verse":"Not  counting chōris women gynē and kai children paidion,  there ho · de were eimi about hōsei five  thousand pentakischilioi men anēr who  had  eaten esthiō. "},{"num":22,"verse":"· kai Immediately eutheōs Jesus  made anankazō his ho disciples mathētēs get embainō into eis the ho boat ploion and kai go proagō on  ahead  of  him autos to eis the ho opposite peran shore ,  until heōs hos he  had  dismissed apolyō the ho crowds ochlos. "},{"num":23,"verse":"And kai after  sending apolyō the ho crowds ochlos away ,  he  went anabainō up  on eis the ho mountainside oros by kata himself idios to  pray proseuchomai;  and de when  evening opsia came ginomai,  he  was eimi there ekei alone monos. "},{"num":24,"verse":"Meanwhile de the ho boat ploion,  already ēdē far stadion polys from apo · ho land gē,  was  being apechō tossed basanizō by hypo the ho waves kyma,  for gar the ho wind anemos was eimi against enantios it. "},{"num":25,"verse":"And de in  the  fourth tetartos watch phylakē of  the ho night nyx he  came erchomai to pros them autos,  walking peripateō on epi the ho sea thalassa. "},{"num":26,"verse":"When  the ho · de disciples mathētēs saw  him autos walking peripateō on epi the ho sea thalassa,  they  were  frightened tarassō and  said legō, “ It  is eimi a  ghost phantasma!”  And kai they  cried  out krazō in apo · ho fear phobos. "},{"num":27,"verse":"But de right away  Jesus Iēsous spoke laleō · ho to  them autos,  saying legō, “ Take tharseō courage ,  it  is eimi I egō!  Do  not mē be  afraid phobeomai.” "},{"num":28,"verse":"And de Peter Petros answered apokrinomai him autos,  · ho saying legō, “ Lord kyrios,  if ei it  is eimi you sy,  tell keleuō me egō to  come erchomai to pros you sy on epi the ho water hydōr.” "},{"num":29,"verse":"And de he ho said legō, “ Come erchomai!”  So kai Peter Petros got katabainō out  of apo the ho boat ploion,  · ho stepped peripateō out  on epi the ho water hydōr and kai headed erchomai toward pros · ho Jesus Iēsous. "},{"num":30,"verse":"But de when  he  realized blepō that  the ho wind anemos was  blustery ischuros,  he  became  afraid phobeomai;  and kai starting archō to  sink katapontizō,  he  cried krazō out , “ Lord kyrios,  save sōzō me egō!” "},{"num":31,"verse":"And de immediately eutheōs · ho Jesus Iēsous reached ekteinō out  his ho hand cheir,  took epilambanomai hold  of  him autos,  and kai said legō to  him autos, “O  you  of  little  faith oligopistos,  why eis tis did  you  doubt distazō?” "},{"num":32,"verse":"And kai when  they autos got anabainō into eis the ho boat ploion,  the ho wind anemos died kopazō down . "},{"num":33,"verse":"And de those ho in en the ho boat ploion worshiped proskyneō him autos,  saying legō, “ Truly alēthōs you  are eimi the  Son hyios of  God theos.” "},{"num":34,"verse":"And kai when  they  had  crossed diaperaō over ,  they  came erchomai to epi · ho land gē at eis Gennesaret Gennēsaret. "},{"num":35,"verse":"· kai When  the ho men anēr of ho that ekeinos place topos recognized epiginōskō him autos,  they  sent apostellō word  into eis all holos · ho that ekeinos surrounding perichōros area  and kai brought prospherō to  him autos all pas who ho were echō sick kakōs. "},{"num":36,"verse":"And kai they  begged parakaleō him autos that hina they  might  just monon touch haptō the ho fringe kraspedon of ho his autos cloak himation;  and kai as hosos many  as  touched haptō it  were  healed diasōzō. "}]