[{"num":14,"verse":"At that time reports about Rebbe, Melech HaMoshiach came to the oznayim (ears) of Herod the Tetrarch."},{"num":2,"verse":"And he said to his servants, This one is Yochanan of the tevilah of teshuva. He has had his Techiyah (Resurrection) from HaMesim (the Dead) and for this reason the moftim (wonders) are working in him."},{"num":3,"verse":"For Herod had Yochanan arrested and bound him and threw him into the beit hasohar (prison), on account of Herodias, the wife of his brother Philip."},{"num":4,"verse":"For Yochanan kept on saying to him, It is asur for you to have her."},{"num":5,"verse":"And [although] Herod was desiring to kill Yochanan, he feared the crowd, because they considered Yochanan a Navi."},{"num":6,"verse":"Now at the yom huledet celebration of Herod, it came about that the daughter of Herodias danced before them and Herod was pleased."},{"num":7,"verse":"Herod, therefore, with a shevuah, promised to give to her whatever she might ask."},{"num":8,"verse":"So she, prompted by her mother, said, Give to me here upon a serving tray the rosh (head) Yochanan of the tevilah of teshuva."},{"num":9,"verse":"And, although grieving, the king commanded [it] to be given, on account of the shevuot (oaths) and the fellow muzmanim (guests)"},{"num":10,"verse":"And he sent and had Yochanan beheaded in the beit hasohar."},{"num":11,"verse":"And the rosh Yochanan of the tevilah of teshuva was brought upon a serving tray, and it was presented to the girl and she presented it to her mother."},{"num":12,"verse":"And Yochanan’s talmidim approached and carried away the niftar (deceased person) and buried him. Then they went and reported [it] to Rebbe, Melech HaMoshiach."},{"num":13,"verse":"And when he heard [this], he withdrew from there in a sirah (boat) to a desolate place by himself. And when the multitudes heard [this], they followed Rebbe, Melech HaMoshiach by land from the shtetlach."},{"num":14,"verse":"And having gone out, Rebbe, Melech HaMoshiach saw a great multitude, and Rebbe, Melech HaMoshiach felt rachmei shomayim (heavenly compassion) for them and brought refuah (healing) to their cholim."},{"num":15,"verse":"Now when erev (evening) came, Moshiach’s talmidim came to him, saying, This place is desolate and the time is late. Dismiss the multitude, so that, having gone into the shtetlach, they may buy for themselves okhel (food)."},{"num":16,"verse":"But Rebbe, Melech HaMoshiach said to them, They have no need to go away. You yourselves give them something to eat."},{"num":17,"verse":"But Moshiach’s talmidim say to him, We do not have here anything except five loaves and of dagim (fish), only two."},{"num":18,"verse":"But Rebbe, Melech HaMoshiach said, Bring them here to me."},{"num":19,"verse":"And having commanded the multitudes to recline on the grass [as at tish] and having taken the five loaves and the two dagim, and having looked up to Shomayim, Rebbe, Melech HaMoshiach said a bracha over the okhel, and having offered the betziat halechem (the breaking of the bread), Rebbe, Melech HaMoshiach gave the lechem to the talmidim, and Moshiach’s talmidim served the lechem to the multitudes"},{"num":20,"verse":"And everyone ate and they were satisfied, and they took away shirayim (Rebbe’s remainders, leftovers), shneym asar (twelve) baskets full."},{"num":21,"verse":"And the ones eating were about chamesh elafim (five thousand) men, apart from the nashim and yeladim."},{"num":22,"verse":"And immediately Rebbe, Melech HaMoshiach compelled the talmidim to board a sirah (boat) and to go on ahead of him to the other side until he might send away the multitudes."},{"num":23,"verse":"And having sent away the multitudes, Rebbe, Melech HaMoshiach went up to the mountain by himself to daven. Now when erev had come, he was alone there."},{"num":24,"verse":"Now the sirah (boat), being tossed by the waves (for the wind was against them), was by this time many stadia distant from the land."},{"num":25,"verse":"Now in the fourth watch of the night (between three o’oclock and six o’clock in the morning), Rebbe, Melech HaMoshiach came to them, walking on the lake."},{"num":26,"verse":"But Moshiach’s talmidim, having seen him walking on the lake, were terribly shaken, saying, It is a ruach refaim (an apparition)! From pachad they cried out."},{"num":27,"verse":"And immediately Rebbe, Melech HaMoshiach spoke to them, saying, Chazak! Ani Hu. (I am he, SHEMOT 3:14) Do not be afraid."},{"num":28,"verse":"And Kefa said in reply to Rebbe, Melech HaMoshiach, Adoni, if it is really you, command me to come to you al pnei hamayim (on the surface of the waters)."},{"num":29,"verse":"And Rebbe, Melech HaMoshiach said, Boh! (Come!) And having gone down from the sirah (boat), Kefa walked al pnei hamayim (on the surface of the waters) and came toward him."},{"num":30,"verse":"And seeing the strong wind, Kefa was afraid, and having begun to sink, Kefa cried out, saying, Azreini! Adoni, hoshieini! (Help! L-rd, save me!)"},{"num":31,"verse":"And immediately Rebbe, Melech HaMoshiach, having stretched out (his) hand, took hold of Kefa and says to him, One of little emunah, why did you doubt?"},{"num":32,"verse":"And as they were going up into the sirah (boat), the wind became still."},{"num":33,"verse":"And the ones in the sirah (boat) fell down before Rebbe, Melech HaMoshiach, saying, Beemes (Actually) you are the Ben HaElohim!"},{"num":34,"verse":"And having crossed over, they came onto the land at Gennesaret."},{"num":35,"verse":"And having recognized him, the men of that place sent into all the surrounding region around, and they brought to Rebbe, Melech HaMoshiach all the cholim,"},{"num":36,"verse":"and they were appealing to him that they might touch even the Moshiach’s tzitzit on his garment, and all who did, received Moshiach’s refuah (healing). [YESHAYAH 53:5]"}]