[{"header":"Herod’s guilty conscience"},{"num":1,"verse":"“About this time Herod, governor of the province, heard the reports about Jesus and said to his men, “This must be John the Baptist: he has risen from the dead. That is why miraculous powers are at work in him.”"},{"num":3,"verse":"For previously Herod had arrested John and had him bound and put in prison, all on account of Herodias, the wife of his brother Philip. For John had said to him, “It is not right for you to have this woman.” Herod wanted to kill him for this, but he was afraid of the people, since they all thought John was a prophet. But during Herod’s birthday celebrations Herodias’ daughter delighted him by dancing before his guests, so much so that he swore to give her anything she liked to ask. And she, prompted by her mother, said, “I want you to give me, here and now, on a dish, the head of John the Baptist!” Herod was aghast at this, but because he had sworn in front of his guests, he gave orders that she should be given what she had asked. So he sent men and had John beheaded in the prison. Then his head was carried in on a dish and presented to the young girl who handed it to her mother."},{"num":12,"verse":"Later John’s disciples came, took his body and buried it. Then they went and told the news to Jesus.”"},{"num":13,"verse":"When he heard it he went away by boat to a deserted place, quite alone."},{"header":"Jesus feeds a tired and hungry crowd"},{"num":13,"verse":"Then the crowds heard of his departure and followed him out of the towns on foot. When Jesus emerged from his retreat he saw a vast crowd and was very deeply moved and cured the sick among them. As evening fell his disciples came to him and said, “We are right in the wilds here and it is very late. Send away these crowds now, so that they can go into the villages and buy themselves food.”"},{"num":16,"verse":"“There’s no need for them to go away,” returned Jesus. “You give them something to eat!”"},{"num":17,"verse":"“But we haven’t anything here,” they told him, “except five loaves and two fish.”"},{"num":18,"verse":"To which Jesus replied, “Bring them here to me.”"},{"num":19,"verse":"He told the crowd to sit down on the grass. Then he took the five loaves and the two fish in his hands, and, looking up to Heaven, he thanked God, broke the loaves and passed them to his disciples who handed them to the crowd. Everybody ate and was satisfied. Afterwards they collected twelve baskets full of the pieces which were left over. Those who ate numbered about five thousand men, apart from the women and children."},{"header":"Jesus again shows his power over the forces of nature"},{"num":22,"verse":"Directly after this Jesus insisted on his disciples’ getting aboard their boat and going on ahead to the other side, while he himself sent the crowds home. And when he had sent them away he went up the hill-side quite alone, to pray. When it grew late he was there by himself while the boat was by now a long way from the shore at the mercy of the waves, for the wind was dead against them. In the small hours Jesus went out to them, walking on the water of the lake. When the disciples caught sight of him walking on the water they were terrified. “It’s a ghost!” they said, and screamed with fear. But at once Jesus spoke to them. “It’s all right! It’s I myself, don’t be afraid!”"},{"num":28,"verse":"“Lord, if it’s really you,” said Peter, “tell me to come to you on the water.”"},{"num":29,"verse":"“Come on, then,” replied Jesus."},{"num":29,"verse":"Peter stepped down from the boat and did walk on the water, making for Jesus. But when he saw the fury of the wind he panicked and began to sink, calling out, “Lord save me!” At once Jesus reached out his hand and caught him, saying, “You little-faith! What made you lose your nerve like that?” Then, when they were both aboard the boat, the wind dropped. The whole crew came and knelt down before Jesus, crying, “You are indeed the Son of God!”"},{"num":34,"verse":"When they had crossed over to the other side of the lake, they landed at Gennesaret, and when the men of that place had recognised him, they sent word to the whole surrounding country and brought all the diseased to him. They implored him to let them “touch just the edge of his cloak”, and all those who did so were cured."}]