[{"num":14,"verse":"At that time, Herod the Tetrarch heard of the fame of Jesus,"},{"num":2,"verse":"and said to his servants, “This is that John Baptist! He has risen again from the dead! And therefore, great works are done by him!”"},{"num":3,"verse":"For Herod had taken John and bound him, and put him in prison because of Herodias, his brother Philip’s wife."},{"num":4,"verse":"For John said to him, “It is not lawful for you to have her.”"},{"num":5,"verse":"And when he would have put him to death, he feared the multitude, because they counted him as a Prophet."},{"num":6,"verse":"But when Herod’s birthday came, the daughter of Herodias danced before them, and pleased Herod."},{"num":7,"verse":"Therefore, he promised with an oath that he would give her whatever she would ask."},{"num":8,"verse":"And she (having already been instructed by her mother) said, “Give me John Baptist’s head here, on a platter.”"},{"num":9,"verse":"And the king was sorry. Nevertheless, because of the oath, and those who sat with him at the table, he commanded it to be given to her;"},{"num":10,"verse":"and sent, and beheaded John in the prison."},{"num":11,"verse":"And his head was brought, on a platter, and given to the maid. And she brought it to her mother."},{"num":12,"verse":"And his disciples came and took up the body, and buried it, and went and told Jesus."},{"num":13,"verse":"And when Jesus heard it, He departed from there by ship into a desert place, alone. And when the multitude had heard it, they followed Him out of the cities on foot."},{"num":14,"verse":"And Jesus went forth and saw a great multitude and was moved with compassion toward them. And He healed their sick."},{"num":15,"verse":"And when evening had come, His disciples came to Him, saying, “This is a desert place. And the time is already late. Dismiss the multitude, so that they may go into the towns and buy food."},{"num":16,"verse":"But Jesus said to them, “They have no need to go away. You give them something to eat.”"},{"num":17,"verse":"Then said they to Him, “We have here only five loaves, and two fishes.”"},{"num":18,"verse":"And He said, “Bring them here to Me.”"},{"num":19,"verse":"And He commanded the multitude to sit down on the grass, and took the five loaves, and the two fishes, and looked up to Heaven, and blessed and broke, and gave the loaves to His disciples. And the disciples gave them to the multitude."},{"num":20,"verse":"And they all ate and were satisfied. And they took up twelve baskets full of the fragments that remained."},{"num":21,"verse":"And those who had eaten (besides women and little children) were about five thousand men."},{"num":22,"verse":"And immediately Jesus compelled His disciples to enter into a ship. And to go over ahead of Him, while He sent away the multitude."},{"num":23,"verse":"And as soon as He had sent the multitude away, He went up into a mountain alone, to pray. And when the evening had come, He was there alone."},{"num":24,"verse":"And the ship was now in the midst of the sea and was tossed with the waves. For it was a contrary wind."},{"num":25,"verse":"And in the fourth watch of the night, Jesus went to them, walking on the sea."},{"num":26,"verse":"And when His disciples saw Him walking on the sea, they were troubled, saying, “It is a spirit!” And they cried out for fear."},{"num":27,"verse":"But immediately, Jesus spoke to them, saying, “Be of good comfort! It is I! Do not be afraid!”"},{"num":28,"verse":"Then Peter answered Him, and said, “Master, if it is You, ask me to come to You on the water!”"},{"num":29,"verse":"And He said, “Come!” And when Peter had come down out of the ship, he walked on the water to go to Jesus."},{"num":30,"verse":"But when he saw the mighty wind, he was afraid. And as he began to sink, he cried, saying, “Master! Save me!”"},{"num":31,"verse":"So immediately, Jesus stretched forth His hand, and caught him, and said to him, “O you of little faith. Why did you doubt?"},{"num":32,"verse":"And as soon as they had come up into the ship, the wind ceased."},{"num":33,"verse":"Then those who were in the ship, came and worshipped Him, saying, “Truly, You are the Son of God!”"},{"num":34,"verse":"And when they had come over, they came into the land of Gennesaret."},{"num":35,"verse":"And when the men of that place knew Him, they sent word out around all that country, and brought to Him all who were sick;"},{"num":36,"verse":"and begged Him, that they might touch merely the hem of His garment. And as many as touched it were made whole."}]