[[],[{"type":"prose","content":"At that time did Herod the tetrarch hear the fame of Jesus,"}],[{"type":"prose","content":"and said to his servants, `This is John the Baptist, he did rise from the dead, and because of this the mighty energies are working in him.'"}],[{"type":"prose","content":"For Herod having laid hold on John, did bind him, and did put him in prison, because of Herodias his brother Philip's wife,"}],[{"type":"prose","content":"for John was saying to him, `It is not lawful to thee to have her,'"}],[{"type":"prose","content":"and, willing to kill him, he feared the multitude, because as a prophet they were holding him."}],[{"type":"prose","content":"But the birthday of Herod being kept, the daughter of Herodias danced in the midst, and did please Herod,"}],[{"type":"prose","content":"whereupon with an oath he professed to give her whatever she might ask."}],[{"type":"prose","content":"And she having been instigated by her mother -- `Give me (says she) here upon a plate the head of John the Baptist;"}],[{"type":"prose","content":"and the king was grieved, but because of the oaths and of those reclining with him, he commanded [it] to be given;"}],[{"type":"prose","content":"and having sent, he beheaded John in the prison,"}],[{"type":"prose","content":"and his head was brought upon a plate, and was given to the damsel, and she brought [it] nigh to her mother."}],[{"type":"prose","content":"And his disciples having come, took up the body, and buried it, and having come, they told Jesus,"}],[{"type":"prose","content":"and Jesus having heard, withdrew thence in a boat to a desolate place by himself, and the multitudes having heard did follow him on land from the cities."}],[{"type":"prose","content":"And Jesus having come forth, saw a great multitude, and was moved with compassion upon them, and did heal their infirm;"}],[{"type":"prose","content":"and evening having come, his disciples came to him, saying, `The place is desolate, and the hour hath now past, let away the multitudes that, having gone to the villages, they may buy to themselves food.'"}],[{"type":"prose","content":"And Jesus said to them, `They have no need to go away -- give ye them to eat.'"}],[{"type":"prose","content":"And they say to him, `We have not here except five loaves, and two fishes.'"}],[{"type":"prose","content":"And he said, `Bring ye them to me hither.'"}],[{"type":"prose","content":"And having commanded the multitudes to recline upon the grass, and having taken the five loaves and the two fishes, having looked up to the heaven, he did bless, and having broken, he gave the loaves to the disciples, and the disciples to the multitudes,"}],[{"type":"prose","content":"and they did all eat, and were filled, and they took up what was over of the broken pieces twelve hand-baskets full;"}],[{"type":"prose","content":"and those eating were about five thousand men, apart from women and children."}],[{"type":"prose","content":"And immediately Jesus constrained his disciples to go into the boat, and to go before him to the other side, till he might let away the multitudes;"}],[{"type":"prose","content":"and having let away the multitudes, he went up to the mountain by himself to pray, and evening having come, he was there alone,"}],[{"type":"prose","content":"and the boat was now in the midst of the sea, distressed by the waves, for the wind was contrary."}],[{"type":"prose","content":"And in the fourth watch of the night Jesus went away to them, walking upon the sea,"}],[{"type":"prose","content":"and the disciples having seen him walking upon the sea, were troubled saying -- `It is an apparition,' and from the fear they cried out;"}],[{"type":"prose","content":"and immediately Jesus spake to them, saying, `Be of good courage, I am [he], be not afraid.'"}],[{"type":"prose","content":"And Peter answering him said, `Sir, if it is thou, bid me come to thee upon the waters;'"}],[{"type":"prose","content":"and he said, `Come;' and having gone down from the boat, Peter walked upon the waters to come unto Jesus,"}],[{"type":"prose","content":"but seeing the wind vehement, he was afraid, and having begun to sink, he cried out, saying, `Sir, save me.'"}],[{"type":"prose","content":"And immediately Jesus, having stretched forth the hand, laid hold of him, and saith to him, `Little faith! for what didst thou waver?'"}],[{"type":"prose","content":"and they having gone to the boat the wind lulled,"}],[{"type":"prose","content":"and those in the boat having come, did bow to him, saying, `Truly -- God's Son art thou.'"}],[{"type":"prose","content":"And having passed over, they came to the land of Gennesaret,"}],[{"type":"prose","content":"and having recognized him, the men of that place sent forth to all that region round about, and they brought to him all who were ill,"}],[{"type":"prose","content":"and were calling on him that they might only touch the fringe of his garment, and as many as did touch were saved."}]]