[{"num":23,"verse":"¶ The burden of Tyre. Howl, ye ships of Tarshish, for it is laid waste, so that there is no house, no entering in; from the land of Chittim it is revealed to them."},{"num":2,"verse":"Be still, ye inhabitants of the isle; thou mart of Zidon, that by passing over the sea thou wert replenished."},{"num":3,"verse":"Her provision was from the plantings that grow with the many waters of the Nile, of the harvest of the river. She was also the mart of the Gentiles."},{"num":4,"verse":"Be thou ashamed, O Zidon, for the sea has spoken, even the strength of the sea, saying, I have never travailed nor brought forth children, neither did I nourish up young men nor bring up virgins."},{"num":5,"verse":"When the report comes unto Egypt, they shall be sorely pained at the news from Tyre."},{"num":6,"verse":"Pass ye over to Tarshish; howl, ye inhabitants of the isle."},{"num":7,"verse":"Is this your joyous city, whose antiquity is of ancient days? Her own feet shall carry her afar off to sojourn."},{"num":8,"verse":"Who has decreed this against Tyre, the crowning city, whose merchants were princes, whose traders were the honourable of the earth?"},{"num":9,"verse":"The LORD of the hosts has purposed it to stain the pride of all glory and to bring down all those who are exalted in the earth."},{"num":10,"verse":"Pass by as a river from thy land, O daughter of Tarshish; for thou shalt have no more strength."},{"num":11,"verse":"He stretched out his hand over the sea; he shook the kingdoms; the LORD commanded upon Canaan that her strength should be weakened."},{"num":12,"verse":"And he said, Thou shalt no more rejoice, O thou oppressed virgin, daughter of Zidon; arise, pass over to Chittim, and even there thou shalt have no rest."},{"num":13,"verse":"Behold the land of the Chaldeans. This people was not until the Assyrian founded it for those that dwell in the wilderness; they set up its towers; they raised up its palaces, and he brought it to ruin."},{"num":14,"verse":"Howl, ye ships of Tarshish, for your strength is laid waste."},{"num":15,"verse":"¶ And it shall come to pass in that day that Tyre shall be forgotten seventy years according to the days of one king; after the end of seventy years Tyre shall sing as a harlot."},{"num":16,"verse":"Take a harp, go about the city, thou harlot that hast been forgotten; make sweet melody, sing the song again that thou may be remembered."},{"num":17,"verse":"And it shall come to pass after the end of seventy years, that the LORD will visit Tyre, and she shall turn to her hire and shall commit fornication again with all the kingdoms of the world upon the face of the earth."},{"num":18,"verse":"But her profit and her hire shall be consecrated unto the LORD: it shall not be treasured nor laid up for her profit shall be for those that dwell before the LORD, to eat until they are filled and to dress honourably."}]