[{"header":"Bread and Quail"},{"num":16,"verse":"Then they set out from Elim, and all the congregation of the children of Israel came to the Wilderness of Sin, which is between Elim and Sinai, on the fifteenth day of the second month after their departing out of the land of Egypt. "},{"num":2,"verse":"The whole congregation of the children of Israel murmured against Moses and Aaron in the wilderness. "},{"num":3,"verse":"Now the children of Israel said to them, “Would to God we had died by the hand of the Lord in the land of Egypt, when we sat by the pots of meat, when we ate bread to the full, for you have brought us forth into this wilderness to kill this whole assembly with hunger.”"},{"num":4,"verse":"Then the Lord said to Moses, “Indeed, I will rain bread from heaven for you. And the people shall go out and gather a certain amount every day, that I may test them, whether they will walk in My law or not. "},{"num":5,"verse":"And it shall come to pass that on the sixth day they shall prepare that which they bring in, and it will be twice as much as they gather daily.”"},{"num":6,"verse":"So Moses and Aaron said to all the children of Israel, “At evening, you shall know that the Lord has brought you out from the land of Egypt. "},{"num":7,"verse":"And in the morning you shall see the glory of the Lord, because He hears your murmurings against the Lord. And what are we that you murmur against us?” "},{"num":8,"verse":"Then Moses said, “This will happen when the Lord gives you meat to eat in the evening and bread in the morning to satisfy, for the Lord hears your murmurings which you murmur against Him. And what are we? Your murmurings are not against us, but against the Lord.”"},{"num":9,"verse":"Then Moses said to Aaron, “Say to all the congregation of the children of Israel, ‘Come near before the Lord, for He has heard your murmurings.’ ”"},{"num":10,"verse":"So as Aaron spoke to the whole congregation of the children of Israel, they looked toward the wilderness, and indeed, the glory of the Lord appeared in the cloud."},{"num":11,"verse":"Then the Lord spoke to Moses, saying, "},{"num":12,"verse":"“I have heard the murmurings of the children of Israel. Speak to them, saying, ‘In the evening you shall eat meat, and in the morning you shall be filled with bread. And you shall know that I am the Lord your God.’ ”"},{"num":13,"verse":"So in the evening the quail came up and covered the camp, and in the morning a layer of dew was surrounding the camp. "},{"num":14,"verse":"When the layer of dew evaporated, on the surface of the wilderness there lay a small flaky thing, as fine as the frost on the ground. "},{"num":15,"verse":"When the children of Israel saw it, they said one to another, “What is it?” For they did not know what it was."},{"num":16,"verse":"This is what the Lord has commanded, ‘Every man is to gather of it according to what he will eat, an omer for every man, according to the number of your people. Every man should take for them for whoever lives in his tent.’ ”"},{"num":17,"verse":"The children of Israel did so, and gathered, some more, some less. "},{"num":18,"verse":"When they measured it with an omer, he that gathered much had nothing left over, and he that gathered little had no lack. They gathered every man according what he could eat."},{"num":19,"verse":"Moses said to them, “Let no man leave any of it until the morning.”"},{"num":20,"verse":"However, they did not listen to Moses, and some of them left part of it until the morning, and it bred worms, and stank, and Moses was angry with them."},{"num":21,"verse":"So they gathered it every morning, every man according to what he could eat. And when the sun got hot, it melted. "},{"num":22,"verse":"Now on the sixth day they gathered twice as much bread, two omers per man, and then all the leaders of the congregation came and told Moses. "},{"num":23,"verse":"He said to them, “This is what the Lord has said, ‘Tomorrow is the Sabbath, a holy Sabbath to the Lord. Bake that which you will bake today, and boil that you will boil, and all that which remains over lay up for yourselves to be kept until the morning.’ ”"},{"num":24,"verse":"So they laid it up until the morning, just as Moses commanded, and it did not stink, nor was there any worm in it. "},{"num":25,"verse":"Moses said, “Eat it today, for today is a Sabbath to the Lord. Today you will not find it in the field. "},{"num":26,"verse":"Six days you shall gather it, but on the seventh day, the Sabbath, there will be none.”"},{"num":27,"verse":"It happened that some of the people went out on the seventh day to gather, but they found nothing. "},{"num":28,"verse":"Then the Lord said to Moses, “How long will you refuse to keep My commandments and My instructions? "},{"num":29,"verse":"See, the Lord has given you the Sabbath; therefore He gives you bread for two days on the sixth day. Every man remain in his place. Let no man go out of his place on the seventh day.” "},{"num":30,"verse":"So the people rested on the seventh day."},{"num":31,"verse":"The house of Israel named it manna, and it was like coriander seed and was white, and its taste was like wafers made with honey. "},{"num":32,"verse":"Then Moses said, “This is what the Lord has commanded, ‘Fill an omer of it to be kept for your generations to come, so that they may see the bread that I fed you in the wilderness, when I brought you forth from the land of Egypt.’ ”"},{"num":33,"verse":"Moses said to Aaron, “Take a pot and put an omer full of manna in it, and place it before the Lord, to be kept for generations to come.”"},{"num":34,"verse":"As the Lord commanded Moses, so Aaron placed it before the testimony, to be kept. "},{"num":35,"verse":"The children of Israel ate manna forty years, until they came to an inhabited land. They ate the manna until they came to the border of the land of Canaan."},{"num":36,"verse":"Now an omer is one-tenth of an ephah."}]