[{"num":2,"verse":"Since, brothers and sisters, we are on the topic of the coming of our Lord Jesus the Anointed and how we will all gather together to meet Him, we ask "},{"num":2,"verse":"that you don’t let your minds get quickly rattled or become anxious because of someone else’s so-called “spiritual revelation” or because someone gave you a message or claimed to know of a letter allegedly from us reporting that the day of the Lord has already come! "},{"num":3,"verse":"Don’t be deceived by anyone! That day, that amazing day, won’t come until after the great rebellion and the unveiling of the rebellious one. As the spawn of death, he delights in destruction. "},{"num":4,"verse":"He sets himself up as the great adversary of God and vies for a place above all other so-called gods or objects of worship. If it were possible, he would even take a seat—yes, exalt himself—in the temple of the one true God, declaring that he himself is God! "},{"num":5,"verse":"Don’t you remember me telling you all this the last time we were together? "},{"num":6,"verse":"You know what restrains him now and what will hold him until the exact time when he will be revealed. "},{"num":7,"verse":"For the mystery of sin is already working its way through the world; He who holds him back now will continue to suppress him only until He is pulled out of the way. "},{"num":8,"verse":"It is then that this rebellious one will be finally unleashed. But the Lord will slay him with the breath of His mouth; and with the splendor of His coming, He will bring him to his predetermined end. "},{"num":9,"verse":"Still the rebellious one arrives with all sorts of power, performing signs and fake miracles sanctioned by Satan; "},{"num":10,"verse":"he employs every manner of wicked deception to wile away those who are destined for eternal death because they reject the love of the truth that leads to salvation. "},{"num":11,"verse":"Because of this, God sends a deceptive influence over them so they will wander from the truth and believe the lie. "},{"num":12,"verse":"As a result, God will judge all of those who did not entrust themselves to the truth when it faced them but instead reveled in wickedness."},{"num":13,"verse":"But this is not you, dearly beloved brothers and sisters of the Lord. We cannot help but thank God for you at all times, because from the beginning He handpicked you for salvation through the Spirit’s sanctifying work and your belief in the truth. "},{"num":14,"verse":"He called you to this when we shared our good news with you. Now you can take part in the glory of our Lord Jesus the Anointed, our Liberating King. "},{"num":15,"verse":"So, brothers and sisters, all you need to do now is stand firm and hold tight to the line of teachings we have passed on to you, whether in person or in a letter. "},{"num":16,"verse":"Now may our Lord Jesus (the Anointed One Himself) and God our Father (who has loved us, comforted us eternally, and given us a good hope by His grace) bring comfort to your hearts and strengthen your wills to accomplish every good work and word."}]