[{"num":10,"verse":"Hear the word of the Lord, O Israel:"},{"num":2,"verse":"Don’t act like the people who make horoscopes and try to read their fate and future in the stars! Don’t be frightened by predictions such as theirs, for it is all a pack of lies. Their ways are futile and foolish. They cut down a tree and carve an idol; "},{"num":4,"verse":"they decorate it with gold and silver and fasten it securely in place with hammer and nails so that it won’t fall over. "},{"num":5,"verse":"And there stands their god like a helpless scarecrow in a garden! It cannot speak, and it must be carried, for it cannot walk. Don’t be afraid of such a god, for it can neither harm nor help nor do you any good."},{"num":6,"verse":"O Lord, there is no other god like you. For you are great, and your name is full of power. "},{"num":7,"verse":"Who would not fear you, O King of nations? (And that title belongs to you alone!) Among all the wise men of the earth and in all the kingdoms of the world there isn’t anyone like you."},{"num":8,"verse":"The wisest of men who worship idols are altogether stupid and foolish. "},{"num":9,"verse":"They bring beaten sheets of silver from Tarshish and gold from Uphaz and give them to skillful goldsmiths who make their idols; then they clothe these gods in royal purple robes that expert tailors make."},{"num":10,"verse":"But the Lord is the only true God, the living God, the everlasting King. The whole earth shall tremble at his anger; the world shall hide before his displeasure."},{"num":11,"verse":"Say this to those who worship other gods: Your so-called gods, who have not made the heavens and earth, shall vanish from the earth. "},{"num":12,"verse":"But our God formed the earth by his power and wisdom, and by his intelligence he hung the stars in space and stretched out the heavens. "},{"num":13,"verse":"It is his voice that echoes in the thunder of the storm clouds. He causes mist to rise upon the earth; he sends the lightning and brings the rain, and from his treasuries he brings the wind."},{"num":14,"verse":"But foolish men without knowledge of God bow before their idols. It is a shameful business that these men are in, for what they make are frauds, gods without life or power in them. "},{"num":15,"verse":"All are worthless, silly; they will be crushed when their makers perish. "},{"num":16,"verse":"But the God of Jacob is not like these foolish idols. He is the Creator of all, and Israel is his chosen nation. The Lord Almighty is his name."},{"num":17,"verse":"Pack your bags, he says. Get ready now to leave; the siege will soon begin. "},{"num":18,"verse":"For suddenly I’ll fling you from this land and pour great troubles down; at last you shall feel my wrath."},{"num":19,"verse":"Desperate is my wound. My grief is great. My sickness is incurable, but I must bear it. "},{"num":20,"verse":"My home is gone; my children have been taken away, and I will never see them again. There is no one left to help me rebuild my home. "},{"num":21,"verse":"The shepherds of my people have lost their senses; they no longer follow God nor ask his will. Therefore they perish, and their flocks are scattered. "},{"num":22,"verse":"Listen! Hear the terrible sound of great armies coming from the north. The cities of Judah shall become dens of jackals."},{"num":23,"verse":"O Lord, I know it is not within the power of man to map his life and plan his course—"},{"num":24,"verse":"so you correct me, Lord; but please be gentle. Don’t do it in your anger, for I would die. "},{"num":25,"verse":"Pour out your fury on the nations who don’t obey the Lord, for they have destroyed Israel and made a wasteland of this entire country."}]