[{"header":"Settling Disagreements between Christians"},{"num":6,"verse":"When one of you has a complaint against another, how dare you go to court to settle the matter in front of wicked people. Why don’t you settle it in front of God’s holy people? "},{"num":2,"verse":"Don’t you know that God’s people will judge the world? So if you’re going to judge the world, aren’t you capable of judging insignificant cases? "},{"num":3,"verse":"Don’t you know that we will judge angels, not to mention things in this life? "},{"num":4,"verse":"When you have cases dealing with this life, why do you allow people whom the church has a low opinion of to be your judges? "},{"num":5,"verse":"You should be ashamed of yourselves! Don’t you have at least one wise person who is able to settle disagreements between believers? "},{"num":6,"verse":"Instead, one believer goes to court against another believer, and this happens in front of unbelievers."},{"num":7,"verse":"You are already totally defeated because you have lawsuits against each other. Why don’t you accept the fact that you have been wronged? Why don’t you accept that you have been cheated? "},{"num":8,"verse":"Instead, you do wrong and cheat, and you do this to other believers."},{"num":9,"verse":"Don’t you know that wicked people won’t inherit the kingdom of God? Stop deceiving yourselves! People who continue to commit sexual sins, who worship false gods, those who commit adultery, homosexuals, "},{"num":10,"verse":"or thieves, those who are greedy or drunk, who use abusive language, or who rob people will not inherit the kingdom of God. "},{"num":11,"verse":"That’s what some of you were! But you have been washed and made holy, and you have received God’s approval in the name of the Lord Yeshua Christ and in the Spirit of our God."},{"header":"Stay Away from Sexual Sins"},{"num":12,"verse":"Someone may say, “I’m allowed to do anything,” but not everything is helpful. I’m allowed to do anything, but I won’t allow anything to gain control over my life. "},{"num":13,"verse":"Food is for the stomach, and the stomach is for food, but God will put an end to both of them. However, the body is not for sexual sin but for the Lord, and the Lord is for the body. "},{"num":14,"verse":"God brought the Lord back to life, and by his power God will also bring us back to life."},{"num":15,"verse":"Don’t you realize that your bodies are parts of Christ’s body? Should I take the parts of Christ’s body and make them parts of a prostitute’s body? That’s unthinkable! "},{"num":16,"verse":"Don’t you realize that the person who unites himself with a prostitute becomes one body with her? God says, “The two will be one.” "},{"num":17,"verse":"However, the person who unites himself with the Lord becomes one spirit with him."},{"num":18,"verse":"Stay away from sexual sins. Other sins that people commit don’t affect their bodies the same way sexual sins do. People who sin sexually sin against their own bodies. "},{"num":19,"verse":"Don’t you know that your body is a temple that belongs to the Holy Spirit? The Holy Spirit, whom you received from God, lives in you. You don’t belong to yourselves. "},{"num":20,"verse":"You were bought for a price. So bring glory to God in the way you use your body."}]