[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Esther had not shewed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": ". . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—From the hope on Mordecai’s part that she might pass for a native Persian, and that her Jewish birth should be no hindrance to her advancement. The king does not learn his wife’s nation till some time afterwards (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 7:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 2:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 2:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mordecai had charged her that she should not show it ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Lest the knowledge hereof should either make her contemptible, or bring some inconvenience to the whole nation: but there was also a hand of God in causing this to be concealed, for the better accomplishment of that which he designed, though Mordecai was ignorant of it. If Mordecai sought or desired that his niece should become either the king’s concubine or wife, he certainly acted contrary to the Jewish law, which forbid any marriage or communication of that sort with idolaters; but the circumstances of things, and perhaps the hopes he entertained of being able to do his nation great service thereby, may plead his excuse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-20 We see to what absurd practices those came, who were destitute of Divine revelation, and what need there was of the gospel of Christ, to purify men from the lusts of the flesh, and to bring them back to the original institution of marriage. Esther was preferred as queen. Those who suggest that Esther committed sin to come at this dignity, do not consider the custom of those times and countries. Every one that the king took was married to him, and was his wife, though of a lower rank. But how low is human nature sunk, when such as these are the leading pursuits and highest worldly happiness of men! Disappointment and vexation must follow; and he most wisely consults his enjoyment, even in this present life, who most exactly obeys the precepts of the Divine law. But let us turn to consider the wise and merciful providence of God, carrying on his deep but holy designs in the midst of all this. And let no change in our condition be a pretext for forgetting our duties to parents, or the friends who have stood in their place.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Persians had no special contempt for the Jews; but, of course, they despised more or less all the subject races. Esther, with her Aryan name, may have passed for a native Persian. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. Now in Shushan the palace there was a certain Jew—Mordecai held some office about the court. But his \"sitting at the king's gate\" (Es 2:21) does not necessarily imply that he was in the humble condition of a porter; for, according to an institute of Cyrus, all state officers were required to wait in the outer courts till they were summoned into the presence chamber. He might, therefore, have been a person of some official dignity. This man had an orphan cousin, born during the exile, under his care, who being distinguished by great personal beauty, was one of the young damsels taken into the royal harem on this occasion. She had the good fortune at once to gain the good will of the chief eunuch [Es 2:9]. Her sweet and amiable appearance made her a favorite with all who looked upon her (Es 2:15, last clause). Her Hebrew name (Es 2:7) was Hadassah, that is, \"myrtle,\" which, on her introduction into the royal harem, was changed to Esther, that is, the star Venus, indicating beauty and good fortune [Gesenius].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Lest the knowledge hereof should either make her contemptible or odious, or bring some inconvenience to the whole nation, as things might happen. But there was also a hand of God in causing this to be concealed, for the better accomplishment of that which he designed, though Mordecai was ignorant of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Esther had not showed her people nor her kindred,.... What nation or family she was of; it not being asked, she was under no obligation to declare it; and being born in Shushan, as very probable, she was taken to be a Persian: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for Mordecai had charged her that she should not show it; lest she should be despised and ill treated on that account; fearing, if the king knew it, he would not marry her, as Aben Ezra; or rather, as the same writer thinks, that she might keep the law of God privately, observe the sabbath, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for Mordecai had charged her that she should not show it; lest she should be despised and ill treated on that account; fearing, if the king knew it, he would not marry her, as Aben Ezra; or rather, as the same writer thinks, that she might keep the law of God privately, observe the sabbath, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Esther had not shewed her people nor her kindred: for Mordecai had charged her that she should not shew it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Esther had not shewed her people nor her kindred",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] We must suppose that it would easily be discovered that she, like many of her companions (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Esther 2:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 2:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), was not Persian by nation. Thus what she desired to conceal was not simply that she was a foreigner, but that she was a Jewess. Nevertheless we have no knowledge from any other source that there was a special antipathy to her people on the part of the Persians. The concealment of her nationality must, one would think, have involved her in various acts both connected with food (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc.) and otherwise, which were inconsistent with Judaism. According to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Targum Shçnî",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the king on one occasion said to her, “Pray, tell me, who are thy people, and what is thy family?” She replied, “I am ignorant both concerning my people and concerning my family, because, when I was quite a child, my father and mother died and left me.” (Cassel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Comm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " p. 302.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Esther had not showed her people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To have confessed that she was a Jewess would probably have roused a prejudice against her, or at any rate have prevented her from being received with special favour. Mordecai, knowing this, had instructed her to say nothing to Hegel on the subject, and no one else, it would seem, had enlightened him. Esther 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " contains a supplementary remark. This kind and respectful treatment was shown to Esther, because, in obedience to Mordochai's command, she had not shown her people nor her kindred, i.e., her Jewish extraction; for a Jewish maiden would hardly have experienced such friendly usage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also contains an additional notice, prefixed here to enable what follows to be rightly understood, and repeated in another connection ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and on several other occasions: Mordochai walked every day before the court or enclosure of the women's house, to know the welfare (שׁלום) of Esther and what became of her (בּה יעשׂה, properly, what was done to her). Hence Mordochai was in constant communication with Esther. How this communication was effected is not more particularly stated; probably by means of the maids appointed to wait on her. Jewish expositors are of opinion, that Mordochai held high office, and that having consequently free access to the royal palace, he could easily find the means of communicating with his relative. ",
        "children": []
      }
    ]
  }
]