[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the fat of the beast that dieth of itself.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, of the aforesaid animals which died of any disease or accident, or were killed by wild beasts, and which, therefore, are entirely unclean (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), might be used for common purposes in ordinary life, such as making candles, &c., &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew Henry's Concise Commentary7:11-27 As to the peace-offerings, in the expression of their sense of mercy, God left them more at liberty, than in the expression of their sense of sin; that their sacrifices, being free-will offerings, might be the more acceptable, while, by obliging them to bring the sacrifices of atonement, God shows the necessity of the great Propitiation. The main reason why blood was forbidden of old, was because the Lord had appointed blood for an atonement. This use, being figurative, had its end in Christ, who by his death and blood-shedding caused the sacrifices to cease. Therefore this law is not now in force on believers.Barnes' Notes on the BibleCompare Leviticus 11:39. Jamieson-Fausset-Brown Bible Commentary22-27. Ye shall eat no manner of fat—(See on [38]Le 3:17).Matthew Poole's Commentary He speaketh still of the same kinds of beasts, and showeth that this prohibition reacheth not only to the fat of those beasts which were offered to God, but also of those that died, or were killed at home. And if this seems a superfluous prohibition concerning the fat, since the lean as well as the fat of such beasts was forbidden,  Leviticus 22:8, it must be noted that that prohibition reached only to the priests,  Leviticus 7:4. Gill's Exposition of the Entire BibleAnd the fat of the beast that dieth of itself,.... Of any disease, and is not regularly killed: and the fat of that which is torn with beasts; with wild beasts: may be used in any other use; as in medicine, for plasters, or for making candles, or for greasing of anything to make it smooth and pliable, or the like: but ye shall in no wise eat of it; such carcasses themselves were not to be eaten of, and one would think their fat in course must be unlawful; but however, to prevent the doing of it, this particular law was given, and those that broke this were doubly guilty, as the Jews observe (m); once in eating things that died of themselves, or were torn with beasts, and again by eating the fat of them. (m) Maimon. Hilchot Maacolot Asurot, c. 7. sect. 2.Geneva Study BibleAnd the fat of the beast that dieth of itself, and the fat of that which is torn with beasts, may be used in any other use: but ye shall in no wise eat of it.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "7:11-27 As to the peace-offerings, in the expression of their sense of mercy, God left them more at liberty, than in the expression of their sense of sin; that their sacrifices, being free-will offerings, might be the more acceptable, while, by obliging them to bring the sacrifices of atonement, God shows the necessity of the great Propitiation. The main reason why blood was forbidden of old, was because the Lord had appointed blood for an atonement. This use, being figurative, had its end in Christ, who by his death and blood-shedding caused the sacrifices to cease. Therefore this law is not now in force on believers.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "22-27. Ye shall eat no manner of fat—(See on [38]Le 3:17).",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " He speaketh still of the same kinds of beasts, and showeth that this prohibition reacheth not only to the fat of those beasts which were offered to God, but also of those that died, or were killed at home. And if this seems a superfluous prohibition concerning the fat, since the lean as well as the fat of such beasts was forbidden, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Leviticus 22:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it must be noted that that prohibition reached only to the priests, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Leviticus 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And the fat of the beast that dieth of itself,.... Of any disease, and is not regularly killed: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and the fat of that which is torn with beasts; with wild beasts: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "may be used in any other use; as in medicine, for plasters, or for making candles, or for greasing of anything to make it smooth and pliable, or the like: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "but ye shall in no wise eat of it; such carcasses themselves were not to be eaten of, and one would think their fat in course must be unlawful; but however, to prevent the doing of it, this particular law was given, and those that broke this were doubly guilty, as the Jews observe (m); once in eating things that died of themselves, or were torn with beasts, and again by eating the fat of them. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(m) Maimon. Hilchot Maacolot Asurot, c. 7. sect. 2.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "And the fat of the beast that dieth of itself, and the fat of that which is torn with beasts, may be used in any other use: but ye shall in no wise eat of it.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fat of cattle that had fallen (נבלה), or been torn to pieces (viz., by beasts of prey), was not to be eaten, because it was unclean and defiled the eater (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but it might be applied \"to all kinds of uses,\" i.e., to the common purposes of ordinary life. Knobel observes on this, that \"in the case of oxen, sheep, and goats slain in the regular way, this was evidently not allowable. But the law does not say what was to be done with the fat of these animals.\" Certainly it does not disertis verbis; but indirectly it does so clearly enough. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., during the journey through the desert any one who wanted to slaughter an ox, sheep, or goat was to bring the animal to the tabernacle as a sacrificial gift, that the blood might be sprinkled against the altar, and the fat burned upon it. By this regulation every ordinary slaughtering was raised into a sacrifice, and the law determined what was to be done with the fat. Now if afterwards, when the people dwelt in Canaan, cattle were allowed to be slaughtered in any place, and the only prohibition repeated was that against eating blood (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), whilst the law against eating fat was not renewed; it follows as a matter of course, that when the custom of slaughtering at the tabernacle was restricted to actual sacrifices, the prohibition against eating the fat portions came to an end, so far as those animals were concerned with were slain for consumption and not as sacrifices. The reason for prohibiting fat from being eaten was simply this, that so long as every slaughtering was a sacrifice, the fat portions, which were to be handed over to Jehovah and burned upon the altar, were not to be devoted to earthly purposes, because they were gifts sanctified to God. The eating of the fat, therefore, was neither prohibited on sanitary or social grounds, viz., because fat was injurious to health, as Maimonides and other Rabbins maintain, nor for the purpose of promoting the cultivation of olives, as Michaelis supposes, nor to prevent its being put into the unclean mouth of man, as Knobel imagines; but as being an illegal appropriation of what was sanctified to God, a wicked invasion of the rights of Jehovah, which was to be punished with extermination according to the analogy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:30-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prohibition of blood in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", extends to birds and cattle; fishes not being mentioned, because the little blood which they possess is not generally eaten. This prohibition Israel was to observe in all its dwelling-places (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not only so long as all the slaughterings had the character of sacrifices, but for all ages, because the blood was regarded as the soul of the animal, which God had sanctified as the medium of atonement for the soul of man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whereby the blood acquired a much higher degree of holiness than the fat. ",
        "children": []
      }
    ]
  }
]