[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The priest shall have to himself the skin.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As the skin was the only part not consumed by the fire, in the case of the burnt offering, it fell to the share of the officiating priest. According to the rule which obtained during the second Temple, all the skins of the most holy things belonged to the officiating priests—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "those of the trespass offering, the sin offerings of the laity, &c.—whereas those of the holy things—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "those of the peace offerings—belonged to the owners of the victims. These skins, which accumulated during the week, the priests whose course it was to serve divided between them every Sabbath evening.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:1-10 In the sin-offering and the trespass-offering, the sacrifice was divided between the altar and the priest; the offerer had no share, as he had in the peace-offerings. The former expressed repentance and sorrow for sin, therefore it was more proper to fast than feast; the peace-offerings denoted communion with a reconciled God in Christ, the joy and gratitude of a pardoned sinner, and the privileges of a true believer.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The skin of the burnt offering - It is most likely that the skins of the sin-offering and the trespass-offering also fell to the lot of the officiating priest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. the priest shall have to himself the skin of the burnt offering which he hath offered—All the flesh and the fat of the burnt offerings being consumed, nothing remained to the priest but the skin. It has been thought that this was a patriarchal usage, incorporated with the Mosaic law, and that the right of the sacrificer to the skin of the victim was transmitted from the example of Adam (see on [37]Ge 3:21).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the priest that offereth any man's burnt offering,.... In which the flesh was wholly burnt, and nothing of it remained to requite the priest for his trouble, as in other offerings: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "even the priest shall have to himself the skin of the burnt offering, which he hath offered; in some cases the skin itself was burnt, and then he could have nothing, see Leviticus 4:11 but in others the skin was reserved for the priest. There seems to be an emphasis upon the phrase \"to himself\", and may signify, that though in other things other priests might partake with him, yet not in this; and so Maimonides (z) observes, that the skin was not given to every priest, but to him that offered the sacrifice; and elsewhere (a) he says, the skins of light holy things are the owner's, but the skins of the most holy things are the priest's. And some have thought this law has some respect to the case of Adam, and is agreeable thereunto; who having offered sacrifice according to divine directions given him, had coats made for him and his wife of the skins of the slain beasts; and it was usual with the Heathen priests to have the skins of the sacrifices, and in which they slept in their temples and others also were desirous of the same, in order by dreams or otherwise to get knowledge of things future; See Gill on Amos 2:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "even the priest shall have to himself the skin of the burnt offering, which he hath offered; in some cases the skin itself was burnt, and then he could have nothing, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but in others the skin was reserved for the priest. There seems to be an emphasis upon the phrase \"to himself\", and may signify, that though in other things other priests might partake with him, yet not in this; and so Maimonides (z) observes, that the skin was not given to every priest, but to him that offered the sacrifice; and elsewhere (a) he says, the skins of light holy things are the owner's, but the skins of the most holy things are the priest's. And some have thought this law has some respect to the case of Adam, and is agreeable thereunto; who having offered sacrifice according to divine directions given him, had coats made for him and his wife of the skins of the slain beasts; and it was usual with the Heathen priests to have the skins of the sacrifices, and in which they slept in their temples and others also were desirous of the same, in order by dreams or otherwise to get knowledge of things future; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) In Misn. Challah, c. 4. sect. 9. (a) In Misn. Zebachim, c. 12. sect. 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) In Misn. Challah, c. 4. sect. 9. (a) In Misn. Zebachim, c. 12. sect. 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the priest that offereth any man's burnt offering, even the priest shall have to himself the skin of the burnt offering which he hath offered.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The rule that the skin of the Burnt-Offering belongs to the priest who offers it is extended in the Mishna to the skins of the ‘most holy,’ i.e. the Sin- and Guilt-Offerings. Perhaps this is implied in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Leviticus 7:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". We gather from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zebaḥim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 103 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Tal. Bab.) that the skin of the Peace-Offering belonged to the offerer. It is doubtful whether the skin of a priest’s Burnt-Offering is here included: after the analogy of the priestly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "minḥah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the whole of a priest’s sacrifice must be burnt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Leviticus 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the case of the burnt-offering, the skin of the animal was to fall to the lot of the officiating priest, viz., as payment for his services. הכּהן is construed absolutely: \"as for the priest, who offereth - the skin of the burnt-offering which he offereth shall belong to the priest\" (for \"to him\"). This was probably the case also with the trespass-offerings and sin-offerings of the laity; whereas the skin of the peace-offerings belonged to the owner of the animal (see Mishnah, Sebach. 12, 3). - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the following law is laid down with reference to the meat-offering, that everything baked in the oven, and everything prepared in a pot or pan, was to belong to the priest, who burned a portion of it upon the altar; and that everything mixed with oil and everything dry was to belong to all the sons of Aaron, i.e., to all the priests, to one as much as another, so that they were all to receive an equal share. The reason for this distinction is not very clear. That all the meat-offerings described in ch. 2 should fall to the sons of Aaron (i.e., to the priests), with the exception of that portion which was burned upon the altar as an azcarah, followed from the fact that they were most holy (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As the meat-offerings, which consisted of pastry, and were offered in the form of prepared food (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), are the same as those described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:4-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is evident that by those mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we are to understand the kinds described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:14-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and by the \"dry,\" primarily the קלוּי אביב, which consisted of dried grains, to which oil was to be added (נתן ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), though not poured upon it, as in the case of the offering of flour (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and probably also in that of the sin-offerings and jealousy-offerings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which consisted simply of flour (without oil). The reason therefore why those which consisted of cake and pastry fell to the lot of the officiating priest, and those which consisted of flour mixed with oil, of dry corn, or of simple flour, were divided among all the priests, was probably simply this, that the former were for the most part offered only under special circumstances, and then merely in small quantities, whereas the latter were the ordinary forms in which the meat-offerings were presented, and amounted to more than the officiating priests could possibly consume, or dispose of by themselves. ",
        "children": []
      }
    ]
  }
]