[{"header":"The Religious Leaders and Levites"},{"num":12,"verse":"These are the religious leaders and the Levites who came up with Zerubbabel the son of Shealtiel, and Jeshua. There were Seraiah, Jeremiah, Ezra, "},{"num":2,"verse":"Amariah, Malluch, Hattush, "},{"num":3,"verse":"Shecaniah, Rehum, Meremoth, "},{"num":4,"verse":"Iddo, Ginnethoi, Abijah, "},{"num":5,"verse":"Mijamin, Maadiah, Bilgah, "},{"num":6,"verse":"Shemaiah, Joiarib, Jedaiah, "},{"num":7,"verse":"Sallu, Amok, Hilkiah, and Jedaiah. These were the heads of the religious leaders and their brothers in the days of Jeshua."},{"num":8,"verse":"The Levites were Jeshua, Binnui, Kadmiel, Sherebiah, Judah, and Mattaniah, who with his brothers was over the songs of giving thanks. "},{"num":9,"verse":"Bakbukiah and Unni, their brothers, stood beside them in their work. "},{"num":10,"verse":"Jeshua was the father of Joiakim. Joiakim was the father of Eliashib. Eliashib was the father of Joiada. "},{"num":11,"verse":"Joiada was the father of Jonathan. Jonathan was the father of Jaddua."},{"num":12,"verse":"In the days of Joiakim the religious leader, these were the heads of the family groups: Meraiah of Seraiah, Hananiah of Jeremiah, "},{"num":13,"verse":"Meshullam of Ezra, Jehohanan of Amariah, "},{"num":14,"verse":"Jonathan of Malluchi, Joseph of Shebaniah, "},{"num":15,"verse":"Adna of Harim, Helkai of Meraioth, "},{"num":16,"verse":"Zechariah of Iddo, Meshullam of Ginnethon, "},{"num":17,"verse":"Zichri of Abijah, Piltai of Moadiah of Miniamin, "},{"num":18,"verse":"Shammua of Bilgah, Jehonathan of Shemaiah, "},{"num":19,"verse":"Mattenai of Joiarib, Uzzi of Jedaiah, "},{"num":20,"verse":"Kallai of Sallai, Eber of Amok, "},{"num":21,"verse":"Hashabiah of Hilkiah, and Nethanel of Jedaiah."},{"num":22,"verse":"As for the Levites, in the days of Eliashib, Joiada, Johanan, and Jaddua, the heads of the family groups were written down. So were the religious leaders in the rule of Darius the Persian. "},{"num":23,"verse":"The sons of Levi, the heads of the family groups, were written down in the Book of the Chronicles until the days of Johanan the son of Eliashib. "},{"num":24,"verse":"The heads of the Levites were Hashabiah, Sherebiah, and Jeshua the son of Kadmiel, with their brothers beside them. Each group praised and gave thanks, as David the man of God had told them. "},{"num":25,"verse":"Mattaniah, Bakbukiah, Obadiah, Meshullam, Talmon and Akkub were gate-keepers. They watched at the store-houses of the gates. "},{"num":26,"verse":"These men worked in the days of Joiakim the son of Jeshua, the son of Jozadak, and in the days of Nehemiah the ruler and of Ezra the religious leader and writer."},{"header":"Nehemiah Sets Apart the Jerusalem Wall for God"},{"num":27,"verse":"At the special time to praise God for the wall of Jerusalem, they looked for all the Levites in the places where they lived and brought them to Jerusalem so they might join them at this special time with happiness. They sang songs of thanks and other songs as timbrels and harps were played. "},{"num":28,"verse":"So the sons of the singers were gathered from the land around Jerusalem, from the villages of the Nethophathites, "},{"num":29,"verse":"from Beth-gilgal, and from their fields in Geba and Azmaveth. For the singers had built villages for themselves around Jerusalem. "},{"num":30,"verse":"The religious leaders and the Levites made themselves holy, and they made the people, the gates, and the wall holy."},{"num":31,"verse":"Then I had the leaders of Judah come up on top of the wall. And I picked two large groups of singers to give thanks. One group was to go to the right on top of the wall to the Waste Gate. "},{"num":32,"verse":"Hoshaiah and half of the leaders of Judah followed them, "},{"num":33,"verse":"with Azariah, Ezra, Meshullam, "},{"num":34,"verse":"Judah, Benjamin, Shemaiah, Jeremiah, "},{"num":35,"verse":"and some of the sons of the religious leaders blowing horns. Then followed Zechariah the son of Jonathan, son of Shemaiah, son of Mattaniah, son of Micaiah, son of Zaccur, son of Asaph, "},{"num":36,"verse":"and his brothers, Shemaiah, Azarel, Milalai, Gilalai, Maai, Nethanel, Judah, and Hanani, with the objects that David the man of God had made for playing music. And Ezra the writer went before them. "},{"num":37,"verse":"At the Well Gate they went straight up the steps of the city of David, by the steps of the wall above the house of David, to the Water Gate on the east."},{"num":38,"verse":"The second group went to the left. I followed them with half of the people on the wall, above the Tower of Stoves, to the Wide Wall. "},{"num":39,"verse":"They went above the Gate of Ephraim, by the Old Gate, the Fish Gate, the Tower of Hananel, and the Tower of the Hundred, as far as the Sheep Gate. And they stopped at the Gate of the Watchmen. "},{"num":40,"verse":"Then the two groups stood in the house of God. So did I and half of the leaders with me, "},{"num":41,"verse":"and the religious leaders, Eliakim, Maaseiah, Miniamin, Micaiah, Elioenai, Zechariah, and Hananiah, with the horns, "},{"num":42,"verse":"and Maaseiah, Shemaiah, Eleazar, Uzzi, Jehohanan, Malchijah, Elam, and Ezer. And the singers sang with Jezrahiah as their leader. "},{"num":43,"verse":"On that day they gave many good gifts and were glad because God had given them great joy. Even the women and children were filled with joy, so that the joy of Jerusalem was heard from far away."},{"num":44,"verse":"On that day men were chosen for the work of the store-rooms for the gifts, the first-fruits, and the tenth part for the Lord. They were to gather into them from the fields near the towns what was to be given by the Law to the religious leaders and Levites. For Judah was filled with joy because of the religious leaders and Levites who did the work. "},{"num":45,"verse":"They did the work of their God and the work of making everything clean from sin, together with the singers and the gate-keepers. They did as David and his son Solomon had told them. "},{"num":46,"verse":"For in the days of David and Asaph, long ago, there were leaders of the singers, and songs of praise and thanks to God. "},{"num":47,"verse":"So all Israel in the days of Zerubbabel and Nehemiah gave what was to be given to the singers and gate-keepers each day. They set apart what was for the Levites. And the Levites set apart what was for the sons of Aaron."}]