[{"num":1,"verse":"In the second year of Darius king [of Persia], in the sixth month, on the first day of the month, the word of the Lord came by means of Haggai the prophet [in Jerusalem after the Babylonian captivity] to Zerubbabel son of Shealtiel, governor of Judah, and to Joshua son of Jehozadak, the high priest, saying,"},{"num":2,"verse":"Thus says the Lord of hosts: These people say, The time is not yet come that the Lord’s house should be rebuilt [although Cyrus had ordered it done eighteen years before]."},{"num":3,"verse":"Then came the word of the Lord by Haggai the prophet, saying,"},{"num":4,"verse":"Is it time for you yourselves to dwell in your paneled houses while this house [of the Lord] lies in ruins?"},{"num":5,"verse":"Now therefore thus says the Lord of hosts: Consider your ways and set your mind on what has come to you."},{"num":6,"verse":"You have sown much, but you have reaped little; you eat, but you do not have enough; you drink, but you do not have your fill; you clothe yourselves, but no one is warm; and he who earns wages has earned them to put them in a bag with holes in it."},{"num":7,"verse":"Thus says the Lord of hosts: Consider your ways (your previous and present conduct) and how you have fared."},{"num":8,"verse":"Go up to the hill country and bring lumber and rebuild [My] house, and I will take pleasure in it and I will be glorified, says the Lord [by accepting it as done for My glory and by displaying My glory in it]."},{"num":9,"verse":"You looked for much [harvest], and behold, it came to little; and even when you brought that home, I blew it away. Why? says the Lord of hosts. Because of My house, which lies waste while you yourselves run each man to his own house [eager to build and adorn it]."},{"num":10,"verse":"Therefore the heavens above you [for your sake] withhold the dew, and the earth withholds its produce."},{"num":11,"verse":"And I have called for a drought upon the land and the hill country, upon the grain, the fresh wine, the oil, upon what the ground brings forth, upon men and cattle, and upon all the [wearisome] toil of [men’s] hands."},{"num":12,"verse":"Then Zerubbabel son of Shealtiel and Joshua son of Jehozadak, the high priest, with all the remnant of the people [who had returned from captivity], listened to and obeyed the voice of the Lord their God [not vaguely or partly, but completely, according to] the words of Haggai the prophet, since the Lord their God had sent him, and the people [reverently] feared and [worshipfully] turned to the Lord."},{"num":13,"verse":"Then Haggai, the Lord’s messenger, spoke the Lord’s message to the people saying, I am with you, says the Lord."},{"num":14,"verse":"And the Lord aroused the spirit of Zerubbabel son of Shealtiel, governor of Judah, and the spirit of Joshua son of Jehozadak, the high priest, and the spirit of all the remnant of the people, so that they came and labored on the house of the Lord of hosts, their God,"},{"num":15,"verse":"On the twenty-fourth day of the sixth month."}]