[{"header":"Caught Up with Taking Care of Your Own Houses"},{"num":1,"verse":"On the first day of the sixth month of the second year in the reign of King Darius of Persia, God’s Message was delivered by the prophet Haggai to the governor of Judah, Zerubbabel son of Shealtiel, and to the high priest, Joshua son of Jehozadak:"},{"num":2,"verse":"A Message from God-of-the-Angel-Armies: “The people procrastinate. They say this isn’t the right time to rebuild my Temple, the Temple of God.”"},{"num":3,"verse":"Shortly after that, God said more and Haggai spoke it: “How is it that it’s the ‘right time’ for you to live in your fine new homes while the Home, God’s Temple, is in ruins?”"},{"num":5,"verse":"And then a little later, God-of-the-Angel-Armies spoke out again:"},{"num":7,"verse":"That’s why God-of-the-Angel-Armies said:"},{"num":8,"verse":"Then God said:"},{"num":9,"verse":"“And why?” (This is a Message from God-of-the-Angel-Armies, remember.) “Because while you’ve run around, caught up with taking care of your own houses, my Home is in ruins. That’s why. Because of your stinginess. And so I’ve given you a dry summer and a meager crop. I’ve matched your tight-fisted stinginess by decreeing a season of drought, drying up fields and hills, withering gardens and orchards, stunting vegetables and fruit. Nothing—not man or woman, not animal or crop—is going to thrive.”"},{"num":12,"verse":"Then the governor, Zerubbabel son of Shealtiel, and the high priest, Joshua son of Jehozadak, and all the people with them listened, really listened, to the voice of their God. When God sent the prophet Haggai to them, they paid attention to him. In listening to Haggai, they honored God."},{"num":13,"verse":"Then Haggai, God’s messenger, preached God’s Message to the people: “I am with you!” God’s Word."},{"num":14,"verse":"This is how God got Zerubbabel, Joshua, and all the people moving—got them working on the Temple of God-of-the-Angel-Armies. This happened on the twenty-fourth day of the sixth month in the second year of King Darius."}]