[[],[{"type":"header","content":"A Call to Rebuild the Temple"},{"type":"prose","content":"On August 29 of the second year of King Darius’s reign, the  gave a message through the prophet Haggai to Zerubbabel son of Shealtiel, governor of Judah, and to Jeshua son of Jehozadak, the high priest."}],[{"type":"prose","content":"“This is what the  of Heaven’s Armies says: The people are saying, ‘The time has not yet come to rebuild the house of the .’”"}],[{"type":"prose","content":"Then the  sent this message through the prophet Haggai:"}],[{"type":"prose","content":"“Why are you living in luxurious houses while my house lies in ruins?"}],[{"type":"prose","content":"This is what the  of Heaven’s Armies says: Look at what’s happening to you!"}],[{"type":"prose","content":"You have planted much but harvest little. You eat but are not satisfied. You drink but are still thirsty. You put on clothes but cannot keep warm. Your wages disappear as though you were putting them in pockets filled with holes!"}],[{"type":"prose","content":"“This is what the  of Heaven’s Armies says: Look at what’s happening to you!"}],[{"type":"prose","content":"Now go up into the hills, bring down timber, and rebuild my house. Then I will take pleasure in it and be honored, says the ."}],[{"type":"prose","content":"You hoped for rich harvests, but they were poor. And when you brought your harvest home, I blew it away. Why? Because my house lies in ruins, says the  of Heaven’s Armies, while all of you are busy building your own fine houses."}],[{"type":"prose","content":"It’s because of you that the heavens withhold the dew and the earth produces no crops."}],[{"type":"prose","content":"I have called for a drought on your fields and hills—a drought to wither the grain and grapes and olive trees and all your other crops, a drought to starve you and your livestock and to ruin everything you have worked so hard to get.”"},{"type":"header","content":"Obedience to God’s Call"}],[{"type":"prose","content":"Then Zerubbabel son of Shealtiel, and Jeshua son of Jehozadak, the high priest, and the whole remnant of God’s people began to obey the message from the  their God. When they heard the words of the prophet Haggai, whom the  their God had sent, the people feared the ."}],[{"type":"prose","content":"Then Haggai, the ’s messenger, gave the people this message from the : “I am with you, says the !”"}],[{"type":"prose","content":"So the  sparked the enthusiasm of Zerubbabel son of Shealtiel, governor of Judah, and the enthusiasm of Jeshua son of Jehozadak, the high priest, and the enthusiasm of the whole remnant of God’s people. They began to work on the house of their God, the  of Heaven’s Armies,"}],[{"type":"prose","content":"on September 21 of the second year of King Darius’s reign."}]]