[{"num":1,"verse":"In the second year of Daryavesh HaMelech, in the sixth month, in yom echad of the month, came the Devar Hashem by Chaggai HaNavi unto Zerubavel ben Sh’altiel, Governor of Yehudah, and to Yehoshua ben Yehotzadak [i.e., the namesake of Moshiach, see Zech 6:11-12], the Kohen HaGadol, saying,"},{"num":2,"verse":"Thus saith Hashem Tzva’os: This people say, The time is not come, the time that Beis Hashem should be built."},{"num":3,"verse":"Then came the Devar Hashem by Chaggai HaNavi, saying,"},{"num":4,"verse":"Is it time for you, O ye, to dwell in your paneled batim, and this Beis [HaMikdash] lie in ruins?"},{"num":5,"verse":"Now therefore thus saith Hashem Tzva’os; Consider your ways."},{"num":6,"verse":"Ye have sown harbeh (much), and bring in me’at (little); ye eat, but ye have not enough; ye drink, but ye are not filled with drink; ye clothe yourselves, but there is no warming; and he that earneth wages earneth wages to put them into a purse of holes."},{"num":7,"verse":"Thus saith Hashem Tzva’os: Consider your ways."},{"num":8,"verse":"Go up to the har (mountain), and bring etz, and build HaBeis [HaMikdash]; and I will take pleasure in it, and I will be glorified, saith Hashem."},{"num":9,"verse":"Ye looked for harbeh (much), and, hinei, it came to me’at (little); and when ye brought it home, I blew it away. Why? saith Hashem Tva’os. Because of Mine Beis [HaMikdash] that is in ruins, and ye run every man for his own bais."},{"num":10,"verse":"Therefore the Shomayim over you is stayed from dew, and Ha’Aretz is stayed from her fruit."},{"num":11,"verse":"And I called for a drought upon ha’aretz, and upon the harim (mountains), and upon the grain, and upon the new wine, and upon the oil, and upon that which ha’adamah bringeth forth, and upon ha’adam, and upon livestock, and upon all the labor of the hands."},{"num":12,"verse":"Then Zerubavel ben Sh’altiel, and Yehoshua ben Yehotzadak, the Kohen HaGadol, with kol she’erit HaAm, obeyed the voice of Hashem Eloheichem, and the words of Chaggi HaNavi, as Hashem Eloheichem had sent him, and the people did fear before Hashem."},{"num":13,"verse":"Then spoke Chaggai malach Hashem with the message of Hashem unto the people, saying, I am with you, saith Hashem."},{"num":14,"verse":"And Hashem stirred up the ruach of Zerubavel ben Sh’altiel, Governor of Yehudah, and the ruach of Yehoshua ben Yehotzadak, the Kohen HaGadol, and the ruach of kol she’erit HaAm; and they came and did work in the Beis [HaMikdash] of Hashem Tzva’os, Eloheichem,"},{"num":15,"verse":"In the four and twentieth yom of the sixth month, in the second year of Daryavesh HaMelech [520 B.C.E.]."}]