[[],[{"type":"header","content":"Mary Anoints Jesus"},{"type":"prose","content":"Six days before the Passover, Jesus went to Bethany, where Lazarus was, whom He had raised from the dead. "}],[{"type":"prose","content":"So they gave a supper for Him there. Martha was serving, and Lazarus was one of those reclining  with Him. "}],[{"type":"prose","content":"Then Mary took a pound of very expensive perfume of pure nard, and she poured it on Jesus’ feet and wiped His feet with her hair; and the house was filled with the fragrance of the perfume. "}],[{"type":"prose","content":"But Judas Iscariot, one of His disciples, the one who was going to betray Him, said, "}],[{"type":"prose","content":"“Why was this perfume not sold for three hundred denarii and [the money] given to the poor?” "}],[{"type":"prose","content":"Now he said this, not because he cared about the poor [for he had never cared about them], but because he was a thief; and since he had the money box [serving as treasurer for the twelve disciples], he used to pilfer what was put into it. "}],[{"type":"prose","content":"So Jesus said,  [the rest of]  "}],[{"type":"prose","content":"A large crowd of Jews learned that He was there [at Bethany]; and they came, not only because of Jesus, but also to see Lazarus, whom He had raised from the dead. "}],[{"type":"prose","content":"So the chief priests planned to kill Lazarus also, "}],[{"type":"prose","content":"because on account of him many of the Jews were going away [from the teaching and traditions of the Jewish leaders] and believing in Jesus [following Him as Savior and Messiah]."}],[{"type":"header","content":"The Triumphal Entry"},{"type":"prose","content":"The next day, when the large crowd who had come to the  feast heard that Jesus was coming to Jerusalem, "}],[{"type":"prose","content":"they took branches of palm trees [in homage to Him as King] and went out to meet Him, and they  shouting  kept shouting “Hosanna! BLESSED (celebrated, praised) IS HE WHO COMES IN THE NAME OF THE LORD, even the King of Israel!” "}],[{"type":"prose","content":"And Jesus, finding a young donkey, sat on it; just as it is written [in Scripture], "}],[{"type":"prose","content":"“DO NOT FEAR, DAUGHTER OF ZION; BEHOLD, YOUR KING IS COMING, SEATED ON A DONKEY’S COLT.” "}],[{"type":"prose","content":"His disciples did not understand [the meaning of] these things at first; but when Jesus was glorified  exalted, they remembered that these things had been written about Him and had been done to Him. "}],[{"type":"prose","content":"So the people, who were with Him when He called Lazarus out of the tomb and raised him from the dead, continued to tell others . "}],[{"type":"prose","content":"For this reason the crowd went to meet Him, because they heard that He had performed this [miraculous] sign. "}],[{"type":"prose","content":"Then the Pharisees [argued and] said to one another, “You see that your efforts are futile. Look! The whole world has gone [running] after Him!”"}],[{"type":"header","content":"Greeks Seek Jesus"},{"type":"prose","content":"Now there were some Greeks (Gentiles) among those who were going up to worship at the feast; "}],[{"type":"prose","content":"these came to Philip, who was from Bethsaida in Galilee, with a request, saying, “Sir, we wish to see Jesus.” "}],[{"type":"prose","content":"Philip came and told Andrew; then Andrew and Philip went and told Jesus. "}],[{"type":"prose","content":"And Jesus answered them,   [just one grain, never more].   [eventually]  [through death],  [and is concerned with pleasing God]   [continue to faithfully]  [without hesitation, holding steadfastly to Me, conforming to My example in living and, if need be, suffering or perhaps dying because of faith in Me];  [in heaven’s glory], "},{"type":"header","content":"Jesus Foretells His Death"},{"type":"prose","content":" [of trial and agony]’?  [very]  [this time and place]. "}],[{"type":"prose","content":"[Rather, I will say,]  Then a voice came from heaven saying, “I have both glorified it, and will glorify it again.” "}],[{"type":"prose","content":"The crowd  who stood nearby and heard the voice said that it had thundered; others said, “An angel has spoken to Him!” "}],[{"type":"prose","content":"Jesus answered,   [the sentence is being passed].   [on the cross],  [Gentiles, as well as Jews].” "}],[{"type":"prose","content":"He said this to indicate the kind of death by which He was to die. "}],[{"type":"prose","content":"At this the crowd answered Him, “We have heard from the Law that the Christ is to remain forever; how then can You say, ? Who is this Son of Man?” "}],[{"type":"prose","content":"So Jesus said to them,  [only]  [keep on living by it],  [he is drifting aimlessly].  [have faith in it, hold on to it, rely on it],  [being filled with Light as followers of God].”Jesus said these things, and then He left and hid Himself from them. "}],[{"type":"prose","content":"Even though He had done so many signs (attesting miracles) right before them, yet they still did not believe  failed to trust Him— "}],[{"type":"prose","content":" to fulfill what Isaiah the prophet said: “LORD, WHO HAS BELIEVED OUR MESSAGE? AND TO WHOM HAS THE ARM (the power) OF THE LORD BEEN SHOWN (unveiled, revealed)?” "}],[{"type":"prose","content":"Therefore they could not believe, for Isaiah said again, "}],[{"type":"prose","content":"“HE HAS BLINDED THEIR EYES AND HE HARDENED THEIR HEART, TO KEEP THEM FROM SEEING WITH THEIR EYES AND UNDERSTANDING WITH THEIR HEART AND BEING CONVERTED; OTHERWISE, I [their God] WOULD HEAL THEM.” "}],[{"type":"prose","content":"Isaiah said these things because he saw His glory and spoke about Him. "}],[{"type":"prose","content":"Nevertheless, even many of the leading men believed in Him [as Savior and Messiah], but because of the Pharisees they would not confess it, for fear that [if they acknowledged Him openly] they would be put out of the synagogue (excommunicated); "}],[{"type":"prose","content":"for they loved the approval of men more than the approval of God."}],[{"type":"prose","content":"But Jesus loudly declared,  [only]  [also believes]    [as Savior—all those who anchor their hope in Me and rely on the truth of My message]   [that is, to initiate the final judgment of the world],     [in accordance with His exact instruction,] "}]]