[{"header":"The Anointing at Bethany"},{"num":12,"verse":"Six days before the Passover, Jesus came to Bethany where Lazarus was, the one Jesus had raised from the dead. "},{"num":2,"verse":"So they gave a dinner for him there; Martha was serving them, and Lazarus was one of those reclining at the table with him. "},{"num":3,"verse":"Then Mary took a pound of perfume, pure and expensive nard, anointed Jesus’s feet, and wiped his feet with her hair. So the house was filled with the fragrance of the perfume."},{"num":4,"verse":"Then one of his disciples, Judas Iscariot (who was about to betray him), said, "},{"num":5,"verse":"“Why wasn’t this perfume sold for three hundred denarii and given to the poor?” "},{"num":6,"verse":"He didn’t say this because he cared about the poor but because he was a thief. He was in charge of the money-bag and would steal part of what was put in it."},{"num":7,"verse":"Jesus answered, “Leave her alone; she has kept it for the day of my burial. "},{"num":8,"verse":"For you always have the poor with you, but you do not always have me.”"},{"header":"The Decision to Kill Lazarus"},{"num":9,"verse":"Then a large crowd of the Jews learned he was there. They came not only because of Jesus but also to see Lazarus, the one he had raised from the dead. "},{"num":10,"verse":"But the chief priests had decided to kill Lazarus also, "},{"num":11,"verse":"because he was the reason many of the Jews were deserting them and believing in Jesus."},{"header":"The Triumphal Entry"},{"num":12,"verse":"The next day, when the large crowd that had come to the festival heard that Jesus was coming to Jerusalem, "},{"num":13,"verse":"they took palm branches and went out to meet him. They kept shouting:"},{"num":14,"verse":"Jesus found a young donkey and sat on it, just as it is written:"},{"num":16,"verse":"His disciples did not understand these things at first. However, when Jesus was glorified, then they remembered that these things had been written about him and that they had done these things to him."},{"num":17,"verse":"Meanwhile, the crowd, which had been with him when he called Lazarus out of the tomb and raised him from the dead, continued to testify. "},{"num":18,"verse":"This is also why the crowd met him, because they heard he had done this sign. "},{"num":19,"verse":"Then the Pharisees said to one another, “You see? You’ve accomplished nothing. Look, the world has gone after him!” "},{"header":"Jesus Predicts His Crucifixion"},{"num":20,"verse":"Now some Greeks were among those who went up to worship at the festival. "},{"num":21,"verse":"So they came to Philip, who was from Bethsaida in Galilee, and requested of him, “Sir, we want to see Jesus.” "},{"num":22,"verse":"Philip went and told Andrew; then Andrew and Philip went and told Jesus."},{"num":23,"verse":"Jesus replied to them, “The hour has come for the Son of Man to be glorified. "},{"num":24,"verse":"Truly I tell you, unless a grain of wheat falls to the ground and dies, it remains by itself. But if it dies, it produces much fruit. "},{"num":25,"verse":"The one who loves his life will lose it, and the one who hates his life in this world will keep it for eternal life. "},{"num":26,"verse":"If anyone serves me, he must follow me. Where I am, there my servant also will be. If anyone serves me, the Father will honor him."},{"num":27,"verse":"“Now my soul is troubled. What should I say—Father, save me from this hour? But that is why I came to this hour. "},{"num":28,"verse":"Father, glorify your name.”"},{"num":29,"verse":"The crowd standing there heard it and said it was thunder. Others said, “An angel has spoken to him.”"},{"num":30,"verse":"Jesus responded, “This voice came, not for me, but for you. "},{"num":31,"verse":"Now is the judgment of this world. Now the ruler of this world will be cast out. "},{"num":32,"verse":"As for me, if I am lifted up from the earth I will draw all people to myself.” "},{"num":33,"verse":"He said this to indicate what kind of death he was about to die."},{"num":34,"verse":"Then the crowd replied to him, “We have heard from the law that the Messiah will remain forever. So how can you say, ‘The Son of Man must be lifted up’? Who is this Son of Man?”"},{"num":35,"verse":"Jesus answered, “The light will be with you only a little longer. Walk while you have the light so that darkness doesn’t overtake you. The one who walks in darkness doesn’t know where he’s going. "},{"num":36,"verse":"While you have the light, believe in the light so that you may become children of light.” Jesus said this, then went away and hid from them."},{"header":"Isaiah’s Prophecies Fulfilled"},{"num":37,"verse":"Even though he had performed so many signs in their presence, they did not believe in him. "},{"num":38,"verse":"This was to fulfill the word of Isaiah the prophet, who said:"},{"num":39,"verse":"This is why they were unable to believe, because Isaiah also said:"},{"num":41,"verse":"Isaiah said these things because he saw his glory and spoke about him."},{"num":42,"verse":"Nevertheless, many did believe in him even among the rulers, but because of the Pharisees they did not confess him, so that they would not be banned from the synagogue. "},{"num":43,"verse":"For they loved human praise more than praise from God."},{"header":"A Summary of Jesus’s Mission"},{"num":44,"verse":"Jesus cried out, “The one who believes in me believes not in me, but in him who sent me. "},{"num":45,"verse":"And the one who sees me sees him who sent me. "},{"num":46,"verse":"I have come as light into the world, so that everyone who believes in me would not remain in darkness. "},{"num":47,"verse":"If anyone hears my words and doesn’t keep them, I do not judge him; for I did not come to judge the world but to save the world. "},{"num":48,"verse":"The one who rejects me and doesn’t receive my sayings has this as his judge:  The word I have spoken will judge him on the last day. "},{"num":49,"verse":"For I have not spoken on my own, but the Father himself who sent me has given me a command to say everything I have said. "},{"num":50,"verse":"I know that his command is eternal life. So the things that I speak, I speak just as the Father has told me.”"}]