[{"header":"In Bethany At a Dinner For Jesus And Lazarus, Mary Anoints Jesus"},{"num":12,"verse":"Therefore Jesus, six days before the Passover [Feast], came to Bethany where Lazarus was, the one whom Jesus raised from the dead. "},{"num":2,"verse":"So they made a dinner for Him there. And Martha was serving. And Lazarus was one of the ones reclining-back [to eat] with Him. "},{"num":3,"verse":"Then Mary, having taken a pound of very-valuable genuine nard perfume, anointed the feet of Jesus, and wiped His feet with her hair. And the house was filled from the aroma of the perfume. "},{"num":4,"verse":"But Judas the Iscariot— one of His disciples, the one going to hand Him over— says, "},{"num":5,"verse":"“For what reason was this perfume not sold for three-hundred denarii and given to poor ones?” "},{"num":6,"verse":"Now he said this, not because he was concerned about the poor, but because he was a thief. And having the money-box, he was carrying the things being put there. "},{"num":7,"verse":"So Jesus said, “Leave her alone. It was in order that she might keep it for the day of My preparation-for-burial. "},{"num":8,"verse":"For you always have the poor with you, but you do not always have Me”. "},{"num":9,"verse":"Then the large crowd of the Jews came-to-know that He was there. And they came— not because of Jesus only, but in order that they might also see Lazarus, whom He raised from the dead. "},{"num":10,"verse":"And the chief priests planned to kill Lazarus also, "},{"num":11,"verse":"because many of the Jews were going-away and were believing in Jesus because of him."},{"header":"Jesus The King Enters Jerusalem On a Donkey, As Predicted By Zechariah"},{"num":12,"verse":"On the next day the large crowd— the one having come to the Feast— having heard that Jesus was coming to Jerusalem, "},{"num":13,"verse":"took the branches of palm-trees and came out to meet Him. And they were shouting, “Hosanna! Blessed is the One coming in the name of the Lord, even the King of Israel”. "},{"num":14,"verse":"And Jesus, having found a young-donkey, sat on it, just as it has been written [in Zech 9:9]: "},{"num":15,"verse":"“Do not be fearing, daughter of Zion. Behold— your King is coming, sitting on a colt of a donkey”. "},{"num":16,"verse":"His disciples did not understand these things at first. But when Jesus was glorified, then they remembered that these things had been written for Him, and that they did these things to Him. "},{"num":17,"verse":"Then the crowd was testifying— the one being with Him when He called Lazarus out of the tomb and raised him from the dead. "},{"num":18,"verse":"For this reason also the crowd met Him— because they heard that He had done this sign. "},{"num":19,"verse":"Then the Pharisees said to themselves, “You see that you are profiting nothing! Look— the world went after Him!”"},{"header":"Jesus Says The Hour For Which He Came Has Come. A Seed Must Die To Bear Fruit"},{"num":20,"verse":"Now some of the ones going up in order that they might worship at the Feast were Greeks. "},{"num":21,"verse":"So these ones came to Philip, the one from Bethsaida of Galilee, and were asking him, saying, “Sir, we wish to see Jesus”. "},{"num":22,"verse":"Philip comes and tells Andrew. Andrew and Philip come, and they tell Jesus. "},{"num":23,"verse":"And Jesus responds to them, saying, “The hour has come for the Son of Man to be glorified. "},{"num":24,"verse":"Truly, truly, I say to you, unless the seed of wheat having fallen to the earth dies, it remains alone. But if it dies, it bears much fruit. "},{"num":25,"verse":"The one loving his life loses it, and the one hating his life in this world will keep it for eternal life. "},{"num":26,"verse":"If anyone serves Me, let him be following Me. And where I am, there also My servant will be. If anyone serves Me, the Father will honor him. "},{"num":27,"verse":"Now My soul has been troubled. And what should I say— ‘Father, save Me from this hour’? But for this reason I came to this hour! "},{"num":28,"verse":"Father, glorify Your name!”"},{"header":"Now Is The Judgment of This World. If I Am Lifted Up, I Will Draw All People To Myself"},{"num":29,"verse":"Then the crowd, the one standing there and having heard, was saying that thunder had taken place. Others were saying, “An angel has spoken to Him”. "},{"num":30,"verse":"Jesus responded and said, “This voice has taken place not for My sake, but for your sakes. "},{"num":31,"verse":"Now is the judgment of this world! Now the ruler of this world will be cast out! "},{"num":32,"verse":"And if I am lifted-up from the earth, I will draw all people to Myself ”. "},{"num":33,"verse":"Now He was saying this signifying by what-kind-of death He was going to die."},{"header":"Believe In The Light While You Have The Light, That You May Become Sons of Light"},{"num":34,"verse":"Then the crowd responded to Him, “We heard from the Law that the Christ remains forever. How indeed do You say that ‘The Son of Man must be lifted-up’? Who is this Son of Man?” "},{"num":35,"verse":"Then Jesus said to them, “The Light is among you for a short time longer. Be walking while you have the Light, in order that darkness may not overtake you. Indeed the one walking in the darkness does not know where he is going. "},{"num":36,"verse":"While you have the Light, be believing in the Light, in order that you may become sons of Light”. Jesus spoke these things, and having gone away, was hidden from them."},{"header":"Isaiah Is Fulfilled: God Blinded Their Eyes And Hardened Their Hearts"},{"num":37,"verse":"Now He having done so-many signs in front of them— they were not believing in Him, "},{"num":38,"verse":"in order that the word of Isaiah the prophet might be fulfilled which he spoke [in Isa 53:1]: “Lord, who believed our report? And to whom was the arm of the Lord revealed?” "},{"num":39,"verse":"For this reason they were not able to believe: because again Isaiah said [in Isa 6:10] "},{"num":40,"verse":"“He has blinded their eyes, and He hardened their heart, in order that they might not see with their eyes, and comprehend in their heart, and be turned, and I shall heal them”. "},{"num":41,"verse":"Isaiah said these things because he saw His glory and spoke about Him. "},{"num":42,"verse":"Yet indeed, even many of the rulers believed in Him. But because of the Pharisees, they were not confessing it in order that they might not become put-out-of-the-synagogue. "},{"num":43,"verse":"For they loved the glory of people more than the glory of God."},{"header":"I Came To Save The World, And I Spoke The Father’s Words. My Words Are Eternal Life"},{"num":44,"verse":"And Jesus cried-out and said “The one believing in Me is not believing in Me, but in the One having sent Me. "},{"num":45,"verse":"And the one seeing Me is seeing the One having sent Me. "},{"num":46,"verse":"I have come into the world as a light, so that everyone believing in Me should not remain in the darkness. "},{"num":47,"verse":"And if anyone hears My words and does not keep them, I do not judge him. For I did not come in order that I might judge the world, but in order that I might save the world. "},{"num":48,"verse":"The one rejecting Me and not receiving My words has that which judges him— the word which I spoke, that will judge him at the last day. "},{"num":49,"verse":"Because I did not speak out of Myself, but the Father having sent Me— He has given Me a commandment as to what I should say and what I should speak. "},{"num":50,"verse":"And I know that His commandment is eternal life. Therefore the things which I speak— just as the Father has told Me, so I speak”."}]