[{"num":12,"verse":"Then Rebbe, Melech HaMoshiach came into Beit-Anyan (Bethany) shesh yamim before Pesach. This was the place where El’azar was, whom Rebbe, Melech HaMoshiach made to stand up alive from the mesim."},{"num":2,"verse":"Then they made Rebbe, Melech HaMoshiach a seudah there. And Marta was serving, and El’azar was one of the ones reclining at tish with Rebbe, Melech HaMoshiach."},{"num":3,"verse":"Then Miryam, having taken a pound of mishcha (ointment) of expensive genuine spikenard, anointed the feet of Rebbe, Melech HaMoshiach and wiped off with her hair his feet. And the bais was filled with the aroma of the mishcha."},{"num":4,"verse":"And Yehuda from K’riot, one of the talmidim of Rebbe, Melech HaMoshiach, the talmid being about to betray him, says"},{"num":5,"verse":"Why was this mishcha not sold for three hundred denarii and given to haAniyim (the Poor)?"},{"num":6,"verse":"But he said this not because it mattered to him about haAniyim, but because he was a ganav and he was removing what was put in the aron otzaram (chest of treasury)."},{"num":7,"verse":"Therefore Rebbe, Melech HaMoshiach said, Let her alone. She kept this for the Yom HaKevurah (Day of Burial) of me [Isa 53:9]."},{"num":8,"verse":"For haAniyim you have always with you, but you do not always have me. [DEVARIM 15:11]"},{"num":9,"verse":"When the great multitude of the Yehudim had da’as of where Rebbe, Melech HaMoshiach was, they came not only because of him, but also because of El’azar, that they may see the one whom he made to stand up alive from the mesim."},{"num":10,"verse":"But the Rashei Hakohanim took counsel that they also might kill El’azar,"},{"num":11,"verse":"Because many of the Yehudim were leaving and believing in Rebbe, Melech HaMoshiach on account of El’azar."},{"num":12,"verse":"On the next day the great multitude, the one having come to the Chag (Feast), having heard that Rebbe, Melech HaMoshiach is coming to Yerushalayim,"},{"num":13,"verse":"Took the branches of the temarim (palms) [VAYIKRA 23:40] and went out to a meeting with him and were crying out: HOSHAN NAH [TEHILLIM 118:25-26] BARUCH HABAH B’SHEM ADONOI! [TZEFANYAH 3:15 TARGUM HASHIVIM] Melech Yisroel!"},{"num":14,"verse":"And he found an ayir (young donkey), and he sat on it, just as it has been written,"},{"num":15,"verse":"Do not fear BAT TZIYON, HINEI MALKECH YAVO LACH ROKHEV AL AYIR BEN ATONOT (Do not fear, Daughter of Zion. Look! Your King is coming, sitting on a foal of donkeys.) [ZECHARYAH 9:9; YESHAYAH 35:4; ZEFANYAH 3:14 TARGUM HASHIVIM]"},{"num":16,"verse":"Regarding these things his talmidim did not have binah in the beginning but when he received kavod, then they remembered that these things had been written with respect to him and that they did these things to him."},{"num":17,"verse":"So the crowd that had been with Rebbe, Melech HaMoshiach when he called El’azar out of the kever and made him stand up alive from the mesim were giving solemn edut (testimony)."},{"num":18,"verse":"Therefore, the multitude met Rebbe, Melech HaMoshiach because they heard him to have done this ot (miraculous sign)."},{"num":19,"verse":"Therefore the Perushim said to themselves, You see, you can do nothing! Kol Bnei Adam have gone after him."},{"num":20,"verse":"Now there were some Yevanim among the ones going up to worship at the Chag (Feast)."},{"num":21,"verse":"These ones, therefore, approached Philippos from Beit-Tzaidah of the Galil, and were asking him, Sir, we want to see Yehoshua."},{"num":22,"verse":"Philippos comes and tells Andrew, and Andrew and Philippos come and tell Rebbe, Melech HaMoshiach."},{"num":23,"verse":"And Rebbe, Melech HaMoshiach answers them, saying, The sha’ah (hour, time) has come that the Ben HaAdam [Dan 7:13] may receive kavod."},{"num":24,"verse":"Omein, omein, I say to you, unless the gargeer hakhitah (grain of wheat) having fallen into the ground, dies, it remains alone; but if it dies, much p’ri it bears."},{"num":25,"verse":"The Ohev (lover) of his neshamah will lose it, but the Soneh (hater) of his neshamah in the Olam Hazeh will keep it unto Chayyei Olam."},{"num":26,"verse":"If anyone serves me, let him follow me, and where I am, there also my eved will be. If anyone serves me, HaAv will honor him."},{"num":27,"verse":"Now my neshamah has been troubled, and what may I say? Save me from this sha’ah? No, it is for this tachlis that I came to this sha’ah. [TEHILLIM 6:3,4f; 42:5,11]"},{"num":28,"verse":"Avi, bring kavod to Your Name. A bat kol came out of Shomayim, saying, I have both brought kavod to it and I will bring kavod to it again."},{"num":29,"verse":"Therefore, the multitude that was standing there and heard, said, That was ra’am (thunder)! Others were saying, A malach (angel) has spoken to him! [Job 37:5; Gn 21:17]"},{"num":30,"verse":"In reply, Rebbe, Melech HaMoshiach said, Not for my sake has this bat kol come, but for yours. [SHEMOT 19:9]"},{"num":31,"verse":"Now is the Mishpat HaOlam Hazeh. Now the Sar HaOlam Hazeh will be cast out!"},{"num":32,"verse":"And if I receive the hagbah (lifting up) from ha’aretz, I will draw kol Bnei Adam to myself. [Isa 11:10]"},{"num":33,"verse":"And this Rebbe, Melech HaMoshiach was saying, signifying by what kind of mavet he was about to die."},{"num":34,"verse":"Then the crowd answered him, We heard from the Torah that the Rebbe, Melech HaMoshiach remains l’Olam (forever) and how do you say that it is necessary for the Ben HaAdam to be lifted up? Who is this Ben HaAdam? [Ps 89:4,36 37; 110:4; Isa 9:7; Ezek 37:25; Dan 7:14]"},{"num":35,"verse":"Therefore, he said to them, Yet a little time is the Ohr among you. Walk while you have the Ohr lest choshech overtake you; the one walking in the choshech does not have da’as of where he is going."},{"num":36,"verse":"While you have the Ohr, walk in the Ohr that you may become Bnei HaOhr. These things spoke Rebbe, Melech HaMoshiach. And, having gone away, he was hidden from them."},{"num":37,"verse":"Though so many otot he had done before them, they lacked emunah in him,"},{"num":38,"verse":"That the dvar of Yeshayah HaNavi may be fulfilled, which said, Adonoi, MI HE’EMIN LISHMU’ATEINU UZERO’A HASHEM AL-MI NIGLATAH? (Who has believed our report and to whom is the arm of Hashem revealed?‖Isa 53:1)"},{"num":39,"verse":"Therefore, they were not able to have emunah, because, again Yeshayah said,"},{"num":40,"verse":"HE HAS BLINDED THEIR EYES, HASHMIN LEV HAAM HAZEH (Harden the heart of this people), THAT THEY MIGHT NOT SEE WITH THEIR EYES AND HAVE BINAH WITH THEIR LEV AND MIGHT TURN AND I WILL HEAL THEM. [YESHAYAH 6:10]"},{"num":41,"verse":"These things Yeshayah spoke because he saw the kavod (glory) of Rebbe, Melech HaMoshiach and he spoke about him. [Isa 6:1]"},{"num":42,"verse":"Nevertheless, however, even among the manhigim (leaders) many had emunah (faith) in Rebbe, Melech HaMoshiach. But because of the Perushim, they were not making hoda’ah (confession) of Rebbe, Melech HaMoshiach, lest under the cherem ban they should be put away from the shul."},{"num":43,"verse":"For their ahavah was for the kavod Bnei Adam rather than the kavod Hashem. [SHMUEL ALEF 15:30]"},{"num":44,"verse":"But Rebbe, Melech HaMoshiach cried out, The ma’amin in me does not have emunah in me, but in the One having sent me."},{"num":45,"verse":"And the one seeing me sees the One having sent me."},{"num":46,"verse":"I have come as an Ohr (Light) into the Olam Hazeh that everyone believing in me may not remain in the choshech (darkness)."},{"num":47,"verse":"And if anyone hears my dvarim and of my dvarim is not shomer, I do not judge him, for I did not come to bring the Olam Hazeh into mishpat, but that I may save the Olam Hazeh."},{"num":48,"verse":"The one setting me aside and not receiving the dvarim has his Shofet: the dvar which I spoke will judge him on the Yom HaAcharon [i.e., the Yom HaDin]."},{"num":49,"verse":"Because I do not speak on my own, but the one having sent me [Elohim] HaAv He has given me a mitzvah of what I may say and what I may speak."},{"num":50,"verse":"And I have da’as that the mitzvah of Him is Chayyei Olam. Whatsoever things I speak, I speak, therefore, just as HaAv has told me."}]