[{"header":"Chapter 17"},{"num":1,"verse":"Paul in Thessalonica. After they had passed through Amphipolis and Apollonia, they reached Thessalonica where there was a Jewish synagogue."},{"num":2,"verse":"Following his usual practice, Paul went in, and for three Sabbaths he argued with them from the Scriptures,"},{"num":3,"verse":"explaining and proving that it was necessary for the Christ to suffer and rise from the dead. “And the Christ,” he said, “is this Jesus whom I am proclaiming to you.”"},{"num":4,"verse":"Some of them were convinced and joined Paul and Silas, as did a great many God-fearing Greeks as well as not a few prominent women."},{"num":5,"verse":"However, the Jews became jealous, and they recruited some ruffians from the marketplace, formed a mob, and soon had the city in an uproar. They stormed Jason’s house, intending to bring them out before the crowd."},{"num":6,"verse":"And when they could not find them there, they dragged Jason and some of the brethren before the city magistrates, shouting, “These people who have been causing trouble all over the world have come here also,"},{"num":7,"verse":"and Jason has given them shelter. They are all acting in opposition to the decrees of Caesar, claiming that there is another king named Jesus.”"},{"num":8,"verse":"Upon hearing this, the mob and the magistrates were greatly agitated."},{"num":9,"verse":"They then took a bond from Jason and the others before releasing them."},{"num":10,"verse":"Paul in Beroea. As soon as it got dark, the brethren sent Paul and Silas away to Beroea. Upon their arrival, they immediately went to the Jewish synagogue."},{"num":11,"verse":"The people there were more receptive than those in Thessalonica. They received the word with great eagerness, and they examined the Scriptures every day to check whether these things were so."},{"num":12,"verse":"Many of them became believers, as did a considerable number of influential Greek women and men."},{"num":13,"verse":"However, when the Jews of Thessalonica learned that the word of God was being proclaimed by Paul in Beroea, they followed him there to cause trouble and stir up the crowds."},{"num":14,"verse":"Therefore, the brethren immediately sent Paul on his way to the coast, while Silas and Timothy remained behind."},{"num":15,"verse":"After Paul’s escorts brought him as far as Athens, they returned with instructions for Silas and Timothy to join him as soon as possible."},{"num":16,"verse":"Paul in Athens. While Paul was waiting for them in Athens, he was outraged to note that the city was full of idols."},{"num":17,"verse":"Therefore, he debated in the synagogue with the Jews and God-fearing Gentiles, and also in the city square with whoever chanced to be there."},{"num":18,"verse":"Even a few Epicurean and Stoic philosophers argued with him. Some asked, “What is this man babbling about?” Others said, “Apparently, he is here to promote foreign deities,” because he was preaching about Jesus and the resurrection."},{"num":19,"verse":"Therefore, they took him and brought him to the Areopagus and asked him, “Can you explain to us what this new doctrine is that you are teaching?"},{"num":20,"verse":"You are presenting strange ideas to us, and we would like to find out what they all mean.”"},{"num":21,"verse":"The major pastime of the Athenians and the foreigners living there was to spend their time telling or listening to the latest ideas."},{"num":22,"verse":"Paul’s Speech at the Areopagus.Then Paul stood before them in the Areopagus and said: “Men of Athens, I have seen how religious you are."},{"num":23,"verse":"For as I walked around, looking carefully at your shrines, I noticed among them an altar with the inscription, ‘To an Unknown God.’ What, therefore, you worship as unknown, I now proclaim to you."},{"num":24,"verse":"“The God who made the world and everything in it, the Lord of heaven and earth, does not dwell in shrines made by human hands."},{"num":25,"verse":"Nor is he served by human hands as though he were in need of anything. Rather, it is he who gives to everyone life and breath and all other things."},{"num":26,"verse":"From one ancestor, he created all peoples to occupy the entire earth, and he decreed their appointed times and the boundaries of where they would live."},{"num":27,"verse":"“He did all this so that people might seek God in the hope that by groping for him they might find him, even though indeed he is not far from any one of us."},{"num":28,"verse":"For ‘In him we live and move and have our being.’ As even your own poets have said, ‘We are all his offspring.’"},{"num":29,"verse":"“Since we are God’s offspring, we ought not to think that the deity is like an image of gold or silver or stone, fashioned by human art and imagination."},{"num":30,"verse":"God has overlooked the times of human ignorance, but now he commands people everywhere to repent,"},{"num":31,"verse":"because he has fixed a day on which he will judge the world with justice by a man whom he has appointed. He has given public confirmation of this to all by raising him from the dead.”"},{"num":32,"verse":"When they heard about the resurrection of the dead, some scoffed, but others said, “We should like to hear you speak further on this subject at another time.”"},{"num":33,"verse":"After that, Paul left them."},{"num":34,"verse":"However, some of them joined him and became believers, including Dionysius the Areopagite, and a woman named Damaris, as well as some others."}]