[{"header":"The Temple Guards Are Assigned Their Duties"},{"num":26,"verse":"The temple guards were also divided into groups according to clans."},{"num":2,"verse":"He had seven sons, who were born in the following order: Zechariah, Jediael, Zebadiah, Jathniel, "},{"num":3,"verse":"Elam, Jehohanan, and Eliehoenai."},{"num":4,"verse":"Obed-Edom had been blessed with eight sons: Shemaiah, Jehozabad, Joah, Sachar, Nethanel, Ammiel, Issachar, and Peullethai."},{"num":6,"verse":"Shemaiah was the father of Othni, Rephael, Obed, Elzabad, Elihu, and Semachiah. They were all respected leaders in their clan. "},{"num":8,"verse":"There were sixty-two descendants of Obed-Edom who were strong enough to be guards at the temple."},{"num":9,"verse":"Eighteen descendants of Meshelemiah were chosen for this work."},{"num":10,"verse":"Hosah, from the Merari clan, was the father of Shimri, Hilkiah, Tebaliah, and Zechariah. Hosah had made Shimri the family leader, even though he was not the oldest son. Thirteen men from Hosah’s family were chosen to be temple guards."},{"num":12,"verse":"The guards were divided into groups, according to their family leaders, and they were assigned duties at the temple, just like the other Levites. "},{"num":13,"verse":"Each group, no matter how large or small, was assigned a gate to guard, and they let the Lord show them what he wanted done."},{"num":14,"verse":"Shelemiah was chosen to guard the East Gate. Zechariah his son was a wise man and was chosen to guard the North Gate. "},{"num":15,"verse":"Obed-Edom was then chosen to guard the South Gate, and his sons were chosen to guard the storerooms. "},{"num":16,"verse":"Shuppim and Hosah were chosen to guard the West Gate and the Shallecheth Gate on the upper road."},{"num":17,"verse":"Each day six guards were on duty on the east side of the temple, four were on duty on the north side, and four were on duty on the south side. Two guards were stationed at each of the two storerooms, "},{"num":18,"verse":"four were stationed along the road leading to the west courtyard, and two guards stayed in the court itself."},{"num":19,"verse":"These were the guard duties assigned to the men from the clans of Korah and Merari."},{"header":"Guards Are Assigned to the Treasury"},{"num":20,"verse":"The Levites who were relatives of the Korahites and the Merarites were in charge of guarding the temple treasury and the gifts that had been dedicated to God."},{"num":21,"verse":"Ladan was from the Gershon clan and was the father of Jehieli. Many of his other descendants were family leaders in the clan. "},{"num":22,"verse":"Jehieli was the father of Zetham and Joel, and they were responsible for guarding the treasury."},{"num":23,"verse":"Other guards at the treasury were from the Kohathite clans of Amram, Izhar, Hebron, and Uzziel."},{"num":24,"verse":"Shebuel was a descendant of Gershom the son of Moses. He was the chief official in charge of the temple treasury. "},{"num":25,"verse":"The descendants of Gershom’s brother Eliezer included Rehabiah, Jeshaiah, Joram, Zichri, and Shelomoth."},{"num":26,"verse":"Shelomoth and his relatives were in charge of all the gifts that were dedicated to the Lord. These included the gifts that King David had dedicated, as well as those dedicated by the family leaders, army officers, and army commanders. "},{"num":27,"verse":"And whenever valuable things were captured in battle, these men brought some of them to the temple. "},{"num":28,"verse":"Shelomoth and his relatives were responsible for any gifts that had been given to the temple, including those from Samuel the prophet, King Saul the son of Kish, Abner the son of Ner, and Joab the son of Zeruiah."},{"header":"Other Officers Are Assigned Their Duties"},{"num":29,"verse":"Chenaniah from the Izhar clan and his sons were government officials and judges. They did not work at the temple."},{"num":30,"verse":"Hashabiah from the Hebron clan and one thousand seven hundred of his skilled relatives were the officials in charge of all religious and government business in the Israelite territories west of the Jordan River."},{"num":31,"verse":"Jerijah was the leader of the Hebron clan. David assigned him and two thousand seven hundred of his relatives, who were all respected family leaders, to be the officials in charge of all religious and government business in the tribes of Reuben, Gad, and East Manasseh. David found out about these men during the fortieth year of his rule, when he had a list made of all the families in the Hebron clan. They were from the town of Jazer in the territory of Gilead."}]