[[],[{"type":"header","content":"The Gatekeepers"},{"type":"prose","content":"As for the divisions of the gatekeepers: of the Korahites, Meshelemiah son of Kore, of the sons of Asaph. "}],[{"type":"prose","content":"Meshelemiah had sons: Zechariah the firstborn, Jediael the second, Zebadiah the third, Jathniel the fourth, "}],[{"type":"prose","content":"Elam the fifth, Jehohanan the sixth, Eliehoenai the seventh. "}],[{"type":"prose","content":"Obed-edom had sons: Shemaiah the firstborn, Jehozabad the second, Joah the third, Sachar the fourth, Nethanel the fifth, "}],[{"type":"prose","content":"Ammiel the sixth, Issachar the seventh, Peullethai the eighth; for God blessed him. "}],[{"type":"prose","content":"Also to his son Shemaiah sons were born who exercised authority in their ancestral houses, for they were men of great ability. "}],[{"type":"prose","content":"The sons of Shemaiah: Othni, Rephael, Obed, and Elzabad, whose brothers were able men, Elihu and Semachiah. "}],[{"type":"prose","content":"All these, sons of Obed-edom with their sons and brothers, were able men qualified for the service; sixty-two of Obed-edom. "}],[{"type":"prose","content":"Meshelemiah had sons and brothers, able men, eighteen. "}],[{"type":"prose","content":"Hosah, of the sons of Merari, had sons: Shimri the chief (for though he was not the firstborn, his father made him chief), "}],[{"type":"prose","content":"Hilkiah the second, Tebaliah the third, Zechariah the fourth: all the sons and brothers of Hosah totaled thirteen."}],[{"type":"prose","content":"These divisions of the gatekeepers, corresponding to their leaders, had duties, just as their kindred did, ministering in the house of the ; "}],[{"type":"prose","content":"and they cast lots by ancestral houses, small and great alike, for their gates. "}],[{"type":"prose","content":"The lot for the east fell to Shelemiah. They cast lots also for his son Zechariah, a prudent counselor, and his lot came out for the north. "}],[{"type":"prose","content":"Obed-edom’s came out for the south, and to his sons was allotted the storehouse. "}],[{"type":"prose","content":"For Shuppim and Hosah it came out for the west, at the gate of Shallecheth on the ascending road. Guard corresponded to guard. "}],[{"type":"prose","content":"On the east there were six Levites each day, on the north four each day, on the south four each day, as well as two and two at the storehouse; "}],[{"type":"prose","content":"and for the colonnade on the west there were four at the road and two at the colonnade. "}],[{"type":"prose","content":"These were the divisions of the gatekeepers among the Korahites and the sons of Merari."},{"type":"header","content":"The Treasurers, Officers, and Judges"}],[{"type":"prose","content":"And of the Levites, Ahijah had charge of the treasuries of the house of God and the treasuries of the dedicated gifts. "}],[{"type":"prose","content":"The sons of Ladan, the sons of the Gershonites belonging to Ladan, the heads of families belonging to Ladan the Gershonite: Jehieli."}],[{"type":"prose","content":"The sons of Jehieli, Zetham and his brother Joel, were in charge of the treasuries of the house of the . "}],[{"type":"prose","content":"Of the Amramites, the Izharites, the Hebronites, and the Uzzielites: "}],[{"type":"prose","content":"Shebuel son of Gershom, son of Moses, was chief officer in charge of the treasuries. "}],[{"type":"prose","content":"His brothers: from Eliezer were his son Rehabiah, his son Jeshaiah, his son Joram, his son Zichri, and his son Shelomoth. "}],[{"type":"prose","content":"This Shelomoth and his brothers were in charge of all the treasuries of the dedicated gifts that King David, and the heads of families, and the officers of the thousands and the hundreds, and the commanders of the army, had dedicated. "}],[{"type":"prose","content":"From booty won in battles they dedicated gifts for the maintenance of the house of the . "}],[{"type":"prose","content":"Also all that Samuel the seer, and Saul son of Kish, and Abner son of Ner, and Joab son of Zeruiah had dedicated—all dedicated gifts were in the care of Shelomoth and his brothers."}],[{"type":"prose","content":"Of the Izharites, Chenaniah and his sons were appointed to outside duties for Israel, as officers and judges. "}],[{"type":"prose","content":"Of the Hebronites, Hashabiah and his brothers, one thousand seven hundred men of ability, had the oversight of Israel west of the Jordan for all the work of the  and for the service of the king. "}],[{"type":"prose","content":"Of the Hebronites, Jerijah was chief of the Hebronites. (In the fortieth year of David’s reign search was made, of whatever genealogy or family, and men of great ability among them were found at Jazer in Gilead.) "}],[{"type":"prose","content":"King David appointed him and his brothers, two thousand seven hundred men of ability, heads of families, to have the oversight of the Reubenites, the Gadites, and the half-tribe of the Manassites for everything pertaining to God and for the affairs of the king."}]]