[{"num":26,"verse":"Concerning the divisions of the sho’arim (gatekeepers); Of the Korchim was Meshelemyahu Ben Kore, of the Bnei Asaph."},{"num":2,"verse":"And the banim of Meshelemyahu were Zecharyahu the bechor, Yedia’el the second, Zevadyahu the third, Yatniel the fourth,"},{"num":3,"verse":"Eilam the fifth, Yehochanan the sixth, Elyehoei’nai the seventh."},{"num":4,"verse":"Moreover the banim of Oved Edom were Shema’yah the bechor, Yehozavad the second, Yoach the third, and Sachar the fourth, and Netan’el the fifth,"},{"num":5,"verse":"Ammi’el the sixth, Yissakhar the seventh, Peultai the eighth; for Elohim blessed him."},{"num":6,"verse":"Also unto Shema’yah bno were banim born, that ruled throughout the bais avihem, for they were gibborei chayil."},{"num":7,"verse":"The Bnei Shema’yah: Otni, and Repha’el, and Oved, Elzavad, whose brethren were bnei chayil, Elihu, and Semachyahu."},{"num":8,"verse":"All these of the Bnei Oved Edom; they and their banim and their brethren, ish chayil for ko’ach for the avodah, were threescore and two of Oved Edom."},{"num":9,"verse":"And Meshelemyahu had banim and brethren, bnei chayil, eighteen."},{"num":10,"verse":"Also Chosah, of the Bnei Merari, had banim; Shimri the rosh, (for though he was not the bechor, yet avihu appointed him rosh);"},{"num":11,"verse":"Chilkiyahu the second, Tevalyahu the third, Zecharyahu the fourth; all the banim and brethren of Chosah were thirteen."},{"num":12,"verse":"Among these were the divisions of the sho’arim, even among the rashei hagibborim, having mishmeret (duties), just as their brethren, to minister service in the Beis Hashem."},{"num":13,"verse":"And they cast goralot, the katon as well as the gadol, to their bais avot, for every sha’ar."},{"num":14,"verse":"And the goral for the east fell to Shelemyahu. Then for Zecharyahu bno, a yo’etz (counselor) with seichel (wisdom), they cast goralot; and his goral fell out northward."},{"num":15,"verse":"To Oved Edom southward; and to his banim the Asuppim Bais."},{"num":16,"verse":"To Shuppim and Chosah the goral came forth westward, with the Sha’ar Shallechet, by the upper road, mishmar (guard) corresponded to mishmar."},{"num":17,"verse":"Eastward were six Levi’im, northward four a day, southward four a day, and toward Asuppim shnayim shnayim (two and two)."},{"num":18,"verse":"At Parbar westward, four at the road, and two at Parbar."},{"num":19,"verse":"These are the divisions of the sho’arim among the Bnei Korchi, and among the Bnei Merari."},{"num":20,"verse":"And of the Levi’im, Achiyah was over the otzarot of the Beis HaElohim, and over the otzarot of the kodashim."},{"num":21,"verse":"As concerning the Bnei La’dan; the Bnei HaGershuni through La’dan, rashei ha’avot, even of La’dan the Gershoni, were Yechieli."},{"num":22,"verse":"The Bnei Yechieli: Zetam, and Yoel his brother, which were over the otzarot of the Beis Hashem."},{"num":23,"verse":"Of the Amrami, and the Yitzhari, the Chevroni, and the Uzzieli;"},{"num":24,"verse":"And Shevuel Ben Gershom Ben Moshe, was nagid of the otzarot."},{"num":25,"verse":"And his brethren by Eliezer: Rechavyahu bno, and Yesha’yahu bno, and Yoram bno, and Zichri bno, and Shlomit bno."},{"num":26,"verse":"Which Shlomit and his brethren were over all the otzarot of the kodashim, which Dovid HaMelech, and the rashei ha’avot, the sarim over alafim and me’ot, and the sarim of the tzava (army), had dedicated as kodesh."},{"num":27,"verse":"Out of the plunder won in battles did they dedicate as kadosh to maintain the Beis Hashem."},{"num":28,"verse":"And all that Shmuel the ro’eh (seer), and Sha’ul Ben Kish, and Avner Ben Ner, and Yoav Ben Tzeruyah, had dedicated as kodesh; and whosoever had dedicated any thing, it was under the yad of Shlomit, and of his brethren."},{"num":29,"verse":"Of the Yitzhari, Kenanyahu and his banim were for the outside labor of Yisroel, for shoterim (officials) and shofetim (judges)."},{"num":30,"verse":"And of the Chevroni, Chashavyahu and his brethren, bnei chayil, an elef and shivah me’ot (hundred), were in charge of Yisroel on this side of the Yarden westward in all the work of Hashem, and in the avodas HaMelech."},{"num":31,"verse":"Among the Chevroni was Yeriyah the rosh, even among the Chevroni, according to the toldot of his avot. In the fortieth year of the reign of Dovid they were sought, and there were found among them gibborei chayil at Yazer of Gil’ad."},{"num":32,"verse":"And his brethren, bnei chayil, were two thousand and shivah hundred rashei ha’avot, whom Dovid HaMelech put over the Reuveni, the Gadi, and the half tribe of Menasheh, for every matter pertaining to Elohim, and the affairs of HaMelech."}]