[{"num":16,"verse":"Then Jehu son of Hanani spoke the word of the Lord against King Baasha. "},{"num":2,"verse":"The Lord said, “You were nothing. Then I took you and made you a leader over my people Israel. But you have followed the ways of Jeroboam. You have caused my people Israel to sin. Their sins have made me angry. "},{"num":3,"verse":"So, Baasha, I will destroy you and your family. I will do to you what I did to the family of Jeroboam son of Nebat. "},{"num":4,"verse":"Anyone from your family who dies in the city will be eaten by dogs. And anyone from your family who dies in the fields will be eaten by birds.”"},{"num":5,"verse":"Everything else Baasha did and all his victories are written down. They are in the book of the history of the kings of Israel. "},{"num":6,"verse":"So Baasha died and was buried in Tirzah. His son Elah became king in his place."},{"num":7,"verse":"The Lord spoke his word through the prophet Jehu son of Hanani. The Lord’s message was against Baasha and his family. Baasha had done many things the Lord said were wrong. This made the Lord very angry. Baasha did the same things that Jeroboam’s family had done before him. The Lord was also angry because Baasha killed all of Jeroboam’s family."},{"header":"Elah King of Israel"},{"num":8,"verse":"Elah son of Baasha became king of Israel. This was during Asa’s twenty-sixth year as king of Judah. And Elah ruled in Tirzah for two years."},{"num":9,"verse":"Zimri was one of Elah’s officers. He commanded half of Elah’s chariots. But Zimri made plans against Elah."},{"num":10,"verse":"So Zimri went into Arza’s house and killed Elah. This was during Asa’s twenty-seventh year as king of Judah. Then Zimri became king of Israel in Elah’s place."},{"header":"Zimri King of Israel"},{"num":11,"verse":"As soon as Zimri became king, he killed all of Baasha’s family. He did not let any man of Baasha’s family or friends live. "},{"num":12,"verse":"So Zimri destroyed all of Baasha’s family. This happened as the Lord had said it would. The Lord had spoken this against Baasha through the prophet Jehu. "},{"num":13,"verse":"This happened because of all the sins of Baasha and his son Elah. They sinned and caused the people of Israel to sin. They also made the Lord, the God of Israel, angry because they had made worthless idols."},{"num":14,"verse":"Everything else Elah did is written down. It is in the book of the history of the kings of Israel."},{"num":15,"verse":"So Zimri became king of Israel. This was during Asa’s twenty-seventh year as king of Judah. Zimri ruled in Tirzah seven days. This is what happened:"},{"num":16,"verse":"The men in the camp heard that Zimri had made secret plans against the king. And they heard that Zimri had killed him. So that day in the camp they made Omri king over Israel. (Omri was commander of the army.) "},{"num":17,"verse":"So Omri and all the Israelites left Gibbethon and attacked Tirzah. "},{"num":18,"verse":"Zimri saw that the city had been captured. So he went into the palace and set it on fire. He burned the palace and himself with it. "},{"num":19,"verse":"So Zimri died because he had sinned. He did what the Lord said was wrong. Jeroboam had caused the people of Israel to sin. And Zimri sinned in the same way Jeroboam had sinned."},{"num":20,"verse":"Everything else Zimri did is written down. It is in the book of the history of the kings of Israel. The story of how Zimri turned against King Elah is also written there."},{"header":"Omri King of Israel"},{"num":21,"verse":"The people of Israel were divided into two groups. Half of the people wanted Tibni to be king. He was the son of Ginath. The other half of the people wanted Omri. "},{"num":22,"verse":"But Omri’s followers were stronger than the followers of Tibni son of Ginath. So Tibni died, and Omri became king."},{"num":23,"verse":"Omri became king of Israel. This was during the thirty-first year Asa was king of Judah. And Omri ruled Israel for 12 years. Six of those years he ruled in the town of Tirzah. "},{"num":24,"verse":"Omri bought the hill of Samaria from Shemer. He paid about 150 pounds of silver for it. Omri built a city on that hill. And he called it Samaria after the name of its earlier owner, Shemer."},{"num":25,"verse":"But Omri did what the Lord said was wrong. He did more evil than all the kings who were before him. "},{"num":26,"verse":"Jeroboam son of Nebat had caused the people of Israel to sin. And Omri sinned in the same way Jeroboam had sinned. So the Israelites made the Lord, the God of Israel, very angry. He was angry because they worshiped worthless idols."},{"num":27,"verse":"Everything else Omri did and all his successes are written down. They are all in the book of the history of the kings of Israel. "},{"num":28,"verse":"So Omri died and was buried in Samaria. His son Ahab became king in his place."},{"header":"Ahab King of Israel"},{"num":29,"verse":"So Ahab son of Omri became king of Israel. This was during Asa’s thirty-eighth year as king of Judah. Ahab ruled Israel in the town of Samaria for 22 years. "},{"num":30,"verse":"Ahab did many things that the Lord said were wrong. He did more evil than any of the kings before him. "},{"num":31,"verse":"He sinned in the same ways that Jeroboam son of Nebat had sinned. But he did even worse things. He married Jezebel daughter of Ethbaal. (Ethbaal was king of the city of Sidon.) Then Ahab began to serve Baal and worship him. "},{"num":32,"verse":"He built a temple in Samaria for worshiping Baal. And he put an altar there for Baal. "},{"num":33,"verse":"Ahab also made an idol for worshiping Asherah. He did more things to make the Lord, the God of Israel, angry than all the other kings before him."},{"num":34,"verse":"During the time of Ahab, Hiel from Bethel rebuilt the town of Jericho. It cost Hiel the life of Abiram, his oldest son, to begin work on the city. And it cost the life of Segub, his youngest son, to build the city gates. The Lord had said, through Joshua, that this would happen. (Joshua was the son of Nun.)"}]