[{"num":16,"verse":"¶ Then the word of the LORD came to Jehu, the son of Hanani, against Baasha, saying,"},{"num":2,"verse":"Forasmuch as I exalted thee out of the dust and made thee prince over my people Israel, and thou hast walked in the way of Jeroboam and hast made my people Israel sin, to provoke me to anger with their sins;"},{"num":3,"verse":"behold, I will burn up the posterity of Baasha and the posterity of his house and will make thy house like the house of Jeroboam, the son of Nebat."},{"num":4,"verse":"He that dies of Baasha in the city, the dogs shall eat; and he that dies of his in the fields, the fowls of the air shall eat."},{"num":5,"verse":"Now the rest of the acts of Baasha and what he did and his might, are they not written in the book of the chronicles of the kings of Israel?"},{"num":6,"verse":"So Baasha slept with his fathers and was buried in Tirzah, and Elah, his son, reigned in his stead."},{"num":7,"verse":"And likewise by the hand of the prophet Jehu, the son of Hanani, had come the word of the LORD upon Baasha and upon his house and upon all the evil that he did in the sight of the LORD, provoking him to anger with the work of his hands, so that he would be made like the house of Jeroboam and because of having smitten him."},{"num":8,"verse":"In the year twenty-six of Asa, king of Judah, Elah, the son of Baasha, began to reign over Israel in Tirzah, and he reigned two years."},{"num":9,"verse":"And his slave Zimri, captain of half his chariots, conspired against him, as he was in Tirzah, drinking himself drunk in the house of Arza, steward of his house in Tirzah."},{"num":10,"verse":"And Zimri went in and smote him and killed him, in the year twenty-seven of Asa, king of Judah, and reigned in his stead."},{"num":11,"verse":"And it came to pass, when he began to reign, as soon as he sat on his throne, that he smote all the house of Baasha; he left him not one that pisses against a wall, neither of his kinsfolk, {Heb. redeemers} nor of his friends."},{"num":12,"verse":"Thus did Zimri destroy all the house of Baasha, according to the word of the LORD, which he spoke against Baasha by Jehu, the prophet,"},{"num":13,"verse":"for all the sins of Baasha and the sins of Elah, his son, by which they sinned and by which they made Israel sin, provoking the LORD God of Israel to anger with their vanities."},{"num":14,"verse":"Now the rest of the acts of Elah and all that he did, are they not written in the book of the chronicles of the kings of Israel?"},{"num":15,"verse":"¶ In the year twenty-seven of Asa, king of Judah, Zimri began to reign in Tirzah, and he reigned seven days. And the people were encamped against Gibbethon, which belonged to the Philistines."},{"num":16,"verse":"And the people that were in the camp heard it said, Zimri has conspired and has killed the king. Therefore, all Israel made Omri, the captain of the host, king over Israel that day in the camp."},{"num":17,"verse":"And Omri went up from Gibbethon and all Israel with him, and they besieged Tirzah."},{"num":18,"verse":"And it came to pass, when Zimri saw that the city was taken, that he went into the palace of the king’s house and burnt the king’s house over him with fire, and died,"},{"num":19,"verse":"for his sins which he committed in doing evil in the sight of the LORD, in walking in the way of Jeroboam and in his sin which he did, making Israel sin."},{"num":20,"verse":"Now the rest of the acts of Zimri and his treason that he wrought, are they not written in the book of the chronicles of the kings of Israel?"},{"num":21,"verse":"Then the people of Israel were divided into two parts: half of the people followed Tibni, the son of Ginath, to make him king; and half followed Omri."},{"num":22,"verse":"But the people that followed Omri prevailed against the people that followed Tibni, the son of Ginath; so Tibni died, and Omri reigned."},{"num":23,"verse":"In the year thirty-one of Asa, king of Judah, Omri began to reign over Israel, and he reigned twelve years; he reigned six years in Tirzah."},{"num":24,"verse":"And he bought the mountain of Samaria of Shemer for two talents of silver and built on the mount and called the name of the city which he built, after the name of Shemer, lord of the hill, Samaria."},{"num":25,"verse":"And Omri wrought evil in the eyes of the LORD and did worse than all that were before him."},{"num":26,"verse":"For he walked in all the way of Jeroboam, the son of Nebat, and in his sin with which he made Israel sin, provoking the LORD God of Israel to anger with their vanities."},{"num":27,"verse":"Now the rest of the acts of Omri which he did and his might that he showed, are they not written in the book of the chronicles of the kings of Israel?"},{"num":28,"verse":"So Omri slept with his fathers and was buried in Samaria; and Ahab, his son, reigned in his stead."},{"num":29,"verse":"¶ And in the year thirty-eight of Asa, king of Judah, Ahab, the son of Omri, began to reign over Israel. And Ahab the son of Omri, reigned over Israel in Samaria twenty-two years."},{"num":30,"verse":"And Ahab, the son of Omri, did evil in the sight of the LORD above all that were before him,"},{"num":31,"verse":"for it was as a light thing unto him to walk in the sins of Jeroboam, the son of Nebat, and he took to wife Jezebel, the daughter of Ethbaal, king of the Zidonians, and went and served Baal and worshipped him."},{"num":32,"verse":"And he raised up an altar to Baal in the house of Baal, which he had built in Samaria."},{"num":33,"verse":"Ahab also made groves, and Ahab did more to provoke the LORD God of Israel to anger than all the kings of Israel that were before him."},{"num":34,"verse":"In his time Hiel, the Bethelite, rebuilt Jericho. He laid the foundation thereof in Abiram, his firstborn, and set up the gates thereof in his youngest son Segub, according to the word of the LORD, which he had spoken by Joshua the son of Nun."}]