[{"num":43,"verse":"So Jeremiah finished telling the people the message from the Lord their God. He told them everything the Lord their God had sent him to tell them."},{"num":2,"verse":"Azariah son of Hoshaiah, Johanan son of Kareah and some other men were too proud. They said to Jeremiah, “Jeremiah, you are lying! The Lord our God did not send you to say, ‘You must not go to Egypt to live there.’ "},{"num":3,"verse":"Baruch son of Neriah is causing you to be against us. He wants you to hand us over to the Babylonians. Then they will kill us. Or they will capture us and take us to Babylon.”"},{"num":4,"verse":"So Johanan, the army officers and all the people disobeyed the Lord’s command. He had commanded them to stay in Judah. "},{"num":5,"verse":"But Johanan son of Kareah and the army officers took those who were left alive from Judah to Egypt. These were the people who had run away from the Babylonians to other countries. But they had come back to Judah. "},{"num":6,"verse":"Now Johanan and the army officers took the men, women and children. Among those people were the king’s daughters. And they led them to Egypt. Nebuzaradan commander of the guard had put Gedaliah in charge of those people. (Gedaliah was the son of Ahikam son of Shaphan.) Johanan also took Jeremiah the prophet and Baruch son of Neriah. "},{"num":7,"verse":"These people did not listen to the Lord. So they all went to Egypt to the town of Tahpanhes."},{"num":8,"verse":"In Tahpanhes the Lord spoke his word to Jeremiah: "},{"num":9,"verse":"“Take some large stones. Bury them in the clay in the brick pavement. This is in front of the king of Egypt’s palace in Tahpanhes. Do this while the Jews are watching you. "},{"num":10,"verse":"Then say to them, ‘This is what the Lord of heaven’s armies, the God of Israel, says: I will send for my servant, Nebuchadnezzar king of Babylon. And I will set his throne over these stones I have buried. He will spread his covering for shade above these stones. "},{"num":11,"verse":"He will come here and attack Egypt. He will bring death to those who are supposed to die. He will make prisoners of those who are to be taken captive. And he will bring war to those who are to be killed with a sword. "},{"num":12,"verse":"Nebuchadnezzar will set fire to the temples of the gods of Egypt. He will burn those temples. And he will take the idols away. A shepherd wraps himself in his clothes. In the same way Nebuchadnezzar will wrap Egypt around him. Then he will safely leave Egypt. "},{"num":13,"verse":"He will destroy the stone pillars in the temple of the sun god in Egypt. And he will burn down the temples of the gods of Egypt.’”"}]