[{"header":"Taken to Egypt, Jeremiah Warns of Judgment"},{"num":43,"verse":"When Jeremiah finished speaking to all the people all these words of the Lord their God, with which the Lord their God had sent him to them, "},{"num":2,"verse":"Azari′ah the son of Hoshai′ah and Joha′nan the son of Kare′ah and all the insolent men said to Jeremiah, “You are telling a lie. The Lord our God did not send you to say, ‘Do not go to Egypt to live there’; "},{"num":3,"verse":"but Baruch the son of Neri′ah has set you against us, to deliver us into the hand of the Chalde′ans, that they may kill us or take us into exile in Babylon.” "},{"num":4,"verse":"So Joha′nan the son of Kare′ah and all the commanders of the forces and all the people did not obey the voice of the Lord, to remain in the land of Judah. "},{"num":5,"verse":"But Joha′nan the son of Kare′ah and all the commanders of the forces took all the remnant of Judah who had returned to live in the land of Judah from all the nations to which they had been driven— "},{"num":6,"verse":"the men, the women, the children, the princesses, and every person whom Nebu′zarad′an the captain of the guard had left with Gedali′ah the son of Ahi′kam, son of Shaphan; also Jeremiah the prophet and Baruch the son of Neri′ah. "},{"num":7,"verse":"And they came into the land of Egypt, for they did not obey the voice of the Lord. And they arrived at Tah′panhes."},{"num":8,"verse":"Then the word of the Lord came to Jeremiah in Tah′panhes: "},{"num":9,"verse":"“Take in your hands large stones, and hide them in the mortar in the pavement which is at the entrance to Pharaoh’s palace in Tah′panhes, in the sight of the men of Judah, "},{"num":10,"verse":"and say to them, ‘Thus says the Lord of hosts, the God of Israel: Behold, I will send and take Nebuchadrez′zar the king of Babylon, my servant, and he will set his throne above these stones which I have hid, and he will spread his royal canopy over them. "},{"num":11,"verse":"He shall come and smite the land of Egypt, giving to the pestilence those who are doomed to the pestilence, to captivity those who are doomed to captivity, and to the sword those who are doomed to the sword. "},{"num":12,"verse":"He shall kindle a fire in the temples of the gods of Egypt; and he shall burn them and carry them away captive; and he shall clean the land of Egypt, as a shepherd cleans his cloak of vermin; and he shall go away from there in peace. "},{"num":13,"verse":"He shall break the obelisks of Heliop′olis which is in the land of Egypt; and the temples of the gods of Egypt he shall burn with fire.’”"}]