[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:11-14 The law is not too high for thee. It is not only known afar off; it is not confined to men of learning. It is written in thy books, made plain, so that he who runs may read it. It is in thy mouth, in the tongue commonly used by thee, in which thou mayest hear it read, and talk of it among thy children. It is delivered so that it is level to the understanding of the meanest. This is especially true of the gospel of Christ, to which the apostle applies it. But the word is nigh us, and Christ in that word; so that if we believe with the heart, that the promises of the Messiah are fulfilled in our Lord Jesus, and confess them with our mouth, we then have Christ with us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The paraphrase of this verse in the Jerusalem Targum is noteworthy, and should be compared with Paul's rendering in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"Neither is the law beyond the great sea, that thou shouldest say, Oh that we had one like Jonah the prophet who could descend into the depths of the sea and bring it to us!\"",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "De 30:11-14. The Commandment Is Manifest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11-14. For this commandment … is not hidden … neither is it far off—That law of loving and obeying God, which was the subject of Moses' discourse, was well known to the Israelites. They could not plead ignorance of its existence and requirements. It was not concealed as an impenetrable mystery in heaven, for it had been revealed; nor was it carefully withheld from the people as a dangerous discovery; for the youngest and humblest of them were instructed in those truths, which were subjects of earnest study and research among the wisest and greatest of other nations. They were not under a necessity of undertaking long journeys or distant voyages, as many ancient sages did in quest of knowledge. They enjoyed the peculiar privilege of a familiar acquaintance with it. It was with them a subject of common conversation, engraven on their memories, and frequently explained and inculcated on their hearts. The apostle Paul (Ro 10:6-8) has applied this passage to the Gospel, for the law of Christ is substantially the same as that of Moses, only exhibited more clearly in its spiritual nature and extensive application; and, accompanied with the advantages of Gospel grace, it is practicable and easy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither is it beyond the sea:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the knowledge of this commandment is not to be fetched from far distant places, to which divers of the wise heathens travelled for their wisdom, but it was brought to thy very doors and ears, and declared to thee in this wilderness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Neither is it beyond the sea,.... There is no need to travel into foreign parts, into transmarine countries for it, as the Heathen philosophers did to get knowledge; for the Gospel is ordered to be preached to all the world, and sent into all nations; and at the time of the conversion of the Jews the earth will be filled with the knowledge of it, as the waters cover the sea; so that there will be no need to go into distant countries for it; nor any occasion ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou shouldest say, who shall go over the sea for us, and bring it unto us, that we may hear it, and do it? which would be all one as to desire \"to bring up Christ again from the dead\"; when he is already risen, and is gone to heaven, where he ever lives to make intercession for us; is thereby declared to be the Son of God with power, and is discharged as the surety of his people, having done completely what he engaged to do; and is risen for their justification, and become the firstfruits of the resurrection of the dead; wherefore whoever confesses with his mouth, and believes with his heart, that God has raised him from the dead, that is enough, he shall be saved: what a sublime sense of the words is this the apostle gives and how puerile is that of the Chaldee paraphrast in comparison of it! See Gill on Romans 10:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that thou shouldest say, who shall go over the sea for us, and bring it unto us, that we may hear it, and do it? which would be all one as to desire \"to bring up Christ again from the dead\"; when he is already risen, and is gone to heaven, where he ever lives to make intercession for us; is thereby declared to be the Son of God with power, and is discharged as the surety of his people, having done completely what he engaged to do; and is risen for their justification, and become the firstfruits of the resurrection of the dead; wherefore whoever confesses with his mouth, and believes with his heart, that God has raised him from the dead, that is enough, he shall be saved: what a sublime sense of the words is this the apostle gives and how puerile is that of the Chaldee paraphrast in comparison of it! See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 10:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Neither is it beyond the {i} sea, that thou shouldest say, Who shall go over the sea for us, and bring it unto us, that we may hear it, and do it?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Neither ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it beyond the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sea, that thou shouldest say, Who shall go over the sea for us, and bring it unto us, that we may hear it, and do it?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) By heaven and the sea he means places most far distant.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Neither … beyond the sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Nor has Israel to search for it among other peoples.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Deuteronomy 30:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fulfilment of this condition is not impossible, nor really very difficult. This natural though leads to the motive, which Moses impresses upon the hearts of the people in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:11-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz., that He might turn the blessing to them. God had done everything to render the observance of His commandments possible to Israel. \"This commandment\" (used as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to denote the whole law) is \"not too wonderful for thee,\" i.e., is not too hard to grasp, or unintelligible (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 17:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), nor is it too far off: it is neither in heaven, i.e., at an inaccessible height; nor beyond the sea, i.e., at an unattainable distance, at the end of the world, so that any one could say, Who is able to fetch it thence? but it is very near thee, in thy mouth and in thy heart to do it. It not only lay before the people in writing, but it was also preached to them by word of mouth, and thus brought to their knowledge, so that it had become a subject of conversation as well as of reflection and careful examination. But however near the law had thus been brought to man, sin had so estranged the human heart from the word of God, that doing and keeping the law had become invariably difficult, and in fact impossible; so that the declaration, \"the word is in thy heart,\" only attains its full realization through the preaching of the gospel of the grace of God, and the righteousness that is by faith; and to this the Apostle Paul applies the passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]