[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 30:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And shalt return unto the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Here is a further description of true repentance. It is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "returning unto ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the Lord, in humiliation, shame, and sorrow, and yet with confidence in him, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "with a fixed purpose of obeying him universally and heartily in future. This the Jews did, as a nation, in some measure, after they were carried captive to Babylon, since which time we read nothing of their idolatry. But they degenerated into other sins, which made them reject the Messiah when he was sent to them, for which they are punished to this day, and will be till they repent and be converted, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:23-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:1-10 In this chapter is a plain intimation of the mercy God has in store for Israel in the latter days. This passage refers to the prophetic warnings of the last two chapters, which have been mainly fulfilled in the destruction of Jerusalem by the Romans, and in their dispersion to the present day; and there can be no doubt that the prophetic promise contained in these verses yet remain to come to pass. The Jewish nation shall in some future period, perhaps not very distant, be converted to the faith of Christ; and, many think, again settled in the land of Canaan. The language here used is in a great measure absolute promises; not merely a conditional engagement, but declaring an event assuredly to take place. For the Lord himself here engages to circumcise their hearts; and when regenerating grace has removed corrupt nature, and Divine love has supplanted the love of sin, they certainly will reflect, repent, return to God, and obey him; and he will rejoice in doing them good. The change that will be wrought upon them will not be only outward, or consisting in mere opinions; it will reach to their souls. It will produce in them an utter hatred of all sin, and a fervent love to God, as their reconciled God in Christ Jesus; they will love him with all their hearts, and with all their soul. They are very far from this state of mind at present, but so were the murderers of the Lord Jesus, on the day of Pentecost; who yet in one hour were converted unto God. So shall it be in the day of God's power; a nation shall be born in a day; the Lord will hasten it in his time. As a conditional promise this passage belongs to all persons and all people, not to Israel only; it assures us that the greatest sinners, if they repent and are converted, shall have their sins pardoned, and be restored to God's favour.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The rejection of Israel and the desolation of the promised inheritance were not to be the end of God's dispensations. The closing words of the address therefore are words of comfort and promise. Compare marginal reference and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:46-50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The chastisements of God would lead the nation to repent, and thereupon God would again bless them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The chastisements of God would lead the nation to repent, and thereupon God would again bless them.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 30",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "De 30:1-10. Great Mercies Promised unto the Penitent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-10. when all these things are come upon thee, … and thou shalt return … then the Lord thy God will turn thy captivity—The hopes of the Hebrew people are ardently directed to this promise, and they confidently expect that God, commiserating their forlorn and fallen condition, will yet rescue them from all the evils of their long dispersion. They do not consider the promise as fulfilled by their restoration from the captivity in Babylon, for Israel was not then scattered in the manner here described—\"among all the nations,\" \"unto the utmost parts of heaven\" (De 30:4). When God recalled them from that bondage, all the Israelites were not brought back. They were not multiplied above their fathers (De 30:5), nor were their hearts and those of their children circumcised to love the Lord (De 30:6). It is not, therefore, of the Babylonish captivity that Moses was speaking in this passage; it must be of the dispersed state to which they have been doomed for eighteen hundred years. This prediction may have been partially accomplished on the return of the Israelites from Babylon; for, according to the structure and design of Scripture prophecy, it may have pointed to several similar eras in their national history; and this view is sanctioned by the prayer of Nehemiah (Ne 1:8, 9). But undoubtedly it will receive its full and complete accomplishment in the conversion of the Jews to the Gospel of Christ. At the restoration from the Babylonish captivity, that people were changed in many respects for the better. They were completely weaned from idolatry; and this outward reformation was a prelude to the higher attainments they are destined to reach in the age of Messiah, \"when the Lord God will circumcise their hearts and the hearts of their seed to love the Lord.\" The course pointed out seems clearly to be this: that the hearts of the Hebrew people shall be circumcised (Col 2:2); in other words, by the combined influences of the Word and spirit of God, their hearts will be touched and purified from all their superstition and unbelief. They will be converted to the faith of Jesus Christ as their Messiah—a spiritual deliverer, and the effect of their conversion will be that they will return and obey the voice (the Gospel, the evangelical law) of the Lord. The words may be interpreted either wholly in a spiritual sense (Joh 11:51, 52), or, as many think, in a literal sense also (Ro 11:1-36). They will be recalled from all places of the dispersion to their own land and enjoy the highest prosperity. The mercies and favors of a bountiful Providence will not then be abused as formerly (De 31:20; 32:15). They will be received in a better spirit and employed to nobler purposes. They will be happy, \"for the Lord will again rejoice over them for good, as He rejoiced over their fathers.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And shalt return unto the Lord thy God,.... By repentance, acknowledging their manifold sins and transgressions, particularly their disbelief and rejection of the Messiah, now seeking him and salvation by him; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shalt obey his voice; in the Gospel, yielding the obedience of faith to that; embracing the Gospel, and submitting to the ordinances of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "according to all that I command thee this day, thou, and thy children; which was to love the Lord, and walk in his ways, directed to in the Gospel, and which were to be regarded from a principle of love to God and the blessed Redeemer; see Deuteronomy 30:6, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "according to all that I command thee this day, thou, and thy children; which was to love the Lord, and walk in his ways, directed to in the Gospel, and which were to be regarded from a principle of love to God and the blessed Redeemer; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "with all thine heart and with all thy soul; that is, both their return unto the Lord, and their obedience to his voice or word, should be hearty and sincere; which being the case, the following things would be done for them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "with all thine heart and with all thy soul; that is, both their return unto the Lord, and their obedience to his voice or word, should be hearty and sincere; which being the case, the following things would be done for them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And shalt return unto the LORD thy God, and shalt obey his voice according to all that I command thee this day, thou and thy children, with all thine {b} heart, and with all thy soul;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shalt return unto the LORD thy God, and shalt obey his voice according to all that I command thee this day, thou and thy children, with all thine ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " heart, and with all thy soul;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) In true repentance there is no hypocrisy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Expansion of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:30",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And shalt return unto the Lord thy God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; retrain from the worship of false gods to worship and serve Jehovah the one true God, the God of their fathers, and the God whom as a nation they had before wet-shipped (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 1:8, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Deuteronomy 30:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"When all these words, the blessing and the curse which I have set before thee, shall come.\" The allusion to the blessing in this connection may be explained on the ground that Moses was surveying the future generally, in which not only a curse but a blessing also would come upon the nation, according to its attitude towards the Lord as a whole and in its several members, since even in times of the greatest apostasy on the part of the nation there would always be a holy seed which could not die out; because otherwise the nation would necessarily have been utterly and for ever rejected, whereby the promises of God would have been brought to nought, - a result which was absolutely impossible. \"And thou takest to heart among all nations,\" etc., sc., what has befallen thee - not only the curse which presses upon thee, but also the blessing which accompanies obedience to the commands of God, - \"and returnest to the Lord thy God, and hearkenest to His voice with all the heart,\" etc. (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); \"the Lord will turn thy captivity, and have compassion upon thee, and gather thee again.\" את־שׁבוּת שׁוּב does not mean to bring back the prisoners, as the more modern lexicographers erroneously suppose (the Kal שׁוּב never has the force of the Hiphil), but to turn the imprisonment, and that in a figurative sense, viz., to put an end to the distress (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 85:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 126:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 126:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), except that in many passages the misery of exile in which the people pined is represented as imprisonment. The passage before us is fully decisive against the meaning to bring back the prisoners, since the gathering out of the heathen is spoken of as being itself the consequence of the \"turning of the captivity;\" so also is ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the bringing back (השׁיב) is expressly distinguished from it. But especially is this the case with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where \"turning the captivity of Jacob's tents\" is synonymous with having mercy on his dwelling-places, and building up the city, again, so that the city lying in ruins is represented as שׁבוּת, an imprisonment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Hupfeld (on Psalm 14:7) has endeavoured to sustain the assertion that שׁבוּת is a later form for the older and simpler forms, שׁבי, שׁביה, by citing one single passage of the Old Testament. The abstract form of שׁבי is שׁבית, imprisonment (Numbers 21:29), then prisoners. This form has been substituted by Jeremiah for שׁבוּת in one passage, viz., Deuteronomy 32:44; and the Masoretic punctuators were the first to overlook the difference in the two words, and point them promiscuously.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Hupfeld (on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") has endeavoured to sustain the assertion that שׁבוּת is a later form for the older and simpler forms, שׁבי, שׁביה, by citing one single passage of the Old Testament. The abstract form of שׁבי is שׁבית, imprisonment (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 21:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), then prisoners. This form has been substituted by Jeremiah for שׁבוּת in one passage, viz., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the Masoretic punctuators were the first to overlook the difference in the two words, and point them promiscuously.)",
            "children": []
          }
        ]
      }
    ]
  }
]