[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 30:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the Lord; will circumcise thy heart — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Will by his word and Spirit change and purge thy heart from all thy idolatry and wickedness, and incline thy heart to love him. God will first convert and sanctify thee, the fruit whereof shall be, that thou shalt return and obey God’s commandments, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and then shalt prosper in all things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This promise principally respects the times of the gospel, and still remains to be accomplished, at least in the full sense; for, though after the Babylonish captivity they never returned to idolatry, yet they degenerated into endless superstitions and corruptions of heart, resting merely in the outward ceremonies of religion, without any sincere love to God and substantial piety. Hence they rejected the Son of God, preaching conversion of heart, regeneration, spiritual worship, and a kingdom ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not of this world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:1-10 In this chapter is a plain intimation of the mercy God has in store for Israel in the latter days. This passage refers to the prophetic warnings of the last two chapters, which have been mainly fulfilled in the destruction of Jerusalem by the Romans, and in their dispersion to the present day; and there can be no doubt that the prophetic promise contained in these verses yet remain to come to pass. The Jewish nation shall in some future period, perhaps not very distant, be converted to the faith of Christ; and, many think, again settled in the land of Canaan. The language here used is in a great measure absolute promises; not merely a conditional engagement, but declaring an event assuredly to take place. For the Lord himself here engages to circumcise their hearts; and when regenerating grace has removed corrupt nature, and Divine love has supplanted the love of sin, they certainly will reflect, repent, return to God, and obey him; and he will rejoice in doing them good. The change that will be wrought upon them will not be only outward, or consisting in mere opinions; it will reach to their souls. It will produce in them an utter hatred of all sin, and a fervent love to God, as their reconciled God in Christ Jesus; they will love him with all their hearts, and with all their soul. They are very far from this state of mind at present, but so were the murderers of the Lord Jesus, on the day of Pentecost; who yet in one hour were converted unto God. So shall it be in the day of God's power; a nation shall be born in a day; the Lord will hasten it in his time. As a conditional promise this passage belongs to all persons and all people, not to Israel only; it assures us that the greatest sinners, if they repent and are converted, shall have their sins pardoned, and be restored to God's favour.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Circumcise thine heart - Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 30",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "De 30:1-10. Great Mercies Promised unto the Penitent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-10. when all these things are come upon thee, … and thou shalt return … then the Lord thy God will turn thy captivity—The hopes of the Hebrew people are ardently directed to this promise, and they confidently expect that God, commiserating their forlorn and fallen condition, will yet rescue them from all the evils of their long dispersion. They do not consider the promise as fulfilled by their restoration from the captivity in Babylon, for Israel was not then scattered in the manner here described—\"among all the nations,\" \"unto the utmost parts of heaven\" (De 30:4). When God recalled them from that bondage, all the Israelites were not brought back. They were not multiplied above their fathers (De 30:5), nor were their hearts and those of their children circumcised to love the Lord (De 30:6). It is not, therefore, of the Babylonish captivity that Moses was speaking in this passage; it must be of the dispersed state to which they have been doomed for eighteen hundred years. This prediction may have been partially accomplished on the return of the Israelites from Babylon; for, according to the structure and design of Scripture prophecy, it may have pointed to several similar eras in their national history; and this view is sanctioned by the prayer of Nehemiah (Ne 1:8, 9). But undoubtedly it will receive its full and complete accomplishment in the conversion of the Jews to the Gospel of Christ. At the restoration from the Babylonish captivity, that people were changed in many respects for the better. They were completely weaned from idolatry; and this outward reformation was a prelude to the higher attainments they are destined to reach in the age of Messiah, \"when the Lord God will circumcise their hearts and the hearts of their seed to love the Lord.\" The course pointed out seems clearly to be this: that the hearts of the Hebrew people shall be circumcised (Col 2:2); in other words, by the combined influences of the Word and spirit of God, their hearts will be touched and purified from all their superstition and unbelief. They will be converted to the faith of Jesus Christ as their Messiah—a spiritual deliverer, and the effect of their conversion will be that they will return and obey the voice (the Gospel, the evangelical law) of the Lord. The words may be interpreted either wholly in a spiritual sense (Joh 11:51, 52), or, as many think, in a literal sense also (Ro 11:1-36). They will be recalled from all places of the dispersion to their own land and enjoy the highest prosperity. The mercies and favors of a bountiful Providence will not then be abused as formerly (De 31:20; 32:15). They will be received in a better spirit and employed to nobler purposes. They will be happy, \"for the Lord will again rejoice over them for good, as He rejoiced over their fathers.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord will circumcise thine heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the Lord will circumcise thine heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. will by his word and Spirit change and purge thy heart from all thine idolatry, and superstition, and wickedness, and incline thy heart ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to love him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as it here follows. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 10:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 10:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And so this is produced to show why and how those great things should be accomplished; God would first convert and sanctify them, the fruit whereof should be this, that they should return and obey God’s commandments, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 30:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 30:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and they should pros per in all things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 30:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 30:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vau",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is oft rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and notes the reason of a thing, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Kings 1:21 18:3,4 Psa 1:3 5:12 Isaiah 16:2 64:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 18:3,4 Psa 1:3 5:12 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 64:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And this promise principally respects the times of the gospel, and the grace which was to be then imparted to all God’s Israel by Christ, by whom alone this circumcision is obtained, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Colossians 2:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And so having fully described to them the law of God, the rule of their obedience, here and in foregoing chapters, and considering their great instability in the performance of their obedience to it, he now seasonably adds a glorious gospel promise, and directs their faith to the Messias by whom alone they could expect or receive the establishment of their hearts in the ways of God against apostacy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord thy God will circumcise thine heart, and the heart of thy seed,.... No mention is made of circumcision of the flesh, which will now be out of use with the Jews; they being fully convinced of the abrogation of the ceremonial law by the Messiah, whom they will now receive. It is spiritual circumcision only that is here spoken of, with which the Jews will be circumcised, when they shall be pricked and cut to the heart, and be thoroughly convinced of sin; when the iniquity of their hearts will be laid open to them, and they put to pain, and filled with shame and loathing for it; when the hardness of their hearts will be removed, and the foolishness of them will be exposed and taken away, and they will be made willing to part with their sins, and with their own righteousness; when the graces of the Spirit will be implanted in them, and the blood of Christ applied to them for pardon and cleansing. This is the circumcision made without hands, which is not of men, but of God; what he calls for, and exhorts unto, as being necessary, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; he here promises to do; and deed none but himself can do it; for he only can come at the hearts of men, to take anything out of them, or put anything into them; it is he that opens the heart, softens, quickens, enlightens, and purifies it: Baal Hatturim says this respects the times of the Messiah: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to love the Lord thy God with all thine heart, and with all thy soul; which, though the duty of every man, is performed by none but those that have the grace of God; there is no love to God in the heart before this inward and spiritual circumcision of it: it is a fruit of the Spirit in conversion when the affections are taken off of other things, and set on Christ; when a man sees his sin and his Saviour, and the one is odious, and the other precious; when the blessings of grace are applied, and the love of God is shed abroad in the heart, which cause love to God and Christ again: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou mayest live; spiritually and eternally; for there is no spiritual life in the soul till the heart is circumcised, or, in other words, regenerated and renewed; then it is quickened; then a man lives a life of faith on Christ, of holiness from him, communion with him, and has both an open right unto, and meetness for, eternal life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that thou mayest live; spiritually and eternally; for there is no spiritual life in the soul till the heart is circumcised, or, in other words, regenerated and renewed; then it is quickened; then a man lives a life of faith on Christ, of holiness from him, communion with him, and has both an open right unto, and meetness for, eternal life. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD thy God will {e} circumcise thine heart, and the heart of thy seed, to love the LORD thy God with all thine heart, and with all thy soul, that thou mayest live.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the LORD thy God will ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " circumcise thine heart, and the heart of thy seed, to love the LORD thy God with all thine heart, and with all thy soul, that thou mayest live.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) God will purge all your wicked affections, a thing that is not in your own power to do.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will circumcise thine heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in contrast ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that thou mayest live",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "for the sake of thy life",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 30:16; Deuteronomy 30:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", all ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see note), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", all Pl.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord will circumcise thine heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; \"when thou ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "wilt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " become better, God will help thereto (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")\" (Herxheimer). When Israel should return to the Lord, he would take away from them the evil heart of unbelief, and give them the new heart and the right spirit. \"Qui pravis affectibus renunciat is circumcisus corde dicitur\" (Rosenmüller. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; Ezekiel 36:26; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 2:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Deuteronomy 30:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord will then circumcise their heart, and the heart of their children (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so that they will love Him with all their heart. When Israel should turn with true humility to the Lord, He would be found of them, - would lead them to true repentance, and sanctify them through the power of His grace, - would take away the stony heart out of their flesh, and give them a heart of flesh, a new heart and a new spirit, - so that they should truly know Him and keep His commandments (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 36:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). \"Because of thy life,\" i.e., that thou mayest live, sc., attain to true life. The fulfilment of this promise does not take place all at once. It commenced with small beginnings at the deliverance from the Babylonian exile, and in a still higher degree at the appearance of Christ in the case of all the Israelites who received Him as their Saviour. Since then it has been carried on through all ages in the conversion of individual children of Abraham to Christ; and it will be realized in the future in a still more glorious manner in the nation at large (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The words of Moses do not relate to any particular age, but comprehend all times. For Israel has never been hardened and rejected in all its members, although the mass of the nation lives under the curse even to the present day.",
        "children": []
      }
    ]
  }
]