[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 30:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For good ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Whereas thou didst formerly receive these mercies for thy hurt, now thou shalt have them for thy good; thy heart shall be so changed that thou shalt not now abuse them, but employ them to the glory of God the giver. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Over thee for good — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To do thee good; as he did rejoice to destroy thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:1-10 In this chapter is a plain intimation of the mercy God has in store for Israel in the latter days. This passage refers to the prophetic warnings of the last two chapters, which have been mainly fulfilled in the destruction of Jerusalem by the Romans, and in their dispersion to the present day; and there can be no doubt that the prophetic promise contained in these verses yet remain to come to pass. The Jewish nation shall in some future period, perhaps not very distant, be converted to the faith of Christ; and, many think, again settled in the land of Canaan. The language here used is in a great measure absolute promises; not merely a conditional engagement, but declaring an event assuredly to take place. For the Lord himself here engages to circumcise their hearts; and when regenerating grace has removed corrupt nature, and Divine love has supplanted the love of sin, they certainly will reflect, repent, return to God, and obey him; and he will rejoice in doing them good. The change that will be wrought upon them will not be only outward, or consisting in mere opinions; it will reach to their souls. It will produce in them an utter hatred of all sin, and a fervent love to God, as their reconciled God in Christ Jesus; they will love him with all their hearts, and with all their soul. They are very far from this state of mind at present, but so were the murderers of the Lord Jesus, on the day of Pentecost; who yet in one hour were converted unto God. So shall it be in the day of God's power; a nation shall be born in a day; the Lord will hasten it in his time. As a conditional promise this passage belongs to all persons and all people, not to Israel only; it assures us that the greatest sinners, if they repent and are converted, shall have their sins pardoned, and be restored to God's favour.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Circumcise thine heart - Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 30",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "De 30:1-10. Great Mercies Promised unto the Penitent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-10. when all these things are come upon thee, … and thou shalt return … then the Lord thy God will turn thy captivity—The hopes of the Hebrew people are ardently directed to this promise, and they confidently expect that God, commiserating their forlorn and fallen condition, will yet rescue them from all the evils of their long dispersion. They do not consider the promise as fulfilled by their restoration from the captivity in Babylon, for Israel was not then scattered in the manner here described—\"among all the nations,\" \"unto the utmost parts of heaven\" (De 30:4). When God recalled them from that bondage, all the Israelites were not brought back. They were not multiplied above their fathers (De 30:5), nor were their hearts and those of their children circumcised to love the Lord (De 30:6). It is not, therefore, of the Babylonish captivity that Moses was speaking in this passage; it must be of the dispersed state to which they have been doomed for eighteen hundred years. This prediction may have been partially accomplished on the return of the Israelites from Babylon; for, according to the structure and design of Scripture prophecy, it may have pointed to several similar eras in their national history; and this view is sanctioned by the prayer of Nehemiah (Ne 1:8, 9). But undoubtedly it will receive its full and complete accomplishment in the conversion of the Jews to the Gospel of Christ. At the restoration from the Babylonish captivity, that people were changed in many respects for the better. They were completely weaned from idolatry; and this outward reformation was a prelude to the higher attainments they are destined to reach in the age of Messiah, \"when the Lord God will circumcise their hearts and the hearts of their seed to love the Lord.\" The course pointed out seems clearly to be this: that the hearts of the Hebrew people shall be circumcised (Col 2:2); in other words, by the combined influences of the Word and spirit of God, their hearts will be touched and purified from all their superstition and unbelief. They will be converted to the faith of Jesus Christ as their Messiah—a spiritual deliverer, and the effect of their conversion will be that they will return and obey the voice (the Gospel, the evangelical law) of the Lord. The words may be interpreted either wholly in a spiritual sense (Joh 11:51, 52), or, as many think, in a literal sense also (Ro 11:1-36). They will be recalled from all places of the dispersion to their own land and enjoy the highest prosperity. The mercies and favors of a bountiful Providence will not then be abused as formerly (De 31:20; 32:15). They will be received in a better spirit and employed to nobler purposes. They will be happy, \"for the Lord will again rejoice over them for good, as He rejoiced over their fathers.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Whereas thou didst formerly receive and enjoy these mercies for thy hurt, through thy own wicked and foolish heart, when thou wast full and fat, forgetting God, and kicking against him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 31:20 32:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 31:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 32:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", now thou shalt have them for thy good; thy heart shall be so changed by the grace of the gospel that thou shalt not now abuse them, but employ them to the more cheerful and faithful service of God, the giver of them. Rejoice over thee for good, i.e. to do thee good; as he did rejoice to destroy thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 28:63",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 28:63",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord thy God will make thee plenteous in every work of thine hand,.... In every manufacture, trade, or business of life in which they should be employed; the meaning is, that the Lord will greatly bless them in all that they shall set their hands to in a lawful way; so that they shall abound in good things, and have enough and to spare, a redundancy of the good things of life, great plenty of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in the fruit of thy body; abundance of children: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the fruit of thy cattle; a large increase of oxen and sheep: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the fruit of thy land for good; it being by the blessing of God on their labours restored to its former fertility, though now barren through want of inhabitants, and the slothfulness of those that are possessed of it; for travellers observe (o), the soil is still good, was it properly manured and cultivated: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord will again rejoice over thee for good, as he rejoiced over thy fathers; particularly in the days of Solomon and David, when the people of Israel enjoyed plenty of all good things, and so they will hereafter; see Hosea 2:15; The Targum of Jonathan is,\"the Word of the Lord will return to rejoice, &c.''See Jeremiah 32:41. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the Lord will again rejoice over thee for good, as he rejoiced over thy fathers; particularly in the days of Solomon and David, when the people of Israel enjoyed plenty of all good things, and so they will hereafter; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; The Targum of Jonathan is,\"the Word of the Lord will return to rejoice, &c.''See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) See Shaw's Travels, p. 336. Ed. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) See Shaw's Travels, p. 336. Ed. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD thy God will make thee plenteous in every work of thine hand, in the fruit of thy body, and in the fruit of thy cattle, and in the fruit of thy land, for good: for the LORD will again {g} rejoice over thee for good, as he rejoiced over thy fathers:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the LORD thy God will make thee plenteous in every work of thine hand, in the fruit of thy body, and in the fruit of thy cattle, and in the fruit of thy land, for good: for the LORD will again ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rejoice over thee for good, as he rejoiced over thy fathers:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) He does not mean that God is subject to these passions, to rejoice, or to be sad: but he uses this manner of speech to declare the love that he has for us.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Deuteronomy 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a repetition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Lord will rejoice again over Israel, to do them good (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as He had rejoiced over their fathers. The fathers are not the patriarchs alone, but all the pious ancestors of the people.",
        "children": []
      }
    ]
  }
]