[{"header":"Final Warnings and Greetings"},{"num":13,"verse":"This will be my third time to visit you. And remember, “For every complaint there must be two or three people to say that they know it is true.”"},{"num":2,"verse":"When I was with you the second time, I gave a warning to those who had sinned. I am not there now, but I am giving another warning to them and to anyone else who has sinned: When I come to you again, I will punish you."},{"num":3,"verse":"You want proof that Christ is speaking through me. My proof is that he is not weak in dealing with you but is showing his power among you."},{"num":4,"verse":"It is true that Christ was weak when he was killed on the cross, but he lives now by God’s power. It is also true that we share his weakness, but in dealing with you, we will be alive in him by God’s power."},{"num":5,"verse":"Look closely at yourselves. Test yourselves to see if you are living in the faith. Don’t you realize that Christ Jesus is in you? Of course, if you fail the test, he is not in you."},{"num":6,"verse":"But I hope you will see that we have not failed the test."},{"num":7,"verse":"We pray to God that you will not do anything wrong. Our concern here is not for people to see that we have passed the test in our work with you. Our main concern is that you do what is right, even if it looks as if we have failed the test."},{"num":8,"verse":"We cannot do anything that is against the truth but only what promotes the truth."},{"num":9,"verse":"We are happy to be weak if you are strong. And this is what we pray—that your lives will be made completely right again."},{"num":10,"verse":"I’m writing this before I come so that when I am there I will not have to use my authority to punish you. The Lord gave me that authority to make you stronger, not to destroy you."},{"num":11,"verse":"Now, brothers and sisters, be filled with joy. Try to make everything right, and do what I have asked you to do. Agree with each other, and live in peace. Then the God of love and peace will be with you."},{"num":12,"verse":"Give each other the special greeting of God’s people. All of God’s holy people here send you their greetings."},{"num":13,"verse":"I pray that you will enjoy the grace of the Lord Jesus Christ, the love of God, and the fellowship of the Holy Spirit."}]