[{"header":"Parables For Sinners And Pharisees"},{"num":15,"verse":"Now all the tax-collectors and the sinners were drawing-near to Him to hear Him. "},{"num":2,"verse":"And both the Pharisees and the scribes were grumbling, saying that “This One is welcoming sinners and eating with them”."},{"header":"The Lost Sheep And Lost Coin: Heaven Rejoices When a Sinner Repents"},{"num":3,"verse":"And He spoke this parable to them, saying "},{"num":4,"verse":"“What man from-among you having a hundred sheep and having lost one of them, does not leave-behind the ninety nine in the wilderness and proceed after the one having become-lost until he finds it? "},{"num":5,"verse":"And having found it, he puts it on his shoulders, rejoicing. "},{"num":6,"verse":"And having come to the house, he calls-together his friends and neighbors, saying to them, ‘Rejoice-with me, because I found my lost sheep!’ "},{"num":7,"verse":"I say to you that in this manner there will be joy in heaven over one sinner repenting more-than over ninety nine righteous ones who have no need of repentance. "},{"num":8,"verse":"Or what woman having ten drachmas, if she loses one drachma, does not light a lamp and sweep the house and seek carefully until which time she finds it ? "},{"num":9,"verse":"And having found it, she calls together her women friends and neighbors, saying, ‘Rejoice-with me, because I found the drachma which I lost!’ "},{"num":10,"verse":"In this manner, I say to you, joy comes-about in the presence of the angels of God over one sinner repenting”."},{"header":"The Prodigal Son: The Father Rejoices When His Lost Son Returns"},{"num":11,"verse":"And He said, “A certain man had two sons. "},{"num":12,"verse":"And the younger of them said to his father, ‘Father, give me the part of your substance falling to me’. And the one distributed his property to them. "},{"num":13,"verse":"And after not many days, having gathered together everything, the younger son went-on-a-journey to a distant country. And there he squandered his substance living wildly. "},{"num":14,"verse":"And he having spent everything, a severe famine came about in relation to that country, and he began to be-in-need. "},{"num":15,"verse":"And having gone, he joined himself to one of the citizens of that country. And he sent him into his fields to feed pigs. "},{"num":16,"verse":"And he was desiring to be filled-to-satisfaction with the carob-pods which the pigs were eating. And no one was giving anything to him. "},{"num":17,"verse":"But having come to himself, he said, ‘How many hired-workers of my father are abounding with bread, but I am perishing here in a famine! "},{"num":18,"verse":"Having arisen, I will proceed to my father and say to him, “Father, I sinned against heaven and in your sight. "},{"num":19,"verse":"I am no longer worthy to be called your son. Make me as one of your hired-workers”’. "},{"num":20,"verse":"And having arisen, he went to his father. But he still being far distant, his father saw him and felt-deep-feelings [of love]. And having run, he fell upon his neck and kissed him. "},{"num":21,"verse":"And the son said to him, ‘Father, I sinned against heaven and in your sight. I am no longer worthy to be called your son’. "},{"num":22,"verse":"But the father said to his slaves, ‘Quickly, bring-out the best robe and put it on him. And give him a ring for his hand and sandals for the feet. "},{"num":23,"verse":"And bring the fatted calf. Slaughter it. And having eaten, let us celebrate! "},{"num":24,"verse":"Because this son of mine was dead, and he became-alive-again. He had become-lost, and he was found’. And they began to celebrate."},{"header":"The Older Brother Is Angered By His Father’s Joy"},{"num":25,"verse":"“Now his older son was in the field. And when while coming he drew-near to the house, he heard music and dancing. "},{"num":26,"verse":"And having summoned one of the servants, he was inquiring as to what these things might be. "},{"num":27,"verse":"And the one said to him that ‘Your brother has come. And your father slaughtered the fatted calf because he received him back being healthy’. "},{"num":28,"verse":"And he became-angry, and was not willing to go in. And his father, having come out, was appealing-to him. "},{"num":29,"verse":"But the one, having responded, said to his father, ‘Behold— I am slaving for you for so many years, and I never disregarded your command. And you never gave me a goat in order that I might celebrate with my friends. "},{"num":30,"verse":"But when this son of yours came— the one having devoured your property with prostitutes— you slaughtered the fatted calf for him!’ "},{"num":31,"verse":"And the one said to him, ‘Child, you are always with me, and all my things are yours. "},{"num":32,"verse":"But it-was-necessary to celebrate and rejoice, because this brother of yours was dead, and he became-alive. And he had become-lost, and he was found’”."}]