[{"num":15,"verse":"Now all the mochesim (taxcollectors) and the chote’im (sinners) were coming near Rebbe, Melech HaMoshiach to listen to him."},{"num":2,"verse":"And both the Perushim and the Sofrim were grumbling, saying, This one gives a kabbalat panim reception to chote’im (sinners) and eats at tish with them."},{"num":3,"verse":"And Rebbe, Melech HaMoshiach told them this mashal, saying,"},{"num":4,"verse":"What man of you, if he has meah kevasim (a hundred sheep) and has lost from them one, does not leave the tishim vteshah (ninety-nine) in the open pasture, and go for the one which has been lost until he finds it?"},{"num":5,"verse":"And when he has found it, he puts it on his shoulders with lev same’ach. [TEHILLIM 23;119; YIRMEYAH 31:10; YECHEZKEL 34:11-16]"},{"num":6,"verse":"And when he returns to his bais, he calls together his chaverim and his shchenim (neighbors), saying to them, Make a simcha with me, because I have found my keves (sheep), the one that was lost!"},{"num":7,"verse":"I say to you that in the same way there will be more simcha in Shomayim over one choteh (sinner) who becomes a baal teshuva than over tishim vteshah tzaddikim who have no need of teshuva."},{"num":8,"verse":"Or what isha having asaret (ten) drachmas, if she loses one drachma, will not light a licht (light) and sweep the bais and search carefully until she finds it?"},{"num":9,"verse":"And having found it, she calls together chaverim and shchenim saying, Have simcha with me, for I have found the drachma which I lost."},{"num":10,"verse":"In the same way, I say to you, there is simcha in the presence of the malachim Hashem over one choteh (sinner) who becomes a baal teshuva."},{"num":11,"verse":"And Rebbe, Melech HaMoshiach said, A certain ben Adam had shnei banim (two sons)."},{"num":12,"verse":"And the younger of them said to his Abba, Avi, give to me the share of the estate that falls to me. And his Abba divided his wealth between them."},{"num":13,"verse":"And not many yamim later, having gathered together everything, the younger ben went on a journey to a far away country, and there he squandered his osher (riches) with gilui arayot (sexual immorality) and loose living. [YESHAYAH 59:2]"},{"num":14,"verse":"And when he had spent everything, there came a severe ra’av (famine) throughout that aretz, and he began to be nitzrach (needy)."},{"num":15,"verse":"And he went and became associated with one of the citizens of that aretz, and he sent him into his fields to feed chazirim, [VAYIKRA 11:7]"},{"num":16,"verse":"And he was longing to fill his mogen (stomach) with the pods which the chazirim were eating, and no one was giving anything to him."},{"num":17,"verse":"When he came to his senses, his seichel told him, How many of my Abba’s sachirim (hired workers) have more than enough okhel (food) and I am perishing here with hunger."},{"num":18,"verse":"I will get up and go to my Abba, and I will say, Avi, I sinned against Shomayim and in your sight. [VAYIKRA 26:40; TEHILLIM 51:6(4)]"},{"num":19,"verse":"I no longer have the zchus (merit) worthy to be called a ben of my Abba. Make me as one of your sachirim (hired workers)."},{"num":20,"verse":"And when he got up he came home to his own Abba. And while he was still a long way off, his Abba saw him, and was filled with rachmei Shomayim (heavenly mercy, compassion) and tears, and fell upon his neck and kissed him. [Gn 45:14]"},{"num":21,"verse":"And bno said to the Abba, Avi, I sinned against Shomayim and in your sight. No longer do I have the zchus (merit) to be worthy to be called your ben. [Psa 51:6(4)]"},{"num":22,"verse":"But his Abba said to his avadim, Shnel! (Quick!) Bring out the best kaftan and clothe him, and put a ring on his hand and sandals for his feet, [ZECHARYAH 3:4; BERESHIS 41:42]"},{"num":23,"verse":"And bring the fattened calf, and slaughter it, and let us eat and have a simcha,"},{"num":24,"verse":"Because this ben of mine was dead and now he has returned l’Chayyim! He had been lost and now he is found. And they began to make a simcha."},{"num":25,"verse":"But the Abba’s alterer ben (older son) was in the sadeh (field). And as he was coming, he drew near to the bais, and he heard the zemirot (table songs), and the sound of the klezmer (musician) and the [chasidic] dancing,"},{"num":26,"verse":"And having summoned one of the avadim (servants), the alterer ben (older son) was inquiring what these things might be."},{"num":27,"verse":"And the eved said to him, Your ach is present, and your Abba sacrificed the fattened calf, because your Abba received him back bari v’shalem (safe and sound)."},{"num":28,"verse":"And the alterer ben was filled with ka’as (anger), and he did not want to enter. But his Abba came out and was pleading with him."},{"num":29,"verse":"But in reply the alterer ben said to his Abba, Hinei, so many years I serve you and never a mitzvah of you I disobeyed, and never for me did you give even a young goat that with my chaverim I might make a simcha."},{"num":30,"verse":"But when shows up this ben of yours, the one having devoured your property with zonot (prostitutes), you sacrificed for him the fattened calf. [MISHLE 29:3]"},{"num":31,"verse":"And the Abba said to him, Beni, you are always with me, and everything which is mine is yours."},{"num":32,"verse":"But now it was necessary for us to have lev samei’ach and make a simcha, because the ach of you was dead and he has returned lChayyim! He has been lost and now is found. [MALACHI 3:17]"}]