[{"header":"The Parable of the Lost Lamb"},{"num":15,"verse":"Many dishonest tax collectors and other notorious sinners often gathered around to listen as Jesus taught the people. "},{"num":2,"verse":"This raised concerns among the Jewish religious leaders and experts of the law. Indignant, they grumbled and complained, saying, “Look at how this man associates with all these notorious sinners and welcomes them all to come to him!” "},{"num":3,"verse":"In response, Jesus gave them this illustration: "},{"num":4,"verse":"“There once was a shepherd with a hundred lambs, but one of his lambs wandered away and was lost. So the shepherd left the ninety-nine lambs out in the open field and searched in the wilderness for that one lost lamb. He didn’t stop until he finally found it. With exuberant joy, he raised it up, placed it on his shoulders, and carried it back with cheerful delight! "},{"num":6,"verse":"Returning home, he called all his friends and neighbors together and said, ‘Let’s have a party! Come and celebrate with me the return of my lost lamb. It wandered away, but I found it and brought it home.’ ”"},{"num":7,"verse":"Jesus continued, “In the same way, there will be a glorious celebration in heaven over the rescue of one lost sinner who repents, comes back home, and returns to the fold—more so than for all the righteous people who never strayed away.”"},{"header":"The Parable of the Lost Coin"},{"num":8,"verse":"Jesus gave them another parable: “There once was a woman who had ten valuable silver coins. When she lost one of them, she swept her entire house, diligently searching every nook and cranny for that one lost coin. "},{"num":9,"verse":"When she finally found it, she gathered all her friends and neighbors for a celebration, telling them, ‘Come and celebrate with me! I had lost my precious silver coin, but now I’ve found it.’ "},{"num":10,"verse":"That’s the way God responds every time one lost sinner repents and turns to him. He says to all his angels, ‘Let’s have a joyous celebration, for the one who was lost, I have found!’ ”"},{"header":"The Loving Father"},{"num":11,"verse":"Then Jesus said, “Once there was a father with two sons. "},{"num":12,"verse":"The younger son came to his father and said, ‘Father, don’t you think it’s time to give me my share of your estate?’ So the father went ahead and distributed between the two sons their inheritance. "},{"num":13,"verse":"Shortly afterward, the younger son packed up all his belongings and traveled off to see the world. He journeyed to a far-off land where he soon wasted all he was given in a binge of extravagant and reckless living."},{"num":14,"verse":"“With everything spent and nothing left, he grew hungry, because there was a severe famine in that land. "},{"num":15,"verse":"So he begged a farmer in that country to hire him. The farmer hired him and sent him out to feed the pigs. "},{"num":16,"verse":"The son was so famished, he was willing even to eat the slop given to the pigs, because no one would feed him a thing."},{"num":17,"verse":"“Humiliated, the son finally realized what he was doing, and he thought, ‘There are many workers at my father’s house who have all the food they want with plenty to spare. They lack nothing. Why am I here dying of hunger, feeding these pigs and eating their slop? "},{"num":18,"verse":"I want to go back home to my father’s house, and I’ll say to him, “Father, I was wrong. I have sinned against you. "},{"num":19,"verse":"I’ll never again be worthy to be called your son. Please, Father, just treat me like one of your employees.” ’"},{"num":20,"verse":"“So the young son set off for home. From a long distance away, his father saw him coming, dressed as a beggar, and great compassion swelled up in his heart for his son who was returning home. The father raced out to meet him, swept him up in his arms, hugged him dearly, and kissed him over and over with tender love."},{"num":21,"verse":"“Then the son said, ‘Father, I was wrong. I have sinned against you. I could never deserve to be called your son. Just let me be—’"},{"num":22,"verse":"“Turning to his servants, the father said, ‘Quick, bring me the best robe, my very own robe, and I will place it on his shoulders. Bring the ring, the seal of sonship, and I will put it on his finger. And bring out the best shoes you can find for my son. "},{"num":23,"verse":"Let’s prepare a great feast and celebrate. "},{"num":24,"verse":"For my beloved son was once dead, but now he’s alive! Once he was lost, but now he is found!’ And everyone celebrated with overflowing joy."},{"num":25,"verse":"“Now, the older son was out working in the field when his brother returned, and as he approached the house, he heard the music of celebration and dancing. "},{"num":26,"verse":"He called over one of the servants and asked, ‘What’s going on?’"},{"num":27,"verse":"“The servant replied, ‘It’s your younger brother. He’s returned home and your father is throwing a party to celebrate his homecoming.’"},{"num":28,"verse":"“The older son became angry and refused to go in and celebrate. So his father came out and pleaded with him, ‘Come and enjoy the feast with us!’"},{"num":29,"verse":"“The son said, ‘Father, listen! How many years have I worked like a slave for you, performing every duty you’ve asked as a faithful son? And I’ve never once disobeyed you. But you’ve never thrown a party for me because of my faithfulness. Never once have you even given me a goat that I could feast on and celebrate with my friends as this son of yours is doing now. "},{"num":30,"verse":"Look at him! He comes back after wasting your wealth on prostitutes and reckless living, and here you are throwing a great feast to celebrate—for him!’"},{"num":31,"verse":"“The father said, ‘My son, you are always with me by my side. Everything I have is yours to enjoy. "},{"num":32,"verse":"It’s only right to rejoice and celebrate like this, because your brother was once dead and gone, but now he is alive and back with us again. He was lost, but now he is found!’ ”"}]