[{"header":"The Vision of the Lord’s Glory"},{"num":1,"verse":"In the thirtieth year, in the fourth month, on the fifth day of the month, as I was among the captives by the river of Kebar, the heavens were opened and I saw visions of God."},{"num":2,"verse":"On the fifth day of the month, which was the fifth year of the captivity of King Jehoiachin, "},{"num":3,"verse":"the word of the Lord came expressly to Ezekiel the priest, the son of Buzi, in the land of the Chaldeans by the River Kebar. And the hand of the Lord was on him there."},{"num":4,"verse":"As I looked, a whirlwind came out of the north, a great cloud with fire flashing forth continually, and a brightness was all around it, and in its midst something as glowing metal in the midst of the fire. "},{"num":5,"verse":"Also out of the midst came the likeness of four living creatures. And this was their appearance: They had the likeness of a man. "},{"num":6,"verse":"Every one had four faces, and every one had four wings. "},{"num":7,"verse":"Their legs were straight and the soles of their feet were like the sole of a calf’s hoof. And they gleamed like the color of burnished bronze. "},{"num":8,"verse":"They had the hands of a man under their wings on their four sides. As for the faces and wings of the four of them, "},{"num":9,"verse":"their wings were joined to one another. Their faces did not turn when they went. Each went straight forward."},{"num":10,"verse":"As for the likeness of their faces, each had the face of a man, and all four had the face of a lion on the right side, and the face of an ox on the left side, and the face of an eagle. "},{"num":11,"verse":"Thus were their faces. And their wings were stretched upward. Two wings of every one were joined to one another, and two covered their bodies. "},{"num":12,"verse":"Each went straight forward. Wherever the spirit was to go, they would go and not turn as they went. "},{"num":13,"verse":"As for the likeness of the living creatures, their appearance was like burning coals of fire and like the appearance of lamps. It went up and down among the living creatures. And the fire was bright, and out of the fire went forth lightning. "},{"num":14,"verse":"The living creatures ran to and fro as the appearance of a flash of lightning."},{"num":15,"verse":"Now as I looked at the living creatures, one wheel was on the ground by the living creatures for each of the four faces. "},{"num":16,"verse":"The appearance of the wheels and their work was like the color of sparkling beryl. And all four of them had one likeness. And their appearance and their work was, as it were, a wheel in the middle of a wheel. "},{"num":17,"verse":"Whenever they went, they went in any of their four sides and did not turn as they went. "},{"num":18,"verse":"As for their rims, they were so high that they were dreadful. And the rims of all four of them were full of eyes all around."},{"num":19,"verse":"Whenever the living creatures went, the wheels went with them. And whenever the living creatures were lifted up from the ground, the wheels also were lifted up. "},{"num":20,"verse":"Wherever the spirit was about to go, they would go in that direction. And the wheels rose close beside them. For the spirit of the living creatures was in the wheels. "},{"num":21,"verse":"Whenever those went, these went. And whenever those stood still, these stood still. And whenever those rose from the ground, the wheels rose close beside them. For the spirit of the living creatures was in the wheels."},{"num":22,"verse":"The likeness of the expanse over the heads of the living creatures was as the awesome gleam of crystal, stretched out over their heads above. "},{"num":23,"verse":"Under the expanse their wings were stretched out straight, the one toward the other. Each one also had two wings which covered its body on the one side and the other. "},{"num":24,"verse":"When they went, I heard the noise of their wings, like the noise of abundant waters, as the voice of the Almighty, the noise of tumult as the noise of an army camp. Whenever they stood still, they let down their wings."},{"num":25,"verse":"There was a voice from the expanse that was over their heads whenever they stood still and let down their wings. "},{"num":26,"verse":"Above the expanse that was over their heads was the likeness of a throne, as the appearance of a sapphire stone. And on the likeness of the throne was the likeness as the appearance of a man on it high up. "},{"num":27,"verse":"Then I saw as glowing metal, as the appearance of fire all around within it, from the appearance of His loins and upward; and from the appearance of His loins and downward I saw as it were the appearance of fire, and there was a brightness around Him. "},{"num":28,"verse":"As the appearance of the rainbow that is in the cloud on a day of rain, so was the appearance of the brightness all around."}]