[{"header":"Chapter 1"},{"num":1,"verse":"The Vision: God on the Cherubim. In the thirtieth year, on the fifth day of the fourth month, while I was among the exiles by the river Chebar, the heavens opened, and I saw divine visions.— "},{"num":2,"verse":"On the fifth day of the month—this was the fifth year of King Jehoiachin’s exile— "},{"num":3,"verse":"the word of the Lord came to the priest Ezekiel, the son of Buzi, in the land of the Chaldeans by the river Chebar. There the hand of the Lord came upon him."},{"num":4,"verse":"As I watched, a great stormwind came from the North, a large cloud with flashing fire, a bright glow all around it, and something like polished metal gleamed at the center of the fire. "},{"num":5,"verse":"From within it figures in the likeness of four living creatures appeared. This is what they looked like: "},{"num":6,"verse":"They were in human form, but each had four faces and four wings, "},{"num":7,"verse":"and their legs were straight, the soles of their feet like the hooves of a bull, gleaming like polished brass. "},{"num":8,"verse":"Human hands were under their wings, and the wings of one touched those of another. "},{"num":9,"verse":"Their faces and their wings looked out on all their four sides; they did not turn when they moved, but each went straight ahead."},{"num":10,"verse":"Their faces were like this: each of the four had a human face, and on the right the face of a lion, and on the left, the face of an ox, and each had the face of an eagle. "},{"num":11,"verse":"Such were their faces. Their wings were spread out above. On each one, two wings touched one another, and the other two wings covered the body. "},{"num":12,"verse":"Each went straight ahead. Wherever the spirit would go, they went; they did not change direction when they moved. "},{"num":13,"verse":"And the appearance of the living creatures seemed like burning coals of fire. Something indeed like torches moved back and forth among the living creatures. The fire gleamed intensely, and from it lightning flashed. "},{"num":14,"verse":"The creatures darting back and forth flashed like lightning."},{"num":15,"verse":"As I looked at the living creatures, I saw wheels on the ground, one alongside each of the four living creatures. "},{"num":16,"verse":"The wheels and their construction sparkled like yellow topaz, and all four of them looked the same: their construction seemed as though one wheel was inside the other. "},{"num":17,"verse":"When they moved, they went in any of the four directions without veering as they moved. "},{"num":18,"verse":"The four of them had rims, high and fearsome—eyes filled the four rims all around. "},{"num":19,"verse":"When the living creatures moved, the wheels moved with them; and when the living creatures were raised from the ground, the wheels also were raised. "},{"num":20,"verse":"Wherever the spirit would go, they went. And they were raised up together with the living creatures, for the spirit of the living creatures was in the wheels. "},{"num":21,"verse":"Wherever the living creatures moved, the wheels moved; when they stood still, the wheels stood still. When they were lifted up from the earth, the wheels were lifted up with them. For the spirit of the living creatures was in the wheels."},{"num":22,"verse":"Above the heads of the living creatures was a likeness of the firmament; it was awesome, stretching upwards like shining crystal over their heads. "},{"num":23,"verse":"Beneath the firmament their wings stretched out toward one another; each had two wings covering the body. "},{"num":24,"verse":"Then I heard the sound of their wings, like the roaring of mighty waters, like the voice of the Almighty. When they moved, the sound of the tumult was like the din of an army. And when they stood still, they lowered their wings. "},{"num":25,"verse":"While they stood with their wings lowered, a voice came from above the firmament over their heads."},{"num":26,"verse":"Above the firmament over their heads was the likeness of a throne that looked like sapphire; and upon this likeness of a throne was seated, up above, a figure that looked like a human being. "},{"num":27,"verse":"And I saw something like polished metal, like the appearance of fire enclosed on all sides, from what looked like the waist up; and from what looked like the waist down, I saw something like the appearance of fire and brilliant light surrounding him. "},{"num":28,"verse":"Just like the appearance of the rainbow in the clouds on a rainy day so was the appearance of brilliance that surrounded him. Such was the appearance of the likeness of the glory of the Lord. And when I saw it, I fell on my face and heard a voice speak."}]