[{"num":1,"verse":"When I was thirty years old, I was living near the Chebar Canal off the Euphrates River among the exiles. On the fifth day of the fourth month (during the fifth year of King Jehoiachin’s exile), the windows of the heavens were thrown open and I saw visions of the True God."},{"num":3,"verse":"The word of the Eternal One came to Ezekiel the priest (Buzi’s son) near the Chebar Canal in the land of the Chaldeans. It was there that the hand of the Eternal settled on him."},{"num":4,"verse":"I looked up, and I saw a ferocious and stormy wind coming from the north—a monstrous cloud filled with the constant dance of lightning, surrounded by a glowing, all-encompassing light. At the center of the lightning flashes was something that looked like gleaming metal, "},{"num":5,"verse":"and within that otherworldly scene were what looked like four living creatures. The creatures had a form that resembled humans, "},{"num":6,"verse":"but they each had four faces and four wings. "},{"num":7,"verse":"Their legs were straight like the pillars of a temple, and their feet looked like the hoofs of a calf and shimmered in the firelight like polished bronze. "},{"num":8,"verse":"They had human hands on all four sides under each wing. All four of these living creatures had faces and wings, "},{"num":9,"verse":"and their wings touched one another. As they moved, they did not turn to the right or left; they all went straight ahead. "},{"num":10,"verse":"Each of the four creatures had four faces: a human face in front, the face of a lion on the right, the face of an ox on the left, and the face of an eagle in the back. "},{"num":11,"verse":"The features of their faces were similar. Two of the creatures’ wings stretched upward, and one wing on each side of each creature was touching the wing of the creature on either side of it. The other two wings covered each creature’s body. "},{"num":12,"verse":"All of the living creatures went straight ahead wherever the spirit directed them; the creatures moved without turning to the right or left. "},{"num":13,"verse":"The living creatures had an appearance of something that looked like burning charcoal. Untamed ribbons of fire darted back and forth among them. It was all very bright, and lightning bolted out of the glowing fire. "},{"num":14,"verse":"The living creatures ran back and forth like flashes of lightning."},{"num":15,"verse":"As I observed the living creatures with their four faces, I saw a wheel on the ground next to each of them. "},{"num":16,"verse":"The wheels glittered like sun-kissed jewels. All four wheels looked exactly alike, each appearing to have another wheel inside it. "},{"num":17,"verse":"As the wheels moved, they were able to go in the four directions the living creatures faced. They rolled straight ahead, never swerving off to the side. "},{"num":18,"verse":"The rims of the four wheels were tall and inspired fear, filled with eyes all around. "},{"num":19,"verse":"The wheels went wherever the living creatures went: when the living creatures moved, the wheels stayed right beside them; when the living creatures rose up from the ground, the wheels rose with them. "},{"num":20,"verse":"The living creatures went wherever the spirit directed, and the wheels stayed right beside them; for the spirit of the creatures directed the wheels. "},{"num":21,"verse":"When the creatures moved, so did the wheels; when the creatures stood still, so did the wheels; when the creatures rose up from the ground, so did the wheels, because the spirit of the four living creatures was in the wheels."},{"num":22,"verse":"Suspended above the living creatures was something like a broad expanse; it had an awesome gleam like a crystal ceiling and stretched wide over them. "},{"num":23,"verse":"Beneath the expanse, the creatures stretched out their wings toward each other, and each creature had another pair of wings it used to cover both sides of its body. "},{"num":24,"verse":"Whenever the creatures moved, I heard the violent fluttering of their wings, like roaring rapids, like the voice of God Almighty, like the sound of an army besieging a city. Whenever the creatures stopped, they lowered their wings to their sides. As they stood silent, with their wings lowered, a thunderous voice sounded high above the expanse over their heads."},{"num":26,"verse":"And above that expanse over their heads was something that looked like a throne made of sapphire. Sitting on that throne high above the earth was a humanlike figure. "},{"num":27,"verse":"From his waist up, I saw what looked to be glowing metal surrounded by an all-encompassing fire. Below his waist, I looked and saw something like a blazing fire. A glorious radiance was all around Him. "},{"num":28,"verse":"The glorious radiance resembled a rainbow that lights up the clouds on a rainy day. This was nothing less than the glory of the Eternal that appeared to me. When I saw the vision of the Eternal and His glory, I fell upon my face and heard a voice speaking to me."}]