[{"num":5,"verse":"So imitate God, as his dear children; "},{"num":2,"verse":"and live a life of love, just as also the Messiah loved us, indeed, on our behalf gave himself up as an offering, as a slaughtered sacrifice to God with a pleasing fragrance. "},{"num":3,"verse":"Among you there should not even be mentioned sexual immorality, or any kind of impurity, or greed; these are utterly inappropriate for God’s holy people. "},{"num":4,"verse":"Also out of place are obscenity and stupid talk or coarse language; instead, you should be giving thanks. "},{"num":5,"verse":"For of this you can be sure: every sexually immoral, impure or greedy person — that is, every idol-worshipper — has no share in the Kingdom of the Messiah and of God. "},{"num":6,"verse":"Let no one deceive you with empty talk; for it is because of these things that God’s judgment is coming on those who disobey him. "},{"num":7,"verse":"So don’t become partners with them!"},{"num":8,"verse":"For you used to be darkness; but now, united with the Lord, you are light. Live like children of light, "},{"num":9,"verse":"for the fruit of the light is in every kind of goodness, rightness and truth — "},{"num":10,"verse":"try to determine what will please the Lord. "},{"num":11,"verse":"Have nothing to do with the deeds produced by darkness, but instead expose them, "},{"num":12,"verse":"for it is shameful even to speak of the things these people do in secret. "},{"num":13,"verse":"But everything exposed to the light is revealed clearly for what it is, "},{"num":14,"verse":"since anything revealed is a light. This is why it says,"},{"num":15,"verse":"Therefore, pay careful attention to how you conduct your life — live wisely, not unwisely. "},{"num":16,"verse":"Use your time well, for these are evil days. "},{"num":17,"verse":"So don’t be foolish, but try to understand what the will of the Lord is."},{"num":18,"verse":"Don’t get drunk with wine, because it makes you lose control. Instead, keep on being filled with the Spirit — "},{"num":19,"verse":"sing psalms, hymns and spiritual songs to each other; sing to the Lord and make music in your heart to him; "},{"num":20,"verse":"always give thanks for everything to God the Father in the name of our Lord Yeshua the Messiah."},{"num":21,"verse":"Submit to one another in fear of the Messiah. "},{"num":22,"verse":"Wives should submit to their husbands as they do to the Lord; "},{"num":23,"verse":"because the husband is head of the wife, just as the Messiah, as head of the Messianic Community, is himself the one who keeps the body safe. "},{"num":24,"verse":"Just as the Messianic Community submits to the Messiah, so also wives should submit to their husbands in everything."},{"num":25,"verse":"As for husbands, love your wives, just as the Messiah loved the Messianic Community, indeed, gave himself up on its behalf, "},{"num":26,"verse":"in order to set it apart for God, making it clean through immersion in the mikveh, so to speak, "},{"num":27,"verse":"in order to present the Messianic Community to himself as a bride to be proud of, without a spot, wrinkle or any such thing, but holy and without defect. "},{"num":28,"verse":"This is how husbands ought to love their wives — like their own bodies; for the man who loves his wife is loving himself. "},{"num":29,"verse":"Why, no one ever hated his own flesh! On the contrary, he feeds it well and takes care of it, just as the Messiah does the Messianic Community, "},{"num":30,"verse":"because we are parts of his Body. "},{"num":31,"verse":"“Therefore a man will leave his father and mother and remain with his wife, and the two will become one.” "},{"num":32,"verse":"There is profound truth hidden here, which I say concerns the Messiah and the Messianic Community. "},{"num":33,"verse":"However, the text also applies to each of you individually: let each man love his wife as he does himself, and see that the wife respects her husband."}]