[{"header":"Living in the Light"},{"num":5,"verse":"Since you are God's dear children, you must try to be like him. "},{"num":2,"verse":"Your life must be controlled by love, just as Christ loved us and gave his life for us as a sweet-smelling offering and sacrifice that pleases God."},{"num":3,"verse":"Since you are God's people, it is not right that any matters of sexual immorality or indecency or greed should even be mentioned among you. "},{"num":4,"verse":"Nor is it fitting for you to use language which is obscene, profane, or vulgar. Rather you should give thanks to God. "},{"num":5,"verse":"You may be sure that no one who is immoral, indecent, or greedy (for greed is a form of idolatry) will ever receive a share in the Kingdom of Christ and of God."},{"num":6,"verse":"Do not let anyone deceive you with foolish words; it is because of these very things that God's anger will come upon those who do not obey him. "},{"num":7,"verse":"So have nothing at all to do with such people. "},{"num":8,"verse":"You yourselves used to be in the darkness, but since you have become the Lord's people, you are in the light. So you must live like people who belong to the light, "},{"num":9,"verse":"for it is the light that brings a rich harvest of every kind of goodness, righteousness, and truth. "},{"num":10,"verse":"Try to learn what pleases the Lord. "},{"num":11,"verse":"Have nothing to do with the worthless things that people do, things that belong to the darkness. Instead, bring them out to the light. "},{"num":12,"verse":"(It is really too shameful even to talk about the things they do in secret.) "},{"num":13,"verse":"And when all things are brought out to the light, then their true nature is clearly revealed; "},{"num":14,"verse":"for anything that is clearly revealed becomes light. That is why it is said,"},{"num":15,"verse":"So be careful how you live. Don't live like ignorant people, but like wise people. "},{"num":16,"verse":"Make good use of every opportunity you have, because these are evil days. "},{"num":17,"verse":"Don't be fools, then, but try to find out what the Lord wants you to do."},{"num":18,"verse":"Do not get drunk with wine, which will only ruin you; instead, be filled with the Spirit. "},{"num":19,"verse":"Speak to one another with the words of psalms, hymns, and sacred songs; sing hymns and psalms to the Lord with praise in your hearts. "},{"num":20,"verse":"In the name of our Lord Jesus Christ, always give thanks for everything to God the Father."},{"header":"Wives and Husbands"},{"num":21,"verse":"Submit yourselves to one another because of your reverence for Christ."},{"num":22,"verse":"Wives, submit yourselves to your husbands as to the Lord. "},{"num":23,"verse":"For a husband has authority over his wife just as Christ has authority over the church; and Christ is himself the Savior of the church, his body. "},{"num":24,"verse":"And so wives must submit themselves completely to their husbands just as the church submits itself to Christ."},{"num":25,"verse":"Husbands, love your wives just as Christ loved the church and gave his life for it. "},{"num":26,"verse":"He did this to dedicate the church to God by his word, after making it clean by washing it in water, "},{"num":27,"verse":"in order to present the church to himself in all its beauty—pure and faultless, without spot or wrinkle or any other imperfection. "},{"num":28,"verse":"Men ought to love their wives just as they love their own bodies. A man who loves his wife loves himself. "},{"num":29,"verse":"(None of us ever hate our own bodies. Instead, we feed them, and take care of them, just as Christ does the church; "},{"num":30,"verse":"for we are members of his body.) "},{"num":31,"verse":"As the scripture says, “For this reason a man will leave his father and mother and unite with his wife, and the two will become one.” "},{"num":32,"verse":"There is a deep secret truth revealed in this scripture, which I understand as applying to Christ and the church. "},{"num":33,"verse":"But it also applies to you: every husband must love his wife as himself, and every wife must respect her husband."}]