[{"header":"Living in the Light"},{"num":5,"verse":"You are God’s children whom he loves. So try to be like God. "},{"num":2,"verse":"Live a life of love. Love other people just as Christ loved us. Christ gave himself for us—he was a sweet-smelling offering and sacrifice to God."},{"num":3,"verse":"But there must be no sexual immorality among you. There must not be any kind of evil or greed. Those things are not right for God’s holy people. "},{"num":4,"verse":"Also, there must be no evil talk among you. You must not speak foolishly or tell evil jokes. These things are not right for you. But you should be giving thanks to God. "},{"num":5,"verse":"You can be sure of this: No one will have a place in the kingdom of Christ and of God who engages in sexual sin, or does evil things, or is greedy. Anyone who is greedy is serving a false god."},{"num":6,"verse":"Do not let anyone fool you by telling you things that are not true. These things will bring God’s anger on those who do not obey him. "},{"num":7,"verse":"So have no part with them. "},{"num":8,"verse":"In the past you were full of darkness, but now you are full of light in the Lord. So live like children who belong to the light. "},{"num":9,"verse":"Light brings every kind of goodness, right living, and truth. "},{"num":10,"verse":"Try to learn what pleases the Lord. "},{"num":11,"verse":"Do not do the things that people in darkness do. That brings nothing good. But do good things to show that the things done in darkness are wrong. "},{"num":12,"verse":"It is shameful even to talk about what those people do in secret. "},{"num":13,"verse":"But the light makes all things easy to see. "},{"num":14,"verse":"And everything that is made easy to see can become light. This is why it is said:"},{"num":15,"verse":"So be very careful how you live. Do not live like those who are not wise. Live wisely. "},{"num":16,"verse":"I mean that you should use every chance you have for doing good, because these are evil times. "},{"num":17,"verse":"So do not be foolish with your lives. But learn what the Lord wants you to do. "},{"num":18,"verse":"Do not be drunk with wine. That will ruin you spiritually. But be filled with the Spirit. "},{"num":19,"verse":"Speak to each other with psalms, hymns, and spiritual songs. Sing and make music in your hearts to the Lord. "},{"num":20,"verse":"Always give thanks to God the Father for everything, in the name of our Lord Jesus Christ."},{"header":"Wives and Husbands"},{"num":21,"verse":"Be willing to obey each other. Do this because you respect Christ."},{"num":22,"verse":"Wives, be under the authority of your husbands, as of the Lord. "},{"num":23,"verse":"The husband is the head of the wife, as Christ is the head of the church. The church is Christ’s body—Christ is the Savior of the body. "},{"num":24,"verse":"The church is under the authority of Christ. So it is the same with you wives. You should be under the authority of your husbands in everything."},{"num":25,"verse":"Husbands, love your wives as Christ loved the church. Christ died for the church "},{"num":26,"verse":"to make it belong to God. Christ used the word to make the church clean by washing it with water. "},{"num":27,"verse":"Christ died so that he could give the church to himself like a bride in all her beauty. He died so that the church could be pure and without fault, with no evil or sin or any other wrong thing in it. "},{"num":28,"verse":"And husbands should love their wives in the same way. They should love their wives as they love their own bodies. The man who loves his wife loves himself. "},{"num":29,"verse":"No person ever hates his own body, but feeds and takes care of it. And that is what Christ does for the church, "},{"num":30,"verse":"because we are parts of his body. "},{"num":31,"verse":"The Scripture says, “So a man will leave his father and mother and be united with his wife. And the two people will become one body.” "},{"num":32,"verse":"That secret truth is very important—I am talking about Christ and the church. "},{"num":33,"verse":"But each one of you must love his wife as he loves himself. And a wife must respect her husband."}]