[{"num":5,"verse":"¶ Be ye therefore imitators of God, as dear children"},{"num":2,"verse":"and walk in charity even as the Christ also has loved us and has given himself for us as an offering and a sacrifice to God for a sweet smelling savour."},{"num":3,"verse":"¶ But fornication and all uncleanness or covetousness, let it not be once named among you as becomes saints,"},{"num":4,"verse":"neither dishonest words nor foolishness nor low jesting, which are not convenient, but rather giving of thanks."},{"num":5,"verse":"For this ye know, that no fornicator nor unclean person nor covetous man, who is also an idolater, has any inheritance in the kingdom of Christ and of God."},{"num":6,"verse":"Let no one deceive you with vain words, for because of these things the wrath of God comes upon the sons of disobedience."},{"num":7,"verse":"Be not ye, therefore, partakers with them."},{"num":8,"verse":"For in another time ye were darkness, but now ye are light in the Lord: walk as children of light;"},{"num":9,"verse":"(For the fruit of the Spirit is in all goodness and righteousness and truth),"},{"num":10,"verse":"approving what is well pleasing unto the Lord."},{"num":11,"verse":"And have no fellowship with the unfruitful works of darkness, but rather reprove them."},{"num":12,"verse":"For it is a shame even to speak of those things which they do in secret."},{"num":13,"verse":"But all these things when they are reproved by the light are made manifest, for the light is that which manifests everything."},{"num":14,"verse":"Therefore he saith, Awake thou that sleepest and arise from the dead, and the Christ shall shine upon thee."},{"num":15,"verse":"See then that ye walk circumspectly, not as fools, but as wise,"},{"num":16,"verse":"redeeming the time, because the days are evil."},{"num":17,"verse":"Therefore, be ye not unwise, but understanding of what the will of the Lord is."},{"num":18,"verse":"And be not drunk with wine, in which there is excess, but be filled with the Spirit,"},{"num":19,"verse":"speaking among yourselves with psalms and hymns and spiritual songs, singing and praising the Lord in your hearts,"},{"num":20,"verse":"giving thanks always for all things unto the God and Father in the name of our Lord Jesus Christ,"},{"num":21,"verse":"¶ submitting yourselves one to another in the fear of God."},{"num":22,"verse":"Wives, submit yourselves unto your own husband, as unto the Lord."},{"num":23,"verse":"For the husband is the head of the wife even as the Christ is head of the congregation, {Gr. ekklesia – called out ones} and it is he who gives saving health to the body."},{"num":24,"verse":"Therefore, as the congregation {Gr. ekklesia – called out ones} is subject unto the Christ, so let the wives be to their own husbands in everything."},{"num":25,"verse":"Husbands, love your wives even as the Christ also loved the congregation {Gr. ekklesia – called out ones} and gave himself for her,"},{"num":26,"verse":"that he might sanctify and cleanse her in the washing of water by the word,"},{"num":27,"verse":"that he might present her glorious for himself, a congregation, {Gr. ekklesia – called out ones} not having spot or wrinkle or any such thing, but that she should be holy and without blemish."},{"num":28,"verse":"So ought husbands to love their wives as their own bodies. He that loves his wife loves himself."},{"num":29,"verse":"For no one ever hated his own flesh, but nourishes and cherishes it even as the Lord with his congregation. {Gr. ekklesia – called out ones}"},{"num":30,"verse":"For we are members of his body, of his flesh, and of his bones."},{"num":31,"verse":"For this cause shall a man leave his father and mother and shall be joined unto his wife, and they shall be two in one flesh."},{"num":32,"verse":"This is a great mystery, but I speak concerning Christ and the congregation. {Gr. ekklesia – called out ones}"},{"num":33,"verse":"Nevertheless, let each one of you do likewise, let each one so love his wife even as himself, and let the wife see that she reverences her husband."}]