[{"num":23,"verse":"This is God’s message to Tyre:"},{"num":2,"verse":"Deathly silence is everywhere. Stillness reigns where once your hustling port was full of ships from Sidon, bringing merchandise from far across the ocean, from Egypt and along the Nile. You were the merchandise mart of the world. "},{"num":4,"verse":"Be ashamed, O Sidon,* stronghold of the sea. For you are childless now! "},{"num":5,"verse":"When Egypt hears the news, there will be great sorrow. "},{"num":6,"verse":"Flee to Tarshish, men of Tyre, weeping as you go. "},{"num":7,"verse":"This silent ruin is all that’s left of your once joyous land. What a history was yours! Think of all the colonists you sent to distant lands!"},{"num":8,"verse":"Who has brought this disaster on Tyre, empire builder and top trader of the world? "},{"num":9,"verse":"The Commander of the armies of heaven has done it to destroy your pride and show his contempt for all the greatness of mankind. "},{"num":10,"verse":"Sail on, O ships of Tarshish, for your harbor is gone. "},{"num":11,"verse":"The Lord holds out his hand over the seas; he shakes the kingdoms of the earth; he has spoken out against this great merchant city, to destroy its strength."},{"num":12,"verse":"He says, “Never again, O dishonored virgin, daughter of Sidon, will you rejoice, will you be strong. Even if you flee to Cyprus, you will find no rest.”"},{"num":13,"verse":"It will be the Babylonians, not the Assyrians, who consign Tyre to the wild beasts. They will lay siege to it, raze its palaces, and make it a heap of ruins. "},{"num":14,"verse":"Wail, you ships that ply the oceans, for your home port is destroyed!"},{"num":15,"verse":"For seventy years Tyre will be forgotten. Then, in the days of another king, the city will come back to life again; she will sing sweet songs as a harlot sings who, long absent from her lovers, walks the streets to look for them again and is remembered. "},{"num":17,"verse":"Yes, after seventy years, the Lord will revive Tyre, but she will be no different than she was before; she will return again to all her evil ways around the world. "},{"num":18,"verse":"Yet the distant time will come when her businesses will give their profits to the Lord! They will not be hoarded but used for good food and fine clothes for the priests of the Lord!"}]