[{"header":"The Coming Messiah: the Righteous Branch"},{"num":23,"verse":"“Woe to the shepherds (civil leaders, rulers) who are destroying and scattering the sheep of My pasture!” says the Lord. "},{"num":2,"verse":"Therefore thus says the Lord, the God of Israel, in regard to the shepherds who care for and feed My people: “You have scattered My flock and driven them away, and have not attended to them; hear this, I am about to visit and attend to you for the evil of your deeds,” says the Lord. "},{"num":3,"verse":"“Then I will gather the remnant of My flock out of all the countries to which I have driven them and bring them back to their folds and pastures; and they will be fruitful and multiply. "},{"num":4,"verse":"I will set up shepherds over them who will feed them. And they will not be afraid any longer, nor be terrified, nor will any be missing,” says the Lord."},{"num":7,"verse":"“Therefore behold, the days are coming,” says the Lord, “when they will no longer say, ‘As the Lord lives, who brought up the children of Israel from the land of Egypt,’ "},{"num":8,"verse":"but [they will say], ‘As the Lord lives, who brought up and led back the descendants of the house of Israel from the north country and from all the countries to which I had driven them.’ Then they will live in their own land.”"},{"header":"False Prophets Denounced"},{"num":15,"verse":"Therefore thus says the Lord of hosts in regard to the prophets,"},{"num":25,"verse":"“I have heard what the prophets have said who prophesy lies in My Name, saying, ‘I have dreamed, I have dreamed [visions when on my bed at night].’ "},{"num":26,"verse":"How long [shall this state of affairs continue]? Is there anything in the hearts of the prophets who prophesy falsehood, even these prophets of the deception of their own heart, "},{"num":27,"verse":"who think that they can make My people forget My Name by their [contrived] dreams which each one tells another, just as their fathers forgot My Name because of Baal? "},{"num":28,"verse":"The prophet who has a dream may tell his dream; but he who has My word, let him speak My word faithfully. What has straw in common with wheat [for nourishment]?” says the Lord. "},{"num":29,"verse":"“Is not My word like fire [that consumes all that cannot endure the test]?” says the Lord, “and like a hammer that breaks the [most stubborn] rock [in pieces]? "},{"num":30,"verse":"Therefore behold (hear this), I am against the [counterfeit] prophets,” says the Lord, “[I am descending on them with punishment, these prophets] who steal My words from one another [imitating the words of the true prophets]. "},{"num":31,"verse":"Hear this, I am against the prophets,” says the Lord, “who use their [own deceitful] tongues and say, ‘Thus says the Lord.’ "},{"num":32,"verse":"Hear this, I am against those who have prophesied false and made-up dreams,” says the Lord, “and have told them and have made My people err and go astray by their lies and by their reckless boasting; yet I did not send them or command them nor do they benefit and enhance [the life of] these people in the slightest way,” says the Lord."},{"num":33,"verse":"“Now when this people or a prophet or a priest asks you [in jest], ‘What is the oracle of the Lord [the burden to be lifted up and carried]?’ Then you shall say to them, ‘What oracle [besides the one that declares you people to be the burden]!’ The Lord says, ‘I will unburden Myself and I will abandon you.’ "},{"num":34,"verse":"And as for the prophet, the priest, or [any of] the people, whoever says, ‘The oracle of the Lord,’ [as if he knows God’s will], I will punish that man and his household. "},{"num":35,"verse":"[For the future, in speaking of the words of the Lord] thus each of you shall say to his neighbor and to his brother, ‘What has the Lord answered?’ or, ‘What has the Lord spoken?’ "},{"num":36,"verse":"For you will no longer remember the oracle of the Lord, because every man’s own word will become the oracle, [for as they mockingly call all prophecies oracles, whether good or bad, so will it prove to be to them; God will take them at their own word]; and you have perverted the words [not of a lifeless idol, but] of the living God, the Lord of hosts, our God. "},{"num":37,"verse":"Thus you will [reverently] say to the prophet, ‘What has the Lord answered you?’ and, ‘What has the Lord spoken?’ "},{"num":38,"verse":"For if you say, ‘The oracle of the Lord!’ surely thus says the Lord, ‘Because you said this word, “The oracle of the Lord!” when I have also sent to you, saying, “You shall not say, ‘The oracle of the Lord!’”’ "},{"num":39,"verse":"Therefore behold, I, even I, will assuredly forget you and send you away from My presence, you and the city (Jerusalem) which I gave to you and to your fathers. "},{"num":40,"verse":"And I will bring an everlasting disgrace on you and a perpetual humiliation (shame) which will not be forgotten.”"}]