[{"header":"The Righteous Branch"},{"num":23,"verse":"Woe to the shepherds who destroy and scatter the sheep of my pasture! declares the Lord."},{"num":2,"verse":"Therefore, this is what the Lord, the God of Israel, says about the shepherds who shepherd my people."},{"num":7,"verse":"So, mark my words, the days are coming, declares the Lord, when it will no longer be said, “As surely as the Lord lives who brought the Israelites up out of Egypt,” "},{"num":8,"verse":"but, “as surely as the Lord lives who brought up the descendants of the house of Israel and led them out of a land in the north and from all the countries where I had driven them.” Then they will dwell in their own land."},{"header":"Against False Prophets"},{"num":20,"verse":"The Lord’s anger will not turn back until he has completely fulfilled the purposes of his heart. In later days you will understand it fully."},{"num":25,"verse":"I have heard what the prophets who prophesy lies in my name have said. They say, “I have had a dream! I have had a dream!” "},{"num":26,"verse":"How long will this be in the hearts of these lying prophets? These prophets proclaim the fantasies of their own hearts. "},{"num":27,"verse":"They think they can make my people forget my name with the dreams each one tells his neighbor, the way their fathers forgot my name because of Baal. "},{"num":28,"verse":"Let the prophet who has a dream tell his dream. But let the one who has my word speak my word faithfully."},{"num":29,"verse":"Is not my word like a fire? declares the Lord, and like a hammer that breaks a rock in pieces? "},{"num":30,"verse":"Therefore listen to this, declares the Lord. I am against the prophets who steal my words from each other. "},{"num":31,"verse":"Indeed, I am against the prophets, declares the Lord, who use their own tongues to say, “This is what the Lord declares!” "},{"num":32,"verse":"Yes, I am against those who prophesy about lying dreams, declares the Lord. I am against those who tell lying dreams to lead my people astray with their extravagant lies. But I did not send them or command them. They provide no benefit for this people, declares the Lord."},{"num":33,"verse":"When these people or a prophet or a priest asks you, “What is the message from the Lord?” say to them, “What is the message? This is the Lord’s message: I will abandon you.”"},{"num":34,"verse":"As for the prophet, the priest, or anyone who says “the message from the Lord,” I will punish that man and his household. "},{"num":35,"verse":"Each man will ask his neighbor, “What has the Lord answered?” or “What has the Lord said?” "},{"num":36,"verse":"But do not refer to “the message of the Lord” anymore, because each man’s word has become his own message, because you have perverted the words of the Living God, the Lord of Armies, our God."},{"num":37,"verse":"You say this to the prophet: “What has the Lord answered you?” or “What has the Lord said?” "},{"num":38,"verse":"But if you say that you have the message of the Lord, this is what the Lord says to you: Since you say “the message of the Lord,” although I have sent a message telling you not to say “the message of the Lord,” "},{"num":39,"verse":"watch out, because I will completely forget you and throw you out of my presence. I will abandon you and this city, which I gave to your fathers. "},{"num":40,"verse":"I will bring everlasting scorn and everlasting shame that will not be forgotten."}]