[{"num":23,"verse":"1 Against false pastors. 5 A prophecy of the great Pastor Jesus Christ."},{"num":1,"verse":"Woe be unto the pastors that destroy and scatter the sheep of my pasture, saith the Lord."},{"num":2,"verse":"Therefore thus saith the Lord God of Israel unto the pastors that feed my people, Ye have scattered my flock, and thrust them out, and have not visited them: behold, I will visit you for the wickedness of your works, saith the Lord."},{"num":3,"verse":"And I will gather the remnant of my sheep out of all countries, whither I had driven them, and will bring them again to their folds, and they shall grow and increase:"},{"num":4,"verse":"And I will set up shepherds over them, which shall feed them: and they shall dread no more nor be afraid, neither shall any of them be lacking, saith the Lord."},{"num":5,"verse":"Behold, the days come, saith the Lord, that I will raise unto David a righteous branch, and a King shall reign and prosper, and shall execute judgment and justice in the earth."},{"num":6,"verse":"In his days Judah shall be saved, and Israel shall dwell safely, and this is the Name whereby they shall call him, The Lord our righteousness."},{"num":7,"verse":"Therefore behold, the days come, saith the Lord, that they shall no more say, The Lord liveth, which brought up the children of Israel out of the land of Egypt."},{"num":8,"verse":"But the Lord liveth, which brought up and led the seed of the house of Israel out of the North country, and from all countries where I had scattered them, and they shall dwell in their own land."},{"num":9,"verse":"Mine heart breaketh within me, because of the prophets, all my bones shake: I am like a drunken man (and like a man whom wine hath overcome) for the presence of the Lord and for his holy words."},{"num":10,"verse":"For the land is full of adulterers, and because of oaths the land mourneth, the pleasant places of the wilderness are dried up, and their course is evil, and their force is not right."},{"num":11,"verse":"For both the Prophet and the Priest do wickedly: and their wickedness have I found in mine House, saith the Lord."},{"num":12,"verse":"Wherefore their way shall be unto them as slippery ways in the darkness: they shall be driven forth and fall therein: for I will bring a plague upon them, even the year of their visitation, saith the Lord."},{"num":13,"verse":"And I have seen foolishness in the prophets of Samaria that prophesied in Baal, and caused my people Israel to err."},{"num":14,"verse":"I have seen also in the prophets of Jerusalem filthiness: they commit adultery and walk in lies: they strengthen also the hands of the wicked, that none can return from his wickedness: they are all unto me as Sodom, and the inhabitants thereof as Gomorrah."},{"num":15,"verse":"Therefore thus saith the Lord of hosts concerning the prophets, Behold, I will feed them with wormwood, and make them drink the water of gall: for from the prophets of Jerusalem is wickedness gone forth into all the land."},{"num":16,"verse":"Thus saith the Lord of hosts, Hear not the words of the prophets that prophesy unto you, and teach you vanity: they speak the vision of their own heart, and not out of the mouth of the Lord."},{"num":17,"verse":"They say still unto them that despise me, The Lord hath said, Ye shall have peace: and they say unto everyone that walketh after the stubbornness of his own heart, No evil shall come upon you."},{"num":18,"verse":"For who hath stood in the counsel of the Lord that he hath perceived, and heard his word? Who hath marked his word and heard it?"},{"num":19,"verse":"Behold, the tempest of the Lord goeth forth in his wrath, and a violent whirlwind shall fall down upon the head of the wicked."},{"num":20,"verse":"The anger of the Lord shall not return until he have executed, and till he have performed the thoughts of his heart: in the latter days ye shall understand it plainly."},{"num":21,"verse":"I have not sent these prophets, saith the Lord, yet they ran; I have not spoken to them, and yet they prophesied."},{"num":22,"verse":"But if they had stood in my counsel, and had declared my words to my people, then they should have turned them from their evil way, and from the wickedness of their inventions."},{"num":23,"verse":"Am I a God at hand, saith the Lord, and not a God far off?"},{"num":24,"verse":"Can any hide himself in secret places, that I shall not see him, saith the Lord? Do not I fill heaven and earth, saith the Lord?"},{"num":25,"verse":"I have heard what the prophets said, that prophesied lies in my Name, saying, I have dreamed, I have dreamed."},{"num":26,"verse":"How long? Do the prophets delight to prophesy lies, even prophesying the deceit of their own heart?"},{"num":27,"verse":"Think they to cause my people to forget my Name by their dreams, which they tell every man to his neighbor, as their forefathers have forgotten my Name for Baal?"},{"num":28,"verse":"The prophet that hath a dream, let him tell a dream, and he that hath my word, let him speak my word faithfully: what is the chaff to the wheat, saith the Lord?"},{"num":29,"verse":"Is not my word even like a fire, saith the Lord? and like an hammer, that breaketh the stone?"},{"num":30,"verse":"Therefore behold, I will come against the prophets, saith the Lord, that steal my word every one from his neighbor."},{"num":31,"verse":"Behold, I will come against the prophets, saith the Lord, which have sweet tongues, and say, He saith."},{"num":32,"verse":"Behold, I will come against them that prophesy false dreams, saith the Lord, and do tell them, and cause my people to err by their lies, and by their flatteries, and I sent them not, nor commanded them: therefore they bring no profit unto this people, saith the Lord."},{"num":33,"verse":"And when this people, or the prophet, or a Priest shall ask thee, saying, What is the burden of the Lord? thou shalt then say unto them, What burden? I will even forsake you, saith the Lord."},{"num":34,"verse":"And the prophet, or the priest, or the people that shall say, The burden of the Lord, I will even visit every such one, and his house."},{"num":35,"verse":"Thus shall ye say every one to his neighbor, and every one to his brother, What hath the Lord answered? and what hath the Lord spoken?"},{"num":36,"verse":"And the burden of the Lord shall ye mention no more: for every man’s word shall be his burden: for ye have perverted the words of the living God, the Lord of hosts our God."},{"num":37,"verse":"Thus shalt thou say to the Prophet, What hath the Lord answered thee? and what hath the Lord spoken?"},{"num":38,"verse":"And if you say, The burden of the Lord, Then thus saith the Lord, Because ye say this word, The burden of the Lord, and I have sent unto you, saying, Ye shall not say, The burden of the Lord."},{"num":39,"verse":"Therefore behold, I, even I will utterly forget you, and I will forsake you, and the city that I gave you and your fathers, and cast you out of my presence,"},{"num":40,"verse":"And will bring an everlasting reproach upon you, and a perpetual shame which shall never be forgotten."}]