[{"header":"New Leaders over a Regathered Remnant"},{"num":23,"verse":"The Lord says, “The leaders of my people are sure to be judged. They were supposed to watch over my people like shepherds watch over their sheep. But they are causing my people to be destroyed and scattered.” "},{"num":2,"verse":"So the Lord God of Israel has this to say about the leaders who are ruling over his people: “You have caused my people to be dispersed and driven into exile. You have not taken care of them. So I will punish you for the evil that you have done. I, the Lord, affirm it! "},{"num":3,"verse":"Then I myself will regather those of my people who are still alive from all the countries where I have driven them. I will bring them back to their homeland. They will greatly increase in number. "},{"num":4,"verse":"I will install rulers over them who will care for them. Then they will no longer need to fear or be terrified. None of them will turn up missing. I, the Lord, promise it!"},{"num":7,"verse":"“So I, the Lord, say: ‘A new time will certainly come. People now affirm their oaths with, “I swear as surely as the Lord lives who delivered the people of Israel out of Egypt.” "},{"num":8,"verse":"But at that time they will affirm them with, “I swear as surely as the Lord lives who delivered the descendants of the former nation of Israel from the land of the north and from all the other lands where he had banished them.” At that time they will live in their own land.’”"},{"header":"Oracles Against the False Prophets[z]"},{"num":9,"verse":"Here is what the Lord says concerning the false prophets:"},{"num":11,"verse":"Moreover, the Lord says,"},{"num":16,"verse":"The Lord of Heaven’s Armies says to the people of Jerusalem:"},{"num":25,"verse":"The Lord says, “I have heard what those prophets who are prophesying lies in my name are saying. They are saying, ‘I have had a dream! I have had a dream!’ "},{"num":26,"verse":"Those prophets are just prophesying lies. They are prophesying the delusions of their own minds. "},{"num":27,"verse":"How long will they go on plotting to make my people forget who I am through the dreams they tell one another? That is just as bad as what their ancestors did when they forgot who I am by worshiping the god Baal. "},{"num":28,"verse":"Let the prophet who has had a dream go ahead and tell his dream. Let the person who has received my message report that message faithfully. What is like straw cannot compare to what is like grain! I, the Lord, affirm it! "},{"num":29,"verse":"My message is like a fire that purges dross. It is like a hammer that breaks a rock in pieces. I, the Lord, so affirm it! "},{"num":30,"verse":"So I, the Lord, affirm that I am opposed to those prophets who steal messages from one another that they claim are from me. "},{"num":31,"verse":"I, the Lord, affirm that I am opposed to those prophets who are using their own tongues to declare, ‘The Lord declares.’ "},{"num":32,"verse":"I, the Lord, affirm that I am opposed to those prophets who dream up lies and report them. They are misleading my people with their reckless lies. I did not send them. I did not commission them. They are not helping these people at all. I, the Lord, affirm it!”"},{"num":33,"verse":"The Lord said to me, “Jeremiah, when one of these people, or a prophet, or a priest asks you, ‘What burdensome message do you have from the Lord?’ Tell them, ‘You are the burden, and I will cast you away. I, the Lord, affirm it! "},{"num":34,"verse":"I will punish any prophet, priest, or other person who says “The Lord’s message is burdensome.” I will punish both that person and his whole family.’”"},{"num":35,"verse":"So I, Jeremiah, tell you, “Each of you people should say to his friend or his relative, ‘How did the Lord answer? Or what did the Lord say?’ "},{"num":36,"verse":"You must no longer say that the Lord’s message is burdensome. For what is ‘burdensome’ really pertains to what a person himself says. You are misrepresenting the words of our God, the living God, the Lord of Heaven’s Armies. "},{"num":37,"verse":"Each of you should merely ask the prophet, ‘What answer did the Lord give you? Or what did the Lord say?’ "},{"num":38,"verse":"But just suppose you continue to say, ‘The message of the Lord is burdensome.’ Here is what the Lord says will happen: ‘I sent word to you that you must not say, “The Lord’s message is burdensome.” But you used the words, “The Lord’s message is burdensome,” anyway. "},{"num":39,"verse":"So I will carry you far off and throw you away. I will send both you and the city I gave to you and to your ancestors out of my sight. "},{"num":40,"verse":"I will bring on you lasting shame and lasting disgrace that will never be forgotten!’”"}]