[{"num":3,"verse":"Now the serpent was more subtle and crafty than any living creature of the field which the Lord God had made. And he [Satan] said to the woman, Can it really be that God has said, You shall not eat from every tree of the garden?"},{"num":2,"verse":"And the woman said to the serpent, We may eat the fruit from the trees of the garden,"},{"num":3,"verse":"Except the fruit from the tree which is in the middle of the garden. God has said, You shall not eat of it, neither shall you touch it, lest you die."},{"num":4,"verse":"But the serpent said to the woman, You shall not surely die,"},{"num":5,"verse":"For God knows that in the day you eat of it your eyes will be opened, and you will be like God, knowing the difference between good and evil and blessing and calamity."},{"num":6,"verse":"And when the woman saw that the tree was good (suitable, pleasant) for food and that it was delightful to look at, and a tree to be desired in order to make one wise, she took of its fruit and ate; and she gave some also to her husband, and he ate."},{"num":7,"verse":"Then the eyes of them both were opened, and they knew that they were naked; and they sewed fig leaves together and made themselves apronlike girdles."},{"num":8,"verse":"And they heard the sound of the Lord God walking in the garden in the cool of the day, and Adam and his wife hid themselves from the presence of the Lord God among the trees of the garden."},{"num":9,"verse":"But the Lord God called to Adam and said to him, Where are you?"},{"num":10,"verse":"He said, I heard the sound of You [walking] in the garden, and I was afraid because I was naked; and I hid myself."},{"num":11,"verse":"And He said, Who told you that you were naked? Have you eaten of the tree of which I commanded you that you should not eat?"},{"num":12,"verse":"And the man said, The woman whom You gave to be with me—she gave me [fruit] from the tree, and I ate."},{"num":13,"verse":"And the Lord God said to the woman, What is this you have done? And the woman said, The serpent beguiled (cheated, outwitted, and deceived) me, and I ate."},{"num":14,"verse":"And the Lord God said to the serpent, Because you have done this, you are cursed above all [domestic] animals and above every [wild] living thing of the field; upon your belly you shall go, and you shall eat dust [and what it contains] all the days of your life."},{"num":15,"verse":"And I will put enmity between you and the woman, and between your offspring and her Offspring; He will bruise and tread your head underfoot, and you will lie in wait and bruise His heel."},{"num":16,"verse":"To the woman He said, I will greatly multiply your grief and your suffering in pregnancy and the pangs of childbearing; with spasms of distress you will bring forth children. Yet your desire and craving will be for your husband, and he will rule over you."},{"num":17,"verse":"And to Adam He said, Because you have listened and given heed to the voice of your wife and have eaten of the tree of which I commanded you, saying, You shall not eat of it, the ground is under a curse because of you; in sorrow and toil shall you eat [of the fruits] of it all the days of your life."},{"num":18,"verse":"Thorns also and thistles shall it bring forth for you, and you shall eat the plants of the field."},{"num":19,"verse":"In the sweat of your face shall you eat bread until you return to the ground, for out of it you were taken; for dust you are and to dust you shall return."},{"num":20,"verse":"The man called his wife’s name Eve [life spring], because she was the mother of all the living."},{"num":21,"verse":"For Adam also and for his wife the Lord God made long coats (tunics) of skins and clothed them."},{"num":22,"verse":"And the Lord God said, Behold, the man has become like one of Us [the Father, Son, and Holy Spirit], to know [how to distinguish between] good and evil and blessing and calamity; and now, lest he put forth his hand and take also from the tree of life and eat, and live forever—"},{"num":23,"verse":"Therefore the Lord God sent him forth from the Garden of Eden to till the ground from which he was taken."},{"num":24,"verse":"So [God] drove out the man; and He placed at the east of the Garden of Eden the cherubim and a flaming sword which turned every way, to keep and guard the way to the tree of life."}]