[[],[{"type":"header","content":"The Fall"},{"type":"prose","content":"Now the serpent was more crafty than any other beast of the field that the LORD God had made.He said to the woman, “Did God actually say, ‘You shall not eat of any tree in the garden’?”"}],[{"type":"prose","content":"And the woman said to the serpent, “We may eat of the fruit of the trees in the garden,"}],[{"type":"prose","content":"but God said, ‘You shall not eat of the fruit of the tree that is in the midst of the garden, neither shall you touch it, lest you die.’”"}],[{"type":"prose","content":"But the serpent said to the woman, “You will not surely die."}],[{"type":"prose","content":"For God knows that when you eat of it your eyes will be opened, and you will be like God, knowing good and evil.”"}],[{"type":"prose","content":"So when the woman saw that the tree was good for food, and that it was a delight to the eyes, and that the tree was to be desired to make one wise, she took of its fruit and ate, and she also gave some to her husband who was with her, and he ate."}],[{"type":"prose","content":"Then the eyes of both were opened, and they knew that they were naked. And they sewed fig leaves together and made themselves loincloths."}],[{"type":"prose","content":"And they heard the sound of the LORD God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the LORD God among the trees of the garden."}],[{"type":"prose","content":"But the LORD God called to the man and said to him, “Where are you?”"}],[{"type":"prose","content":"And he said, “I heard the sound of you in the garden, and I was afraid, because I was naked, and I hid myself.”"}],[{"type":"prose","content":"He said, “Who told you that you were naked? Have you eaten of the tree of which I commanded you not to eat?”"}],[{"type":"prose","content":"The man said, “The woman whom you gave to be with me, she gave me fruit of the tree, and I ate.”"}],[{"type":"prose","content":"Then the LORD God said to the woman, “What is this that you have done?” The woman said, “The serpent deceived me, and I ate.”"}],[{"type":"prose","content":"The LORD God said to the serpent,"}],[{"type":"prose","content":"To the woman he said,"}],[{"type":"prose","content":"And to Adam he said,"}],[{"type":"prose","content":"The man called his wife's name Eve, because she was the mother of all living."}],[{"type":"prose","content":"And the LORD God made for Adam and for his wife garments of skins and clothed them."}],[{"type":"prose","content":"Then the LORD God said, “Behold, the man has become like one of us in knowing good and evil. Now, lest he reach out his hand and take also of the tree of life and eat, and live forever—”"}],[{"type":"prose","content":"therefore the LORD God sent him out from the garden of Eden to work the ground from which he was taken."}],[{"type":"prose","content":"He drove out the man, and at the east of the garden of Eden he placed the cherubim and a flaming sword that turned every way to guard the way to the tree of life."}]]