[{"num":3,"verse":"¶ Now the serpent was more astute than all the animals of the field which the LORD God had made. And he said unto the woman, Has God indeed said, Ye shall not eat of every tree of the garden?"},{"num":2,"verse":"And the woman answered unto the serpent, We may eat of the fruit of the trees of the garden;"},{"num":3,"verse":"but of the fruit of the tree which is in the midst of the garden, God has said, Ye shall not eat of it; neither shall ye touch it, lest ye die."},{"num":4,"verse":"Then the serpent said unto the woman, Ye shall not surely die:"},{"num":5,"verse":"For God knows that in the day ye eat of it then your eyes shall be opened, and ye shall be as gods, knowing good and evil."},{"num":6,"verse":"¶ And when the woman saw that the tree was good for food, and that it was desirable to the eyes, and a tree of covetousness to understand, she took of its fruit and ate and gave also unto her husband with her; and he ate."},{"num":7,"verse":"And the eyes of them both were opened, and they knew that they were naked; so they sewed fig leaves together and made themselves girdles."},{"num":8,"verse":"And they heard the voice of the LORD God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the LORD God among the trees of the garden."},{"num":9,"verse":"¶ And the LORD God called unto the man and said unto him, Where art thou?"},{"num":10,"verse":"And he replied, I heard thy voice in the garden, and I was afraid because I was naked; and I hid myself."},{"num":11,"verse":"¶ And he said, Who told thee that thou wast naked? Hast thou eaten of the tree, of which I commanded thee not to eat?"},{"num":12,"verse":"And the man said, The woman whom thou gavest to be with me, she gave me of the tree, and I ate."},{"num":13,"verse":"Then the LORD God said unto the woman, What is this that thou hast done? And the woman said, The serpent beguiled me, and I ate."},{"num":14,"verse":"¶ And the LORD God said unto the serpent, Because thou hast done this, thou art cursed above all beasts and above every animal of the field; upon thy belly shalt thou go, and dust shalt thou eat all the days of thy life;"},{"num":15,"verse":"and I will put enmity between thee and the woman and between thy seed and her seed; that seed shall bruise thy head, and thou shalt bruise his heel."},{"num":16,"verse":"¶ Unto the woman he said, I will greatly multiply thy sorrow and thy conception; in sorrow thou shalt bring forth sons; and thy desire shall be to thy husband, and he shall rule over thee."},{"num":17,"verse":"¶ And unto Adam he said, Because thou hast hearkened unto the voice of thy wife and hast eaten of the tree of which I commanded thee, saying, Thou shalt not eat of it, cursed shall be the ground for thy sake; in sorrow shalt thou eat of it all the days of thy life;"},{"num":18,"verse":"thorns also and thistles shall it bring forth to thee; and thou shalt eat the grass of the field;"},{"num":19,"verse":"in the sweat of thy face shalt thou eat bread until thou return unto the ground; for out of it wast thou taken, for dust thou art, and unto dust shalt thou return."},{"num":20,"verse":"¶ And the man called his wife’s name Eve because she was the mother of all living."},{"num":21,"verse":"¶ Then the LORD God made coats of skins for Adam and his wife and clothed them."},{"num":22,"verse":"¶ And the LORD God said, Behold, the man is become as one of us, knowing good and evil; and now, lest he put forth his hand and take also of the tree of life and eat and live for ever,"},{"num":23,"verse":"therefore the LORD God sent him forth from the garden of Eden to till the ground from which he was taken."},{"num":24,"verse":"So he drove out the man; and he placed at the east of the garden of Eden Cherubim and a flaming sword which turned every way to keep the way of the tree of life."}]