[{"header":"The Fall of Mankind"},{"num":1,"verse":"<br>Now the serpent was more cunning than any animal of the field which the  God had made. And he said to the woman, “Has God really said, ‘You shall not eat from any tree of the garden’?”"},{"num":2,"verse":"The woman said to the serpent, “From the fruit of the trees of the garden we may eat;"},{"num":3,"verse":"but from the fruit of the tree which is in the middle of the garden, God has said, ‘You shall not eat from it or touch it, or you will die.’”"},{"num":4,"verse":"The serpent said to the woman, “You certainly will not die!"},{"num":5,"verse":"For God knows that on the day you eat from it your eyes will be opened, and you will become like God, knowing good and evil.”"},{"num":6,"verse":"When the woman saw that the tree was good for food, and that it was a delight to the eyes, and that the tree was desirable to make  wise, she took some of its fruit and ate; and she also gave  to her husband with her, and he ate."},{"num":7,"verse":"Then the eyes of both of them were opened, and they knew that they were naked; and they sewed fig leaves together and made themselves waist coverings.<br><br>"},{"num":8,"verse":"Now they heard the sound of the  God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the  God among the trees of the garden."},{"num":9,"verse":"Then the  God called to the man, and said to him, “Where are you?”"},{"num":10,"verse":"He said, “I heard the sound of You in the garden, and I was afraid because I was naked; so I hid myself.”"},{"num":11,"verse":"And He said, “Who told you that you were naked? Have you eaten from the tree from which I commanded you not to eat?”"},{"num":12,"verse":"The man said, “The woman whom You gave  with me, she gave me some of  the tree, and I ate.”"},{"num":13,"verse":"Then the  God said to the woman, “What is this  you have done?” And the woman said, “The serpent deceived me, and I ate.”"},{"num":14,"verse":"Then the  God said to the serpent,<br>“Because you have done this,<br>Cursed are you more than all the livestock,<br>And more than any animal of the field;<br>On your belly you shall go,<br>And dust you shall eat<br>All the days of your life;<br>"},{"num":15,"verse":"And I will make enemies<br>Of you and the woman,<br>And of your offspring and her Descendant;<br>He shall bruise you on the head,<br>And you shall bruise Him on the heel.”<br>"},{"num":16,"verse":"To the woman He said,<br>“I will greatly multiply<br>Your pain in childbirth,<br>In pain you shall deliver children;<br>Yet your desire will be for your husband,<br>And he shall rule over you.”<br>"},{"num":17,"verse":"Then to Adam He said, “Because you have listened to the voice of your wife, and have eaten from the tree about which I commanded you, saying, ‘You shall not eat from it’;<br>Cursed is the ground because of you;<br>With hard labor you shall eat  it<br>All the days of your life.<br>"},{"num":18,"verse":"Both thorns and thistles it shall grow for you;<br>Yet you shall eat the plants of the field;<br>"},{"num":19,"verse":"By the sweat of your face<br>You shall eat bread,<br>Until you return to the ground,<br>Because from it you were taken;<br>For you are dust,<br>And to dust you shall return.”<br>"},{"num":20,"verse":"Now the man named his wife Eve, because she was the mother of all  living."},{"num":21,"verse":"And the  God made garments of skin for Adam and his wife, and clothed them.<br><br>"},{"num":22,"verse":"Then the  God said, “Behold, the man has become like one of Us, knowing good and evil; and now, he might reach out with his hand, and take  also from the tree of life, and eat, and live forever”—"},{"num":23,"verse":"therefore the  God sent him out of the Garden of Eden, to cultivate the ground from which he was taken."}]