[{"header":"The Beginning of Sin"},{"num":3,"verse":"Now the snake was the most clever of all the wild animals the Lord God had made. One day the snake said to the woman, “Did God really say that you must not eat fruit from any tree in the garden?”"},{"num":2,"verse":"The woman answered the snake, “We may eat fruit from the trees in the garden. "},{"num":3,"verse":"But God told us, ‘You must not eat fruit from the tree that is in the middle of the garden. You must not even touch it, or you will die.’”"},{"num":4,"verse":"But the snake said to the woman, “You will not die. "},{"num":5,"verse":"God knows that if you eat the fruit from that tree, you will learn about good and evil and you will be like God!”"},{"num":6,"verse":"The woman saw that the tree was beautiful, that its fruit was good to eat, and that it would make her wise. So she took some of its fruit and ate it. She also gave some of the fruit to her husband who was with her, and he ate it."},{"num":7,"verse":"Then, it was as if their eyes were opened. They realized they were naked, so they sewed fig leaves together and made something to cover themselves."},{"num":8,"verse":"Then they heard the Lord God walking in the garden during the cool part of the day, and the man and his wife hid from the Lord God among the trees in the garden. "},{"num":9,"verse":"But the Lord God called to the man and said, “Where are you?”"},{"num":10,"verse":"The man answered, “I heard you walking in the garden, and I was afraid because I was naked, so I hid.”"},{"num":11,"verse":"God asked, “Who told you that you were naked? Did you eat fruit from the tree from which I commanded you not to eat?”"},{"num":12,"verse":"The man said, “You gave this woman to me and she gave me fruit from the tree, so I ate it.”"},{"num":13,"verse":"Then the Lord God said to the woman, “How could you have done such a thing?”"},{"num":14,"verse":"The Lord God said to the snake,"},{"num":16,"verse":"Then God said to the woman,"},{"num":17,"verse":"Then God said to the man, “You listened to what your wife said, and you ate fruit from the tree from which I commanded you not to eat."},{"num":20,"verse":"The man named his wife Eve, because she was the mother of all the living."},{"num":21,"verse":"The Lord God made clothes from animal skins for the man and his wife and dressed them. "},{"num":22,"verse":"Then the Lord God said, “Humans have become like one of us; they know good and evil. We must keep them from eating some of the fruit from the tree of life, or they will live forever.” "},{"num":23,"verse":"So the Lord God forced Adam out of the garden of Eden to work the ground from which he was taken. "},{"num":24,"verse":"After God forced humans out of the garden, he placed angels and a sword of fire that flashed around in every direction on its eastern border. This kept people from getting to the tree of life."}]