[[],[{"type":"header","content":"The First Sin and Its Punishment"},{"type":"prose","content":"Now the serpent was more crafty than any other wild animal that the  God had made. He said to the woman, “Did God say, ‘You shall not eat from any tree in the garden’?” "}],[{"type":"prose","content":"The woman said to the serpent, “We may eat of the fruit of the trees in the garden; "}],[{"type":"prose","content":"but God said, ‘You shall not eat of the fruit of the tree that is in the middle of the garden, nor shall you touch it, or you shall die.’” "}],[{"type":"prose","content":"But the serpent said to the woman, “You will not die; "}],[{"type":"prose","content":"for God knows that when you eat of it your eyes will be opened, and you will be like God, knowing good and evil.” "}],[{"type":"prose","content":"So when the woman saw that the tree was good for food, and that it was a delight to the eyes, and that the tree was to be desired to make one wise, she took of its fruit and ate; and she also gave some to her husband, who was with her, and he ate. "}],[{"type":"prose","content":"Then the eyes of both were opened, and they knew that they were naked; and they sewed fig leaves together and made loincloths for themselves."}],[{"type":"prose","content":"They heard the sound of the  God walking in the garden at the time of the evening breeze, and the man and his wife hid themselves from the presence of the  God among the trees of the garden. "}],[{"type":"prose","content":"But the  God called to the man, and said to him, “Where are you?” "}],[{"type":"prose","content":"He said, “I heard the sound of you in the garden, and I was afraid, because I was naked; and I hid myself.” "}],[{"type":"prose","content":"He said, “Who told you that you were naked? Have you eaten from the tree of which I commanded you not to eat?” "}],[{"type":"prose","content":"The man said, “The woman whom you gave to be with me, she gave me fruit from the tree, and I ate.” "}],[{"type":"prose","content":"Then the  God said to the woman, “What is this that you have done?” The woman said, “The serpent tricked me, and I ate.” "}],[{"type":"prose","content":"The  God said to the serpent,"},{"type":"poetry","content":"“Because you have done this,"},{"type":"poetry","content":""},{"type":"poetry","content":""},{"type":"poetry","content":"upon your belly you shall go,"},{"type":"poetry","content":""},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"poetry","content":"I will put enmity between you and the woman,"},{"type":"poetry","content":""},{"type":"poetry","content":"he will strike your head,"},{"type":"poetry","content":""}],[{"type":"prose","content":"To the woman he said,"},{"type":"poetry","content":"“I will greatly increase your pangs in childbearing;"},{"type":"poetry","content":""},{"type":"poetry","content":"yet your desire shall be for your husband,"},{"type":"poetry","content":""}],[{"type":"prose","content":"And to the man he said,"},{"type":"poetry","content":"“Because you have listened to the voice of your wife,"},{"type":"poetry","content":""},{"type":"poetry","content":"about which I commanded you,"},{"type":"poetry","content":""},{"type":"poetry","content":"cursed is the ground because of you;"},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"poetry","content":"thorns and thistles it shall bring forth for you;"},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"poetry","content":"By the sweat of your face"},{"type":"poetry","content":""},{"type":"poetry","content":"until you return to the ground,"},{"type":"poetry","content":""},{"type":"poetry","content":"you are dust,"},{"type":"poetry","content":""}],[{"type":"prose","content":"The man named his wife Eve, because she was the mother of all living. "}],[{"type":"prose","content":"And the  God made garments of skins for the man and for his wife, and clothed them."}],[{"type":"prose","content":"Then the  God said, “See, the man has become like one of us, knowing good and evil; and now, he might reach out his hand and take also from the tree of life, and eat, and live forever”— "}],[{"type":"prose","content":"therefore the  God sent him forth from the garden of Eden, to till the ground from which he was taken. "}],[{"type":"prose","content":"He drove out the man; and at the east of the garden of Eden he placed the cherubim, and a sword flaming and turning to guard the way to the tree of life."}]]