[{"num":1,"verse":"The words or story of Nehemiah son of Hacaliah: Now in the month of Chislev in the twentieth year [of the Persian king], as I was in the castle of Shushan,"},{"num":2,"verse":"Hanani, one of my kinsmen, came with certain men from Judah, and I asked them about the surviving Jews who had escaped exile, and about Jerusalem."},{"num":3,"verse":"And they said to me, The remnant there in the province who escaped exile are in great trouble and reproach; the wall of Jerusalem is broken down, and its [fortified] gates are destroyed by fire."},{"num":4,"verse":"When I heard this, I sat down and wept and mourned for days and fasted and prayed [constantly] before the God of heaven,"},{"num":5,"verse":"And I said, O Lord God of heaven, the great and terrible God, Who keeps covenant, loving-kindness, and mercy for those who love Him and keep His commandments,"},{"num":6,"verse":"Let Your ear now be attentive and Your eyes open to listen to the prayer of Your servant which I pray before You day and night for the Israelites, Your servants, confessing the sins of the Israelites which we have sinned against You. Yes, I and my father’s house have sinned."},{"num":7,"verse":"We have acted very corruptly against You and have not kept the commandments, statutes, and ordinances which You commanded Your servant Moses."},{"num":8,"verse":"Remember [earnestly] what You commanded Your servant Moses: If you transgress and are unfaithful, I will scatter you abroad among the nations;"},{"num":9,"verse":"But if you return to Me and keep My commandments and do them, though your outcasts were in the farthest part of the heavens [the expanse of outer space], yet will I gather them from there and will bring them to the place in which I have chosen to set My Name."},{"num":10,"verse":"Now these are Your servants and Your people, whom You have redeemed by Your great power and by Your strong hand."},{"num":11,"verse":"O Lord, let Your ear be attentive to the prayer of Your servant and the prayer of Your servants who delight to revere and fear Your name (Your nature and attributes); and prosper, I pray You, Your servant this day and grant him mercy in the sight of this man. For I was cupbearer to the king."}]