[{"num":17,"verse":"In the twelfth year of Ahaz king of Judah, Hoshea son of Elah began his nine-year reign in Samaria over Israel."},{"num":2,"verse":"He did evil in the sight of the Lord, but not as Israel’s kings before him did."},{"num":3,"verse":"Against him came up Shalmaneser king of Assyria, and Hoshea became his servant and brought him tribute."},{"num":4,"verse":"But the king of Assyria found treachery in Hoshea, for he had sent messengers to So king of Egypt and offered no tribute to the king of Assyria, as he had done year by year; therefore the king of Assyria shut him up and bound him in prison."},{"num":5,"verse":"Then the king of Assyria invaded all the land and went up to Samaria and besieged it for three years."},{"num":6,"verse":"In the ninth year of Hoshea, the king of Assyria took Samaria and carried the Israelites away into Assyria, and placed them in Halah and in Habor by the river of Gozan and in the cities of the Medes."},{"num":7,"verse":"This was so because the Israelites had sinned against the Lord their God, Who had brought them out of the land of Egypt, from under the hand of Pharaoh king of Egypt; and they had feared other gods"},{"num":8,"verse":"And walked in the customs of the [heathen] nations whom the Lord drove out before the Israelites, customs the kings of Israel had introduced."},{"num":9,"verse":"The Israelites did secretly against the Lord their God things not right. They built for themselves high places in all their towns, from [lonely] watchtower to [populous] fortified city."},{"num":10,"verse":"They set up for themselves pillars and Asherim [symbols of the goddess Asherah] on every high hill and under every green tree."},{"num":11,"verse":"There they burned incense on all the high places, as did the nations whom the Lord carried away before them; and they did wicked things provoking the Lord to anger."},{"num":12,"verse":"And they served idols, of which the Lord had said to them, You shall not do this thing."},{"num":13,"verse":"Yet the Lord warned Israel and Judah through all the prophets and all the seers, saying, Turn from your evil ways and keep My commandments and My statutes, according to all the Law which I commanded your fathers and which I sent to you by My servants the prophets."},{"num":14,"verse":"Yet they would not hear, but hardened their necks as did their fathers who did not believe (trust in, rely on, and remain steadfast to) the Lord their God."},{"num":15,"verse":"They despised and rejected His statutes and His covenant which He made with their fathers and His warnings to them, and they followed vanity (false gods—falsehood, emptiness, and futility) and [they themselves and their prayers] became false (empty and futile). They went after the heathen round about them, of whom the Lord had charged them that they should not do as they did."},{"num":16,"verse":"And they forsook all the commandments of the Lord their God and made for themselves molten images, even two calves, and made an Asherah and worshiped all the [starry] hosts of the heavens and served Baal."},{"num":17,"verse":"They caused their sons and their daughters to pass through the fire and used divination and enchantments and sold themselves to do evil in the sight of the Lord, provoking Him to anger."},{"num":18,"verse":"Therefore the Lord was very angry with Israel and removed them out of His sight. None was left but the tribe of Judah."},{"num":19,"verse":"Judah also did not keep the commandments of the Lord their God, but walked in the customs which Israel introduced."},{"num":20,"verse":"The Lord rejected all the descendants of Israel and afflicted them and delivered them into the hands of spoilers, until He had cast them out of His sight."},{"num":21,"verse":"For He tore Israel from the house of David; and they made Jeroboam son of Nebat king. And Jeroboam drew and drove Israel away from following the Lord and made them sin a great sin."},{"num":22,"verse":"For the Israelites walked in all the sins Jeroboam committed; they departed not from them"},{"num":23,"verse":"Until the Lord removed Israel from His sight, as He had foretold by all His servants the prophets. So Israel was carried away from their own land to Assyria to this day."},{"num":24,"verse":"The king of Assyria brought men from Babylon, Cuthah, Avva, Hamath, and Sepharvaim and placed them in the cities of Samaria instead of the Israelites. They possessed Samaria and dwelt in its cities."},{"num":25,"verse":"At the beginning of their dwelling there, they did not fear and revere the Lord. Therefore the Lord sent lions among them, which killed some of them."},{"num":26,"verse":"So the king of Assyria was told: The nations you removed and placed in the cities of Samaria do not know the manner in which the God of the land requires their worship. Therefore He has sent lions among them, and behold, they are killing them, because they do not know the manner of [worship demanded by] the God of the land."},{"num":27,"verse":"Then the king of Assyria commanded, Take to Samaria one of the priests you brought from there, and let him [and his helpers] go and live there and let him teach the people the law of the God of the land."},{"num":28,"verse":"So one of the priests whom they had carried away from Samaria came and dwelt in Bethel and taught them how they should fear and revere the Lord."},{"num":29,"verse":"But every nationality still made gods of their own and put them in the shrines of the high places which the Samaritans had made, every nationality in the city in which they dwelt."},{"num":30,"verse":"The men of Babylon made [and worshiped their deity] Succoth-benoth, the men of Cuth made Nergal, the men of Hamath made Ashima,"},{"num":31,"verse":"The Avvites made Nibhaz and Tartak, and the Sepharvites burned their children in the fire to Adrammelech and Anammelech, the gods of Sepharvaim."},{"num":32,"verse":"So they feared the Lord, yet appointed from among themselves, whether high or low, priests of the high places, who sacrificed for them in the shrines of the high places."},{"num":33,"verse":"They feared the Lord, yet served their own gods, as did the nations from among whom they had been carried away."},{"num":34,"verse":"Unto this day they do after their former custom: they do not fear the Lord [as God sees it], neither do they obey the statutes or the ordinances or the law and commandment which the Lord commanded the children of Jacob, whom He named Israel,"},{"num":35,"verse":"With whom the Lord had made a covenant and commanded them, You shall not fear other gods or bow yourselves to them or serve them or sacrifice to them."},{"num":36,"verse":"But you shall [reverently] fear, bow yourselves to, and sacrifice to the Lord, Who brought you out of the land of Egypt with great power and an outstretched arm."},{"num":37,"verse":"And the statutes, ordinances, law, and commandment which He wrote for you you shall observe and do forevermore; you shall not fear other gods."},{"num":38,"verse":"And the covenant that I have made with you you shall not forget; you shall not fear other gods."},{"num":39,"verse":"But the Lord your God you shall [reverently] fear; then He will deliver you out of the hands of all your enemies."},{"num":40,"verse":"However, they did not listen, but they did as they had done formerly."},{"num":41,"verse":"So these nations [vainly] feared the Lord and also served their graven images, as did their children and their children’s children. As their fathers did, so do they to this day."}]