[[],[{"type":"header","content":"The Temptation of Jesus"},{"type":"prose","content":"And Jesus, full of the Holy Spirit, returned from the Jordan and was led by the Spirit in the wilderness"}],[{"type":"prose","content":"for forty days, being tempted by the devil. And he ate nothing during those days. And when they were ended, he was hungry."}],[{"type":"prose","content":"The devil said to him, “If you are the Son of God, command this stone to become bread.”"}],[{"type":"prose","content":"And Jesus answered him, "}],[{"type":"prose","content":"And the devil took him up and showed him all the kingdoms of the world in a moment of time,"}],[{"type":"prose","content":"and said to him, “To you I will give all this authority and their glory, for it has been delivered to me, and I give it to whom I will."}],[{"type":"prose","content":"If you, then, will worship me, it will all be yours.”"}],[{"type":"prose","content":"And Jesus answered him, "}],[{"type":"prose","content":"And he took him to Jerusalem and set him on the pinnacle of the temple and said to him, “If you are the Son of God, throw yourself down from here,"}],[{"type":"prose","content":"for it is written,"}],[{"type":"prose","content":"and"}],[{"type":"prose","content":"And Jesus answered him, "}],[{"type":"prose","content":"And when the devil had ended every temptation, he departed from him until an opportune time."},{"type":"header","content":"Jesus Begins His Ministry"}],[{"type":"prose","content":"And Jesus returned in the power of the Spirit to Galilee, and a report about him went out through all the surrounding country."}],[{"type":"prose","content":"And he taught in their synagogues, being glorified by all."},{"type":"header","content":"Jesus Rejected at Nazareth"}],[{"type":"prose","content":"And he came to Nazareth, where he had been brought up. And as was his custom, he went to the synagogue on the Sabbath day, and he stood up to read."}],[{"type":"prose","content":"And the scroll of the prophet Isaiah was given to him. He unrolled the scroll and found the place where it was written,"}],[{"type":"prose","content":"And he rolled up the scroll and gave it back to the attendant and sat down. And the eyes of all in the synagogue were fixed on him."}],[{"type":"prose","content":"And he began to say to them, "}],[{"type":"prose","content":"And all spoke well of him and marveled at the gracious words that were coming from his mouth. And they said, “Is not this Joseph's son?”"}],[{"type":"prose","content":"And he said to them, "}],[{"type":"prose","content":"And he said, "}],[{"type":"prose","content":"When they heard these things, all in the synagogue were filled with wrath."}],[{"type":"prose","content":"And they rose up and drove him out of the town and brought him to the brow of the hill on which their town was built, so that they could throw him down the cliff."}],[{"type":"prose","content":"But passing through their midst, he went away."},{"type":"header","content":"Jesus Heals a Man with an Unclean Demon"}],[{"type":"prose","content":"And he went down to Capernaum, a city of Galilee. And he was teaching them on the Sabbath,"}],[{"type":"prose","content":"and they were astonished at his teaching, for his word possessed authority."}],[{"type":"prose","content":"And in the synagogue there was a man who had the spirit of an unclean demon, and he cried out with a loud voice,"}],[{"type":"prose","content":"“Ha! What have you to do with us, Jesus of Nazareth? Have you come to destroy us? I know who you are—the Holy One of God.”"}],[{"type":"prose","content":"But Jesus rebuked him, saying,  And when the demon had thrown him down in their midst, he came out of him, having done him no harm."}],[{"type":"prose","content":"And they were all amazed and said to one another, “What is this word? For with authority and power he commands the unclean spirits, and they come out!”"}],[{"type":"prose","content":"And reports about him went out into every place in the surrounding region."},{"type":"header","content":"Jesus Heals Many"}],[{"type":"prose","content":"And he arose and left the synagogue and entered Simon's house. Now Simon's mother-in-law was ill with a high fever, and they appealed to him on her behalf."}],[{"type":"prose","content":"And he stood over her and rebuked the fever, and it left her, and immediately she rose and began to serve them."}],[{"type":"prose","content":"Now when the sun was setting, all those who had any who were sick with various diseases brought them to him, and he laid his hands on every one of them and healed them."}],[{"type":"prose","content":"And demons also came out of many, crying, “You are the Son of God!” But he rebuked them and would not allow them to speak, because they knew that he was the Christ."},{"type":"header","content":"Jesus Preaches in Synagogues"}],[{"type":"prose","content":"And when it was day, he departed and went into a desolate place. And the people sought him and came to him, and would have kept him from leaving them,"}],[{"type":"prose","content":"but he said to them, "}],[{"type":"prose","content":"And he was preaching in the synagogues of Judea."}]]