[{"num":4,"verse":"Then de Jesus Iēsous,  full plērēs of  the  Holy hagios Spirit pneuma,  returned hypostrephō from apo the ho Jordan Iordanēs and kai was  led agō by en the ho Spirit pneuma in en the ho wilderness erēmos"},{"num":2,"verse":"for  forty tesserakonta days hēmera,  being  tempted peirazō by hypo the ho devil diabolos.  And kai he  ate esthiō nothing oudeis during en · ho those ekeinos days hēmera,  so kai when  they autos were  completed synteleō he  was  hungry peinaō. "},{"num":3,"verse":"The ho devil diabolos said legō · de to  him autos, “ If ei you  are eimi the  Son hyios of ho God theos,  tell legō · ho this houtos stone lithos to hina become ginomai bread artos.” "},{"num":4,"verse":"And kai Jesus Iēsous answered apokrinomai pros him autos,  · ho “ It  is  written graphō, ‘ Man anthrōpos shall zaō not ou live zaō by epi bread artos alone monos.’”  · ho"},{"num":5,"verse":"Then kai he  led anagō him autos up  and  showed deiknymi him autos all pas the ho kingdoms basileia of  the ho world oikoumenē in en a  moment stigmē of  time chronos. "},{"num":6,"verse":"· kai The ho devil diabolos said legō to  him autos, “ To  you sy I  will  give didōmi · ho all hapas this houtos authority exousia and kai · ho their autos glory doxa,  for hoti to  me egō it  has  been  handed paradidōmi over ,  and kai to  whomever hos I  desire thelō,  I  give didōmi it autos. "},{"num":7,"verse":"If ean you sy then oun will  bow  down  and  worship proskyneō me egō,  all pas this  will  be eimi yours sy.” "},{"num":8,"verse":"But kai Jesus Iēsous answered apokrinomai,  · ho saying legō to  him autos, “ It  is  written graphō, ‘ You  shall  worship proskyneō the  Lord kyrios · ho your sy God theos and kai him autos only monos shall  you  serve latreuō.’” "},{"num":9,"verse":"Then de he  took agō him autos to eis Jerusalem Ierousalēm and kai set histēmi him  on epi the ho pinnacle pterygion of  the ho temple hieron and kai said legō to  him autos, “ If ei you  are eimi the  Son hyios of ho God theos,  throw ballō yourself seautou down katō from enteuthen here ; "},{"num":10,"verse":"for gar it  is  written graphō, ‘ To ho his autos angels angelos he  will  give entellō orders  concerning peri you sy,  to ho protect diaphylassō you sy,’ "},{"num":11,"verse":"and kai, ‘ On epi their  hands cheir they  will  raise airō you sy up ,  so mēpote that  you  will  not  strike proskoptō your sy foot pous against pros a  stone lithos.’”  · ho"},{"num":12,"verse":"But kai answering apokrinomai Jesus Iēsous said legō to  him autos,  · ho “ It  has  been  said legō, ‘ You  are  not ou to  put ekpeirazō the  Lord kyrios · ho your sy God theos to  the  test .’” "},{"num":13,"verse":"And kai when  he  had  completed synteleō every pas kind  of  temptation peirasmos,  the ho devil diabolos departed aphistēmi from apo him autos until achri a  more  favorable  time kairos. "},{"num":14,"verse":"Then kai Jesus Iēsous returned hypostrephō · ho in en the ho power dynamis of  the ho Spirit pneuma to eis · ho Galilee Galilaia,  and kai a  report phēmē about peri him autos spread exerchomai throughout kata the ho whole holos countryside perichōros. "},{"num":15,"verse":"· kai He autos was  teaching didaskō in en · ho their autos synagogues synagōgē,  being  praised doxazō by hypo everyone pas. "},{"num":16,"verse":"· kai He  went erchomai to eis Nazareth Nazara where hou he  had  been eimi brought trephō up  and kai,  as kata was  · ho his autos custom eiōtha on en the ho Sabbath sabbaton day hēmera,  · ho he  went eiserchomai into eis the ho synagogue synagōgē and kai stood anistēmi up  to  read anaginōskō. "},{"num":17,"verse":"And kai the  scroll biblion of  the ho prophet prophētēs Isaiah ēsaias was  given epididōmi to  him autos,  and kai when  he  had  unrolled anaptyssō the ho scroll biblion,  he  found heuriskō the ho place topos where hou it  was eimi written graphō, "},{"num":18,"verse":"“The  Spirit pneuma of  the  Lord kyrios is  upon epi me egō,  because hos heineken he  has  anointed chriō me egō to  preach euangelizō the  good  news  to  the  poor ptōchos.  He  has  sent apostellō me egō to  proclaim kēryssō liberty aphesis to  the  captives aichmalōtos and kai recovery  of  sight anablepsis to  the  blind typhlos,  to  send apostellō the  oppressed thrauō away  in en liberty aphesis, "},{"num":19,"verse":"to  proclaim kēryssō the  year eniautos acceptable dektos to  the  Lord kyrios.” "},{"num":20,"verse":"· kai When  he  had  rolled ptyssō the ho scroll biblion and  given apodidōmi it  back  to  the ho attendant hypēretēs,  he  sat kathizō down .  And kai the ho eyes ophthalmos of  everyone pas in en the ho synagogue synagōgē were eimi fixed atenizō on  him autos. "},{"num":21,"verse":"And de he  set archō about  telling legō pros them autos, “ Today sēmeron this houtos scripture graphē has  been  fulfilled plēroō · ho in en · ho your hymeis ears ous.” "},{"num":22,"verse":"· kai They  were  all pas bearing martyreō witness  to  him autos in that  · kai they  were  marveling thaumazō at epi the ho gracious charis words logos · ho that ho were  coming ekporeuomai from ek · ho his autos mouth stoma.  Then kai they  said legō, “ Is eimi not ouchi this houtos Joseph’ s Iōsēph son hyios?” "},{"num":23,"verse":"And kai he  said legō to pros them autos, “ No  doubt pantōs you  will  quote legō this houtos proverb parabolē to  me egō:  · ho ‘ Physician iatros,  heal therapeuō yourself seautou.’  What hosos we  have  heard akouō happened ginomai in eis · ho Capernaum Kapharnaoum,  do poieō also kai here hōde in en · ho your sy hometown patris.” "},{"num":24,"verse":"And de he  said legō, “ I  tell legō you hymeis the  truth amēn,  no oudeis prophet prophētēs is eimi acceptable dektos in en · ho his autos hometown patris. "},{"num":25,"verse":"But de in epi truth alētheia I  tell legō you hymeis,  there  were eimi many polys widows chēra in en Israel Israēl in en the ho days hēmera of  Elijah ēlias,  · ho when hote the ho sky ouranos was  shut kleiō up  for epi three treis years etos and kai six hex months mēn,  as hōs a  great megas famine limos spread ginomai throughout epi the  whole pas · ho land gē; "},{"num":26,"verse":"and kai to pros none oudeis of  them autos was  Elijah ēlias sent pempō,  only ei mē to eis Zarephath Sarepta, in the territory  of ho Sidon Sidōnios,  to pros a  widow chēra woman gynē. "},{"num":27,"verse":"And kai there  were eimi many polys lepers lepros in en · ho Israel Israēl in epi the time  of  Elisha Elisaios the ho prophet prophētēs,  and kai none oudeis of  them autos was  cleansed katharizō,  only ei mē Naaman Naiman,  the ho Syrian Syros.” "},{"num":28,"verse":"And kai everyone pas in en the ho synagogue synagōgē was  filled pimplēmi with  wrath thumos when  they  heard akouō these houtos things . "},{"num":29,"verse":"· kai They  rose anistēmi up ,  drove ekballō him autos out exō of  the ho town polis,  and kai took agō him autos to heōs a  cliff ophrys of  the ho hill oros on epi which hos · ho their autos town polis was  built oikodomeō,  so hōste that  they  could  cast katakrēmnizō him autos down . "},{"num":30,"verse":"But de he autos passed dierchomai through dia their autos midst mesos and  went poreuō on  his  way . "},{"num":31,"verse":"And kai he  went katerchomai down  to eis Capernaum Kapharnaoum, a  city polis of ho Galilee Galilaia.  · kai He  was eimi teaching didaskō them autos on en the ho Sabbath sabbaton; "},{"num":32,"verse":"and kai they  were  astonished ekplēssō at epi · ho his autos teaching didachē,  because hoti his autos message logos was eimi with en authority exousia.  · ho"},{"num":33,"verse":"Now kai in en the ho synagogue synagōgē there  was eimi a  man anthrōpos who  had echō the  spirit pneuma of  an  unclean akathartos demon daimonion,  and kai he  cried anakrazō out  in  a  loud megas voice phōnē, "},{"num":34,"verse":"“ Ha ea!  What tis do  you sy have to do  with  us hēmeis,  · kai Jesus Iēsous of  Nazareth Nazarēnos?  Have  you  come erchomai to  destroy apollymi us hēmeis?  I  know oida who tis you sy are eimi— the ho Holy hagios One  of ho God theos!” "},{"num":35,"verse":"But kai Jesus Iēsous rebuked epitimaō him autos,  · ho saying legō, “ Be  quiet phimoō,  and kai come exerchomai out  of apo him autos!”  And kai when  the ho demon daimonion had  thrown rhiptō him autos down  in eis their ho midst mesos,  he  came exerchomai out  of apo him autos,  having  done  him autos no mēdeis harm blaptō. "},{"num":36,"verse":"· kai Astonishment thambos came ginomai over epi them  all pas,  and kai they  said syllaleō to pros one allēlōn another , “ What tis is  · ho this houtos teaching logos?  For hoti with en authority exousia and kai power dynamis he  commands epitassō the ho unclean akathartos spirits pneuma and kai they  come exerchomai out !” "},{"num":37,"verse":"So kai the  news ēchos about peri him autos went ekporeuomai out  into eis every pas place topos in  the ho surrounding perichōros region . "},{"num":38,"verse":"After  leaving anistēmi · de from apo the ho synagogue synagōgē, Jesus  went eiserchomai to eis · ho Simon’ s Simōn house oikia.  Now de Simon’ s Simōn mother-in-law penthera · ho was eimi suffering synechō a  severe megas fever pyretos,  and kai they  made erōtaō a  request  to  him autos on peri her autos behalf. "},{"num":39,"verse":"· kai Standing ephistēmi over epanō her autos he  rebuked epitimaō the ho fever pyretos,  and kai it  left aphiēmi her autos.  Immediately parachrēma · de she  got anistēmi up  and began to  wait diakoneō on  them autos. "},{"num":40,"verse":"As  the ho sun hēlios was  going dynō down ,  · de all hapas those  who hosos had echō any  sick astheneō with  various poikilos diseases nosos brought agō them autos to pros him autos.  · ho · de Placing epitithēmi his ho hands cheir on  each hekastos one heis of  them autos,  he  healed therapeuō them autos. "},{"num":41,"verse":"Also kai,  demons daimonion came exerchomai out  · de from apo many polys,  crying kraugazō out  and kai saying legō, “ You sy are eimi the ho Son hyios of ho God theos!”  But kai he  rebuked epitimaō them and  did  not ou allow eaō them autos to  speak laleō,  because hoti they  knew oida him autos to  be eimi the ho Christ Christos. "},{"num":42,"verse":"When  daylight hēmera came ginomai · de he  left exerchomai and  went poreuō to eis a  deserted erēmos place topos.  And kai the ho crowds ochlos were  looking epizēteō for  him autos.  · kai They  came erchomai to heōs him autos and kai tried  to  keep katechō him autos · ho from mē leaving poreuō apo them autos, "},{"num":43,"verse":"but de he ho said legō to pros them autos, “ I egō must dei preach  the  good  news euangelizō of  the ho kingdom basileia of ho God theos in  the ho other heteros towns polis as  well kai;  because hoti for epi this houtos purpose  I  was  sent apostellō.” "},{"num":44,"verse":"So kai he  kept eimi on  preaching kēryssō in eis the ho synagogues synagōgē of ho Judea Ioudaia. "}]