[[],[{"type":"prose","content":"A Prayer of David. Incline, O Jehovah, Thine ear, Answer me, for I [am] poor and needy."}],[{"type":"prose","content":"Keep my soul, for I [am] pious, Save Thy servant -- who is trusting to Thee, O Thou, my God."}],[{"type":"prose","content":"Favour me, O Lord, for to Thee I call all the day."}],[{"type":"prose","content":"Rejoice the soul of Thy servant, For unto Thee, O Lord, my soul I lift up."}],[{"type":"prose","content":"For Thou, Lord, [art] good and forgiving. And abundant in kindness to all calling Thee."}],[{"type":"prose","content":"Hear, O Jehovah, my prayer, And attend to the voice of my supplications."}],[{"type":"prose","content":"In a day of my distress I call Thee, For Thou dost answer me."}],[{"type":"prose","content":"There is none like Thee among the gods, O Lord, And like Thy works there are none."}],[{"type":"prose","content":"All nations that Thou hast made Come and bow themselves before Thee, O Lord, And give honour to Thy name."}],[{"type":"prose","content":"For great [art] Thou, and doing wonders, Thou [art] God Thyself alone."}],[{"type":"prose","content":"Show me, O Jehovah, Thy way, I walk in Thy truth, My heart doth rejoice to fear Thy name."}],[{"type":"prose","content":"I confess Thee, O Lord my God, with all my heart, And I honour Thy name to the age."}],[{"type":"prose","content":"For Thy kindness [is] great toward me, And Thou hast delivered my soul from the lowest Sheol."}],[{"type":"prose","content":"O God, the proud have risen up against me, And a company of the terrible sought my soul, And have not placed Thee before them,"}],[{"type":"prose","content":"And Thou, O Lord, [art] God, merciful and gracious, Slow to anger, and abundant in kindness and truth."}],[{"type":"prose","content":"Look unto me, and favour me, Give Thy strength to Thy servant, And give salvation to a son of Thine handmaid."}],[{"type":"prose","content":"Do with me a sign for good, And those hating me see and are ashamed, For Thou, O Jehovah, hast helped me, Yea, Thou hast comforted me!"}]]