[{"num":1,"verse":"¶ I will bless the LORD at all times: his praise shall continually be in my mouth."},{"num":2,"verse":"My soul shall glory in the LORD; the meek shall hear of this, and be glad."},{"num":3,"verse":"O magnify the LORD with me, and let us exalt his name together."},{"num":4,"verse":"I sought the LORD, and he heard me and delivered me from all my fears."},{"num":5,"verse":"They looked unto him and were lightened, and their faces were not ashamed."},{"num":6,"verse":"This poor man cried out, and the LORD heard him and saved him out of all his troubles."},{"num":7,"verse":"The angel of the LORD encamps round about those that fear him and delivers them."},{"num":8,"verse":"O taste and see that the LORD is good; blessed is the man that shall trust in him."},{"num":9,"verse":"O fear the LORD, ye his saints; for those that fear him lack nothing."},{"num":10,"verse":"The young lions do lack and suffer hunger, but those that seek the LORD shall not lack any good thing."},{"num":11,"verse":"¶ Come, ye children, hearken unto me; I will teach you the fear of the LORD."},{"num":12,"verse":"Who is the man that desires life and loves many days that he may see good?"},{"num":13,"verse":"Keep thy tongue from evil, and thy lips from speaking guile."},{"num":14,"verse":"Depart from evil, and do good; seek peace, and pursue it."},{"num":15,"verse":"The eyes of the LORD are upon the righteous, and his ears are open unto their cry."},{"num":16,"verse":"The anger of the LORD is against those that do evil to cut off the remembrance of them from the earth."},{"num":17,"verse":"The righteous cried out, and the LORD heard and delivered them out of all their troubles."},{"num":18,"verse":"The LORD is near unto those that are of a broken heart and saves such as are of a contrite spirit."},{"num":19,"verse":"Many are the afflictions of the righteous, but the LORD shall deliver him out of them all,"},{"num":20,"verse":"keeping all his bones; not one of them shall be broken."},{"num":21,"verse":"Evil shall slay the wicked; and those that hate the righteous shall be declared guilty."},{"num":22,"verse":"The LORD ransoms the soul of his slaves, and none of those that trust in him shall be declared guilty."}]