[{"header":"Those Who Trust in God Are Happy"},{"num":34,"verse":"I will honor the Lord at all times. His praise will always be in my mouth. "},{"num":2,"verse":"My soul will be proud to tell about the Lord. Let those who suffer hear it and be filled with joy. "},{"num":3,"verse":"Give great honor to the Lord with me. Let us praise His name together."},{"num":4,"verse":"I looked for the Lord, and He answered me. And He took away all my fears. "},{"num":5,"verse":"They looked to Him and their faces shined with joy. Their faces will never be ashamed. "},{"num":6,"verse":"This poor man cried, and the Lord heard him. And He saved him out of all his troubles. "},{"num":7,"verse":"The angel of the Lord stays close around those who fear Him, and He takes them out of trouble."},{"num":8,"verse":"O taste and see that the Lord is good. How happy is the man who trusts in Him! "},{"num":9,"verse":"O fear the Lord, all you who belong to Him. For those who fear Him never want for anything. "},{"num":10,"verse":"The young lions suffer want and hunger. But they who look for the Lord will not be without any good thing. "},{"num":11,"verse":"Come, you children, listen to me. I will teach you the fear of the Lord. "},{"num":12,"verse":"Who is the man who has a desire for life, and wants to live long so that he may see good things? "},{"num":13,"verse":"Keep your tongue from sin and your lips from speaking lies. "},{"num":14,"verse":"Turn away from what is sinful. Do what is good. Look for peace and follow it."},{"num":15,"verse":"The eyes of the Lord are on those who do what is right and good. His ears are open to their cry. "},{"num":16,"verse":"The face of the Lord is against those who sin. He will keep the people of the earth from remembering them. "},{"num":17,"verse":"Those who are right with the Lord cry, and He hears them. And He takes them from all their troubles. "},{"num":18,"verse":"The Lord is near to those who have a broken heart. And He saves those who are broken in spirit."},{"num":19,"verse":"A man who does what is right and good may have many troubles. But the Lord takes him out of them all. "},{"num":20,"verse":"He keeps all his bones safe. Not one of them is broken. "},{"num":21,"verse":"Sin will kill the sinful. And those who hate God’s people will be held guilty and punished forever. "},{"num":22,"verse":"The Lord saves the soul of those who work for Him. None of those who trust in Him will be held guilty."}]