[{"num":2,"verse":"(Of Dovid, when he feigned insanity before Avimelech, who drove him away, and he went out) I will make a bracha of praise unto Hashem at all times; His praise shall continually be in my mouth."},{"num":3,"verse":"My nefesh shall make its boast in Hashem; the anavim (humble) shall hear thereof, and be glad."},{"num":4,"verse":"O magnify Hashem with me, and let us exalt Shmo together."},{"num":5,"verse":"I sought Hashem, and He heard me, and delivered me from all my fears."},{"num":6,"verse":"They looked unto Him, and were radiant; and their panim were not ashamed."},{"num":7,"verse":"The oni (poor man) cried, and Hashem heard him, and saved him out of all his tzoros."},{"num":8,"verse":"The Malach Hashem encampeth round about them that fear Him, and delivereth them."},{"num":9,"verse":"O taste and see that Hashem is tov; ashrei is the man that taketh refuge in Him."},{"num":10,"verse":"O fear Hashem, ye His Kedoshim; for there is no lack to them that fear Him."},{"num":11,"verse":"The young lions do lack, and suffer hunger; but they that seek Hashem shall not lack any good thing."},{"num":12,"verse":"Come, ye banim, pay heed unto me; I will teach you the fear of Hashem."},{"num":13,"verse":"What ish is he that desireth chayyim, and loveth many days, that he may see tov?"},{"num":14,"verse":"Keep thy tongue from rah, and thy lips from speaking mirmah (guile, see Isaiah 53:9 where it says Moshiach will lack mirmah)."},{"num":15,"verse":"Depart from rah, and do tov; seek shalom, and pursue it."},{"num":16,"verse":"The eyes of Hashem are upon the tzaddikim, and His ears open to their cry."},{"num":17,"verse":"The face of Hashem is against them that do rah, to cut off the zekher (remembrance) of them from ha’aretz."},{"num":18,"verse":"The tzaddikim cry, and Hashem heareth, and delivereth them out of all their tzoros."},{"num":19,"verse":"Hashem is near unto them whose lev is broken; and saveth such whose ruach is contrite."},{"num":20,"verse":"Many are the afflictions of the tzaddik; but Hashem delivereth him out of them all."},{"num":21,"verse":"He keepeth shomer over all his bones; not one of them is broken [Yn 19:36]."},{"num":22,"verse":"Evil shall slay the resha’im; and they that hate the tzaddik shall be desolate."},{"num":23,"verse":"Hashem redeemeth the nefesh of His avadim; and none of them that take refuge in Him shall be condemned [see Ro 5:1; 8:1 OJBC]."}]