[{"num":34,"verse":"To David, when he changed his mouth, or his word, before Abimelech, and he drove out David, and he went forth. I shall bless the Lord in all time; ever[more] his praising be in my mouth. (To David, when he changed his face, and his words, before Abimelech, who then drove David out, and so he went forth. I shall always bless the Lord; his praises shall be in my mouth forevermore.)"},{"num":2,"verse":"My soul shall be praised in the Lord; mild men hear, and be glad. (My soul shall have glory in the Lord; let the humble hear, and be glad.)"},{"num":3,"verse":"Magnify ye the Lord with me; and enhance we his name into itself (and let us exalt his name together)."},{"num":4,"verse":"I sought the Lord, and he heard me; and he delivered me from all my tribulations (and he rescued, or saved, me, from all of my troubles)."},{"num":5,"verse":"Nigh ye to him, and be ye lightened (Go ye near to him, and ye shall shine with joy); and your faces shall not be shamed."},{"num":6,"verse":"This poor man cried, and the Lord heard him; and saved him from all his tribulations."},{"num":7,"verse":"The angel of the Lord sendeth in the compass of men dreading him; and he shall deliver them. (The angel of the Lord guardeth those who fear him/who revere him; and he rescueth them.)"},{"num":8,"verse":"Taste ye, and see, for the Lord is sweet; blessed is the man, that hopeth in him. (Taste ye, and see, that the Lord is good; happy is the person, who trusteth in him.)"},{"num":9,"verse":"All ye holy men of the Lord, dread ye him; for no neediness is to men dreading him. (All ye holy people of the Lord, fear him; for there is no neediness in those who fear him./All ye holy people of the Lord, revere him; for there is no neediness in those who revere him.)"},{"num":10,"verse":"Rich men were needy, and were hungry; but men that seek the Lord shall not fail of all good (but those who seek the Lord shall not lack any good thing)."},{"num":11,"verse":"Come, ye sons, hear ye me; I shall teach you the dread of the Lord. (Come, ye sons and daughters, and listen ye to me; I shall teach you the fear of the Lord/I shall teach you to revere the Lord.)"},{"num":12,"verse":"Who is the man, that willeth life; that loveth to see good days? (Who is the person who desireth life? who loveth to see good days?)"},{"num":13,"verse":"Forbid thy tongue from evil; and thy lips speak not guile (and do not let thy lips speak deceitfully)."},{"num":14,"verse":"Turn thou away from evil, and do good; seek thou peace, and perfectly follow thou it."},{"num":15,"verse":"The eyes of the Lord be on just men (The eyes of the Lord be on the righteous); and his ears be to their prayers."},{"num":16,"verse":"But the cheer of the Lord is on men doing evils; that he lose the mind of them from [the] earth. (But the face of the Lord is against those who do evil; and he shall blot out the memory of them from off the earth.)"},{"num":17,"verse":"Just men cried [The rightwise cried], and the Lord heard them; and delivered them from all their tribulations (and he rescued, or saved, them from all their troubles)."},{"num":18,"verse":"The Lord is nigh [to] them that be of troubled heart; and he shall save meek men in spirit. (The Lord is near to those who have a troubled heart; and he saveth those whose spirit is meek, or is humble.)"},{"num":19,"verse":"Many tribulations be of just men; and the Lord shall deliver them from all these. (Many troubles be to the righteous; but the Lord shall rescue, or save, them out of all of them.)"},{"num":20,"verse":"The Lord keepeth all the bones of them; one of those shall not be broken. (The Lord guardeth, or keepeth safe, all their bones; not one of them shall be broken.)"},{"num":21,"verse":"The death of sinners is worst; and they that hate a just man shall trespass. (The death of sinners is brought about by the Worst/Evil bringeth about the death of sinners; and those who hate the righteous shall be punished.)"},{"num":22,"verse":"The Lord shall again-buy the souls of his servants; and all, that hope in him, shall not trespass. (But the Lord redeemeth, or ransometh, the souls of his servants; and all who trust in him, shall not go astray.)"}]