[[],[{"type":"header","content":"Cities of Refuge"},{"type":"prose","content":"“When the LORD your God cuts off the nations whose land the LORD your God is giving you, and you dispossess them and settle in their cities and in their houses,"}],[{"type":"prose","content":"you shall set aside for yourself three cities in the midst of your land which the LORD your God is giving you to possess."}],[{"type":"prose","content":"You shall prepare the roads for yourself, and divide into three regions the territory of your land which the LORD your God will give you as an inheritance, so that anyone who commits manslaughter may flee there."}],[{"type":"prose","content":"“Now this is the case of the one who commits manslaughter, who may flee there and live: when he kills his friend unintentionally, not hating him previously—"}],[{"type":"prose","content":"as when  goes into the forest with his friend to cut wood, and his hand swings the axe to cut down the tree, and the iron  slips off the handle and strikes his friend so that he dies—he may flee to one of these cities and live."}],[{"type":"prose","content":"Otherwise, the avenger of blood might pursue him in the heat of his anger, and overtake him because the way is long, and take his life, though he was not sentenced to death since he had not hated him previously."}],[{"type":"prose","content":"Therefore I command you, saying, ‘You shall set aside for yourself three cities.’"}],[{"type":"prose","content":"“And if the LORD your God enlarges your territory, just as He has sworn to your fathers, and gives you all the land that He promised to give your fathers—"}],[{"type":"prose","content":"if you carefully follow all of this commandment which I am commanding you today, to love the LORD your God, and to walk in His ways always—then you shall add three more cities for yourself, besides these three."}],[{"type":"prose","content":"So innocent blood will not be shed in the midst of your land which the LORD your God is giving you as an inheritance, and guilt for bloodshed will  be on you."}],[{"type":"prose","content":"“But if there is a person who hates his neighbor, and waits in ambush for him and rises up against him and strikes him so that he dies, and he flees to one of these cities,"}],[{"type":"prose","content":"then the elders of his city shall send  and take him from there, and hand him over to the avenger of blood, so that he may die."}],[{"type":"prose","content":"You shall not pity him, but you shall eliminate the guilt for the bloodshed of the innocent from Israel, so that it may go well for you."}],[{"type":"header","content":"Laws of Landmark and Testimony"},{"type":"prose","content":"“You shall not displace your neighbor’s boundary marker, which the ancestors have set, in your inheritance which you will inherit in the land that the LORD your God is giving you to possess."}],[{"type":"prose","content":"“A single witness shall not rise up against a person regarding any wrongdoing or any sin that he commits; on the testimony of two or three witnesses a matter shall be confirmed."}],[{"type":"prose","content":"If a malicious witness rises up against a person to testify against him of wrongdoing,"}],[{"type":"prose","content":"then both people who have the dispute shall stand before the LORD, before the priests and the judges who will be  in those days."}],[{"type":"prose","content":"And the judges shall investigate thoroughly, and if the witness is a false witness  he has testified against his brother falsely,"}],[{"type":"prose","content":"then you shall do to him just as he had planned to do to his brother. So you shall eliminate the evil from among you."}],[{"type":"prose","content":"And the rest  will hear and be afraid, and will never again do such an evil thing among you."}],[{"type":"prose","content":"So you shall not show pity: life for life, eye for eye, tooth for tooth, hand for hand,  foot for foot."}]]