[{"num":2,"verse":"And the third day, there was a marriage in Cana of Galilee: and the mother of Jesus was there."},{"num":2,"verse":"And Jesus also was invited, and his disciples, to the marriage."},{"num":3,"verse":"And the wine failing, the mother of Jesus saith to him: They have no wine."},{"num":4,"verse":"And Jesus saith to her: Woman, what is that to me and to thee? my hour is not yet come."},{"num":5,"verse":"His mother saith to the waiters: Whatsoever he shall say to you, do ye."},{"num":6,"verse":"Now there were set there six waterpots of stone, according to the manner of the purifying of the Jews, containing two or three measures apiece."},{"num":7,"verse":"Jesus saith to them: Fill the waterpots with water. And they filled them up to the brim."},{"num":8,"verse":"And Jesus saith to them: Draw out now, and carry to the chief steward of the feast. And they carried it."},{"num":9,"verse":"And when the chief steward had tasted the water made wine, and knew not whence it was, but the waiters knew who had drawn the water; the chief steward calleth the bridegroom,"},{"num":10,"verse":"And saith to him: Every man at first setteth forth good wine, and when men have well drunk, then that which is worse. But thou hast kept the good wine until now."},{"num":11,"verse":"This beginning of miracles did Jesus in Cana of Galilee; and manifested his glory, and his disciples believed in him."},{"num":12,"verse":"After this he went down to Capharnaum, he and his mother, and his brethren, and his disciples: and they remained there not many days."},{"num":13,"verse":"And the pasch of the Jews was at hand, and Jesus went up to Jerusalem."},{"num":14,"verse":"And he found in the temple them that sold oxen and sheep and doves, and the changers of money sitting."},{"num":15,"verse":"And when he had made, as it were, a scourge of little cords, he drove them all out of the temple, the sheep also and the oxen, and the money of the changers he poured out, and the tables he overthrew."},{"num":16,"verse":"And to them that sold doves he said: Take these things hence, and make not the house of my Father a house of traffic."},{"num":17,"verse":"And his disciples remembered, that it was written: The zeal of thy house hath eaten me up."},{"num":18,"verse":"The Jews, therefore, answered, and said to him: What sign dost thou shew unto us, seeing thou dost these things?"},{"num":19,"verse":"Jesus answered, and said to them: Destroy this temple, and in three days I will raise it up."},{"num":20,"verse":"The Jews then said: Six and forty years was this temple in building; and wilt thou raise it up in three days?"},{"num":21,"verse":"But he spoke of the temple of his body."},{"num":22,"verse":"When therefore he was risen again from the dead, his disciples remembered, that he had said this, and they believed the scripture, and the word that Jesus had said."},{"num":23,"verse":"Now when he was at Jerusalem, at the pasch, upon the festival day, many believed in his name, seeing his signs which he did."},{"num":24,"verse":"But Jesus did not trust himself unto them, for that he knew all men,"},{"num":25,"verse":"And because he needed not that any should give testimony of man: for he knew what was in man."}]