[{"header":"The First Sign Worked by Jesus"},{"header":"Chapter 2"},{"num":1,"verse":"The Wedding Feast at Cana. On the third day, there was a wedding at Cana in Galilee. The mother of Jesus was there,"},{"num":2,"verse":"and Jesus and his disciples had also been invited."},{"num":3,"verse":"When the wine was exhausted, the mother of Jesus said to him, “They have no wine.”"},{"num":4,"verse":"Jesus responded, “Woman, what concern is this to us? My hour has not yet come.”"},{"num":5,"verse":"His mother said to the servants, “Do whatever he tells you.”"},{"num":6,"verse":"Now standing nearby there were six stone water jars, of the type used for Jewish rites of purification, each holding twenty to thirty gallons."},{"num":7,"verse":"Jesus instructed the servants, “Fill the jars with water.” When they had filled them to the brim,"},{"num":8,"verse":"he ordered them, “Now draw some out and take it to the chief steward,” and they did so."},{"num":9,"verse":"When the chief steward tasted the water that had become wine, he did not know where it came from, although the servants who had drawn the water knew. The chief steward called over the bridegroom"},{"num":10,"verse":"and said, “Everyone serves the choice wine first, and then an inferior vintage when the guests have been drinking for a while. However, you have saved the best wine until now.”"},{"num":11,"verse":"Jesus performed this, the first of his signs, at Cana in Galilee, thereby revealing his glory, and his disciples believed in him."},{"num":12,"verse":"After this, he went down to Capernaum with his mother, his brethren, and his disciples, and they remained there for a few days."},{"header":"The Mystery of the New Temple"},{"num":13,"verse":"When the time of the Passover of the Jews was near, Jesus went up to Jerusalem."},{"num":14,"verse":"In the temple he found people selling cattle, sheep, and doves, as well as money changers seated at their tables."},{"num":15,"verse":"Making a whip of cords, he drove them all out of the temple, including the sheep and the cattle. He also overturned the tables of the money changers, scattering their coins,"},{"num":16,"verse":"and to those who were selling the doves he ordered, “Take them out of here! Stop turning my Father’s house into a marketplace!”"},{"num":17,"verse":"His disciples recalled the words of Scripture, “Zeal for your house will consume me.”"},{"num":18,"verse":"The Jews then challenged him, “What sign can you show us to justify your doing this?”"},{"num":19,"verse":"Jesus answered, “Destroy this temple, and in three days I will raise it up.”"},{"num":20,"verse":"The Jews responded, “This temple has taken forty-six years to build, and you are going to raise it up in three days!”"},{"num":21,"verse":"But the temple he was talking about was the temple of his body."},{"num":22,"verse":"After he had risen from the dead, his disciples remembered that he had said this, and they believed the Scripture and the words that Jesus had spoken."},{"header":"The Mystery of the New Covenant"},{"num":23,"verse":"Jesus in Jerusalem.While Jesus was in Jerusalem for the feast of Passover, many people saw the signs he was performing and came to believe in his name."},{"num":24,"verse":"However, Jesus would not entrust himself to them because he fully understood them all."},{"num":25,"verse":"He did not need evidence from others about man, for he clearly understood men."}]