[{"header":"Jesus Changes Water Into Wine"},{"num":2,"verse":"On the third day there was a wedding. It took place at Cana in Galilee. Jesus’ mother was there. "},{"num":2,"verse":"Jesus and his disciples had also been invited to the wedding. "},{"num":3,"verse":"When the wine was gone, Jesus’ mother said to him, “They have no more wine.”"},{"num":4,"verse":"“Dear woman, why are you telling me about this?” Jesus replied. “The time for me to show who I really am isn’t here yet.”"},{"num":5,"verse":"His mother said to the servants, “Do what he tells you.”"},{"num":6,"verse":"Six stone water jars stood nearby. The Jews used water from that kind of jar for special washings. They did that to make themselves pure and “clean.” Each jar could hold 20 to 30 gallons."},{"num":7,"verse":"Jesus said to the servants, “Fill the jars with water.” So they filled them to the top."},{"num":8,"verse":"Then he told them, “Now dip some out. Take it to the person in charge of the dinner.”"},{"num":9,"verse":"The person in charge tasted the water that had been turned into wine. He didn’t realize where it had come from. But the servants who had brought the water knew. Then the person in charge called the groom to one side. "},{"num":10,"verse":"He said to him, “Everyone brings out the best wine first. They bring out the cheaper wine after the guests have had too much to drink. But you have saved the best until now.”"},{"num":11,"verse":"What Jesus did here in Cana in Galilee was the first of his signs. Jesus showed his glory by doing this sign. And his disciples believed in him."},{"num":12,"verse":"After this, Jesus went down to Capernaum. His mother and brothers and disciples went with him. They all stayed there for a few days."},{"header":"Jesus Clears Out the Temple Courtyard"},{"num":13,"verse":"It was almost time for the Jewish Passover Feast. So Jesus went up to Jerusalem. "},{"num":14,"verse":"In the temple courtyard he found people selling cattle, sheep and doves. Others were sitting at tables exchanging money. "},{"num":15,"verse":"So Jesus made a whip out of ropes. He chased all the sheep and cattle from the temple courtyard. He scattered the coins of the people exchanging money. And he turned over their tables. "},{"num":16,"verse":"He told those who were selling doves, “Get these out of here! Stop turning my Father’s house into a market!” "},{"num":17,"verse":"His disciples remembered what had been written. It says, “My great love for your house will destroy me.” (Psalm 69:9)"},{"num":18,"verse":"Then the Jewish leaders asked him, “What sign can you show us to prove your authority to do this?”"},{"num":19,"verse":"Jesus answered them, “When you destroy this temple, I will raise it up again in three days.”"},{"num":20,"verse":"They replied, “It has taken 46 years to build this temple. Are you going to raise it up in three days?” "},{"num":21,"verse":"But the temple Jesus had spoken about was his body. "},{"num":22,"verse":"His disciples later remembered what he had said. That was after he had been raised from the dead. Then they believed the Scripture. They also believed the words that Jesus had spoken."},{"num":23,"verse":"Meanwhile, he was in Jerusalem at the Passover Feast. Many people saw the signs he was doing. And they believed in his name. "},{"num":24,"verse":"But Jesus did not fully trust them. He knew what people are like. "},{"num":25,"verse":"He didn’t need anyone to tell him what people are like. He already knew why people do what they do."}]