[{"header":"Water into Wine"},{"num":2,"verse":"On the third day there was a wedding at Cana in Galilee. Jesus’ mother was there, "},{"num":2,"verse":"and Jesus and his disciples were also invited to the wedding."},{"num":3,"verse":"The wine ran out."},{"num":4,"verse":"‘Oh, Mother!’ replied Jesus. ‘What’s that got do to do with you and me? My time hasn’t come yet.’"},{"num":5,"verse":"His mother spoke to the servants."},{"num":6,"verse":"Six stone water-jars were standing there, ready for use in the Jewish purification rites. Each held about twenty or thirty gallons."},{"num":7,"verse":"‘Fill the jars with water,’ said Jesus to the servants. And they filled them, right up to the brim."},{"num":8,"verse":"‘Now draw some out’, he said, ‘and take it to the chief steward.’ They did so."},{"num":9,"verse":"When the chief steward tasted the water that had turned into wine (he didn’t know where it had come from, but the servants who had drawn the water knew), he called the bridegroom."},{"num":10,"verse":"‘What everybody normally does’, he said, ‘is to serve the good wine first, and then the worse stuff when people have had plenty to drink. But you’ve kept the good wine till now!’"},{"num":11,"verse":"This event, in Cana of Galilee, was the first of Jesus’ signs. He displayed his glory, and his disciples believed in him."},{"num":12,"verse":"After this, he went down to Capernaum, with his mother, his brothers and his disciples. He remained there for a few days."},{"header":"Jesus in the Temple"},{"num":13,"verse":"It was nearly time for the Judaean Passover, and Jesus went up to Jerusalem."},{"num":14,"verse":"In the Temple he found people selling cows, sheep and doves, and the money-changers sitting there. "},{"num":15,"verse":"He made a whip out of cords and drove them all out of the Temple, sheep, cows and all. He spilt the money-changers’ coins onto the ground, and knocked over their tables."},{"num":16,"verse":"‘Take these things away!’ he said to the people selling doves. ‘You mustn’t turn my father’s house into a market!’"},{"num":17,"verse":"His disciples remembered that it was written, ‘The zeal of your house has eaten me up.’"},{"num":18,"verse":"The Judaeans had this response for him."},{"num":19,"verse":"‘Destroy this Temple,’ replied Jesus, ‘and I’ll raise it up in three days.’"},{"num":20,"verse":"‘It’s taken forty-six years to build this Temple,’ responded the Judaeans, ‘and are you going to raise it up in three days?’ "},{"num":21,"verse":"But he was speaking about the ‘temple’ of his body. "},{"num":22,"verse":"So when he was raised from the dead, his disciples remembered that he had said this, and they believed the Bible and the word which Jesus had spoken."},{"num":23,"verse":"While he was in Jerusalem during the Passover festival, several people came to trust in his name, because they had seen the signs he did. "},{"num":24,"verse":"But Jesus didn’t entrust himself to them. He knew everything, "},{"num":25,"verse":"and had no need for anyone to give him information about people. He himself knew what was inside people."}]