[{"header":"Water to Wine"},{"num":2,"verse":"On the third day, there was a wedding at Cana in the Galilee. Yeshua’s mother was there, "},{"num":2,"verse":"and Yeshua and His disciples were also invited to the wedding. "},{"num":3,"verse":"When the wine ran out, Yeshua’s mother said to Him, “They don’t have any wine!”"},{"num":4,"verse":"Yeshua said to her, “Woman, what does this have to do with you and Me? My hour hasn’t come yet.”"},{"num":5,"verse":"His mother said to the servants, “Do whatever He tells you.”"},{"num":6,"verse":"Now there were six stone jars, used for the Jewish ritual of purification, each holding two to three measures."},{"num":7,"verse":" Yeshua said to them, “Fill the jars with water!” So they filled them up to the top. "},{"num":8,"verse":"Then He said to them, “Take some water out, and give it to the headwaiter.” And they brought it."},{"num":9,"verse":"Now the headwaiter did not know where it had come from, but the servants who had drawn the water knew. As the headwaiter tasted the water that had become wine, he calls the bridegroom "},{"num":10,"verse":"and says to him, “Everyone brings out the good wine first, and whenever they are drunk, then the worse. But you’ve reserved the good wine until now!” "},{"num":11,"verse":"Yeshua did this, the first of the signs, in Cana of the Galilee—He revealed His glory, and His disciples believed in Him."},{"header":"Yeshua Purges the Temple"},{"num":12,"verse":"After this Yeshua went down to Capernaum with His mother, brothers, and disciples, and they stayed there a few days. "},{"num":13,"verse":"The Jewish feast of Passover was near, so Yeshua went up to Jerusalem. "},{"num":14,"verse":"In the Temple, He found the merchants selling oxen, sheep, and doves; also the moneychangers sitting there. "},{"num":15,"verse":"Then He made a whip of cords and drove them all out of the Temple, both the sheep and oxen. He dumped out the coins of the moneychangers and overturned their tables. "},{"num":16,"verse":"To those selling doves, He said, “Get these things out of here! Stop making My Father’s house a marketplace!” "},{"num":17,"verse":"His disciples remembered that it is written, “Zeal for your House will consume Me!”"},{"num":18,"verse":"The Judean leaders responded, “What sign do You show us, since You are doing these things?”"},{"num":19,"verse":"“Destroy this Temple,” Yeshua answered them, “and in three days I will raise it up.”"},{"num":20,"verse":"The Judean leaders then said to Him, “Forty-six years this Temple was being built, and You will raise it up in three days?” "},{"num":21,"verse":"But He was talking about the temple of His body. "},{"num":22,"verse":"So after He was raised from the dead, His disciples remembered that He was talking about this. Then they believed the Scripture and the word that Yeshua had spoken."},{"num":23,"verse":"Now when He was in Jerusalem for the Passover, during the feast, many believed in His name, seeing the signs He was doing. "},{"num":24,"verse":"But Yeshua did not entrust Himself to them, because He knew all men. "},{"num":25,"verse":"He did not need anyone to testify about man, for He knew what was in man."}]