[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(21) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The river of Kishon.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 83:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either from this massacre, or that of the Baal priests of Elijah, the Kishon is now called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nahr Mukatta, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or “river of slaughter” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 18:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That ancient river.—The Vulgate renders this, “the torrent Kedumim,” and the LXX. (Cod. Vat.), “the river of the ancients” (comp. Deuteronomy 33:15). The Chaldee paraphrases it, “the torrent on whose banks illustrious deeds have been done from the ancient times of Israel.” As the Plain of Jezreel has been in all ages the battle-field of Israel, the Kishon must always have played an important part in these struggles, as when the Turks were drowned in its swollen waves on April 16th, 1799. We know, however, of no ancient fame of Kishon before these events; and some render it. “the torrent of meeting armies,” or “of slaughters” (Ewald), deriving Kedumim from an Arabic root; or “the torrent of succours,” connecting the word with Kiddeem (see Psalm 79:8, &c., Heb.). Aquila renders it by “the torrent of siroccos” (Kausōnōn); and Symmachus, “the torrent of goats” (wild waves, egers, and bores).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "That ancient river.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Vulgate renders this, “the torrent Kedumim,” and the LXX. (Cod. Vat.), “the river of the ancients” (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The Chaldee paraphrases it, “the torrent on whose banks illustrious deeds have been done from the ancient times of Israel.” As the Plain of Jezreel has been in all ages the battle-field of Israel, the Kishon must always have played an important part in these struggles, as when the Turks were drowned in its swollen waves on April 16th, 1799. We know, however, of no ancient fame of Kishon before these events; and some render it. “the torrent of meeting armies,” or “of slaughters” (Ewald), deriving ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Kedumim ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "from an Arabic root; or “the torrent of succours,” connecting the word with ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Kiddeem ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 79:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c., Heb.). Aquila renders it by “the torrent of siroccos” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Kausōnōn",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and Symmachus, “the torrent of goats” (wild waves, egers, and bores).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "O my soul, thou hast trodden down strength.—These sudden exclamations, which break the flow of the poem, add greatly to its fire and impetuosity. The verb may be an imperative, and the Vulgate renders it, “Trample down, O my soul, the mighty.” The word “trample” recalls the image of treading the vintage.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "O my soul, thou hast trodden down strength.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—These sudden exclamations, which break the flow of the poem, add greatly to its fire and impetuosity. The verb may be an imperative, and the Vulgate renders it, “Trample down, O my soul, the mighty.” The word “trample” recalls the image of treading the vintage.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jdg 5:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 5:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The river of Kishon — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which, though not great in itself, was now much swelled by the foregoing storm and rain, and therefore drowned those who, being pursued by the hand of God and by the Israelites, were forced into it, and thought to pass over it, as they did before. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ancient river — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So called, either, first, in opposition to those rivers which are of a later date, being made by the hand and art of man; or, secondly, because it was a river anciently famous for remarkable exploits, for which it was celebrated by the ancient poets or writers, though not here mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O my soul, thou hast trodden down strength — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou, O Deborah, though but a weak woman, hast, by God’s assistance, subdued a potent enemy; a beautiful apostrophe this of the prophetess; turning her speech to herself, as it were, to congratulate herself on the success of the commission which she had received from God to stir up Barak, and on the great efficacy of her prayers to God; for it cannot be doubted but that she implored help from Heaven, while Barak fought with Sisera.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:12-23 Deborah called on her own soul to be in earnest. He that will set the hearts of other men on fire with the love of Christ, must himself burn with love. Praising God is a work we should awake to, and awake ourselves unto. She notices who fought against Israel, who fought for them, and who kept away. Who fought against them. They were obstinate enemies to God's people, therefore the more dangerous. Who fought for them. The several tribes that helped are here spoken of with honour; for though God is above all to be glorified, those who are employed must have their due praise, to encourage others. But the whole creation is at war with those to whom God is an enemy. The river of Kishon fought against their enemies. At most times it was shallow, yet now, probably by the great rain that fell, it was so swelled, and the stream so deep and strong, that those who attempted to pass, were drowned. Deborah's own soul fought against them. When the soul is employed in holy exercises, and heart-work is made of them, through the grace of God, the strength of our spiritual enemies will be trodden down, and will fall before us. She observes who kept away, and did not side with Israel, as might have been expected. Thus many are kept from doing their duty by the fear of trouble, the love of ease, and undue affection to their worldly business and advantage. Narrow, selfish spirits care not what becomes of God's church, so that they can but get, keep, and save money. All seek their own, Php 2:21. A little will serve those for a pretence to stay at home, who have no mind to engage in needful services, because there is difficulty and danger in them. But we cannot keep away from the contest between the Lord and his enemies; and if we do not actively endeavour to promote his cause in this wicked world, we shall fall under the curse against the workers of iniquity. Though He needs no human help, yet he is pleased to accept the services of those who improve their talents to advance his cause. He requires every man to do so.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The word translated ancient occurs only here. The phrase probably means that Kishon was celebrated from ancient times on account of the battles fought on its banks. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21. the river of Kishon swept them away—The enemy was defeated near \"the waters of Megiddo\"—the sources and side streams of the Kishon: they that fled had to cross the deep and marshy bed of the torrent, but the Lord had sent a heavy rain—the waters suddenly rose—the warriors fell into the quicksands, and sinking deep into them, were drowned or washed into the sea [Van De Velde].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The river of Kishon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though not great in itself, and therefore fordable, was now much swelled and increased by the foregoing storm and rain, as Josephus affirms; and therefore drowned those who being pursued by the hand of God, and by the Israelites, were forced into it, and thought to pass over it, as they did before. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That ancient river; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so called, either, first, In opposition to those rivers which are of a later date, being made by the hand and art of man. Or, secondly, Because it was a river anciently famous for some remarkable exploits, for which it was celebrated by the ancient poets or writers, though not here mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou hast trodden down strength, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. thou, O Deborah, though but a weak woman, hast, by God’s assistance and blessing upon thy counsels and prayers, subdued a potent enemy. Such apostrophes and abrupt speeches are frequent in poetical scriptures. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The river of Kishon swept them away,.... To which Sisera's army was drawn, and where it was discomfited; and very probably many of them, in their confusion, endeavoured to make their escape by fording or swimming over the river, by which they were swept away and drowned, the waters of it at this time swelling in a miraculous manner, as Ben Gersom thinks; or were increased by the large showers of rain that fell, as some note from Josephus, though I find it not in him; however it is not improbable it might be the case; for our countryman Mr. Maundrell (l) thus observed when he was at it;\"in the condition we saw it, its waters were low and inconsiderable; but passing along the side of the plain, we discovered the track of many lesser torrents falling down into it from the mountains, which must needs make it swell exceedingly upon sudden rains, as doubtless it actually did at the destruction of Sisera's host, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that ancient river, the river Kishon; called ancient, either because it was from the beginning of the creation, and not cut by the art of men, as some rivers are; or because it was spoken of by poets and historians in ancient times; or because of famous exploits done here of old; so the Targum,\"the river where signs and mighty works were done for Israel of old.''Some take the word Kedumim to be another name of the river, so called from its windings and turnings, and, as it were, meeting itself. So some travellers tell us (m) the river Kedumim, the same with Kishon, is so called, because it meets itself, being by its meanders formed like a sling or noose, as Kishon signifies; it rises at Mount Tabor, and discharges itself into the Mediterranean sea, at the foot of Mount Carmel; so Hillerus (n) says, Kishon signifies bending in manner of a snare, or net, or meander, and takes it to be the same with the Pagida of Pliny (o), which in the Greek tongue signifies the same: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O my soul, thou hast trodden down strength; a strong and mighty army, through her prayers and supplication, advice and direction; or thou hast trodden with strength, that is, the river Kishon, as some Jewish interpreters understand it, who suppose that another miracle was wrought; that as the waters of the river swelled when the Canaanites attempted to escape over it, so it sunk and became fordable for Deborah and the Israelites; a miracle, as they suppose, somewhat similar to that at the Red sea. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Journey from Aleppo, &c. p. 57. (m) Egmont and Heyman's Travels, par. 2. p. 2.((n) Onomastic. Sacr. p. 186, 405, 865. (o) Nat. Hist. l. 5. c. 19. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) Journey from Aleppo, &c. p. 57. (m) Egmont and Heyman's Travels, par. 2. p. 2.((n) Onomastic. Sacr. p. 186, 405, 865. (o) Nat. Hist. l. 5. c. 19. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The river of Kishon {q} swept them away, that ancient river, the river Kishon. O my soul, thou hast trodden down strength.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The river of Kishon ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " swept them away, that ancient river, the river Kishon. O my soul, thou hast trodden down strength.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) As a broom does to the filth of the house.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "swept them away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The battle must have taken place in the winter or spring, for in summer the Kishon runs low. The fate of Sisera’s host finds a parallel in the battle of Mt Tabor between the army of Napoleon and the Turks, Apr. 16, 1799, when many of the latter were drowned when attempting to escape across a part of the plain inundated by the Kishon.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That ancient river",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "torrent of antiquity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so LXX. B, Targ. (‘where the wonders and mighty deeds ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of old",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were wrought for Israel’). Another translation, based on Arabic usage, is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "torrent of onsets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, developing the meaning of the root ‘be before, in front,’ we might render ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "onrushing torrent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", alluding to the swollen waters. The exact sense must remain obscure.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O my soul, march on with strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A questionable rendering, for the verb is not an imperative. The text as it stands is probably an attempt to make some sense of an ancient corruption. The line may have formed part of the previous one: ‘the torrent of Kishon trode them down mightily’—but to reconstruct the original form of the sentence is hopeless.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ancient",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word so rendered is only found here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The brook of ancient",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " days, or things, probably means the brook celebrated from of old by the warlike deeds done on its banks. Judges 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The kings of Canaan could do nothing against these powers. They were smitten; the brook Kishon washed them (i.e., their corpses) away. The meaning \"to wash away\" is well established by the dialects and the context, though the verb itself only occurs here. As the battle was fought between Taanach and Megiddo, i.e., to the south of the brook Kishon, and the smitten foe fled towards the north, many of them met with their death in the waves of the brook, which was flowing over its banks at the time. The brook is called קדוּמים נחל, i.e., the brook of the old world or the olden time (according to the lxx Cod. Vat. χειμάῤῥους ἀρχαίων), as the stream that had been flowing from time immemorial, and not, as the Chaldee interprets it, the stream that had been celebrated from olden time on account of the mighty acts that had been performed there. The meaning suggested by Ewald and others, \"brook of attacks, or slaughters,\" is not well sustained, although קדּם is sometimes used to denote a hostile encounter. The last clause interrupts the description of the slaughter and the victory. Borne away by the might of the acts to be commemorated, Deborah stimulates her soul, i.e., herself, to a vigorous continuation of her song. תּדרכי is jussive, and עז an accusative governed by the verb, in strength, vigorously; for she had still to celebrate the glorious results of the victory. This is done in the third part of the song (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:22-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the first strophe of which (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:22-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") describes in brief drastic traits the flight of the foe, and the treatment of the fugitives by the people of the land. ",
        "children": []
      }
    ]
  }
]