[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "II.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "JONAH’S PRAYER AND DELIVERANCE.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Then Jonah prayed.—This introduction, to what is in reality a psalm of thanksgiving, has its parallel in Hannah’s song (1Samuel 2:1-10), which is introduced in the same way. Comp. also the Note appended by the psalm collector at the end of Psalms 72, “The prayers of David the son of Jesse are ended.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Then Jonah prayed.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This introduction, to what is in reality a psalm of thanksgiving, has its parallel in Hannah’s song (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 2:1-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which is introduced in the same way. Comp. also the Note appended by the psalm collector at the end of Psalms 72, “The ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "prayers",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of David the son of Jesse are ended.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jonah 2:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Jonah prayed — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Those devout thoughts and feelings which he had at that time, he afterward digested into the following prayer, and added a thanksgiving for his deliverance at the end of it. So several of David’s Psalms were probably composed after his trouble was over; but in a manner suitable to the thoughts he had at the time of his affliction; and with a grateful sense of God’s mercies for his deliverance out of it: see Psalm 54. and 120. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he heard me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He thanks God that, in consequence of his prayer, his life is wonderfully preserved. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Out of the belly of hell cried I — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "שׁאול",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "state of the dead. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So it may most properly be rendered the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grave ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here, as the margin reads: the belly of the fish was to Jonah instead of a grave.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-9 Observe when Jonah prayed. When he was in trouble, under the tokens of God's displeasure against him for sin: when we are in affliction we must pray. Being kept alive by miracle, he prayed. A sense of God's good-will to us, notwithstanding our offences, opens the lips in prayer, which were closed with the dread of wrath. Also, where he prayed; in the belly of the fish. No place is amiss for prayer. Men may shut us from communion with one another, but not from communion with God. To whom he prayed; to the Lord his God. This encourages even backsliders to return. What his prayer was. This seems to relate his experience and reflections, then and afterwards, rather than to be the form or substance of his prayer. Jonah reflects on the earnestness of his prayer, and God's readiness to hear and answer. If we would get good by our troubles, we must notice the hand of God in them. He had wickedly fled from the presence of the Lord, who might justly take his Holy Spirit from him, never to visit him more. Those only are miserable, whom God will no longer own and favour. But though he was perplexed, yet not in despair. Jonah reflects on the favour of God to him, when he sought to God, and trusted in him in his distress. He warns others, and tells them to keep close to God. Those who forsake their own duty, forsake their own mercy; those who run away from the work of their place and day, run away from the comfort of it. As far as a believer copies those who observe lying vanities, he forsakes his own mercy, and lives below his privileges. But Jonah's experience encourages others, in all ages, to trust in God, as the God of salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then - (\"And\") Jonah prayed, i. e., when the three days and nights were passed, he uttered this devotion. The word \"prayed\" includes thanksgiving, not petition only. It is said of Hannah that she \"prayed\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but her canticle is all one thanksgiving without a single petition. In this thanksgiving Jonah says how his prayers had been heard, but prays no more. God had delivered him from the sea, and be thanks God, in the fish's belly, as undisturbed as in a Church or an oratory, secure that God, who had done so much, would fulfill the rest. He called God, \"his\" God, who had in so many ways shown Himself to be His, by His revelations, by His inspirations, by His chastisements, and now by His mercy . \"From these words, 'Jonah prayed unto the Lord his God out of the fish's belly,' we perceive that, after he felt himself safe in the fish's belly, he despaired not of God's mercy.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 2",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jon 2:1-10. Jonah's Prayer of Faith and Deliverance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. his God—\"his\" still, though Jonah had fled from Him. Faith enables Jonah now to feel this; just as the returning prodigal says of the Father, from whom he had wandered, \"I will arise and go to my Father\" (Lu 15:18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "out of the fish's belly—Every place may serve as an oratory. No place is amiss for prayer. Others translate, \"when (delivered) out of the fish's belly.\" English Version is better. The prayer of Jonah, Jonah 1:1-9. He is delivered out of the belly of the fish, Jonah 1:10. Then,  Heb. And, at that time when he lay by the heels a close prisoner in a prison, whence none before or since ever came out alive, Jonah prayed;  sent his petition in all humble and submissive manner unto God: Jonah, wonderfully preserved alive, and in full exercise of his judgment and memory, now betakes himself to prayer, and in this exerciseth his graces; his soul follows hard after God, when he was shut up in this dungeon. Unto the Lord,  that was angry, and now was punishing of Jonah; the Lord, who had committed him to this prison; the almighty God, who can do for Jonah all that he can need or desire. His God;  though Jonah in his froward fit flees from his God, yet now, by the rod taught better, he flees to God, nay, as his God, and remembers his particular interest in God. If Jonah prays by faith grounded on God’s almightiness, now he prays with assurance and hope of faith, looking to God as his God; if the power of the Lord and his mercy keep Jonah alive in the fish’s belly, the same power and mercy can deliver him out of this danger, and the prophet believes he is kept there for an enlargement as miraculous as his confinement was. Out of the fish’s belly;  where he was a prisoner under many miracles, and all concur to awaken him to prayer and faith; he calls it the belly of hell,  or the grave, Jonah 2:2. He employed his time well there. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "out of the fish's belly—Every place may serve as an oratory. No place is amiss for prayer. Others translate, \"when (delivered) out of the fish's belly.\" English Version is better. The prayer of Jonah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jonah 1:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He is delivered out of the belly of the fish, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jonah 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Then, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Heb. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", at that time when he lay by the heels a close prisoner in a prison, whence none before or since ever came out alive, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jonah prayed; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sent his petition in all humble and submissive manner unto God: Jonah, wonderfully preserved alive, and in full exercise of his judgment and memory, now betakes himself to prayer, and in this exerciseth his graces; his soul follows hard after God, when he was shut up in this dungeon. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Unto the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that was angry, and now was punishing of Jonah; the Lord, who had committed him to this prison; the almighty God, who can do for Jonah all that he can need or desire. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "His God; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " though Jonah in his froward fit flees from his God, yet now, by the rod taught better, he flees to God, nay, as his God, and remembers his particular interest in God. If Jonah prays by faith grounded on God’s almightiness, now he prays with assurance and hope of faith, looking to God as his God; if the power of the Lord and his mercy keep Jonah alive in the fish’s belly, the same power and mercy can deliver him out of this danger, and the prophet believes he is kept there for an enlargement as miraculous as his confinement was. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Out of the fish’s belly; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " where he was a prisoner under many miracles, and all concur to awaken him to prayer and faith; he calls it ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "the belly of hell, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or the grave, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jonah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He employed his time well there. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Jonah prayed unto the Lord his God out of the fish's belly. Though Jonah had been a praying man, being a good man, and a prophet of the Lord, yet it seems he had not prayed for some time; being disobedient to the will of God, he restrained prayer before him; all the while he was going to Joppa he prayed not; and how indeed could he have the face to pray to him, from whose face he was fleeing? and as soon as he was in the ship he fell asleep, and there lay till he was waked by the shipmaster, who called upon him to arise, and pray to his God; but whether he did or no is not said; and though it is very probable he might, when convicted of his sin, and before he was cast into the sea, and as he was casting into it; his not recorded; but when he was in the fish's belly, \"then he prayed\"; where it is marvellous he should, or could; it was strange he should be able to breathe, and more strange to breathe spiritually; it was very wonderful he should have the exercise of his reason, and more that he should have the exercise of grace, as faith and hope, as it appears by the following prayer he had. Prayer may be performed any where, on a mountain, in a desert, in the caves and dens of the earth, and in a prison, as it has been; but this is the only time it ever was performed in such a place. Jonah is the only man that ever prayed in a fish's belly: and he prayed unto the Lord as \"his God\", not merely by creation, and as the God of nature and providence, the God of his life, and of his mercies; but as his covenant God and Father; for though he had sinned against the Lord, and had been sorely chastised by him, yet he did not take his lovingkindness from him, nor suffer his faithfulness to fail, or break his covenant with him; covenant interest and relation still continued; and Jonah had knowledge of it, and faith in it; and as this is an argument the Lord makes use of to engage backsliders to return unto him, it is a great encouragement to them so to do, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this Jonah was a type of Christ, who, amidst his agonies, sorrows, and sufferings, prayed to his Father, and claimed his interest in him as his God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What follows contains the sam and substance of the prophet's thoughts, and the ejaculations of his mind, when in the fish's belly; but were not put up in this form, but were reduced by him into it after he was delivered; as many of David's psalms were put into the form and order they are after his deliverance from troubles, suitable to his thoughts of things when he was in them; and indeed the following account is an historical narration of facts, which were before and after his prayer, as well as of that itself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then Jonah prayed unto the LORD his God {a} out of the fish's belly,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then Jonah prayed unto the LORD his God ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " out of the fish's belly,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Being now swallowed up by death, and seeing no remedy to escape, his faith broke out to the Lord, knowing that out of this very hell he was able to deliver him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Jonah prayed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] What follows, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 2:2-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:2-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is rather a thanksgiving than a prayer. The same, however, may be said of Hannah’s utterance (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which is introduced by the same word (“Hannah ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prayed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "”). Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 16:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Alford renders “praying, sung praises,” or “in their prayers were singing praises,” and remarks that “the distinction of modern times between prayer and praise arising from our attention being directed to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shape",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather than to the essence of devotion, was unknown in these days: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” It has, indeed, been held (Maurer) that Jonah does pray here, and that the past tenses (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 2:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.) are in reality present and only in form past, because they are literal quotations from some of the Psalms. It is simpler, however, to suppose, with the great majority of commentators, that Jonah had prayed to God in the prospect and the act of being cast into the sea, while he was being buffeted by the waves and sinking into the depths, and in the agony of being swallowed by the fish. During all this time, whether his lips spoke or not, his mind was fixed in that intent Godward attitude and posture which is the truest prayer. Now, however, when he finds himself alive and unharmed in that strange abode, he prays no longer, but offers thanksgivings for the measure of deliverance already granted him in answer to those former prayers, mingled with joyful anticipations of the yet further deliverance which the last verse of the chapter records. It seems probable that Jonah’s prayer was offered at the end of the three days and nights, and was followed immediately by his release. How the three days and nights were spent by him, whether in unconsciousness, as some have thought, or in godly sorrow and repentance, like Saul at Damascus, as others have held, we have no means of knowing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] When Jonah flees in disobedience it is “from the presence of Jehovah;” when he prays in penitence, it is to “Jehovah ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” Comp. “O Lord my God,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 2:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Part I. JONAH'S PRAYER AND DELIVERANCE. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - 1",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ". Jonah, in the belly of the fish, offers a prayer of thanksgiving for his rescue from death by drowning, in which he sees a pledge of further deliverance.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then Jonah prayed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These were his feelings when he sank in the waters and while he lay in his mysterious prison; he may have put them into their metrical form after his deliverance. The grammatical arrangement, and especially the language of ver. 7, seem to speak of a deliverance already experienced rather than of one expected. As this \"prayer\" does not suit an allegory, and as no cue but Jonah could have known its substance, we have here an argument for his authorship. It is rather a thanksgiving than a prayer - like that of Hennas (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). When he realizes that he was saved from drowning, he uttered his gratitude, and saw that he might hope for further rescue. How he passed the three days we cannot tell; some have thought he was unconscious; but thin is, perhaps, hardly consistent with the notice of his praying, and with the action of his great Antitype, who, during his sojourn in the unseen world, \"preached to the spirits in prison\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He acknowledges Jehovah as his God. He had proved himself his by inspiration, by chastisement, and now by mercy (Pusey). The following prayer contains ample reminiscences of the Psalms, which would be familiar to a devout Israelite. Those quoted are mostly what have been considered to belong to David's time. if their date is really ascertained. But it is a matter of controversy, incapable of settlement, whether Jonah or the psalmist is the original. Jonah 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Jonah prayed to Jehovah his God out of the fish's belly.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The prayer which follows (Jonah 2:2-9) is not a petition for deliverance, but thanksgiving and praise for deliverance already received. It by no means follows from this, however, that Jonah did not utter this prayer till after he had been vomited upon the land, and that v. 10 ought to be inserted before v. 2; but, as the earlier commentators have shown, the fact is rather this, that when Jonah had been swallowed by the fish, and found that he was preserved alive in the fish's belly, he regarded this as a pledge of his deliverance, for which he praised the Lord. Luther also observes, that \"he did not actually utter these very words with his mouth, and arrange them in this orderly manner, in the belly of the fish; but that he here shows what the state of his mind was, and what thoughts he had when he was engaged in this conflict with death.\" The expression \"his God\" (אלהיו) must not be overlooked. He prayed not only to Jehovah, as the heathen sailors also did (Jonah 1:14), but to Jehovah as his God, from whom he had tried to escape, and whom he now addresses again as his God when in peril of death. \"He shows his faith by adoring Him as his God\" (Burk). The prayer consists for the most part of reminiscences of passages in the Psalms, which were so exactly suited to Jonah's circumstances, that he could not have expressed his thoughts and feelings any better in words of his own. It is by no means so \"atomically compounded from passages in the Psalms\" that there is any ground for pronouncing it \"a later production which has been attributed to Jonah,\" as Knobel and De Wette do; but it is the simple and natural utterance of a man versed in the Holy Scripture and living in the word of God, and is in perfect accordance with the prophet's circumstances and the state of his mind. Commencing with the confession, that the Lord has heard his crying to Him in distress (Jonah 2:2), Jonah depicts in two strophes (Jonah 2:3 and Jonah 2:4, Jonah 2:5-7) the distress into which he had been brought, and the deliverance out of that destruction which appeared inevitable, and closes in Jonah 2:8, Jonah 2:9 with a vow of thanksgiving for the deliverance which he had received. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prayer which follows (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:2-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is not a petition for deliverance, but thanksgiving and praise for deliverance already received. It by no means follows from this, however, that Jonah did not utter this prayer till after he had been vomited upon the land, and that v. 10 ought to be inserted before v. 2; but, as the earlier commentators have shown, the fact is rather this, that when Jonah had been swallowed by the fish, and found that he was preserved alive in the fish's belly, he regarded this as a pledge of his deliverance, for which he praised the Lord. Luther also observes, that \"he did not actually utter these very words with his mouth, and arrange them in this orderly manner, in the belly of the fish; but that he here shows what the state of his mind was, and what thoughts he had when he was engaged in this conflict with death.\" The expression \"his God\" (אלהיו) must not be overlooked. He prayed not only to Jehovah, as the heathen sailors also did (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but to Jehovah as his God, from whom he had tried to escape, and whom he now addresses again as his God when in peril of death. \"He shows his faith by adoring Him as his God\" (Burk). The prayer consists for the most part of reminiscences of passages in the Psalms, which were so exactly suited to Jonah's circumstances, that he could not have expressed his thoughts and feelings any better in words of his own. It is by no means so \"atomically compounded from passages in the Psalms\" that there is any ground for pronouncing it \"a later production which has been attributed to Jonah,\" as Knobel and De Wette do; but it is the simple and natural utterance of a man versed in the Holy Scripture and living in the word of God, and is in perfect accordance with the prophet's circumstances and the state of his mind. Commencing with the confession, that the Lord has heard his crying to Him in distress (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), Jonah depicts in two strophes (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:5-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the distress into which he had been brought, and the deliverance out of that destruction which appeared inevitable, and closes in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with a vow of thanksgiving for the deliverance which he had received. ",
            "children": []
          }
        ]
      }
    ]
  }
]