[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am cast out of thy sight.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—“Jonah had wilfully withdrawn from standing in God’s presence. Now God had taken him at his word, and, as it seemed, cast him out of it. David had said in his haste, “I am cut off” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Jonah substitutes the stronger word, “I am cast forth,” driven forth, expelled like the mire and dirt which the waves drive along, or like the waves themselves in their restless motion, or the heathen (the word is the same) whom God had driven out before Israel, or as Adam from Paradise” (Pusey).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet I will look again.—The Hebrew is very impressive, and reads like one of those exile hopes so common in the Psalms: “Yet I have one thing left, to turn towards Thy holy Temple and pray.” (For the attitude see Note on Psalm 28:2.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Yet I will look again.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The Hebrew is very impressive, and reads like one of those exile hopes so common in the Psalms: “Yet I have one thing left, to turn towards Thy holy Temple and pray.” (For the attitude see Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 28:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jonah 2:4-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:4-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then I said, I am cast out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “My first apprehensions were, that as I had justly forfeited thy favour by my disobedience, so thou wouldest cast me out of thy protection; yet, upon recollecting myself, I thought it my duty not to despair of thy mercy, but direct my prayer toward thy heavenly habitation.” — Lowth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The waters compassed me even to the soul — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "life; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, to the extreme hazard of my life; and I thought of nothing more than losing my life among the waves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I went, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — I went down to the bottom of the sea, where the foundations of the mountains lie. Or, the fish carried me down as deep in the sea as are the bottoms of the mountains. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The earth with her bars was about me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I found myself enclosed on every side, without any way for escape; and should have been enclosed for ever, had not thy power interposed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet hast thou brought up my life from corruption — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But, notwithstanding it was involved in all these terrible circumstances, which seemed to preclude all possibility of its being preserved, yet thou, O my God, by thy power didst save my life from destruction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When my soul fainted within me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When I seemed just expiring, and lost all hopes of being preserved; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I remembered the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I thought of thy almighty power and boundless mercy, O Jehovah, who causest ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to be whatsoever ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "thou willest; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and my prayer came in unto thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And therefore I addressed my prayer to thee, as being persuaded that thou couldest still preserve me, even in the most extreme dangers; and my faith was not disappointed; for I found, by the event, that thou couldest deliver me, as I believed thou wast able to do.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-9 Observe when Jonah prayed. When he was in trouble, under the tokens of God's displeasure against him for sin: when we are in affliction we must pray. Being kept alive by miracle, he prayed. A sense of God's good-will to us, notwithstanding our offences, opens the lips in prayer, which were closed with the dread of wrath. Also, where he prayed; in the belly of the fish. No place is amiss for prayer. Men may shut us from communion with one another, but not from communion with God. To whom he prayed; to the Lord his God. This encourages even backsliders to return. What his prayer was. This seems to relate his experience and reflections, then and afterwards, rather than to be the form or substance of his prayer. Jonah reflects on the earnestness of his prayer, and God's readiness to hear and answer. If we would get good by our troubles, we must notice the hand of God in them. He had wickedly fled from the presence of the Lord, who might justly take his Holy Spirit from him, never to visit him more. Those only are miserable, whom God will no longer own and favour. But though he was perplexed, yet not in despair. Jonah reflects on the favour of God to him, when he sought to God, and trusted in him in his distress. He warns others, and tells them to keep close to God. Those who forsake their own duty, forsake their own mercy; those who run away from the work of their place and day, run away from the comfort of it. As far as a believer copies those who observe lying vanities, he forsakes his own mercy, and lives below his privileges. But Jonah's experience encourages others, in all ages, to trust in God, as the God of salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I am cast out of Thy sight - , literally, \"from before Thine eyes.\" Jonah had willfully withdrawn from standing in God's presence. Now God had taken him at his word, and, as it seemed, cast him out of it. David had said in his haste, \"I am cut off.\" Jonah substitutes the stronger word, \"I am cast forth,\"  driven forth, expelled, like the \"mire and dirt\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which the waves drive along, or like the waves themselves in their restless motion ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or the pagan (the word is the same) whom God had driven out before Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the Piel often), or as Adam from Paradise ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet (Only) I will look again - He was, as it were, a castaway, cast out of God's sight, unheeded by Him, his prayers unheard; the storm unabated, until he was cast forth. He could no longer look with the physical eye even toward the land where God showed the marvels of His mercy, and the temple where God was worshiped continually. Yet what he could not do in the body, he would do in his soul. This was his only resource. \"If I am cast away, this one thing will I do, I will still look to God.\" Magnificent faith! Humanly speaking, all hope was gone, for, when that huge vessel could scarcely live in the sea, how should a man? When God had given it no rest, while it contained Jonah, how should tie will that Jonah should escape? Nay, God had hidden His Face from him; yet he did this one, this only thing only this, \"once more, still I will add to look to God.\" Thitherward would he look, so long as his mind yet remained in him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If his soul parted from him, it should go forth from him in that gaze. God gave him no hope, save that He preserved him alive. For he seemed to himself forsaken of God. Wonderful pattern of faith which gains strength even from God's seeming desertion! \"I am cast vehemently forth from before Thine eyes; yet this one thing will I do; mine eyes shrill be unto Thee, O Lord.\" The Israelites, as we see from Solomon's dedication prayer, \"prayed toward the temple,\" (1 Kings 8:29-30, 1 Kings 8:35 ff) where God had set His Name and shown His glory, where were the sacrifices which foreshadowed the great atonement. Thitherward they looked in prayer, as Christians, of old, prayed toward the East, the seat of our ancient Paradise. where our Lord \"shall appear unto them that look for Him, a second time unto salvation.\" Hebrews 9:28. Toward that temple then he would yet look with fixed eye  for help, where God, Who fills heaven and earth, showed Himself to sinners reconciled. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If his soul parted from him, it should go forth from him in that gaze. God gave him no hope, save that He preserved him alive. For he seemed to himself forsaken of God. Wonderful pattern of faith which gains strength even from God's seeming desertion! \"I am cast vehemently forth from before Thine eyes; yet this one thing will I do; mine eyes shrill be unto Thee, O Lord.\" The Israelites, as we see from Solomon's dedication prayer, \"prayed toward the temple,\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:29-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ff) where God had set His Name and shown His glory, where were the sacrifices which foreshadowed the great atonement. Thitherward they looked in prayer, as Christians, of old, prayed toward the East, the seat of our ancient Paradise. where our Lord \"shall appear unto them that look for Him, a second time unto salvation.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Toward that temple then he would yet look with fixed eye  for help, where God, Who fills heaven and earth, showed Himself to sinners reconciled. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. cast out from thy sight—that is, from Thy favorable regard. A just retribution on one who had fled \"from the presence of the Lord\" (Jon 1:3). Now that he has got his desire, he feels it to be his bitterest sorrow to be deprived of God's presence, which once he regarded as a burden, and from which he desired to escape. He had turned his back on God; so God turned His back on him, making his sin his punishment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "toward thy holy temple—In the confidence of faith he anticipates yet to see the temple at Jerusalem, the appointed place of worship (1Ki 8:38), and there to render thanksgiving [Henderson]. Rather, I think, \"Though cast out of Thy sight, I will still with the eye of faith once more look in prayer towards Thy temple at Jerusalem, whither, as Thy earthly throne, Thou hast desired Thy worshippers to direct their prayers.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though this word with us ordinarily denoteth time, yet here it denoteth order and connexion; the Hebrew is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And. I said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with myself, I thought in the midst of my fears and sufferings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am cast out of thy sight; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cut off from all hope of life among men; rejected, forsaken, and as it were forgotten of my God, and left by this death to pass to a worse death. Thus he was racked with sense of present danger from God’s displeasure, and. is almost carried away with a despair of ever seeing the face of God again with comfort. much as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 31:22 Lamentations 4:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 4:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Yet I will look again:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his faith begins to recover itself; he will not, as despairing ones, any more look toward lost hopes, but with reviving hope he will hope against hope, and never yield to such despairs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Towards thy holy temple; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where the ark of the covenant, where the mercy-seat, where propitiatory sacrifices are offered, where is God’s high priest, types of the great Redeemer, Mediator, and Saviour, by whom sin is expiated, sinners pardoned, grace and favour communicated, where God commands the blessing, life for evermore; he will look and hope to appear in the material typical temple, and to find there grace dispositive for, as well as significative of, glory in the heavenly temple; he hopes for both. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then I said, I am cast out of thy sight,.... Or, \"from before thine eyes\" (d); the Targum, from before thy Word; as David also said in his distress, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not but that he knew he was in the reach and under the eye of his omniscience, which saw him in the fish's belly, in the depths of the sea, for nothing can hide from that; but he thought he was no longer under the eye of his providence; and that he would no more care for him, but leave him in this forlorn condition, and not deliver him; and especially he concluded that he would no more look upon him with an eye of love, grace, and mercy, pity and compassion: these are the words of one in despair, or near unto it; and yet a beam of light, a ray of hope, breaks in, and a holy resolution is formed, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yet I will look again toward thy holy temple; not the temple at Jerusalem, towards which men used to look when they prayed, being at a distance from it, 1 Kings 8:29; though there may be an allusion to such a practice; for it can hardly be thought that Jonah, in the fish's belly, could tell which way the temple stood; and look towards that; but he looked upwards and heavenwards; he looked up to God in his holy temple in heaven; and though he was afraid he would not look down upon him in a way of grace and mercy, he was resolved to look up to God in the way of prayer and supplication; and particularly, for the further encouragement of his faith and hope, he looked to the Messiah, the antitype of the temple, ark, and mercy seat, and for whose sake he might hope his prayers would be heard and answered. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "yet I will look again toward thy holy temple; not the temple at Jerusalem, towards which men used to look when they prayed, being at a distance from it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; though there may be an allusion to such a practice; for it can hardly be thought that Jonah, in the fish's belly, could tell which way the temple stood; and look towards that; but he looked upwards and heavenwards; he looked up to God in his holy temple in heaven; and though he was afraid he would not look down upon him in a way of grace and mercy, he was resolved to look up to God in the way of prayer and supplication; and particularly, for the further encouragement of his faith and hope, he looked to the Messiah, the antitype of the temple, ark, and mercy seat, and for whose sake he might hope his prayers would be heard and answered. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d)  \"e regione oculorum tuorum\", Montanus, Piscator; \"a coram oculis tuis\", Drusius, Burkius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d)  \"e regione oculorum tuorum\", Montanus, Piscator; \"a coram oculis tuis\", Drusius, Burkius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then I said, I am {c} cast out of thy sight; yet I will look again toward thy holy temple.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then I said, I am ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cast out of thy sight; yet I will look again toward thy holy temple.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) This declared what his prayer was, and how he laboured between hope and despair, considering the neglect of his vocation, and God's judgments for it: but yet in the end faith gained the victory.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then I said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The first clause of this verse may, perhaps, be a reminiscence of the first clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Heb. 23), though there the words “in my haste” are added, and a different verb (“cut off” instead of “cast out”) is used. “Jonah substitutes the stronger word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am cast forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", driven forth, expelled, like the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mire and dirt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which the waves drive along, or like the waves themselves in their restless motion (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ib.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or the heathen (the word is the same) whom God had driven out before Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or as Adam from Paradise. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)”—Pusey.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy holy temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not the heavenly temple or dwelling-place of God, but the literal temple. This is not, however, an expression of Jonah’s confident belief that, outcast as he now seemed to be, he would certainly be delivered, and visit again, and behold once more with his bodily eyes the temple on Mount Sion. It is the then present thought and resolution with which, when he said “I am cast out of Thy sight,” he corrected and overcame his unbelieving despondency. “One thing is left me still, one resource is still open to me, I will still pray, I will look (mentally) yet again towards Thy holy temple.” The phrase “to look towards the temple,” denoting prayer, has its origin in the prayer of Solomon at the dedication of the Temple. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:29-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The fact that Jonah was a prophet of the Northern Kingdom is no valid objection to this view. The Temple on Mount Sion was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the only centre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the true worship of Jehovah, and was recognised as such by all faithful Israelites. But it would be enough to say with Calvin, “He had been circumcised, he had been a worshipper of God from his youth, he had been educated in the Law, he had been a constant participator in the sacrifies: under the name of the Temple he briefly comprehends all these things.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Jonah confesses that he at first fully expected death; but faith and hope soon triumphed over despondency. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I am cast out of thy sight.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This was his thought when what is mentioned in ver. 3 happened unto him. The words are a reminiscence of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", altered somewhat to suit Jonah's circumstances. The psalmist says, \"I said in my haste.\" Jonah says simply, \"I said,\" without any limitation; and for \"I am cut off,\" Jonah uses, \"I am cast out.\" Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀπῶσμαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - a strong term, implying banishment with violence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Out of thy sight",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "frown before thine eyes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from thy protecting care (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He who had fled from the presence of the Lord in Canaan fears that he has forfeited the favour of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yet I will look again toward thy holy temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will turn in prayer to that holy place where thou dost manifest thy presence. The Jews were wont to turn towards Jerusalem when they prayed (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Some think that Jonah expresses a hope of worshipping again in the temple; but the turn of expression in the text hardly warrants this. Others refer the term to the heavenly temple, as they do in ver. 7; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jonah 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3 Thou castedst me into the deep, into the heart of the seas,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the stream surrounded me;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All Thy billows and Thy waves went over me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 Then I said, I am thrust away from Thine eyes,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet I will look again to Thy holy temple.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The more minute description of the peril of death is attached by Vav consec., to express not sequence in time, but sequence of thought. Jehovah cast him into the depth of the sea, because the seamen were merely the executors of the punishment inflicted upon him by Jehovah. Metsūlâh, the deep, is defined by \"the heart of the seas\" as the deepest abyss of the ocean. The plural yammı̄m (seas) is used here with distinct significance, instead of the singular, \"into the heart of the sea\" (yâm) in Exodus 15:8, to express the idea of the boundless ocean (see Dietrich, Abhandlung zur hebr. Grammatik, pp. 16, 17). The next clauses are circumstantial clauses, and mean, so that the current of the sea surrounded me, and all the billows and waves of the sea, which Jehovah had raised into a storm, went over me. Nâhâr, a river or stream, is the streaming or current of the sea, as in Psalm 24:2. The words of the second hemistich are a reminiscence of Psalm 42:8. What the Korahite singer of that psalm had experienced spiritually, viz., that one wave of trouble after another swept over him, that had the prophet literally experienced. Jonah \"does not say, The waves and the billows of the sea went over me; but Thy waves and Thy billows, because he felt in his conscience that the sea with its waves and billows was the servant of God and of His wrath, to punish sin\" (Luther). Jonah 2:4 contains the apodosis to Jonah 2:3: \"When Thou castedst me into the deep, then I said (sc., in my heart, i.e., then I thought) that I was banished from the sphere of Thine eyes, i.e., of Thy protection and care.\" These words are formed from a reminiscence of Psalm 31:23, נגרשׁתּי being substituted for the נגרזתּי of the psalm. The second hemistich is attached adversatively. אך, which there is no necessity to alter into אך  equals  איך, as Hitzig supposes, introduces the antithesis in an energetic manner, like אכם elsewhere, in the sense of nevertheless, as in Isaiah 14:15; Psalm 49:16; Job 13:15 (cf. Ewald, 354, a). The thought that it is all over with him is met by the confidence of faith that he will still look to the holy temple of the Lord, that is to say, will once more approach the presence of the Lord, to worship before Him in His temple, - an assurance which recals Psalm 5:8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The more minute description of the peril of death is attached by Vav consec., to express not sequence in time, but sequence of thought. Jehovah cast him into the depth of the sea, because the seamen were merely the executors of the punishment inflicted upon him by Jehovah. Metsūlâh, the deep, is defined by \"the heart of the seas\" as the deepest abyss of the ocean. The plural yammı̄m (seas) is used here with distinct significance, instead of the singular, \"into the heart of the sea\" (yâm) in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to express the idea of the boundless ocean (see Dietrich, Abhandlung zur hebr. Grammatik, pp. 16, 17). The next clauses are circumstantial clauses, and mean, so that the current of the sea surrounded me, and all the billows and waves of the sea, which Jehovah had raised into a storm, went over me. Nâhâr, a river or stream, is the streaming or current of the sea, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The words of the second hemistich are a reminiscence of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". What the Korahite singer of that psalm had experienced spiritually, viz., that one wave of trouble after another swept over him, that had the prophet literally experienced. Jonah \"does not say, The waves and the billows of the sea went over me; but Thy waves and Thy billows, because he felt in his conscience that the sea with its waves and billows was the servant of God and of His wrath, to punish sin\" (Luther). ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " contains the apodosis to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": \"When Thou castedst me into the deep, then I said (sc., in my heart, i.e., then I thought) that I was banished from the sphere of Thine eyes, i.e., of Thy protection and care.\" These words are formed from a reminiscence of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", נגרשׁתּי being substituted for the נגרזתּי of the psalm. The second hemistich is attached adversatively. אך, which there is no necessity to alter into אך  equals  איך, as Hitzig supposes, introduces the antithesis in an energetic manner, like אכם elsewhere, in the sense of nevertheless, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 14:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. Ewald, 354, a). The thought that it is all over with him is met by the confidence of faith that he will still look to the holy temple of the Lord, that is to say, will once more approach the presence of the Lord, to worship before Him in His temple, - an assurance which recals ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The thought that by the grace of the Lord he has been once more miraculously delivered out of the gates of death, and brought to the light of the world, is carried out still further in the following strophe, in entirely new turns of thought. ",
        "children": []
      }
    ]
  }
]