[[],[{"type":"header","content":"The Two Witnesses"},{"type":"prose","content":"Then there was given to me a measuring rod like a staff; and someone said, “Rise and measure the temple of God and the altar [of incense], and [count] those who worship in it. "}],[{"type":"prose","content":"But leave out the court [of the Gentiles] which is outside the temple and do not measure it, because it has been given to the Gentiles (the nations); and they will trample the holy city for forty-two months (three and one-half years). "}],[{"type":"prose","content":"And I will grant  to My two witnesses, and they will prophesy for twelve hundred and sixty days (forty-two months; three and one-half years), dressed in sackcloth.” "}],[{"type":"prose","content":"These [witnesses] are the two olive trees and the two lampstands which stand before the Lord of the earth. "}],[{"type":"prose","content":"And if anyone wants to harm them, fire comes out of their mouth and devours their enemies; so if anyone wants to harm them, he must be killed in this way. "}],[{"type":"prose","content":"These [two witnesses] have the power [from God] to shut up the sky, so that no rain will fall during the days of their prophesying [regarding judgment and salvation]; and they have power over the waters (seas, rivers) to turn them into blood, and to strike the earth with every [kind of] plague, as often as they wish."}],[{"type":"prose","content":"When they have finished their testimony  given their evidence, the beast that comes up out of the abyss (bottomless pit) will wage war with them, and overcome them and kill them. "}],[{"type":"prose","content":"And their dead bodies  in the open street of the great city (Jerusalem), which in a spiritual sense is called [by the symbolic and allegorical names of] Sodom and Egypt, where also their Lord was crucified. "}],[{"type":"prose","content":"Those from the peoples and tribes and languages and nations look at their dead bodies for three and a half days, and will not allow their dead bodies to be laid in a tomb. "}],[{"type":"prose","content":"And those [non-believers] who live on the earth will gloat over them and rejoice; and they will send gifts [in celebration] to one another, because these two prophets tormented  troubled those who live on the earth."}],[{"type":"prose","content":"But after three and a half days, the breath of life from God came into them, and they stood on their feet; and great fear  panic fell on those who were watching them. "}],[{"type":"prose","content":"And the two witnesses heard a loud voice from heaven saying to them, “Come up here.” Then they ascended into heaven in the cloud, and their enemies watched them. "}],[{"type":"prose","content":"And in that [very] hour there was a great earthquake, and a tenth of the city fell  was destroyed; seven thousand people were killed in the earthquake, and the rest [who survived] were overcome with terror, and they glorified the God of heaven [as they recognized His awesome power]."}],[{"type":"prose","content":"The second woe is past; behold, the third woe is coming quickly."}],[{"type":"header","content":"The Seventh Trumpet—Christ’s Reign Foreseen"},{"type":"prose","content":"Then the seventh angel sounded [his trumpet]; and there were loud voices in heaven, saying,“The kingdom (dominion, rule) of the world has become  of our Lord and of His Christ; and He will reign forever and ever.” "}],[{"type":"prose","content":"And the twenty-four elders, who sit on their thrones before God, fell face downward and worshiped God, "}],[{"type":"prose","content":"saying,“To You we give thanks, O Lord God Almighty [the Omnipotent, the Ruler of all], Who are and Who were, because You have taken Your great power  the sovereignty [which is rightly Yours] and have [now] begun to reign. "}],[{"type":"prose","content":"And the nations (Gentiles) became enraged, and Your wrath  indignation came, and the time came for the dead to be judged, and [the time came] to reward Your bond-servants the prophets and the saints (God’s people) and those who fear Your name, the small and the great, and [the time came] to destroy the destroyers of the earth.”"}],[{"type":"prose","content":"And the temple of God which is in heaven was opened; and the ark of His covenant appeared in His temple, and there were flashes of lightning, loud rumblings and peals of thunder and an earthquake and a great hailstorm."}]]