[{"num":3,"verse":"1 The genealogy of David, and his posterity unto the sons of Josiah."},{"num":1,"verse":"These also were the sons of David, which were born unto him in Hebron: the eldest Amnon of Ahinoam, the Jezreelitess: the second Daniel of Abigail the Carmelitess:"},{"num":2,"verse":"The third Absalom the son of Maacah daughter of Talmai King of Geshur: the fourth Adonijah the son of Haggith:"},{"num":3,"verse":"The fifth Shephatiah of Abital, the sixth Ithream by Eglah his wife."},{"num":4,"verse":"These six were born unto him in Hebron: and there he reigned seven years and six months: and in Jerusalem he reigned three and thirty years."},{"num":5,"verse":"And these four were born unto him in Jerusalem, Shimea, and Shobab, and Nathan, and Solomon of Bathshua the daughter of Ammiel:"},{"num":6,"verse":"Ibhar also, and Elishama, and Eliphelet,"},{"num":7,"verse":"And Nogah, and Nepheg, and Japhia,"},{"num":8,"verse":"And Elishama, and Eliada, and Eliphelet, nine in number."},{"num":9,"verse":"These are all the sons of David, besides the sons of the concubines, and Tamar their sister."},{"num":10,"verse":"¶ And Solomon’s son was Rehoboam, whose son was Abijah, and Asa his son, and Jehoshaphat his son,"},{"num":11,"verse":"And Joram his son, and Ahaziah his son, and Joash his son,"},{"num":12,"verse":"And Amaziah his son, and Azariah his son, and Jotham his son,"},{"num":13,"verse":"And Ahaz his son, and Hezekiah his son, and Manasseh his son,"},{"num":14,"verse":"And Amon his son, and Josiah his son."},{"num":15,"verse":"¶ And of the sons of Josiah, the eldest was Johanan, the second Jehoiakim, the third Zedekiah, and the fourth Shallum."},{"num":16,"verse":"And the sons of Jehoiakim were Jeconiah his son, and Zedekiah his son."},{"num":17,"verse":"And the sons of Jeconiah, Assir and Shealtiel his son:"},{"num":18,"verse":"Malchiram also and Pedaiah, and Shenazzar, Jecamiah, Hoshama, and Nedabiah."},{"num":19,"verse":"And the sons of Pedaiah were Zerubbabel, and Shimei: and the sons of Zerubbabel were Meshullam, and Hananiah, and Shelomith their sister,"},{"num":20,"verse":"And Hashubah, and Ohel, and Berechiah, and Hasadiah, and Jushab-Hesed, five in number."},{"num":21,"verse":"And the sons of Hananiah were Pelatiah, and Jeshaiah, the sons of Rephaiah, the sons of Arnan, the sons of Obadiah, the sons of Shechaniah."},{"num":22,"verse":"And the son of Shechaniah was Shemaiah: and the sons of Shemaiah were Hattush and Igal, and Bariah, and Neariah, and Shaphat, six."},{"num":23,"verse":"And the sons of Neariah were Elioenai, and Hezekiah, and Azrikam, three."},{"num":24,"verse":"And the sons of Elioenai were Hodaviah, and Eliashib, and Pelaiah, and Akkub, and Johanan, and Delaiah, and Anani, seven."}]