[{"num":3,"verse":"¶ Now these were the sons of David, which were born unto him in Hebron: the firstborn, Amnon of Ahinoam, the Jezreelitess; the second, Daniel of Abigail of Carmel;"},{"num":2,"verse":"the third, Absalom, the son of Maachah, the daughter of Talmai, king of Geshur; the fourth, Adonijah, the son of Haggith;"},{"num":3,"verse":"the fifth, Shephatiah of Abital; the sixth, Ithream by Eglah his wife."},{"num":4,"verse":"These six were born unto him in Hebron, and there he reigned seven years and six months, and in Jerusalem he reigned thirty-three years."},{"num":5,"verse":"And these were born unto him in Jerusalem: Shimea, Shobab, Nathan, and Solomon, four of Bathshua, the daughter of Ammiel:"},{"num":6,"verse":"And another nine: Ibhar, Elishama, Eliphelet,"},{"num":7,"verse":"Nogah, Nepheg, Japhia,"},{"num":8,"verse":"Elishama, Eliada, and Eliphelet."},{"num":9,"verse":"These were all the sons of David, beside the sons of the concubines, and Tamar was their sister."},{"num":10,"verse":"¶ And Solomon’s son was Rehoboam, Abia, his son; Asa, his son; Jehoshaphat, his son;"},{"num":11,"verse":"Joram, his son; Ahaziah, his son; Joash, his son;"},{"num":12,"verse":"Amaziah, his son; Azariah, his son; Jotham, his son;"},{"num":13,"verse":"Ahaz, his son; Hezekiah, his son; Manasseh, his son;"},{"num":14,"verse":"Amon, his son; Josiah, his son."},{"num":15,"verse":"And the sons of Josiah: the firstborn, Johanan; the second, Jehoiakim; the third, Zedekiah; the fourth, Shallum."},{"num":16,"verse":"The sons of Jehoiakim: Jeconiah, his son; Zedekiah his son."},{"num":17,"verse":"And the sons of Jeconiah: Assir, Salathiel, his son,"},{"num":18,"verse":"Malchiram also, Pedaiah, Shenazar, Jecamiah, Hoshama, and Nedabiah."},{"num":19,"verse":"And the sons of Pedaiah: Zerubbabel and Shimei. And the sons of Zerubbabel: Meshullam, Hananiah, and Shelomith, their sister."},{"num":20,"verse":"And of Meshullam: Hashubah, Ohel, Berechiah, Hasadiah, and Jushabhesed, five in all."},{"num":21,"verse":"The sons of Hananiah: Pelatiah and Jesaiah, the sons of Rephaiah, the sons of Arnan, the sons of Obadiah, the sons of Shechaniah."},{"num":22,"verse":"And the son of Shechaniah: Shemaiah, and the sons of Shemaiah: Hattush, Igeal, Bariah, Neariah, and Shaphat, six."},{"num":23,"verse":"And the sons of Neariah: Elioenai, Hezekiah, and Azrikam, three."},{"num":24,"verse":"And the sons of Elioenai: Hodaiah, Eliashib, Pelaiah, Akkub, Johanan, Dalaiah, and Anani, seven."}]