[{"num":3,"verse":"Now these were the sons of David who were born unto him in Hebron: the firstborn, Amnon, by Ahinoam the Jezreelitess; the second, Daniel, by Abigail the Carmelitess;"},{"num":2,"verse":"the third, Absalom, the son of Maacah the daughter of Talmai king of Geshur; the fourth, Adonijah, the son of Haggith;"},{"num":3,"verse":"the fifth, Shephatiah by Abital; the sixth, Ithream by Eglah his wife."},{"num":4,"verse":"These six were born unto him in Hebron; and there he reigned seven years and six months, and in Jerusalem he reigned thirty and three years."},{"num":5,"verse":"And these were born unto him in Jerusalem: Shimea, and Shobab, and Nathan, and Solomon, four by Bathshua the daughter of Ammiel;"},{"num":6,"verse":"Ibhar also, and Elishama, and Eliphelet,"},{"num":7,"verse":"and Nogah, and Nepheg, and Japhia,"},{"num":8,"verse":"and Elishama, and Eliada, and Eliphelet, nine."},{"num":9,"verse":"These were all the sons of David, besides the sons of the concubines, and Tamar their sister."},{"num":10,"verse":"And Solomon’s son was Rehoboam; Abijah was his son, Asa his son, Jehoshaphat his son,"},{"num":11,"verse":"Joram his son, Ahaziah his son, Joash his son,"},{"num":12,"verse":"Amaziah his son, Azariah his son, Jotham his son,"},{"num":13,"verse":"Ahaz his son, Hezekiah his son, Manasseh his son,"},{"num":14,"verse":"Amon his son, Josiah his son."},{"num":15,"verse":"And the sons of Josiah were the firstborn Johanan, the second Jehoiakim, the third Zedekiah, the fourth Shallum."},{"num":16,"verse":"And the sons of Jehoiakim: Jeconiah his son, Zedekiah his son."},{"num":17,"verse":"And the sons of Jeconiah: Assir, Shealtiel his son,"},{"num":18,"verse":"Malchiram also, and Pedaiah, and Shenazzar, Jecamiah, Hoshama, and Nedabiah."},{"num":19,"verse":"And the sons of Pedaiah were Zerubbabel and Shimei; and the sons of Zerubbabel: Meshullam, and Hananiah, and Shelomith their sister;"},{"num":20,"verse":"and Hashubah, and Ohel, and Berechiah, and Hasadiah, Jushabhesed, five."},{"num":21,"verse":"And the sons of Hananiah: Pelatiah, and Jeshaiah; the sons of Rephaiah, the sons of Arnan, the sons of Obadiah, the sons of Shechaniah."},{"num":22,"verse":"And the son of Shechaniah, Shemaiah; and the sons of Shemaiah: Hattush, and Igal, and Bariah, and Neariah, and Shaphat, six."},{"num":23,"verse":"And the sons of Neariah: Elioenai, and Hezekiah, and Azrikam, three."},{"num":24,"verse":"And the sons of Elioenai were Hodaviah, and Eliashib, and Pelaiah, and Akkub, and Johanan, and Delaiah, and Anani, seven."}]