[{"header":"David’s Family"},{"num":3,"verse":"These are David’s sons who were born in Hebron. The first was Amnon, whose mother was Ahinoam from Jezreel. The second son was Daniel, whose mother was Abigail from Carmel. "},{"num":2,"verse":"The third son was Absalom, whose mother was Maacah daughter of Talmai, the king of Geshur. The fourth son was Adonijah, whose mother was Haggith. "},{"num":3,"verse":"The fifth son was Shephatiah, whose mother was Abital. The sixth son was Ithream, whose mother was Eglah. "},{"num":4,"verse":"These six sons of David were born to him in Hebron, where David ruled for seven and one-half years."},{"num":5,"verse":"These were his children who were born in Jerusalem: Shammua, Shobab, Nathan, and Solomon—the four children of David and Bathsheba, Ammiel’s daughter. "},{"num":6,"verse":"David’s other nine children were Ibhar, Elishua, Eliphelet, Nogah, Nepheg, Japhia, Elishama, Eliada, and Eliphelet. "},{"num":9,"verse":"These were all of David’s sons, except for those born to his slave women. David also had a daughter named Tamar."},{"header":"The Kings of Judah"},{"num":10,"verse":"Solomon’s son was Rehoboam. Rehoboam’s son was Abijah. Abijah’s son was Asa. Asa’s son was Jehoshaphat. "},{"num":11,"verse":"Jehoshaphat’s son was Jehoram. Jehoram’s son was Ahaziah. Ahaziah’s son was Joash. "},{"num":12,"verse":"Joash’s son was Amaziah. Amaziah’s son was Azariah. Azariah’s son was Jotham. "},{"num":13,"verse":"Jotham’s son was Ahaz. Ahaz’s son was Hezekiah. Hezekiah’s son was Manasseh. "},{"num":14,"verse":"Manasseh’s son was Amon, and Amon’s son was Josiah."},{"num":15,"verse":"These were Josiah’s sons: His first son was Johanan, his second was Jehoiakim, his third was Zedekiah, and his fourth was Shallum."},{"num":16,"verse":"Jehoiakim was followed by Jehoiachin, and he was followed by Zedekiah."},{"header":"David’s Descendants After the Babylonian Captivity"},{"num":17,"verse":"Jehoiachin was taken as a prisoner. His sons were Shealtiel, "},{"num":18,"verse":"Malkiram, Pedaiah, Shenazzar, Jekamiah, Hoshama, and Nedabiah."},{"num":19,"verse":"Pedaiah’s sons were Zerubbabel and Shimei."},{"num":20,"verse":"Zerubbabel also had five other sons: Hashubah, Ohel, Berekiah, Hasadiah, and Jushab-Hesed."},{"num":21,"verse":"Hananiah’s descendants were Pelatiah and Jeshaiah, and the sons of Rephaiah, Arnan, Obadiah, and Shecaniah."},{"num":22,"verse":"Shecaniah’s son was Shemaiah. Shemaiah’s sons were Hattush, Igal, Bariah, Neariah, and Shaphat. There were six in all."},{"num":23,"verse":"Neariah had three sons: Elioenai, Hizkiah, and Azrikam."},{"num":24,"verse":"Elioenai had seven sons: Hodaviah, Eliashib, Pelaiah, Akkub, Johanan, Delaiah, and Anani."}]