[{"header":"Solomon’s administration"},{"num":4,"verse":"King Solomon became king of all Israel."},{"num":2,"verse":"These were his officials: the priest Azariah, Zadok’s son;"},{"num":3,"verse":"the scribes Elihoreph and Ahijah, the sons of Shisha; Jehoshaphat, the recorder, Ahilud’s son;"},{"num":4,"verse":"the general Benaiah, Jehoiada’s son; the priests Zadok and Abiathar;"},{"num":5,"verse":"Azariah, Nathan’s son, who was in charge of the officials; Zabud, Nathan’s son, a priest and royal friend;"},{"num":6,"verse":"Ahishar, who was in charge of the palace; and Adoniram, Abda’s son, who was supervisor of the work gangs."},{"num":7,"verse":"Solomon had twelve officers over all Israel. They supplied the king and his palace with food. Each would provide the supplies for one month per year."},{"num":8,"verse":"Here are their names:"},{"num":20,"verse":"Judah and Israel grew numerous like the sand alongside the sea. They ate, drank, and celebrated."},{"num":21,"verse":" Solomon ruled over all the states from the Euphrates River through the Philistines’ land and as far as the border of Egypt. These areas brought tribute to Solomon and served him all the days of his life."},{"num":22,"verse":"Solomon’s food requirements for a single day included thirty kors of refined flour; sixty kors of flour;"},{"num":23,"verse":"ten head of grain-fattened cattle; twenty head of pastured cattle; one hundred sheep; as well as deer, gazelles, roebucks, and the best of fowl."},{"num":24,"verse":"He ruled over all the lands west of the Euphrates River, from Tiphsah to Gaza, and over all the kings west of the Euphrates. He had peace on all sides."},{"num":25,"verse":"The people of Judah and Israel from Dan all the way to Beer-sheba lived securely under their vines and fig trees throughout the days of Solomon."},{"num":26,"verse":"Solomon had forty thousand horse stalls for his chariots and twelve thousand additional horses."},{"num":27,"verse":"The officials provided King Solomon and all who joined him at the royal table with monthly food rations. They left out nothing."},{"num":28,"verse":"Each brought their share of barley and straw for the horses and for the chariot horses, bringing it to its proper place."},{"num":29,"verse":"And God gave Solomon wisdom and very great understanding—insight as long as the seashore itself."},{"num":30,"verse":"Solomon’s wisdom was greater than all the famous Easterners, greater even than all the wisdom of Egypt."},{"num":31,"verse":"He was wiser than anyone, more wise than Ethan the Ezrahite or Mahol’s sons: Heman, Calcol, and Darda. His reputation was known throughout the region."},{"num":32,"verse":"Solomon spoke three thousand proverbs and one thousand five songs."},{"num":33,"verse":"He described the botany of trees, whether the cedar in Lebanon or the hyssop that grows out of the wall. He also described cattle, birds, anything that crawls on the ground, and fish."},{"num":34,"verse":"People came from everywhere to listen to Solomon’s wisdom; even the earth’s kings who had heard about his wisdom came!"}]