[{"header":"Nadab and Abihu"},{"num":10,"verse":"Now Nadab and Abihu, two of Aaron’s sons, each took an incense pan. They put fire and incense on them and offered unauthorized fire before the Lord, which he had not commanded them."},{"num":2,"verse":"Then fire flew out from before the Lord and devoured them, and they died before the Lord."},{"num":3,"verse":"Moses said to Aaron, “When the Lord said, ‘I will show that I am holy among those near me, and before all the people I will manifest my glorious presence,’ this is what he meant!” But Aaron was silent."},{"num":4,"verse":"Then Moses called Mishael and Elzaphan the sons of Uzziel, Aaron’s uncle, and told them, “Go carry your relatives out from the front of the sanctuary to a place outside the camp.”"},{"num":5,"verse":"So they went forward and carried Nadab and Abihu out by their tunics to a place outside the camp, just as Moses had ordered."},{"num":6,"verse":"Moses then said to Aaron and his sons, Eleazar and Ithamar, “Don’t dishevel your hair and don’t rip your clothes into pieces, or you will die and bring anger upon the whole community. Your family—all of Israel’s house—will mourn the burning the Lord has done."},{"num":7,"verse":"But you must not leave the meeting tent, or you will die because the Lord’s anointing oil is on you.” So they did what Moses ordered."},{"header":"Priestly drinking and eating"},{"num":8,"verse":"The Lord said to Aaron:"},{"num":9,"verse":"Both you and your sons must not drink wine or beer when you enter the meeting tent so that you don’t die—this is a permanent rule throughout your future generations—"},{"num":10,"verse":"so that you can distinguish between the holy and the common, and between the unclean and the clean,"},{"num":11,"verse":"and so that you can teach the Israelites all the rules that the Lord spoke to them through Moses."},{"num":12,"verse":"Moses then told Aaron and his remaining sons, Eleazar and Ithamar, “Take the grain offering that is left over from the Lord’s food gifts and eat it unleavened next to the altar, because it is most holy."},{"num":13,"verse":"You must eat it in a holy place because it is your portion and your sons’ portion from the Lord’s food gifts, as I have been commanded."},{"num":14,"verse":"You must eat the breast for the uplifted offering and the thigh for the gift offering in a clean place—both you and your sons and daughters. These things are designated as your portion and your children’s portion from the Israelites’ communal sacrifices of well-being."},{"num":15,"verse":"The Israelites must bring the thigh for the gift and the breast for the uplifted offering along with the food gifts of the fat pieces, to be lifted up as an uplifted offering before the Lord. These will belong to both you and your children as a permanent portion, just as the Lord has commanded.”"},{"num":16,"verse":"Then Moses asked about the male goat for the purification offering, and discovered that it had already been burned. He was angry with Eleazar and Ithamar, Aaron’s remaining sons, and asked,"},{"num":17,"verse":"“Why didn’t you eat the purification offering in the holy area? It’s most holy, and it was assigned to you for bearing the community’s punishment by making reconciliation for them before the Lord."},{"num":18,"verse":"Since its blood wasn’t brought into the sanctuary’s interior, you were to have eaten it in the sanctuary, just as I was commanded.”"},{"num":19,"verse":"“Look,” Aaron said to Moses, “today they offered their purification offerings and their entirely burned offerings before the Lord, but these things still happened to me! Would the Lord have approved if I had eaten a purification offering today?”"},{"num":20,"verse":"When Moses heard that, he approved."}]