[{"header":"Chapter 10"},{"num":1,"verse":"Nadab and Abihu. Aaron’s sons Nadab and Abihu took their censers and, putting incense on the fire they had set in them, they offered before the Lord unauthorized fire, such as he had not commanded. "},{"num":2,"verse":"Fire therefore came forth from the Lord’s presence and consumed them, so that they died in the Lord’s presence. "},{"num":3,"verse":"Moses then said to Aaron, “This is as the Lord said:"},{"num":4,"verse":"Then Moses summoned Mishael and Elzaphan, the sons of Aaron’s uncle Uzziel, with the order, “Come, carry your kinsmen from before the sanctuary to a place outside the camp.” "},{"num":5,"verse":"So they drew near and carried them by means of their tunics outside the camp, as Moses had commanded."},{"num":6,"verse":"Conduct of the Priests. Moses said to Aaron and his sons Eleazar and Ithamar, “Do not dishevel your hair or tear your garments, lest you die and bring God’s wrath also on the whole community. While your kindred, the rest of the house of Israel, may mourn for those whom the Lord’s fire has burned up, "},{"num":7,"verse":"you shall not go beyond the entrance of the tent of meeting, else you shall die; for the anointing oil of the Lord is upon you.” So they did as Moses told them."},{"num":8,"verse":"The Lord said to Aaron: "},{"num":9,"verse":"When you are to go to the tent of meeting, you and your sons are forbidden, by a perpetual statute throughout your generations, to drink any wine or strong drink, lest you die. "},{"num":10,"verse":"You must be able to distinguish between what is sacred and what is profane, and between what is clean and what is unclean; "},{"num":11,"verse":"and you must be able to teach the Israelites all the statutes that the Lord has given them through Moses."},{"num":12,"verse":"The Eating of the Priestly Portions. Moses said to Aaron and his surviving sons, Eleazar and Ithamar, “Take the grain offering left over from the oblations to the Lord, and eat it beside the altar in the form of unleavened cakes, since it is most holy. "},{"num":13,"verse":"You must eat it in a sacred place because it is your and your sons’ due from the oblations to the Lord; such is the command I have received. "},{"num":14,"verse":"The brisket of the elevated offering and the leg of the contribution, however, you and your sons and daughters may eat, in a clean place; for these have been assigned to you and your children as your due from the communion sacrifices of the Israelites. "},{"num":15,"verse":"The leg of the contribution and the brisket of the elevated offering shall be brought in with the oblations of fat to be raised as an elevated offering before the Lord. They shall belong to you and your children as your due forever, as the Lord has commanded.”"},{"num":16,"verse":"Moses inquired closely about the goat of the purification offering and discovered that it had all been burned. So he was angry with the surviving sons of Aaron, Eleazar and Ithamar, and said, "},{"num":17,"verse":"“Why did you not eat the purification offering in the sacred place, since it is most holy? It has been given to you that you might remove the guilt of the community and make atonement for them before the Lord. "},{"num":18,"verse":"Since its blood was not brought inside the sanctuary, you should certainly have eaten the offering in the sanctuary, as I was commanded.” "},{"num":19,"verse":"Aaron answered Moses, “Even though they presented their purification offering and burnt offering before the Lord today, still this misfortune has befallen me. Had I then eaten of the purification offering today, would it have been pleasing to the Lord?” "},{"num":20,"verse":"On hearing this, Moses was satisfied."}]