[{"header":"Nadab and Abihu"},{"num":10,"verse":"Now Nadab and Abi′hu, the sons of Aaron, each took his censer, and put fire in it, and laid incense on it, and offered unholy fire before the Lord, such as he had not commanded them. "},{"num":2,"verse":"And fire came forth from the presence of the Lord and devoured them, and they died before the Lord. "},{"num":3,"verse":"Then Moses said to Aaron, “This is what the Lord has said, ‘I will show myself holy among those who are near me, and before all the people I will be glorified.’” And Aaron held his peace."},{"num":4,"verse":"And Moses called Mish′a-el and Elza′phan, the sons of Uz′ziel the uncle of Aaron, and said to them, “Draw near, carry your brethren from before the sanctuary out of the camp.” "},{"num":5,"verse":"So they drew near, and carried them in their coats out of the camp, as Moses had said. "},{"num":6,"verse":"And Moses said to Aaron and to Elea′zar and Ith′amar, his sons, “Do not let the hair of your heads hang loose, and do not rend your clothes, lest you die, and lest wrath come upon all the congregation; but your brethren, the whole house of Israel, may bewail the burning which the Lord has kindled. "},{"num":7,"verse":"And do not go out from the door of the tent of meeting, lest you die; for the anointing oil of the Lord is upon you.” And they did according to the word of Moses."},{"num":8,"verse":"And the Lord spoke to Aaron, saying, "},{"num":9,"verse":"“Drink no wine nor strong drink, you nor your sons with you, when you go into the tent of meeting, lest you die; it shall be a statute for ever throughout your generations. "},{"num":10,"verse":"You are to distinguish between the holy and the common, and between the unclean and the clean; "},{"num":11,"verse":"and you are to teach the people of Israel all the statutes which the Lord has spoken to them by Moses.”"},{"num":12,"verse":"And Moses said to Aaron and to Elea′zar and Ith′amar, his sons who were left, “Take the cereal offering that remains of the offerings by fire to the Lord, and eat it unleavened beside the altar, for it is most holy; "},{"num":13,"verse":"you shall eat it in a holy place, because it is your due and your sons’ due, from the offerings by fire to the Lord; for so I am commanded. "},{"num":14,"verse":"But the breast that is waved and the thigh that is offered you shall eat in any clean place, you and your sons and your daughters with you; for they are given as your due and your sons’ due, from the sacrifices of the peace offerings of the people of Israel. "},{"num":15,"verse":"The thigh that is offered and the breast that is waved they shall bring with the offerings by fire of the fat, to wave for a wave offering before the Lord, and it shall be yours, and your sons’ with you, as a due for ever; as the Lord has commanded.”"},{"num":16,"verse":"Now Moses diligently inquired about the goat of the sin offering, and behold, it was burned! And he was angry with Elea′zar and Ith′amar, the sons of Aaron who were left, saying, "},{"num":17,"verse":"“Why have you not eaten the sin offering in the place of the sanctuary, since it is a thing most holy and has been given to you that you may bear the iniquity of the congregation, to make atonement for them before the Lord? "},{"num":18,"verse":"Behold, its blood was not brought into the inner part of the sanctuary. You certainly ought to have eaten it in the sanctuary, as I commanded.” "},{"num":19,"verse":"And Aaron said to Moses, “Behold, today they have offered their sin offering and their burnt offering before the Lord; and yet such things as these have befallen me! If I had eaten the sin offering today, would it have been acceptable in the sight of the Lord?” "},{"num":20,"verse":"And when Moses heard that, he was content."}]