[{"num":4,"verse":"When Yeshua learned that the P’rushim had heard he was making and immersing more talmidim than Yochanan "},{"num":2,"verse":"(although it was not Yeshua himself who immersed but his talmidim), "},{"num":3,"verse":"Yeshua left Y’hudah and set out again for the Galil. "},{"num":4,"verse":"This meant that he had to pass through Shomron."},{"num":5,"verse":"He came to a town in Shomron called Sh’khem, near the field Ya‘akov had given to his son Yosef. "},{"num":6,"verse":"Ya‘akov’s Well was there; so Yeshua, exhausted from his travel, sat down by the well; it was about noon. "},{"num":7,"verse":"A woman from Shomron came to draw some water; and Yeshua said to her, “Give me a drink of water.” "},{"num":8,"verse":"(His talmidim had gone into town to buy food.) "},{"num":9,"verse":"The woman from Shomron said to him, “How is it that you, a Jew, ask for water from me, a woman of Shomron?” (For Jews don’t associate with people from Shomron.) "},{"num":10,"verse":"Yeshua answered her, “If you knew God’s gift, that is, who it is saying to you, ‘Give me a drink of water,’ then you would have asked him; and he would have given you living water.”"},{"num":11,"verse":"She said to him, “Sir, you don’t have a bucket, and the well is deep; so where do you get this ‘living water’? "},{"num":12,"verse":"You aren’t greater than our father Ya‘akov, are you? He gave us this well and drank from it, and so did his sons and his cattle.” "},{"num":13,"verse":"Yeshua answered, “Everyone who drinks this water will get thirsty again, "},{"num":14,"verse":"but whoever drinks the water I will give him will never be thirsty again! On the contrary, the water I give him will become a spring of water inside him, welling up into eternal life!”"},{"num":15,"verse":"“Sir, give me this water,” the woman said to him, “so that I won’t have to be thirsty and keep coming here to draw water.” "},{"num":16,"verse":"He said to her, “Go, call your husband, and come back.” "},{"num":17,"verse":"She answered, “I don’t have a husband.” Yeshua said to her, “You’re right, you don’t have a husband! "},{"num":18,"verse":"You’ve had five husbands in the past, and you’re not married to the man you’re living with now! You’ve spoken the truth!”"},{"num":19,"verse":"“Sir, I can see that you are a prophet,” the woman replied. "},{"num":20,"verse":"“Our fathers worshipped on this mountain, but you people say that the place where one has to worship is in Yerushalayim.” "},{"num":21,"verse":"Yeshua said, “Lady, believe me, the time is coming when you will worship the Father neither on this mountain nor in Yerushalayim. "},{"num":22,"verse":"You people don’t know what you are worshipping; we worship what we do know, because salvation comes from the Jews. "},{"num":23,"verse":"But the time is coming — indeed, it’s here now — when the true worshippers will worship the Father spiritually and truly, for these are the kind of people the Father wants worshipping him. "},{"num":24,"verse":"God is spirit; and worshippers must worship him spiritually and truly.”"},{"num":25,"verse":"The woman replied, “I know that Mashiach is coming” (that is, “the one who has been anointed”). “When he comes, he will tell us everything.” "},{"num":26,"verse":"Yeshua said to her, “I, the person speaking to you, am he.”"},{"num":27,"verse":"Just then, his talmidim arrived. They were amazed that he was talking with a woman; but none of them said, “What do you want?” or, “Why are you talking with her?” "},{"num":28,"verse":"So the woman left her water-jar, went back to the town and said to the people there, "},{"num":29,"verse":"“Come, see a man who told me everything I’ve ever done. Could it be that this is the Messiah?” "},{"num":30,"verse":"They left the town and began coming toward him."},{"num":31,"verse":"Meanwhile, the talmidim were urging Yeshua, “Rabbi, eat something.” "},{"num":32,"verse":"But he answered, “I have food to eat that you don’t know about.” "},{"num":33,"verse":"At this, the talmidim asked one another, “Could someone have brought him food?” "},{"num":34,"verse":"Yeshua said to them, “My food is to do what the one who sent me wants and to bring his work to completion. "},{"num":35,"verse":"Don’t you have a saying, ‘Four more months and then the harvest’? Well, what I say to you is: open your eyes and look at the fields! They’re already ripe for harvest! "},{"num":36,"verse":"The one who reaps receives his wages and gathers fruit for eternal life, so that the reaper and the sower may be glad together — "},{"num":37,"verse":"for in this matter, the proverb, ‘One sows and another reaps,’ holds true. "},{"num":38,"verse":"I sent you to reap what you haven’t worked for. Others have done the hard labor, and you have benefited from their work.”"},{"num":39,"verse":"Many people from that town in Shomron put their trust in him because of the woman’s testimony, “He told me all the things I did.” "},{"num":40,"verse":"So when these people from Shomron came to him, they asked him to stay with them. He stayed two days, "},{"num":41,"verse":"and many more came to trust because of what he said. "},{"num":42,"verse":"They said to the woman, “We no longer trust because of what you said, because we have heard for ourselves. We know indeed that this man really is the Savior of the world.”"},{"num":43,"verse":"After the two days, he went on from there toward the Galil. "},{"num":44,"verse":"Now Yeshua himself said, “A prophet is not respected in his own country.” "},{"num":45,"verse":"But when he arrived in the Galil, the people there welcomed him, because they had seen all he had done at the festival in Yerushalayim; since they had been there too."},{"num":46,"verse":"He went again to Kanah in the Galil, where he had turned the water into wine. An officer in the royal service was there; his son was ill in K’far-Nachum. "},{"num":47,"verse":"This man, on hearing that Yeshua had come from Y’hudah to the Galil, went and asked him to come down and heal his son, for he was at the point of death. "},{"num":48,"verse":"Yeshua answered, “Unless you people see signs and miracles, you simply will not trust!” "},{"num":49,"verse":"The officer said to him, “Sir, come down before my child dies.” "},{"num":50,"verse":"Yeshua replied, “You may go, your son is alive.” The man believed what Yeshua said and left. "},{"num":51,"verse":"As he was going down, his servants met him with the news that his son was alive "},{"num":52,"verse":"So he asked them at what time he had gotten better; and they said, “The fever left him yesterday at one o’clock in the afternoon.” "},{"num":53,"verse":"The father knew that that was the very hour when Yeshua had told him, “Your son is alive”; and he and all his household trusted. "},{"num":54,"verse":"This was a second sign that Yeshua did; he did it after he had come from Y’hudah into the Galil."}]