[{"header":"The Samaritan Woman"},{"num":4,"verse":"Jesus found out that the Pharisees had heard he was making and baptizing more disciples than John, "},{"num":2,"verse":"though it was not Jesus himself who was baptizing but his disciples. "},{"num":3,"verse":"So he left Judea and went back again to Galilee."},{"num":4,"verse":"He had to go through Samaria. "},{"num":5,"verse":"So he came to a town in Samaria called Sychar, near the piece of land Jacob gave to his son Joseph. "},{"num":6,"verse":"Jacob’s well was there. Then Jesus, being tired from the journey, sat down by the well. It was about the sixth hour."},{"num":7,"verse":"A woman from Samaria came to draw water. Jesus said to her, “Give me a drink.” "},{"num":8,"verse":"(His disciples had gone into town to buy food.)"},{"num":9,"verse":"The Samaritan woman said to him, “How is it that you, a Jew, ask for a drink from me, a Samaritan woman?” (For Jews do not associate with Samaritans.)"},{"num":10,"verse":"Jesus answered her, “If you knew the gift of God and who it is that is saying to you, ‘Give me a drink,’ you would have asked him, and he would have given you living water.”"},{"num":11,"verse":"“Sir,” she said, “you don’t even have a bucket, and the well is deep. So where do you get this living water? "},{"num":12,"verse":"You are not greater than our father Jacob, are you? He gave us this well and drank from it himself, as did his sons and his animals.”"},{"num":13,"verse":"Jesus answered her, “Everyone who drinks this water will be thirsty again, "},{"num":14,"verse":"but whoever drinks the water I will give him will never be thirsty ever again. Rather, the water I will give him will become in him a spring of water, bubbling up to eternal life.”"},{"num":15,"verse":"“Sir, give me this water,” the woman said to him, “so I won’t get thirsty and have to keep coming here to draw water.”"},{"num":16,"verse":"Jesus told her, “Go, call your husband, and come back here.”"},{"num":17,"verse":"“I have no husband,” the woman answered."},{"num":18,"verse":"In fact, you have had five husbands, and the man you have now is not your husband. What you have said is true.”"},{"num":19,"verse":"“Sir,” the woman replied, “I see that you are a prophet. "},{"num":20,"verse":"Our fathers worshipped on this mountain, but you Jews insist that the place where we must worship is in Jerusalem.”"},{"num":21,"verse":"Jesus said to her, “Believe me, woman, a time is coming when you will not worship the Father on this mountain or in Jerusalem. "},{"num":22,"verse":"You Samaritans worship what you do not know. We worship what we do know, because salvation is from the Jews. "},{"num":23,"verse":"But a time is coming and now is here when the real worshippers will worship the Father in spirit and in truth, for those are the kind of worshippers the Father seeks. "},{"num":24,"verse":"God is spirit, and those who worship him must worship in spirit and in truth.”"},{"num":25,"verse":"The woman said to him, “I know that Messiah is coming” (the one called Christ). “When he comes, he will explain everything to us.”"},{"num":26,"verse":"Jesus said to her, “I, the one speaking to you, am he.”"},{"num":27,"verse":"Just then his disciples returned and were surprised that he was talking to a woman. Yet no one asked, “What do you want?” or “Why are you talking to her?”"},{"num":28,"verse":"Then the woman left her water jar and went back into town. She said to the people, "},{"num":29,"verse":"“Come, see the man who told me everything I ever did. Could this be the Christ?” "},{"num":30,"verse":"They left the town and came to him."},{"num":31,"verse":"Meanwhile, the disciples kept urging him, “Rabbi, eat.”"},{"num":32,"verse":"But Jesus said to them, “I have food to eat that you do not know about.”"},{"num":33,"verse":"Then the disciples said to each other, “Did anyone bring him something to eat?”"},{"num":34,"verse":"Jesus told them, “My food is to do the will of him who sent me and to finish his work. "},{"num":35,"verse":"Do you not say, ‘Four more months and the harvest will be here’? Pay attention to what I am telling you. Open your eyes and look at the fields, because they are already ripe for harvest. "},{"num":36,"verse":"The reaper is getting paid and is gathering grain for eternal life, so that the sower and the reaper may rejoice together. "},{"num":37,"verse":"Indeed in this case the saying is true, ‘One sows, and another reaps.’ "},{"num":38,"verse":"I sent you to reap a harvest for which you did no hard work. Others have done the hard work, and you have benefitted from their labor.”"},{"num":39,"verse":"Many Samaritans from that town believed in him because of the woman’s testimony: “He told me everything I ever did.” "},{"num":40,"verse":"So when the Samaritans came to him, they asked him to stay with them. And he stayed there two days. "},{"num":41,"verse":"Many more believed because of his message. "},{"num":42,"verse":"They told the woman, “We no longer believe because of what you said. Now we have heard for ourselves. And we know that this really is the Savior of the world.”"},{"header":"Jesus Heals an Officer’s Son"},{"num":43,"verse":"After two days, Jesus left for Galilee. "},{"num":44,"verse":"Now Jesus himself had testified that a prophet is not honored in his own country."},{"num":45,"verse":"When he came to Galilee, the Galileans welcomed him. They had seen all the things he did at the Festival in Jerusalem, because they also had gone to the Festival."},{"num":46,"verse":"Jesus came again to Cana in Galilee, where he had turned the water into wine."},{"num":47,"verse":"When this man heard that Jesus had come from Judea into Galilee, he went to him and begged him to come down and heal his son, because his son was about to die."},{"num":48,"verse":"Jesus told him, “Unless you people see miraculous signs and wonders, you certainly will not believe.”"},{"num":49,"verse":"The royal official said to him, “Lord, come down before my little boy dies.”"},{"num":50,"verse":"“Go,” Jesus told him, “your son is going to live.”"},{"num":51,"verse":"Already as he was going down, his servants met him with the news that his boy was going to live. "},{"num":52,"verse":"So he asked them what time his son got better. They told him, “Yesterday at the seventh hour the fever left him.” "},{"num":53,"verse":"Then the father realized that was the exact time when Jesus had told him, “Your son is going to live.” And he himself and his whole household believed."},{"num":54,"verse":"This was the second miraculous sign Jesus did after he came from Judea into Galilee."}]