[{"num":4,"verse":"The Pharisees heard that Jesus was getting people to follow him and was baptizing them. (Jesus' disciples baptized them, not he himself.) He now had more followers than John."},{"num":2,"verse":"The Lord knew that they had heard about it. So he left Judea and went back to Galilee again."},{"num":3,"verse":"He had to pass through the country of Samaria."},{"num":4,"verse":"He came to a town in Samaria called Sychar. It was near the field that Jacob gave to his son Joseph."},{"num":5,"verse":"Jacob's well was there. Jesus was very tired from walking on the road. So he sat down by the well. It was about midday."},{"num":6,"verse":"A woman from Samaria came to the well to draw water. Jesus said, `Please give me a drink of water.'"},{"num":7,"verse":"His disciples had gone into the town to buy some food."},{"num":8,"verse":"The woman said to Jesus, `Why do you ask me for a drink of water? You are a Jew and I am from Samaria.' (The Jews are not friends with the people of Samaria.)"},{"num":9,"verse":"Jesus answered her, `You do not know what God gives people. And you do not know who is asking you for a drink. If you knew him, then it is you who would have asked for a drink of water. He would give you living water.'"},{"num":10,"verse":"The woman said, `Sir, you have nothing to draw with. The well is deep. Where do you get that living water?"},{"num":11,"verse":"Are you greater than our father Jacob who gave us this well? He drank water from this well, also his children and cattle.'"},{"num":12,"verse":"Jesus answered her, `Anyone who drinks this water will be thirsty again."},{"num":13,"verse":"But anyone who drinks the water that I will give him will never be thirsty. The water I give him will become a well inside of him that will never be dry. It will give him life for ever.'"},{"num":14,"verse":"The woman said, `Sir, give me this water. Then I will never be thirsty again. I will not need to come here to draw water.'"},{"num":15,"verse":"Jesus said, `Go, call your husband, then come here.'"},{"num":16,"verse":"She said, `I have no husband.' Jesus said, `You say, \"I have no husband.\" That is true."},{"num":17,"verse":"You have had five husbands, but the man you are living with now is not your husband. You have told the truth.'"},{"num":18,"verse":"The woman said, `Sir, this shows me you are a prophet of God."},{"num":19,"verse":"Our fathers came to this mountain to worship God. But you people say Jerusalem is the place people must go to worship him.'"},{"num":20,"verse":"Jesus said, `Woman, believe what I say. The time is coming when you will not come to this mountain or to Jerusalem to worship my Father."},{"num":21,"verse":"You worship one whom you do not know. But we know whom we worship. The Saviour will come of the Jews."},{"num":22,"verse":"But the time is coming, yes, the time is here already, when those who worship God will worship him in spirit and in a true way. My Father is looking for that kind of people to worship him."},{"num":23,"verse":"God is Spirit. Those who worship him must do so in spirit and in a true way.'"},{"num":24,"verse":"The woman said to Jesus, `I know that Messiah is coming. His name is Christ. When he comes he will tell us everything.'"},{"num":25,"verse":"Jesus said to her, `I who am talking to you am he.'"},{"num":26,"verse":"When Jesus had said this, his disciples came back. They were surprised to hear him talking to a woman. But not one of them asked, `What do you want?' or, `Why are you talking to her?'"},{"num":27,"verse":"The woman left her water-pot and went back to the town."},{"num":28,"verse":"She said to the people, `Come, I will show you a man who has told me everything I have done. Can this be the Christ?'"},{"num":29,"verse":"The people left the town and went to him."},{"num":30,"verse":"While they were on the way coming to Jesus, the disciples asked him, `Teacher, will you please eat.'"},{"num":31,"verse":"Jesus said to them, `I have food that you do not know about.'"},{"num":32,"verse":"So the disciples asked one another, `Has anyone brought him food to eat?'"},{"num":33,"verse":"Jesus said to them, `My food is to obey the one who sent me and to finish his work."},{"num":34,"verse":"Do you not say, \"In four months it will be harvest time\"? Listen, I say. Look up and see the fields. The harvest is ready to cut now."},{"num":35,"verse":"The one who gathers the harvest receives a reward for it. He gathers a harvest that will live for ever. Then the one who sows and the one who gathers will both be happy."},{"num":36,"verse":"This saying is true here: \"One sows and another gathers.\""},{"num":37,"verse":"I sent you to gather what you did not help to plant. Other people have worked hard and you have been helped through their work.'"},{"num":38,"verse":"Many of the people of the town believed in Jesus because of what the woman told them. She said, `He told me everything I have done.'"},{"num":39,"verse":"When the people from Samaria came, they begged him to stay with them. So he stayed with them for two days."},{"num":40,"verse":"Many more people believed in Jesus because of his own word."},{"num":41,"verse":"They said to the woman, `Now we believe, not because of what you told us, but because of what he himself has told us. We know it is true. This is the Saviour of the world.'"},{"num":42,"verse":"Two days after this, Jesus left Samaria and went to Galilee."},{"num":43,"verse":"Jesus himself said, `No prophet is honoured by the people in his own country.'"},{"num":44,"verse":"When he came to Galilee, the people of that country were glad to see him. They had seen all the things he did when he was at the feast in Jerusalem. They had been at the feast also."},{"num":45,"verse":"So Jesus came back to the town of Cana in Galilee. That was the place where he had changed water into wine. One of the king's officers was there. His son was sick in the town of Capernaum."},{"num":46,"verse":"He heard that Jesus had come from Judea to Galilee, and he went to Jesus and said, `I beg you, come and heal my son. He is dying.'"},{"num":47,"verse":"Jesus said to him, `If you do not see some signs and big works, then you will not believe.'"},{"num":48,"verse":"The officer said, `Sir, I beg you. Come right away before my son dies.'"},{"num":49,"verse":"Jesus said, `Go home. Your son will not die.' The man believed what Jesus said and went home."},{"num":50,"verse":"On the way, his servants met him. They said, `Your son is living.'"},{"num":51,"verse":"He asked, `What time did he begin to get well?' They said, `Yesterday at one hour after midday the fever left him.'"},{"num":52,"verse":"The father knew that was the time when Jesus said to him `Your son will not die.' So he and all his family believed in Jesus."},{"num":53,"verse":"This was the second big work that Jesus did after he came back from Judea to Galilee."}]