[{"num":7,"verse":"2 The heads or princes of Israel offer at the setting up of the Tabernacle. 10 And at the dedication of the Altar. 19 God speaketh to Moses from the Mercy seat."},{"num":1,"verse":"Now when Moses had finished the setting up of the Tabernacle, and anointed it and sanctified it, and all the instruments thereof, and the altar with all the instruments thereof, and had anointed them, and sanctified them,"},{"num":2,"verse":"Then the princes of Israel, heads over the houses of their fathers, (they were the princes of the tribes, who were over them that were numbered) offered,"},{"num":3,"verse":"And brought their offering before the Lord, six covered chariots, and twelve oxen: one chariot for two princes, and for every one an ox, and they offered them before the Tabernacle."},{"num":4,"verse":"And the Lord spake unto Moses, saying,"},{"num":5,"verse":"Take these of them, that they may be to do the service of the Tabernacle of the Congregation, and thou shalt give them unto the Levites, to every man according unto his office."},{"num":6,"verse":"So Moses took the chariots and the oxen, and gave them unto the Levites:"},{"num":7,"verse":"Two chariots and four oxen he gave to the sons of Gershon, according unto their office."},{"num":8,"verse":"And four chariots and eight oxen he gave to the sons of Merari, according unto their office, under the hand of Ithamar the son of Aaron the Priest."},{"num":9,"verse":"But to the sons of Kohath he gave none, because the charge of the Sanctuary belonged to them, which they did bear upon their shoulders."},{"num":10,"verse":"¶ The princes also offered in the dedication for the altar in the day that it was anointed: then the princes offered their offering before the altar."},{"num":11,"verse":"And the Lord said unto Moses, One prince one day, and another prince another day, shall offer their offering, for the dedication of the altar."},{"num":12,"verse":"¶ So then on the first day did Nahshon the son of Amminadab of the tribe of Judah offer his offering."},{"num":13,"verse":"And his offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":14,"verse":"An incense cup of gold of ten shekels, full of incense,"},{"num":15,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":16,"verse":"An he goat for a sin offering,"},{"num":17,"verse":"And for peace offerings, two bullocks, five rams, five he goats, and five lambs of a year old: this was the offering of Nahshon the son of Amminadab."},{"num":18,"verse":"¶ The second day Nethanel, the son of Zuar, prince of the tribe of Issachar did offer."},{"num":19,"verse":"Who offered for his offering a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":20,"verse":"An incense cup of gold of ten shekels, full of incense,"},{"num":21,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":22,"verse":"An he goat for a sin offering,"},{"num":23,"verse":"And for peace offerings two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Nethanel the son of Zuar."},{"num":24,"verse":"¶ The third day Eliab the son of Helon prince of the children of Zebulun offered."},{"num":25,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":26,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":27,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":28,"verse":"An he goat for a sin offering,"},{"num":29,"verse":"And for peace offerings, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Eliab the son of Helon."},{"num":30,"verse":"¶ The fourth day Elizur the son of Shedeur prince of the children of Reuben offered."},{"num":31,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":32,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":33,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":34,"verse":"An he goat for a sin offering,"},{"num":35,"verse":"And for a peace offering, two bullocks, five rams, five he goats, and five lambs of a year old: this was the offering of Elizur the son of Shedeur."},{"num":36,"verse":"¶ The fifth day Shelumiel the son of Zurishaddai, prince of the children of Simeon offered."},{"num":37,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels: after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":38,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":39,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":40,"verse":"An he goat for a sin offering,"},{"num":41,"verse":"And for a peace offering, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Shelumiel the son of Zurishaddai."},{"num":42,"verse":"¶ The sixth day Eliasaph the son of Deuel prince of the children of Gad offered."},{"num":43,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":44,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":45,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":46,"verse":"An he goat for a sin offering,"},{"num":47,"verse":"And for a peace offering, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Eliasaph the son of Deuel."},{"num":48,"verse":"¶ The seventh day Elishama the son of Ammihud prince of the children of Ephraim offered."},{"num":49,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":50,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":51,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":52,"verse":"An he goat for a sin offering,"},{"num":53,"verse":"And for a peace offering, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Elishama the son of Ammihud."},{"num":54,"verse":"¶ The eighth day offered Gamaliel the son of Pedahzur, prince of the children of Manasseh."},{"num":55,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":56,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":57,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":58,"verse":"An he goat for a sin offering,"},{"num":59,"verse":"And for a peace offering, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Gamaliel the son of Pedahzur."},{"num":60,"verse":"¶ The ninth day Abidan the son of Gideoni prince of the children of Benjamin offered."},{"num":61,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":62,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":63,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":64,"verse":"An he goat for a sin offering,"},{"num":65,"verse":"And for a peace offering, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Abidan the son of Gideoni."},{"num":66,"verse":"¶ The tenth day Ahiezer the son of Ammishaddai, prince of the children of Dan offered."},{"num":67,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":68,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":69,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":70,"verse":"An he goat for a sin offering,"},{"num":71,"verse":"And for a peace offering, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Ahiezer the son of Ammishaddai."},{"num":72,"verse":"¶ The eleventh day Pagiel the son of Ocran, prince of the children of Asher offered."},{"num":73,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":74,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":75,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":76,"verse":"An he goat for a sin offering,"},{"num":77,"verse":"And for a peace offering, two bullocks, five rams, five he goats, five lambs of a year old: this was the offering of Pagiel the son of Ocran."},{"num":78,"verse":"¶ The twelfth day Ahira the son of Enan, prince of the children of Naphtali offered."},{"num":79,"verse":"His offering was a silver charger of an hundred and thirty shekels weight, a silver bowl of seventy shekels, after the shekel of the Sanctuary, both full of fine flour, mingled with oil, for a meat offering,"},{"num":80,"verse":"A golden incense cup of ten shekels, full of incense,"},{"num":81,"verse":"A young bullock, a ram, a lamb of a year old for a burnt offering,"},{"num":82,"verse":"An he goat for a sin offering,"},{"num":83,"verse":"And for peace offerings, two bullocks, five rams, five he goats, five lambs of a year old, this was the offering of Ahira the son of Enan."},{"num":84,"verse":"This was the dedication of the Altar by the princes of Israel, when it was anointed, twelve chargers of silver, twelve silver bowls: twelve incense cups of gold,"},{"num":85,"verse":"Every charger containing an hundred and thirty shekels of silver, and every bowl seventy: all the silver vessel contained two thousand and four hundred shekels, after the shekel of the Sanctuary."},{"num":86,"verse":"Twelve incense cups of gold full of incense, containing ten shekels every cup, after the shekel of the Sanctuary: and the gold of the incense cups was an hundred and twenty shekels."},{"num":87,"verse":"All the bullocks for the burnt offering were twelve bullocks, the rams twelve, the lambs of a year old twelve, with their meat offerings, and twelve he goats for a sin offering."},{"num":88,"verse":"And all the bullocks for the peace offerings were four and twenty bullocks, the rams sixty, the he goats sixty, the lambs of a year old sixty: this was the dedication of the Altar, after that it was anointed."},{"num":89,"verse":"And when Moses went into the tabernacle of the Congregation to speak with God, he heard the voice of one speaking unto him from the Mercy seat, that was upon the Ark of the Testimony between the two Cherubims, and he spake unto him."}]