[{"num":7,"verse":"¶ And it came to pass on the day that Moses had fully set up the tabernacle and had anointed it and sanctified it with all its vessels; likewise having anointed and sanctified the altar, with all its vessels;"},{"num":2,"verse":"that the princes of Israel, heads of the houses of their fathers, who were the princes of the tribes, and were over those that were numbered, offered;"},{"num":3,"verse":"and they brought their offerings before the LORD, six covered wagons and twelve oxen: a wagon for each two of the princes and for each one an ox, which they offered before the tabernacle."},{"num":4,"verse":"And the LORD spoke unto Moses, saying,"},{"num":5,"verse":"Take it from them, and it shall be for the service of the tabernacle of the testimony; and thou shalt give them unto the Levites, to each one according to his ministry."},{"num":6,"verse":"Then Moses received the wagons and the oxen, and gave them unto the Levites."},{"num":7,"verse":"Two wagons and four oxen he gave unto the sons of Gershon, according to their ministry;"},{"num":8,"verse":"and four wagons and eight oxen he gave unto the sons of Merari, according to their ministry, under the hand of Ithamar, the son of Aaron the priest."},{"num":9,"verse":"But unto the sons of Kohath he gave none; because the ministry of the sanctuary belonging unto them was that they should bear upon their shoulders."},{"num":10,"verse":"¶ And the princes offered at the dedication of the altar the day that it was anointed; even the princes offered their offering before the altar."},{"num":11,"verse":"And the LORD said unto Moses, They shall offer their offering, each prince on his day, at the dedication of the altar."},{"num":12,"verse":"And he that offered his offering the first day was Nahshon, the son of Amminadab, of the tribe of Judah."},{"num":13,"verse":"And his offering was one silver charger, the weight thereof was one hundred and thirty shekels, and one silver bowl of seventy shekels, after the shekel of the sanctuary; both of them were full of fine flour mingled with oil for a present;"},{"num":14,"verse":"one spoon of ten shekels of gold, full of incense;"},{"num":15,"verse":"one young bullock, one ram, one lamb of the first year, for a burnt offering;"},{"num":16,"verse":"one he goat as the sin;"},{"num":17,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Nahshon, the son of Amminadab."},{"num":18,"verse":"On the second day Nethaneel, the son of Zuar, prince of Issachar, offered."},{"num":19,"verse":"He offered for his offering one silver charger, the weight thereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary; both of them full of fine flour mingled with oil for a present;"},{"num":20,"verse":"one spoon of gold of ten shekels, full of incense;"},{"num":21,"verse":"one young bullock, one ram, one lamb of the first year, for a burnt offering;"},{"num":22,"verse":"one he goat as the sin;"},{"num":23,"verse":"and for a sacrifice of peace: two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Nethaneel the son of Zuar."},{"num":24,"verse":"On the third day Eliab, the son of Helon, prince of the sons of Zebulun."},{"num":25,"verse":"His offering was one silver charger, the weight thereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary; both of them full of fine flour mingled with oil for a present;"},{"num":26,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":27,"verse":"one young bullock, one ram, one lamb of the first year, for a burnt offering;"},{"num":28,"verse":"one he goat as the sin;"},{"num":29,"verse":"and for a sacrifice of peace: two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Eliab, the son of Helon."},{"num":30,"verse":"On the fourth day Elizur, the son of Shedeur, prince of the sons of Reuben."},{"num":31,"verse":"His offering was one silver charger of the weight of one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":32,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":33,"verse":"one young bullock, one ram, one lamb of the first year, for a burnt offering;"},{"num":34,"verse":"one he goat as the sin;"},{"num":35,"verse":"and for a sacrifice of peace: two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Elizur, the son of Shedeur."},{"num":36,"verse":"On the fifth day Shelumiel the son of Zurishaddai, prince of the sons of Simeon."},{"num":37,"verse":"His offering was one silver charger, the weight thereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":38,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":39,"verse":"one young bullock, one ram, one lamb of the first year, for a burnt offering;"},{"num":40,"verse":"one he goat as the sin;"},{"num":41,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Shelumiel the son of Zurishaddai."},{"num":42,"verse":"On the sixth day Eliasaph the son of Deuel, prince of the sons of Gad."},{"num":43,"verse":"His offering was one silver charger of the weight of a hundred and thirty shekels, a silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":44,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":45,"verse":"one young bullock, one ram, one lamb of the first year, for a burnt offering;"},{"num":46,"verse":"one kid of the goats as the sin;"},{"num":47,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Eliasaph, the son of Deuel."},{"num":48,"verse":"On the seventh day Elishama, the son of Ammihud, prince of the sons of Ephraim."},{"num":49,"verse":"His offering was one silver charger, the weight whereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":50,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":51,"verse":"one young bullock, one ram, one lamb of the first year, as a burnt offering;"},{"num":52,"verse":"one he goat as the sin;"},{"num":53,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Elishama the son of Ammihud."},{"num":54,"verse":"On the eighth day Gamaliel, the son of Pedahzur, prince of the sons of Manasseh."},{"num":55,"verse":"His offering was one silver charger of the weight of one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":56,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":57,"verse":"one young bullock, one ram, one lamb of the first year, as a burnt offering;"},{"num":58,"verse":"one he goat as the sin;"},{"num":59,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Gamaliel, the son of Pedahzur."},{"num":60,"verse":"On the ninth day Abidan, the son of Gideoni, prince of the sons of Benjamin."},{"num":61,"verse":"His offering was one silver charger, the weight thereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":62,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":63,"verse":"one young bullock, one ram, one lamb of the first year, as a burnt offering;"},{"num":64,"verse":"one he goat as the sin;"},{"num":65,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Abidan, the son of Gideoni."},{"num":66,"verse":"On the tenth day Ahiezer, the son of Ammishaddai, prince of the sons of Dan."},{"num":67,"verse":"His offering was one silver charger, the weight thereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":68,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":69,"verse":"one young bullock, one ram, one lamb of the first year, for a burnt offering;"},{"num":70,"verse":"one he goat as the sin;"},{"num":71,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Ahiezer, the son of Ammishaddai."},{"num":72,"verse":"On the eleventh day Pagiel, the son of Ocran, prince of the sons of Asher."},{"num":73,"verse":"His offering was one silver charger, the weight thereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":74,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":75,"verse":"one young bullock, one ram, one lamb of the first year, as a burnt offering;"},{"num":76,"verse":"one he goat as the sin;"},{"num":77,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Pagiel, the son of Ocran."},{"num":78,"verse":"On the twelfth day Ahira, the son of Enan, prince of the sons of Naphtali."},{"num":79,"verse":"His offering was one silver charger, the weight thereof was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil for a present;"},{"num":80,"verse":"one golden spoon of ten shekels, full of incense;"},{"num":81,"verse":"one young bullock, one ram, one lamb of the first year, as a burnt offering;"},{"num":82,"verse":"one kid of the goats as the sin;"},{"num":83,"verse":"and for a sacrifice of peace, two oxen, five rams, five he goats, five lambs of the first year. This was the offering of Ahira, the son of Enan."},{"num":84,"verse":"This was the dedication of the altar, the day when it was anointed, by the princes of Israel: twelve chargers of silver, twelve silver bowls, twelve spoons of gold,"},{"num":85,"verse":"each charger of silver weighing one hundred and thirty shekels, each bowl seventy; all the silver of the vessels, two thousand four hundred shekels, after the shekel of the sanctuary."},{"num":86,"verse":"The twelve golden spoons full of incense, ten shekels apiece, after the shekel of the sanctuary; all the gold of the spoons was one hundred and twenty shekels."},{"num":87,"verse":"All the oxen for the burnt offering were twelve bullocks, the rams twelve, the lambs of the first year twelve, with their present; and the he goats for sin twelve."},{"num":88,"verse":"And all the oxen for the sacrifice of the peace were twenty-four bullocks, the rams sixty, the he goats sixty, the lambs of the first year sixty. This was the dedication of the altar, after it was anointed."},{"num":89,"verse":"And when Moses entered into the tabernacle of the testimony to speak with Him, then he heard the voice of the one speaking unto him from above the seat of reconciliation that was over the ark of the testimony, from between the two cherubim; and he spoke with him."}]