[{"num":7,"verse":"And it was done in the day in which Moses fulfilled, or ended, the tabernacle, and areared it, and anointed it, and hallowed it with all the vessels, or instruments, thereof, and the altar he hallowed in like manner, and the vessels thereof. (And it was done on the day in which Moses finished the Tabernacle, and raised it up, that he anointed it, and consecrated it, or dedicated it, and all of its vessels, or its instruments, and the altar, and its vessels.)"},{"num":2,"verse":"And the princes of Israel, and the heads of families, that were, by all lineages, the sovereigns of them that were numbered, (And the leaders of Israel, that is, the heads of the families, who were, by all the tribes, the rulers of those who were listed, or were registered,)"},{"num":3,"verse":"offered gifts before the Lord, six wains covered, with twelve oxen; two dukes offered one wain, and each offered one ox. And they offered those wains before the tabernacle. (brought their offerings before the Lord, in six covered wagons, with twelve oxen; two leaders, or two chief men, offered one wagon, and each offered one ox. And they brought those wagons to the front of the Tabernacle.)"},{"num":4,"verse":"Soothly the Lord said to Moses,"},{"num":5,"verse":"Take thou of them, that they serve in the service of the tabernacle, and betake thou those things to the deacons, by the order of their service. (Receive thou these gifts from them, to use in service for the Tabernacle, and give thou them to the Levites, according to the order of their service.)"},{"num":6,"verse":"And so when Moses had taken the wains, and the oxen, he betook them to the deacons. (And so when Moses had received the wagons, and the oxen, he gave them to the Levites.)"},{"num":7,"verse":"He gave two wains and four oxen to the sons of Gershon, after that (that) they had need (of)."},{"num":8,"verse":"He gave four other wains and eight oxen to the sons of Merari, by their offices and religion (for their duties and their service), under the hand of Ithamar, the son of Aaron, the priest."},{"num":9,"verse":"Forsooth he gave not wains and oxen to the sons of Kohath, for they serve in the saintuary, and bear the charges with their own shoulders. (But he did not give any wagons or oxen to the sons of Kohath, for they serve in the sanctuary, and carry the loads with their own shoulders.)"},{"num":10,"verse":"Therefore the dukes offered, in the hallowing of the altar, in the day in which it was anointed, their offering to the Lord, before the altar. (And so the leaders offered, for the dedication of the altar, on the day in which it was anointed, their offering to the Lord, before the altar.)"},{"num":11,"verse":"And the Lord said to Moses, All the dukes by themselves offer they gifts, by all days by themselves, into the hallowing of the altar. (And the Lord said to Moses, Have all the leaders offer their gifts, one by one, in the days that follow, for the dedication of the altar.)"},{"num":12,"verse":"Nahshon, the son of Amminadab, (the prince) of the lineage of Judah, offered his offering in the first day; and (he offered) (On the first day, Nahshon, the son of Amminadab, the leader of the sons of Judah, offered)"},{"num":13,"verse":"a silver vessel to prove incense and such things, in the weight of an hundred and thirty shekels, a basin of silver, having seventy shekels by the weight of the saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure, or the standard, of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":14,"verse":"a spoon of ten golden shekels, full of incense. (and a gold saucer, weighing ten shekels, full of incense.)"},{"num":15,"verse":"He offered an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (And he offered an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":16,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":17,"verse":"And he offered in the sacrifice of peaceable things, twain oxen, five rams, five goat bucks, five lambs of one year. This is the offering of Nahshon, the son of Amminadab. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Nahshon, the son of Amminadab.)"},{"num":18,"verse":"In the second day, Nethaneel, the son of Zuar, duke of the lineage of Issachar, offered (On the second day, Nethaneel, the son of Zuar, the leader of the sons of Issachar, offered)"},{"num":19,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels by the weight of the saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":20,"verse":"a golden spoon, having ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":21,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":22,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":23,"verse":"And in the sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Nethaneel the son of Zuar. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Nethaneel the son of Zuar.)"},{"num":24,"verse":"In the third day (On the third day), Eliab, the son of Helon, the prince of the sons of Zebulun, offered"},{"num":25,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":26,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":27,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":28,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":29,"verse":"And in the sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This is the offering of Eliab, the son of Helon. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Eliab, the son of Helon.)"},{"num":30,"verse":"In the fourth day (On the fourth day), Elizur, the son of Shedeur, the prince of the sons of Reuben, offered"},{"num":31,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":32,"verse":"a golden spoon weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":33,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":34,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":35,"verse":"And into [the] sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Elizur, the son of Shedeur. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Elizur, the son of Shedeur.)"},{"num":36,"verse":"In the fifth day (On the fifth day), Shelumiel, the son of Zurishaddai, the prince of the sons of Simeon, offered"},{"num":37,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":38,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":39,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":40,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":41,"verse":"And into [the] sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Shelumiel, the son of Zurishaddai. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Shelumiel, the son of Zurishaddai.)"},{"num":42,"verse":"In the sixth day (On the sixth day), Eliasaph, the son of Deuel, the prince of the sons of Gad, offered"},{"num":43,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into (a) sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":44,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":45,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":46,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":47,"verse":"And into (the) sacrifice of peaceable things he offered two oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Eliasaph, the son of Deuel. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Eliasaph, the son of Deuel.)"},{"num":48,"verse":"In the seventh day (On the seventh day), Elishama, the son of Ammihud, the prince of the sons of Ephraim, offered"},{"num":49,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":50,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":51,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":52,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":53,"verse":"And into (the) sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Elishama, the son of Ammihud. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Elishama, the son of Ammihud.)"},{"num":54,"verse":"In the eighth day (On the eighth day), Gamaliel, the son of Pedahzur, the prince of the sons of Manasseh, offered"},{"num":55,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":56,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":57,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":58,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":59,"verse":"And into (the) sacrifices of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Gamaliel, the son of Pedahzur. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Gamaliel, the son of Pedahzur.)"},{"num":60,"verse":"In the ninth day (On the ninth day), Abidan, the son of Gideoni, the prince of the sons of Benjamin, offered"},{"num":61,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":62,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":63,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":64,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":65,"verse":"And into the sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Abidan, the son of Gideoni. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Abidan, the son of Gideoni.)"},{"num":66,"verse":"In the tenth day (On the tenth day), Ahiezer, the son of Ammishaddai, the prince of the sons of Dan, offered"},{"num":67,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":68,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":69,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":70,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":71,"verse":"And into (the) sacrifices of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Ahiezer, the son of Ammishaddai. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Ahiezer, the son of Ammishaddai.)"},{"num":72,"verse":"In the eleventh day (On the eleventh day), Pagiel, the son of Ocran, the prince of the sons of Asher, offered"},{"num":73,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":74,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer, weighing ten shekels, full of incense;)"},{"num":75,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":76,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":77,"verse":"And into (the) sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Pagiel, the son of Ocran. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Pagiel, the son of Ocran.)"},{"num":78,"verse":"In the twelfth day (And on the twelfth day), Ahira, the son of Enan, the prince of the sons of Naphtali, offered"},{"num":79,"verse":"a silver vessel to prove incense and such things, weighing an hundred and thirty shekels, a silver basin, having seventy shekels at the weight of [the] saintuary, ever either full of [tried] flour sprinkled (al)together with oil, into sacrifice; (a silver vessel, weighing a hundred and thirty shekels, and a silver basin, weighing seventy shekels, by the measure of the sanctuary, and each full of fine flour sprinkled with oil, for a grain offering;)"},{"num":80,"verse":"a golden spoon, weighing ten shekels, full of incense; (a gold saucer weighing ten shekels, full of incense;)"},{"num":81,"verse":"an ox of the drove, and a ram, and a lamb of one year, into burnt sacrifice; (an ox from the herd, and a ram, and a one-year-old lamb, for a burnt sacrifice;)"},{"num":82,"verse":"and a buck of (the) goats, for sin. (and a goat buck, for a sin offering.)"},{"num":83,"verse":"And into (the) sacrifice of peaceable things he offered twain oxen, five rams, five goat bucks, five lambs of one year. This was the offering of Ahira, the son of Enan. (And for a peace offering, he offered two oxen, five rams, five goat bucks, and five one-year-old lambs. This was the offering of Ahira, the son of Enan.)"},{"num":84,"verse":"These things were offered of the sons of Israel, in the hallowing of the altar, in the day in which it was hallowed; silver vessels to prove incense and such things twelve, silver basins twelve, golden spoons twelve; (These were the things that were offered by the leaders of Israel, for the dedication of the altar, on the day in which it was anointed; twelve silver vessels, twelve silver basins, and twelve gold saucers;)"},{"num":85,"verse":"so that one vessel to prove incense and such things had an hundred and thirty shekels of silver, and one basin had seventy shekels, that is, in common, two thousand and four hundred shekels of all the vessels of silver, by the weight of [the] saintuary; (and each silver vessel weighed a hundred and thirty silver shekels, and each silver basin weighed seventy silver shekels, so that altogether, all the silver dishes weighed two thousand and four hundred shekels, by the measure of the sanctuary;)"},{"num":86,"verse":"golden spoons twelve, full of incense, weighing ten shekels, by (the) weight of the saintuary, that is, (al)together, an hundred and twenty shekels of gold; (twelve gold saucers, full of incense, each weighing ten shekels, by the measure of the sanctuary, so that altogether, all the gold of the dishes weighed a hundred and twenty shekels;)"},{"num":87,"verse":"oxen of the drove into burnt sacrifice twelve, twelve rams, twelve lambs of one year, and the flowing sacrifices of those, twelve bucks of (the) goats for sin; (twelve oxen from the herd, twelve rams, and twelve one-year-old lambs, each with their grain offerings, for the burnt sacrifice, and twelve goat bucks, for the sin offering;)"},{"num":88,"verse":"the sacrifices of peaceable things, four and twenty oxen, sixty rams, sixty goat bucks, sixty lambs of one year. These things were offered in the hallowing of the altar, when it was anointed. (and for the peace offering, four and twenty oxen, sixty rams, sixty goat bucks, and sixty one-year-old lambs. These were the things that were offered for the dedication of the altar when it was anointed.)"},{"num":89,"verse":"And when Moses entered into the tabernacle of [the] bond of peace, to ask counsel of God’s answering place, he heard the voice of God speaking to him from (above) the propitiatory, which was on the ark of (the) witnessing, betwixt [the] two cherubims, from whence also God spake to Moses. (And when Moses entered into the Tabernacle of the Covenant, to ask for counsel from God, he heard the voice of God speaking to him from above the propitiatory, that is, from above the lid, which was on top of the Ark of the Witnessing, that is, the Box containing the tablets of the Law, from between the two cherubim, that is where God spoke to Moses.)"}]