[{"header":"A Perfect Offering"},{"num":1,"verse":"I saw—it took my breath away!—the Lamb standing on Mount Zion, 144,000 standing there with him, his Name and the Name of his Father inscribed on their foreheads. And I heard a voice out of Heaven, the sound like rapids, like the crash of thunder."},{"num":2,"verse":"And then I heard music, harp music and the harpists singing a new song before the Throne and the Four Animals and the Elders. Only the 144,000 could learn to sing the song. They were bought from earth, lived without compromise, virgin-fresh before God. Wherever the Lamb went, they followed. They were bought from humankind, firstfruits of the harvest for God and the Lamb. Not a false word in their mouths. A perfect offering."},{"header":"Voices from Heaven"},{"num":6,"verse":"I saw another Angel soaring in Middle-Heaven. He had an Eternal Message to preach to all who were still on earth, every nation and tribe, every tongue and people. He preached in a loud voice, “Fear God and give him glory! His hour of judgment has come! Worship the Maker of Heaven and earth, salt sea and fresh water!”"},{"num":8,"verse":"A second Angel followed, calling out, “Ruined, ruined, Great Babylon ruined! She made all the nations drunk on the wine of her whoring!”"},{"num":9,"verse":"A third Angel followed, shouting, warning, “If anyone worships the Beast and its image and takes the mark on forehead or hand, that person will drink the wine of God’s wrath, prepared unmixed in his chalice of anger, and suffer torment from fire and brimstone in the presence of Holy Angels, in the presence of the Lamb. Smoke from their torment will rise age after age. No respite for those who worship the Beast and its image, who take the mark of its name.”"},{"num":12,"verse":"Meanwhile, the saints stand passionately patient, keeping God’s commands, staying faithful to Jesus."},{"num":13,"verse":"I heard a voice out of Heaven, “Write this: Blessed are those who die in the Master from now on; how blessed to die that way!”"},{"header":"Harvest Time"},{"num":14,"verse":"I looked up, I caught my breath!—a white cloud and one like the Son of Man sitting on it. He wore a gold crown and held a sharp sickle. Another Angel came out of the Temple, shouting to the Cloud-Enthroned, “Swing your sickle and reap. It’s harvest time. Earth’s harvest is ripe for reaping.” The Cloud-Enthroned gave a mighty sweep of his sickle, began harvesting earth in a stroke."},{"num":17,"verse":"Then another Angel came out of the Temple in Heaven. He also had a sharp sickle. Yet another Angel, the one in charge of tending the fire, came from the Altar. He thundered to the Angel who held the sharp sickle, “Swing your sharp sickle. Harvest earth’s vineyard. The grapes are bursting with ripeness.”"},{"num":19,"verse":"The Angel swung his sickle, harvested earth’s vintage, and heaved it into the winepress, the giant winepress of God’s wrath. The winepress was outside the City. As the vintage was trodden, blood poured from the winepress as high as a horse’s bridle, a river of blood for two hundred miles."}]