[{"header":"A Son Becomes a Sign"},{"num":8,"verse":"The Lord Yahweh said to me, “Take a large tablet and engrave upon it these words using the stylus of a man: Quickly—to the Plunder! Hurry—to the Loot! "},{"num":2,"verse":"Then summon two reliable men, Uriah the priest and Zechariah, son of Jeberechiah, to act as witnesses.”"},{"num":3,"verse":"Then I slept with my wife, the prophetess; she became pregnant and gave birth to a son. Then the Lord Yahweh told me, “You will name him Quickly—to the Plunder! Hurry—to the Loot! "},{"num":4,"verse":"For before the boy knows how to say ‘my father’ or ‘my mother,’ the wealth of Damascus and Samaria will be plundered and carried away by the king of Assyria!”"},{"header":"A Flood or a Peaceful Stream"},{"num":5,"verse":"The Lord Yahweh spoke to me again: "},{"num":6,"verse":"“Because these people have rejected the gentle flowing stream of my loving presence and melt in fear before Rezin and the son of Remaliah, "},{"num":7,"verse":"now, therefore, the Lord is about to bring against them the mighty, massive flood of the Euphrates. The king of Assyria and all his glory will overflow on you like a river flooding its channels and running over all its banks! "},{"num":8,"verse":"It will flood into Judah, swirling over it, overflowing and reaching up to your neck, O Immanu El, and spread out its wings over your entire land!"},{"header":"A Snare or a Sanctuary"},{"num":11,"verse":"The Lord’s mighty hand rested on me, and he warned me with these words not to act like these people:"},{"num":12,"verse":"“Don’t believe their every conspiracy rumor. And don’t fear what they fear—don’t be moved or terrified. "},{"num":13,"verse":"Fear nothing and no one except Yahweh, Commander of Angel Armies! Honor him as holy. Be in awe before him with deepest reverence! "},{"num":14,"verse":"He will become for you a holy sanctuary but for them a stone people trip over. He is a rock that causes the two houses of Israel to stumble—a trap and a snare for the people of Jerusalem. "},{"num":15,"verse":"Many will stumble and fall and be broken. Yes, they will be snared and taken away captive.”"},{"header":"Trust in the Hidden God"},{"num":16,"verse":"Now, tie up the scroll and preserve it as legal evidence. Seal my instructions for the future for my disciples. "},{"num":17,"verse":"I will wait for the Lord Yahweh, who hides his face from the family of Jacob. And I will place all my hope in him!"},{"num":18,"verse":"Behold—here I stand, and the children whom the Lord Yahweh has given me are for signs and wonders in Israel, sent from the Lord Almighty, Commander of Angel Armies, who is enthroned on Mount Zion!"},{"header":"Darkness or the Light of Dawn"},{"num":19,"verse":"Now, suppose someone says, “Consult mediums and spiritists who moan and mutter their incantations in their ritual pits; after all, isn’t it right for people to seek oracles from their gods by asking the dead about the destiny of the living?”"},{"num":20,"verse":"You are to answer them: “Listen to the teaching and instruction of the Lord! If their speech does not line up with his word, they will have no light of dawn! "},{"num":21,"verse":"They will wander here and there, distressed and hungry. And when they are famished, they will be enraged and begin to curse their king and their God. If they look to the heavens "},{"num":22,"verse":"or to the earth, they will find only despair and darkness and fearful gloom, and they will be thrust into obscure darkness!”"}]