[{"num":14,"verse":"He comforteth his disciples, 2, 7 declaring his divinity and the fruit of his death, 16 promising the comforter, 17 even the holy Spirit, 26 whose office he setteth out. 27 He promiseth his peace."},{"num":1,"verse":"Let not your heart be troubled: ye believe in God, believe also in me. "},{"num":2,"verse":"In my Father’s house are many dwelling places: if it were not so, I would have told you: I go to prepare a place for you. "},{"num":3,"verse":"And if I go to prepare a place for you, I will come again, and receive you unto myself, that where I am, there may ye be also. "},{"num":4,"verse":"And whither I go, ye know, and the way ye know. "},{"num":5,"verse":"Thomas said unto him, Lord, we know not whither thou goest: how can we then know the way?"},{"num":6,"verse":"Jesus said unto him, I am that Way, and that Truth, and that Life. No man cometh unto the Father, but by me. "},{"num":7,"verse":"If ye had known me, ye should have known my Father also: and from henceforth ye know him, and have seen him. "},{"num":8,"verse":"Philip said unto him, Lord, show us thy Father, and it sufficeth us."},{"num":9,"verse":"Jesus said unto him, I have been so long time with you, and hast thou not known me, Philip? he that hath seen me, hath seen my Father: how then sayest thou, Show us thy Father? "},{"num":10,"verse":"Believest thou not, that I am in the Father, and the Father is in me? The words that I speak unto you, I speak not of myself: but the Father that dwelleth in me, he doeth the works. "},{"num":11,"verse":"Believe me, that I am in the Father, and the Father is in me: at the least, believe me for the very works’ sake. "},{"num":12,"verse":"Verily, verily I say unto you, he that believeth in me, the works that I do, he shall do also, and greater than these shall he do: for I go unto my Father. "},{"num":13,"verse":"And whatsoever ye ask in my Name, that will I do, that the Father may be glorified in the Son. "},{"num":14,"verse":"If ye shall ask anything in my Name, I will do it. "},{"num":15,"verse":"If ye love me, keep my commandments. "},{"num":16,"verse":"And I will pray the Father, and he shall give you another Comforter, that he may abide with you forever, "},{"num":17,"verse":"Even the Spirit of truth, whom the world cannot receive, because it seeth him not, neither knoweth him: but ye know him: for he dwelleth with you, and shall be in you. "},{"num":18,"verse":"I will not leave you fatherless: but I will come to you. "},{"num":19,"verse":"Yet a little while, and the world shall see me no more, but ye shall see me: because I live, ye shall live also. "},{"num":20,"verse":"At that day shall ye know that I am in my Father, and you in me, and I in you. "},{"num":21,"verse":"He that hath my commandments, and keepeth them: is he that loveth me: and he that loveth me, shall be loved of my Father: and I will love him, and will show mine own self to him. "},{"num":22,"verse":"Judas said unto him, (not Iscariot) Lord, what is the cause that thou wilt show thyself unto us, and not unto the world?"},{"num":23,"verse":"Jesus answered, and said unto him, If any man love me, he will keep my word, and my Father will love him, and we will come unto him, and will dwell with him. "},{"num":24,"verse":"He that loveth me not, keepeth not my words, and the word which ye hear, is not mine, but the Father’s which sent me. "},{"num":25,"verse":"These things have I spoken unto you, being present with you. "},{"num":26,"verse":"But the Comforter, which is the holy Ghost, whom the Father will send in my Name, he shall teach you all things, and bring all things to your remembrance, which I have told you. "},{"num":27,"verse":"Peace I leave with you: my peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, nor fear. "},{"num":28,"verse":"Ye have heard how I said unto you, I go away, and will come unto you. If ye loved me, ye would verily rejoice, because I said, I go unto the Father: for the Father is greater than I. "},{"num":29,"verse":"And now have I spoken unto you, before it come, that when it is come to pass, ye might believe. "},{"num":30,"verse":"Hereafter will I not speak many things unto you: for the prince of this world cometh, and hath nought in me, "},{"num":31,"verse":"But it is that the world may know that I love my Father: and as the Father hath commanded me, so I do. Arise, let us go hence. "}]