[{"header":"The Way to the Father’s House"},{"num":14,"verse":"“Do not let your heart be troubled. Trust in God; trust also in Me. "},{"num":2,"verse":"In My Father’s house there are many dwelling places. If it were not so, would I have told you that I am going to prepare a place for you? "},{"num":3,"verse":"If I go and prepare a place for you, I will come again and take you to Myself, so that where I am you may also be. "},{"num":4,"verse":"And you know the way to where I am going.”"},{"num":5,"verse":"Thomas said to Him, “Master, we don’t know where You are going. How can we know the way?”"},{"num":6,"verse":"Yeshua said to him, “I am the way, the truth, and the life! No one comes to the Father except through Me. "},{"num":7,"verse":"If you have come to know Me, you will know My Father also. From now on, you do know Him and have seen Him.”"},{"num":8,"verse":"Philip said to Him, “Master, show us the Father, and it is enough for us.”"},{"num":9,"verse":"Yeshua said to him, “Have I been with you for so long a time, and you haven’t come to know Me, Philip? He who has seen Me has seen the Father. How can you say, ‘Show us the Father’? "},{"num":10,"verse":"Don’t you believe that I am in the Father and the Father is in Me? The words I say to you, I do not speak on My own; but the Father dwelling in Me does His works. "},{"num":11,"verse":"Believe Me that I am in the Father and the Father is in Me—or at least believe because of the works themselves."},{"num":12,"verse":"“Amen, amen I tell you, he who puts his trust in Me, the works that I do he will do; and greater than these he will do, because I am going to the Father. "},{"num":13,"verse":"And whatever you ask in My name, that I will do, so that the Father may be glorified in the Son. "},{"num":14,"verse":"If you ask Me anything in My name, I will do it.”"},{"header":"The Believer’s Helper"},{"num":15,"verse":"“If you love Me, you will keep My commandments. "},{"num":16,"verse":"I will ask the Father, and He will give you another Helper so He may be with you forever—"},{"num":17,"verse":"the Spirit of truth, whom the world cannot receive, because it does not behold Him or know Him. You know Him, because He abides with you and will be in you. "},{"num":18,"verse":"I will not abandon you as orphans; I will come to you. "},{"num":19,"verse":"In a little while, the world will no longer behold Me, but you will behold Me. Because I live, you also will live!"},{"num":20,"verse":"“In that day, you will know that I am in My Father, you are in Me, and I am in you. "},{"num":21,"verse":"He who has My commandments and keeps them is the one who loves Me. He who loves Me will be loved by My Father, and I will love him and reveal Myself to him.”"},{"num":22,"verse":"Judah (not the one from Kriot) said to Him, “Master, what has happened, that You are about to reveal Yourself to us and not the world?”"},{"num":23,"verse":"Yeshua answered and said to him, “If anyone loves Me, he will keep My word. My Father will love him, and We will come to him and make Our dwelling with him. "},{"num":24,"verse":"He who does not love Me does not keep My words. And the word you hear is not Mine, but the Father’s who sent Me. "},{"num":25,"verse":"These things I have spoken to you while dwelling with you. "},{"num":26,"verse":"But the Helper, the Ruach ha-Kodesh whom the Father will send in My name, will teach you everything and remind you of everything that I said to you."},{"num":27,"verse":"“Shalom I leave you, My shalom I give to you; but not as the world gives! Do not let your heart be troubled or afraid. "},{"num":28,"verse":"You’ve heard Me say, ‘I am going away and I am coming back to you.’ If you loved Me, you would rejoice that I am going to the Father, because the Father is greater than I. "},{"num":29,"verse":"I have told you now before it happens, so that when it happens you may believe!"},{"num":30,"verse":"“I will not talk with you much longer, for the ruler of this world is coming. He has nothing on Me. "},{"num":31,"verse":"But in order that the world may know that I love the Father, I do exactly as the Father commanded Me."}]