[{"num":14,"verse":"Jesus said, `Do not let anything trouble your heart. You believe in God and you must believe in me also."},{"num":2,"verse":"In my Father's house are many rooms. If it were not so, I would have told you. I am going to make a place ready for you."},{"num":3,"verse":"If I go to make a place ready for you, I will come again. I will come to take you so that you may be with me."},{"num":4,"verse":"You know where I am going, and you know the way."},{"num":5,"verse":"Thomas said to Jesus, `Lord, we do not know where you are going. How can we know the way?'"},{"num":6,"verse":"Jesus said to him, `I am the way. I am the truth. I give life. No one can come to my Father unless I take him there."},{"num":7,"verse":"If you knew me, you would have known my Father also. But from now on you do know him because you have seen him.'"},{"num":8,"verse":"Philip said to him, `Lord, show us the Father, then we will be happy.'"},{"num":9,"verse":"Jesus said to him, `Philip, you mean to say that I have been with you all this time and yet you do not know me? The person who has seen me has seen my Father also. Why do you say, \"Show us your Father\"?"},{"num":10,"verse":"Do you not believe that I am in my Father and my Father is in me? The things that I say, I speak not from my own mind. But my Father lives in me and he does the work."},{"num":11,"verse":"I tell you that I am in my Father and my Father is in me. But you do not believe me. So then let the work that I do prove it to you."},{"num":12,"verse":"`I tell you the truth. The person who believes in me will do the big work that I do. And he will do even bigger work because I go to my Father."},{"num":13,"verse":"I will do anything you ask of my Father in my name. In that way the Son will make my Father's name great."},{"num":14,"verse":"If you ask anything in my name, I will do it.'"},{"num":15,"verse":"`If you love me, you will obey me."},{"num":16,"verse":"I will ask my Father. He will give you another one to help you and to be with you always."},{"num":17,"verse":"He will send you the Spirit of truth. The world cannot receive the true Spirit because it does not see or know him. You know him because he is with you and will be in you."},{"num":18,"verse":"`I will not leave you without someone to help you. And I myself will come back to you."},{"num":19,"verse":"In a short time the world will not see me again, but you will see me again. Because I live, you will live also."},{"num":20,"verse":"At that time you will know that I am in my Father. You are in me, and I am in you."},{"num":21,"verse":"`He who knows the things I tell him to do and does them, really loves me. My Father will love him and I also will love him. I will show him who I am.'"},{"num":22,"verse":"Judas (not Iscariot) said to Jesus, `Lord, how are you going to make yourself real to us, and not to the rest of the world?'"},{"num":23,"verse":"Jesus said to him, `If a person loves me, he will obey me. My Father also will love him. And we will come to him and will live with him."},{"num":24,"verse":"The person who does not love me does not obey me. The word which you hear is not my word. It is my Father's word. He is the one who sent me."},{"num":25,"verse":"`I have told you these things while I am still with you."},{"num":26,"verse":"But the Holy Spirit is the one who will help you. My Father will send him in my name. He will teach you everything that I have said to you. His Helper will remind you of all that I said."},{"num":27,"verse":"Peace is what I leave for you. I give you my own peace. People of the world also say, \"Peace\" to you. I do not say it as they say it. Do not let anything trouble your hearts. Do not fear."},{"num":28,"verse":"You heard me say, \"I am going away and then I will come back to you.\" If you really loved me, then you would have been very glad that I am going to my Father. My Father is greater than I am."},{"num":29,"verse":"`I have told you this before it happens. Then when it does happen, you will believe."},{"num":30,"verse":"After this I will not talk much with you. The ruler of this world is coming. He has no power over me."},{"num":31,"verse":"I will do what my Father tells me to do so that the people of the world may know that I love my Father. `Get up now! We must go.'"}]