[{"header":"Deborah and Barak"},{"num":4,"verse":"After Ehud died, the people of Israel sinned against the Lord again. "},{"num":2,"verse":"So the Lord let them be conquered by Jabin, a Canaanite king who ruled in the city of Hazor. The commander of his army was Sisera, who lived at Harosheth-of-the-Gentiles. "},{"num":3,"verse":"Jabin had nine hundred iron chariots, and he ruled the people of Israel with cruelty and violence for twenty years. Then the people of Israel cried out to the Lord for help."},{"num":4,"verse":"Now Deborah, the wife of Lappidoth, was a prophet, and she was serving as a judge for the Israelites at that time. "},{"num":5,"verse":"She would sit under a certain palm tree between Ramah and Bethel in the hill country of Ephraim, and the people of Israel would go there for her decisions. "},{"num":6,"verse":"One day she sent for Barak son of Abinoam from the city of Kedesh in Naphtali and said to him, “The Lord, the God of Israel, has given you this command: ‘Take ten thousand men from the tribes of Naphtali and Zebulun and lead them to Mount Tabor. "},{"num":7,"verse":"I will bring Sisera, the commander of Jabin's army, to fight you at the Kishon River. He will have his chariots and soldiers, but I will give you victory over him.’”"},{"num":8,"verse":"Then Barak replied, “I will go if you go with me, but if you don't go with me, I won't go either.”"},{"num":9,"verse":"She answered, “All right, I will go with you, but you won't get any credit for the victory, because the Lord will hand Sisera over to a woman.” So Deborah set off for Kedesh with Barak. "},{"num":10,"verse":"Barak called the tribes of Zebulun and Naphtali to Kedesh, and ten thousand men followed him. Deborah went with him."},{"num":11,"verse":"In the meantime Heber the Kenite had set up his tent close to Kedesh near the oak tree at Zaanannim. He had moved away from the other Kenites, the descendants of Hobab, the brother-in-law of Moses."},{"num":12,"verse":"When Sisera learned that Barak had gone up to Mount Tabor, "},{"num":13,"verse":"he called out his nine hundred iron chariots and all his men, and sent them from Harosheth-of-the-Gentiles to the Kishon River."},{"num":14,"verse":"Then Deborah said to Barak, “Go! The Lord is leading you! Today he has given you victory over Sisera.” So Barak went down from Mount Tabor with his ten thousand men. "},{"num":15,"verse":"When Barak attacked with his army, the Lord threw Sisera into confusion together with all his chariots and men. Sisera got down from his chariot and fled on foot. "},{"num":16,"verse":"Barak pursued the chariots and the army to Harosheth-of-the-Gentiles, and Sisera's whole army was killed. Not a man was left."},{"num":17,"verse":"Sisera ran away to the tent of Jael, the wife of Heber the Kenite, because King Jabin of Hazor was at peace with Heber's family. "},{"num":18,"verse":"Jael went out to meet Sisera and said to him, “Come in, sir; come into my tent. Don't be afraid.” So he went in, and she hid him behind a curtain. "},{"num":19,"verse":"He said to her, “Please give me a drink of water; I'm thirsty.” She opened a leather bag of milk, gave him a drink, and hid him again. "},{"num":20,"verse":"Then he told her, “Stand at the door of the tent, and if anyone comes and asks you if anyone is here, say no.”"},{"num":21,"verse":"Sisera was so tired that he fell sound asleep. Then Jael took a hammer and a tent peg, quietly went up to him, and killed him by driving the peg right through the side of his head and into the ground. "},{"num":22,"verse":"When Barak came looking for Sisera, Jael went out to meet him and said to him, “Come here! I'll show you the man you're looking for.” So he went in with her, and there was Sisera on the ground, dead, with the tent peg through his head."},{"num":23,"verse":"That day God gave the Israelites victory over Jabin, the Canaanite king. "},{"num":24,"verse":"They pressed harder and harder against him until they destroyed him."}]