[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whose mouth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Here the text has evidently suffered, and the exact meaning is lost. There are also verbal difficulties. The word translated “mouth” elsewhere (except ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where see Note) means “ornament,” and the literal rendering of the text as it stands is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with bit and bridle his ornament to hold, not approaching to thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This may mean that the animal is harnessed, either “that it may not approach,” or “because without harness it will not approach.” In either case the general application is the same. Horses and mules can only be rendered obedient by restraints that are unworthy of a rational creature. The LXX. and Vulg. have “jaws” instead of “mouth,” and Ewald follows them, and renders the last clause, “of those who approach thee unfriendly.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 32:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 32:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Be not as the horse, or as the mule — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God hath endowed you with reason, both to inform you what you ought to do. and to check you when you do amiss, and hath made you capable also of receiving good admonitions from others; do not therefore follow your own unbridled lusts and appetites; much less be refractory and untractable, when God would reduce you from the error of your ways; as if you were not men, but headstrong horses and mules, which can by no means be curbed or governed, without bit and bridle. Houbigant renders the last clause, very properly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Or they will not come near thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for, as horses and mules are not dangerous beasts, whose common practice it is to kick or bite, the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lest ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is extremely improper. Nor is it the proper use of a bit, or bridle, to keep them from so doing, but rather to bring them nearer to the rider, for his use, and to keep them under his power and management.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32:8-11 God teaches by his word, and guides with the secret intimations of his will. David gives a word of caution to sinners. The reason for this caution is, that the way of sin will certainly end in sorrow. Here is a word of comfort to saints. They may see that a life of communion with God is far the most pleasant and comfortable. Let us rejoice, O Lord Jesus, in thee, and in thy salvation; so shall we rejoice indeed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Be ye not as the horse - The horse as it is by nature - wild, ungoverned, unwilling to be caught and made obedient. The counsel referred to in the previous verse is here given; and it is, that one who wishes to obtain the favor of God should not be as the wild and unbroken horse, an animal that can be subdued only by a curb, but should evince a calm, submissive spirit - a spirit \"disposed\" to obey and submit. If he becomes a subject of God's government, he is not to be subdued and held as the horse is - by mere force; there must be the cheerful submission of the will. People are not brought into the service of God by physical power; they are not kept there by an iron \"curb.\" They come and yield themselves willingly to his law; they \"must\" come with that spirit if they would find the favor of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or as the mule - The mule is distinguished for its obstinacy, and this is evidently the ground of comparison here. The meaning is, be tractable, gentle, yielding; submit to the guidance and direction of God and his truth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which have no understanding - That cannot be controlled by reason and conscience. They are governed only by power and by fear. People have reason and conscience, and they should allow themselves to be controlled by appeals TO their reason and to their moral sense. They are not made to be governed as brutes are. Since they have a higher nature, they should permit themselves to be governed by it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Whose mouth must be held in with bit and bridle - More literally, \"in bit and bridle is their ornament to restrain them;\" that is, the trappings or the ornaments of the horse and the mule consist of the bridle and the bit, the purpose of which is to restrain or control them. The allusion, however, is not to the bit and bridle as an \"ornament,\" but as the ordinary trappings of the mule and the horse.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lest they come near unto thee - Or rather, \"because of its not approaching thee;\" that is, because the horse and the mule will not come to thee of their own accord, but must be restrained and controlled. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lest they come near unto thee - Or rather, \"because of its not approaching thee;\" that is, because the horse and the mule will not come to thee of their own accord, but must be restrained and controlled. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. The latter clause, more literally, \"in that they come not near thee\"; that is, because they will not come, &c., unless forced by bit and bridle.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Be ye not as the horse, or as the mule; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be not such brutish and sottish creatures as I have been, not having reason or grace to govern yourselves, nor hearkening to the counsels and admonitions of others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lest they come near unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; lest they should come too near to thee, so as to bite or kick thee. But neither is this the common practice of horses or mules, of which he seems to speak; nor is this the proper use of a bit or bridle, to keep them from so doing; but rather to bring them nearer to the rider for his use, and to keep them under his conduct and power, from whom they are otherwise apt to run away. The words therefore are and may be otherwise rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because they do not or will not come near unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, for thy service, unless they be forced to it by a bit or bridle. And so all the ancient translators understand it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Be ye not as the horse, or as the mule, which have no understanding,.... The design of this exhortation is to direct men how to behave under the instructions given; not as brutes, which have no rational faculties, but as men; that they should not show themselves thoughtless, stupid, and unteachable, as these animals, or worse than they; nor stubborn and obstinate, refractory and untractable, resolving not to be taught, stopping the ear, and pulling away the shoulder; nor ill natured and mischievous; not only hating instruction, casting away the law of the Lord, but kicking and spurning at, and persecuting such who undertake to instruct them; as these creatures sometimes attempt to throw their riders, and, when down, kick at them; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whose mouth must be held in with bit and bridle, lest they come near unto thee; to do mischief, bite or kick; or \"because they do not come near to thee\" (t); and that they may come near, and be brought into subjection, and become obedient; therefore such methods are used; see James 3:3; there is in the words a tacit intimation, that men are commonly, and for the most part, like these creatures, stupid, stubborn, and mischievous; and therefore severe methods are used by the Lord, sore chastenings, to humble and instruct them; see Jeremiah 31:18; the mule, more especially, is remarkable for its stupidity (u); and though the horse is docile, yet he is sometimes stubborn and refractory. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "whose mouth must be held in with bit and bridle, lest they come near unto thee; to do mischief, bite or kick; or \"because they do not come near to thee\" (t); and that they may come near, and be brought into subjection, and become obedient; therefore such methods are used; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 3:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; there is in the words a tacit intimation, that men are commonly, and for the most part, like these creatures, stupid, stubborn, and mischievous; and therefore severe methods are used by the Lord, sore chastenings, to humble and instruct them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the mule, more especially, is remarkable for its stupidity (u); and though the horse is docile, yet he is sometimes stubborn and refractory. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t)   \"quia non accedunt ad te\", Grotius. (u) \"Mule, nihil sentis----\", Catullus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t)   \"quia non accedunt ad te\", Grotius. (u) \"Mule, nihil sentis----\", Catullus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Be ye not as the horse, or as the mule, which have no understanding: whose {i} mouth must be held in with bit and bridle, lest they come near unto thee.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Be ye not as the horse, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "or",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the mule, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "which",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " have no understanding: whose ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mouth must be held in with bit and bridle, lest they come near unto thee.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) If men can rule brute beasts, do they think that God will not bridle and tame their rage?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A warning addressed to all not to resist God’s will, and neglect instruction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Be not like horse like mule with no understanding,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "With trappings of bit and bridle must they be curbed:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Else will they not come near unto thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Heb. is obscure and possibly corrupt in some points; but the general sense is clear. Brute animals without reason must be controlled and compelled by force to learn to submit to man’s will. If man will not draw near to God and obey Him of his own free will, he lowers himself to the level of a brute, and must expect to be treated accordingly and disciplined by judgment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "For the thought that man who will not listen to God’s teaching ‘becomes brutish’ see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 10:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mouth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in A.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "trappings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in R.V., is of doubtful meaning. Some explain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " wild spirit ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "must be curbed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.; but this is less probable. The A.V. of the last line, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lest they come near unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to hurt thee, gives no suitable point of comparison, and must certainly be rejected.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Be ye not as the horse, or as the mule, which have no understanding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The singular is exchanged for the plural, since the \"instruction\" is now intended, not for the godly man only, but for all. Israel had been always stiff-necked (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 33:3, 5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:6, 13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 30:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), like a restive horse or mule. David exhorts them to be so no more. The horse and mule are excusable, since they \"have no understanding \" - or, \"no discernment\" - Israel would be inexcusable, since it had the gift of reason. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Whose mouth must be held in with bit and bridle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "whose adornings are with bit and bridle to hold them in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (compare the Revised Version). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Lest they come near unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This clause is obscure. It may mean, \"Lest they come ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "too",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " near to thee,\" so as to do thee damage, as when a riding horse tosses his head and strikes the rider in the face, or when a chariot horse rears and falls back upon the driver; or it may  mean, \"Else they will not come near to thee,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " until they are trapped with bit and bridle, they will refuse to come near to thee. Psalm 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It is not Jahve, who here speaks in answer to the words that have been thus far addressed to Him. In this case the person addressed must be the poet, who, however, has already attained the knowledge here treated of. It is he himself who now directly adopts the tone of the teacher (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). That which David, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", promises to do, he here takes in hand, viz., the instruction of sinners in the way of salvation. It is unnecessary to read איעצך instead of איעצה, as Olshausen does; the suffix of אשׂכּילך and אורך (for אורך) avails also for this third verb, to which עליך עיני, equivalent to שׂם עליך עיני (fixing my eye upon thee, i.e., with sympathising love taking an interest in thee), stands in the relation of a subordinate relative clause. The lxx renders it by ἐπιστηριῶ ἐπὶ σὲ τοὺς ὀφθαλμούς μου, so that it takes יעץ, in accordance with its radical signification firmare, as the regens of עיני (I will fix my eye steadfastly upon thee); but for this there is no support in the general usage of the language. The accents give a still different rendering; they apparently make עיני an accus. adverb. (Since אעצה עליך עיני is transformed from איעצה עליך עיני: I will counsel thee with mine eye; but in every other instance, יעץ על means only a hostile determination against any one, e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The form of address, without changing its object, passes over, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", into the plural and the expression becomes harsh in perfect keeping with the perverted character which it describes. The sense is on the whole clear: not constrained, but willing obedience is becoming to man, in distinction from an irrational animal which must be led by a bridle drawn through its mouth. The asyndeton clause: like a horse, a mule (פּרד as an animal that is isolated and does not pair; cf. Arab. fard, alone of its kind, single, unlike, the opposite of which is Arab. zawj, a pair, equal number), has nothing remarkable about it, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But it is not clear what עדיו is intended to mean. We might take it in its usual signification \"ornament,\" and render \"with bit and bridle, its ornament,\" and perhaps at once recognise therein an allusion to the senseless servility of the animal, viz., that its ornament is also the means by which it is kept in check, unless עדי, ornament, is perhaps directly equivalent to \"harness.\" Still the rendering of the lxx is to be respected: in camo et fraeno - as Jerome reproduces it - maxilas eorum constringere qui non approximant ad te. If עדי means jaw, mouth or check, then עדיו לבלום is equivalent to ora eorum obturanda sunt (Ges. 132, rem. 1), which the lxx expressed by ἄγξαι, constringe, or following the Cod. Alex., ἄγξις (ἄγξεις), constringes. Like Ewald and Hitzig (on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), we may compare with עדי, the cheek, the Arabic chadd, which, being connected with גּדוּד, a furrow, signifies properly the furrow of the face, i.e., the indented part running downwards from the inner corners of the eyes to both sides of the nose, but then by synecdoche the cheek. If `dyw refers to the mouth or jaws, then it looks as if בּל קרב אליך must be translated: in order that they may not come too near thee, viz., to hurt thee (Targ., Syriac, Rashi, etc.); but this rendering does not produce any point of comparison corresponding to the context of this Psalm. Therefore, it is rather to be rendered: otherwise there is no coming near to thee. This interpretation takes the emphasis of the בל into account, and assumes that, according to a usage of the language that is without further support, one might, for instance, say: בּל לכתּי שׁמּה, \"I will never go thither.\" In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", בל also includes within itself the verb to be. So here: by no means an approaching to thee, i.e., there is, if thou dost not bridle them, no approaching or coming near to thee. These words are not addressed to God, but to man, who is obliged to use harsh and forcible means in taming animals, and can only thus keep them under his control and near to him. In the antitype, it is the sinner, who will not come to God, although God only is his help, and who, as David has learned by experience, must first of all endure inward torture, before he comes to a right state of mind. This agonising life of the guilty conscience which the ungodly man leads, is contrasted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the mercy which encompasses on all sides him, who trusts in God. רבּים, in accordance with the treatment of this adjective as if it were a numeral (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is an attributive or adjective placed before its noun. The final clause might be rendered: mercy encompasses him; but the Poel and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " favour the rendering: with mercy doth He encompass him. ",
        "children": []
      }
    ]
  }
]