[{"header":"Jesus Heals on the Day of Rest—a Holy Day(A)"},{"num":3,"verse":"Jesus went into a synagogue again. A man who had a paralyzed hand was there. "},{"num":2,"verse":"The people were watching Jesus closely. They wanted to see whether he would heal the man on the day of rest—a holy day, so that they could accuse him of doing something wrong."},{"num":3,"verse":"So he told the man with the paralyzed hand, “Stand in the center ⌞of the synagogue⌟.” "},{"num":4,"verse":"Then he asked them, “Is it right to do good or to do evil on the day of rest—a holy day, to give a person back his health or to let him die?”"},{"num":5,"verse":"Jesus was angry as he looked around at them. He was deeply hurt because their minds were closed. Then he told the man, “Hold out your hand.” The man held it out, and his hand became normal again."},{"num":6,"verse":"The Pharisees left, and with Herod’s followers they immediately plotted to kill Jesus."},{"header":"Many People Are Cured(B)"},{"num":7,"verse":"Jesus left with his disciples for the Sea of Galilee. A large crowd from Galilee, Judea, "},{"num":8,"verse":"Jerusalem, Idumea, and from across the Jordan River, and from around Tyre and Sidon followed him. They came to him because they had heard about everything he was doing. "},{"num":9,"verse":"Jesus told his disciples to have a boat ready so that the crowd would not crush him. "},{"num":10,"verse":"He had cured so many that everyone with a disease rushed up to him in order to touch him. "},{"num":11,"verse":"Whenever people with evil spirits saw him, they would fall down in front of him and shout, “You are the Son of God!” "},{"num":12,"verse":"He gave them orders not to tell people who he was."},{"header":"Jesus Appoints Twelve Apostles(C)"},{"num":13,"verse":"Jesus went up a mountain, called those whom he wanted, and they came to him. "},{"num":14,"verse":"He appointed twelve whom he called apostles. They were to accompany him and to be sent out by him to spread ⌞the Good News⌟. "},{"num":15,"verse":"They also had the authority to force demons out of people."},{"num":16,"verse":"He appointed these twelve: Simon (whom Jesus named Peter), "},{"num":17,"verse":"James and his brother John (Zebedee’s sons whom Jesus named Boanerges, which means “Thunderbolts”), "},{"num":18,"verse":"Andrew, Philip, Bartholomew, Matthew, Thomas, James (son of Alphaeus), Thaddaeus, Simon the Zealot, "},{"num":19,"verse":"and Judas Iscariot (who later betrayed Jesus)."},{"header":"Jesus Is Accused of Working with Beelzebul(D)"},{"num":20,"verse":"Then Jesus went home. Another crowd gathered so that Jesus and his disciples could not even eat. "},{"num":21,"verse":"When his family heard about it, they went to get him. They said, “He’s out of his mind!”"},{"num":22,"verse":"The experts in Moses’ Teachings who had come from Jerusalem said, “Beelzebul is in him,” and “He forces demons out of people with the help of the ruler of demons.”"},{"num":23,"verse":"Jesus called them together and used this illustration: “How can Satan force out Satan? "},{"num":24,"verse":"If a kingdom is divided against itself, that kingdom cannot last. "},{"num":25,"verse":"And if a household is divided against itself, that household will not last. "},{"num":26,"verse":"So if Satan rebels against himself and is divided, he cannot last. That will be the end of him."},{"num":27,"verse":"“No one can go into a strong man’s house and steal his property. First he must tie up the strong man. Then he can go through the strong man’s house and steal his property."},{"num":28,"verse":"“I can guarantee this truth: People will be forgiven for any sin or curse. "},{"num":29,"verse":"But whoever curses the Holy Spirit will never be forgiven. He is guilty of an everlasting sin.” "},{"num":30,"verse":"Jesus said this because the experts in Moses’ Teachings had said that he had an evil spirit."},{"header":"The True Family of Jesus(E)"},{"num":31,"verse":"Then his mother and his brothers arrived. They stood outside and sent someone to ask him to come out. "},{"num":32,"verse":"The crowd sitting around Jesus told him, “Your mother and your brothers are outside looking for you.”"},{"num":33,"verse":"He replied to them, “Who is my mother, and who are my brothers?” "},{"num":34,"verse":"Then looking at those who sat in a circle around him, he said, “Look, here are my mother and my brothers. "},{"num":35,"verse":"Whoever does what God wants is my brother and sister and mother.”"}]