[{"num":3,"verse":"Jesus went into the meeting house again. A man was there whose right hand was thin and weak."},{"num":2,"verse":"The Pharisees watched Jesus to see if he would heal the man on the Sabbath day. They wanted to find something wrong about Jesus."},{"num":3,"verse":"He spoke to the man whose hand was thin and weak. He said, `Stand here.'"},{"num":4,"verse":"Then he spoke to the Pharisees. He said, `Is it right to do good things on the Sabbath day or to do wrong things? Is it right to heal people so they will live, or to let them die?' But the Pharisees said nothing."},{"num":5,"verse":"Jesus was angry as he looked at them. And he was sad that their hearts were so hard. Then he said to the man, `Hold out your hand.' The man did so, and it was made well like the other hand."},{"num":6,"verse":"The Pharisees went out. Right away they and the servants of King Herod planned together how to kill Jesus."},{"num":8,"verse":"Jesus and his disciples went away to the sea of Galilee. Many people went with Jesus. They came from Galilee, Judea, Jerusalem, Idumea, and from the other side of the Jordan River. And many more people came also, a great many from around the cities of Tyre and Sidon. They also had heard about the great works that Jesus had done."},{"num":9,"verse":"Jesus saw that the crowd was very big. He told the disciples to have a small boat ready for him so that he would have more room."},{"num":10,"verse":"He did this because he healed many people. All who were sick tried to touch him."},{"num":11,"verse":"When the bad spirits saw Jesus, they bowed down before him. They shouted, `You are God's Son!'"},{"num":12,"verse":"He told them they must not tell anyone who he was."},{"num":13,"verse":"Then Jesus went up on the hill. He wanted some of the people to come with him. So he called them and they came."},{"num":14,"verse":"He chose twelve disciples to stay with him. He wanted to send them out to other places to tell people God's word."},{"num":15,"verse":"He gave them power to heal people and to drive bad spirits out of people."},{"num":16,"verse":"One of the twelve was Simon, whom Jesus called Peter."},{"num":17,"verse":"He also chose James and his brother John, the sons of Zebedee, whom he named Boanerges, which means \"Men of Thunder.\""},{"num":19,"verse":"He also chose Andrew, Philip, Bartholomew, Matthew, Thomas, James the son of Alphaeus, Thaddaeus, Simon of Canan, and Judas Iscariot, the one who gave Jesus over to people who hated him. Then Jesus and his disciples went home."},{"num":20,"verse":"So many people came again that they could not even eat."},{"num":21,"verse":"When Jesus' family heard about this, they came to take him away. They said, `He is crazy.'"},{"num":22,"verse":"The scribes who came from Jerusalem also talked about Jesus. They said, `Beelzebub, the chief of bad spirits, is in this man. He drives out bad spirits by the help of Beelzebub.'"},{"num":23,"verse":"Jesus called the people and talked to them in stories. He asked, `How can Satan drive out Satan?"},{"num":24,"verse":"If one part of a country fights against another part of the country, that country cannot be strong."},{"num":25,"verse":"If one part of a family fights against the other part of the family, it cannot stand."},{"num":26,"verse":"If Satan fights against himself and the bad spirits fight against each other, he cannot stand. It will be the end of him."},{"num":27,"verse":"If anyone wants to go into a strong man's house and steal his things, he must first tie the strong man. Then he can steal his things."},{"num":28,"verse":"`I tell you the truth. All wrong things that people do and say about anyone will be forgiven."},{"num":29,"verse":"But people who say wrong things against the Holy Spirit will never be forgiven. A person who does that will be punished for ever.'"},{"num":30,"verse":"Jesus said all this because the scribes said, `A bad spirit is in him.'"},{"num":31,"verse":"Jesus' mother and brothers came to him. They stood outside. They sent someone to him."},{"num":32,"verse":"Many people were sitting around him. They said, `See, your mother and your brothers are outside. They want you.'"},{"num":33,"verse":"Jesus asked them, `Who are my mother and my brothers?'"},{"num":34,"verse":"Then he looked at the people who sat around him. He said, `These people are my mother and my brothers!"},{"num":35,"verse":"Anyone who obeys God is my brother, my sister, and my mother.'"}]