[{"num":2,"verse":"Then, after arbah esrey shanim (fourteen years), again (Acts 11:30) I went up to Yerushalayim with Bar-Nabba, having taken with me also Titos."},{"num":2,"verse":"Yet I went up according to a chazon (revelation), and I laid before them the Besuras HaGeulah which I proclaim among the Goyim, but I did this privately to the men of repute (2:9), lest I should run, or should prove to have run, L’TOHU (in vain) [YESHAYAH 49:4; 65:23]."},{"num":3,"verse":"But Titos, the one with me, a Yevani (Greek), was not compelled to undergo bris milah."},{"num":4,"verse":"But because of the achei sheker (false brothers) b’Moshiach, the ones secretly brought in, the ones who crept in to spy out our DEROR (\"freedom\" VAYIKRA 25:10) which we have in Moshiach Yehoshua al menat (in order that) they might enslave us."},{"num":5,"verse":"To these enslavers not for one hour did we yield in subjection, that HaEmes of the Besuras HaGeulah might continue and remain with you (Galatian Goyim)."},{"num":6,"verse":"But from the men of repute whatever they once were matters nothing to me, ki ein masso panim im Hashem (for there is no respect of persons with G-d, no partiality) for to me these men of repute added nothing."},{"num":7,"verse":"But, on the contrary, having seen that I have been entrusted with the Besuras HaGeulah for those without the bris milah, just as Kefa was for those with the bris milah,"},{"num":8,"verse":"For the One having worked in Kefa for a Shlichus to those with the bris milah also worked in me for a Shlichus to the Goyim."},{"num":9,"verse":"And realizing the Chen v’Chesed Hashem having been given to me, Ya’akov and Kefa and Yochanan, the men of repute, the ones seeming to be Ammudei HaKehillah (Pillars of the Kehillah), extended to me and to Bar-Nabba the yad yeminam (right hands) as a sign of Achavah B’Moshiach (Brotherhood in Moshiach), that we should be for those of the Goyim, but they for those of the bris milah,"},{"num":10,"verse":"Only that we should remember the Aniyim (the Poor), the very thing which I was also eager to do."},{"num":11,"verse":"But when Kefa came to Antioch, I stood against him to his face, because there was found in him a dvar ashmah (a thing of guilt, condemnation)."},{"num":12,"verse":"For, before certain ones [Jerusalem visitors] came from Ya’akov, Kefa was as a matter of course sitting at tish at betzi’at halechem (breaking of bread) at the Seudos Moshiach with the Goyim; but, when they came, Kefa drew back and was separating himself, fearing the ones [the Jerusalem party] of the bris milah (Ac 15:5)."},{"num":13,"verse":"And the rest of the Yehudim who were ma’aminim b’Moshiach joined with Kefa in this dissembling, so that even Bar-Nabba was carried away with their tzevi’ut (hypocrisy)."},{"num":14,"verse":"But when I saw that their halichah, their hitnahagut (conduct) was not the Derech HaYashar (Straight Way) with respect to HaEmes of HaBesuras HaGeulah, I said to Kefa before all, \"If you, being a Yehudi, have a hitnahagut that is according to the Derech Goyim and not the Derech Yehudim, how do you compel the Goyim to live as the Yehudim?"},{"num":15,"verse":"We ourselves are Yehudim by birth and not Goyishe chote’im (sinners)."},{"num":16,"verse":"Yet we have da’as that a man cannot be YITZDAK IM HASHEM (\"be justified with G-d\" IYOV 25:4) by chukim of the Torah (laws of Torah), but through emunah in Rebbe, Melech HaMoshiach Yehoshua.\" And we have come to have bitachon in Rebbe, Melech HaMoshiach Yehoshua, that we can be YITZDAK IM HASHEM (\"be justified with G-d\" IYOV 25:4) by emunah in Moshiach and not by chukim of the Torah, because by chukim of the Torah KOL CHAI LO YITZDAK (\"all living shall not be justified\" TEHILLIM 143:2)."},{"num":17,"verse":"Now, if, by seeking to be YITZDAK IM HASHEM in Moshiach, we ourselves were found also to be chote’im (sinners) [2:15; Ro 3:9,23], then in that case is Moshiach a kohen for iniquity, a minister serving sin? Chas v’Shalom (G-d forbid!)!"},{"num":18,"verse":"For if what I destroyed, these things I again rebuild (1:23; 5:2), I display myself to be a poshei’a (transgressor)."},{"num":19,"verse":"For I, through the Torah (3:13), died in relation to the chok (Ro 7:4-6), so that I might live to Hashem. With Moshiach I have been talui al haetz (hanging on the tree, DEVARIM 21:23)."},{"num":20,"verse":"But it is no longer Anochi (I) who lives, but Moshiach who lives in me, and the Chayyim I now live in the basar, I live by emunah, emunah in the Ben HaElohim [Moshiach], the one having ahavah (agape) for me and having given himself over, on my behalf."},{"num":21,"verse":"I do not set aside the Chen v’Chesed Hashem; for if the MAH (\"how\") an ENOSH (\"man\") is to be YITZDAK IM HASHEM (IYOV 25:4) is found through chumra (legalism), then Moshiach died for nothing and L’TOHU (in vain) [Isa 49:4; 65:23]."}]