[{"header":"Years later I met church leaders in Jerusalem: no criticism of my gospel was made"},{"num":1,"verse":"Fourteen years later, I went up to Jerusalem again, this time with Barnabas, and we took Titus with us. My visit on this occasion was by divine command, and I gave a full exposition of the Gospel which I preach among the Gentiles. I did this first in private conference with the church leaders, to make sure that what I had done and proposed doing was acceptable to them. Not one of them intimated that Titus, because he was a Greek, ought to be circumcised. In fact, the suggestion would never have arisen but for the presence of some pseudo-Christians, who wormed their way into our meeting to spy on the liberty we enjoy in Jesus Christ, and then attempted to tie us up with rules and regulations. We did not give those men an inch, for the truth of the Gospel for you and all Gentiles was at stake. And as far as the leaders of the conference were concerned (I neither know nor care what their exact position was: God is not impressed with a man’s office), they had nothing to add to my Gospel. In fact they recognised that the Gospel for the uncircumcised was as much my commission as the Gospel for the circumcised was Peter’s. For the God who had done such great work in Peter’s ministry for the Jews was plainly doing the same in my ministry for the Gentiles. When, therefore, James, Peter and John (who were the recognised “pillars” of the church there) saw how God had given me his grace, they held out to Barnabas and me the right hand of fellowship, in full agreement that our mission was to the Gentiles and theirs to the Jews. The only suggestion they made was that we should not forget the poor—and with this I was, of course, only too ready to agree."},{"header":"I had once to defend the truth of the gospel even against a church leader"},{"num":11,"verse":"Later, however, when Peter came to Antioch I had to oppose him publicly, for he was then plainly in the wrong. It happened like this. Until the arrival of some of James’ companions, he, Peter, was in the habit of eating his meals with the Gentiles. After they came, he withdrew and ate separately from the Gentiles—out of sheer fear of what the Jews might think. The other Jewish Christians carried out a similar piece of deception, and the force of their bad example was so great that even Barnabas was affected by it. But when I saw that this behaviour was a contradiction of the truth of the Gospel, I said to Peter so that everyone could hear, “If you, who are a Jew, do not live like a Jew but like a Gentile, why on earth do you try to make Gentiles live like Jews?”"},{"num":15,"verse":"And then I went on to explain that we, who are Jews by birth and not Gentile sinners, know that a man is justified not by performing what the Law commands but by faith in Jesus Christ. We ourselves are justified by our faith and not by our obedience to the Law, for we have recognised that no one can achieve justification by doing the “works of the Law”. Now if, as we seek the real truth about justification, we find we are as much sinners as the Gentiles, does that mean that Christ makes us sinners? Of course not! But if I attempt to build again the whole structure of justification by the Law then I do, in earnest, make myself a sinner. For under the Law I “died”, and now I am dead to the Law’s demands so that I may live for God. As far as the Law is concerned I may consider that I died on the cross with Christ. And my present life is not that of the old “I”, but the living Christ within me. The bodily life I now live, I live believing in the Son of God, who loved me and sacrificed himself for me. Consequently I refuse to stultify the grace of God by reverting to the Law. For if righteousness were possible under the Law then Christ died for nothing!"}]