[{"header":"Church Leaders Accept Paul as an Apostle"},{"num":2,"verse":"Fourteen years later, I returned to Jerusalem, this time with Barnabas and Titus, my coworkers. "},{"num":2,"verse":"God gave me a clear revelation to go and confer with the other apostles concerning the message of grace I was preaching to the gentiles. I spoke privately with those who were viewed as senior leaders of the church, wanting to make certain that my labor and ministry for the Messiah had not been based on a false understanding of the gospel."},{"num":3,"verse":"Even though Titus was a Syrian, they accepted him as a brother without demanding that he first be circumcised. "},{"num":4,"verse":"I met with them privately because false “brothers” had been secretly smuggled into church meetings. They were sent to spy on the wonderful freedom that we have in Jesus Christ. Their agenda was to bring us back into the bondage of religion. "},{"num":5,"verse":"But you must know that we did not submit to their religious shackles, not even for a moment, so that we might keep the truth of the gospel of grace unadulterated for you."},{"num":6,"verse":"Even those most influential among the brothers were not able to add anything to my message. Who they are before men makes no difference to me, for God is not impressed by their reputations. "},{"num":7,"verse":"So they recognized that I was entrusted with taking the gospel to the gentiles just as Peter was entrusted with taking it to the Jews. "},{"num":8,"verse":"For the same God who empowered Peter’s apostolic ministry to the Jews also flowed through me as an apostle to those who are gentiles."},{"num":9,"verse":"When they all recognized this grace operating in my ministry, those who were recognized as influential pillars in the church—Jacob, Peter, and John—extended to Barnabas and me the warmth of Christian fellowship and honored my calling to minister to the gentiles, even as they were to go to the Jews. "},{"num":10,"verse":"They simply requested one thing of me: that I would remember the poor and needy, which was the burden I was already carrying in my heart."},{"header":"Paul Confronts Peter"},{"num":11,"verse":"When Peter visited Antioch, he caused the believers to stumble over his behavior, so I confronted him to his face. "},{"num":12,"verse":"He enjoyed eating with the gentile believers who didn’t keep the Jewish customs—up until the time Jacob’s Jewish friends arrived from Jerusalem. When he saw them, he withdrew from his gentile friends—fearing how it would look to them if he ate with gentile believers."},{"num":13,"verse":"And so, because of Peter’s hypocrisy, many other Jewish believers followed suit, refusing to eat with gentile believers. Even Barnabas was led astray by their hypocritical behavior!"},{"num":14,"verse":"So when I realized they were acting inconsistently with the revelation of the gospel, I confronted Peter in front of everyone:"},{"header":"Jews and Gentiles Are Saved by Faith"},{"num":15,"verse":"Although we’re Jews by birth and not gentile “sinners,” "},{"num":16,"verse":"we know that no one receives God’s perfect righteousness as a reward for keeping the law, but only by the faith of Jesus, the Messiah! His faithfulness has saved us, and we have received God’s perfect righteousness. Now we know that God accepts no one by the keeping of religious laws!"},{"num":17,"verse":"If we are those who desire to be righteous through our union with the Anointed One, does that mean our Messiah condones sin even though we acknowledge that we are sinners? How absurd! "},{"num":18,"verse":"For if I start over and reconstruct the old religious system that I had torn down with the message of grace, I would appear to be a lawbreaker."},{"num":19,"verse":"For through the law I died to the law, so that I might live to God."},{"num":20,"verse":"My old identity has been co-crucified with Christ and no longer lives. And now the essence of this new life is no longer mine, for the Anointed One lives his life through me—we live in union as one! My new life is empowered by the faith of the Son of God who loves me so much that he gave himself for me, dispensing his life into mine!"},{"num":21,"verse":"So that is why I don’t view God’s grace as something peripheral. For if keeping the law could release God’s righteousness to us, then Christ would have died for nothing."}]