[{"header":"Jesus and Nicodemus"},{"num":3,"verse":"There was a man from the Pharisees named Nicodemus, a ruler of the Jews. "},{"num":2,"verse":"This man came to him at night and said, “Rabbi, we know that you are a teacher who has come from God, for no one could perform these signs you do unless God were with him.”"},{"num":3,"verse":"Jesus replied, “Truly I tell you, unless someone is born again, he cannot see the kingdom of God.”"},{"num":4,"verse":"“How can anyone be born when he is old?” Nicodemus asked him. “Can he enter his mother’s womb a second time and be born?”"},{"num":5,"verse":"Jesus answered, “Truly I tell you, unless someone is born of water and the Spirit, he cannot enter the kingdom of God. "},{"num":6,"verse":"Whatever is born of the flesh is flesh, and whatever is born of the Spirit is spirit. "},{"num":7,"verse":"Do not be amazed that I told you that you must be born again. "},{"num":8,"verse":"The wind blows where it pleases, and you hear its sound, but you don’t know where it comes from or where it is going. So it is with everyone born of the Spirit.”"},{"num":9,"verse":"“How can these things be?” asked Nicodemus."},{"num":10,"verse":"“Are you a teacher of Israel and don’t know these things?” Jesus replied. "},{"num":11,"verse":"“Truly I tell you, we speak what we know and we testify to what we have seen, but you do not accept our testimony. "},{"num":12,"verse":"If I have told you about earthly things and you don’t believe, how will you believe if I tell you about heavenly things? "},{"num":13,"verse":"No one has ascended into heaven except the one who descended from heaven —the Son of Man."},{"num":14,"verse":"“Just as Moses lifted up the snake in the wilderness, so the Son of Man must be lifted up, "},{"num":15,"verse":"so that everyone who believes in him may have eternal life. "},{"num":16,"verse":"For God loved the world in this way: He gave his one and only Son, so that everyone who believes in him will not perish but have eternal life. "},{"num":17,"verse":"For God did not send his Son into the world to condemn the world, but to save the world through him. "},{"num":18,"verse":"Anyone who believes in him is not condemned, but anyone who does not believe is already condemned, because he has not believed in the name of the one and only Son of God. "},{"num":19,"verse":"This is the judgment: The light has come into the world, and people loved darkness rather than the light because their deeds were evil. "},{"num":20,"verse":"For everyone who does evil hates the light and avoids it, so that his deeds may not be exposed. "},{"num":21,"verse":"But anyone who lives by the truth comes to the light, so that his works may be shown to be accomplished by God.”"},{"header":"Jesus and John the Baptist"},{"num":22,"verse":"After this, Jesus and his disciples went to the Judean countryside, where he spent time with them and baptized."},{"num":23,"verse":"John also was baptizing in Aenon near Salim, because there was plenty of water there. People were coming and being baptized, "},{"num":24,"verse":"since John had not yet been thrown into prison."},{"num":25,"verse":"Then a dispute arose between John’s disciples and a Jew about purification. "},{"num":26,"verse":"So they came to John and told him, “Rabbi, the one you testified about, and who was with you across the Jordan, is baptizing—and everyone is going to him.”"},{"num":27,"verse":"John responded, “No one can receive anything unless it has been given to him from heaven. "},{"num":28,"verse":"You yourselves can testify that I said, ‘I am not the Messiah, but I’ve been sent ahead of him.’ "},{"num":29,"verse":"He who has the bride is the groom. But the groom’s friend, who stands by and listens for him, rejoices greatly at the groom’s voice. So this joy of mine is complete. "},{"num":30,"verse":"He must increase, but I must decrease.”"},{"header":"The One from Heaven"},{"num":31,"verse":"The one who comes from above is above all. The one who is from the earth is earthly and speaks in earthly terms. The one who comes from heaven is above all. "},{"num":32,"verse":"He testifies to what he has seen and heard, and yet no one accepts his testimony. "},{"num":33,"verse":"The one who has accepted his testimony has affirmed that God is true. "},{"num":34,"verse":"For the one whom God sent speaks God’s words, since he gives the Spirit without measure. "},{"num":35,"verse":"The Father loves the Son and has given all things into his hands. "},{"num":36,"verse":"The one who believes in the Son has eternal life, but the one who rejects the Son will not see life; instead, the wrath of God remains on him."}]