[{"num":3,"verse":"1 Christ teacheth Nicodemus the very principles of Christian regeneration. 14 The serpent in the wilderness. 23 John baptizeth, 27 and teacheth his, that he is not Christ."},{"num":1,"verse":"There was now a man of the Pharisees, named Nicodemus, a ruler of the Jews."},{"num":2,"verse":"This man came to Jesus by night, and said unto him, Rabbi, we know that thou art a teacher come from God, for no man could do these miracles that thou doest, except God were with him."},{"num":3,"verse":"Jesus answered and said unto him, Verily verily I say unto thee, Except a man be born again, he cannot see the kingdom of God. "},{"num":4,"verse":"Nicodemus said unto him, How can a man be born which is old? can he enter into his mother’s womb again, and be born?"},{"num":5,"verse":"Jesus answered, Verily, verily I say unto thee, except that a man be born of water and of the Spirit, he cannot enter into the kingdom of God. "},{"num":6,"verse":"That which is born of the flesh, is flesh: and that that is born of the Spirit, is spirit. "},{"num":7,"verse":"Marvel not that I said to thee, Ye must be born again. "},{"num":8,"verse":"The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every man that is born of the Spirit. "},{"num":9,"verse":"Nicodemus answered, and said unto him, How can these things be?"},{"num":10,"verse":"Jesus answered, and said unto him, Art thou a teacher of Israel, and knowest not these things? "},{"num":11,"verse":"Verily, verily I say unto thee, We speak that we know, and testify that we have seen: but ye receive not our witness. "},{"num":12,"verse":"If when I tell you earthly things, ye believe not, how should ye believe, If I shall tell you of heavenly things? "},{"num":13,"verse":"For no man ascendeth up to heaven, but he that had descended from heaven, that Son of man which is in heaven. "},{"num":14,"verse":"And as Moses lifted up the serpent in the wilderness, so must that Son of man be lifted up, "},{"num":15,"verse":"That whosoever believeth in him, should not perish, but have eternal life. "},{"num":16,"verse":"For God so loveth the world, that he hath given his only begotten Son, that whosoever believeth in him, should not perish, but have everlasting life. "},{"num":17,"verse":"For God sent not his Son into the world, that he should condemn the world, but that the world through him might be saved. "},{"num":18,"verse":"He that believeth in him, is not condemned: but he that believeth not, is condemned already, because he hath not believed in the Name of that only begotten Son of God. "},{"num":19,"verse":"And this is the condemnation, that that light came into the world, and men loved darkness rather than that light, because their deeds were evil. "},{"num":20,"verse":"For every man that evil doeth, hateth the light, neither cometh to light, lest his deeds should be reproved. "},{"num":21,"verse":"But he that doeth truth, cometh to the light, that his deeds might be made manifest, that they are wrought according to God. "},{"num":22,"verse":"¶ After these things came Jesus, and his disciples into the land of Judea, and there tarried with them, and baptized."},{"num":23,"verse":"And John also baptized in Aenon besides Salim, because there was much water there: and they came and were baptized."},{"num":24,"verse":"For John was not yet cast into prison."},{"num":25,"verse":"Then there arose a question between John’s disciples and the Jews, about purifying."},{"num":26,"verse":"And they came unto John, and said unto him, Rabbi, he that was with thee beyond Jordan, to whom thou barest witness, behold, he baptizeth, and all men come to him."},{"num":27,"verse":"John answered, and said, A man can receive nothing, except it be given him from heaven."},{"num":28,"verse":"Ye yourselves are my witnesses, that I said, I am not that Christ, but that I am sent before him."},{"num":29,"verse":"He that hath the bride, is the bridegroom: but the friend of the bridegroom which standeth and heareth him, rejoiceth greatly, because of the bridegroom’s voice. This my joy therefore is fulfilled."},{"num":30,"verse":"He must increase, but I must decrease."},{"num":31,"verse":"He that is come from on high, is above all: he that is of the earth, is of the earth, and speaketh of the earth: he that is come from heaven, is above all."},{"num":32,"verse":"And what he hath seen and heard, that he testifieth: but no man receiveth his testimony."},{"num":33,"verse":"He that hath receiveth his testimony, hath sealed that God is true."},{"num":34,"verse":"For he whom God hath sent, speaketh the words of God: for God giveth him not the Spirit by measure."},{"num":35,"verse":"The Father loveth the Son, and hath given all things into his hand."},{"num":36,"verse":"He that believeth in the Son, hath everlasting life, and he that obeyeth not the Son, shall not see life, but the wrath of God abideth on him."}]