[{"header":"Jesus and Nicodemus"},{"num":3,"verse":"There was a man from the Pharisees named Nicodemus, a ruler of the Jews. "},{"num":2,"verse":"This man came to Him at night and said, “Rabbi, we know that You have come from God as a teacher, for no one could perform these signs You do unless God were with him.”"},{"num":3,"verse":"Jesus replied, “I assure you: Unless someone is born again, he cannot see the kingdom of God.”"},{"num":4,"verse":"“But how can anyone be born when he is old?” Nicodemus asked Him. “Can he enter his mother’s womb a second time and be born?”"},{"num":5,"verse":"Jesus answered, “I assure you: Unless someone is born of water and the Spirit, he cannot enter the kingdom of God. "},{"num":9,"verse":"“How can these things be?” asked Nicodemus."},{"header":"Jesus and John the Baptist"},{"num":22,"verse":"After this, Jesus and His disciples went to the Judean countryside, where He spent time with them and baptized. "},{"num":23,"verse":"John also was baptizing in Aenon near Salim, because there was plenty of water there. People were coming and being baptized, "},{"num":24,"verse":"since John had not yet been thrown into prison."},{"num":25,"verse":"Then a dispute arose between John’s disciples and a Jew about purification. "},{"num":26,"verse":"So they came to John and told him, “Rabbi, the One you testified about, and who was with you across the Jordan, is baptizing—and everyone is flocking to Him.”"},{"num":27,"verse":"John responded, “No one can receive a single thing unless it’s given to him from heaven. "},{"num":28,"verse":"You yourselves can testify that I said, ‘I am not the Messiah, but I’ve been sent ahead of Him.’ "},{"num":29,"verse":"He who has the bride is the groom. But the groom’s friend, who stands by and listens for him, rejoices greatly at the groom’s voice. So this joy of mine is complete. "},{"num":30,"verse":"He must increase, but I must decrease.”"},{"header":"The One from Heaven"},{"num":31,"verse":"The One who comes from above is above all. The one who is from the earth is earthly and speaks in earthly terms. The One who comes from heaven is above all. "},{"num":32,"verse":"He testifies to what He has seen and heard, yet no one accepts His testimony. "},{"num":33,"verse":"The one who has accepted His testimony has affirmed that God is true. "},{"num":34,"verse":"For God sent Him, and He speaks God’s words, since He gives the Spirit without measure. "},{"num":35,"verse":"The Father loves the Son and has given all things into His hands. "},{"num":36,"verse":"The one who believes in the Son has eternal life, but the one who refuses to believe in the Son will not see life; instead, the wrath of God remains on him."}]