[{"num":3,"verse":"So all of you who are holy partners in a heavenly calling, let’s turn our attention to Jesus, the Emissary of God and High Priest, who brought us the faith we profess; "},{"num":2,"verse":"and compare Him to Moses, who also brought words from God. Both of them were faithful to their missions, to the One who called them. "},{"num":3,"verse":"But we value Jesus more than Moses, in the same way that we value a builder more than the house he builds. "},{"num":4,"verse":"Every house is built by someone, but the builder of all things is God. "},{"num":5,"verse":"Moses brought healing and redemption to his people as a faithful servant in God’s house, and he was a witness to the things that would be spoken later. "},{"num":6,"verse":"But Jesus the Anointed was faithful as a Son of that house. (We become that house, if we’re able to hold on to the confident hope we have in God until the end.)"},{"num":7,"verse":"Listen now, to the voice of the Holy Spirit through what the psalmist wrote:"},{"num":12,"verse":"Brothers and sisters, pay close attention so you won’t develop an evil and unbelieving heart that causes you to abandon the living God. "},{"num":13,"verse":"Encourage each other every day—for as long as we can still say “today”—so none of you let the deceitfulness of sin harden your hearts. "},{"num":14,"verse":"For we have become partners with the Anointed One—if we can just hold on to our confidence until the end."},{"num":15,"verse":"Look at the lines from the psalm again:"},{"num":16,"verse":"Now who, exactly, was God talking to then? Who heard and rebelled? Wasn’t it all of those whom Moses led out of Egypt? "},{"num":17,"verse":"And who made God angry for an entire generation? Wasn’t it those who sinned against Him, those whose bodies are still buried in the wilderness, the site of that uprising? "},{"num":18,"verse":"It was those disobedient ones who God swore would never enter into salvation’s rest. "},{"num":19,"verse":"And we can see that they couldn’t enter because they did not believe."}]