[{"num":2,"verse":"Say ye unto your achim, Ami (My people); and to your achayot, Ruchamah (Pitied)."},{"num":2,"verse":"Plead with immechem (your mother), plead; for she is not my isha (wife), neither am I her ish (husband); let her therefore put away her zenunim (whoredoms) out of her sight, and her na’afufim (adulteries) from between her breasts;"},{"num":2,"verse":"Lest I strip her naked, and set her as bare as the day she was born, and make her as a midbar, and turn her like an eretz tziyyah (parched land), and kill her with tzamah (thirst)."},{"num":2,"verse":"And I will not have mercy upon her banim; for they are the bnei zenunim."},{"num":2,"verse":"For their em hath played the zonah (prostitute); she that conceived them hath done shamefully; for she said, I will go after my lovers, that give me my lechem and my mayim, my wool and my flax, mine shemen (oil) and my shikkui (drink)."},{"num":2,"verse":"Therefore, hinei, I will hedge up thy path with thorns, and wall in her wall, that she shall not find her netivah (way)."},{"num":2,"verse":"And she shall chase after her lovers, but she shall not overtake them; and she shall seek them, but shall not find them; then shall she say, I will go and return to my ish harishon (first husband); for then was it better with me than now."},{"num":2,"verse":"For she did not have da’as that I gave her dagan (grain), and tirosh (new wine), and yitzhar (oil), and multiplied her kesef and zahav, which they prepared for Ba’al."},{"num":2,"verse":"Therefore will I return, and take away My dagan in the season thereof, and My tirosh in the season thereof, and will take back My wool and My flax given to cover her nakedness."},{"num":2,"verse":"And now will I expose her navlut (lewdness) in the sight of her lovers, and none shall deliver her out of Mine hand."},{"num":2,"verse":"I will also cause all her masos (exultation, joy) to cease, her Chag (feast), her Chodesh (New Moons), and her Shabbatot, and all her Mo’adim (appointed feasts)."},{"num":2,"verse":"And I will destroy her gefanim (vines) and her te’enim (fig trees), whereof she hath said, These are my etnan (harlot’s wages) that my lovers have given me; and I will make them a forest, and the wild beasts of the sadeh shall devour them."},{"num":2,"verse":"And I will visit upon her the yamim of Ba’alim, wherein she burned incense to them, and she decked herself with her ring and her jewelry, and she went after her lovers, and forgot Me, saith Hashem."},{"num":2,"verse":"Therefore, hinei, I will allure her, and bring her into the midbar, and speak to her lev."},{"num":2,"verse":"And there I will give her her kramim (vineyards), and the Emek Achor (Valley of Trouble) I will make a petach tikvah (door of hope); and she shall sing there, as in the yamim of her youth, and as in the yom when she came up out of Eretz Mitzrayim."},{"num":2,"verse":"And it shall be in Yom Hahu, saith Hashem, that thou shalt call Me Ishi (my Husband); and shalt call Me no more Ba’ali."},{"num":2,"verse":"For I will take away the shemot (names) of Ba’alim out of her mouth, and they shall be remembered by their names no more."},{"num":2,"verse":"And in Yom Hahu will I make a brit (covenant) for them with the beasts of the sadeh and with the fowls of Shomayim, and with the creeping things of the adamah; and I will abolish the keshet and the cherev and the milchamah from ha’aretz, and will make them to lie down in safety."},{"num":2,"verse":"And I will betroth thee unto Me l’olam; yea, I will betroth thee unto Me in tzedek, and in mishpat, and in chesed, and in rachamim."},{"num":2,"verse":"I will even betroth thee unto Me in emunah (faithfulness, fidelity): then thou shalt know Hashem."},{"num":2,"verse":"And it shall come to pass in Yom Hahu, I will answer, saith Hashem, I will answer HaShomayim (the heavens), and they shall answer Ha’Aretz;"},{"num":2,"verse":"And Ha’Aretz shall answer with dagan, and tirosh, and yitzhar; and they shall answer Yizre’el (G-d will sow)."},{"num":2,"verse":"And I will sow her for Myself in ha’aretz; and I will have rachamim upon lo ruchamah; and I will say to them which were lo ami, Thou art ami (My people); and they shall say, Thou art Elohai (my G-d)."}]