[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:10-14 By this law a soldier was allowed to marry his captive, if he pleased. This might take place upon some occasions; but the law does not show any approval of it. It also intimates how binding the laws of justice and honour are in marriage; which is a sacred engagement.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bewail her father and her mother a full month - This is prescribed from motives of humanity, that the woman might have time and leisure to detach her affections from their natural ties, and prepare her mind for new ones. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "De 21:10-23. The Treatment of a Captive Taken to Wife.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10-14. When thou goest to war … and seest among the captives a beautiful woman … that thou wouldest have her to thy wife—According to the war customs of all ancient nations, a female captive became the slave of the victor, who had the sole and unchallengeable control of right to her person. Moses improved this existing usage by special regulations on the subject. He enacted that, in the event that her master was captivated by her beauty and contemplated a marriage with her, a month should be allowed to elapse, during which her perturbed feelings might be calmed, her mind reconciled to her altered condition, and she might bewail the loss of her parents, now to her the same as dead. A month was the usual period of mourning with the Jews, and the circumstances mentioned here were the signs of grief—the shaving of the head, the allowing the nails to grow uncut, the putting off her gorgeous dress in which ladies, on the eve of being captured, arrayed themselves to be the more attractive to their captors. The delay was full of humanity and kindness to the female slave, as well as a prudential measure to try the strength of her master's affections. If his love should afterwards cool and he become indifferent to her person, he was not to lord it over her, neither to sell her in the slave market, nor retain her in a subordinate condition in his house; but she was to be free to go where her inclinations led her.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The raiment of her captivity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Those goodly raiments in which she was when she was taken captive, instead of which she now must put on a servile habit, as this is generally understood; or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Those servile and sordid raiments which were put upon her when she was taken captive, as the manner was to do with captives, as the phrase itself seems to intimate; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as prison garments",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "{ Jeremiah 52:33}",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "{",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Jeremiah 52:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "}",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " are such garments as prisoners use to wear; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "garments of praise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are praiseworthy or glorious garments; and it seems harsh to call those ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "garments of captivity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which are made for and generally worn by free persons only, and which are usually taken away from persons when they come into captivity. Add, that this doth not seem to be any part or token of her sorrow, but rather a mending of her condition, and exchanging her servile habit for a better and more decent one, which might be, though this were a mourning habit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Her father and mother; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either their death, or, which was in effect the same, her final separation from them. Withal this signified her alienation from them or from their superstitious and idolatrous courses, and her translation of her love from all other persons to her husband and to the true religion. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 45:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "She shall be thy wife; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " supposing what might very rationally be supposed of one in her circumstances, and what she signified by the foregoing rites, that she should submit to her husband’s religion, in which case the marriage might be tolerable. Or this was a permission and indulgence given to them for the hardness of their hearts, as in the case of divorce, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 24:1 Matthew 19:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 19:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And she shall put the raiment of her captivity from off her,.... Her beautiful garments, and gay apparel, in which she was taken captive; and which tended to stir up the stronger affection for her, and greater desire after her; and therefore, as some think, were ordered to be removed, to abate the ardour of love to her. Jarchi observes, that the daughters of the Gentiles used to adorn themselves in war, that they might cause others to commit fornication with them; and another writer before referred to says (o), the daughters of Heathens used to adorn themselves in raiment of silk, and purple, and fine linen, and needlework, to allure and entice men with them; and therefore the law obliges to put off her beautiful garments, and clothe her with old worn out ones, that she might be less agreeable to him; though the putting off her fine clothes, and being clad with sordid ones, might be only as a token of mourning; as it was customary at such times to lay aside richer clothing, and put on sackcloth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall remain in thine house: shut up there, and never stir out, as the same writer interprets it. Maimonides (p) says, that she was to be with him in the house, that going in and out he might see her, and she become abominable to him; though perhaps it was only that he might have an opportunity of observing her manners, and of conversing with her, in order to make a proselyte of her; so the Targum of Jonathan interprets it of dipping herself, and becoming a proselytess in his house; or else, as the rest, her abiding in the house, and not going out, might be on account of mourning, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and bewail her father and her mother a full month; who were either dead in the battle, or however she had no hope of seeing them any more, being a captive, and likely to be settled in another man's house in a foreign country, and so take her farewell of her father's house in this mournful manner. The Jews are divided about the sense of these words; some take them simply to signify her parents, others her idols, according to Jeremiah 2:17. The Targum of Jonathan is,\"and weep for the idols of the house of her father and her mother;''meaning not for the loss of them, but for the idolatry of her father's house she was now convinced of, being become a proselytess, according to the paraphrast; but the last seems only to have respect to the loss of her father and mother, which she was to bewail a whole month, or \"a moon of days\" (q); as many days as the moon is going its course, which it finishes in twenty seven days, seven hours, and forty three minutes, and this is called the periodical month; but is longer in passing from one conjunction of it with the sun to another, called the synodical month, and its quantity is twenty nine days, twelve hours, and forty four minutes. Maimonides (r) says, she was to stay in his house three months, one month of mourning, and two after that, and then he was to marry her. The reason of this the Targum of Jonathan explains, by paraphrasing the words thus,\"and shall stay three months, that it may be known whether she is with child;''that is, by his lying with her before when taken with her beauty, that so he might distinguish this child begotten on her in Heathenism, from what he might have by her after marriage, which is supposed to be the case of Tamar and Absalom; but as there is no foundation in the text for a permission to lie with her before marriage, so neither for these additional months; only one month was required, which was the usual time for mourning for deceased relations; see Numbers 20:29. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and bewail her father and her mother a full month; who were either dead in the battle, or however she had no hope of seeing them any more, being a captive, and likely to be settled in another man's house in a foreign country, and so take her farewell of her father's house in this mournful manner. The Jews are divided about the sense of these words; some take them simply to signify her parents, others her idols, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Targum of Jonathan is,\"and weep for the idols of the house of her father and her mother;''meaning not for the loss of them, but for the idolatry of her father's house she was now convinced of, being become a proselytess, according to the paraphrast; but the last seems only to have respect to the loss of her father and mother, which she was to bewail a whole month, or \"a moon of days\" (q); as many days as the moon is going its course, which it finishes in twenty seven days, seven hours, and forty three minutes, and this is called the periodical month; but is longer in passing from one conjunction of it with the sun to another, called the synodical month, and its quantity is twenty nine days, twelve hours, and forty four minutes. Maimonides (r) says, she was to stay in his house three months, one month of mourning, and two after that, and then he was to marry her. The reason of this the Targum of Jonathan explains, by paraphrasing the words thus,\"and shall stay three months, that it may be known whether she is with child;''that is, by his lying with her before when taken with her beauty, that so he might distinguish this child begotten on her in Heathenism, from what he might have by her after marriage, which is supposed to be the case of Tamar and Absalom; but as there is no foundation in the text for a permission to lie with her before marriage, so neither for these additional months; only one month was required, which was the usual time for mourning for deceased relations; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and after that thou shalt go in unto her; and not before: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and be her husband, and she shall be thy wife he continuing to love her, and she having become a proselytess. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) R. Abraham Seba in Tzeror. Hammor, fol. 146. 2.((p) Ut supra. (Hilchot Melachim, c. 8. sect. 2.) (q)  \"luna dierum\", Montanus, Piscator, Grotius. (r) Ut supra (Hilchot Melachim, c. 8.), sect. 6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) R. Abraham Seba in Tzeror. Hammor, fol. 146. 2.((p) Ut supra. (Hilchot Melachim, c. 8. sect. 2.) (q)  \"luna dierum\", Montanus, Piscator, Grotius. (r) Ut supra (Hilchot Melachim, c. 8.), sect. 6. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And she shall put the raiment of her captivity from off her, and shall remain in thine house, {e} and bewail her father and her mother a full month: and after that thou shalt go in unto her, and be her husband, and she shall be thy {f} wife.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And she shall put the raiment of her captivity from off her, and shall remain in thine house, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and bewail her father and her mother a full month: and after that thou shalt go in unto her, and be her husband, and she shall be thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wife.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) As having renounced parents and country.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) This was only allowed in the wars, otherwise the Israelites could not marry strangers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a full month",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a month of days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a usual period of mourning, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 34:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 50:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Contrast Mohammed’s practice above.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be her husband",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a ba‘al to her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 24:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "marrieth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The raiment of her captivity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". the raiment she had on whoa taken captive; this she was to lay aside, that she  might put on garments of mourning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A full month",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a month of days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the period of mourning was forty days (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 50:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Deuteronomy 21:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the woman was taken home to the house of the man who had loved her, she was to shave her head, and make, i.e., cut, her nails (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), - both customary signs of purification (on this signification of the cutting of the hair, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), - as symbols of her passing out of the state of a slave, and of her reception into the fellowship of the covenant nation. This is perfectly obvious in her laying aside her prisoner's clothes. After putting off the signs of captivity, she was to sit (dwell) in the house, and bewail her father and mother for a month, i.e., console herself for her separation from her parents, whom she had lost, that she might be able to forget her people and her father's house (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 45:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and give herself up henceforth in love to her husband with an undivided heart. The intention of these laws was not to protect the woman against any outbreak of rude passion on the part of the man, but rather to give her time and leisure to loosen herself inwardly from the natural fellowship of her nation and kindred, and to acquire affection towards the fellowship of the people of God, into which she had entered against her will, that her heart might cherish love to the God of Israel, who had given her favour in the eyes of her master, and had taken from her the misery and reproach of slavery. But her master becoming her husband, she entered into the rights of a daughter of Israel, who had been sold by her father to a man to be his wife (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). If after this her husband should find no pleasure in her, he was to let her go לנפשׁהּ, i.e., at her free will, and not sell her for money (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"Thou shalt not put constraint upon her, because thou hast humbled her.\" התעמּר, which only occurs again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 24:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", probably signifies to throw oneself upon a person, to practise violence towards him (cf. Ges. thes. p. 1046). ",
        "children": []
      }
    ]
  }
]