[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 21:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 21:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He is accursed of God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He is in a singular manner cursed and punished by God’s appointment with a most shameful kind of punishment, as this was held among the Jews and all nations; and therefore this punishment may suffice for him, and there shall not be added to it that of lying unburied. And this curse is here appropriated to those that are hanged, to signify beforehand that Christ should undergo this execrable punishment, and be made a curse for us, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) which, though it was future in respect to men, yet was present unto God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Defiled — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either by inhumanity toward the dead, or by suffering the monument of the man’s wickedness, and of God’s curse, to remain public a longer time than God would have it; whereas, it ought to be put out of sight, and buried in oblivion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:22,23 By the law of Moses, the touch of a dead body was defiling, therefore dead bodies must not be left hanging, as that would defile the land. There is one reason here which has reference to Christ; He that is hanged is accursed of God; that is, it is the highest degree of disgrace and reproach. Those who see a man thus hanging between heaven and earth, will conclude him abandoned of both, and unworthy of either. Moses, by the Spirit, uses this phrase of being accursed of God, when he means no more than being treated most disgracefully, that it might afterward be applied to the death of Christ, and might show that in it he underwent the curse of the law for us; which proves his love, and encourages to faith in him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He that is hanged is accursed of God - i. e. \"Bury him that is hanged out of the way before evening: his hanging body defiles the land; for God's curse rests on it.\" The curse of God is probably regarded as lying on the malefactor because, from the fact of his being hanged, be must have been guilty of a especially atrocious breach of God's covenant. Such an offender could not remain on the face of the earth without defiling it (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Therefore after the penalty of his crime had been inflicted, and he had hung for a time as a public example, the holy land was to be at once and entirely delivered from his presence. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for Paul's quotation of this text and his application of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22, 23. if a man have committed a sin … and thou hang him on a tree—Hanging was not a Hebrew form of execution (gibbeting is meant), but the body was not to be left to rot or be a prey to ravenous birds; it was to be buried \"that day,\" either because the stench in a hot climate would corrupt the air, or the spectacle of an exposed corpse bring ceremonial defilement on the land.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Is accursed of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. he is in a singular manner cursed and punished by God’s appointment with a most shameful kind of punishment, as this was held among the Jews and all nations; and therefore this punishment may suffice for him, and there shall not be added to it that of lying unburied, which was another great calamity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Jeremiah 16:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And this curse is here appropriated to those that are hanged, partly because this punishment was inflicted only upon the most notorious and public offenders, and such as brought the curse of God upon the community, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 25:4 2 Samuel 21:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 21:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and principally to foresignify that Christ should undergo this execrable punishment, and be made a curse for us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Galatians 3:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 3:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which though it was yet to come in respect to men, yet was present unto God, and in his eye at this time. And so this is delivered with respect unto Christ, as many other passages of Scripture manifestly are. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Be not defiled, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, morally; either by inhumanity towards the dead; or rather by suffering the monument or memorial of the man’s great wickedness, and of God’s curse, to remain public and visible a longer time than God would have it, whereas it should be put out of sight, and buried in oblivion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "His body shall not remain all night upon the tree,.... Which is to be understood of any and everyone that was hanged, and not of the rebellious son only; of whom Josephus (l) says, that he was to be stoned by the multitude without the city, and having remained a whole day for a spectacle unto all, was to be buried at night; and indeed such a person was not to remain hanging on the tree any part of the night, but to be taken down at sun setting; so the Targum of Jonathan,\"ye shall bury him at sun setting;''so says Maimonides (m), they hang a man near the setting of the sun and loose him immediately, and if he continues they transgress a negative precept, \"his body shall not remain\", &c. yea, according to him and to the Misnah (n), and which agrees with the practice of the Jews to this day, not only those that were put to death by the sanhedrim, but whoever suffered his dead to remain unburied a night transgressed a negative command, unless he kept him for his honour, to get for him a coffin and shroud: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but thou shalt in any wise bury him in that day: by all means, if possible; malefactors were not buried in the sepulchre of their fathers, but there were two burying places provided by the sanhedrim, one for those that were stoned and burnt, and another for those that were killed with the sword and strangled (o); and even the instruments of their death were to be buried also, as Maimonides (p) relates, the tree on which he is hanged is buried with him, that there may be no remembrance of the evil, and they say, this is the tree on which such an one was hanged; and so the stone with which he is stoned, and the sword with which he is killed, and the napkin with which he is strangled, all are buried in the place where he is put to death, but not in the grave itself: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for he that is hanged is accursed of God: plainly appears to be so, having committed some foul sin which has brought the curse of God upon him, and which being hanged on a tree was a plain proof and declaration of; and therefore having hereby suffered the rigour of the law, the curse of it, his body was ordered to be taken down; for the words are not a reason of his being hanged, but a reason why being hanged, and so openly accursed, he should not remain hanging, but be taken down and buried: the meaning is not, as Onkelos gives it, that\"because he sinned before the Lord he is hanged,''and particularly was guilty of blasphemy; which is given as the reason of his being hanged, and as the sense of this passage; on the mention of which it is said (q),\"it is as if he should say, wherefore is he hanged? because he cursed God, and the name of God was found profaned:''but though this, or any other capital crime, may be allowed to be the reason of the man's being hanged, and so apparently accursed; yet this is not the reason of his being loosed from thence, but his having bore the curse and satisfied the law: and hence this is applied to Christ by the apostle, in Galatians 3:13 showing, that his hanging on the tree was an indication and proof of his being made sin and a curse for his people, or that he bore the curse of the law for their sins, and that the taking of him down from the tree, and burying him, signified the removing the curse from him and his people for whom he suffered; or that thereby he redeemed them from the curse of the law, as the apostle expresses it: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for he that is hanged is accursed of God: plainly appears to be so, having committed some foul sin which has brought the curse of God upon him, and which being hanged on a tree was a plain proof and declaration of; and therefore having hereby suffered the rigour of the law, the curse of it, his body was ordered to be taken down; for the words are not a reason of his being hanged, but a reason why being hanged, and so openly accursed, he should not remain hanging, but be taken down and buried: the meaning is not, as Onkelos gives it, that\"because he sinned before the Lord he is hanged,''and particularly was guilty of blasphemy; which is given as the reason of his being hanged, and as the sense of this passage; on the mention of which it is said (q),\"it is as if he should say, wherefore is he hanged? because he cursed God, and the name of God was found profaned:''but though this, or any other capital crime, may be allowed to be the reason of the man's being hanged, and so apparently accursed; yet this is not the reason of his being loosed from thence, but his having bore the curse and satisfied the law: and hence this is applied to Christ by the apostle, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 3:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " showing, that his hanging on the tree was an indication and proof of his being made sin and a curse for his people, or that he bore the curse of the law for their sins, and that the taking of him down from the tree, and burying him, signified the removing the curse from him and his people for whom he suffered; or that thereby he redeemed them from the curse of the law, as the apostle expresses it: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "that thy land be not defiled, which the Lord thy God giveth thee for an inheritance: which is another reason for taking down the body from the tree and burying it, lest the land of Canaan, which the Lord had given them for an inheritance, and which was typical of the undefiled inheritance, 1 Peter 1:4 should be polluted, both in a natural sense, through the putrefaction and corruption, and the disagreeable smell of a dead body, and in a ceremonial sense, as every carcass was defiling, if a person but entered where it was; and therefore a dead body was not to be left hanging openly in the air, and rotting there. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that thy land be not defiled, which the Lord thy God giveth thee for an inheritance: which is another reason for taking down the body from the tree and burying it, lest the land of Canaan, which the Lord had given them for an inheritance, and which was typical of the undefiled inheritance, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " should be polluted, both in a natural sense, through the putrefaction and corruption, and the disagreeable smell of a dead body, and in a ceremonial sense, as every carcass was defiling, if a person but entered where it was; and therefore a dead body was not to be left hanging openly in the air, and rotting there. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Antiqu. l. 4. c. 8. sect. 24. (m) Hilchot Sanhedrin, c. 15. sect. 7. (n) Sanhedrin, c. 6. sect. 5. (o) Sanhedrin, c. 6. sect. 5. (p) Ut supra, (Hilchot Sanhedrin, c. 15.) sect. 9. (q) Misn. Sanhedrin, c. 6. sect. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) Antiqu. l. 4. c. 8. sect. 24. (m) Hilchot Sanhedrin, c. 15. sect. 7. (n) Sanhedrin, c. 6. sect. 5. (o) Sanhedrin, c. 6. sect. 5. (p) Ut supra, (Hilchot Sanhedrin, c. 15.) sect. 9. (q) Misn. Sanhedrin, c. 6. sect. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "His body shall not remain {m} all night upon the tree, but thou shalt in any wise bury him that day; (for he that is hanged is accursed of God;) that thy land be not defiled, which the LORD thy God giveth thee for an inheritance.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "His body shall not remain ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all night upon the tree, but thou shalt in any wise bury him that day; (for he that is hanged ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " accursed of God;) that thy land be not defiled, which the LORD thy God giveth thee ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "for",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an inheritance.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) For God's law is satisfied by his death, and nature abhors cruelty.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the thing hanged",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is accursed of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a curse of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was the meaning of such exposure of the corpse after execution. God’s wrath was heaped upon it; or it became doubly unclean and therefore terribly charged with infection to its surroundings. The LXX version of these words: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κεκαταραμένος ὑπὸ θεοῦ πᾶς κρεμάμενος ἐπὶ ξύλου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is quoted by Paul with a difference—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπικατάρατος πᾶς ὁ κρεμάμενος ἐπὶ ξύλου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—in support of his statement that Christ was made a curse for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that thou defile not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In D only here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 24:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the idea, differently expressed, is frequent.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "giveth thee for an inheritance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 15:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He that is hanged is accursed of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a curse of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some take this as meaning an insult to God, a contemning of him, \"since man his image is thus given up to scorn and insult\" (Rashi). But the more probable meaning is \"a curse inflicted by God,\" which the transgressor is made to endure (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That thy land be not defiled.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The land was defiled, not only by sins committed by its inhabitants, but also by the public exposure of criminals who had been put to death for their sins (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18:24, 25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:33, 34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). On this law Joshua acted (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 8:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 10:26, 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Deuteronomy 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Burial of those who had been Hanged. - If there was a sin upon a man, מות משׁפּט, lit., a right of death, i.e., a capital crime (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and he was put to death, and they hanged him upon a tree (wood), his body was not to remain upon the wood over night, but they were to bury him on the same day upon which he as hanged; \"for the hanged man is a curse of God,\" and they were not to defile the land which Jehovah gave for an inheritance. The hanging, not of criminals who were to be put to death, but of those who had been executed with the sword, was an intensification of the punishment of death (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), inasmuch as the body was thereby exposed to peculiar kinds of abominations. Moses commanded the burial of those who had been hanged upon the day of their execution, - that is to say, as we may see from the application of this law in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 8:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 10:26-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", before sunset, - because the hanged man, being a curse of God, defiled the land. The land was defiled not only by vices and crimes (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but also by the exposure to view of criminals who had been punished with death, and thus had been smitten by the curse of God, inasmuch as their shameful deeds were thereby publicly exposed to view. We are not to think of any bodily defilement of the land through the decomposition consequent upon death, as J. D. Mich. and Sommer suppose; so that there is no ground for speaking of any discrepancy between this and the old law. - (On the application of this law to Christ, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), - This regulation is appended very loosely to what precedes. The link of connection is contained in the thought, that with the punishment of the wicked the recollection of their crimes was also to be removed. ",
        "children": []
      }
    ]
  }
]