[{"header":"Cities for the Levites"},{"num":35,"verse":"Now the Lord spoke to Moses in the plains of Moab, by the Jordan opposite Jericho, saying,"},{"num":2,"verse":"“Command the sons of Israel that they give to the Levites from the inheritance of their possession cities to live in; and you shall give to the Levites pasture lands around the cities."},{"num":3,"verse":"The cities shall be theirs to live in; and their pasture lands shall be for their cattle and for their equipment and for all their other animals."},{"num":4,"verse":"“The pasture lands of the cities which you are to give to the Levites shall extend from the wall of the city outward a thousand cubits around."},{"num":5,"verse":"You shall also measure outside the city on the east side two thousand cubits, on the south side two thousand cubits, on the west side two thousand cubits, and on the north side two thousand cubits, with the city in the center. This shall become theirs as pasture lands for the cities."},{"header":"Cities of Refuge"},{"num":6,"verse":"The cities which you shall give to the Levites shall be the six cities of refuge, which you shall provide for the one who commits manslaughter to flee to; and in addition to them you shall give forty-two cities."},{"num":7,"verse":"The total number of the cities which you are to give to the Levites shall be forty-eight cities, together with their pasture lands."},{"num":8,"verse":"As for the cities which you shall give them from the possession of the sons of Israel, you shall take more from the larger, and you shall take fewer from the smaller; each shall give some of his cities to the Levites in proportion to his inheritance which he possesses.”"},{"num":9,"verse":"Then the Lord spoke to Moses, saying,"},{"num":10,"verse":"“Speak to the sons of Israel and say to them, ‘When you cross the Jordan into the land of Canaan,"},{"num":11,"verse":"then you shall select for yourselves cities to be your cities of refuge, so that the one who commits manslaughter by killing a person unintentionally may flee there."},{"num":12,"verse":"The cities shall serve you as a refuge from the avenger, so that the one who commits manslaughter does not die until he stands before the congregation for trial."},{"num":13,"verse":"So the cities which you are to provide shall be six cities of refuge for you."},{"num":14,"verse":"You shall provide three cities across the Jordan, and three cities in the land of Canaan; they are to be cities of refuge."},{"num":15,"verse":"These six cities shall be a refuge for the sons of Israel, for the stranger, and for the foreign resident among them; so that anyone who kills a person unintentionally may flee there."},{"num":16,"verse":"‘But if he struck him with an iron object, so that he died, he is a murderer; the murderer must be put to death."},{"num":17,"verse":"And if he struck him with a stone in the hand, by which he would die, and as a result he did die, he is a murderer; the murderer must be put to death."},{"num":18,"verse":"Or if he struck him with a wooden object in the hand, by which he would die, and as a result he did die, he is a murderer; the murderer must be put to death."},{"num":19,"verse":"The blood avenger himself shall put the murderer to death; he himself shall put him to death when he meets him."},{"num":20,"verse":"Now if he pushed him in hatred, or he threw something at him with malicious intent, and as a result he died,"},{"num":21,"verse":"or if he struck him with his hand with hostility, and as a result he died, the one who struck him must be put to death; he is a murderer. The blood avenger shall put the murderer to death when he meets him."},{"num":22,"verse":"‘But if he pushed him suddenly, without hostility, or threw any object at him without malicious intent,"},{"num":23,"verse":"or had any deadly stone, and without looking he dropped it on him so that he died, while he was not his enemy nor was he seeking to harm him,"},{"num":24,"verse":"then the congregation shall judge between the one who fatally struck the victim and the blood avenger in accordance with these ordinances."},{"num":25,"verse":"And the congregation shall save the one who committed manslaughter from the hand of the blood avenger, and the congregation shall return him to his city of refuge to which he fled; and he shall live in it until the death of the high priest who was anointed with the holy oil."},{"num":26,"verse":"But if at any time he goes beyond the border of his city of refuge to which he flees,"},{"num":27,"verse":"and the blood avenger finds him outside the border of his city of refuge, and the blood avenger kills him, he will not be guilty of bloodshed,"},{"num":28,"verse":"because he should have remained in his city of refuge until the death of the high priest. But after the death of the high priest the one who committed manslaughter may return to the land of his property."},{"num":29,"verse":"‘These things shall be a statutory ordinance for you throughout your generations in all your dwelling places."},{"num":30,"verse":"‘If anyone kills a person, the murderer shall be put to death on the testimony of witnesses, but no person shall be put to death on the testimony of only one witness."},{"num":31,"verse":"Moreover, you shall not accept a ransom for the life of a murderer who is condemned to death, but he must be put to death."},{"num":32,"verse":"And you shall not accept a ransom for one who has fled to his city of refuge, so that he may return to live in the land before the death of the priest."},{"num":33,"verse":"So you shall not defile the land in which you live; for blood defiles the land, and no atonement can be made for the land for the blood that is shed on it, except by the blood of the one who shed it."},{"num":34,"verse":"So you shall not defile the land in which you live, in the midst of which I dwell; for I the Lord am dwelling in the midst of the sons of Israel.’”"}]