[{"header":"Cities for the Levites"},{"num":35,"verse":"Yahweh spoke to Moses on the plains of Moab near the Jordan River across from Jericho. He said, "},{"num":2,"verse":"“Tell the Israelites to give the Levites some cities from their own property. They must also give the Levites the pastureland around those cities. "},{"num":3,"verse":"Then the Levites will have cities to live in and pastureland for their cattle, the flocks they own, and any other animals they have."},{"num":4,"verse":"“The land around the cities that you give the Levites will extend 1,500 feet from the city wall. "},{"num":5,"verse":"Outside the city measure off 3,000 feet on the east side, 3,000 feet on the south side, 3,000 feet on the west side, and 3,000 feet on the north side, with the city in the center. This will be their pastureland around the city."},{"num":6,"verse":"“Six of the cities you give the Levites will be cities of refuge. You must allow murderers to escape to these cities. In addition, you must also give the Levites 42 other cities. "},{"num":7,"verse":"So you will give a total of 48 cities with pastureland to the Levites. "},{"num":8,"verse":"The cities you give the Levites from the property of the other Israelites must be given based on the amount of land each tribe owns. Take more cities from larger tribes and fewer from smaller tribes.”"},{"header":"Cities of Refuge"},{"num":9,"verse":"Yahweh said to Moses, "},{"num":10,"verse":"“Tell the Israelites: When you cross the Jordan River and enter Canaan, "},{"num":11,"verse":"select certain cities to be places of refuge. Anyone who unintentionally kills another person may run to them. "},{"num":12,"verse":"These cities will be places of refuge from any relative who can avenge the death. So anyone accused of murder will not have to die until he has had a trial in front of the community. "},{"num":13,"verse":"There will be six cities you select as places of refuge, "},{"num":14,"verse":"three on the east side of the Jordan River and three in Canaan. "},{"num":15,"verse":"These six cities will be places of refuge for Israelites, foreigners, and strangers among you. Anyone who unintentionally kills another person may flee to these cities."},{"num":16,"verse":"“But if any of you uses an iron weapon to kill another person, you are a murderer. Murderers must be put to death. "},{"num":17,"verse":"If any of you picks up a stone as a weapon and uses it to kill another person, you are a murderer. Murderers must be put to death. "},{"num":18,"verse":"Or if any of you picks up a piece of wood as a weapon and uses it to kill another person, you are a murderer. Murderers must be put to death. "},{"num":19,"verse":"The relative who can avenge the death must make sure a murderer is put to death. When he catches up with the murderer, he must kill him. "},{"num":20,"verse":"If any of you kills someone you hate by shoving him or by deliberately throwing something at him, "},{"num":21,"verse":"or if you beat your enemy to death with your bare hands, you must be put to death. You are a murderer. The relative who can avenge the death must kill you when he catches up with you, because you are a murderer."},{"num":22,"verse":"“But suppose you accidentally kill someone who wasn’t your enemy. Maybe you shoved him or threw something at him but didn’t mean to kill him. "},{"num":23,"verse":"Or suppose you drop a big stone, and someone is killed. However, you didn’t know the person was there, he wasn’t your enemy, and you weren’t trying to harm him. "},{"num":24,"verse":"Then the community must use these rules in order to decide if you are innocent or if the dead person’s relative can avenge the death. "},{"num":25,"verse":"If you are innocent, the community must protect you from that relative. They must take you back to the city of refuge you fled to. You must live there until the death of the high priest who was anointed with the holy oil."},{"num":26,"verse":"“But don’t go outside the city of refuge you fled to. "},{"num":27,"verse":"If the relative who can avenge the death finds you outside the city of refuge and kills you, the relative is not guilty of murder. "},{"num":28,"verse":"Accused murderers must stay in their city of refuge until the death of the high priest. They may go back to their own property only after his death."},{"num":29,"verse":"“These will be the rules for future generations wherever you live."},{"num":30,"verse":"“Whoever kills another person will be put to death as a murderer only on the testimony of more than one witness. No one can be put to death on the testimony of only one witness."},{"num":31,"verse":"“Never accept a cash payment in exchange for the life of a convicted murderer who has been given the death penalty. Murderers must be put to death."},{"num":32,"verse":"“An accused murderer who has fled to a city of refuge must never go back and live on his own land before the death of the high priest. Don’t accept a cash payment to allow him to do this."},{"num":33,"verse":"“You must not pollute the land where you live. Murder is what pollutes the land. The land where a murder was committed can never make peace with the Lord except through the death of the murderer. "},{"num":34,"verse":"Never make the land where you and I live unclean. I, Yahweh, live among the Israelites.”"}]