[{"num":28,"verse":"Achaz was twenty years old when he began his reign, and he ruled sixteen years in Yerushalayim. But he did not do what was right from the perspective of Adonai, as David his ancestor had done. "},{"num":2,"verse":"Rather, he lived in the manner of the kings of Isra’el and made cast metal images for the ba‘alim. "},{"num":3,"verse":"Moreover, he made offerings in the Ben-Hinnom Valley and even burned up his own children as sacrifices, in keeping with the horrible practices of the pagans, whom Adonai had thrown out ahead of the people of Isra’el. "},{"num":4,"verse":"He also sacrificed and offered on the high places, on the hills and under any green tree."},{"num":5,"verse":"Because of this, Adonai his God handed him over to the king of Aram; they attacked him and carried off from his people a great number of captives, bringing them to Dammesek."},{"num":6,"verse":"For Pekach the son of Remalyah killed in Y’hudah 120,000 men in one day, all of them brave men, because they had abandoned Adonai, the God of their ancestors. "},{"num":7,"verse":"And Zikhri, a champion from Efrayim, killed Ma‘aseiyah the king’s son, ‘Azrikam the administrator of the household and Elkanah, who was second only to the king. "},{"num":8,"verse":"The people of Isra’el took captive from their kinsmen 200,000 wives, sons and daughters; they also captured from them much spoil, which they brought to Shomron."},{"num":9,"verse":"But a prophet of Adonai named ‘Oded was there; he went out to meet the army coming to Shomron and said to them, “Look, it’s because Adonai the God of your fathers was angry with Y’hudah that he has handed them over to you, and you have slaughtered them in a fury that has reached up to heaven. "},{"num":10,"verse":"Now you intend to force the people from Y’hudah and Yerushalayim into subjection as your slaves; but haven’t you guilty deeds of your own that you committed against Adonai your God? "},{"num":11,"verse":"Therefore listen to me now; and send the captives back, the people you have taken captive from your kinsmen; because the fierce anger of Adonai is on you.”"},{"num":12,"verse":"At this, some of the leaders of the people of Efrayim — ‘Azaryahu the son of Y’hochanan, Berekhyahu the son of Meshilemot, Y’chizkiyah the son of Shalum and ‘Amasa the son of Hadlai — protested against those who were returning from the war, "},{"num":13,"verse":"saying to them, “Don’t bring the captives here, because you intend to do something that will bring guilt on us against Adonai. It will only add to our sins and guilt, for our guilt is great, and there is fierce anger against Isra’el.”"},{"num":14,"verse":"So the armed soldiers left the captives and the spoil there with the leaders and the whole community; "},{"num":15,"verse":"while the men named above took charge of the captives and from the spoil clothed those among them who were inadequately clothed, giving them garments and shoes, providing them food and drink and anointing them with oil. After placing all the weak among them on donkeys, they brought them to Yericho, the City of Date-Palms, to their kinsmen; only then did they return to Shomron."},{"num":16,"verse":"It was at that time that King Achaz sent to the kings of Ashur to help him. "},{"num":17,"verse":"For again the people from Edom had come, attacking Y’hudah and carrying off captives. "},{"num":18,"verse":"The P’lishtim too had invaded the cities in the Sh’felah and in the Negev of Y’hudah; they had captured Beit-Shemesh, Ayalon, G’derot, Sokho with its villages, Timnah with its villages and Gimzo with its villages; and they settled there. "},{"num":19,"verse":"For Adonai brought Y’hudah low because of Achaz king of Isra’el, since he had caused disturbances in Y’hudah and acted very treacherously against Adonai."},{"num":20,"verse":"Tilgat-Piln’eser king of Ashur attacked and besieged Achaz instead of strengthening him — "},{"num":21,"verse":"even though Achaz had stripped the house of Adonai and the palaces of the king and princes and had given the plunder to the king of Ashur, it didn’t help him at all."},{"num":22,"verse":"During his time of distress this same King Achaz added to his treachery against Adonai "},{"num":23,"verse":"by sacrificing to the gods of Dammesek, who had attacked him, reasoning, “The gods of the kings of Aram helped them, so I will sacrifice to them, and then they’ll help me.” But they became the ruin of him and of all Isra’el. "},{"num":24,"verse":"Achaz collected the equipment from the house of God, broke to pieces the equipment from the house of God and sealed the doors of the house of Adonai; then he made himself altars in every corner of Yerushalayim. "},{"num":25,"verse":"In every city of Y’hudah he made high places for offering to other gods, thus provoking Adonai the God of his ancestors."},{"num":26,"verse":"Other activities of Achaz and his ways [of doing things], from beginning to end, are recorded in the Annals of the Kings of Y’hudah and Isra’el. "},{"num":27,"verse":"Achaz slept with his ancestors, and they buried him in the city, in Yerushalayim; because they did not bring him to the tombs of the kings of Isra’el. Then Hizkiyahu his son took his place as king."}]