[{"header":"Ahaz King of Judah"},{"num":28,"verse":"Ahaz was 20 years old when he became king. He ruled in Jerusalem for 16 years. He didn’t do what was right in the eyes of the Lord. He didn’t do what King David had done. "},{"num":2,"verse":"He followed the ways of the kings of Israel. He also made statues of gods that were named Baal. "},{"num":3,"verse":"He burned sacrifices in the Valley of Ben Hinnom. He sacrificed his children in the fire to other gods. He followed the practices of the nations. The Lord hates these practices. The Lord had driven out those nations to make room for the people of Israel. "},{"num":4,"verse":"Ahaz offered sacrifices and burned incense at the high places. He also did it on the tops of hills and under every green tree."},{"num":5,"verse":"So the Lord his God handed him over to the king of Aram. The men of Aram won the battle over him. They took many of his people as prisoners. They brought them to Damascus."},{"num":6,"verse":"In one day Pekah, the son of Remaliah, killed 120,000 soldiers in Judah. That’s because Judah had deserted the Lord, the God of their people. "},{"num":7,"verse":"Zikri was a fighting man from Ephraim. He killed Maaseiah, Azrikam and Elkanah. Maaseiah was the king’s son. Azrikam was the officer who was in charge of the palace. And Elkanah was next in command after the king. "},{"num":8,"verse":"The men of Israel captured 200,000 wives, sons and daughters from their relatives in Judah. They also took a large amount of goods. They carried all of it back to Samaria."},{"num":9,"verse":"But a prophet of the Lord was there. His name was Oded. When the army returned to Samaria, he went out to meet them. He said to them, “The Lord is the God of your people. He was very angry with Judah. So he handed them over to you. But you have killed them. Your anger reached all the way to heaven. "},{"num":10,"verse":"Now you are planning to make the men and women of Judah and Jerusalem your slaves. But aren’t you also guilty of sins against the Lord your God? "},{"num":11,"verse":"Listen to me! You have taken your relatives from Judah as prisoners. The Lord is very angry with you. So send your relatives back.”"},{"num":12,"verse":"Then some of the leaders in Ephraim stood up to those who were returning from the war. The leaders were Azariah, Berekiah, Jehizkiah and Amasa. Azariah was the son of Jehohanan. Berekiah was the son of Meshillemoth. Jehizkiah was the son of Shallum. And Amasa was the son of Hadlai. "},{"num":13,"verse":"“Don’t bring those prisoners here,” they said. “If you do, we’ll be guilty in the sight of the Lord. Do you really want to add to our sin and guilt? We’re already very guilty. The Lord is very angry with Israel.”"},{"num":14,"verse":"So the soldiers gave up the prisoners and the goods they had taken. They did it in front of the officials and the whole community. "},{"num":15,"verse":"Azariah, Berekiah, Jehizkiah and Amasa received the prisoners. From the goods that had been taken, they gave clothes to everyone who was naked. They gave them clothes, sandals, food, drink and healing lotion. They put all the weak people on donkeys. They took them back to their relatives at Jericho. Then they returned to Samaria. Jericho was also known as the City of Palm Trees."},{"num":16,"verse":"At that time King Ahaz sent men to the king of Assyria to get help. "},{"num":17,"verse":"The men of Edom had come and attacked Judah again. They had carried away prisoners. "},{"num":18,"verse":"At the same time the Philistines had attacked towns in the western hills and in the Negev Desert of Judah. They had captured Beth Shemesh, Aijalon and Gederoth. They had also captured Soko, Timnah and Gimzo and the villages around them. They had settled down in all of them. "},{"num":19,"verse":"The Lord had made Judah less powerful because of Ahaz, their king. Ahaz had stirred up the people of Judah to do evil things. He hadn’t been faithful to the Lord at all. "},{"num":20,"verse":"Tiglath-Pileser came to Ahaz. But he gave Ahaz trouble instead of help. Tiglath-Pileser was king of Assyria. "},{"num":21,"verse":"Ahaz took some things from the Lord’s temple. He also took some from the royal palace and from the officials. He gave all of them to the king of Assyria. But that didn’t help Ahaz."},{"num":22,"verse":"When King Ahaz was in trouble, he became even more unfaithful to the Lord. "},{"num":23,"verse":"Ahaz offered sacrifices to the gods of Damascus. They had won the battle over him. Ahaz thought, “The gods of the kings of Aram have helped them. So I’ll sacrifice to those gods. Then they’ll help me.” But those gods only caused his ruin. In fact, those gods caused the ruin of the whole nation of Israel."},{"num":24,"verse":"Ahaz gathered together everything that belonged to God’s temple. He cut all of it in pieces. Ahaz shut the doors of the Lord’s temple. He set up altars at every street corner in Jerusalem. "},{"num":25,"verse":"In every town in Judah he built high places. Sacrifices were burned there to other gods. That made the Lord, the God of his people, very angry."},{"num":26,"verse":"The other events of the rule of Ahaz and all his evil practices from beginning to end are written down. They are written in the records of the kings of Judah and Israel. "},{"num":27,"verse":"Ahaz joined the members of his family who had already died. He was buried in the city of Jerusalem. But he wasn’t placed in the tombs of the kings of Israel. Ahaz’s son Hezekiah became the next king after him."}]