[{"header":"Ahaz Rules Judah"},{"num":28,"verse":"Ahaz was twenty years old when he became king. And he ruled for sixteen years in Jerusalem. He did not do what was right in the eyes of the Lord, as his father David had done. "},{"num":2,"verse":"But he walked in the ways of the kings of Israel. He also made objects to look like the false gods of Baal. "},{"num":3,"verse":"He burned special perfume in the valley of Ben-Hinnom. And he burned his sons in fire, following the hated ways of the nations whom the Lord had driven out before the sons of Israel. "},{"num":4,"verse":"He gave gifts in worship and burned special perfume on the high places, on the hills, and under every green tree."},{"header":"Syria and Israel Win over Judah"},{"num":5,"verse":"So the Lord his God gave him into the hand of the king of Syria. The Syrians won the war against Ahaz and carried away many of his people to Damascus. He was also given into the hand of the king of Israel, who killed many of his people in the war. "},{"num":6,"verse":"For Pekah the son of Remaliah killed 120,000 powerful soldiers of Judah in one day, because they had turned away from the Lord God of their fathers. "},{"num":7,"verse":"And Zichri, a strong man of Ephraim, killed the king’s son Maaseiah, and Azrikam the ruler of the house, and Elkanah the second in power to the king."},{"header":"Oded—the Man of God"},{"num":8,"verse":"The sons of Israel carried away 200,000 women and sons and daughters of Judah. They also took many good things from them to Samaria. "},{"num":9,"verse":"But a man who spoke for the Lord was there, whose name was Oded. He went out to meet the army that came to Samaria and said to them, “See, because the Lord, the God of your fathers, was angry with Judah, He has given them into your hand. But you have killed them in an anger which has even gone up to heaven. "},{"num":10,"verse":"And now you plan to make the men and women of Judah and Jerusalem work hard for you. Do you not have sins of your own against the Lord your God? "},{"num":11,"verse":"Now listen to me. Return the people whom you have taken from your brothers. For the burning anger of the Lord is against you.” "},{"num":12,"verse":"Then some of the leaders of the sons of Ephraim stood up against those who were coming from the battle. These leaders were Azariah the son of Johanan, Berechiah the son of Meshillemoth, Jehizkiah the son of Shallum, and Amasa the son of Hadlai. "},{"num":13,"verse":"They said, “You must not bring the people in here. For you plan to bring guilt upon us against the Lord, adding to our sins and our guilt. We are already so guilty that His burning anger is against Israel.” "},{"num":14,"verse":"So the men of war left the people and things taken from Judah in front of the leaders and all the people of Israel. "},{"num":15,"verse":"Then the men who were chosen by name came and took the people of Judah. And they gave clothing to all of them who had none, using the clothes found among the things taken from Judah. They gave them clothes and shoes, and food and drink, and poured oil on them. They led all their weak ones on donkeys, and brought them to their brothers at Jericho, the city of palm trees. Then they returned to Samaria."},{"num":16,"verse":"At that time King Ahaz sent to the king of Assyria for help. "},{"num":17,"verse":"For the Edomites had come to fight Judah again, and carried people away. "},{"num":18,"verse":"The Philistines also had come to fight against the cities of the valley and of the Negev of Judah. They had taken Beth-shemesh, Aijalon, Gederoth, Soco with its villages, Timnah with its villages, and Gimzo with its villages. And they came to live there. "},{"num":19,"verse":"For the Lord brought trouble to Judah because of King Ahaz of Israel. Ahaz caused the people of Judah to sin and was not faithful to the Lord. "},{"num":20,"verse":"So King Tilgath-pilneser of Assyria came against him and brought him trouble instead of strength. "},{"num":21,"verse":"Ahaz took riches from the house of the Lord and from the house of the king and of the princes, and gave them to the king of Assyria. But it did not help him."},{"header":"The Sins and Death of Ahaz"},{"num":22,"verse":"In the time of his trouble, this same King Ahaz became even less faithful to the Lord. "},{"num":23,"verse":"For he gave gifts on the altar to the gods of Damascus who had beaten him in battle. He said, “Because the gods of the kings of Syria helped them, I will give gifts to them so they may help me.” But they were what destroyed him and all Israel. "},{"num":24,"verse":"Ahaz gathered together the objects of the house of God and cut them in pieces. Then he closed the doors of the Lord’s house, and made altars for himself in every corner of Jerusalem. "},{"num":25,"verse":"In every city of Judah he made high places to burn special perfume to other gods. And he made the Lord, the God of his fathers, very angry. "},{"num":26,"verse":"Now the rest of his acts and all his ways, from first to last, are written in the Book of the Kings of Judah and Israel. "},{"num":27,"verse":"Ahaz died, and they buried him in the city of Jerusalem. They did not bring him into the graves of the kings of Israel. And Hezekiah his son ruled in his place."}]