[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall the ax boast itself . . .?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words spoken by the prophet as the mouthpiece of Jehovah remind us of the way in which Christian writers of the fifth century spoke of Attila as “the scourge of God.” There was comfort in that thought for the nations that were scourged. The man’s lust for power might be limitless, but there was the limit of the compassion and longsuffering of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As if the rod should shake itself against them that lift it up.—Better, As if the rod should shake them. The plural is used either as generalising the comparison, or more probably as suggesting the thought that Elohim (God) is the true wielder of the rod. (Comp. Isaiah 10:5.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As if the rod should shake itself against them that lift it up.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "As if the rod should shake them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The plural is used either as generalising the comparison, or more probably as suggesting the thought that Elohim (God) is the true wielder of the rod. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "As if the staff should lift up itself, as if it were no wood.—The multiplied italics show that the translators found the clause difficult. Better and more simply, As if the staff should lift that which is not wood, i.e., the living arm that holds it. Was it for the king of Assyria to assume that he could alter and determine the purposes of Jehovah? Did the man wield the rod, or the rod the man?",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As if the staff should lift up itself, as if it were no wood.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The multiplied italics show that the translators found the clause difficult. Better and more simply, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "As if the staff should lift that which is not wood, i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the living arm that holds it. Was it for the king of Assyria to assume that he could alter and determine the purposes of Jehovah? Did the man wield the rod, or the rod the man?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 10:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall the axe boast itself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — How absurd is it for thee, who art but an instrument in God’s hand, to blaspheme thy Lord and Master, who has as great power over thee as a man hath over the axe wherewith he heweth? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As if the rod, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — See the margin; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or, as if the staff, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Should forget that it was wood, and should pretend, or attempt, to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lift up itself ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Either without, or against the man that moveth it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As if it were no wood ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Literally translated, it is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As if the staff should lift up no wood; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, should lift up man, who is very different from wood: as if the staff should lift the man instead of the man lifting the staff. In this way does the prophet refute the vain boasts of the Assyrian, and teach him, that, “in all his counsels, motions, and works, he was but the minister of the Divine Providence; incapable of doing any thing without the divine will and permission; and therefore his boasting was to be considered in no other light than as if the axe, or saw, or rod, should magnify themselves against him who handled them, and should ascribe to themselves that effect which was only caused by the mover.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:5-19 See what a change sin made. The king of Assyria, in his pride, thought to act by his own will. The tyrants of the world are tools of Providence. God designs to correct his people for their hypocrisy, and bring them nearer to him; but is that Sennacherib's design? No; he designs to gratify his own covetousness and ambition. The Assyrian boasts what great things he has done to other nations, by his own policy and power. He knows not that it is God who makes him what he is, and puts the staff into his hand. He had done all this with ease; none moved the wing, or cried as birds do when their nests are rifled. Because he conquered Samaria, he thinks Jerusalem would fall of course. It was lamentable that Jerusalem should have set up graven images, and we cannot wonder that she was excelled in them by the heathen. But is it not equally foolish for Christians to emulate the people of the world in vanities, instead of keeping to things which are their special honour? For a tool to boast, or to strive against him that formed it, would not be more out of the way, than for Sennacherib to vaunt himself against Jehovah. When God brings his people into trouble, it is to bring sin to their remembrance, and humble them, and to awaken them to a sense of their duty; this must be the fruit, even the taking away of sin. When these points are gained by the affliction, it shall be removed in mercy. This attempt upon Zion and Jerusalem should come to nothing. God will be as a fire to consume the workers of iniquity, both soul and body. The desolation should be as when a standard-bearer fainteth, and those who follow are put to confusion. Who is able to stand before this great and holy Lord God?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall the axe ... - In this verse God reproves the pride and arrogance of the Assyrian monarch. He does it by reminding him that he was the mere instrument in his hand, to accomplish his purposes; and that it was just as absurd for him to boast of what he had done, as it would be for the axe to boast when it had been welded with effect. In the axe there is no wisdom, no skill, no power; and though it may lay the forest low, yet it is not by any skill or power which it possesses. So with the Assyrian monarch. Though nations had trembled at his power, yet be was in the hand of God, and had been directed by an unseen arm in accomplishing the designs of the Ruler of the universe. Though himself free, yet he was under the direction of God, and had been so directed as to accomplish his designs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The saw magnify itself - That is boast or exalt itself against or over him that uses it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That shaketh it - Or moves it backward and forward, for the purpose of sawing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As if the rod - A rod is an instrument of chastisement or punishment; and such God regarded the king of Assyria.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Should shake\" itself ... - The Hebrew, in this place, is as in the margin: 'A rod should shake them that lift it up.' But the sense is evidently retained in our translation, as this accords with all the other members of the verse, where the leading idea is, the absurdity that a mere instrument should exalt itself against him who makes use of it. In this manner the preposition על  ‛al \"over,\" or \"against,\" is evidently understood. So the Vulgate and the Syriac.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The staff - This word here is synonymous with rod, and denotes an instrument of chastisement.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As if it were no wood - That is, as if it were a moral agent, itself the actor or deviser of what it is made to do. It would be impossible to express more strongly the idea intended here, that the Assyrian was a mere instrument in the hand of God to accomplish \"his\" purposes, and to be employed at his will. The statement of this truth is designed to humble him: and if there be \"any\" truth that will humble sinners, it is, that they are in the hands of God; that he will accomplish his purposes by them; that when they are laying plans against him, he will overrule them for his own glory; and that they will be arrested, restrained, or directed, just as he pleases. Man, in his schemes of pride and vanity, therefore, should not boast. He is under the God of nations; and it is one part of his administration, to control and govern all the intellect in the universe. In all these passages, however, there is not the slightest intimation that the Assyrian was not \"free.\" There is no fate; no compulsion. He regarded himself as a free moral agent; he did what he pleased; he never supposed that he was urged on by any power that violated his own liberty. If he did what he pleased, he was free. And so it is with all sinners. They do as they please. They form and execute such plans as they choose; and God overrules their designs to accomplish his own purposes. The Targum of Jonathan has given the sense of this passage; 'Shall the axe boast against him who uses it, saying, I have cut (wood); or the saw boast against him who moves it, saying, I have sawed? When the rod is raised to smite, it is not the rod that smites, but he who smites with it.' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As if it were no wood - That is, as if it were a moral agent, itself the actor or deviser of what it is made to do. It would be impossible to express more strongly the idea intended here, that the Assyrian was a mere instrument in the hand of God to accomplish \"his\" purposes, and to be employed at his will. The statement of this truth is designed to humble him: and if there be \"any\" truth that will humble sinners, it is, that they are in the hands of God; that he will accomplish his purposes by them; that when they are laying plans against him, he will overrule them for his own glory; and that they will be arrested, restrained, or directed, just as he pleases. Man, in his schemes of pride and vanity, therefore, should not boast. He is under the God of nations; and it is one part of his administration, to control and govern all the intellect in the universe. In all these passages, however, there is not the slightest intimation that the Assyrian was not \"free.\" There is no fate; no compulsion. He regarded himself as a free moral agent; he did what he pleased; he never supposed that he was urged on by any power that violated his own liberty. If he did what he pleased, he was free. And so it is with all sinners. They do as they please. They form and execute such plans as they choose; and God overrules their designs to accomplish his own purposes. The Targum of Jonathan has given the sense of this passage; 'Shall the axe boast against him who uses it, saying, I have cut (wood); or the saw boast against him who moves it, saying, I have sawed? When the rod is raised to smite, it is not the rod that smites, but he who smites with it.' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. Shall the instrument boast against Him who uses it? Through free in a sense, and carrying out his own plans, the Assyrian was unconsciously carrying out God's purposes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shaketh it—moves it back and forward.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "staff … lift … itself … no wood—rather, \"as if the staff (man, the instrument of God's judgments on his fellow man) should set aside (Him who is) not wood\" (not a mere instrument, as man). On \"no wood\" compare De 32:21, \"that which is not God;\" Isa 31:8 shows that God is meant here by \"not wood\" [Maurer].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall the axe boast itself against him that heweth therewith?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How absurd and unreasonable a thing is it for thee, who art but an instrument in God’s hand, and canst do nothing without his leave and help, to blaspheme thy Lord and Master, who hath as great a power over thee, to manage thee as he pleaseth, as a man hath over the axe wherewith he heweth! ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As if the rod should shake itself against them that lift it up; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, as it is rendered in the margin, and by other interpreters, as if a rod should shake (i.e. shall pretend to shake, or should boast that it would or could shake; which may easily be understood out of the foregoing words) them ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that lift it up. As if the staff should lift up itself, as if it were no wood; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as if a staff should forget that it was wood, and should pretend or attempt to lift up itself either without or against the man that moveth it; which is absurd in the very supposition of it, and were much more unreasonable in the practice. Nor are thy boasts less ridiculous. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall the axe boast itself against him that heweth therewith?.... Hitherto are the words of the Assyrian monarch; and here begin the words of the prophet, rebuking him for his pride, and deriding his vain boasting, in attributing that to himself, to his wisdom and power, who was but an instrument, which belonged to God, the sole Governor and wise orderer of all things; which was all one as if an axe should ascribe the cutting down of trees to itself, and insist on it that the man that cut with it had no share in the action, nor was it to be ascribed to him; than which nothing is more absurd. The sense is, that the king of Assyria, in taking cities, and conquering kingdoms, and adding them to his own, was only an instrument in the hand of God, like an axe in the hand of one that hews down trees; and therefore it was vain and ridiculous to take that to himself which belonged to the Lord, on whom he depended as an instrument, as to motion, operation, and effect; from whom he had all power to act, all fitness for it, and efficacy in it, as the axe has from the person that makes and uses it, or any other instrument, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or shall the saw magnify itself against him that shaketh it? or draws it to and fro; which is the sense of the Targum, Septuagint, and Vulgate Latin versions, and others; and which further exposes the vanity and arrogance of the Assyrian monarch, who had no more concern in the spoiling of nations, and destruction of kingdoms, than the saw has in cutting of timber that is hewn; which has its form, its sharp teeth, not of itself, but from the maker; and when thus made, and fit for use, cannot draw itself to and fro, and cut trees in pieces, which are felled by the axe, but must be moved by another; and to insult the mover of it, as if it was not his act, but its own, is not more absurd than what this haughty prince was guilty of, in boasting of his power, wisdom, and prudence, in the above mentioned things: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as if the rod should shake itself against them that lift it up (m); for such was the king of Assyria, he was no other than the rod of the Lord's anger, Isaiah 10:5 and which he lifted up, and with it chastised his people; wherefore for him to behave haughtily against the Lord, and arrogate that to himself which was the Lord's doing, was as if a rod should shake itself against him that lifts it up; or, \"as if a rod should shake those that lift it up\": as if there were more power in the rod than in them that take it up and strike with it; yea, that even the rod moves them, and not they the rod, which is wretchedly absurd: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "as if the rod should shake itself against them that lift it up (m); for such was the king of Assyria, he was no other than the rod of the Lord's anger, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and which he lifted up, and with it chastised his people; wherefore for him to behave haughtily against the Lord, and arrogate that to himself which was the Lord's doing, was as if a rod should shake itself against him that lifts it up; or, \"as if a rod should shake those that lift it up\": as if there were more power in the rod than in them that take it up and strike with it; yea, that even the rod moves them, and not they the rod, which is wretchedly absurd: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "or, as if the staff should lift up itself, as if it were no wood (n); but something more than wood, an animate creature, a rational agent, whereas it is nothing else but wood; or \"as if a staff should lift up\" itself against that which is \"not wood\", like itself, but is a man, that can move himself and that too; or \"as if a staff should lift up\" that which is \"not wood\"; attempt to bear, carry, move, and direct that which is not material like itself, but is a Spirit, infinite, eternal, even the almighty God. De Dieu thinks that is not a verb, but a noun of the plural number, of  \"a mountain\": and renders it, \"as if a rod should shake those that lift it up: and as if a staff were mountains, and not wood\". The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"when a rod is lifted up to smite, it is not the rod that smites, but he that smites with it.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sense is, that the Assyrian monarch was only a rod and staff in the hand of the Lord, and only moved and acted as used by him; whereas, according to his vain boast, he was the sole agent, and all was done by his own power and prudence; and was so far from being moved and directed by the power and providence of God, that he was the director of him; which is infinitely more absurd than the things instanced in. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Ben Melech observes, that this is to be understood of the blessed God; and the word being in the plural number, it is the same way, of speaking as in Joshua 24.19. \"the Holy Gods is he\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Ben Melech observes, that this is to be understood of the blessed God; and the word being in the plural number, it is the same way, of speaking as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".19. \"the Holy Gods is he\". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Gussetius thinks this clause contains an ironical answer to the above questions, \"shall the axe boast itself?\" &c.; \"shall the saw magnify itself?\" &c.; they should, \"as the rod should shake itself\" &c.; just in like manner as that does, and so by lifting up itself, ceases to be wood; and which being sarcastically spoken, carries in it a strong negative, that the axe and saw should not glory, or magnify themselves, and no more should the king of Assyria. Vid. Comment. Ebr. p. 360. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Gussetius thinks this clause contains an ironical answer to the above questions, \"shall the axe boast itself?\" &c.; \"shall the saw magnify itself?\" &c.; they should, \"as the rod should shake itself\" &c.; just in like manner as that does, and so by lifting up itself, ceases to be wood; and which being sarcastically spoken, carries in it a strong negative, that the axe and saw should not glory, or magnify themselves, and no more should the king of Assyria. Vid. Comment. Ebr. p. 360. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Shall the {k} axe boast itself against him that heweth with it? or shall the saw magnify itself against him that moveth it? as if the rod should shake itself against them that lift it, or as if the staff should lift itself, as if it were no wood.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " axe boast itself against him that heweth with it? ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "or",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shall the saw magnify itself against him that moveth it? as if the rod should shake ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "itself",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " against them that lift it, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "or",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as if the staff should lift ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "itself, as if it were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no wood.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Here we see that no creature is able to do anything, but as God appoints him, and that they are all his instruments to do his work though the intentions are diverse, as in Isa 10:6.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To a believer in the divine government of the world the self-exaltation of Assyria is as ludicrous as if a tool were to vaunt itself against the man who uses it. The two last clauses are exclamations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "against ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them that lift it up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A plural of majesty, indicating that Jehovah is meant. Some Hebrew MSS., however, have the singular.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should lift up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " itself, as if it were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no wood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "should lift up not-wood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (See R.V.) “Not-wood” is a compound noun like “not-man” in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 31:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “one who is not wood” i.e. a man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall the axe boast itself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? Here the prophet takes the word, and rebukes Assyria for her folly in forgetting, or not perceiving, that she is a mere instrument, like an axe, a saw, a rod, or a stuff. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The saw... him that shaketh it;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "him that moveth it to and fro",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The action of sawing is alluded to. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As if the rod should shake itself against them that lift it up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as if a rod were to move them to and fro that lift it up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For Assyria to assert herself as if she were independent of God is like a rod attempting to sway the hand that holds it. It is a complete inversion of the natural order of things. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Or as if the staff should lift up itself, as if it were no wood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "or as if d staff should lift up that which is not wood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"as if a staff should take action and lift up its holder, who is not wood, but flesh and blood.\" Isaiah 10:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This self-exaltation was a foolish sin. \"Dare the axe boast itself against him that heweth therewith, or the saw magnify itself against him that useth it? As if a staff were to swing those that lift it up, as if a stick should lift up not-wood!\" \"Not-wood\" is to be taken as one word, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 31:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A stick is wood, and nothing more; in itself it is an absolutely motionless thing. A man is \"not-wood,\" an incomparably higher, living being. As there must be \"not-wood\" to lay hold of wood, so, wherever a man performs extraordinary deeds, there is always a superhuman cause behind, viz., God Himself, who bears the same relation to the man as the man to the wood. The boasting of the Assyrian was like the bragging of an instrument, such as an axe, a saw, or a stick, against the person using it. The verb hēnı̄ph is applied both to saw and stick, indicating the oscillating movements of a measured and more or less obvious character. The plural, \"those that lift it up,\" points to the fact that by Him who lifts up the stock, Jehovah, the cause of all causes, and power of all powers, is intended. ",
        "children": []
      }
    ]
  }
]