[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Both soul and body.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the soul even to the flesh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The metaphor is for a moment dropped, and the reality is unveiled.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As when a standardbearer fainteth.—The Authorised version represents the extremity of misery and exhaustion. The “standard-bearer” was chosen for his heroic strength and stature. When he “fainted” and gave way, what hope was there that others would survive? A more correct rendering, however, gives As a sick man pineth away.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As when a standardbearer fainteth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Authorised version represents the extremity of misery and exhaustion. The “standard-bearer” was chosen for his heroic strength and stature. When he “fainted” and gave way, what hope was there that others would survive? A more correct rendering, however, gives ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "As a sick man pineth away.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:5-19 See what a change sin made. The king of Assyria, in his pride, thought to act by his own will. The tyrants of the world are tools of Providence. God designs to correct his people for their hypocrisy, and bring them nearer to him; but is that Sennacherib's design? No; he designs to gratify his own covetousness and ambition. The Assyrian boasts what great things he has done to other nations, by his own policy and power. He knows not that it is God who makes him what he is, and puts the staff into his hand. He had done all this with ease; none moved the wing, or cried as birds do when their nests are rifled. Because he conquered Samaria, he thinks Jerusalem would fall of course. It was lamentable that Jerusalem should have set up graven images, and we cannot wonder that she was excelled in them by the heathen. But is it not equally foolish for Christians to emulate the people of the world in vanities, instead of keeping to things which are their special honour? For a tool to boast, or to strive against him that formed it, would not be more out of the way, than for Sennacherib to vaunt himself against Jehovah. When God brings his people into trouble, it is to bring sin to their remembrance, and humble them, and to awaken them to a sense of their duty; this must be the fruit, even the taking away of sin. When these points are gained by the affliction, it shall be removed in mercy. This attempt upon Zion and Jerusalem should come to nothing. God will be as a fire to consume the workers of iniquity, both soul and body. The desolation should be as when a standard-bearer fainteth, and those who follow are put to confusion. Who is able to stand before this great and holy Lord God?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The glory of his forest - In these expressions, the army of Sennacherib is compared with a beautiful grove thick set with trees; and as all the beauty of a grove which the fire overruns is destroyed, so, says the prophet, it will be with the army of the Assyrian under the judgments of God. If the 'briers and thorns' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refer to the common soldiers of his army, then the glory of the forest - the tall, majestic trees - refer to the princes and nobles. But this mode of interpretation should not be pressed too far.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And of his fruitful field - וכרמלו  vekaremilô. The word used here - \"carmel\" - is applied commonly to a rich mountain or promontory on the Mediterranean, on the southern boundary of the tribe of Asher. The word, however, properly means a fruitful field, a finely cultivated country, and Was given to Mount Carmel on this account, In this place it has no reference to that mountain, but is given to the army of Sennacherib to \"keep up the figure\" which the prophet commenced in Isaiah 10:17. That army, numerous, mighty, and well disciplined, was compared to an extensive region of hill and vale; of forests and fruitful fields; but it should all be destroyed as when the fire runs over fields and forests, and consumes all their beauty. Perhaps in all this, there may be allusion to the proud boast of Sennacherib 2 Kings 19:23, that he would 'go up the sides of Lebanon, and cut down the cedars thereof, and the choice fir-trees thereof', and enter into the forest of Carmel.' In allusion, possibly, to this, the prophet says that God would cut down the tall trees and desolate the fruitful field - the 'carmel' of his army, and would lay all waste.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And of his fruitful field - וכרמלו  vekaremilô. The word used here - \"carmel\" - is applied commonly to a rich mountain or promontory on the Mediterranean, on the southern boundary of the tribe of Asher. The word, however, properly means a fruitful field, a finely cultivated country, and Was given to Mount Carmel on this account, In this place it has no reference to that mountain, but is given to the army of Sennacherib to \"keep up the figure\" which the prophet commenced in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That army, numerous, mighty, and well disciplined, was compared to an extensive region of hill and vale; of forests and fruitful fields; but it should all be destroyed as when the fire runs over fields and forests, and consumes all their beauty. Perhaps in all this, there may be allusion to the proud boast of Sennacherib ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 19:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that he would 'go up the sides of Lebanon, and cut down the cedars thereof, and the choice fir-trees thereof', and enter into the forest of Carmel.' In allusion, possibly, to this, the prophet says that God would cut down the tall trees and desolate the fruitful field - the 'carmel' of his army, and would lay all waste.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Both soul and body - Hebrew, 'From the soul to the flesh;' that is, entirely. As the soul and the flesh, or body, compose the entire man, so the phrase denotes the entireness or totality of anything. The army would be totally ruined.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And they shall be as when a standard-bearer fainteth - There is here a great variety of interpretation. The Septuagint reads it: 'And he shall flee as one that flees from a burning flame.' This reading Lowth has followed; but for this there is not the slightest authority in the Hebrew. The Vulgate reads it, 'And he shall fly for terror, \"et crit terrore profugus.\" The Chaldee, 'And he shall be broken, and shall fly.' The Syriac, 'And he shall be as if he had never been.' Probably the correct idea is, \"and they shall be as when a sick man wastes away.\" The words which are used (נסס כמסס  kı̂mesos nosēs) are brought together for the sake of a paranomasia - a figure of speech common in the Hebrew. The word rendered in our version \"fainteth\" (מסס  mesos) is probably the infinitive construct of the verb מסס  mâsas, \"to melt, dissolve, faint.\" It is applied to the manna that was dissolved by the heat of the sun, Exodus 16:21; to wax melted by the fire, Psalm 68:2; to a snail that consumes away, Psalm 58:8; or to water that evaporates, Psalm 58:7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And they shall be as when a standard-bearer fainteth - There is here a great variety of interpretation. The Septuagint reads it: 'And he shall flee as one that flees from a burning flame.' This reading Lowth has followed; but for this there is not the slightest authority in the Hebrew. The Vulgate reads it, 'And he shall fly for terror, \"et crit terrore profugus.\" The Chaldee, 'And he shall be broken, and shall fly.' The Syriac, 'And he shall be as if he had never been.' Probably the correct idea is, \"and they shall be as when a sick man wastes away.\" The words which are used (נסס כמסס  kı̂mesos nosēs) are brought together for the sake of a paranomasia - a figure of speech common in the Hebrew. The word rendered in our version \"fainteth\" (מסס  mesos) is probably the infinitive construct of the verb מסס  mâsas, \"to melt, dissolve, faint.\" It is applied to the manna that was dissolved by the heat of the sun, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to wax melted by the fire, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to a snail that consumes away, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 58:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or to water that evaporates, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 58:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Hence, it is applied to the heart, exhausted of its vigor and spirit, Job 7:5; to things decayed that have lost their strength, 1 Samuel 15:9; to a loan or tax laid upon a people that wastes and exhausts their wealth. It has the general notion, therefore, of melting, fainting, sinking away with the loss of strength; Psalm 22:14; Psalm 112:10; Psalm 97:5; Isaiah 19:1; Isaiah 13:7; Joshua 2:11; Joshua 5:1; Joshua 7:5. The word rendered \"standard-bearer\" (נסס  nosēs) is from the verb נסס  nāsas. This word signifies sometimes \"to lift up,\" to elevate, or to erect a flag or standard to public view, to call men to arms; Isaiah 5:26; Isaiah 11:10, Isaiah 11:12; Isaiah 13:2; Isaiah 18:3; Isaiah 49:22; and also to lift up, or to exhibit anything as a judgment or public warning, and may thus be applied to divine judgments. Gesenius renders the verb, \"to waste away, to be sick.\" In Syriac it has this signification. Taylor (\"Heb. Con.\") says, that it does not appear that this word ever has the signification of a military standard under which armies fight, but refers to a standard or ensign to \"call\" men together, or to indicate alarm and danger. The probable signification here, is that which refers it to a man wasting away with sickness, whose strength and vigor are gone, and who becomes weak and helpless. Thus applied to the Assyrian army, it is very striking. Though mighty, confident, and vigorous-like a man in full health - yet it would be like a vigorous man when disease comes upon him, and he pines away and sinks to the grave. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hence, it is applied to the heart, exhausted of its vigor and spirit, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to things decayed that have lost their strength, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 15:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to a loan or tax laid upon a people that wastes and exhausts their wealth. It has the general notion, therefore, of melting, fainting, sinking away with the loss of strength; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 112:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 97:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 19:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 7:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word rendered \"standard-bearer\" (נסס  nosēs) is from the verb נסס  nāsas. This word signifies sometimes \"to lift up,\" to elevate, or to erect a flag or standard to public view, to call men to arms; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 18:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and also to lift up, or to exhibit anything as a judgment or public warning, and may thus be applied to divine judgments. Gesenius renders the verb, \"to waste away, to be sick.\" In Syriac it has this signification. Taylor (\"Heb. Con.\") says, that it does not appear that this word ever has the signification of a military standard under which armies fight, but refers to a standard or ensign to \"call\" men together, or to indicate alarm and danger. The probable signification here, is that which refers it to a man wasting away with sickness, whose strength and vigor are gone, and who becomes weak and helpless. Thus applied to the Assyrian army, it is very striking. Though mighty, confident, and vigorous-like a man in full health - yet it would be like a vigorous man when disease comes upon him, and he pines away and sinks to the grave. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. glory of his forest—The common soldiers, the princes, officers, &c., all alike together, shall be consumed (see on [701]Isa 9:18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in one day—(Isa 37:36).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fruitful field—literally, \"Carmel,\" a rich mountain in the tribe of Asher. Figurative for Sennacherib's mighty army. Perhaps alluding to his own boasting words about to be uttered (Isa 37:24), \"I will enter the forest of his Carmel.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "soul and body—proverbial for utterly; the entire man is made up of soul and body.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as when a standard bearer fainteth—rather, \"they shall be as when a sick man\" (from a Syriac root) wastes away.\" Compare \"leanness,\" that is, wasting destruction (Isa 10:16) [Maurer]. Or, \"there shall be an entire dissipation, like a perfect melting\" (namely, of the Assyrian army) [Horsley].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of his forrest; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of his great army, which may not unfitly be compared to a forest, either for the multitude of their spears, which, when lifted up together, resemble the trees of a wood or forest; or for the numbers of men, which stood as thick as trees do in a forest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Of his fruitful field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; of his soldiers, which stood as thick as ears of corn do in a fruitful field. Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of his Carmel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; wherein it is not improbably conjectured by our late most learned Mr. Gataker, that there is an allusion to that brag of the Assyrian, who threatens that he would ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "go up to the sides of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Israel’s) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lebanon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the forest of his Carmel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cut down the tall cedars thereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": which though it was not uttered by the Assyrian till some years after this time, yet was exactly foreknown to God, who ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "understandeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " men’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thoughts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and much more their words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "afar off",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 139:2-4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:2-4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and therefore might direct the prophet to use the same words, and to turn them against himself; Whereas thou threatenest to destroy Israel’s Carmel, I will destroy thy Carmel ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Both soul and body, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. totally, both inwardly and outwardly, both strength and life. Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the soul to the flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which may possibly signify the manner of their death, which should be by a sudden stroke of the destroying angel upon their inward and vital parts, which was speedily followed by the consumption of their flesh. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 37:35,36",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",36",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the state of that king, and of his great and valiant army, shall be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "as when a standard-bearer fainteth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " like that of an army when their standard-bearer either is slain, or rather flees away, which strikes a panic terror into the whole army, and puts them to flight. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And shall consume the glory of his forest,.... The Assyrian army is compared to a \"forest\", for the number of men in it; and for the mighty men in it, comparable to large and tall trees, such as oaks and cedars; and like a wood or forest a numerous army looks, when in rank and file, in proper order, and with banners, and having on their armour, their shields, spears, bows and arrows; and the \"glory\" of it intends either the princes and nobles that were in it, the principal officers, generals, and captains; or the riches of it, the plunder of the Egyptians and Ethiopians, as Kimchi observes, which were all destroyed at once: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "both soul and body, or \"from the soul even to the flesh\" (o); which denotes the total consumption of them, nothing of them remaining; the Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the glory of the multitude of his army, and their souls with their bodies, it shall consume;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and so some understand this of the eternal destruction of soul and body in hell: the Rabbins are divided about the manner of the consumption of the Assyrian army; some say their bodies and souls were both burnt, which these words seem to favour; and others, that their souls were burnt, and not their bodies, their lives were taken away, and their bodies unhurt; which they think is favoured by Isaiah 10:16 where it is said, \"under his glory\", and not \"his glory\" (p): ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and so some understand this of the eternal destruction of soul and body in hell: the Rabbins are divided about the manner of the consumption of the Assyrian army; some say their bodies and souls were both burnt, which these words seem to favour; and others, that their souls were burnt, and not their bodies, their lives were taken away, and their bodies unhurt; which they think is favoured by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " where it is said, \"under his glory\", and not \"his glory\" (p): ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall be as when a standardbearer fainteth; who when he fails, the whole company or army is thrown into confusion, and flees; and so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and he shall be broken, and flee.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Some render it, \"as the dust of the worm that eats wood\" (q); so Jarchi; signifying that they should be utterly destroyed, and become as small as the dust that falls from a worm eaten tree; which simile is used, a forest being made mention of before. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o)   \"ab anima usque ad carnem\", V. L. Montanus, Piscator. (p) T. Bab. Sabbat, fol. 113. 2. & Sanhedrin, fol 94. 1, 2. See Kimchi in loc. (q)  \"at pulvis teredinis\", Tigurine version. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o)   \"ab anima usque ad carnem\", V. L. Montanus, Piscator. (p) T. Bab. Sabbat, fol. 113. 2. & Sanhedrin, fol 94. 1, 2. See Kimchi in loc. (q)  \"at pulvis teredinis\", Tigurine version. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And shall consume the glory of his forest, and of his fruitful field, both soul {n} and body: and they shall be as when a standardbearer {o} fainteth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shall consume the glory of his forest, and of his fruitful field, both soul ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and body: and they shall be as when a standardbearer ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fainteth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) That is, body and soul utterly.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) When the battle is lost and the standard taken.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Forest... fruitful field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Forest\" and \"fruitful field\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "carmel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are sometimes united together, sometimes contrasted. Literally, they denote wild and cultivated woodland. Used symbolically, as here, they are not so much intended to designate different parts of Assyria's glory, as to convey the idea that the destruction will be universal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Both soul and body.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here metaphor is suddenly dropped, and Isaiah shows that he is speaking of the Assyrian ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not of the land or its products. Their destruction, wicked as they were, would be one both of body and soul. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As when a standard-bearer fainteth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as when one that is faint fainteth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Utter prostration and exhaustion is indicated, whichever way the passage is translated. Isaiah 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And the glory of his forest and his garden-ground will He destroy, even to soul and flesh, so that it is as when a sick man dieth. And the remnant of the trees of his forest can be numbered, and a boy could write them.\" The army of Asshur, composed as it was of many and various nations, was a forest (ya‛ar); and, boasting as it did of the beauty of both men and armour, a garden ground (carmel), a human forest and park. Hence the idea of \"utterly\" is expressed in the proverbial \"even to soul and flesh,\" which furnishes the occasion for a leap to the figure of the wasting away of a נסס (hap. leg. the consumptive man, from nâsas, related to nūsh, 'ânash, Syr. n‛sı̄so, n‛shisho, a sick man, based upon the radical notion of melting away, cf., mâsas, or of reeling to and fro, cf., mūt, nūt, Arab. nâsa, nâta). Only a single vital spark would still glimmer in the gigantic and splendid colossus, and with this its life would threaten to become entirely extinct. Or, what is the same thing, only a few trees of the forest, such as could be easily numbered (mispâr as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 21:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), would still remain, yea, so few, that a boy would be able to count and enter them. And this really came to pass. Only a small remnant of the army that marched against Jerusalem ever escaped. With this small remnant of an all-destroying power the prophet now contrasts the remnant of Israel, which is the seed of a new power that is about to arise. ",
        "children": []
      }
    ]
  }
]