[{"num":23,"verse":"¶ And Balaam said unto Balak, Build me here seven altars and prepare me here seven oxen and seven rams."},{"num":2,"verse":"And Balak did as Balaam had spoken; and Balak and Balaam offered on every altar a bullock and a ram."},{"num":3,"verse":"And Balaam said unto Balak, Stand by thy burnt offering, and I will go; peradventure the LORD will come to meet me, and whatever he shows me I will tell thee. And thus he went alone."},{"num":4,"verse":"And God met Balaam; and he said unto him, I have prepared seven altars, and I have offered upon each altar a bullock and a ram."},{"num":5,"verse":"And the LORD put a word in Balaam’s mouth and said, Return unto Balak, and thus thou shalt speak."},{"num":6,"verse":"And he returned unto him, and, behold, he stood by his burnt sacrifice, he and all the princes of Moab."},{"num":7,"verse":"And he took up his parable and said, Balak, the king of Moab, has brought me from Aram, out of the mountains of the east, saying, Come, curse me Jacob and come, denounce Israel."},{"num":8,"verse":"Why should I curse one whom God has not cursed? And why should I denounce one whom the LORD has not denounced?"},{"num":9,"verse":"For from the top of the rocks I have seen him, and from the hills I beheld him; behold, a people that shall dwell in confidence and shall not be counted among the Gentiles."},{"num":10,"verse":"Who shall count the dust of Jacob and the number of the fourth part of Israel? Let my soul die the death of the righteous, and let my last end be like his!"},{"num":11,"verse":"Then Balak said unto Balaam, What hast thou done unto me? I took thee to curse my enemies, and, behold, thou hast blessed them altogether."},{"num":12,"verse":"And he answered and said, Must I not take heed to speak that which the LORD has put in my mouth?"},{"num":13,"verse":"¶ And Balak said unto him, Come, I pray thee, with me unto another place, from which thou may see them; thou hast seen but the utmost part of them and hast not seen them all; and from there thou shalt curse them for me."},{"num":14,"verse":"And he brought him into the field of Zophim to the top of Pisgah and built seven altars and offered a bullock and a ram on every altar."},{"num":15,"verse":"Then he said unto Balak, Stand here by thy burnt offering, while I meet the LORD yonder."},{"num":16,"verse":"And the LORD met Balaam and put a word in his mouth and said unto him, Go again unto Balak and say thus."},{"num":17,"verse":"And he came unto him, and behold, he stood by his burnt offering and the princes of Moab with him. And Balak said unto him, What has the LORD spoken?"},{"num":18,"verse":"Then he took up his parable and said, Rise up, Balak, and hear; hearken unto me, thou son of Zippor:"},{"num":19,"verse":"God is not a man, that he should lie; neither the son of man, that he should repent; he said and shall he not do it? He spoke and shall he not execute it?"},{"num":20,"verse":"Behold, I have received blessing; and he has blessed; and I cannot reverse it."},{"num":21,"verse":"He has not beheld iniquity in Jacob, neither has he seen rebellion in Israel; the LORD his God is with him, and the battle-cry of a king is in him."},{"num":22,"verse":"God brought them out of Egypt; he has, as it were the strength of a unicorn."},{"num":23,"verse":"Because there is no enchantment in Jacob, neither is there any divination in Israel. According to this time, it shall be said of Jacob and of Israel, What God has made!"},{"num":24,"verse":"Behold the people, who shall rise up as a great lion and lift up himself as a young lion; he shall not lie down until he eats of the prey and drinks the blood of the slain."},{"num":25,"verse":"Then Balak said unto Balaam, Now that you do not curse them, do not bless them either."},{"num":26,"verse":"Then Balaam said unto Balak, Did I not tell thee that all that the LORD says unto me, that I must do?"},{"num":27,"verse":"And Balak said unto Balaam, Come, I pray thee, I will bring thee unto another place; peradventure it will please God that thou may curse them for me from there."},{"num":28,"verse":"And Balak brought Balaam unto the top of Peor, that looks toward Jeshimon."},{"num":29,"verse":"And Balaam said unto Balak, Build me here seven altars and prepare me here seven bullocks and seven rams."},{"num":30,"verse":"And Balak did as Balaam had said and offered a bullock and a ram on every altar."}]