[[],[{"type":"header","content":"Balaam Blesses Israel"},{"type":"prose","content":" Balaam said to Balak, “Build me seven altars here, and prepare for me here seven bulls and seven rams.” "}],[{"type":"prose","content":"So Balak did just as Balaam had said. Balak and Balaam then offered on each altar a bull and a ram. "}],[{"type":"prose","content":"Balaam said to Balak, “Station yourself by your burnt offering, and I will go off; perhaps the  will come to meet me, and whatever he reveals to me I will tell you.” Then he went to a deserted height."}],[{"type":"prose","content":"Then God met Balaam, who said to him, “I have prepared seven altars, and I have offered on each altar a bull and a ram.” "}],[{"type":"prose","content":"Then the  put a message in Balaam’s mouth and said, “Return to Balak, and speak what I tell you.”"}],[{"type":"prose","content":"So he returned to him, and he was still standing by his burnt offering, he and all the princes of Moab. "}],[{"type":"prose","content":"Then Balaam uttered his oracle, saying,"},{"type":"header","content":"Balaam Relocates"}],[{"type":"prose","content":"Then Balak said to Balaam, “What have you done to me? I brought you to curse my enemies, but on the contrary you have only blessed them!” "}],[{"type":"prose","content":"Balaam replied, “Must I not be careful to speak what the  has put in my mouth?” "}],[{"type":"prose","content":"Balak said to him, “Please come with me to another place from which you can observe them. You will see only a part of them, but you will not see all of them. Curse them for me from there.”"}],[{"type":"prose","content":"So Balak brought Balaam to the field of Zophim, to the top of Pisgah, where he built seven altars and offered a bull and a ram on each altar. "}],[{"type":"prose","content":"And Balaam said to Balak, “Station yourself here by your burnt offering, while I meet the  there.” "}],[{"type":"prose","content":"Then the  met Balaam and put a message in his mouth and said, “Return to Balak, and speak what I tell you.” "}],[{"type":"prose","content":"When Balaam came to him, he was still standing by his burnt offering, along with the princes of Moab. And Balak said to him, “What has the  spoken?”"},{"type":"header","content":"Balaam Prophesies Again"}],[{"type":"prose","content":"Balaam uttered his oracle, and said,"},{"type":"header","content":"Balaam Relocates Yet Again"}],[{"type":"prose","content":"Balak said to Balaam, “Neither curse them at all nor bless them at all!” "}],[{"type":"prose","content":"But Balaam replied to Balak, “Did I not tell you, ‘All that the  speaks, I must do’?”"}],[{"type":"prose","content":"Balak said to Balaam, “Come, please; I will take you to another place. Perhaps it will please God to let you curse them for me from there.” "}],[{"type":"prose","content":"So Balak took Balaam to the top of Peor, that looks toward the wastelands. "}],[{"type":"prose","content":"Then Balaam said to Balak, “Build seven altars here for me, and prepare seven bulls and seven rams.” "}],[{"type":"prose","content":"So Balak did as Balaam had said, and offered a bull and a ram on each altar."}]]