[{"num":4,"verse":"Listen to this, you fat cows of Bashan who are on the mountain of Samaria. You make it hard for the poor. You crush those in need. You say to your husbands, “Bring us something to drink!” "},{"num":2,"verse":"As the Lord God is holy, He has promised, “The days are coming when they will take you away with meat hooks. And the last of you will be taken with fish hooks. "},{"num":3,"verse":"You will go out through breaks in the walls. Each of you will go straight out. And you will be sent to Harmon,” says the Lord."},{"num":4,"verse":"“Go to Bethel and sin! Go and sin much more in Gilgal! Bring your gifts in worship every morning. Every three days give a tenth part of what you receive. "},{"num":5,"verse":"Give a thank gift of bread made with yeast. And make your free-will gifts known. For this is what you love to do, O people of Israel,” says the Lord God."},{"header":"Israel Did Not Learn"},{"num":6,"verse":"“I kept food from your teeth in all your cities. I did not let you have enough bread in all your places. Yet you have not returned to Me,” says the Lord. "},{"num":7,"verse":"“I kept the rain from you while there were still three months until gathering time. Then I would send rain on one city, but would send no rain on another city. One part would receive rain, while the part which did not receive rain would dry up. "},{"num":8,"verse":"People would go from city to city to drink water, but would not get enough. Yet you have not returned to Me,” says the Lord. "},{"num":9,"verse":"“I sent hot wind to dry up your fields. The locust destroyed your many gardens and grape-fields, fig trees and olive trees. Yet you have not returned to Me,” says the Lord. "},{"num":10,"verse":"“I sent a very bad disease upon you as I had done to Egypt. I killed your young men with the sword and took your horses away. I filled your nose with the bad smell of your camp. Yet you have not returned to Me,” says the Lord. "},{"num":11,"verse":"“I destroyed some of you as I destroyed Sodom and Gomorrah. You were like a burning stick pulled out of the fire. Yet you have not returned to Me,” says the Lord. "},{"num":12,"verse":"“So I will do this to you, O Israel. And because I will do this to you, get ready to meet your God, O Israel.” "},{"num":13,"verse":"He is the One Who makes the mountains and the wind. He makes His thoughts known to man. He turns the morning into darkness, and walks on the high places of the earth. The Lord God of All is His name."}]