[{"header":"The Vision of God’s Throne"},{"num":10,"verse":"As I continued to watch, there on the expanse above the heads of the cherubim was a massive sapphire stone that resembled a throne in form and appearance. "},{"num":2,"verse":"The Lord spoke to the man who was clothed in white linen, telling him, “Go between the whirling wheels, under the cherubim, and fill your hands with burning coals from among the cherubim. Then scatter them over the city.” So he entered as I watched."},{"num":3,"verse":"Now the cherubim were standing on the south side of the entrance to the Temple, when the man entered and a cloud filled the inner court. "},{"num":4,"verse":"The glory of the Lord rose above the cherub and moved to the threshold of the Temple. A cloud filled the Temple and the court was filled with the brilliance of the Lord’s glory. "},{"num":5,"verse":"The sound of the wings of the cherubim, reminiscent of the voice of the Sovereign God when he speaks, could be heard as far as the outer court."},{"num":6,"verse":"He issued this order to the man who was clothed in white linen: “Take fire from within the whirling wheels, among the cherubim.” So he went and stood beside the wheels."},{"header":"Ezekiel’s Vision of the Cherubim"},{"num":7,"verse":"Then a cherub stretched out his hand to the fire, which was among the cherubim, took some of the fire, and placed it in the hands of the one clothed in white linen, who took it and left. "},{"num":8,"verse":"There appeared to be human hands under the wings of the cherubim."},{"num":9,"verse":"As I continued to watch, I observed four wheels beside the cherubim, one wheel beside each cherub. The wheels resembled beryl stone. "},{"num":10,"verse":"In appearance, the four wheels looked like they consisted of a wheel within a wheel. "},{"num":11,"verse":"Whenever they moved, they proceeded without turning around as they moved, but they followed in the direction where their head was facing, without looking around as they moved."},{"num":12,"verse":"Their entire bodies, backs, hands, and wings were filled with eyes around, including each of their four wheels. "},{"num":13,"verse":"The wheels whose sound I was hearing were called “the whirling wheels”. "},{"num":14,"verse":"Each had four faces. The first one was the face of a cherub, the second the face of a man, the third the face of a lion, and the fourth the face of an eagle."},{"num":15,"verse":"The cherubim arose. These were the same beings that I had seen at the Chebar River. "},{"num":16,"verse":"When the cherubim moved, the wheels went alongside them. But when the cherubim started to ascend, beating their wings to rise above the earth, the wheels beside them didn’t turn. "},{"num":17,"verse":"When they stood still, the wheels stood still. When they rose up, the wheels rose up, too, because they were alive."},{"num":18,"verse":"Then the glory of the Lord moved away from the threshold of the Temple and stood over the cherubim. "},{"num":19,"verse":"The cherubim lifted their wings and rose above the earth while I watched. They went out, along with their wheels, and stood at the entrance to the east gate of the Lord’s Temple as the glory of Israel’s God remained above, covering them."},{"num":20,"verse":"These were the living beings that I had seen under the God of Israel on the bank of the Chebar River. I knew that they were cherubim. "},{"num":21,"verse":"Each one had four faces. Each one had four wings, and the form of human hands could be seen under their wings. "},{"num":22,"verse":"As to the likeness of their faces, they were like what I had seen on the bank of the Chebar River. They each moved straight ahead."}]