[[],[{"type":"header","content":"The Lord Provides Manna"},{"type":"prose","content":"They set out from Elim, and all the congregation of Israel came to the Wilderness of Sin, which is between Elim and Sinai, on the fifteenth day of the second month after they left the land of Egypt. "}],[{"type":"prose","content":"The whole congregation of the Israelites [grew discontented and] murmured  rebelled against Moses and Aaron in the wilderness, "}],[{"type":"prose","content":"and the Israelites said to them, “Would that we had died by the hand of the LORD in the land of Egypt, when we sat by the pots of meat and ate bread until we were full; for you have brought us out into this wilderness to kill this entire assembly with hunger.”"}],[{"type":"prose","content":"Then the LORD said to Moses, “Behold, I will cause bread to rain from heaven for you; the people shall go out and gather a day’s portion every day, so that I may test them [to determine] whether or not they will walk [obediently] in My instruction (law). "}],[{"type":"prose","content":"And it shall be that on the sixth day, they shall prepare to bring in twice as much as they gather daily [so that they will not need to gather on the seventh day].” "}],[{"type":"prose","content":"So Moses and Aaron said to all Israel, “At evening you shall know that the LORD has brought you out of the land of Egypt, "}],[{"type":"prose","content":"and in the morning you will see the glory of the LORD, for He hears your murmurings against the LORD. What are we, that you murmur  rebel against us?”"}],[{"type":"header","content":"The Lord Provides Meat"},{"type":"prose","content":"Moses said, “ when the LORD gives you meat to eat in the evening, and in the morning [enough] bread to be fully satisfied, because the LORD has heard your murmurings against Him; for what are we? Your murmurings are not against us, but against the LORD.”"}],[{"type":"prose","content":"Then Moses said to Aaron, “Say to all the congregation of Israel, ‘Approach the LORD, because He has heard your murmurings.’” "}],[{"type":"prose","content":"So it happened that as Aaron spoke to the whole congregation of Israel, they looked toward the wilderness, and behold, the glory  brilliance of the LORD appeared in the cloud! "}],[{"type":"prose","content":"Then the LORD spoke to Moses, saying, "}],[{"type":"prose","content":"“I have heard the murmurings of the Israelites; speak to them, saying, ‘At twilight you shall eat meat, and in the morning you shall be filled with bread; and you shall know that I am the LORD your God.’”"}],[{"type":"prose","content":"So in the evening the quails came up and covered the camp, and in the morning there was a blanket of dew around the camp. "}],[{"type":"prose","content":"When the layer of dew evaporated, on the surface of the wilderness there was a fine, flake-like thing, as fine as frost on the ground. "}],[{"type":"prose","content":"When the Israelites saw it, they said to one another, “What is it?” For they did not know what it was. And Moses said to them, “This is the bread which the LORD has given you to eat. "}],[{"type":"prose","content":"This is what the LORD has commanded: ‘Let every man gather as much of it as he needs. Take an omer for each person, according to the number of people each of you has in his tent.’” "}],[{"type":"prose","content":"The Israelites did so, and some gathered much [of it] and some [only a] little. "}],[{"type":"prose","content":"When they measured it with an omer, he who had gathered a large amount had no excess, and he who had gathered little had no lack; every man gathered according to his need (family size). "}],[{"type":"prose","content":"Moses said, “Let none of it be left [overnight] until [the next] morning.” "}],[{"type":"prose","content":"But they did not listen to Moses, and some left a supply of it until morning, and it bred worms and became foul  rotten; and Moses was angry with them. "}],[{"type":"prose","content":"So they gathered it every morning, each as much as he needed, because when the sun was hot it melted."}],[{"type":"header","content":"The Sabbath Observed"},{"type":"prose","content":"Now on the sixth day they gathered twice as much bread, two omers for each person; and all the leaders of the congregation came and told Moses. "}],[{"type":"prose","content":"He said to them, “This is what the LORD has said: ‘Tomorrow is a solemn rest, a holy Sabbath to the LORD’; bake and boil what you will bake and boil [today], and all that remains left over put aside for yourselves to keep until morning.” "}],[{"type":"prose","content":"They put it aside until morning, as Moses told them, and it did not become foul nor was it wormy. "}],[{"type":"prose","content":"Then Moses said, “Eat that today, for today is a Sabbath to the LORD; today you will not find it in the field. "}],[{"type":"prose","content":"Six days you shall gather it, but on the seventh day, the Sabbath, there will be none [in the field].”"}],[{"type":"prose","content":"Now on the seventh day some of the people went out to gather, but they found none. "}],[{"type":"prose","content":"Then the LORD said to Moses, “How long do you [people] refuse to keep My commandments and My instructions (laws)? "}],[{"type":"prose","content":"See, the LORD has given you the Sabbath; therefore He gives you the bread for two days on the sixth day. Let every man stay in his place; no man is to leave his place on the seventh day.” "}],[{"type":"prose","content":"So the people rested on the seventh day."}],[{"type":"prose","content":"The house of Israel called the bread manna; it was like coriander seed, white, and it tasted like flat pastry (wafers) made with honey. "}],[{"type":"prose","content":"Then Moses said, “This is the word which the LORD commands, ‘Let an omer of it be kept throughout your generations, that they may see the bread with which I fed you in the wilderness, when I brought you out of the land of Egypt.’” "}],[{"type":"prose","content":"So Moses said to Aaron, “Take a pot and put an omer of manna in it, and place it before the LORD to be kept throughout your generations.” "}],[{"type":"prose","content":"As the LORD commanded Moses, so Aaron [eventually] placed it in the presence of the Testimony, to be kept. "}],[{"type":"prose","content":"The Israelites ate manna forty years, until they reached an inhabited land; they ate the manna until they came to the border of the land of Canaan. "}],[{"type":"prose","content":"Now an omer is the tenth of an ephah."}]]