[{"header":"The Lord Sends Food from Heaven"},{"num":16,"verse":"On the fifteenth day of the second month after the Israelites had escaped from Egypt, they left Elim and started through the western edge of the Sinai Desert in the direction of Mount Sinai. "},{"num":2,"verse":"There in the desert they started complaining to Moses and Aaron, "},{"num":3,"verse":"“We wish the Lord had killed us in Egypt. When we lived there, we could at least sit down and eat all the bread and meat we wanted. But you have brought us out here into this desert, where we are going to starve.”"},{"num":4,"verse":"The Lord said to Moses, “I will send bread down from heaven like rain. Each day the people can go out and gather only enough for that day. That’s how I will see if they obey me. "},{"num":5,"verse":"But on the sixth day of each week they must gather and cook twice as much.”"},{"num":6,"verse":"Moses and Aaron told the people, “This evening you will know that the Lord was the one who rescued you from Egypt. "},{"num":7,"verse":"And in the morning you will see his glorious power, because he has heard your complaints against him. Why should you grumble to us? Who are we?”"},{"num":8,"verse":"Then Moses continued, “You will know it is the Lord when he gives you meat each evening and more than enough bread each morning. He is really the one you are complaining about, not us—we are nobodies—but the Lord has heard your complaints.”"},{"num":9,"verse":"Moses turned to Aaron and said, “Bring the people together, because the Lord has heard their complaints.”"},{"num":10,"verse":"Aaron was speaking to them, when everyone looked out toward the desert and saw the bright glory of the Lord in a cloud. "},{"num":11,"verse":"The Lord said to Moses, "},{"num":12,"verse":"“I have heard my people complain. Now tell them that each evening they will have meat and each morning they will have more than enough bread. Then they will know that I am the Lord their God.”"},{"num":13,"verse":"That evening a lot of quails came and landed everywhere in the camp, and the next morning dew covered the ground. "},{"num":14,"verse":"After the dew had gone, the desert was covered with thin flakes that looked like frost. "},{"num":15,"verse":"The people had never seen anything like this, and they started asking each other, “What is it?”"},{"num":16,"verse":"And he orders you to gather about two quarts for each person in your family—that should be more than enough.”"},{"num":17,"verse":"They did as they were told. Some gathered more and some gathered less, "},{"num":18,"verse":"according to their needs, and none was left over."},{"num":19,"verse":"Moses told them not to keep any overnight. "},{"num":20,"verse":"Some of them disobeyed, but the next morning what they kept was stinking and full of worms, and Moses was angry."},{"num":21,"verse":"Each morning everyone gathered as much as they needed, and in the heat of the day the rest melted. "},{"num":22,"verse":"However, on the sixth day of the week, everyone gathered enough to have four quarts, instead of two. When the leaders reported this to Moses, "},{"num":23,"verse":"he told them that the Lord had said, “Tomorrow is the Sabbath, a sacred day of rest in honor of me. So gather all you want to bake or boil, and make sure you save enough for tomorrow.”"},{"num":24,"verse":"The people obeyed, and the next morning the food smelled fine and had no worms. "},{"num":25,"verse":"“You may eat the food,” Moses said. “Today is the Sabbath in honor of the Lord, and there won’t be any of this food on the ground today. "},{"num":26,"verse":"You will find it there for the first six days of the week, but not on the Sabbath.”"},{"num":27,"verse":"A few of the Israelites did go out to look for some, but there was none. "},{"num":28,"verse":"Then the Lord said, “Moses, how long will you people keep disobeying my laws and teachings? "},{"num":29,"verse":"Remember that I was the one who gave you the Sabbath. That’s why on the sixth day I provide enough bread for two days. Everyone is to stay home and rest on the Sabbath.” "},{"num":30,"verse":"And so they rested on the Sabbath."},{"num":31,"verse":"The Israelites called the bread manna. It was white like coriander seed and delicious as wafers made with honey. "},{"num":32,"verse":"Moses told the people that the Lord had said, “Store up two quarts of this manna, because I want future generations to see the food I gave you during the time you were in the desert after I rescued you from Egypt.”"},{"num":33,"verse":"Then Moses told Aaron, “Put some manna in a jar and store it in the place of worship for future generations to see.”"},{"num":34,"verse":"Aaron followed the Lord’s instructions and put the manna in front of the sacred chest for safekeeping. "},{"num":35,"verse":"The Israelites ate manna for forty years, before they came to the border of Canaan that was a settled land."}]