[{"num":16,"verse":"¶ And they took their journey from Elim, and all the congregation of the sons of Israel came unto the wilderness of Sin, which is between Elim and Sinai, on the fifteenth day of the second month after their departing out of the land of Egypt."},{"num":2,"verse":"And the whole congregation of the sons of Israel murmured against Moses and Aaron in the wilderness;"},{"num":3,"verse":"and the sons of Israel said unto them, It would have been better if we had died by the hand of the LORD in the land of Egypt, when we sat by the flesh pots and when we ate bread to the full; for ye have brought us forth into this wilderness to kill this whole assembly with hunger."},{"num":4,"verse":"Then the LORD said unto Moses, Behold, I will rain bread from heaven for you; and the people shall go out and gather the word for every day, that I may prove them, whether they will walk in my law, or not."},{"num":5,"verse":"And it shall come to pass that on the sixth day they shall prepare that which they bring in, which shall be twice as much as they gather daily."},{"num":6,"verse":"Then Moses and Aaron said unto all the sons of Israel, At evening ye shall know that the LORD has brought you out from the land of Egypt;"},{"num":7,"verse":"And in the morning ye shall see the glory of the LORD; for he has heard your murmurings against the LORD; and what are we, that ye murmur against us?"},{"num":8,"verse":"And Moses said, This shall be when the LORD shall give you in the evening flesh to eat and in the morning bread to the full; for the LORD has heard your murmurings which ye have murmured against him; and what are we? Your murmurings are not against us, but against the LORD."},{"num":9,"verse":"And Moses spoke unto Aaron, Say unto all the congregation of the sons of Israel, Come near before the LORD, for he has heard your murmurings."},{"num":10,"verse":"And it came to pass as Aaron spoke unto the whole congregation of the sons of Israel, that they looked toward the wilderness, and, behold, the glory of the LORD appeared in the cloud."},{"num":11,"verse":"And the LORD spoke unto Moses, saying,"},{"num":12,"verse":"I have heard the murmurings of the sons of Israel; speak unto them, saying, Between the two evenings ye shall eat flesh, and tomorrow ye shall be filled with bread; and ye shall know that I am the LORD your God."},{"num":13,"verse":"¶ And it came to pass, that in the evening quail came up, and covered the camp; and in the morning the dew descended round about the host."},{"num":14,"verse":"And when the dew ceased to descend, behold, upon the face of the wilderness there lay a small round thing as small as the hoar frost on the ground."},{"num":15,"verse":"And when the sons of Israel saw it, they said one to another, It is manna (What is it?): for they did not know what it was. Then Moses said unto them, This is the bread which the LORD has given you to eat."},{"num":16,"verse":"This is the thing which the LORD has commanded, Gather of it every man according to his eating, an omer for each one, according to the number of your persons; take ye each one for those who are in his tent."},{"num":17,"verse":"And the sons of Israel did so and gathered, some more, some less."},{"num":18,"verse":"And when they did measure it with an omer, he that gathered much had nothing over, and he that gathered little had no lack; they gathered each one according to his eating."},{"num":19,"verse":"And Moses said, Let no one leave of it until the morning."},{"num":20,"verse":"Notwithstanding they did not hearken unto Moses; but some of them left of it until the morning, and it bred worms and stank; and Moses was angry with them."},{"num":21,"verse":"And they gathered it early in the morning, each one according to his eating; and when the sun waxed hot, it melted."},{"num":22,"verse":"¶ And it came to pass that on the sixth day they gathered twice as much bread, two omers for each one; and all the princes of the congregation came and told Moses."},{"num":23,"verse":"And he said unto them, This is what the LORD has said, Tomorrow is the holy sabbath of rest unto the LORD; bake that which ye will bake today and cook what ye will cook; and that which remains over lay up for you to be kept until the morning."},{"num":24,"verse":"And they laid it up until the morning as Moses bade; and it did not stink, neither was there any worm in it."},{"num":25,"verse":"And Moses said, Eat that today; for today is a sabbath unto the LORD; today ye shall not find it in the field."},{"num":26,"verse":"Six days ye shall gather it; but on the seventh day, which is the sabbath, in it there shall be none."},{"num":27,"verse":"And it came to pass that some of the people went out on the seventh day to gather, and they found none."},{"num":28,"verse":"And the LORD said unto Moses, How long refuse ye to keep my commandments and my laws?"},{"num":29,"verse":"See that the LORD has given you the sabbath; therefore, he gives you the bread of two days on the sixth day; abide ye every man in his place; let no man go out of his place on the seventh day."},{"num":30,"verse":"So the people rested on the seventh day."},{"num":31,"verse":"And the house of Israel called its name Manna; and it was like coriander seed, white, and the taste of it was like wafers made with honey."},{"num":32,"verse":"¶ And Moses said, This is what the LORD has commanded, Fill an omer of it to be kept for your descendants, that they may see the bread with which I have fed you in the wilderness when I brought you forth from the land of Egypt."},{"num":33,"verse":"And Moses said unto Aaron, Take a pot and put an omer full of manna in it and lay it up before the LORD, to be kept for your descendants."},{"num":34,"verse":"As the LORD commanded Moses, so Aaron laid it up before the Testimony, to be kept."},{"num":35,"verse":"Thus the sons of Israel ate manna forty years until they came to a land inhabited; they ate manna until they came unto the borders of the land of Canaan."},{"num":36,"verse":"Now an omer is the tenth part of an ephah."}]