[{"num":16,"verse":"And they took their journey from Elim, and kol Adat Bnei Yisroel came unto the midbar of Siyn (pronounced \"Seen\"), which is between Elim and Sinai, on the fifteenth day of the second month after their departing out of Eretz Mitzrayim."},{"num":2,"verse":"And kol Adat Bnei Yisroel murmured against Moshe and Aharon in the midbar;"},{"num":3,"verse":"And the Bnei Yisroel said unto them, If only G-d would have made us die by the yad Hashem in Eretz Mitzrayim, when we sat by the sir habasar (pot of meat), and when we did eat lechem to the full; for ye have brought us forth into this midbar, to kill this kol hakahal with ra’av (hunger)."},{"num":4,"verse":"Then said Hashem unto Moshe, Hineni, I will rain lechem from Shomayim upon you; and HaAm shall go out and gather a certain daily provision, that I may test them, whether they will walk in My torah, or no."},{"num":5,"verse":"And it shall come to pass, that on the yom hashishi (sixth day) they shall prepare that which they bring in; and it shall be twice as much as they gather daily."},{"num":6,"verse":"And Moshe and Aharon said unto kol Bnei Yisroel, At erev, then ye shall know that Hashem hath brought you out from Eretz Mitzrayim;"},{"num":7,"verse":"And in the boker, then ye shall see the kevod Hashem; because He heareth your telunnot (murmurings, grumblings) against Hashem; and who are we, that ye murmur against us?"},{"num":8,"verse":"And Moshe said, This shall be, when Hashem shall give you basar in the erev to eat, and in the boker lechem to the full; because Hashem heareth your telunnot which ye murmur against Him; and who are we? Your telunnot are not against us, but against Hashem."},{"num":9,"verse":"And Moshe spoke unto Aharon, Say unto kol Adat Bnei Yisroel, Come near before Hashem; for He hath heard your telunnot."},{"num":10,"verse":"And it came to pass, as Aharon spoke unto kol Adat Bnei Yisroel, that they looked toward the midbar, and, hinei, the kevod Hashem appeared in the anan."},{"num":11,"verse":"And Hashem spoke unto Moshe, saying,"},{"num":12,"verse":"I have heard the telunnot Bnei Yisroel; speak unto them, saying, At twilight ye shall eat basar, and in the boker ye shall be glutted with lechem; and ye shall know [by experience] that I am Hashem Eloheichem."},{"num":13,"verse":"And it came to pass, that at erev the quails came up, and covered the machaneh; and in the boker there was a layer of tal (dew) about the machaneh."},{"num":14,"verse":"And when the layer of tal evaporated, hinei, upon the surface of the midbar there lay thin flakes, as thin as a layer of kfor (frost) upon ha’aretz."},{"num":15,"verse":"And when the Bnei Yisroel saw it, they said one to another, Mahn hu (What is it?) For they knew not mah hu (what [is] this). And Moshe said unto them, This is the lechem which Hashem hath given you to eat."},{"num":16,"verse":"This is the thing which Hashem hath commanded, Gather of it every man according to his eating [need], an omer per person, according to the number of your nefashot; take ye every man for them which are in his ohel."},{"num":17,"verse":"And the Bnei Yisroel did so, and gathered, some more, some less."},{"num":18,"verse":"And when they did measure it by the omer, he that gathered much had nothing extra, and he that gathered little had no lack; they gathered every man according to his eating [need]."},{"num":19,"verse":"And Moshe said, Let no ish leave of it until boker."},{"num":20,"verse":"Notwithstanding, they paid heed not unto Moshe; but some left part of it until boker, and [the leftovers] bred tola’im (worms), and stank; and Moshe was angry with them."},{"num":21,"verse":"And they gathered it every boker, every man according to his eating [need]; and when the shemesh grew hot, it melted."},{"num":22,"verse":"And it came to pass, that on yom hashishi they gathered twice as much lechem, two omers for one man; and all the nesi’im of the Edah came and told Moshe."},{"num":23,"verse":"And he said unto them, This is that which Hashem hath said, Tomorrow is a Shabbaton (day of rest), Shabbos Kodesh unto Hashem; bake that which ye will bake today, and boil that ye will boil; and that which remaineth over lay up for you for mishmeret (for keeping) until boker."},{"num":24,"verse":"And they laid it up, saving it until boker, as Moshe commanded; and it did not stink, neither was there any infestation therein."},{"num":25,"verse":"And Moshe said, Eat that today; for today is a Shabbos unto Hashem; today ye shall not find it in the sadeh."},{"num":26,"verse":"Sheshet yamim ye shall gather it; but on the yom hashevi’i, which is Shabbos, in it there shall be none."},{"num":27,"verse":"And it came to pass, that there went out some from HaAm on the yom hashevi’i to gather, and they found none."},{"num":28,"verse":"And Hashem said unto Moshe, How long refuse ye to be shomer over My mitzvot and My torot?"},{"num":29,"verse":"See, that Hashem hath given you the Shabbos, therefore He giveth you on yom hashishi lechem for two days; abide ye every man in his place, let no man go out from his place on yom hashevi’i."},{"num":30,"verse":"So HaAm rested on yom hashevi’i."},{"num":31,"verse":"And Bais Yisroel called the shem thereof Manna; and it was like coriander seed, lavan (white); and the taste of it was like flat cakes fried in devash."},{"num":32,"verse":"And Moshe said, This is the thing which Hashem commandeth, Fill an omer of it to be mishmeret (kept) for your dorot; that they may see the lechem wherewith I have fed you in the midbar, when I brought you forth from Eretz Mitzrayim."},{"num":33,"verse":"And Moshe said unto Aharon, Take a jar, and put an omer full of manna therein, and lay it up before Hashem, to be kept for your dorot."},{"num":34,"verse":"As Hashem commanded Moshe, so Aharon laid it up before the Edut (the [Ark] of the Testimony), for mishmeret (to be kept)."},{"num":35,"verse":"And the Bnei Yisroel did eat manna arba’im shanah, until they came to an eretz noshavet (an inhabited land); they did eat manna, until they came unto the borders of Eretz Kena’an."},{"num":36,"verse":"Now an omer [i.e., two quarts dry measure] is the tenth part of an ephah [T.N. an ephah is about one-half bushel]."}]