[[],[{"type":"header","content":"Samuel Addresses Israel"},{"type":"prose","content":"Then Samuel said to all Israel, “Behold, I have listened to your voice in everything that you have said to me and have appointed a king over you. "}],[{"type":"prose","content":"And now, here is the king walking before you. As for me, I am old and gray, and here are my sons with you. I have walked before you from my childhood to this day. "}],[{"type":"prose","content":"Here I am; testify against me before the  and [Saul] His anointed [if I have done someone wrong]. Whose ox have I taken, or whose donkey have I taken, or whom have I exploited? Whom have I oppressed or from whose hand have I taken a bribe to blind my eyes [to the truth]? [Tell me and] I will restore it to you.” "}],[{"type":"prose","content":"They said, “You have not exploited us or oppressed us or taken anything at all from a man’s hand.” "}],[{"type":"prose","content":"Samuel said to them, “The  is a witness against you, and [Saul] His anointed is a witness this day that you have not found anything in my hand.” And they answered, “ a witness.”"}],[{"type":"prose","content":"Then Samuel said to the people, “It is the  who appointed Moses and Aaron and brought your fathers (ancestors) up from the land of Egypt. "}],[{"type":"prose","content":"Now then, take your stand, so that I may plead  contend with you before the  concerning all the righteous acts of the  which He did for you and for your fathers. "}],[{"type":"prose","content":"When Jacob [and his sons] had come into Egypt [and later when the Egyptians oppressed them] and your fathers cried out to the , then the  sent Moses and Aaron who brought your fathers out of Egypt and settled them in this place. "}],[{"type":"prose","content":"But when they forgot the  their God, He sold them into the hand of Sisera, commander of Hazor’s army, and into the hand of the Philistines and of the king of Moab, and they fought against them. "}],[{"type":"prose","content":"They cried out to the , saying, ‘We have sinned because we have abandoned (rejected) the Lord and have served the Baals and the Ashtaroth; but now rescue us from the hands of our enemies, and we will serve You.’ "}],[{"type":"prose","content":"Then the  sent Jerubbaal (Gideon) and Bedan and Jephthah and Samuel, and He rescued you from the hand of your enemies on every side, and you lived in security."},{"type":"header","content":"The King Confirmed"}],[{"type":"prose","content":"But when you saw that Nahash king of the Ammonites had come against you, you said to me, ‘No, but a king shall reign over us’—although the  your God was your King. "}],[{"type":"prose","content":"Now therefore, here is [Saul] the king whom you have chosen, and for whom you asked; behold, the  has set a king over you. "}],[{"type":"prose","content":"If you will fear the  [with awe and profound reverence] and serve Him and listen to His voice and not rebel against His commandment, then both you and your king will follow the  your God [and it will be well]. "}],[{"type":"prose","content":"But if you do not listen to the  voice, but rebel against His command, then the hand of the  will be against you [to punish you], as it was against your fathers. "}],[{"type":"prose","content":"So now, take your stand and see this great thing which the  will do before your eyes. "}],[{"type":"prose","content":"Is it not [the beginning of the] wheat harvest today? I will call to the  and He will send thunder and rain; then you will know [without any doubt], and see that your evil which you have done is great in the sight of the  by asking for yourselves a king.” "}],[{"type":"prose","content":"So Samuel called to the  [in prayer], and He sent thunder and rain that day; and all the people greatly feared the  and Samuel."}],[{"type":"prose","content":"Then all the people said to Samuel, “Pray to the  your God for your servants, so that we will not die, for we have added to all our sins  evil—to ask for a king for ourselves.” "}],[{"type":"prose","content":"Samuel said to the people, “Do not be afraid. You have [indeed] done all this evil; yet do not turn away from following the , but serve the  with all your heart. "}],[{"type":"prose","content":"You must not turn away, for  after futile things which cannot profit or rescue, because they are futile. "}],[{"type":"prose","content":"The  will not abandon His people for His great name’s sake, because the  has been pleased to make you a people for Himself. "}],[{"type":"prose","content":"Moreover, as for me, far be it from me that I should sin against the  by ceasing to pray for you; but I will instruct you in the good and right way. "}],[{"type":"prose","content":"Only fear the  [with awe and profound reverence] and serve Him faithfully with all your heart; for consider what great things He has done for you. "}],[{"type":"prose","content":"But if you still do evil, both you and your king will be swept away [to destruction].”"}]]