[{"num":12,"verse":"And Samuel said to all Israel, I have listened to you in all that you have said to me and have made a king over you."},{"num":2,"verse":"And now, behold, the king walks before you. And I am old and gray, and behold, my sons are with you. And I have walked before you from my childhood to this day."},{"num":3,"verse":"Here I am; testify against me before the Lord and Saul His anointed. Whose ox or donkey have I taken? Or whom have I defrauded or oppressed? Or from whose hand have I received any bribe to blind my eyes? Tell me and I will restore it to you."},{"num":4,"verse":"And they said, You have not defrauded us or oppressed us or taken anything from any man’s hand."},{"num":5,"verse":"And Samuel said to them, The Lord is witness against you, and His anointed is witness this day, that you have not found anything in my hand. And they answered, He is witness."},{"num":6,"verse":"And Samuel said to the people, It is the Lord Who appointed Moses and Aaron and brought your fathers up out of Egypt."},{"num":7,"verse":"Now present yourselves, that I may plead with you before the Lord concerning all the righteous acts of the Lord which He did for you and for your fathers."},{"num":8,"verse":"When Jacob and his sons had come into Egypt [and the Egyptians oppressed them], and your fathers cried to the Lord, then the Lord sent Moses and Aaron, who brought forth your fathers out of Egypt and made them dwell in this place."},{"num":9,"verse":"But when they forgot the Lord their God, He sold them into the hand of Sisera, commander of Hazor’s army, and into the hands of the Philistines and of the king of Moab, and they fought those foes."},{"num":10,"verse":"And they cried to the Lord, saying, We have sinned because we have forsaken the Lord and have served the Baals and the Ashtaroth; but now deliver us from the hands of our enemies, and we will serve You."},{"num":11,"verse":"And the Lord sent Jerubbaal and Barak and Jephthah and Samuel, and He delivered you out of the hands of your enemies on every side, and you dwelt safely."},{"num":12,"verse":"But when you saw that Nahash king of the Ammonites came against you, you said to me, No! A king shall reign over us—when the Lord your God was your King!"},{"num":13,"verse":"Now see the king whom you have chosen and for whom you have asked; behold, the Lord has set a king over you."},{"num":14,"verse":"If you will revere and fear the Lord and serve Him and hearken to His voice and not rebel against His commandment, and if both you and your king will follow the Lord your God, it will be good!"},{"num":15,"verse":"But if you will not hearken to the Lord’s voice, but rebel against His commandment, then the hand of the Lord will be against you, as it was against your fathers."},{"num":16,"verse":"So stand still and see this great thing the Lord will do before your eyes now."},{"num":17,"verse":"Is it not wheat harvest today? I will call to the Lord and He will send thunder and rain; then you shall know and see that your wickedness is great which you have done in the sight of the Lord in asking for a king for yourselves."},{"num":18,"verse":"So Samuel called to the Lord, and He sent thunder and rain that day; and all the people greatly feared the Lord and Samuel."},{"num":19,"verse":"And [they] all said to Samuel, Pray for your servants to the Lord your God, that we may not die, for we have added to all our sins this evil—to ask for a king."},{"num":20,"verse":"And Samuel said to the people, Fear not. You have indeed done all this evil; yet turn not aside from following the Lord, but serve Him with all your heart."},{"num":21,"verse":"And turn not aside after vain and worthless things which cannot profit or deliver you, for they are empty and futile."},{"num":22,"verse":"The Lord will not forsake His people for His great name’s sake, for it has pleased Him to make you a people for Himself."},{"num":23,"verse":"Moreover, as for me, far be it from me that I should sin against the Lord by ceasing to pray for you; but I will instruct you in the good and right way."},{"num":24,"verse":"Only fear the Lord and serve Him faithfully with all your heart; for consider how great are the things He has done for you."},{"num":25,"verse":"But if you still do wickedly, both you and your king shall be swept away."}]