[{"header":"Samuel’s Spotless Leadership"},{"num":12,"verse":"Then Samuel said to all Israel, “I have listened to everything you have said to me and appointed a king over you. "},{"num":2,"verse":"And now, here is the king who will lead you. I am old and gray, but my sons are with you. I have led you from my youth until this day. "},{"num":3,"verse":"Here I am. Testify against me in front of the Lord and in front of his anointed king. Did I take anyone’s ox? Did I take anyone’s donkey? Did I cheat or oppress anyone? Did I take a bribe from anyone to look the other way? ⌞If so,⌟ I will give it all back.”"},{"num":4,"verse":"They answered, “You didn’t cheat us, oppress us, or take anything from anyone.”"},{"num":5,"verse":"Samuel told them, “The Lord is a witness to what you’ve said, and his anointed king is a witness today that you’ve found nothing in my hands.”"},{"num":6,"verse":"Samuel told the people, “The Lord appointed Moses and Aaron and brought your ancestors out of Egypt. "},{"num":7,"verse":"Now, stand up while I put you on trial in front of the Lord and cite all the righteous things the Lord did for you and your ancestors. "},{"num":8,"verse":"When your ancestors went with Jacob to Egypt ⌞and were oppressed⌟, they cried out to the Lord, who sent Moses and Aaron to bring them out of Egypt. The Lord settled them in this place. "},{"num":9,"verse":"But they forgot the Lord their God. So he handed them over to Sisera, who was the commander of the army of Hazor, to the Philistines, and to the king of Moab. All of them fought against your ancestors. "},{"num":10,"verse":"Then they cried out to the Lord and said, ‘We have sinned. We have abandoned the Lord and served other gods and goddesses—the Baals and the Astartes. But rescue us from our enemies now, and we will serve you.’"},{"num":11,"verse":"“Then the Lord sent Jerubbaal, Bedan, Jephthah, and Samuel and rescued you from your enemies on every side so that you could live securely. "},{"num":12,"verse":"But when you saw King Nahash of Ammon coming to attack you, you told me, ‘No, a king should rule over us,’ though the Lord your God was your king."},{"header":"The New Kingship"},{"num":13,"verse":"“Now, here is the king you have chosen, the one you asked for. See, the Lord has put a king over you. "},{"num":14,"verse":"If you fear the Lord, serve him, obey him, and don’t rebel against what he says, then you and your king will follow the Lord your God. "},{"num":15,"verse":"But if you don’t obey the Lord, if you rebel against what he says, then the Lord will be against you as he was against your ancestors. "},{"num":16,"verse":"Now then, stand still and watch this great thing the Lord is going to do right before your eyes. "},{"num":17,"verse":"Isn’t the wheat being harvested today? I will call on the Lord, and he’ll send thunder and rain. Then you will realize what a wicked thing you did in the Lord’s presence when you asked for a king.”"},{"num":18,"verse":"Then Samuel called on the Lord. That day the Lord sent thunder and rain so that all the people feared the Lord and Samuel very much."},{"num":19,"verse":"All the people pleaded with Samuel, “Pray to the Lord your God for us so that we will not die. We have added ⌞another⌟ evil thing to all our other sins by asking for a king.”"},{"num":20,"verse":"“Don’t be afraid,” Samuel told the people. “You did do all these evil things. But don’t turn away from the Lord. Instead, serve the Lord wholeheartedly. "},{"num":21,"verse":"Don’t turn away to follow other gods. They can’t help or rescue you, because they don’t exist. "},{"num":22,"verse":"For the sake of his great name, the Lord will not abandon his people, because the Lord wants to make you his people. "},{"num":23,"verse":"It would be unthinkable for me to sin against the Lord by failing to pray for you. I will go on teaching you the way that is good and right. "},{"num":24,"verse":"Fear the Lord, and serve him sincerely. Consider the great things he did for you. "},{"num":25,"verse":"But if you go on doing what is evil, you and your king will be wiped out.”"}]