[{"header":"Samuel’s Last Words to Israel"},{"num":12,"verse":"Then Samuel said to all Israel, “See, I have listened to all you have said to me. I have chosen a king to rule over you. "},{"num":2,"verse":"Now see, the king walks in front of you. But I am old. My hair is growing white. See, my sons are with you. I have walked in front of you since I was young, until this day. "},{"num":3,"verse":"Here I am. Speak against me to the Lord and Saul His chosen one. Whose bull have I taken? Whose donkey have I taken? To whom have I not been honest? For whom have I made it hard? From whose hand have I taken pay for closing my eyes to the truth? I will return it to you.” "},{"num":4,"verse":"They said, “You have always been honest with us. You have not made it hard for us, or taken anything from any man’s hand.” "},{"num":5,"verse":"Samuel said to them, “The Lord has heard you. And His chosen one has heard this day that you have found nothing in my hand.” And they said, “The Lord has heard.” "},{"num":6,"verse":"Samuel said to the people, “The Lord is the One Who chose Moses and Aaron and brought your fathers out of the land of Egypt. "},{"num":7,"verse":"Now stand where you are, that I may argue with you before the Lord about all His saving acts which He did for you and your fathers. "},{"num":8,"verse":"When Jacob went into Egypt and the Egyptians made it hard for them, your fathers cried to the Lord. And the Lord sent Moses and Aaron. They brought your fathers out of Egypt, and had them live in this place. "},{"num":9,"verse":"But they forgot the Lord their God. So He sold them into the hand of Sisera, captain of the army of Hazor, and into the hand of the Philistines, and into the hand of the king of Moab. And they fought against them. "},{"num":10,"verse":"Then they cried out to the Lord and said, ‘We have sinned because we have turned away from the Lord. We have worshiped the false gods, the Baals and the Ashtaroth. But now save us from the power of those who hate us, and we will worship You.’ "},{"num":11,"verse":"The Lord sent Jerubbaal, Bedan, Jephthah and Samuel, and saved you from the power of those all around who hated you. So you were safe. "},{"num":12,"verse":"But then you saw that Nahash the king of the Ammonites came against you. So you said to me, ‘No! A king must rule over us,’ when the Lord your God was your King. "},{"num":13,"verse":"Now see the king you have chosen, the king you have asked for. See, the Lord has given you a king. "},{"num":14,"verse":"Fear the Lord and worship Him. Listen to His voice and do not go against the Word of the Lord. If both you and the king who rules over you will follow the Lord your God, it will be well. "},{"num":15,"verse":"But if you will not listen to the voice of the Lord, and go against the Lord’s Word, then the hand of the Lord will be against you, as it was against your fathers. "},{"num":16,"verse":"Now stand still and see this great thing which the Lord will do in front of your eyes. "},{"num":17,"verse":"Is it not the time to gather grain today? I will call to the Lord, and He will send thunder and rain. Then you will know and see that you have done a bad sin in the eyes of the Lord by asking for a king.” "},{"num":18,"verse":"So Samuel called to the Lord, and the Lord sent thunder and rain that day. And all the people were very much afraid of the Lord and Samuel."},{"num":19,"verse":"Then all the people said to Samuel, “Pray to the Lord your God for your servants, so we will not die. For we have added to all our sins this bad thing, to ask for a king.” "},{"num":20,"verse":"Samuel said to the people, “Do not be afraid. You have done all these sins. But do not turn aside from following the Lord. Worship the Lord with all your heart. "},{"num":21,"verse":"Do not turn aside after things that have no worth and cannot save you, for they are nothing. "},{"num":22,"verse":"The Lord will not leave His people alone, because of His great name. The Lord has been pleased to make you His people. "},{"num":23,"verse":"And as for me, far be it from me that I should sin against the Lord by not praying for you. But I will teach you the good and the right way. "},{"num":24,"verse":"Only fear the Lord and be faithful to worship Him with all your heart. Think of the great things He has done for you. "},{"num":25,"verse":"But if you still sin, both you and your king will be destroyed.”"}]