[{"header":"Consecration of the Firstborn"},{"num":13,"verse":"The Lord spoke to Moses, "},{"num":2,"verse":"“Consecrate to me every firstborn male. Whatever is the first to open the womb among the Israelis, both of humans and of animals, belongs to me.”"},{"header":"The Festival of Unleavened Bread"},{"num":3,"verse":"Then Moses told the people, “Remember this day on which you came out of Egypt, from the house of bondage, because the Lord brought you out from this place with a strong show of force. Moreover, nothing leavened is to be eaten. "},{"num":4,"verse":"Today, in the month of Abib, you are going out. "},{"num":5,"verse":"When the Lord brings you to the land of the Canaanite, the Hittite, the Amorite, the Hivite, and the Jebusite, which he swore to your ancestors to give you—a land flowing with milk and honey—you are to observe this ritual in this month. "},{"num":6,"verse":"You are to eat unleavened bread for seven days, and on the seventh day there is to be a festival to the Lord. "},{"num":7,"verse":"Unleavened bread is to be eaten for seven days, and nothing leavened is to be seen among you, nor is leaven to be seen among you throughout your territory. "},{"num":8,"verse":"And you are to tell your child on that day, ‘This is because of what the Lord did for me when I came out of Egypt.’ "},{"num":9,"verse":"It is to be a sign for you on your hand and a reminder on your forehead, so that you may speak about the instruction of the Lord; for the Lord brought you out of Egypt with a strong show of force. "},{"num":10,"verse":"You are to keep this ordinance at its appointed time from year to year.”"},{"header":"The Redemption of the Firstborn"},{"num":11,"verse":"“When the Lord brings you to the land of the Canaanite and gives it to you, just as he promised you and your ancestors, "},{"num":12,"verse":"you are to dedicate to the Lord everything that first opens the womb. All the firstborn males of your livestock belong to the Lord. "},{"num":13,"verse":"You are to redeem every firstborn donkey with a lamb, and if you don’t redeem it, you are to break its neck. You are to redeem every firstborn among your sons. "},{"num":14,"verse":"Then when your child asks you in the future, ‘What is this?’, you are to say to him, ‘The Lord brought us out of Egypt, from the house of bondage with a strong show of force. "},{"num":15,"verse":"And when Pharaoh stubbornly refused to let us go, the Lord killed every firstborn in the land of Egypt, from the firstborn of humans to the firstborn of animals. Therefore, I sacrifice to the Lord every male that first opens the womb, but I redeem every firstborn of my sons. "},{"num":16,"verse":"It is to be a sign on your hand and an emblem on your forehead, because the Lord brought us out of Egypt with a strong show of force.’”"},{"header":"God Guides the People in the Desert"},{"num":17,"verse":"When Pharaoh let the people go, God did not lead them along the road through the land of the Philistines, even though it was nearer, because God had said, “If the people face war, they may change their minds and return to Egypt.” "},{"num":18,"verse":"So God led the people the roundabout way of the desert toward the Reed Sea. The Israelis went up from the land of Egypt in military formation. "},{"num":19,"verse":"Moses took the bones of Joseph with him, because Joseph had made the Israelis take this solemn oath: “God will certainly take notice of you, and then you must carry my bones up with you from here.” "},{"num":20,"verse":"They left Succoth and camped in Etham at the edge of the desert. "},{"num":21,"verse":"The Lord went in front of them by day in a pillar of cloud to lead them along the way, and by night in a pillar of fire to give them light, so they could travel both day and night. "},{"num":22,"verse":"Neither the pillar of cloud by day nor the pillar of fire by night left its place in front of the people."}]