[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "38:14-28 Jeremiah was not forward to repeat the warnings, which seemed only to endanger his own life, and to add to the king's guilt, but asked whether he feared to do the will of God. The less men fear God, the more they fear men; often they dare not act according to their own judgments and consciences.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So - And. In addition to the ridicule there shall be the miseries of the capture.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou shalt cause this city to be burned - literally, as margin. It shall be thy own act as completely as if done with thine own hand. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thou shalt cause this city to be burned - literally, as margin. It shall be thy own act as completely as if done with thine own hand. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25. Kings are often such only in title; they are really under the power of their subjects.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It could hardly be imagined that Zedekiah should have this private discourse with Jeremiah, but some or other of his courtiers would take notice of it; but yet it argues that this poor prince was in a miserable subjection to them, that he could discourse with nobody but they must come and inquire what he said. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But if the princes hear that I have talked to thee,.... Which the king suspected they would; and could hardly think but somebody or other would see him and the prophet talking together; who would be officious enough to go and acquaint the princes with it, though he had endeavoured to be as private as possible; however, to provide against the worst, he instructs Jeremiah what to say to them, should they hear of their being together: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they come unto thee: as he did not doubt but they would, as soon as ever they had notice of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and say unto thee, declare unto us now what thou hast said unto the king; hide it not from us, and we will not put thee to death; also what the king said unto thee: the king knew how inquisitive they would be, and sift the prophet to the bottom, to know both what the prophet said to the king, about the state of affairs respecting the Chaldeans, and the surrender of the city to them, which they supposed to be the subject of the discourse; and what were the king's thoughts about it, and his determinations concerning it; and in order to make the prophet easy, and more free and open to tell the whole matter, he suggests they would promise him his life should not be taken away. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and say unto thee, declare unto us now what thou hast said unto the king; hide it not from us, and we will not put thee to death; also what the king said unto thee: the king knew how inquisitive they would be, and sift the prophet to the bottom, to know both what the prophet said to the king, about the state of affairs respecting the Chaldeans, and the surrender of the city to them, which they supposed to be the subject of the discourse; and what were the king's thoughts about it, and his determinations concerning it; and in order to make the prophet easy, and more free and open to tell the whole matter, he suggests they would promise him his life should not be taken away. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But if the princes hear that I have talked with thee, and they come unto thee, and say unto thee, Declare unto us now what thou hast said unto the king, hide it not from us, and we will not put thee to death; also what the king said unto thee:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "From the king's weakness of character, and his dependence on his evil counsellors, neither could this interview have any result. Partly from want of firmness, but chiefly from fear of the reproaches of his princes, he did not venture to surrender himself and the city to the Chaldeans. Hence he did not wish that his interview with the prophet should be known, partly for the purpose of sparing himself reproaches from the princes, partly also, perhaps, not to expose the prophet to further persecutions on the part of the great men. Accordingly, he dismissed Jeremiah with this instruction: \"Let no man know of these words, lest thou die.\" But if the princes should learn that the king had been speaking with him, and asked him, \"Tell us, now, what thou hast said to the king, do not hide it from us, and we will not kill thee; and what did the king say to thee?\" then he was to say to them, \"I presented my supplication before the king, that he would not send me back to the house of Jonathan, to die there.\" As to the house of Jonathan, see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 37:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On מפּיל תּחנּתי cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 36:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 37:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]