[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "These men have done evil. . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is noticeable that some MSS. of the LXX., following apparently a different text, represent the Eunuch as assuming that the king himself had given the order, “Thou hast done evil in all that thou hast done.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He is like to die for hunger.—Literally, and he dies . . . painting vividly what would be the certain issue if no help were sent. It lies in the nature of the case that those who had thrown the prophet into the pit were not likely to continue the supply of his daily rations (Jeremiah 37:21), and the scarcity that prevailed in the besieged city made it all but impossible that his friends, even if they could gain access to him, should help him out of their own resources. Ebed-melech had obviously no power to help him without the king’s sanction.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "He is like to die for hunger.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and he dies . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " painting vividly what would be the certain issue if no help were sent. It lies in the nature of the case that those who had thrown the prophet into the pit were not likely to continue the supply of his daily rations (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 37:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the scarcity that prevailed in the besieged city made it all but impossible that his friends, even if they could gain access to him, should help him out of their own resources. Ebed-melech had obviously no power to help him without the king’s sanction.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "38:1-13 Jeremiah went on in his plain preaching. The princes went on in their malice. It is common for wicked people to look upon God's faithful ministers as enemies, because they show what enemies the wicked are to themselves while impenitent. Jeremiah was put into a dungeon. Many of God's faithful witnesses have been privately made away in prisons. Ebed-melech was an Ethiopian; yet he spoke to the king faithfully, These men have done ill in all they have done to Jeremiah. See how God can raise up friends for his people in distress. Orders were given for the prophet's release, and Ebed-melech saw him drawn up. Let this encourage us to appear boldly for God. Special notice is taken of his tenderness for Jeremiah. What do we behold in the different characters then, but the same we behold in the different characters now, that the Lord's children are conformed to his example, and the children of Satan to their master?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ebed-melech - i. e., the king's slave. By \"Ethiopian\" or Cushite is meant the Cushite of Afric. It seems (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as if such eunuchs (or, chamberlains) took their names from the king, while the royal family and the princes generally bore names compounded with the appellations of the Deity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. die for hunger in the place where he is; for … no … bread in … city—(Compare Jer 37:21). He had heretofore got a piece of bread supplied to him. \"Seeing that there is the utmost want of bread in the city, so that even if he were at large, there could no more be regularly supplied to him, much less now in a place where none remember or pity him, so that he is likely to die for hunger.\" \"No more bread,\" that is, no more left of the public store in the city (Jer 37:21); or, all but no bread left anywhere [Maurer].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The courage of this good eunuch was very remarkable; he did not stay till the king came in, but went to the king, as he was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sitting in the gate of Benjamin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", administering justice, or receiving and answering petitions, where doubtless he was not alone, and probably was attended there by some of those princes who had thrown Jeremiah into this miserable place. Ebed-melech was not afraid of them, but openly complains of their cruelty to the king, and tells him that Jeremiah would be starved to death: those who were alive in the city could not long subsist, for the stores were almost all spent, and though the king had appointed the prophet an allowance, yet being in such a hole, and there being so little bread left in the city, it was not likely there would be much care taken of him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My lord the king,.... He addresses him as a courtier, with great reverence and submission, and yet with great boldness: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "these men have done evil in all that they have done to Jeremiah the prophet; meaning the princes, who might be present, and whom he pointed at, and mentioned by name; which showed great courage and faithfulness, as well as great zeal for, and attachment to, the prophet; to charge after this manner persons of such great authority so publicly, and to the king, whom the king himself stood in fear of: he first brings a general charge against them, that they had done wrong in everything they had done to the prophet; in their angry words to him; in smiting him, and putting him in prison in Jonathan's house; and particularly in their last instance of ill will to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whom they have cast into the dungeon; he does not say where, or describe the dungeon, because well known to the king, and what a miserable place it was; and tacitly suggests the cruelty and inhumanity of the princes: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he is like to die for hunger in the place where he is, for there is no more bread in the city; or very little; there was none to be had but with great difficulty, as Kimchi observes; and therefore though the king had ordered a piece of bread to be given him daily, as long as there was any in the city; yet it being almost all consumed, and the prophet being out or sight, and so out of mind, and altogether disregarded, must be in perishing circumstances, and near death; and must inevitably perish, unless some immediate care be taken of him. It may be rendered, \"he will die\" (t), &c. or the sense is, bread being exceeding scarce in the city, notwithstanding the king's order, very little was given to Jeremiah, while he was in the court of the prison; so that he was half starved, and was a mere skeleton then, and would have died for hunger there; wherefore it was barbarous in the princes to cast such a man into a dungeon. It may be rendered, \"he would have died for hunger in the place where he was, seeing there was no more bread in the city\" (u); wherefore, if the princes had let him alone where he was, he would have died through famine; and therefore acted a very wicked part in hastening his death, by throwing him into a dungeon; this is Jarchi's sense, with which Abarbinel agrees. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) \"morietur enim\", Schmidt. (u) \"Qui moriturus fuerat in loco suo propter famem\", Junius & Tremellius, Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) \"morietur enim\", Schmidt. (u) \"Qui moriturus fuerat in loco suo propter famem\", Junius & Tremellius, Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "My lord the king, {f} these men have done evil in all that they have done to Jeremiah the prophet, whom they have cast into the dungeon; and he is certain to die from hunger in the place where he is: for there is no more bread in the city.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "My lord the king, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " these men have done evil in all that they have done to Jeremiah the prophet, whom they have cast into the dungeon; and he is certain to die from hunger in the place where he is: for ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no more bread in the city.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) By this is declared that the prophet found more favour at this strangers hands, than he did by all them of his country, which was to their great condemnation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he is like to die",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (mg. Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he is dead",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the place where he is because of the famine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is dead of hunger on the spot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jeremiah was at death’s door already, as suffering at once from hunger and from confinement in so dismal a dungeon. If food was almost exhausted, prisoners would naturally be the first to suffer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for there is no more bread in the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This again is an exaggeration shewing the eagerness of the speaker. If it had been absolutely true, there could have been no object in freeing Jeremiah. The obvious sense is that there was so scanty a supply of provision that there was little or no chance of any reaching Jeremiah in the place where he was then confined.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there is ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "no more bread in the city.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It would almost seem as if the little remaining bread had been brought together by command of the magistrates, and that it was given out in rations by them (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 37:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jeremiah 38:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The deliverance of Jeremiah. Ebedmelech the Cushite, a eunuch, heard of what had happened to Jeremiah. אישׁ סריס .haimer signifies a eunuch: the אישׁ shows that סריס is here to be taken in its proper meaning, not in the metaphorical sense of an officer of the court. Since the king had many wives (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 38:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), the presence of a eunuch at the court, as overseer of the harem, cannot seem strange. The law of Moses, indeed, prohibited castration (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but the man was a foreigner, and had been taken by the king into his service as one castrated. עבד מלך is a proper name (otherwise it must have been written המּלך); the name is a genuine Hebrew one, and probably may have been assumed when the man entered the service of Zedekiah. - On hearing of what had occurred, the Ethiopian went to the king, who was sitting in the gate of Benjamin, on the north wall of the city, which was probably the point most threatened by the besiegers, and said to him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 38:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"My lord, O king, these men have acted wickedly in all that they have done to Jeremiah the prophet, whom they have cast into the pit; and he is dying of hunger on the spot, for there is no more bread in the city.\" הרעוּ את־א, lit.,: \"they have done wickedly what they have done.\" ויּמת cannot be translated, \"and he died on the spot,\" for Ebedmelech wishes to save him before he dies of hunger. But neither does it stand for וימת, \"so that he must die.\" The imperfect with Vav consecutive expresses the consequence of a preceding act, and usually stands in the narrative as a historic tense; but it may also declare what necessarily follows or will follow from what precedes; cf. Ewald, 342, a. Thus ויּמת stands here in the sense, \"and so he is dying,\" i.e., \"he must die of hunger.\" תּחתּיו, \"on his spot,\" i.e., on the place where he is; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reason, \"for there is no longer any bread (הלחם with the article, the necessary bread) in the city,\" is not to be taken in the exact sense of the words, but merely expresses the greatest deficiency in provisions. As long as Jeremiah was in the court of the prison, he received, like the officers of the court, at the king's order, his ration of bread every day (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 37:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But after he had been cast into the pit, that royal ordinance no longer applied to him, so that he was given over to the tender mercies of others, from whom, in the prevailing scarcity of bread, he had not much to hope for.",
        "children": []
      }
    ]
  }
]