[[],[{"type":"header","content":"On Human Sacrifice and Immoralities"},{"type":"prose","content":"Then the  spoke to Moses, saying, "}],[{"type":"prose","content":"“Moreover, you shall say to the children of Israel,‘Any Israelite or any stranger residing in Israel who gives any of his children to Molech (the god of the Ammonites) [as a human sacrifice] shall most certainly be put to death; the people of the land shall stone him with stones. "}],[{"type":"prose","content":"I will also set My face against that man [opposing him, withdrawing My protection from him] and will cut him off from his people [excluding him from the atonement made for them], because he has given some of his children to Molech, so as to defile My sanctuary and profane My holy name. "}],[{"type":"prose","content":"If the people of the land should ever tolerate that man when he gives any of his children [as a burnt offering] to Molech, and fail to put him to death [as My law requires], "}],[{"type":"prose","content":"then I shall set My face against that man and against his [extended] family, and I will cut off from their people both him and all who follow him in playing the prostitute (commit apostasy) with Molech."}],[{"type":"prose","content":"‘As for the person who turns to mediums [who consult the dead] or to spiritists, to play the prostitute after them, I shall set My face against that person and will cut him off from his people [excluding him from the atonement made for them]. "}],[{"type":"prose","content":"You shall consecrate yourselves therefore, and be holy; for I am the  your God. "}],[{"type":"prose","content":"You shall keep My statutes and do them. I am the  who sanctifies you."}],[{"type":"prose","content":"‘If anyone curses his father or mother, he shall most certainly be put to death; he has cursed his father or mother; his blood is on him [that is, he bears full responsibility for the consequences]."}],[{"type":"prose","content":"‘The man who commits adultery with another’s wife, even his neighbor’s wife, the adulterer and the adulteress shall most certainly be put to death. "}],[{"type":"prose","content":"The man who lies [intimately] with his father’s wife has uncovered his father’s nakedness; both of them shall most certainly be put to death; their blood is on them. "}],[{"type":"prose","content":"If a man lies [intimately] with his daughter-in-law, both of them shall most certainly be put to death; they have committed incest; their blood is on them. "}],[{"type":"prose","content":"If a man lies [intimately] with a male as if he were a woman, both men have committed a detestable (perverse, unnatural) act; they shall most certainly be put to death; their blood is on them. "}],[{"type":"prose","content":"It is immoral  shameful if a man marries a woman and her mother; all three shall be burned in fire, so that there will be no immorality among you. "}],[{"type":"prose","content":"If a man has intimate relations with an animal, he shall most certainly be put to death; you shall kill the animal also. "}],[{"type":"prose","content":"If a woman approaches any animal to mate with it, you shall kill the woman and the animal; they shall most certainly be put to death; their blood is on them."}],[{"type":"prose","content":"‘If a man takes his sister, his father’s daughter or his mother’s daughter, so that he sees her nakedness and she sees his nakedness, it is a disgrace; and they shall be cut off in the sight of the sons of their people. He has uncovered his sister’s nakedness; he bears [responsibility for] his guilt. "}],[{"type":"prose","content":"If a man lies [intimately] with a woman during her menstrual cycle and uncovers her nakedness, he has exposed her flow, and she has uncovered the flow of her blood; both of them shall be cut off from their people [excluding them from the atonement made for them]. "}],[{"type":"prose","content":"You shall not uncover the nakedness of (have intimate relations with) your mother’s sister or your father’s sister, for such a one has uncovered his blood relative; they will bear their guilt. "}],[{"type":"prose","content":"If  a man who lies [intimately] with his uncle’s wife, he has uncovered his uncle’s nakedness; they will bear their sin. They will die childless. "}],[{"type":"prose","content":"If a man takes his brother’s wife, it is a hated  unclean thing; he has uncovered his brother’s nakedness. They will be childless."}],[{"type":"prose","content":"‘Therefore keep all My statutes and all My ordinances and do them, so that the land where I am bringing you to live may not vomit you out [as it did those before you]. "}],[{"type":"prose","content":"You shall not follow the statutes (laws, practices, customs) of the nation which I am driving out before you; for they did all these things, and therefore I have loathed them. "}],[{"type":"prose","content":"But I have said to you, “You are to inherit  take possession of their land, and I will give it to you to possess, a land [of plenty] flowing with milk and honey.” I am the  your God, who has separated you from the peoples (pagan nations). "}],[{"type":"prose","content":"You are therefore to make a distinction between the [ceremonially] clean animal and the unclean, and between the unclean bird and the clean; and you shall not make yourselves detestable by animal or by bird or by anything that crawls on the ground, which I have set apart from you as unclean. "}],[{"type":"prose","content":"You are to be holy to Me; for I the  am holy, and have set you apart from the peoples (nations) to be Mine."}],[{"type":"prose","content":"‘A man or woman who is a medium [who pretends to consult the dead] or who is a spiritist shall most certainly be put to death, and be stoned with stones; their blood is on them.’”"}]]