[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "LXII.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) For Zion’s sake . . .—Opinions again differ as to the speaker. Is he the prophet, or the Servant of Jehovah, or Jehovah Himself ? On the whole, the second view seems to be most in harmony with what follows. The true Servant will carry on what in the language of later theology may be called his mediatorial intercessory work, that there may be no delay in the fulfilment of the glorious promises that have just been uttered.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "For Zion’s sake . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Opinions again differ as to the speaker. Is he the prophet, or the Servant of Jehovah, or Jehovah Himself ? On the whole, the second view seems to be most in harmony with what follows. The true Servant will carry on what in the language of later theology may be called his mediatorial intercessory work, that there may be no delay in the fulfilment of the glorious promises that have just been uttered.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "As brightness.—Better, as the brightness of morning, the word being thus used in Isaiah 60:3, Proverbs 4:18.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As brightness.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "as the brightness of morning, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the word being thus used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "As a lamp . . .—Better, as a burning torch.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As a lamp . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "as a burning torch.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE HEAVENLY WORKERS AND THE EARTHLY WATCHERSIsaiah 62:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE HEAVENLY WORKERS AND THE EARTHLY WATCHERS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Two remarks of an expository nature will prepare the way for the consideration of these words. The first is that the speaker is the personal Messiah. The second half of Isaiah’s prophecies forms one great whole, which might be called The Book of the Servant of the Lord. One majestic figure stands forth on its pages with ever-growing clearness of outline and form. The language in which He is described fluctuates at first between the collective Israel and the one Person who is to be all that the nation had failed to attain. But even near the beginning of the prophecy we read of ‘My servant whom I uphold,’ whose voice is to be low and soft, and whose meek persistence is not to fail till He have ‘set judgment in the earth.’ And as we advance the reference to the nation becomes less and less possible, and the recognition of the person more and more imperative. At first the music of the prophetic song seems to move uncertainly amid sweet sounds, from which the true theme by degrees emerges, and thenceforward recurs over and over again with deeper, louder harmonies clustering about it, till it swells into the grandeur of the choral close.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In the chapter before our text we read, ‘The Spirit of the Lord God is upon me, because the Lord hath anointed me to preach good tidings unto the meek.’ Throughout the remainder of the prophecy, with the exception of one section which contains the prayer of the desolate Israel, this same person continues to speak; and who he is was taught in the synagogue of Nazareth. Whilst the preceding chapter, then, brings in Christ as proclaiming the great work of deliverance for which He is anointed of God, the following chapter presents Him as ‘treading the wine-press alone,’ which is a symbol of the future judgment by the glorified Saviour. Between these two prophecies of the earthly life and of the still future judicial energy, this chapter of our text lies, referring, as I take it, to the period between these two-that is, to all the ages of the Church’s development on earth. For these Christ here promises His continual activity, and His continual bestowment of grace to His servants who watch the walls of His Jerusalem.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The second point to be noticed is the remarkable parallelism in the expressions selected as the text: ‘I will not hold ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " peace’; the watchmen ‘shall never hold ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their peace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ And His command to them is literally, ‘Ye that remind Jehovah-no ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " {or silence} to you, and give not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So we have here Christ, the Church, and God all represented as unceasingly occupied in the one great work of establishing ‘Zion’ as the centre of light, salvation, and righteousness for the whole world. The consideration of these three perpetual activities may open for us some great truths and stimulating lessons.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, The glorified Christ is constantly working for His Church. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, then, The glorified Christ is constantly working for His Church.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We are too apt to regard our Lord’s real work as all lying in the past, and, from the very greatness of our estimate of what He has done, to forget the true importance of what He evermore does. ‘Christ that died’ is the central object of trust and contemplation for devout souls-and that often to the partial hiding of Christ that is ‘risen again, who is even at the right hand of God, who also maketh intercession for us.’ But Scripture sets forth the present glorious life of our ascended Lord under two contrasted and harmonious aspects-as being rest, and as being continuous activity in the midst of rest. He was ‘received up into heaven, and sat on the right hand of God.’ In that session on the throne manifold and mighty truths are expressed. It proclaims the full accomplishment of all the purposes of His earthly ministry; it emphasises the triumphant completion of His redeeming work by His death; it proclaims the majesty of His nature, which returns to the ‘glory which He had with the Father before the world was’; it shows to the world, as on some coronation day, its King on His throne, girded with power and holding the far-reaching sceptre of the universe; it prophesies for men, in spite of all present sin and degradation, a share in the dominion which manhood has in Christ attained, for though we see not yet all things put under Him, we see Jesus crowned with glory and honour. It prophesies, too, His final victory over all that sets itself in unavailing antagonism to His love. It points us backward to an historical fact as the basis of all our hopes for ourselves and for our fellows, giving us the assurance that the world’s deliverance will come from the slow operation of the forces already lodged in its history by Christ’s finished work. It points us forwards to a future as the goal of all these hopes, giving us that confidence of victory which He has who, having kindled the fire on earth, henceforward sits at God’s right hand, waiting in the calm and sublime patience of conscious omnipotence and clear foreknowledge ‘until His enemies become His footstool.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But whilst on the one side Christ rests as from a perfected work which needs no addition nor repetition, on the other He ‘rests not day nor night.’ And this aspect of His present state is as distinctly set forth in Scripture as that is. Indeed the words already quoted as embodying the former phase contain the latter also. For is not ‘the right hand of God’ the operative energy of the divine nature? And is not ‘sitting at the right hand of God’ equivalent to possessing and wielding that unwearied, measureless power? Are there not blended together in this pregnant phrase the ideas of profoundest calm and of intensest action, that being expressed by the attitude, and this by the locality? Therefore does the evangelist who uses the expression expand it into words which wonderfully close his gospel, with the same representation of Christ’s swift and constant activity as he had been all along pointing out as characterising His life on earth. ‘They went forth,’ says he, ‘and preached everywhere’-so far the contrast between the Lord seated in the heavens and His wandering servants fighting on earth is sharp and almost harsh. But the next words tone it down, and weave the two apparently discordant halves of the picture into a whole: ‘the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "working",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with them.’ Yes! in all His rest He is full of work, in all their toils He shares, in all their journeys His presence goes beside them. Whatever they do is His deed, and the help that is done upon the earth He doeth it all Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Is not this blessed conviction of Christ’s continuous operation in and for His Church that which underlies, as has often been pointed out, the language of the introduction to the Acts of the Apostles, where mention is made of the former treatise that told ‘all which Jesus began both to do and teach’? The gospel records the beginning, the Book of the Acts the continuance; it is one biography in two volumes. Being yet present with them He spoke and acted. Being exalted He ‘speaketh from heaven,’ and from the throne carries on the endless series of His works of power and healing. The whole history is shaped by the same conviction. Everywhere ‘the Lord’ is the true actor, the source of all the life which is in the Church, the arranger of all the providences which affect its progress. The Lord adds to the Church daily. His name works miracles. To the Lord believers are added. His angel, His Spirit, bring messages to His servants. He appears to Paul, and speaks to Ananias. The Gentiles turn to the Lord because the hand of the Lord is with the preachers. The Lord calls Paul to carry the gospel to Macedonia. The Lord opens the heart of Lydia, and so throughout. Not ‘the Acts of the Apostles,’ but ‘the Acts of the Lord in and by His servants,’ is the accurate title of this book. The vision which flashed angel radiance on the face, and beamed with divine comfort into the heart, of Stephen, was a momentary revelation of an abiding reality, and completes the representation of the Saviour throned beside Almighty power. He beheld his Lord, not seated, as if careless or resting, while His servant’s need was so sore, but as if risen with intent to help, and ready to defend-’",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "standing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the right hand of God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And when once again the heavens opened to the rapt eyes of John in Patmos, the Lord whom he beheld was not only revealed as glorified in the lustre of the inaccessible light, but as actively sustaining and guiding the human reflectors of it. He ‘holdeth the seven stars in His right hand,’ and ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "walketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the midst of the seven golden candlesticks.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Not otherwise does my text represent the present relation of Christ to His Church. It speaks of a continuous forth-putting of power, which it is, perhaps, not over-fanciful to regard as dimly set forth here in a twofold form-namely, work and word. At all events, that division stands out clearly on the pages of the New Testament, which ever holds forth the double truth of our Lord’s constant action on, in, through, and for His Zion, and of our High Priest’s constant intercession.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘I will not rest.’ Through all the ages His power is in exercise. He inspires in good men all their wisdom, and every grace of life and character. He uses them as His weapons in the contest of His love with the world’s hatred; but the hand that forged, and tempered, and sharpened the blade is that which smites with it; and the axe must not boast itself against him that heweth. He, the Lord of lords, orders providences, and shapes the course of the world for that Church which is His witness: ‘Yea, He reproved kings for their sake, saying, Touch not Mine anointed, and do My prophets no harm.’ The ancient legend which told how, on many a well-fought field, the ranks of Rome discerned through the battle-dust the gleaming weapons and white steeds of the Great Twin Brethren far in front of the solid legions, is true in loftier sense in our Holy War. We may still see the vision which the leader of Israel saw of old, the man with the drawn sword in his hand, and hear the majestic word, ‘As Captain of the Lord’s host am I now come.’ The Word of God, with vesture dipped in blood, with eyes alit with His flaming love, with the many crowns of unlimited sovereignty upon His head, rides at the head of the armies of heaven; ‘and in righteousness doth He judge and make war.’ For the single soul struggling with daily tasks and petty cares, His help is near and real, as for the widest work of the collective whole. He sends none of us tasks in which He has no share. The word of this Master is never ‘Go,’ but ‘Come.’ He unites Himself with all our sorrows, with all our efforts. ‘The Lord also working with them’ is a description of all the labours of Christian men, be they great or small.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor is this all. There still remains the wonderful truth of His continuous intercession for us. In its widest meaning that word expresses the whole of the manifold ways by which Christ undertakes and maintains our cause. But the narrower signification of prayer on our behalf is applicable, and is in Scripture applied, to our Lord. As on earth, the climax of all His intercourse with His disciples was that deep yet simple prayer which forms the Holy of Holies of John’s Gospel, so in heaven His loftiest office for us is set forth under the figure of His intercession. Before the Throne stands the slain Lamb, and therefore do the elders in the outer circle bring acceptable praises. Within the veil stands the Priest, with the names of the tribes blazing on the breastplate and on the shoulders of His robes, near the seat of love, near the arm of power. And whatever difficulty may surround that idea of Christ’s priestly intercession, this at all events is implied in it, that the mighty work which He accomplished on earth is ever present to the divine mind as the ground of our acceptance and the channel of our blessings; and this further, that the utterance of Christ’s will is ever in harmony with the divine purpose. Therefore His prayer has in it a strange tone of majesty, and, if we may so say, of command, as of one who knows that He is ever heard: ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they whom Thou hast given Me, be with Me where I am.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The instinct of the Church has, from of old, laid hold of an event in His earthly life to shadow forth this great truth, and has bid us see a pledge and a symbol of it in that scene on the Lake of Galilee: the disciples toiling in the sudden storm, the poor little barque tossing on the waters tinged by the wan moon, the spray dashing over the wearied rowers. They seem alone, but up yonder, in some hidden cleft of the hills, their Master looks down on all the weltering storm, and lifts His voice in prayer. Then when the need is sorest, and the hope least, He comes across the waves, making their surges His pavement, and using all opposition as the means of His approach, and His presence brings calmness, and immediately they are at the land.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So we have not only to look back to the Cross, but up to the Throne. From the Cross we hear a voice, ‘It is finished.’ From the Throne a voice, ‘For Zion’s sake I will not hold My peace, and for Jerusalem’s sake I will not rest.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Secondly, Christ’s servants on earth derive from Him a like perpetual activity for the same object. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Secondly, Christ’s servants on earth derive from Him a like perpetual activity for the same object.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Lord, who in the former portion of these verses declares His own purpose of unwearied action for Zion, associates with Himself in the latter portion the watchmen, whom He appoints and endows for functions in some measure resembling His own, and exercised with constancy derived from Him. ‘I have set watchmen upon thy walls, O Jerusalem, which shall never hold their peace day nor night.’ On the promise follows, as ever, a command {for all divine gifts involve the responsibility of their use, and it is not His wont either to bestow without requiring, or to require before bestowing}, ‘Ye that remind Jehovah, keep not silence.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is distinctly traceable before a reference to a two-fold form of occupation devolving on these Christ-sent servants. They are watchmen, and they are also God’s remembrancers. In the one capacity as in the other, their voices are to be always heard. The former metaphor is common in the Old Testament, as a designation of the prophetic office, but, in the accordance with the genius of the New Testament, as expressed on Pentecost, when the Spirit was poured out on the lowly as well as on the high, on the young as on the old, and all prophesied, it may be fairly extended to designated not to some selected few, but the whole mass of Christian people. The watchman’s office falls to be done by all who see the coming peril, and have a tongue to echo it forth. The remembrancer’s priestly office belongs to every member of Christ’s priestly kingdom, the lowest and least of whom has the privilege of unrestrained entry into God’s presence-chamber, and the power of blessing the world by faithful prayer. What should we think of a citizen in a beleaguered city, who saw enemy mounting the very ramparts, and gave no alarm because that was the sentry’s business? In such extremity every man is a soldier, and women and children can at least keep watch and raise shrill cries of warning. The gifts, then, here promised, and the duties that flow from them, are not the prerogatives or the tasks of any class or order, but the heritage and the burden of the Lord to every member of His Church.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our voices should ever be heard on earth. A solemn message is committed to us, by the very fact of our belief in Jesus Christ and His work. With that faith come responsibilities of which no Christian can denude himself. To warn the wicked man to turn from His wickedness; to blow the trumpet when we see the sword coming; to catch ever gleaming on the horizon, like the spears of an army through the dust of the march, the outriders and advance-guard of the coming of Him whose coming is life or death to all, and to lift up our voices with strength and say, ‘Behold your God’; to peal into the ears of men, sunken in earthliness and dreaming of safety, the cry which may startle and save; to ring out in glad tones to all who wearily ask, ‘Watchman, what of the night? will the night soon pass?’ the answer which the slow dawning east has breathed into our else stony lips, ‘The morning cometh’; to proclaim Christ, who came once to put away sin by the sacrifice of Himself, who comes ever, through the ages, to bless and uphold the righteousness which He loves and to destroy the iniquity which He hates, who will come at the last to judge the world-this is the never-ending task of the watchmen on the walls of Jerusalem. The New Testament calls it ‘preaching,’ proclaiming as a herald does. And both metaphors carry one common lesson of the manner in which the work should be done. With clear loud voice, with earnestness and decision, with faithfulness and self-oblivion, forgetting himself in his message, must the herald sound out the will of his King, the largess of his Lord. And the watchman who stands on his watch-tower whole nights, and sees foemen creeping through the gloom, or fire bursting out among the straw-roofed cottages within the walls, shouts with all his might the short, sharp alarm, that wakes the sleepers to whom slumber were death. Let us ponder the pattern.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our voices should ever be heard in heaven. They who trust God remind Him of His promises by their very faith; it is a mute appeal to His faithful love, which He cannot but answer. And, beyond that, their prayers come up for a memorial before God, and have as real an effect in furthering Christ’s kingdom on earth as is exercised by their entreaties and proclamations to men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How distinctly these words of our text define the region within which our prayers should ever move, and the limits which bound their efficacy! They ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "remind",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God. Then the truest prayer is that which bases itself on God’s uttered will, and the desires which are born of our own fancies or heated enthusiasms have no power with Him. The prayer that prevails is a reflected promise. Our office in prayer is but to receive on our hearts the bright rays of His word, and to flash them back from the polished surface to the heaven from whence they came.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These two forms of action ought to be inseparable. Each, if genuine, will drive us to the other, for who could fling himself into the watchman’s work, with all its solemn consequences, knowing how weak his voice was, and how deaf the ears that should hear, unless he could bring God’s might to his help? and who could honestly remind God of His promises and forget his own responsibilities? Prayerless work will soon slacken, and never bear fruit; idle prayer is worse than idle. You cannot part them if you would. How much of the busy occupation which is called ‘Christian work’ is detected to be spurious by this simple test! How much so-called prayer is reduced by it to mere noise, no better than the blaring trumpet or the hollow drum!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The power for both is derived from Christ. He sets the watchmen; He commands the remembrancers. From Him flows the power, from His good Spirit comes the desire, to proclaim the message. That message is the story of His life and death. But for what He does and is we should have nothing to say; but for His gift we should have no power to say it; but for His influence we should have no will to say it. He commands and fits us to be intercessors, for His mighty work brings us near to God; He opens for us access with confidence to God. He inspires our prayers. He ‘hath made us priests to God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And, as the Christian power of discharging these twofold duties is drawn from Christ, so our pattern is His manner of discharging them, and the condition of receiving the power is to abide in Him. He proposes Himself as our Example. He calls us to no labours which He has not Himself shared, nor to any earnestness or continuance in prayer which He has not Himself shown forth. This Master works in front of His men. The farmer that goes first among all the sowers, and heads the line of reapers in the yellowing harvest-field, may well have diligent servants. Our Master ‘went forth, weeping, bearing precious seed,’ and has left it in our hands to sow in all furrows. Our Master is the Lord of the harvest, and has borne the heat of the day before His servants. Look at the amount of work, actual hard work, compressed into these three short years of His ministry. Take the records of the words He spake on that last day of His public teaching, and see what unwearied toil they represent. Ponder upon that life till you catch the spirit which breathed through it all, and, like Him, embrace gladly the welcome necessity of labour for God, under the sense of a vocation conferred upon you, and of the short space within which your service must be condensed. ‘I must work the work of Him that sent me, while it is day: the night cometh, when no man can work.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ asks no romantic impossibilities from us, but He does ask a continuous, systematic discharge of the duties which depend on our relation to the world, and on our relation to Him. Let it be our life’s work to show forth His praise; let the very atmosphere in which we move and have our being be prayer. Let two great currents set ever through our days, which two, like the great movements in the ocean of the air, are but the upper and under halves of the one movement-that beneath with constant energy of desire rushing in from the cold poles to be warmed and expanded at the tropics, where the all-moving sun pours his directest rays; that above charged with rich gifts from the Lord of light, glowing with heat drawn from Him, and made diffusive by His touch, spreading itself out beneficent and life-bringing into all colder lands, swathing the world in soft, warm folds, and turning the polar ice into sweet waters.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In the tabernacle of Israel stood two great emblems of the functions of God’s people, which embodied these two sides of the Christian life. Day by day, there ascended from the altar of incense the sweet odour, which symbolised the fragrance of prayer as it wreathes itself upwards to the heavens. Night by night, as darkness fell on the desert and the camp, there shone through the gloom the hospitable light of the great golden candlestick with its seven lamps, whose steady rays outburned the stars that paled with the morning. Side by side they proclaimed to Israel its destiny to be the light of the world, to be a kingdom of priests.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The offices and the honour have passed over to us, and we shall fall beneath our obligations unless we let our light shine constantly before men, and let our voice rise like a fountain night and day’ before God- even as He did who, when every man went to his own house, went alone to the Mount of Olives, and in the morning, when every man returned to his daily task, went into the Temple and taught. By His example, by His gifts, by the motive of His love, our resting, working Lord says to each of us, ‘Ye that remind God, keep not silence.’ Let us answer, ‘For Zion’s sake will I not hold my peace, and for Jerusalem’s sake I will not rest.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Finally, The constant activity of the servants of Christ will secure the constant operation of God’s power. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Finally, The constant activity of the servants of Christ will secure the constant operation of God’s power.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Give",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him no rest’: let there be no cessation to Him. These are bold words, which many people would not have been slow to rebuke if they had been anywhere else than in the Bible. Those who remind God are not to suffer Him to be still. The prophet believes that they can regulate the flow of divine energy, can stir up the strength of the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is easy to puzzle ourselves with insoluble questions about the co-operation of God’s power and man’s; but practically, is it not true that God reaches His end, of the establishment of Zion, through the Church? He has not barely willed that the world should be saved, nor barely that it should be saved through Christ, nor barely that it should be saved through the knowledge of Christ; but His will is that the world shall be saved, by faith in the person and work of Christ, proclaimed as a gospel by men who believe it. And, as a matter of fact, is it not true that the energy with which God’s power in the gospel manifests itself depends on the zeal and activity and prayerfulness of the Church? The great reservoir is always full-full to the brim; however much may be drawn from it, the water sinks not a hairsbreadth; but the bore of the pipe and the power of the pumping-engine determine the rate at which the stream flows from it. ‘He could there do no mighty works because of their unbelief.’ The obstruction of indifference dammed back the water of life. The city perishes for thirst if the long line of aqueduct that strides across the plain towards the home of the mountain torrents be ruinous, broken down, choked with rubbish.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God is always the same-equally near, equally strong, equally gracious. But our possession of His grace, and the impartation of His grace through us to others, vary, because our faith, our earnestness, our desires, vary. True, these no doubt are also His gifts and His working, and nothing that we say now touches in the least on the great truth that God is the sole originator of all good in man; but while believing that, as no less sure in itself than blessed in its message of confidence and consolation to us, we also have to remember, ‘If any man open the door, I will come in to him.’ We may have as much of God as we want, as much as we can hold, far more than we deserve. And if ever the victorious power of His Church seems to be almost paling to defeat, and His servants to be working no deliverance upon the earth, the cause is not to be found in Him who is ‘without variableness,’ nor in His gifts, which are ‘without repentance,’ but solely in us, who let go our hold of the Eternal Might. No ebb withdraws the waters of that great ocean; and if sometimes there be sand and ooze where once the flashing flood brought life and motion, it is because careless warders have shut the sea-gates.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " An awful responsibility lies on us. We can resist and refuse, or we can open our hearts and draw into ourselves His strength. We can bring into operation those energies which act through faithful men faithfully proclaiming the faithful saying; or we can limit the Holy One of Israel. ‘Why could not we cast him out?’ ‘Because of your unbelief.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " With what grand confidence, then, may the weakest of us go to his task. We have a right to feel that in all our labour God works with us; that, in all our words for Him, it is not we that speak, but the Spirit of our Father that speaks in us; that if humbly and prayerfully, with self-distrust and resolute effort to crucify our own intrusive individuality, we wait for Him to enshrine Himself within us, strength will come to us, drawn from the deep fountains of God, and we too shall be able to say, ‘Not I, but the grace of God in me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How this sublime confidence should tell on our characters, destroying all self-confidence, repressing all pride, calming all impatience, brightening all despondency, and ever stirring us anew to deeds worthy of the ‘exceeding greatness of the power which worketh in us’-I can only suggest.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " On all sides motives for strenuous toil press in upon us-chiefly those great examples which we have now been contemplating. But, besides these, there are other forms of activity which may point the same lesson. Look at the energy ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "around",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " us. We live in a busy time. Life goes swiftly in all regions. Men seem to be burning away faster than ever before, in an atmosphere of pure oxygen. Do we work as hard for God as the world does for itself? Look at the energy ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beneath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " us: how evil in every form is active; how lies and half-truths propagate themselves quick as the blight on a rose-tree; how profligacy, and crime, and all the devil’s angels are busy on his errands. If ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are sitting drowsy by our camp-fires, the enemy is on the alert. You can hear the tramp of their legions and the rumble of their artillery through the night as they march to their posts on the field. It is no time for God’s sentinels to nod. If they sleep, the adversary does not, but glides in the congenial darkness, sowing his baleful tares. Do we work as hard for God as the emissaries of evil do for their master? Look at the energy ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "above",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " us. On the throne of the universe is the immortal Power who slumbereth not nor sleepeth. Before the altar of the heavens is the Priest of the world, the Lord of His Church, ‘who ever liveth to make intercession for us.’ Round Him stand perfected spirits, the watchmen on the walls of the New Jerusalem, who ‘rest not day and night, saying, Holy, Holy, Holy, Lord God Almighty.’ From His presence come, filling the air with the rustle of their swift wings and the light of their flame-faces, the ministering spirits who evermore ‘do His commandments, hearkening to the voice of His word.’ And we, Christian brethren, where are we in all this magnificent concurrence of activity, for purposes which ought to be dear to our hearts as they are to the heart of God? Do we work for Him as He and all that are with Him do? Is His will done by us on earth, as it is heaven?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Alas! alas! have we not all been like those three apostles whose eyes were heavy with sleep even while the Lord was wrestling with the tempter under the gnarled olives in the pale moonlight of Gethsemane? Let us arouse ourselves from our sloth. Let us lift up our cry to God: ‘Awake, awake, put on strength, O arm of the Lord, as in the ancient days in the generations of old’; and the answer shall sound from the heavens to us as it did to the prophet, an echo of his prayer turned into a command, ‘Awake, awake, put on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " strength, O Zion.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 62:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For Zion’s sake ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, the church’s sake, Zion and Jerusalem being both put for the church, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Will I not hold my peace ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— It appears from the last verse of the preceding chapter, that this is immediately connected with it, and these may be considered as the words of the prophet, or, as Vitringa thinks, of a prophetic choir, representing the whole body of the ministers of God, and, among these particularly, the apostles and evangelists, at the beginning of the gospel; declaring that they will not be silent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "till the righteousness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the church, that is, its redemption, (alluding to the redemption of the Jewish Church from Babylon,) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall go forth as brightness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That is, till the kingdom of God shall be most brightly and completely revealed. Others, however, think that the prophet speaks here as the type of Christ, and in his name, and that Christ is to be considered here as declaring his resolution not to cease interceding for the church until it should be freed from the obloquy and reproach, the vexations and persecutions of the Jews and heathen; until its righteousness should be placed in a clear light, and all those crimes which were falsely charged on the Christians by their enemies, (namely, respecting their nightly assemblies, their killing of infants, and drinking their blood, their promiscuous lust, &c.,) should be undeniably confuted. For when the assemblies of the Christians came to be held openly, and in the day-time, and were frequented by greater numbers, all these calumnies were proved to be false. And when Constantine came to the empire, especially when he came to have the sole command, the Christian religion was raised out of its state of obscurity, was placed in a true and conspicuous point of view, and freed from the unmerited reproach that had been cast upon it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Gentiles shall see thy righteousness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thy innocence with respect to the things laid to thy charge, and the blamelessness, usefulness, and the holiness of thy members. Or, they shall acknowledge that God has justly honoured thee, and thereupon shall join themselves to thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And all kings thy glory ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Those that were wont to scorn thee, shall now be taken up with the admiration of thy glory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And thou shalt be called by a new name ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Not the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seed of Abraham, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the children of Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but the people and children of God; or by the name mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Which the mouth of the Lord shall name ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thou shalt be brought into a new state, far more glorious than formerly, whereof God shall be the author. Or, thou shalt be called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by another name, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as it is expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A name, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the honour whereof shall make thee famous; ye shall be called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Christians.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "62:1-5 The Son of God here assures his church of his unfailing love, and his pleading for her under all trails and difficulties. She shall be called by a new name, a pleasant name, such as she was never called by before. The state of true religion in the world, before the preaching of the gospel, no man seemed to have any real concern for. God, by his grace, has wrought that in his church, which makes her his delight. Let us thence learn motives to holiness. If the Lord rejoices over us, we should rejoice in his service.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For Zion's sake - (See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). On account of Zion; that is, on account of the people of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will not hold my peace - There have been very various opinions in regard to the person referred to here by the word 'I.' Calvin and Gesenius suppose that the speaker here is the prophet, and that the sense is, he would not intermit his labors and prayers until Zion should be restored, and its glory spread through all the earth. The Chaldee Paraphrast supposes that it is God who is the speaker, and this opinion is adopted by Grotius. Vitringa regards it as the declaration of a prophetic choir speaking in the name of the officers of the church, and expressing the duty of making continual intercession for the extension of the Redeemer's kingdom. Estius supposes it to be the petition of the Jewish people praying to God for their restoration. Amidst such a variety of interpretation it is not easy to determine the true sense. If it is the language of God, it is a solemn declaration that he was intent on the deliverance of his people, and that he would never cease his endeavors until the work should be accomplished.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If it is the language of the prophet, it implies that he would persevere, notwithstanding all opposition, in rebuking the nation for its sins, and in the general work of the prophetic office, until Zion should arise in its glory. If the former, it is the solemn assurance of Yahweh that the church would be the object of his unceasing watchfulness and care, until its glory should fill the earth. If the latter, it expresses the feelings of earnest and devoted piety; the purpose to persevere in prayer and in active efforts to extend the cause of God until it should triumph. I see nothing in the passage by which it can be determined with certainty which is the meaning; and when this is the case it must be a matter of mere conjecture. The only circumstance which is of weight in the case is, that the language, 'I will not be silent,' is rather that which is adapted to a prophet accustomed to pray and speak in the name of God than to God himself; and if this circumstance be allowed to have any weight, then the opinion will incline to the interpretation which supposes it to refer to the prophet. The same thing is commanded the watchman on the walls of Zion in Isaiah 62:6-7; and if this be the correct interpretation, then it expresses the appropriate solemn resolution of one engaged in proclaiming the truth of God not to intermit his prayers and his public labors until the true religion should be spread around the world.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If it is the language of the prophet, it implies that he would persevere, notwithstanding all opposition, in rebuking the nation for its sins, and in the general work of the prophetic office, until Zion should arise in its glory. If the former, it is the solemn assurance of Yahweh that the church would be the object of his unceasing watchfulness and care, until its glory should fill the earth. If the latter, it expresses the feelings of earnest and devoted piety; the purpose to persevere in prayer and in active efforts to extend the cause of God until it should triumph. I see nothing in the passage by which it can be determined with certainty which is the meaning; and when this is the case it must be a matter of mere conjecture. The only circumstance which is of weight in the case is, that the language, 'I will not be silent,' is rather that which is adapted to a prophet accustomed to pray and speak in the name of God than to God himself; and if this circumstance be allowed to have any weight, then the opinion will incline to the interpretation which supposes it to refer to the prophet. The same thing is commanded the watchman on the walls of Zion in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and if this be the correct interpretation, then it expresses the appropriate solemn resolution of one engaged in proclaiming the truth of God not to intermit his prayers and his public labors until the true religion should be spread around the world.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I will not rest - While I live, I will give myself to unabated toil in the promotion of this great object (see the notes at Isaiah 62:7).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will not rest - While I live, I will give myself to unabated toil in the promotion of this great object (see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Until the righteousness thereof - The word here is equivalent to salvation, and the idea is, that the deliverance of his people would break forth as a shining light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Go forth as brightness - The word used here is commonly employed to denote the splendor, or the bright shining of the sun, the moon, or of fire (see Isaiah 60:19; compare Isaiah 4:5; 2 Samuel 23:4; Proverbs 4:18). The meaning is, that the salvation of people would resemble the clear shining light of the morning, spreading over hill and vale, and illuminating all the world.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Go forth as brightness - The word used here is commonly employed to denote the splendor, or the bright shining of the sun, the moon, or of fire (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The meaning is, that the salvation of people would resemble the clear shining light of the morning, spreading over hill and vale, and illuminating all the world.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "As a lamp that burneth - A blazing torch - giving light all around and shining afar. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As a lamp that burneth - A blazing torch - giving light all around and shining afar. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 62",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isa 62:1-12. Intercessory Prayers for Zion's Restoration, Accompanying God's Promises of It, as the Appointed Means of Accomplishing It.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. I—the prophet, as representative of all the praying people of God who love and intercede for Zion (compare Isa 62:6, 7; Ps 102:13-17), or else Messiah (compare Isa 62:6). So Messiah is represented as unfainting in His efforts for His people (Isa 42:4; 50:7).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "righteousness thereof—not its own inherently, but imputed to it, for its restoration to God's favor: hence \"salvation\" answers to it in the parallelism. \"Judah\" is to be \"saved\" through \"the Lord our (Judah's and the Church's) righteousness\" (Jer 23:6).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as brightness—properly the bright shining of the rising sun (Isa 60:19; 4:5; 2Sa 23:4; Pr 4:18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lamp—blazing torch.A prayer of the watchmen for the church in confidence of God’s gracious designs and promises to it.  For Zion’s sake,  viz. the church’s sake; Zion and Jerusalem being both put for the church, Hebrews 12:22. Will I not hold my peace: these seem to be the words of the prophet, strongly resolving, notwithstanding all difficulties, to solicit God for the church’s happiness, and constantly excite to the belief of it by his preaching, though it were long ere it came, for Isaiah lived near two hundred years before this was accomplished; but his prophecy lived, and the tenor of it was continued by other prophets, whom the Lord stirred up to be still establishing his people till this salvation was wrought: his meaning might be, as long as he lived he would never hold his peace; or he might include himself among those who should be then alive, as Paul doth among the other saints, 1 Thessalonians 4:17, we which are alive. Thus may we also include God speaking these words, as some would have it, viz. by the mouth of Isaiah, and other of his holy prophets, that never held their peace, till they saw this blessed state of the church appear. Until the righteousness: with reference to the Babylonians, understand it of the righteousness of God, who hath promised his people deliverance, and he must be righteous, and so understand salvation before; or rather the vindicating of his people’s cause in the eyes of the nations by the ruin of the Babylonians; he will show that his people have a righteous cause: or with reference to the church, till Christ, who is her righteousness, shall appear and be manifested in the gospel. Go forth as brightness;  clearing up their miserable and dark estate, which the church might be supposed to be in before Christ’s coming, with much joy and happiness. As a lamp that burneth;  and to that purpose is set up where it may be seen continually, to signify how eminently conspicuous this prosperous estate of the church should be among the nations, and as it may particularly relate to revealing of Christ unto the world. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lamp—blazing torch.A prayer of the watchmen for the church in confidence of God’s gracious designs and promises to it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "For Zion’s sake, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " viz. the church’s sake; Zion and Jerusalem being both put for the church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hebrews 12:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Will I not hold my peace:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " these seem to be the words of the prophet, strongly resolving, notwithstanding all difficulties, to solicit God for the church’s happiness, and constantly excite to the belief of it by his preaching, though it were long ere it came, for Isaiah lived near two hundred years before this was accomplished; but his prophecy lived, and the tenor of it was continued by other prophets, whom the Lord stirred up to be still establishing his people till this salvation was wrought: his meaning might be, as long as he lived he would never hold his peace; or he might include himself among those who should be then alive, as Paul doth among the other saints, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Thessalonians 4:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "we which are alive",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thus may we also include God speaking these words, as some would have it, viz. by the mouth of Isaiah, and other of his holy prophets, that never held their peace, till they saw this blessed state of the church appear. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Until the righteousness:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with reference to the Babylonians, understand it of the righteousness of God, who hath promised his people deliverance, and he must be righteous, and so understand salvation before; or rather the vindicating of his people’s cause in the eyes of the nations by the ruin of the Babylonians; he will show that his people have a righteous cause: or with reference to the church, till Christ, who is her righteousness, shall appear and be manifested in the gospel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Go forth as brightness; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clearing up their miserable and dark estate, which the church might be supposed to be in before Christ’s coming, with much joy and happiness. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "As a lamp that burneth; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and to that purpose is set up where it may be seen continually, to signify how eminently conspicuous this prosperous estate of the church should be among the nations, and as it may particularly relate to revealing of Christ unto the world. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For Zion's sake will I not hold my peace, and for Jerusalem's sake I will not rest,.... By Zion and Jerusalem, the church in Gospel times is meant, as it often is in this book, and elsewhere; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for whose glory, prosperity, and safety, a concern is here expressed. Some take them to be the words of God himself, as the Targum and Kimchi; who seems to be silent and at rest, and even as it were asleep, when he does not arise and exert himself on the behalf of his people; but here he declares he would not be as one silent and at rest, nor let the kingdoms and nations of the world be at rest until the deliverer of his people was come, either Cyrus the type, or Christ the antitype: others take them to be the words of Israel in captivity, as Aben Ezra; though he afterwards observes they are the words of God, or of the church of God, soliciting her own restoration, prosperity, and glory: but they are the words of the prophet, expressing his great love and affection for the church, and his importunate desire of her happiness, intimating that he would never leave off praying for it till it was completed; not that he expected to live till the Messiah came, or to see the glory of the latter day, and of the church in it; but the sense is, that he would continue praying for it without ceasing as long as he lived, and he knew his prayers and his prophecies would live after he was dead; and that there would be persons raised up in the church that would succeed him in this work, till all the glorious things promised and prophesied of should be accomplished: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "until the righteousness thereof go forth as brightness; meaning either till the church's innocence is made as clear as the brightness of the sun at noonday, and she is vindicated from the calumnies and reproaches cast upon her, and open vengeance is taken on her enemies by the Lord, from whom her righteousness is, and by whom her wrongs will be righted; or until the righteousness of Christ, which is by imputation her righteousness, is wrought out by him and revealed in the Gospel, and she appears to all to be clothed with it, as with the sun, Revelation 12:1, which will be the case when to her shall be given to be arrayed openly with that fine linen, clean and white, which is the righteousness of the saints, and will be the time of her open marriage to the Lamb, Revelation 19:7, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "until the righteousness thereof go forth as brightness; meaning either till the church's innocence is made as clear as the brightness of the sun at noonday, and she is vindicated from the calumnies and reproaches cast upon her, and open vengeance is taken on her enemies by the Lord, from whom her righteousness is, and by whom her wrongs will be righted; or until the righteousness of Christ, which is by imputation her righteousness, is wrought out by him and revealed in the Gospel, and she appears to all to be clothed with it, as with the sun, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which will be the case when to her shall be given to be arrayed openly with that fine linen, clean and white, which is the righteousness of the saints, and will be the time of her open marriage to the Lamb, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 19:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the salvation thereof as a lamp that burneth; which gives light, and is seen afar off; her open deliverance from all her enemies, Pagan, Papal, and Mahometan; and her salvation by Jesus Christ, which will be more clearly published in the Gospel ministry in the latter day, and more openly seen and enjoyed in the effects of it. The Vulgate Latin version of this and the preceding clause is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"until her righteous one goes forth as brightness, and her Saviour as a lamp that burneth;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "meaning Christ the righteous, and the Saviour of his body the church, who in his first coming was as a burning and shining light, even like the sun, the light of the world; and whose spiritual coming will be in such a glorious manner, that he will destroy antichrist with the brightness of it, and is therefore very desirable, 2 Thessalonians 2:8. The Targum of the whole is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "meaning Christ the righteous, and the Saviour of his body the church, who in his first coming was as a burning and shining light, even like the sun, the light of the world; and whose spiritual coming will be in such a glorious manner, that he will destroy antichrist with the brightness of it, and is therefore very desirable, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Targum of the whole is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"till I work salvation for Zion, I will give no rest to the people; and till consolation comes to Jerusalem, I will not let the kingdoms rest, till her light is revealed as the morning, and her salvation as a lamp that burneth.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"till I work salvation for Zion, I will give no rest to the people; and till consolation comes to Jerusalem, I will not let the kingdoms rest, till her light is revealed as the morning, and her salvation as a lamp that burneth.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For Zion's sake I will not {a} hold my peace, and for Jerusalem's sake I will not rest, until its righteousness shall go forth as {b} brightness, and its salvation as a lamp that burneth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For Zion's sake I will not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hold my peace, and for Jerusalem's sake I will not rest, until its righteousness shall go forth as ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " brightness, and its salvation as a lamp ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " burneth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The prophet says that he will never cease to declare to the people the good tidings of their deliverance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Till they have full deliverance: and this the prophet speaks to encourage all other ministers to the setting forth of God's mercies toward his Church.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The speaker here is most naturally to be supposed the prophet, although the words are often explained as those of Jehovah Himself. This, however, is less probable, in spite of the fact that the verb for “hold my peace” is always in these chapters, except here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 62:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", used by or of Jehovah (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 64:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for when Jehovah breaks His silence salvation has come. The thought of the verse is entirely appropriate on the lips of the prophet who wrote ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; he declares that he will persevere in the course of action there described until the year of Jehovah’s favour has actually come.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "until the righteousness … brightness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. until her right, at present obscured, becomes brilliantly manifest (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 58:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a lamp",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "burneth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a burning torch",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - FURTHER GRACIOUS PROMISES MADE TO ISRAEL BY \"THE SERVANT.\" Some regard the speaker in this chapter as Jehovah; some as the prophet, or the prophetical order; some as \"the Servant.\" The last supposition appears to us the simplest and the best. The close connection with the preceding chapter is evident. If that then be, in the main, \"a soliloquy of the Servant,\" this should he a continuation of the soliloquy. Israel is promised \"righteousness,\" \"glory,\" \"a new name,\" a guard of angels, a time of peace and prosperity, deliverance from Babylon, and triumphant establishment in Zion under God's protection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For Zion's sake will I not hold my peace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the past God has kept silence (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"The Servant\" has not caused his voice to be heard. Babylon has been allowed to continue her oppression unchecked. But now there will be a change. God will lift up his voice, and the nations will hear; and the \"salvation\" of Israel will be effected speedily. For Jerusalem's sake. \"Zion\" and \"Jerusalem\" are used throughout as synonyms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 4:3, 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 31:4, 5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and 9; 33:20; 40:9; 41:27; 52:1; 64:10, etc.), like \"Israel\" and Jacob.\" Strictly speaking, \"Zion\" is the mountain, \"Jerusalem\" the city built upon it. Until the righteousness thereof go forth (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:10, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As brightness; or, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the dawn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 4:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Salvation...  as a lamp that burneth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as a torch that blazeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 15:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ":14; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Israel's \"salvation\" would be made manifest; primarily by her triumphant return from Babylon, and more completely by her position in the final kingdom of the Redeemer. Isaiah 62:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nearly all the more recent commentators regard the prophet himself as speaking here. Having given himself up to praying to Jehovah and preaching to the people, he will not rest or hold his peace till the salvation, which has begun to be realized, has been brought fully out to the light of day. It is, however, really Jehovah who commences thus: \"For Zion's sake I shall not be silent, and for Jerusalem's sake I shall not rest, till her righteousness breaks forth like morning brightness, and her salvation like a blazing torch. And nations will see they righteousness, and all kings thy glory; and men will call thee by a new name, which the mouth of Jehovah will determine. And thou wilt be an adorning coronet in the hand of Jehovah, and a royal diadem in the lap of thy God.\" It is evident that Jehovah is the speaker here, both from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and also from the expression used; for châshâh is the word commonly employed in such utterances of Jehovah concerning Himself, to denote His leaving things in their existing state without interposing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 64:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Moreover, the arguments which may be adduced to prove that the author of chapters 40-66 is not the speaker in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", also prove that it is not he who is continuing to speak of himself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jehovah, having now begun to speak and move on behalf of Zion, will \"for Zion's sake,\" i.e., just because it is Zion, His own church, neither be silent nor give Himself rest, till He has gloriously executed His work of grace. Zion is now in the shade, but the time will come when her righteousness will go forth as nōgah, the light which bursts through the night (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 59:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; here the morning sunlight, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 4:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; compare shachar, the morning red, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 58:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or till her salvation is like a torch which blazes. יבער belongs to כלפּיד (mercha) in the form of an attributive clause  equals  בּער, although it might also be assumed that יבער stands by attraction for תבער (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ewald, 317, c). The verb בּער, which is generally applied to wrath (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is here used in connection with salvation, which has wrath towards the enemies of Zion as its obverse side: Zion's tsedeq (righteousness) shall become like the morning sunlight, before which even the last twilight has vanished; and Zion's yeshū‛âh is like a nightly torch, which sets fire to its own material, and everything that comes near it. The force of the conjunction עד (until) does not extend beyond ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " onwards, the condition of things in the object indicated by עד is more fully described. The eyes of the nations will be directed to the righteousness of Zion, the impress of which is now their common property; the eyes of all kings to her glory, with which the glory of none of them, nor even of all together, can possibly compare. And because this state of Zion is a new one, which has never existed before, her old name is not sufficient to indicate her nature. She is called by a new name; and who could determine this new name? He who makes the church righteous and glorious, He, and He alone, is able to utter a name answering to her new nature, just as it was He who called Abram Abraham, and Jacob Israel. The mouth of Jehovah will determine it (נקב, to pierce, to mark, to designate in a signal and distinguishing manner, nuncupare; cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is only in imagery that prophecy here sees what Zion will be in the future: she will be \"a crown of glory,\" \"a diadem,\" or rather a tiara (tsenı̄ph; Chethib tsenūph  equals  mitsnepheth, the head-dress of the high priest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that of the king, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") \"of regal dignity,\" in the hand of her God (for want of a synonym of \"hand,\" we have adopted the rendering \"in the lap\" the second time that it occurs). Meier renders יהוה בּיד (בּכף) Jovae sub praesidio, as though it did not form part of the figure. But it is a main feature in the figure, that Jehovah holds the crown in His hand. Zion is not the ancient crown which the Eternal wears upon His head, but the crown wrought out in time, which He holds in His hand, because He is seen in Zion by all creation. The whole history of salvation is the history of the taking of the kingdom, and the perfecting of the kingdom by Jehovah; in other words, the history of the working out of this crown. ",
        "children": []
      }
    ]
  }
]