[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he shall . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he shall live, and shall give him of the gold of Sheba, and pray for him continually; every day shall he bless him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This can only refer to the man whose protection from harm and redemption from fraud and violence is mentioned in the last verse. The subject under the just government of the monarch will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "live, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and will bring to his benefactor daily blessing, as well as rich gifts, with the gold of Sheba, and “with true prayers that shall be up at heaven, and enter there.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Prayer Book version, “prayer shall be made to him,” is quite inadmissible.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gold of Sheba—i.e. (see Psalm 72:10), of Arabia (as in Prayer-Book). A Greek historian (Agatharchides), writing of the Sabæans, gives an admiring account of the quantity of gold used in adorning and furnishing their houses. This wealth was probably acquired by commerce with India.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Gold of Sheba",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), of Arabia (as in Prayer-Book). A Greek historian (Agatharchides), writing of the Sabæans, gives an admiring account of the quantity of gold used in adorning and furnishing their houses. This wealth was probably acquired by commerce with India.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 72:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he shall live — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Solomon’s life and reign shall be long and prosperous: and He whom Solomon typified shall live for ever, and his kingdom shall have no end. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And to him shall be given of the gold of Sheba,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c. — The longer he shall live and reign, the richer presents shall be brought unto him, as there shall be to Christ from the eastern countries, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; although such expressions as these, used of Christ and his kingdom, are commonly to be understood in a spiritual sense. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prayer also shall be made for him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His subjects shall be obliged and excited by his righteous and happy government to pray heartily and frequently for him. Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "יתפלל בעדו תמיד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jithpallel bagnado tamid, intercession shall be made on his account incessantly: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "1st, On account of Solomon, that his life might be preserved, and the prosperity of his reign continued and established. And, 2d, For Christ; not indeed personally considered, in which sense he did not need the intercessions or prayers of his subjects, but for the protection of his truth, cause, and people, and for the increase and consummation of his kingdom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And daily shall he be praised — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The highest praises and commendations of Solomon’s just and gracious government shall continually fill men’s months; and daily shall Christ be “praised by his people for the riches of his grace, for all the comforts of his Spirit, and for all the hopes of glory, which they possess through him.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "72:2-17 This is a prophecy of the kingdom of Christ; many passages in it cannot be applied to the reign of Solomon. There were righteousness and peace at first in the administration of his government; but, before the end of his reign, there were troubles and unrighteousness. The kingdom here spoken of is to last as long as the sun, but Solomon's was soon at an end. Even the Jewish expositors understood it of the kingdom of the Messiah. Observe many great and precious promises here made, which were to have full accomplishment only in the kingdom of Christ. As far as his kingdom is set up, discord and contentions cease, in families, churches, and nations. The law of Christ, written in the heart, disposes men to be honest and just, and to render to all their due; it likewise disposes men to live in love, and so produces abundance of peace. Holiness and love shall be lasting in Christ's kingdom. Through all the changes of the world, and all the changes of life, Christ's kingdom will support itself. And he shall, by the graces and comforts of his Spirit, come down like rain upon the mown grass; not on that cut down, but that which is left growing, that it may spring again. His gospel has been, or shall be, preached to all nations. Though he needs not the services of any, yet he must be served with the best. Those that have the wealth of this world, must serve Christ with it, do good with it. Prayer shall be made through him, or for his sake; whatever we ask of the Father, should be in his name. Praises shall be offered to him: we are under the highest obligations to him. Christ only shall be feared throughout all generations. To the end of time, and to eternity, his name shall be praised. All nations shall call HIM blessed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he shall live - So far as the lanquage here is concerned, this may either refer to the king - the Messiah - or to the poor and the oppressed man. If the former, then it means that the life of the Messiah would be perpetual; that he would not be cut off as other sovereigns are; that there would be no change of dynasty; that he would be, as a king, the same - unchanging and unchanged - in all the generations of people, and in all the revolutions which occur on the earth. This would accord with the truth, and with what is elsewhere said of the Messiah; but, perhaps, the more correct interpretation is the latter - that it refers to the poor and the oppressed man - meaning that he would live to bring an offering to the Messiah, and to pray for the extension of his kingdom upon the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And to him shall be given - Margin, \"one shall give.\" Literally, \"he shall give to him;\" that is, the man who has enjoyed his protection, and who has been saved by him, will do this. As a token of his gratitude, and as an expression of his submission, he will bring to him a costly offering, the gold of Sheba.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of the gold of Sheba - One of the gifts referred to in Psalm 72:10, as coming from Sheba. Compare Isaiah 43:3; Isaiah 45:14. The meaning is, that those who are redeemed by him - who owe so much to him for protecting and saving them - will bring the most valued things of the earth, or will consecrate to him all that they are, and all that they possess. Compare Isaiah 60:5-7, Isaiah 60:13-17.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of the gold of Sheba - One of the gifts referred to in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as coming from Sheba. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning is, that those who are redeemed by him - who owe so much to him for protecting and saving them - will bring the most valued things of the earth, or will consecrate to him all that they are, and all that they possess. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:5-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:13-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Prayer also shall be made for him continually - Not for him personally, but for the success of his reign, for the extension of his kingdom. Prayer made for \"that\" is made for \"him,\" for he is identified with that.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And daily shall he be praised - Every day; constantly. It will not be only at stated and distant intervals - at set seasons, and on special occasions - but those who love him will do it every day. It is not necessary to say that this accords with the truth in reference to those who are the friends and followers of the Messiah - the Lord Jesus. Their lives are lives of praise and gratitude. From their dwellings daily praise ascends to him; from their hearts praise is constant; praise uttered in the closet and in the family; praise breathed forth from the heart, whether on the farm, in the workshop, on a journey, or in the busy marts of commerce. The time will come when this shall be universal; when he who can take in at a glance the condition of the world, will see it to be a world of praise; when he who looks on all hearts at the same moment will see a world full of thankfulness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And daily shall he be praised - Every day; constantly. It will not be only at stated and distant intervals - at set seasons, and on special occasions - but those who love him will do it every day. It is not necessary to say that this accords with the truth in reference to those who are the friends and followers of the Messiah - the Lord Jesus. Their lives are lives of praise and gratitude. From their dwellings daily praise ascends to him; from their hearts praise is constant; praise uttered in the closet and in the family; praise breathed forth from the heart, whether on the farm, in the workshop, on a journey, or in the busy marts of commerce. The time will come when this shall be universal; when he who can take in at a glance the condition of the world, will see it to be a world of praise; when he who looks on all hearts at the same moment will see a world full of thankfulness. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. In his prolonged life he will continue to receive the honorable gifts of the rich, and the prayers of his people shall be made for him, and their praises given to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15 And he shall live, and to him shall be given of the gold of Sheba: prayer also shall be made for him continually; and daily shall he be praised.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16 There shall be an handful of corn in the earth upon the top of the mountains; the fruit thereof shall shake like Lebanon: and they of the city shall flourish like grass of the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 His name shall endure for ever: his name shall be continued as long as the sun: and men shall be blessed in him: all nations shall call him blessed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 72:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:15",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And he shall live.\" Vive le Roi! O King! live for ever! He was slain, but is risen and ever liveth. \"And to him shall be given of the gold of Sheba.\" These are coronation gifts of the richest kind, cheerfully presented at his throne. How gladly would we give him all that we have and are, and count the tribute far too small. We may rejoice that Christ's cause will not stand still for want of funds; the silver and the gold are his, and if they are not to be found at home, far-off lands shall hasten to make up the deficit. Would to God we had more faith and more generosity. \"Prayer also shall be made for him continually.\" May all blessings be upon his head; all his people desire that his cause may prosper, therefore do they hourly cry, \"Thy kingdom come.\" Prayer for Jesus is a very sweet idea, and one which should be for evermore lovingly carried out; for the church is Christ's body; and the truth is his sceptre; therefore we pray for him when we plead for these: The verse may, however, be read as \"through him,\" for it is by Christ, as our Mediator that prayer enters heaven and prevails. \"Continue in prayer is the standing precept of Messiah's reign, and it implies that the Lord will continue to bless. \"And daily shall he be praised.\" As he will perpetually show himself to be worthy of honour, so shall he be incessantly praised: - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For him shall constant prayer be made,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And praises throng to crown his head;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His name, like sweet perfume, shall rise",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With every morning's sacrifice.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 72:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:16",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"There shall be an handful of corn in the earth upon the top of the mountains.\" From small beginnings great results shall spring. A mere handful in a place naturally ungenial shall produce a matchless harvest. What a blessing that there is a handful; \"except the Lord of hosts had left unto us a very small remnant we should have been as Sodom, and we should have been like unto Gomorrah;\" but now the faithful are a living seed; and shall multiply in the land. \"The fruit thereof shall shake like Lebanon.\" The harvest shall be so great that the wind shall rustle through it, and sound like the cedars upon Lebanon: - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Like Lebanon, by soft winds fann'd,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rustles the golden harvest far and wide.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God's church is no mean thing; its beginnings are small, but its increase is of the most astonishing kind. As Lebanon is conspicuous and celebrated, so shall the church be. \"And they of the city shall flourish like grass of the earth.\" Another figure. Christ's subjects shall be as plentiful as blades of grass, and shall as suddenly appear as eastern verdure after a heavy shower. We need not fear for the cause of truth in the land; it is in good hands, where the pleasure of the Lord is sure to prosper. \"Fear not, little flock, it is your Father's good pleasure to give you the kingdom.\" When shall these words, which open up such a vista of delight, be fulfilled in the midst of the earth?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He shall live, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, long and prosperously, as Solomon did; yea, eternally, as Christ did. Other kings must lose both their lives and kingdoms; but this King, whom Solomon typified, shall live for ever, and his kingdom shall have no end. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of the gold of Sheba; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a present, or tribute. This was done to Solomon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 10:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 2:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and afterwards as need required. Although such expressions as these, being used of Christ and his kingdom, are commonly understood in a spiritual sense. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Prayer shall be made for him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his subjects shall be obliged and excited by his righteous and happy government to pray heartily and frequently for him; either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. For Solomon. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. For Christ; not so much for his person, which needed not their prayers, as for the protection and propagation of his kingdom, and gospel, and interest in the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he shall live,.... Either the poor and needy man, saved and redeemed by Christ; he, though dead in trespasses and sins, shall live spiritually, be quickened together with Christ, and by his Spirit, and live a life of faith and holiness; and though dead by law, yet, through the righteousness of Christ, shall have the justification of life, and live in the sight of God; and so shall live comfortably by faith in Christ, being filled with joy and peace in believing in him; and though he may lose his life for Christ's sake, he shall find it again, and live eternally with him: or the Messiah, the Saviour and Redeemer of the poor and needy; who, though he was to die, and by his precious blood redeem them; yet should live again, and never die anymore; as he now does live at the right hand of God, where he ever lives to make intercession for his people, as well as lives in their hearts, and supplies them with all grace, and keeps alive his own work on their souls; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to him shall be given of the gold of Sheba: or Arabia, as Apollinarius; either to the poor and needy, to whom is given faith, which is more precious than gold that perisheth; or the knowledge of Christ, which is preferable to gold and silver; and of the doctrines of the Gospel, which are of more value than thousands of gold and silver: also the justifying righteousness of Christ, which is the free gift, and is called clothing of wrought gold, and is signified by gold of Ophir, Psalm 45:9; moreover, this may include all the riches of Christ, his durable and unsearchable riches; his riches of grace and glory, which he bestows upon his subjects; so that the poor and needy are not only saved and redeemed, and live through him; but are made rich by him, become rich in faith, and heirs of a kingdom: or to the Messiah, who had gold presented to him, in his infancy, Matthew 2:11; though rather it is to be understood spiritually of the exercise of faith upon him, and every other grace, which is as gold tried in the fire; and which, as it comes from Christ, it is given to him again. A truly gracious soul gives Christ the best it has: it gives him its whole self, body and soul, its heart and affections, and all its grace, and the glory of all; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and to him shall be given of the gold of Sheba: or Arabia, as Apollinarius; either to the poor and needy, to whom is given faith, which is more precious than gold that perisheth; or the knowledge of Christ, which is preferable to gold and silver; and of the doctrines of the Gospel, which are of more value than thousands of gold and silver: also the justifying righteousness of Christ, which is the free gift, and is called clothing of wrought gold, and is signified by gold of Ophir, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; moreover, this may include all the riches of Christ, his durable and unsearchable riches; his riches of grace and glory, which he bestows upon his subjects; so that the poor and needy are not only saved and redeemed, and live through him; but are made rich by him, become rich in faith, and heirs of a kingdom: or to the Messiah, who had gold presented to him, in his infancy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; though rather it is to be understood spiritually of the exercise of faith upon him, and every other grace, which is as gold tried in the fire; and which, as it comes from Christ, it is given to him again. A truly gracious soul gives Christ the best it has: it gives him its whole self, body and soul, its heart and affections, and all its grace, and the glory of all; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "prayer also shall be made for him continually; or \"he shall pray for him\" (i); that is, either Christ shall pray for the poor and needy man; not only save and redeem, but make intercession for him, as Christ does for all he redeems: he prays for them, that they may be enriched with all the blessings of grace; that the gold he gives them may be kept; that their faith fail not; that they may be preserved from the evil of the world, and be with him, where he is, to behold his glory: or the poor and needy shall pray for Christ, for the prosperity of his church, for the increase of his interest, and the coming of his kingdom: or \"prayer shall be made by him\"; or \"through him continually\" (k); as the Mediator between God and man, the way of access to God, through whom petitions are offered to him, and become acceptable with him; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and daily shall he be praised; or \"daily shall he bless him\" (l); either Christ shall daily bless the poor and needy, with spiritual blessings, as he stands in need of them, and even load him with his benefits: or he shall bless Christ, ascribe blessing, honour, praise, and glory to him; because of his perfections and excellencies; because of redemption and salvation by him; and on account of the various blessings of grace, and the daily supplies of it, he receives from him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i)  \"et orabit pro eo\", Pagninus, Montanus, Junius & Tremellius, Cocceius. (k) \"Per ipsum\", Genebrardus; \"per et propter eum\", Calvinus apud Michaelim. (l) \"benedicet ei\", Pagninus, Montanus, Junius & Tremellius, Cocceius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i)  \"et orabit pro eo\", Pagninus, Montanus, Junius & Tremellius, Cocceius. (k) \"Per ipsum\", Genebrardus; \"per et propter eum\", Calvinus apud Michaelim. (l) \"benedicet ei\", Pagninus, Montanus, Junius & Tremellius, Cocceius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he shall live, and to him shall be given of the {m} gold of Sheba: prayer also shall be made for him continually; and daily shall he be praised.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he shall live, and to him shall be given of the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " gold of Sheba: prayer also shall be made for him continually; ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " daily shall he be praised.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) God will both prosper his life and make the people willing to obey him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The connexion and meaning are uncertain. The R.V. connects the verse with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", placing a colon at the end of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and rendering, and they shall live: lit., as marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", namely, each one of the afflicted ones. The literal rendering of the next clause is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall give him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is understood to mean either that the poor man will grow rich and give presents to the king in gratitude for his deliverance, or that the king will not only protect the life of the poor man, but give him a rich largess in addition. Neither of these explanations is satisfactory. It is better to separate ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". and regard ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:15-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:15-17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " as a concluding series of wishes or prayers for the king and his kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So may he live, and may men give him of the gold of Sheba:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And may they pray for him continually, and bless him all day long.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "May he live",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is an echo of the regular acclamation ‘Vivat Rex,’ ‘Vive le Roi,’ which we render ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God save the king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 16:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 1:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 1:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 1:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". May the people not only greet him with the customary acclamation and offer him the choicest gifts, but pray for his welfare and bless him as the source of their happiness and prosperity. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:66",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The P.B.V. ‘prayer shall be made ever ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unto him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ is untenable as a rendering of the Heb. It was doubtless suggested by the view that the subject of the Psalm is the divine Messiah.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "15–17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A concluding triplet of prayers, for the welfare of the king (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), for the prosperity of his people (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), for the perpetuation of his memory (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 72:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he shall live, and to him shall be given of the gold of Sheba.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Messiah) \"shall live\" - shall live on, and reign on, in his everlasting kingdom; and men shall bring to him of the gold of Sheba (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 27:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), giving him of their best and rarest, in grateful acknowledgment of his goodness and protection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Prayer also shall be made for him continually.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His subjects shall offer prayer for him continually, as Christians do when they pray, \"Thy kingdom come\" (Hengstenberg). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And daily shall he be praised;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "all day long shall they praise him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 72:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The confirmation of these prospects is now given. Voluntative forms are intermingled because the prospect extending into the future is nevertheless more lyrical than prophetic in its character. The elevation of the king to the dominion of the world is the reward of his condescension; he shows himself to be the helper and protecting lord of the poor and the oppressed, who are the especial object upon which God's eye is set. He looks upon it as his task to deal most sympathizingly and most considerately (יחס) just with those of reduced circumstances and with the poor, and their blood is precious in his eyes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is re-echoed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the same as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of יקר, by a retention of the Jod of the stem it is written ייקר. Just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ייקר here also is followed by ויחי. The assertion is individualized: and he (who was threatened with death) shall live (voluntative, having reference to the will of the king). But who is now the subject to ויתּן-? Not the rescued one (Hitzig), for after the foregoing designations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) we cannot expect to find \"the gold of Sheba\" (gold from Jeman or Aethiopia) in his possession. Therefore it is the king, and in fact Solomon, of whom the disposal of the gold of Sheba (Saba) is characteristic. The king's thought and endeavour are directed to this, that the poor man who has almost fallen a victim shall live or revive, and not only will he maintain his cause, he will also bestow gifts upon him with a liberal hand, and he (the poor one who has been rescued and endowed from the riches of the king) shall pray unceasingly for him (the king) and bless him at all times. The poor one is he who is restored to life and endowed with gifts, and who intercedes and blesses; the king, however, is the beneficent giver. It is left for the reader to supply the right subjects in thought to the separate verbs. That clearly marked precision which we require in rhetorical recital is alien to the Oriental style (vid., my Geschichte der jdischen Poesie, S. 189). Maurer and Hofmann also give the same interpretation as we have done. ",
        "children": []
      }
    ]
  }
]