[{"num":38,"verse":"In those days Ezechias was sick even to death, and Isaias the son of Amos the prophet came unto him, and said to him: Thus saith the Lord: Take order with thy house, for thou shalt die, and not live."},{"num":2,"verse":"And Ezechias turned his face toward the wall, and prayed to the Lord,"},{"num":3,"verse":"And said: I beseech thee, O Lord, remember how I have walked before thee in truth, and with a perfect heart, and have done that which is good in thy sight. And Ezechias wept with great weeping."},{"num":4,"verse":"And the word of the Lord came to Isaias, saying:"},{"num":5,"verse":"Go and say to Ezechias: Thus saith the Lord the God of David thy father: I have heard thy prayer, and I have seen thy tears: behold I will add to thy days fifteen years:"},{"num":6,"verse":"And I will deliver thee and this city out of the hand of the king of the Assyrians, and I will protect it."},{"num":7,"verse":"And this shall be a sign to thee from the Lord, that the Lord will do this word which he hath spoken:"},{"num":8,"verse":"Behold I will bring again the shadow of the lines, by which it is now gone down in the sun dial of Achaz with the sun, ten lines backward. And the sun returned ten lines by the degrees by which it was gone down."},{"num":9,"verse":"The writing of Ezechias king of Juda, when he had been sick, and was recovered of his sickness."},{"num":10,"verse":"I said: In the midst of my days I shall go to the gates of hell: I sought for the residue of my years."},{"num":11,"verse":"I said: I shall not see the Lord God in the land of the living. I shall behold man no more, nor the inhabitant of rest."},{"num":12,"verse":"My generation is at an end, and it is rolled away from me, as a shepherd's tent. My life is cut off, as by a weaver: whilst I was yet but beginning, he out me off: from morning even to night thou wilt make an end of me."},{"num":13,"verse":"I hoped till morning, as a lion so hath he broken all my bones: from morning even to night thou wilt make an end of me."},{"num":14,"verse":"I will cry like a young swallow, I will meditate like a dove: my eyes are weakened looking upward: Lord, I suffer violence, answer thou for me."},{"num":15,"verse":"What shall I say, or what shall he answer for me, whereas he himself hath done it? I will recount to thee all my years in the bitterness of my soul."},{"num":16,"verse":"O Lord, if man's life be such, and the life of my spirit be in such things as these, thou shalt correct me, and make me to live."},{"num":17,"verse":"Behold in peace is my bitterness most bitter: but thou hast delivered my soul that it should not perish, thou hast cast all my sins behind thy back."},{"num":18,"verse":"For hell shall not confess to thee, neither shall death praise thee: nor shall they that go down into the pit, look for thy truth."},{"num":19,"verse":"The living, the living, he shall give praise to thee, as I do this day: the father shall make thy truth known to the children."},{"num":20,"verse":"O Lord, save me, and we will sing our psalms all the days of our life in the house of the Lord."},{"num":21,"verse":"Now Isaias had ordered that they should take a lump of figs, and lay it as it plaster upon the wound, and that he should be healed."},{"num":22,"verse":"And Ezechias bed said: What shall be the sign that I shall go up to the house of the Lord?"}]