[{"num":1,"verse":"Paul, an apostle of Jesus Christ by the will of God, and brother Timothy."},{"num":2,"verse":"Grace be with you and peace from God our Father and from the Lord Jesus Christ."},{"num":3,"verse":"Blessed be God the Father of our Lord Jesus Christ, the Father of mercy and the God of all comfort, "},{"num":4,"verse":"who comforts us in all our tribulation, insomuch that we are able to comfort others who are troubled, in whatsoever tribulation it may be, with the same comfort that we ourselves are comforted with by God. "},{"num":5,"verse":"For as the afflictions of Christ are plentiful in us, so also is our consolation plentiful by Christ."},{"num":6,"verse":"Whether we are troubled regarding your consolation and salvation, which salvation shows her power in that you suffer the same afflictions that we also suffer, or whether we are comforted regarding your consolation and salvation, "},{"num":7,"verse":"yet our hope is steadfast for you, inasmuch as we know that as you have your part in afflictions, so shall you be partakers of consolation."},{"num":8,"verse":"Brethren, I would not have you unaware of the trouble that happened to us in Asia. For we were grieved out of measure passing strength, so greatly that we despaired even of life. "},{"num":9,"verse":"Also, we received an answer of death in ourselves, and that because we should not put our trust in ourselves, but in God, who raises the dead to life again, "},{"num":10,"verse":"and who delivered us from so great a death, and does deliver. On whom we trust that yet hereafter he will deliver, "},{"num":11,"verse":"by the help of your prayer for us, so that by reason of many deliverances thanks may be given by many for us, for the grace given to us."},{"num":12,"verse":"Our assurance is this: the testimony of our conscience, that in sincerity and godly purity, and not in fleshly wisdom, but by the grace of God we have conducted ourselves in the world, and most of all toward you. "},{"num":13,"verse":"We write no other things to you than what you read and also know. Yea and I trust you will find us to the end "},{"num":14,"verse":"just as you have found us so far. For we are your delight and joy, even as you are ours in the day of the Lord Jesus."},{"num":15,"verse":"And in this confidence I was minded the other time to have gone to you, so that you might have had yet one pleasure more, "},{"num":16,"verse":"and to have passed by you on the way to Macedonia, and to have come again out of Macedonia to you, and to have been led on my way toward Judea by you. "},{"num":17,"verse":"When I was so minded, was it lightly? Or do I think carnally the things that I think, such that with me there should be yea, yea, and nay, nay?"},{"num":18,"verse":"God is faithful. For our preaching to you was not yea and nay. "},{"num":19,"verse":"For God’s Son Jesus Christ, who was preached among you by us (that is to say, by me and Silvanus and Timothy) was not yea and nay, but in him was yea. "},{"num":20,"verse":"For all the promises of God in him are yea, and are in him Amen, to the laud of God through us. "},{"num":21,"verse":"For it is God who established us and you in Christ, and has anointed us; "},{"num":22,"verse":"who has also sealed us, and has given the earnest of the Spirit into our hearts."},{"num":23,"verse":"I call God as a witness to my soul that it was to favour you that I did not go any more to Corinth. "},{"num":24,"verse":"Not that we are lords over your faith, but are helpers of your joy. "}]