[{"num":1,"verse":"This letter comes to you from Paul, God’s messenger for Jesus Christ by the will of God, and from brother Timothy, and is addressed to the church of God in Corinth and all Christians throughout Achaia."},{"num":2,"verse":"May grace and peace come to you from God our Father and from the Lord Jesus Christ."},{"header":"God’s encouragements are adequate for all life’s troubles"},{"num":3,"verse":"Thank God, the Father of our Lord Jesus Christ, that he is our Father and the source of all mercy and comfort. For he gives us comfort in our trials so that we in turn may be able to give the same sort of strong sympathy to others in theirs. Indeed, experience shows that the more we share Christ’s suffering the more we are able to give of his encouragement. This means that if we experience trouble we can pass on to you comfort and spiritual help; for if we ourselves have been comforted we know how to encourage you to endure patiently the same sort of troubles that we have ourselves endured. We are quite confident that if you have to suffer troubles as we have done, then, like us, you will find the comfort and encouragement of God."},{"header":"Man’s extremity is God’s opportunity"},{"num":8,"verse":"We should like you, our brothers, to know something of what we went through in Asia. At that time we were completely overwhelmed, the burden was more than we could bear, in fact we told ourselves that this was the end. Yet we believe now that we had this experience of coming to the end of our tether that we might learn to trust, not in ourselves, but in God who can raise the dead. It was God who preserved us from imminent death, and it is he who still preserves us. Further, we trust him to keep us safe in the future, and here you can join in and help by praying for us, so that the good that is done to us in answer to many prayers will mean eventually that many will thank God for our preservation."},{"header":"Our dealings with you have always been straightforward"},{"num":12,"verse":"Now it is a matter of pride to us—endorsed by our conscience—that our activities in this world, particularly our dealings with you, have been absolutely above-board and sincere before God. They have not been marked by any worldly wisdom, but by the grace of God. Our letters to you have no double meaning—they mean just what you understand them to mean when you read them. We hope you will always understand these letters (as we believe you have already understood the purpose of our lives), and realise that you can be as honestly proud of us as we shall be of you on the day when Christ reveals all secrets."},{"num":15,"verse":"Trusting you, and believing that you trusted us, our original plan was to pay you a visit first, and give you a double “treat”. We meant to come here to Macedonia after first visiting you, and then to visit you again on leaving here. You could thus have helped us on our way towards Judea. Because we had to change this plan, does it mean that we are fickle? Do you think I plan with my tongue in my cheek, saying “yes” and meaning “no”? We solemnly assure you that as certainly as God is faithful so we have never given you a message meaning “yes” and “no”."},{"num":19,"verse":"Jesus Christ, the Son of God, whom Silvanus, Timothy and I have preached to you, is himself no doubtful quantity, he is the divine “yes”. Every promise of God finds its affirmative in him, and through him can be said the final amen, to the glory of God. We owe our position in Christ to this God of positive promise: it is he who has consecrated us to this special work, he who has given us the living guarantee of the Spirit in our hearts. Are we then the men to say one thing and mean another?"},{"header":"I have never wanted to hurt you"},{"num":23,"verse":"No, I declare before God that it was to avoid hurting you that I did not come to Corinth. For though I am not responsible for your faith—your standing in God is your own affair—yet I can add to your happiness."}]