[{"num":1,"verse":"From Paul, chosen by God to be an apostle of Christ Jesus."},{"num":2,"verse":"I pray that God our Father and our Lord Jesus Christ will be kind to you and will bless you with peace!"},{"header":"Christ Brings Spiritual Blessings"},{"num":3,"verse":"Praise the God and Father of our Lord Jesus Christ for the spiritual blessings that Christ has brought us from heaven! "},{"num":4,"verse":"Before the world was created, God had Christ choose us to live with him and to be his holy and innocent and loving people. "},{"num":5,"verse":"God was kind and decided that Christ would choose us to be God’s own adopted children. "},{"num":6,"verse":"God was very kind to us because of the Son he dearly loves, and so we should praise God."},{"num":7,"verse":"Christ sacrificed his life’s blood to set us free, which means that our sins are now forgiven. Christ did this because God was so kind to us. God has great wisdom and understanding, "},{"num":9,"verse":"and by what Christ has done, God has shown us his own mysterious ways. "},{"num":10,"verse":"Then when the time is right, God will do all that he has planned, and Christ will bring together everything in heaven and on earth."},{"num":11,"verse":"God always does what he plans, and that’s why he appointed Christ to choose us. "},{"num":12,"verse":"He did this so that we Jews would bring honor to him and be the first ones to have hope because of him. "},{"num":13,"verse":"Christ also brought you the truth, which is the good news about how you can be saved. You put your faith in Christ and were given the promised Holy Spirit to show that you belong to God. "},{"num":14,"verse":"The Spirit also makes us sure that we will be given what God has stored up for his people. Then we will be set free, and God will be honored and praised."},{"header":"Paul’s Prayer"},{"num":15,"verse":"I have heard about your faith in the Lord Jesus and your love for all of God’s people. "},{"num":16,"verse":"So I never stop being grateful for you, as I mention you in my prayers. "},{"num":17,"verse":"I ask the glorious Father and God of our Lord Jesus Christ to give you his Spirit. The Spirit will make you wise and let you understand what it means to know God. "},{"num":18,"verse":"My prayer is that light will flood your hearts and that you will understand the hope that was given to you when God chose you. Then you will discover the glorious blessings that will be yours together with all of God’s people."},{"num":19,"verse":"I want you to know about the great and mighty power that God has for us followers. It is the same wonderful power he used "},{"num":20,"verse":"when he raised Christ from death and let him sit at his right side in heaven. "},{"num":21,"verse":"There Christ rules over all forces, authorities, powers, and rulers. He rules over all beings in this world and will rule in the future world as well. "},{"num":22,"verse":"God has put all things under the power of Christ, and for the good of the church he has made him the head of everything. "},{"num":23,"verse":"The church is Christ’s body and is filled with Christ who completely fills everything."}]