[{"num":1,"verse":"Paul, an apostle of Jesus Christ, by the will of God, to all the saints who are at Ephesus, and to the faithful in Christ Jesus."},{"num":2,"verse":"Grace be to you, and peace from God the Father, and from the Lord Jesus Christ."},{"num":3,"verse":"Blessed be the God and Father of our Lord Jesus Christ, who hath blessed us with spiritual blessings in heavenly places, in Christ:"},{"num":4,"verse":"As he chose us in him before the foundation of the world, that we should be holy and unspotted in his sight in charity."},{"num":5,"verse":"Who hath predestinated us unto the adoption of children through Jesus Christ unto himself: according to the purpose of his will:"},{"num":6,"verse":"Unto the praise of the glory of his grace, in which he hath graced us in his beloved son."},{"num":7,"verse":"In whom we have redemption through his blood, the remission of sins, according to the riches of his grace,"},{"num":8,"verse":"Which hath superabounded in us in all wisdom and prudence,"},{"num":9,"verse":"That he might make known unto us the mystery of his will, according to his good pleasure, which he hath purposed in him,"},{"num":10,"verse":"In the dispensation of the fulness of times, to re-establish all things in Christ, that are in heaven and on earth, in him."},{"num":11,"verse":"In whom we also are called by lot, being predestinated according to the purpose of him who worketh all things according to the counsel of his will."},{"num":12,"verse":"That we may be unto the praise of his glory, we who before hoped Christ:"},{"num":13,"verse":"In whom you also, after you had heard the word of truth, (the gospel of your salvation;) in whom also believing, you were signed with the holy Spirit of promise,"},{"num":14,"verse":"Who is the pledge of our inheritance, unto the redemption of acquisition, unto the praise of his glory."},{"num":15,"verse":"Wherefore I also, hearing of your faith that is in the Lord Jesus, and of your love towards all the saints,"},{"num":16,"verse":"Cease not to give thanks for you, making commemoration of you in my prayers,"},{"num":17,"verse":"That the God of our Lord Jesus Christ, the Father of glory, may give unto you the spirit of wisdom and of revelation, in the knowledge of him:"},{"num":18,"verse":"The eyes of your heart enlightened, that you may know what the hope is of the glory of his inheritance in the saints."},{"num":19,"verse":"And what is the exceeding greatness of his power towards us, who believe according to the operation of the might of his power,"},{"num":20,"verse":"Which he wrought in Christ, raising him up from the dead, and setting him on his right hand in the heavenly places."},{"num":21,"verse":"Above all principality, and power, and virtue, and dominion, and every name that is named, not only in this world, but also in that which is to come."},{"num":22,"verse":"And he hath subjected all things under his feet, and hath made him head over all the church,"},{"num":23,"verse":"Which is his body, and the fulness of him who is filled all in all."}]