[{"header":"Salutation"},{"num":1,"verse":"Paul, an apostle of Jesus Christ by the will of God,"},{"num":2,"verse":"Grace to you and peace from God our Father and the Lord Jesus Christ."},{"header":"Spiritual Blessings in Christ"},{"num":3,"verse":"Blessed be the God and Father of our Lord Jesus Christ, who has blessed us with every spiritual blessing in the heavenly places in Christ, "},{"num":4,"verse":"just as He chose us in Him before the foundation of the world, to be holy and blameless before Him in love; "},{"num":5,"verse":"He predestined us to adoption as sons to Himself through Jesus Christ according to the good pleasure of His will, "},{"num":6,"verse":"to the praise of the glory of His grace which He graciously bestowed on us in the Beloved. "},{"num":7,"verse":"In Him we have redemption through His blood and the forgiveness of sins according to the riches of His grace, "},{"num":8,"verse":"which He lavished on us in all wisdom and insight, "},{"num":9,"verse":"making known to us the mystery of His will, according to His good pleasure, which He purposed in Himself, "},{"num":10,"verse":"as a plan for the fullness of time, to unite all things in Christ, which are in heaven and on earth."},{"num":11,"verse":"In Him also we have received an inheritance, being predestined according to the purpose of Him who works all things according to the counsel of His own will, "},{"num":12,"verse":"that we, who were the first to hope in Christ, should live for the praise of His glory. "},{"num":13,"verse":"In Him you also, after hearing the word of truth, the gospel of your salvation, and after believing in Him, were sealed with the promised Holy Spirit, "},{"num":14,"verse":"who is the guarantee of our inheritance until the redemption of the purchased possession, to the praise of His glory."},{"header":"Paul’s Prayer"},{"num":15,"verse":"Therefore I also, after hearing of your faith in the Lord Jesus and your love toward all the saints, "},{"num":16,"verse":"do not cease giving thanks for you, mentioning you in my prayers, "},{"num":17,"verse":"so that the God of our Lord Jesus Christ, the Father of glory, may give you the Spirit of wisdom and revelation in the knowledge of Him, "},{"num":18,"verse":"that the eyes of your understanding may be enlightened, that you may know what is the hope of His calling and what are the riches of the glory of His inheritance among the saints, "},{"num":19,"verse":"and what is the surpassing greatness of His power toward us who believe, according to the working of His mighty power, "},{"num":20,"verse":"which He performed in Christ when He raised Him from the dead and seated Him at His own right hand in the heavenly places, "},{"num":21,"verse":"far above all principalities, and power, and might, and dominion, and every name that is named, not only in this age but also in that which is to come. "},{"num":22,"verse":"And He put all things in subjection under His feet and made Him the head over all things for the church, "},{"num":23,"verse":"which is His body, the fullness of Him who fills all things in all ways."}]