[[],[{"type":"header","content":"The Blessings of Redemption"},{"type":"prose","content":"Paul, an apostle of Christ Jesus by the will of God,To the saints who are at Ephesus and  faithful in Christ Jesus:"}],[{"type":"prose","content":"Grace to you and peace from God our Father and the Lord Jesus Christ."}],[{"type":"prose","content":"Blessed  the God and Father of our Lord Jesus Christ, who has blessed us with every spiritual blessing in the heavenly  in Christ,"}],[{"type":"prose","content":"just as He chose us in Him before the foundation of the world, that we would be holy and blameless before Him. In love"}],[{"type":"prose","content":"He predestined us to adoption as sons  through Jesus Christ to Himself, according to the good pleasure of His will,"}],[{"type":"prose","content":"to the praise of the glory of His grace, with which He favored us in the Beloved."}],[{"type":"prose","content":"In Him we have redemption through His blood, the forgiveness of our wrongdoings, according to the riches of His grace"}],[{"type":"prose","content":"which He lavished on us. In all wisdom and insight"}],[{"type":"prose","content":"He made known to us the mystery of His will, according to His good pleasure which He set forth in Him,"}],[{"type":"prose","content":"regarding  plan of the fullness of the times, to bring all things together in Christ, things in the heavens and things on the earth."}],[{"type":"prose","content":"In Him we also have obtained an inheritance, having been predestined according to the purpose of Him who works all things in accordance with the plan of His will,"}],[{"type":"prose","content":"to the end that we who were the first to hope in the Christ would be to the praise of His glory."}],[{"type":"prose","content":"In Him, you also, after listening to the message of truth, the gospel of your salvation—having also believed, you were sealed in Him with the Holy Spirit of the promise,"}],[{"type":"prose","content":"who is a first installment of our inheritance, in regard to the redemption of  possession, to the praise of His glory."}],[{"type":"prose","content":"For this reason I too, having heard of the faith in the Lord Jesus which  among you and your love for all the saints,"}],[{"type":"prose","content":"do not cease giving thanks for you, while making mention  in my prayers;"}],[{"type":"prose","content":"that the God of our Lord Jesus Christ, the Father of glory, may give you a spirit of wisdom and of revelation in the knowledge of Him."}],[{"type":"prose","content":" the eyes of your heart may be enlightened, so that you will know what is the hope of His calling, what are the riches of the glory of His inheritance in the saints,"}],[{"type":"prose","content":"and what is the boundless greatness of His power toward us who believe.  in accordance with the working of the strength of His might"}],[{"type":"prose","content":"which He brought about in Christ, when He raised Him from the dead and seated Him at His right hand in the heavenly ,"}],[{"type":"prose","content":"far above all rule and authority and power and dominion, and every name that is named, not only in this age but also in the one to come."}],[{"type":"prose","content":"And He put all things in subjection under His feet, and made Him head over all things to the church,"}],[{"type":"prose","content":"which is His body, the fullness of Him who fills all in all."}]]