[{"num":1,"verse":"This letter is from Paul. I am a missionary for Jesus Christ. God wanted me to work for Him. This letter is to those who belong to Christ in the city of Ephesus and to you who are faithful followers of Christ Jesus. "},{"num":2,"verse":"May you have loving-favor and peace from God our Father and from our Lord Jesus Christ."},{"num":3,"verse":"Let us honor and thank the God and Father of our Lord Jesus Christ. He has already given us a taste of what heaven is like. "},{"num":4,"verse":"Even before the world was made, God chose us for Himself because of His love. He planned that we should be holy and without blame as He sees us. "},{"num":5,"verse":"God already planned to have us as His own children. This was done by Jesus Christ. In His plan God wanted this done."},{"num":6,"verse":"We thank God for His loving-favor to us. He gave this loving-favor to us through His much-loved Son. "},{"num":7,"verse":"Because of the blood of Christ, we are bought and made free from the punishment of sin. And because of His blood, our sins are forgiven. His loving-favor to us is so rich. "},{"num":8,"verse":"He was so willing to give all of this to us. He did this with wisdom and understanding. "},{"num":9,"verse":"God told us the secret of what He wanted to do. It is this: In loving thought He planned long ago to send Christ into the world. "},{"num":10,"verse":"The plan was for Christ to gather us all together at the right time. If we are in heaven or still on earth, He will bring us together and will be head over all."},{"num":11,"verse":"We were already chosen to be God’s own children by Christ. This was done just like the plan He had. "},{"num":12,"verse":"We who were the first to put our trust in Christ should thank Him for His greatness. "},{"num":13,"verse":"The truth is the Good News. When you heard the truth, you put your trust in Christ. Then God marked you by giving you His Holy Spirit as a promise. "},{"num":14,"verse":"The Holy Spirit was given to us as a promise that we will receive everything God has for us. God’s Spirit will be with us until God finishes His work of making us complete. God does this to show His shining-greatness."},{"header":"Paul’s Prayer for the Christians in Ephesus"},{"num":15,"verse":"I have heard of your faith in the Lord Jesus and your love for all Christians. "},{"num":16,"verse":"Since then, I always give thanks for you and pray for you. "},{"num":17,"verse":"I pray that the great God and Father of our Lord Jesus Christ may give you the wisdom of His Spirit. Then you will be able to understand the secrets about Him as you know Him better. "},{"num":18,"verse":"I pray that your hearts will be able to understand. I pray that you will know about the hope given by God’s call. I pray that you will see how great the things are that He has promised to those who belong to Him. "},{"num":19,"verse":"I pray that you will know how great His power is for those who have put their trust in Him. "},{"num":20,"verse":"It is the same power that raised Christ from the dead. This same power put Christ at God’s right side in heaven. "},{"num":21,"verse":"This place was given to Christ. It is much greater than any king or leader can have. No one else can have this place of honor and power. No one in this world or in the world to come can have such honor and power. "},{"num":22,"verse":"God has put all things under Christ’s power and has made Him to be the head leader over all things of the church. "},{"num":23,"verse":"The church is the body of Christ. It is filled by Him Who fills all things everywhere with Himself."}]