[{"header":"Blessings on the Sovereign God!"},{"num":1,"verse":"From Paul, one of King Jesus’ apostles through God’s purpose, to the holy ones in Ephesus who are also loyal believers in King Jesus: "},{"num":2,"verse":"may God our father and the Lord Jesus, the king, give you grace and peace!"},{"num":3,"verse":"Let us bless God, the father of our Lord Jesus, the king! He has blessed us in the king with every spirit-inspired blessing in the heavenly realm."},{"header":"The Choice and the Plan"},{"num":4,"verse":"He chose us in him before the world was made, so as to be holy and irreproachable before him in love. "},{"num":5,"verse":"He foreordained us for himself, to be adopted as sons and daughters through Jesus the king. That’s how he wanted it, and that’s what gave him delight, "},{"num":6,"verse":"so that the glory of his grace, the grace he poured on us in his beloved one, might receive its due praise."},{"num":7,"verse":"In the king, and through his blood, we have deliverance – that is, our sins have been forgiven – through the wealth of his grace "},{"num":8,"verse":"which he lavished on us. Yes, with all wisdom and insight "},{"num":9,"verse":"he has made known to us the secret of his purpose, just as he wanted it to be and set it forward in him "},{"num":10,"verse":"as a blueprint for when the time was ripe. His plan was to sum up the whole cosmos in the king – yes, everything in heaven and on earth, in him."},{"header":"The Inheritance and the Spirit"},{"num":11,"verse":"In him we have received the inheritance! We were foreordained to this, according to the intention of the one who does all things in accordance with the counsel of his purpose. "},{"num":12,"verse":"This was so that we, we who first hoped in the king, might live for the praise of his glory. "},{"num":13,"verse":"In him you too, who heard the word of truth, the gospel of your salvation, and believed it – in him you were marked out with the spirit of promise, the holy one. "},{"num":14,"verse":"The spirit is the guarantee of our inheritance, until the time when the people who are God’s special possession are finally reclaimed and freed. This, too, is for the praise of his glory."},{"header":"Knowing the Power of the King"},{"num":15,"verse":"Because of all this, and because I’d heard that you are loyal and faithful to Jesus the master, and that you show love to all God’s holy people, "},{"num":16,"verse":"I never stop giving thanks for you as I remember you in my prayers. "},{"num":17,"verse":"I pray that the God of King Jesus our Lord, the father of glory, would give you, in your spirit, the gift of being wise, of seeing things people can’t normally see, because you are coming to know him "},{"num":18,"verse":"and to have the eyes of your inmost self opened to God’s light. Then you will know exactly what the hope is that goes with God’s call; you will know the wealth of the glory of his inheritance in his holy people; "},{"num":19,"verse":"and you will know the outstanding greatness of his power towards us who are loyal to him in faith, according to the working of his strength and power."},{"num":20,"verse":"This was the power at work in the king when God raised him from the dead and sat him at his right hand in the heavenly places, "},{"num":21,"verse":"above all rule and authority and power and lordship, and above every name that is invoked, both in the present age and also in the age to come. "},{"num":22,"verse":"Yes: God has ‘put all things under his feet’, and has given him to the church as the head over all. "},{"num":23,"verse":"The church is his body; it is the fullness of the one who fills all in all."}]