[{"num":1,"verse":"I am Paul, an apostle of Jesus Christ. It was God's wish for me to be his messenger. I send greetings to God's people in the city of Ephesus, to those who believe in Christ Jesus."},{"num":2,"verse":"May God our Father and the Lord Jesus Christ in their kindness give you peace."},{"num":3,"verse":"Praise God, the Father of our Lord Jesus Christ! He has blessed us in Christ with every blessing which is in heaven, such as the Spirit gives us."},{"num":4,"verse":"Before the world was made, God chose us in Christ. He chose us that we should be holy and good before him."},{"num":5,"verse":"Because he loved us, he planned that we should be his own children. It is through Jesus Christ that we are God's children. That is the way God wanted it to be."},{"num":6,"verse":"Praise him! His kindness is great and wonderful. We have been accepted by God through Jesus Christ, whom he loves so much."},{"num":7,"verse":"Jesus Christ has given his blood [died] to make us free. He has forgiven us for our wrong ways. We have been put right with God freely because of his great kindness."},{"num":8,"verse":"He has given us blessing after blessing in his wisdom and understanding."},{"num":9,"verse":"He has shown us the plan he had. This plan was what he wanted to do through Christ."},{"num":10,"verse":"When the right time came, God planned to bring together everything in heaven and on earth, and make Christ head of them all."},{"num":11,"verse":"In and through Christ we will have a share in all that belongs to him. Long ago God chose us for this. And he makes things happen that he wants to do."},{"num":12,"verse":"We believed in Christ first, so we will praise him because he is so great and wonderful."},{"num":13,"verse":"You also believed in Christ when you heard the true message. That message is the good news by which you were saved. You received the Holy Spirit whom God had promised. You were marked as belonging to him."},{"num":14,"verse":"The Holy Spirit is the first part of what we are to receive from God. This proves that we will get all God has promised. Some day we shall have them all. Praise God! He is very great and wonderful. 15,"},{"num":15,"verse":"Here is why I always thank God for you. I have heard that you believe in the Lord Jesus and love all of God's people. I think of you when I talk to God."},{"num":16,"verse":"He is the God of our Lord Jesus Christ, the Father who is very great and wonderful. I ask him to give you a mind that is wise and will understand about him."},{"num":17,"verse":"I ask him that you may understand these things in your hearts. I ask him that you may know what a great hope you have because God has called you. I ask him that you may know the rich and great blessings God has promised to his people."},{"num":18,"verse":"I ask him that you may know the wonderful power he has to do things for us who believe in Christ. His power is very strong."},{"num":19,"verse":"God used that power when he raised Christ from death and had him sit at his right side in heaven."},{"num":20,"verse":"He is greater than any ruler, power, chief, or king. His name is greater than any other name, not only in this world, but in the world that will come."},{"num":21,"verse":"And God has put all things under Christ. He has made him the head of the church people in all matters."},{"num":22,"verse":"The church [all the people who believe in Jesus Christ] is his body. The church people have everything that Christ has. He is the One who is in everything everywhere."}]