[{"num":1,"verse":"And the high priest said, “Do these things hold so?”"},{"header":"Stephen Defends Himself Before The Sanhedrin:"},{"num":2,"verse":"And the one said, “Men, brothers, and fathers, listen—"},{"header":"God Promised Abraham’s Descendants Would Inherit The Land"},{"num":3,"verse":"and said to him [in Gen 12:1], ‘Go out from your land and from your relatives, and come to the land which I will show you’. "},{"num":4,"verse":"Then having gone out from the land of the Chaldeans, he dwelled in Haran. And from there, after his father died, He removed him to this land in which you are now dwelling. "},{"num":5,"verse":"And He did not give him an inheritance in it, not even the step of a foot. And He promised to give it to him for a possession, and to his seed after him— there not being a child for him! "},{"num":6,"verse":"But God spoke as follows [in Gen 15:13-14]: that his seed ‘will be a foreigner in a land belonging-to-another. And they will enslave it and mistreat it for four-hundred years. "},{"num":7,"verse":"And I will judge the nation in whichever they will serve-as-slaves’, said God. ‘And after these things, they will come out and worship Me’ in this place. "},{"num":8,"verse":"And He gave him the covenant of circumcision."},{"header":"Abraham’s Children Moved To Egypt During a Famine"},{"num":9,"verse":"And the patriarchs, having become-jealous-of Joseph, sold him into Egypt. And God was with him, "},{"num":10,"verse":"and rescued him from all his afflictions, and gave him favor and wisdom in the sight of Pharaoh, king of Egypt. And he appointed him to be ruling over Egypt, and over his whole house. "},{"num":11,"verse":"And a famine came over all Egypt and Canaan, and a great affliction. And our fathers were not finding food. "},{"num":12,"verse":"But Jacob, having heard-of grain being in Egypt, sent-forth our fathers first. "},{"num":13,"verse":"And during the second visit, Joseph was made-known-again to his brothers, and the family of Joseph became known to Pharaoh. "},{"num":14,"verse":"And having sent-forth his brothers, Joseph summoned Jacob his father and all his relatives, amounting-to seventy five souls. "},{"num":15,"verse":"And Jacob went down to Egypt. And he came-to-an-end, and our fathers. "},{"num":16,"verse":"And they were transferred to Shechem, and placed in the tomb which Abraham bought for a price of silver from the sons of Hamor in Shechem."},{"header":"When The Time Came, God Raised Up Moses, Whom The People Rejected"},{"num":17,"verse":"“Now as the time of the promise which God declared to Abraham was drawing-near, our people grew and were multiplied in Egypt, "},{"num":18,"verse":"until which time another king arose over Egypt who did not know Joseph. "},{"num":19,"verse":"This one, having dealt-shrewdly-with our nation, mistreated our fathers, so that he caused their babies to be exposed that they might not be kept-alive; "},{"num":20,"verse":"at which time Moses was born— and he was beautiful to God— who was brought-up for three months in the house of his father. "},{"num":21,"verse":"And he having been exposed, the daughter of Pharaoh took him up, and brought him up for herself for a son. "},{"num":22,"verse":"And Moses was trained in all the wisdom of the Egyptians. And he was powerful in his words and deeds. "},{"num":23,"verse":"And as a forty-year period was being fulfilled for him, it came-up on his heart to visit his brothers, the sons of Israel. "},{"num":24,"verse":"And having seen someone being wronged, he defended him, and executed vengeance for the one being oppressed, having struck the Egyptian. "},{"num":25,"verse":"Now he was thinking that his brothers were understanding that God was granting them deliverance by his hand. But the ones did not understand. "},{"num":26,"verse":"And on the following day, he appeared to them while they were fighting. And he was reconciling them to peace, having said, ‘Men, you are brothers. Why are you wronging one another?’ [Ex 2:13]. "},{"num":27,"verse":"But the one wronging his neighbor rejected him, having said, ‘Who appointed you ruler and judge over us? "},{"num":28,"verse":"You do not intend to kill me the way you killed the Egyptian yesterday, do you?’ [Ex 2:14]. "},{"num":29,"verse":"And Moses fled at this word. And he became a foreigner in the land of Midian, where he fathered two sons. "},{"num":30,"verse":"And forty years having been fulfilled, an angel appeared to him in the wilderness of Mount Sinai, in the flame of fire of a bush. "},{"num":31,"verse":"And having seen it, Moses was marveling-at the sight. And while he was approaching to look-closely, the voice of the Lord came: "},{"num":32,"verse":"‘I am the God of your fathers, the God of Abraham and Isaac and Jacob’. And having become trembling, Moses was not daring to look-closely. "},{"num":33,"verse":"And the Lord said to him, ‘Untie the sandal from your feet, for the place upon which you stand is holy ground. "},{"num":34,"verse":"Having seen, I saw the mistreatment of My people in Egypt, and I heard their groaning, and I came down to rescue them. And now, come, I will send you forth to Egypt’."},{"header":"This Moses Whom Israel Denied, God Sent To Be Both Ruler And Deliverer"},{"num":35,"verse":"“This Moses whom they denied, having said, ‘Who appointed you ruler and judge?’ [Ex 2:14]— this one God has sent-forth to be both ruler and deliverer, with the hand of the angel having appeared to him in the bush. "},{"num":36,"verse":"This one led them out, having done wonders and signs in Egypt land, and in the Red Sea, and in the wilderness for forty years."},{"header":"This Moses Said That God Would Raise Up a Prophet Like Him"},{"num":37,"verse":"“This one is the Moses having said to the sons of Israel, ‘God will raise-up a prophet like me for you from your brothers’ [Deut 18:15]."},{"header":"This Moses Brought Israel God’s Word, Which They Rejected"},{"num":38,"verse":"“This one is the one having been in the congregation in the wilderness, with the angel speaking to him at Mount Sinai, and with our fathers, who received living oracles to give to us— "},{"num":39,"verse":"to whom our fathers were not willing to become obedient, but they rejected him and turned-away in their hearts to Egypt, "},{"num":40,"verse":"having said to Aaron, ‘Make gods for us who will go before us. For this Moses who led us out of the land of Egypt, we do not know what happened to him’ [Ex 32:1]. "},{"num":41,"verse":"And they made-a-calf in those days, and brought-up a sacrifice to the idol. And they were celebrating in the works of their hands."},{"header":"So God Turned Away From Them And Handed Them Over To Idolatry"},{"num":42,"verse":"“And God turned-away, and handed them over to worship the host of heaven, just as it has been written in the book of the prophets [in Amos 5:25-27]: ‘House of Israel, you did not offer victims and sacrifices to Me for forty years in the wilderness, did you? "},{"num":43,"verse":"Indeed you took-up the tabernacle of Moloch and the star of your god Rephan— the images which you made to give-worship to them. Indeed I will remove you beyond Babylon!’"},{"header":"The Fathers Had The Tabernacle And The Temple. But God Does Not Dwell In Either"},{"num":44,"verse":"“The tabernacle of testimony was with our fathers in the wilderness, just as the One speaking to Moses directed him to make it according to the pattern which he had seen; "},{"num":45,"verse":"which our fathers, having received-it-in-succession, also brought in with Joshua during the taking-possession of the nations whom God drove-out from the presence of our fathers— until the days of David, "},{"num":46,"verse":"who found favor before God. And he asked that he might find a dwelling-place for the house of Jacob, "},{"num":47,"verse":"but Solomon built a house for Him. "},{"num":48,"verse":"But the Most-High does not dwell in things made-by-human-hands, just as the prophet says [in Isa 66:1-2]: "},{"num":49,"verse":"‘The heaven is a throne for Me, and the earth is a footstool of My feet. What kind of house will you build for Me?’ says the Lord, ‘or what will be the place of My rest? "},{"num":50,"verse":"Did not My hand make all these things?’"},{"header":"You Always Resist God! Your Fathers Killed The Prophets, And You The Messiah"},{"num":51,"verse":"“Stiff-necked ones, and uncircumcised in your hearts and ears— you are always resisting the Holy Spirit. As your fathers did, you also are doing. "},{"num":52,"verse":"Which of the prophets did your fathers not persecute? And they killed the ones having announced-beforehand about the coming of the righteous One, of Whom you now became betrayers and murderers— "},{"num":53,"verse":"you who received the Law by the directions of  angels and did not keep it!”"},{"header":"Stephen Reports Seeing Jesus At The Right Hand of God. The Jews Stone Him To Death"},{"num":54,"verse":"And hearing these things, they were infuriated in their hearts, and were grinding their teeth at him. "},{"num":55,"verse":"But being full of the Holy Spirit, having looked-intently into heaven, he saw the glory of God, and Jesus standing on the right side of God. "},{"num":56,"verse":"And he said, “Behold— I see the heavens opened, and the Son of Man standing on the right side of God!” "},{"num":57,"verse":"And having cried-out with a loud voice, they held-shut their ears, and rushed against him with-one-accord. "},{"num":58,"verse":"And having driven him outside of the city, they were stoning him. And the witnesses laid-aside their garments at the feet of a young-man being called Saul. "},{"num":59,"verse":"And they were stoning Stephen while he was calling-upon Jesus and saying, “Lord Jesus, receive my spirit”. "},{"num":60,"verse":"And having put down his knees, he cried-out with a loud voice, “Lord, do not set this sin against them”. And having said this, he fell-asleep. "}]