[{"header":"Stephen's Speech"},{"num":7,"verse":"The High Priest asked Stephen, “Is this true?”"},{"num":2,"verse":"Stephen answered, “Brothers and fathers, listen to me! Before our ancestor Abraham had gone to live in Haran, the God of glory appeared to him in Mesopotamia "},{"num":3,"verse":"and said to him, ‘Leave your family and country and go to the land that I will show you.’ "},{"num":4,"verse":"And so he left his country and went to live in Haran. After Abraham's father died, God made him move to this land where you now live. "},{"num":5,"verse":"God did not then give Abraham any part of it as his own, not even a square foot of ground, but God promised to give it to him, and that it would belong to him and to his descendants. At the time God made this promise, Abraham had no children. "},{"num":6,"verse":"This is what God said to him: ‘Your descendants will live in a foreign country, where they will be slaves and will be badly treated for four hundred years. "},{"num":7,"verse":"But I will pass judgment on the people that they will serve, and afterward your descendants will come out of that country and will worship me in this place.’ "},{"num":8,"verse":"Then God gave to Abraham the ceremony of circumcision as a sign of the covenant. So Abraham circumcised Isaac a week after he was born; Isaac circumcised his son Jacob, and Jacob circumcised his twelve sons, the famous ancestors of our race."},{"num":9,"verse":"“Jacob's sons became jealous of their brother Joseph and sold him to be a slave in Egypt. But God was with him "},{"num":10,"verse":"and brought him safely through all his troubles. When Joseph appeared before the king of Egypt, God gave him a pleasing manner and wisdom, and the king made Joseph governor over the country and the royal household. "},{"num":11,"verse":"Then there was a famine all over Egypt and Canaan, which caused much suffering. Our ancestors could not find any food, "},{"num":12,"verse":"and when Jacob heard that there was grain in Egypt, he sent his sons, our ancestors, on their first visit there. "},{"num":13,"verse":"On the second visit Joseph made himself known to his brothers, and the king of Egypt came to know about Joseph's family. "},{"num":14,"verse":"So Joseph sent a message to his father Jacob, telling him and the whole family, seventy-five people in all, to come to Egypt. "},{"num":15,"verse":"Then Jacob went to Egypt, where he and his sons died. "},{"num":16,"verse":"Their bodies were taken to Shechem, where they were buried in the grave which Abraham had bought from the clan of Hamor for a sum of money."},{"num":17,"verse":"“When the time drew near for God to keep the promise he had made to Abraham, the number of our people in Egypt had grown much larger. "},{"num":18,"verse":"At last a king who did not know about Joseph began to rule in Egypt. "},{"num":19,"verse":"He tricked our ancestors and was cruel to them, forcing them to put their babies out of their homes, so that they would die. "},{"num":20,"verse":"It was at this time that Moses was born, a very beautiful child. He was cared for at home for three months, "},{"num":21,"verse":"and when he was put out of his home, the king's daughter adopted him and brought him up as her own son. "},{"num":22,"verse":"He was taught all the wisdom of the Egyptians and became a great man in words and deeds."},{"num":23,"verse":"“When Moses was forty years old, he decided to find out how his fellow Israelites were being treated. "},{"num":24,"verse":"He saw one of them being mistreated by an Egyptian, so he went to his help and took revenge on the Egyptian by killing him. "},{"num":25,"verse":"(He thought that his own people would understand that God was going to use him to set them free, but they did not understand.) "},{"num":26,"verse":"The next day he saw two Israelites fighting, and he tried to make peace between them. ‘Listen, men,’ he said, ‘you are fellow Israelites; why are you fighting like this?’ "},{"num":27,"verse":"But the one who was mistreating the other pushed Moses aside. ‘Who made you ruler and judge over us?’ he asked. "},{"num":28,"verse":"‘Do you want to kill me, just as you killed that Egyptian yesterday?’ "},{"num":29,"verse":"When Moses heard this, he fled from Egypt and went to live in the land of Midian. There he had two sons."},{"num":30,"verse":"“After forty years had passed, an angel appeared to Moses in the flames of a burning bush in the desert near Mount Sinai. "},{"num":31,"verse":"Moses was amazed by what he saw, and went near the bush to get a better look. But he heard the Lord's voice: "},{"num":32,"verse":"‘I am the God of your ancestors, the God of Abraham, Isaac, and Jacob.’ Moses trembled with fear and dared not look. "},{"num":33,"verse":"The Lord said to him, ‘Take your sandals off, for the place where you are standing is holy ground. "},{"num":34,"verse":"I have seen the cruel suffering of my people in Egypt. I have heard their groans, and I have come down to set them free. Come now; I will send you to Egypt.’"},{"num":35,"verse":"“Moses is the one who was rejected by the people of Israel. ‘Who made you ruler and judge over us?’ they asked. He is the one whom God sent to rule the people and set them free with the help of the angel who appeared to him in the burning bush. "},{"num":36,"verse":"He led the people out of Egypt, performing miracles and wonders in Egypt and at the Red Sea and for forty years in the desert. "},{"num":37,"verse":"Moses is the one who said to the people of Israel, ‘God will send you a prophet, just as he sent me, and he will be one of your own people.’ "},{"num":38,"verse":"He is the one who was with the people of Israel assembled in the desert; he was there with our ancestors and with the angel who spoke to him on Mount Sinai, and he received God's living messages to pass on to us."},{"num":39,"verse":"“But our ancestors refused to obey him; they pushed him aside and wished that they could go back to Egypt. "},{"num":40,"verse":"So they said to Aaron, ‘Make us some gods who will lead us. We do not know what has happened to that man Moses, who brought us out of Egypt.’ "},{"num":41,"verse":"It was then that they made an idol in the shape of a bull, offered sacrifice to it, and had a feast in honor of what they themselves had made. "},{"num":42,"verse":"So God turned away from them and gave them over to worship the stars of heaven, as it is written in the book of the prophets:"},{"num":44,"verse":"“Our ancestors had the Tent of God's presence with them in the desert. It had been made as God had told Moses to make it, according to the pattern that Moses had been shown. "},{"num":45,"verse":"Later on, our ancestors who received the tent from their fathers carried it with them when they went with Joshua and took over the land from the nations that God drove out as they advanced. And it stayed there until the time of David. "},{"num":46,"verse":"He won God's favor and asked God to allow him to provide a dwelling place for the God of Jacob. "},{"num":47,"verse":"But it was Solomon who built him a house."},{"num":48,"verse":"“But the Most High God does not live in houses built by human hands; as the prophet says,"},{"num":51,"verse":"“How stubborn you are!” Stephen went on to say. “How heathen your hearts, how deaf you are to God's message! You are just like your ancestors: you too have always resisted the Holy Spirit! "},{"num":52,"verse":"Was there any prophet that your ancestors did not persecute? They killed God's messengers, who long ago announced the coming of his righteous Servant. And now you have betrayed and murdered him. "},{"num":53,"verse":"You are the ones who received God's law, that was handed down by angels—yet you have not obeyed it!”"},{"header":"The Stoning of Stephen"},{"num":54,"verse":"As the members of the Council listened to Stephen, they became furious and ground their teeth at him in anger. "},{"num":55,"verse":"But Stephen, full of the Holy Spirit, looked up to heaven and saw God's glory and Jesus standing at the right side of God. "},{"num":56,"verse":"“Look!” he said. “I see heaven opened and the Son of Man standing at the right side of God!”"},{"num":57,"verse":"With a loud cry the Council members covered their ears with their hands. Then they all rushed at him at once, "},{"num":58,"verse":"threw him out of the city, and stoned him. The witnesses left their cloaks in the care of a young man named Saul. "},{"num":59,"verse":"They kept on stoning Stephen as he called out to the Lord, “Lord Jesus, receive my spirit!” "},{"num":60,"verse":"He knelt down and cried out in a loud voice, “Lord! Do not remember this sin against them!” He said this and died."}]