[{"header":"Stephen’s Speech"},{"num":7,"verse":"The high priest said to Stephen, “Are these things true?”"},{"num":2,"verse":"Stephen answered, “Brothers and fathers, listen to me. Our glorious God appeared to Abraham, our ancestor. Abraham was in Mesopotamia before he lived in Haran. "},{"num":3,"verse":"God said to Abraham, ‘Leave your country and your relatives. Go to the land I will show you.’ "},{"num":4,"verse":"So Abraham left the country of Chaldea and went to live in Haran. After Abraham’s father died, God sent him to this place where you now live. "},{"num":5,"verse":"God did not give Abraham any of this land, not even a foot of it. But God promised that he would give him and his descendants this land. (This was before Abraham had any descendants.) "},{"num":6,"verse":"This is what God said to him: ‘Your descendants will be strangers in a land they don’t own. The people there will make them slaves. And they will do cruel things to them for 400 years. "},{"num":7,"verse":"But I will punish the nation where they are slaves. Then your descendants will leave that land. Then they will worship me in this place.’ "},{"num":8,"verse":"God made an agreement with Abraham; the sign for this agreement was circumcision. And so when Abraham had his son Isaac, Abraham circumcised him when he was eight days old. Isaac also circumcised his son Jacob. And Jacob did the same for his sons, the 12 ancestors of our people."},{"num":9,"verse":"“These sons became jealous of Joseph. They sold him to be a slave in Egypt. But God was with him. "},{"num":10,"verse":"Joseph had many troubles there, but God saved him from all those troubles. The king of Egypt liked Joseph and respected him because of the wisdom that God gave him. The king made him governor of Egypt. He put Joseph in charge of all the people in his palace."},{"num":11,"verse":"“Then all the land of Egypt and of Canaan became so dry that nothing would grow there. This made the people suffer very much. The sons could not find anything to eat. "},{"num":12,"verse":"But when Jacob heard that there was grain in Egypt, he sent his sons, our ancestors, there. This was their first trip to Egypt. "},{"num":13,"verse":"Then they went there a second time. This time, Joseph told his brothers who he was. And the king learned about Joseph’s family. "},{"num":14,"verse":"Then Joseph sent some men to invite Jacob, his father, to come to Egypt. He also invited all his relatives (75 persons altogether). "},{"num":15,"verse":"So Jacob went down to Egypt, where he and his sons died. "},{"num":16,"verse":"Later their bodies were moved to Shechem and put in a grave there. (It was the same grave that Abraham had bought in Shechem from the sons of Hamor for a sum of money.)"},{"num":17,"verse":"“The number of people in Egypt grew large. There were more and more of our people there. (The promise that God made to Abraham was soon to come true.) "},{"num":18,"verse":"Then a new king began to rule Egypt. He did not know who Joseph was. "},{"num":19,"verse":"This king tricked our people and was cruel to our ancestors. He forced them to put their babies outside to die. "},{"num":20,"verse":"This was the time when Moses was born. He was a fine child. For three months Moses was cared for in his father’s house. "},{"num":21,"verse":"When they put Moses outside, the king’s daughter took him. She raised him as if he were her own son. "},{"num":22,"verse":"The Egyptians taught Moses all the things they knew. He was a powerful man in the things he said and did."},{"num":23,"verse":"“When Moses was about 40 years old, he thought it would be good to visit his brothers, the people of Israel. "},{"num":24,"verse":"Moses saw an Egyptian doing wrong to a Jew. So he defended the Jew and punished the Egyptian for hurting him. Moses killed the Egyptian. "},{"num":25,"verse":"Moses thought that his fellow Jews would understand that God was using him to save them. But they did not understand. "},{"num":26,"verse":"The next day, Moses saw two Jewish men fighting. He tried to make peace between them. He said, ‘Men, you are brothers! Why are you hurting each other?’ "},{"num":27,"verse":"The man who was hurting the other man pushed Moses away. He said, ‘Who made you our ruler and judge? "},{"num":28,"verse":"Are you going to kill me as you killed the Egyptian yesterday?’ "},{"num":29,"verse":"When Moses heard him say this, he left Egypt. He went to live in the land of Midian where he was a stranger. While Moses lived in Midian, he had two sons."},{"num":30,"verse":"“After 40 years Moses was in the desert near Mount Sinai. An angel appeared to him in the flames of a burning bush. "},{"num":31,"verse":"When Moses saw this, he was amazed. He went near to look closer at it. Moses heard the Lord’s voice. "},{"num":32,"verse":"The Lord said, ‘I am the God of your ancestors. I am the God of Abraham, Isaac and Jacob.’ Moses began to shake with fear and was afraid to look. "},{"num":33,"verse":"The Lord said to him, ‘Take off your sandals. You are standing on holy ground. "},{"num":34,"verse":"I have seen the troubles my people have suffered in Egypt. I have heard their cries. I have come down to save them. And now, Moses, I am sending you back to Egypt.’"},{"num":35,"verse":"“This Moses was the same man the Jews said they did not want. They had said to him, ‘Who made you our ruler and judge?’ Moses is the same man God sent to be a ruler and savior, with the help of an angel. This was the angel Moses saw in the burning bush. "},{"num":36,"verse":"So Moses led the people out of Egypt. He worked miracles and signs in Egypt, at the Red Sea, and then in the desert for 40 years. "},{"num":37,"verse":"This is the same Moses that said to the Jewish people: ‘God will give you a prophet like me. He will be one of your own people.’ "},{"num":38,"verse":"This is the same Moses who was with the gathering of the Jews in the desert. He was with the angel that spoke to him at Mount Sinai, and he was with our ancestors. He received commands from God that give life, and he gave those commands to us."},{"num":39,"verse":"“But our fathers did not want to obey Moses. They rejected him. They wanted to go back to Egypt again. "},{"num":40,"verse":"They said to Aaron, ‘Moses led us out of Egypt. But we don’t know what has happened to him. So make us gods who will lead us.’ "},{"num":41,"verse":"So the people made an idol that looked like a calf. Then they brought sacrifices to it. The people were proud of what they had made with their own hands! "},{"num":42,"verse":"But God turned against them. He did not try to stop them from worshiping the sun, moon and stars. This is what is written in the book of the prophets: God says,"},{"num":44,"verse":"“The Holy Tent where God spoke to our fathers was with the Jews in the desert. God told Moses how to make this Tent. He made it like the plan God showed him. "},{"num":45,"verse":"Later, Joshua led our fathers to capture the lands of the other nations. Our people went in, and God drove the other people out. When our people went into this new land, they took with them this same Tent. They received this Tent from their fathers and kept it until the time of David. "},{"num":46,"verse":"God was very pleased with David. He asked God to let him build a house for him, the God of Jacob. "},{"num":47,"verse":"But Solomon was the one who built the Temple."},{"num":48,"verse":"“But the Most High does not live in houses that men build with their hands. This is what the prophet says:"},{"num":51,"verse":"Stephen continued speaking: “You stubborn Jewish leaders! You have not given your hearts to God! You won’t listen to him! You are always against what the Holy Spirit is trying to tell you. Your ancestors were like this, and you are just like them! "},{"num":52,"verse":"Your fathers tried to hurt every prophet who ever lived. Those prophets said long ago that the Righteous One would come. But your fathers killed them. And now you have turned against the Righteous One and killed him. "},{"num":53,"verse":"You received the law of Moses, which God gave you through his angels. But you don’t obey it!”"},{"header":"Stephen Is Killed"},{"num":54,"verse":"When the leaders heard Stephen saying all these things, they became very angry. They were so mad that they were grinding their teeth at Stephen. "},{"num":55,"verse":"But Stephen was full of the Holy Spirit. He looked up to heaven and saw the glory of God. He saw Jesus standing at God’s right side. "},{"num":56,"verse":"He said, “Look! I see heaven open. And I see the Son of Man standing at God’s right side!”"},{"num":57,"verse":"Then they all shouted loudly. They covered their ears with their hands and all ran at Stephen. "},{"num":58,"verse":"They took him out of the city and threw stones at him until he was dead. The men who told lies against Stephen left their coats with a young man named Saul. "},{"num":59,"verse":"While they were throwing stones, Stephen prayed, “Lord Jesus, receive my spirit!” "},{"num":60,"verse":"He fell on his knees and cried in a loud voice, “Lord, do not hold this sin against them!” After Stephen said this, he died."}]