[[],[{"type":"header","content":"Stephen, Full of the Holy Spirit"},{"type":"prose","content":"Then the Chief Priest said, “What do you have to say for yourself?”"}],[{"type":"prose","content":"Stephen replied, “Friends, fathers, and brothers, the God of glory appeared to our father Abraham when he was still in Mesopotamia, before the move to Haran, and told him, ‘Leave your country and family and go to the land I’ll show you.’"}],[{"type":"prose","content":"“So he left the country of the Chaldees and moved to Haran. After the death of his father, he immigrated to this country where you now live, but God gave him nothing, not so much as a foothold. He did promise to give the country to him and his son later on, even though Abraham had no son at the time. God let him know that his offspring would move to an alien country where they would be enslaved and brutalized for four hundred years. ‘But,’ God said, ‘I will step in and take care of those slaveholders and bring my people out so they can worship me in this place.’"}],[{"type":"prose","content":"“Then he made a covenant with him and signed it in Abraham’s flesh by circumcision. When Abraham had his son Isaac, within eight days he reproduced the sign of circumcision in him. Isaac became father of Jacob, and Jacob father of twelve ‘fathers,’ each faithfully passing on the covenant sign."}],[{"type":"prose","content":"“But then those ‘fathers,’ burning up with jealousy, sent Joseph off to Egypt as a slave. God was right there with him, though—he not only rescued him from all his troubles but brought him to the attention of Pharaoh, king of Egypt. He was so impressed with Joseph that he put him in charge of the whole country, including his own personal affairs."}],[{"type":"prose","content":"“Later a famine descended on that entire region, stretching from Egypt to Canaan, bringing terrific hardship. Our hungry fathers looked high and low for food, but the cupboard was bare. Jacob heard there was food in Egypt and sent our fathers to scout it out. Having confirmed the report, they went back to Egypt a second time to get food. On that visit, Joseph revealed his true identity to his brothers and introduced the Jacob family to Pharaoh. Then Joseph sent for his father, Jacob, and everyone else in the family, seventy-five in all. That’s how the Jacob family got to Egypt."}],[{"type":"prose","content":"“Jacob died, and our fathers after him. They were taken to Shechem and buried in the tomb for which Abraham paid a good price to the sons of Hamor."}],[{"type":"prose","content":"“When the four hundred years were nearly up, the time God promised Abraham for deliverance, the population of our people in Egypt had become very large. And there was now a king over Egypt who had never heard of Joseph. He exploited our race mercilessly. He went so far as forcing us to abandon our newborn infants, exposing them to the elements to die a cruel death."}],[{"type":"prose","content":"“In just such a time Moses was born, a most beautiful baby. He was hidden at home for three months. When he could be hidden no longer, he was put outside—and immediately rescued by Pharaoh’s daughter, who mothered him as her own son. Moses was educated in the best schools in Egypt. He was equally impressive as a thinker and an athlete."}],[{"type":"prose","content":"“When he was forty years old, he wondered how everything was going with his Hebrew kin and went out to look things over. He saw an Egyptian abusing one of them and stepped in, avenging his underdog brother by knocking the Egyptian flat. He thought his brothers would be glad that he was on their side, and even see him as an instrument of God to deliver them. But they didn’t see it that way. The next day two of them were fighting and he tried to break it up, told them to shake hands and get along with each other: ‘Friends, you are brothers, why are you beating up on each other?’"}],[{"type":"prose","content":"“The one who had started the fight said, ‘Who put you in charge of us? Are you going to kill me like you killed that Egyptian yesterday?’ When Moses heard that, realizing that the word was out, he ran for his life and lived in exile over in Midian. During the years of exile, two sons were born to him."}],[{"type":"prose","content":"“Forty years later, in the wilderness of Mount Sinai, an angel appeared to him in the guise of flames of a burning bush. Moses, not believing his eyes, went up to take a closer look. He heard God’s voice: ‘I am the God of your fathers, the God of Abraham, Isaac, and Jacob.’ Frightened nearly out of his skin, Moses shut his eyes and turned away."}],[{"type":"prose","content":"“God said, ‘Kneel and pray. You are in a holy place, on holy ground. I’ve seen the agony of my people in Egypt. I’ve heard their groans. I’ve come to help them. So get yourself ready; I’m sending you back to Egypt.’"}],[{"type":"prose","content":"“This is the same Moses whom they earlier rejected, saying, ‘Who put you in charge of us?’ This is the Moses that God, using the angel flaming in the burning bush, sent back as ruler and redeemer. He led them out of their slavery. He did wonderful things, setting up God-signs all through Egypt, down at the Red Sea, and out in the wilderness for forty years. This is the Moses who said to his congregation, ‘God will raise up a prophet just like me from your descendants.’ This is the Moses who stood between the angel speaking at Sinai and your fathers assembled in the wilderness and took the life-giving words given to him and handed them over to us, words our fathers would have nothing to do with."}],[{"type":"prose","content":"“They craved the old Egyptian ways, whining to Aaron, ‘Make us gods we can see and follow. This Moses who got us out here miles from nowhere—who knows what’s happened to him!’ That was the time when they made a calf-idol, brought sacrifices to it, and congratulated each other on the wonderful religious program they had put together."}],[{"type":"prose","content":"“God wasn’t at all pleased; but he let them do it their way, worship every new god that came down the pike—and live with the consequences, consequences described by the prophet Amos:"},{"type":"poetry","content":"Did you bring me offerings of animals and grains"},{"type":"poetry","content":"Hardly. You were too busy building shrines"},{"type":"poetry","content":"Worshiping them with all your might."}],[{"type":"prose","content":"“And all this time our ancestors had a tent shrine for true worship, made to the exact specifications God provided Moses. They had it with them as they followed Joshua, when God cleared the land of pagans, and still had it right down to the time of David. David asked God for a permanent place for worship. But Solomon built it."}],[{"type":"prose","content":"“Yet that doesn’t mean that Most High God lives in a building made by carpenters and masons. The prophet Isaiah put it well when he wrote,"},{"type":"poetry","content":"“Heaven is my throne room;"},{"type":"poetry","content":"So what kind of house"},{"type":"poetry","content":"“Where I can get away and relax?"}],[{"type":"prose","content":"“And you continue, so bullheaded! Calluses on your hearts, flaps on your ears! Deliberately ignoring the Holy Spirit, you’re just like your ancestors. Was there ever a prophet who didn’t get the same treatment? Your ancestors killed anyone who dared talk about the coming of the Just One. And you’ve kept up the family tradition—traitors and murderers, all of you. You had God’s Law handed to you by angels—gift-wrapped!—and you squandered it!”"}],[{"type":"prose","content":"At that point they went wild, a rioting mob of catcalls and whistles and invective. But Stephen, full of the Holy Spirit, hardly noticed—he only had eyes for God, whom he saw in all his glory with Jesus standing at his side. He said, “Oh! I see heaven wide open and the Son of Man standing at God’s side!”"}],[{"type":"prose","content":"Yelling and hissing, the mob drowned him out. Now in full stampede, they dragged him out of town and pelted him with rocks. The ringleaders took off their coats and asked a young man named Saul to watch them."}],[{"type":"prose","content":"As the rocks rained down, Stephen prayed, “Master Jesus, take my life.” Then he knelt down, praying loud enough for everyone to hear, “Master, don’t blame them for this sin”—his last words. Then he died.Saul was right there, congratulating the killers."}]]