[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What have I here . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "?—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., What have I to do? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Jehovah is represented as deliberating after the manner of men. Again the people have been gratuitously, wantonly attacked; and their groans mingle with the taunting blasphemies of their conquerors. Has not the time come for Him to vindicate His outraged Majesty?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "52:1-12 The gospel proclaims liberty to those bound with fears. Let those weary and heavy laden under the burden of sin, find relief in Christ, shake themselves from the dust of their doubts and fears, and loose themselves from those bands. The price paid by the Redeemer for our salvation, was not silver or gold, or corruptible things, but his own precious blood. Considering the freeness of this salvation, and how hurtful to temporal comfort sins are, we shall more value the redemption which is in Christ. Do we seek victory over every sin, recollecting that the glory of God requires holiness in every follower of Christ? The good news is, that the Lord Jesus reigns. Christ himself brought these tidings first. His ministers proclaim these good tidings: keeping themselves clean from the pollutions of the world, they are beautiful to those to whom they are sent. Zion's watchmen could scarcely discern any thing of God's favour through the dark cloud of their afflictions; but now the cloud is scattered, they shall plainly see the performance. Zion's waste places shall then rejoice; all the world will have the benefit. This is applied to our salvation by Christ. Babylon is no place for Israelites. And it is a call to all in the bondage of sin and Satan, to use the liberty Christ has proclaimed. They were to go with diligent haste, not to lose time nor linger; but they were not to go with distrustful haste. Those in the way of duty, are under God's special protection; and he that believes this, will not hasten for fear.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now, therefore, what have I here? - In Babylon, referring to the captivity of the Jews there. The idea is, that a state of things existed there which demanded his interposition as really as it did when his people had been oppressed by the Egyptians, or by the Assyrian. His people had been taken away for nought; they were subject to cruel oppressions; and his own name was continually blasphemed. In this state of things, it is inferred, that he would certainly come to their rescue, and that his own perfections as well as their welfare demanded that he should interpose to redeem them. The phrase, 'what have I here?' is equivalent to saying, what shall I do? what am I properly called on to do? or what reason is there now in Babylon for my interposition to rescue my people? It is implied, that such was the state of things, that God felt that there was something that demanded his interposition.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That my people is taken away for nought - This was one thing existing in Babylon that demanded his interposition. His people had been made captive by the Chaldeans, and were now suffering under their oppressions. This had been done 'for nought;' that is, it had been done without any just claim. It was on their part a mere act of gross and severe oppression, and this demanded the interposition of a righteous God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They that rule over them make them to howl - Lowth renders this, 'They that are lords over them make their boast of it.' Noyes renders it, 'And their tyrants exult.' The Septuagint renders it, 'My people are taken away for nought: wonder ye, and raise a mournful cry' (ὀλολύζετε  ololuzete). Jerome renders it, 'Their lords act unjustly, and they therefore howl when they are delivered to torments.' Aben Ezra supposes that by 'their lords' here, or those who rule over them, are meant the rulers of the Jewish people, and that the idea is, that they lament and howl over the calamities and oppressions of the people. But it is probable, after all, that our translators have given the true sense of the text, and that the idea is, that they were suffering such grievous oppressions in Babylon as to make them lift up the cry of lamentation and of grief. This was a reason why God should interpose as he had done in former times, and bring deliverance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And my name continually every day is blasphemed - That is, in Babylon. The proud and oppressive Babylonians delight to add to the sorrows of the exiles by reproaching the name of their God, and by saying that he was unable to defend them and their city from ruin. This is the third reason why God would interpose to rescue them. The three reasons in this verse are, that they had been taken away for nought; that they were suffering grievous and painful oppression; and that the name of God was reproached. On all these accounts he felt that he had something to do in Babylon, and that his interposition was demanded. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And my name continually every day is blasphemed - That is, in Babylon. The proud and oppressive Babylonians delight to add to the sorrows of the exiles by reproaching the name of their God, and by saying that he was unable to defend them and their city from ruin. This is the third reason why God would interpose to rescue them. The three reasons in this verse are, that they had been taken away for nought; that they were suffering grievous and painful oppression; and that the name of God was reproached. On all these accounts he felt that he had something to do in Babylon, and that his interposition was demanded. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. what have I here—that is, what am I called on to do? The fact \"that My people is taken away (into captivity; Isa 49:24, 25) for naught\" (by gratuitous oppression, Isa 52:4; also Isa 52:3, and see on [844]Isa 52:3) demands My interposition.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they that rule—or \"tyrannize,\" namely, Babylon, literal and mystical.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "make … to howl—or, raise a cry of exultation over them [Maurer].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "blasphemed—namely, in Babylon: God's reason for delivering His people, not their goodness, but for the sake of His holy name (Eze 20:9, 14).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What have I here?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What to me here",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? the sense is either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. What do I here? Why do I sit still here, and not go to Babylon to punish the Babylonians, and to deliver my people? Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. What honour have I by suffering this injury to be done to my people? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Is taken away, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were carried away captive by the Babylonians, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "for nought; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " without any provocation or pretence of right. See before on ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 52:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". They that rule over then, who by their office are obliged to deal justly and tenderly with their subjects, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "make them to howl, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by their tyrannical and unmerciful usage of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My name continually every day is blasphemed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " instead of that praise and service which the Babylonians owe me for all their successes and conquests, they blaspheme me, as if I wanted either power or good-will to save my people out of their hands. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now therefore what have I here, saith the Lord, that my people is taken away for nought?.... Or what do I get by it, that my people should be taken and held in captivity without cause? I am no gainer, but a loser by it, as it afterwards appears; and therefore why should I sit still, and delay the deliverance of my people any longer? but as I have delivered Israel out of Egypt, and the Jews from Babylon, so will I deliver my people out of mystical Babylon, spiritually called Sodom and Egypt. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They that rule over them cause them to howl, saith the Lord; they that hath carried them captive, and exercised a tyrannical power over them, cause them to howl under their bondage and slavery, as the Israelites formerly in Egypt; wherefore the Lord is moved with compassion to them, and since neither he nor they were gainers, but losers by their captivity, he determines to deliver them: or it may be rendered, \"they cause its rulers to howl\" (i), or his rulers howl; not the common people only, but their governors, civil and ecclesiastical; so Aben Ezra interprets it not of Heathen rulers, but of the great men of Israel: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and my name continually every day is blasphemed; by ascribing their extent of power and authority, their dominions and conquests, not to the Lord, but to their idols, whom they worship, to such or such a saint; opening their mouths in blasphemy against God, his name and tabernacle, and his people, Revelation 13:5. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and my name continually every day is blasphemed; by ascribing their extent of power and authority, their dominions and conquests, not to the Lord, but to their idols, whom they worship, to such or such a saint; opening their mouths in blasphemy against God, his name and tabernacle, and his people, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and always, all the day, because of the worship of my name, they provoke.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Septuagint is, \"for you always my name is blasphemed among the Gentiles\"; see Romans 2:24. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Septuagint is, \"for you always my name is blasphemed among the Gentiles\"; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i)  \"dominatores ejus ululare facient\", Montanus; \"dominus ipsius ejulant\", Junius & Tremellius, Vitringa; \"ululant\", Piscator; \"qui habent potestatem in eum ejulant\", Cocceius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i)  \"dominatores ejus ululare facient\", Montanus; \"dominus ipsius ejulant\", Junius & Tremellius, Vitringa; \"ululant\", Piscator; \"qui habent potestatem in eum ejulant\", Cocceius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Now therefore, what have I here, saith the LORD, that my people is taken away for nothing? they that rule over them make them to wail, saith the LORD; and my name continually every day is {f} blasphemed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Now therefore, what have I here, saith the LORD, that my people is taken away for nothing? they that rule over them make them to wail, saith the LORD; and my name continually every day ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " blasphemed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) That is, by the wicked, who think that I have no power to deliver them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", accentuating the gravity of the present situation. Exile and oppression were indeed no new experiences for Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 52:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), but no such overwhelming disaster as this had ever befallen it hitherto.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what have I here &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The sentence may be variously understood. The main idea obviously is that the state of things described in what follows is not to be endured, being inconsistent with the honour of Jehovah. The formula “What is there to me?” expresses a strong sense of incongruity between what is and what ought to be (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and we may render either, “What am I about (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") here (in Babylonia)?” or, more generally, “What do I find here?” i.e. in the existing position of affairs, as contrasted with the historic parallels in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 52:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The last is perhaps to be preferred. The meaning can hardly be, “What have I to do here (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") now that my people is taken away?”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (better ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my people is taken away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] destroyed outright (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they that rule over them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the Chaldæans) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "make",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to howl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "do howl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")] The R.V. rightly avoids the causative sense of the verb, which has no support in usage. On the other hand, it is nowhere else used of a shout of exultation, as it must be here; comp. with Gesenius and others, “laetis ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ululare",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " triumphis” (Lucan, 6, 261). In Syriac also the word appears occasionally to undergo a similar modification.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my name … is blasphemed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "despised",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (The form should probably be pointed as part. Pual.) The meaning is that the calamities of Israel were attributed by the heathen to the impotence of their God, and thus the majesty of Jehovah was impaired,—a thought frequently expressed by Ezekiel (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 36:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.). The words are cited in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "continually",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "all the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] (R.V.), as ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What have I here?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "what have r to do here",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what is the task before me - the work that I have to perform? There are three principal considerations by which the answer to this question has to be determined. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Babylonians have obtained possession of the Israelites without purchase - for nought; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they use their authority harshly and brutally; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they continually blaspheme the Name of Jehovah. All three are grounds for bringing the captivity to an end, and coming forward with the cry of a deliverer, \"Here I am.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Make them to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "howl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "howl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " insult over the captives with shouts and yells of triumph. The prophet is speaking of the Babylonian oppressors, not of the native \"rulers,\" who exercised a certain amount of authority over the captives (see Delitzsch and Cheyne). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My Name...  is blasphemed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cruel taskmasters vexed the captives by insulting their God. Isaiah 52:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The reason for the address is now given in a well-sustained promise. \"For thus saith Jehovah, Ye have been sold for nothing, and ye shall not be redeemed with silver. For thus saith the Lord Jehovah, My people went down to Egypt in the beginning to dwell there as guests; and Asshur has oppressed it for nothing. And now, what have I to do here? saith Jehovah: for my people are taken away for nothing; their oppressors shriek, saith Jehovah, and my name is continually blasphemed all the day. Therefore my people shall learn my name; therefore, in that day, that I am He who saith, There am I.\" Ye have been sold (this is the meaning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but this selling is merely a giving over to a foreign power, without the slightest advantage accusing to Him who had no other object in view than to cause them to atone for their sins (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 50:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and without any other people taking their place, and serving Him in their stead as an equivalent for the loss He sustained. And there would be no need of silver to purchase the favour of Him who had given them up, since a manifestation of divine power would be all that would be required (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For whether Jehovah show Himself to Israel as the Righteous One or as the Gracious One, as a Judge or as a Redeemer, He always acts as the Absolute One, exalted above all earthly affairs, having no need to receive anything, but able to give everything. He receives no recompense, and gives none. Whether punishing or redeeming, He always guards His people's honour, proving Himself in the one case to be all-sufficient, and in the other almighty, but acting in both cases freely from Himself. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the train of thought in Isaiah 52:4-6 the reason is given for the general statement in Isaiah 52:3. Israel went down to Egypt, the country of the Nile valley, with the innocent intention of sojourning, i.e., living as a guest (gūr) there in a foreign land; and yet (as we may supply from the next clause, according to the law of a self-completing parallelism) there it fell into the bondage of the Pharaohs, who, whilst they did not fear Jehovah, but rather despised Him, were merely the blind instruments of His will. Asshur then oppressed it bephes, i.e., not \"at last\" (ultimo tempore, as Hvernick renders it), but (as אפס is the synonym of אין in Isaiah 40:17; Isaiah 41:2) \"for nothing,\" i.e., without having acquired any right to it, but rather serving in its unrighteousness simply as the blind instrument of the righteousness of Jehovah, who through the instrumentality of Asshur put an end first of all to the kingdom of Israel, and then to the kingdom of Judah. The two references to the Egyptian and Assyrian oppressions are expressed in as brief terms as possible. But with the words \"now therefore\" the prophecy passes on in a much more copious strain to the present oppression in Babylon. Jehovah inquires, Quid mihi hic (What have I to do here)? Hitzig supposes pōh (here) to refer to heaven, in the sense of, \"What pressing occupation have I here, that all this can take place without my interfering?\" But such a question as this would be far more appropriate to the Zeus of the Greek comedy than to the Jehovah of prophecy. Knobel, who takes pōh as referring to the captivity, in accordance with the context, gives a ridiculous turn to the question, viz., \"What do I get here in Babylonia, from the fact that my people are carried off for nothing? Only loss.\" He observes himself that there is a certain wit in the question. But it would be silly rather than witty, if, after Jehovah had just stated that He had given up His people for nothing, the prophet represented Him as preparing to redeem it by asking, \"What have I gained by it?\" The question can have no other meaning, according to Isaiah 22:16, than \"What have I to do here?\" Jehovah is thought of as present with His people (cf., Genesis 46:4), and means to inquire whether He shall continue this penal condition of exile any longer (Targum, Rashi, Rosenmller, Ewald, Stier, etc.). The question implies an intention to redeem Israel, and the reason for this intention is introduced with kı̄. Israel is taken away (ablatus), viz., from its own native home, chinnâm, i.e., without the Chaldeans having any human claim upon them whatever. The words יהיליילוּ משׁליו (משׁלו) are not to be rendered, \"its singers lament,\" as Reutschi and Rosenmller maintain, since the singers of Israel are called meshōrerı̄m; nor \"its (Israel's) princes lament,\" as Vitringa and Hitzig supposed, since the people of the captivity, although they had still their national sârı̄m, had no other mōshelı̄m than the Chaldean oppressors (Isaiah 49:7; Isaiah 14:5). It is the intolerable tyranny of the oppressors of His people, that Jehovah assigns in this sentence as the reason for His interposition, which cannot any longer be deferred. It is true that we do meet with hēlı̄l (of which we have the future here without any syncope of the first syllable) in other passages in the sense of ululare, as a cry of pain; but just as הריע, רנן, רזח signify a yelling utterance of either joy or pain, so heeliil may also be applied to the harsh shrieking of the capricious tyrants, like Lucan's laetis ululare triumphis, and the Syriac ailel, which is used to denote a war-cry and other noises as well. In connection with this proud and haughty bluster, there is also the practice of making Jehovah's name the butt of their incessant blasphemy: מנּאץ is a part. hithpoel with an assimilated ת and a pausal ā for ē, although it might also be a passive hithpoal (for the ō in the middle syllable, compare מגאל, Malachi 1:7; מבהל, Esther 8:14). In Isaiah 52:6 there follows the closing sentence of the whole train of thought: therefore His people are to get to learn His name, i.e., the self-manifestation of its God, who is so despised by the heathen; therefore lâkhēn repeated with emphasis, like כּעל in Isaiah 59:18, and possibly min in Psalm 45:9) in that day, the day of redemption, (supply \"it shall get to learn\") that \"I am he who saith, Here am I,\" i.e., that He who has promised redemption is now present as the True and Omnipotent One to carry it into effect. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the train of thought in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the reason is given for the general statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Israel went down to Egypt, the country of the Nile valley, with the innocent intention of sojourning, i.e., living as a guest (gūr) there in a foreign land; and yet (as we may supply from the next clause, according to the law of a self-completing parallelism) there it fell into the bondage of the Pharaohs, who, whilst they did not fear Jehovah, but rather despised Him, were merely the blind instruments of His will. Asshur then oppressed it bephes, i.e., not \"at last\" (ultimo tempore, as Hvernick renders it), but (as אפס is the synonym of אין in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") \"for nothing,\" i.e., without having acquired any right to it, but rather serving in its unrighteousness simply as the blind instrument of the righteousness of Jehovah, who through the instrumentality of Asshur put an end first of all to the kingdom of Israel, and then to the kingdom of Judah. The two references to the Egyptian and Assyrian oppressions are expressed in as brief terms as possible. But with the words \"now therefore\" the prophecy passes on in a much more copious strain to the present oppression in Babylon. Jehovah inquires, Quid mihi hic (What have I to do here)? Hitzig supposes pōh (here) to refer to heaven, in the sense of, \"What pressing occupation have I here, that all this can take place without my interfering?\" But such a question as this would be far more appropriate to the Zeus of the Greek comedy than to the Jehovah of prophecy. Knobel, who takes pōh as referring to the captivity, in accordance with the context, gives a ridiculous turn to the question, viz., \"What do I get here in Babylonia, from the fact that my people are carried off for nothing? Only loss.\" He observes himself that there is a certain wit in the question. But it would be silly rather than witty, if, after Jehovah had just stated that He had given up His people for nothing, the prophet represented Him as preparing to redeem it by asking, \"What have I gained by it?\" The question can have no other meaning, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", than \"What have I to do here?\" Jehovah is thought of as present with His people (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 46:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and means to inquire whether He shall continue this penal condition of exile any longer (Targum, Rashi, Rosenmller, Ewald, Stier, etc.). The question implies an intention to redeem Israel, and the reason for this intention is introduced with kı̄. Israel is taken away (ablatus), viz., from its own native home, chinnâm, i.e., without the Chaldeans having any human claim upon them whatever. The words יהיליילוּ משׁליו (משׁלו) are not to be rendered, \"its singers lament,\" as Reutschi and Rosenmller maintain, since the singers of Israel are called meshōrerı̄m; nor \"its (Israel's) princes lament,\" as Vitringa and Hitzig supposed, since the people of the captivity, although they had still their national sârı̄m, had no other mōshelı̄m than the Chaldean oppressors (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is the intolerable tyranny of the oppressors of His people, that Jehovah assigns in this sentence as the reason for His interposition, which cannot any longer be deferred. It is true that we do meet with hēlı̄l (of which we have the future here without any syncope of the first syllable) in other passages in the sense of ululare, as a cry of pain; but just as הריע, רנן, רזח signify a yelling utterance of either joy or pain, so heeliil may also be applied to the harsh shrieking of the capricious tyrants, like Lucan's laetis ululare triumphis, and the Syriac ailel, which is used to denote a war-cry and other noises as well. In connection with this proud and haughty bluster, there is also the practice of making Jehovah's name the butt of their incessant blasphemy: מנּאץ is a part. hithpoel with an assimilated ת and a pausal ā for ē, although it might also be a passive hithpoal (for the ō in the middle syllable, compare מגאל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; מבהל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " there follows the closing sentence of the whole train of thought: therefore His people are to get to learn His name, i.e., the self-manifestation of its God, who is so despised by the heathen; therefore lâkhēn repeated with emphasis, like כּעל in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and possibly min in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in that day, the day of redemption, (supply \"it shall get to learn\") that \"I am he who saith, Here am I,\" i.e., that He who has promised redemption is now present as the True and Omnipotent One to carry it into effect. ",
            "children": []
          }
        ]
      }
    ]
  }
]