[{"header":"Jesus Is Our Advocate With God. We Know That We Know Him If We Keep His Commands"},{"num":2,"verse":"My little-children, I am writing these things to you in order that you may not sin. And if anyone sins, we have an advocate with the Father: Jesus Christ the Righteous. "},{"num":2,"verse":"And He Himself is the satisfaction for our sins; and not for ours only, but also for the whole world’s. "},{"num":3,"verse":"And by this we know that we have come-to-know Him: if we are keeping His commandments. "},{"num":4,"verse":"The one claiming that “I have come-to-know Him” and not keeping His commandments is a liar, and the truth is not in this one. "},{"num":5,"verse":"But whoever is keeping His word, truly the love of God has been perfected in this one. By this we know that we are in Him: "},{"num":6,"verse":"the one claiming to be abiding in Him ought just as that One walked also himself thus to be walking."},{"header":"If We Are Loving One Another, We Are Abiding In The Light"},{"num":7,"verse":"Beloved, I am not writing a new commandment to you, but an old commandment which you had from the beginning. The old commandment is the word which you heard. "},{"num":8,"verse":"Yet-again I am writing a new commandment to you, which is true in Him and in you, because the darkness is passing-away and the true Light is already shining. "},{"num":9,"verse":"The one claiming to be in the light and hating his brother is in the darkness until now. "},{"num":10,"verse":"The one loving his brother is abiding in the light, and there is no cause-of-falling in him. "},{"num":11,"verse":"But the one hating his brother is in the darkness, and is walking in the darkness, and does not know where he is going because the darkness blinded his eyes."},{"header":"I Am Writing To You Because of What Has Already Happened In Your Life"},{"num":12,"verse":"I am writing to you, little-children, because your sins have been forgiven you for-the-sake-of His name. "},{"num":13,"verse":"I am writing to you, fathers, because you have known the One from the beginning. I am writing to you, young-men, because you have overcome the evil one."},{"header":"I Wrote To You Because of Who And What You Already Know"},{"num":14,"verse":"I wrote to you, children, because you have known the Father. I wrote to you, fathers, because you have known the One from the beginning. I wrote to you, young-men, because you are strong ones, and the word of God is abiding in you, and you have overcome the evil one."},{"header":"So Don’t Love The World Or Pursue Its Desires. The One Doing God’s Will Abides Forever"},{"num":15,"verse":"Do not be loving the world, nor the things in the world. If anyone is loving the world, the love of the Father is not in him. "},{"num":16,"verse":"Because everything in the world— the desire of  the flesh, and the desire of the eyes, and the boastful-pride of life— is not from the Father, but is from the world. "},{"num":17,"verse":"And the world is passing-away, and its desire. But the one doing the will of God abides forever."},{"header":"Children, Antichrists Have Arisen"},{"num":18,"verse":"Children, it is the last hour. And just as you heard that the Antichrist is coming, even now many antichrists have arisen— from which we know that it is the last hour. "},{"num":19,"verse":"They went out from us, but they were not of  us. For if they had been of us, they would have remained with us. But they went out in order that they might be made-evident that they all are not of us."},{"header":"You Have God’s Anointing And You Know The Truth. Let It Abide In You And You In It"},{"num":20,"verse":"And you have an Anointing from the Holy One, and you all have-knowledge. "},{"num":21,"verse":"I did not write to you because you do not know the truth, but because you know it, and that every lie is not from the truth. "},{"num":22,"verse":"Who is the liar if not the one denying that Jesus is the Christ? This one is the antichrist, the one denying the Father and the Son. "},{"num":23,"verse":"Everyone denying the Son does also-not have the Father. The one confessing the Son also has the Father. "},{"num":24,"verse":"Let what you heard from the beginning be abiding in you. If what you heard from the beginning abides in you, you also will abide in the Son and in the Father. "},{"num":25,"verse":"And this is the promise which He Himself promised to us: eternal life. "},{"num":26,"verse":"I wrote these things to you concerning the ones deceiving you. "},{"num":27,"verse":"And the Anointing which you received from Him is abiding in you. And you have no need that anyone should be teaching you; but as His Anointing is teaching you about all things, and is true and is not a lie, and just as it taught you, be abiding in it."},{"header":"Abide In Christ So That If He Appears You May Have Confidence And Not Shame"},{"num":28,"verse":"And now little-children, be abiding in Him so that if He appears, we may have confidence and not be put-to-shame by Him at His coming."},{"header":"Abiding Means Doing Righteousness, Which Characterizes All Those Born From God"},{"num":29,"verse":"If you know that He is righteous, you know that everyone also doing righteousness has been born from Him. "}]