[{"num":2,"verse":"My dear children, I’m writing this to you so that you will not sin. Yet, if anyone does sin, we have Jesus Christ, who has God’s full approval. He speaks on our behalf when we come into the presence of the Father. "},{"num":2,"verse":"He is the payment for our sins, and not only for our sins, but also for the sins of the whole world."},{"header":"Those Who Know Christ Obey His Commandments"},{"num":3,"verse":"We are sure that we know Christ if we obey his commandments. "},{"num":4,"verse":"The person who says, “I know him,” but doesn’t obey his commandments is a liar. The truth isn’t in that person. "},{"num":5,"verse":"But whoever obeys what Christ says is the kind of person in whom God’s love is perfected. That’s how we know we are in Christ. "},{"num":6,"verse":"Those who say that they live in him must live the same way he lived."},{"num":7,"verse":"Dear friends, it’s not as though I’m writing to give you a new commandment. Rather, I’m giving you an old commandment that you’ve had from the beginning. It’s the old commandment you’ve already heard. "},{"num":8,"verse":"On the other hand, I’m writing to give you a new commandment. It’s a truth that exists in Christ and in you: The darkness is fading, and the true light is already shining."},{"num":9,"verse":"Those who say that they are in the light but hate other believers are still in the dark. "},{"num":10,"verse":"Those who love other believers live in the light. Nothing will destroy the faith of those who live in the light. "},{"num":11,"verse":"Those who hate other believers are in the dark and live in the dark. They don’t know where they’re going, because they can’t see in the dark."},{"header":"Don’t Love the World"},{"num":15,"verse":"Don’t love the world and what it offers. Those who love the world don’t have the Father’s love in them. "},{"num":16,"verse":"Not everything that the world offers—physical gratification, greed, and extravagant lifestyles—comes from the Father. It comes from the world, and "},{"num":17,"verse":"the world and its evil desires are passing away. But the person who does what God wants lives forever."},{"header":"Live in Christ"},{"num":18,"verse":"Children, it’s the end of time. You’ve heard that an antichrist is coming. Certainly, many antichrists are already here. That’s how we know it’s the end of time. "},{"num":19,"verse":"They left us. However, they were never really part of us. If they had been, they would have stayed with us. But by leaving they made it clear that none of them were part of us."},{"num":20,"verse":"The Holy One has anointed you, so all of you have knowledge. "},{"num":21,"verse":"I’m writing to you because you know the truth, not because you don’t know the truth. You know that no lie ever comes from the truth."},{"num":22,"verse":"Who is a liar? Who else but the person who rejects Jesus as the Messiah? The person who rejects the Father and the Son is an antichrist. "},{"num":23,"verse":"Everyone who rejects the Son doesn’t have the Father either. The person who acknowledges the Son also has the Father. "},{"num":24,"verse":"Make sure that the message you heard from the beginning lives in you. If that message lives in you, you will also live in the Son and in the Father. "},{"num":25,"verse":"Christ has given us the promise of eternal life."},{"num":26,"verse":"I’m writing to you about those who are trying to deceive you. "},{"num":27,"verse":"The anointing you received from Christ lives in you. You don’t need anyone to teach you something else. Instead, Christ’s anointing teaches you about everything. His anointing is true and contains no lie. So live in Christ as he taught you to do."},{"header":"We Are God’s Children"},{"num":28,"verse":"Now, dear children, live in Christ. Then, when he appears we will have confidence, and when he comes we won’t turn from him in shame. "},{"num":29,"verse":"If you know that Christ has God’s approval, you also know that everyone who does what God approves of has been born from God."}]