[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Blot out.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The figure is most probably, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:32-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", taken from the custom of erasing a written record (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). So LXX. and Vulg. Isaiah, however (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") uses the same word in a different connection, “I will blot out thy sins as a cloud.” A fine thought that the error and guilt that cloud the mind and conscience can be cleared off like a mist by a breath from heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Transgressions.—See Psalm 32:1. The word seems to imply a wilful throwing off of authority or restraint, perhaps here the breach of the covenant-relation irrespective of any particular sin by which the breach was brought about. Whether it is an individual or the community that speaks, the prayer is that Jehovah would act according to His chesed or covenant-favour towards the suppliant, and wipe out from His records whatever has intervened between the covenant parties.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Transgressions",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".—See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 32:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word seems to imply a wilful throwing off of authority or restraint, perhaps here the breach of the covenant-relation irrespective of any particular sin by which the breach was brought about. Whether it is an individual or the community that speaks, the prayer is that Jehovah would act according to His ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "chesed ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or covenant-favour towards the suppliant, and wipe out from His records whatever has intervened between the covenant parties.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "DAVID’S CRY FOR PARDONPsalm 51:1 - Psalm 51:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "DAVID’S CRY FOR PARDON",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A whole year had elapsed between David’s crime and David’s penitence. It had been a year of guilty satisfaction not worth the having; of sullen hardening of heart against God and all His appeals. The thirty-second Psalm tells us how ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "happy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " David had been during that twelvemonth, of which he says, ‘My bones waxed old through my roaring all the day long. For day and night Thy hand was heavy on me.’ Then came Nathan with his apologue, and with that dark threatening that ‘the sword should never depart from his house,’ the fulfilment of which became a well-head of sorrow to the king for the rest of his days, and gave a yet deeper poignancy of anguish to the crime of his spoiled favourite Absalom. The stern words had their effect. The frost that had bound his soul melted all away, and he confessed his sin, and was forgiven then and there. ‘I have sinned against the Lord’ is the confession as recorded in the historical books; and, says Nathan, ‘The Lord hath made to pass from thee the iniquity of thy sin.’ Immediately, as would appear from the narrative, that very same day, the child of Bathsheba and David was smitten with fatal disease, and died in a week. And it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all these events-the threatening, the penitence, the pardon, the punishment-that he comes to God, who had so freely forgiven, and likewise so sorely smitten him, and wails out these prayers: ‘Blot out my transgressions, wash me from mine iniquity, cleanse me from my sin.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One almost shrinks from taking as the text of a sermon words like these, in which a broken and contrite spirit groans for deliverance, and which are, besides, hallowed by the thought of the thousands who have since found them the best expression of their sacredest emotions. But I would fain try not to lose the feeling that breathes through the words, while seeking for the thoughts which are in them, and hope that the light which they throw upon the solemn subjects of guilt and forgiveness may not be for any of us a mere cold light.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Looking then at this triad of petitions, they teach us first how David thought of his sin. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Looking then at this triad of petitions, they teach us first how David thought of his sin.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "You will observe the reiteration of the same earnest cry in all these clauses, and if you glance over the remainder of this psalm, you will find that he asks for the gifts of God’s Spirit, with a similar threefold repetition. Now this characteristic of the whole psalm is worth notice in the outset. It is not a mere piece of Hebrew parallelism. The requirements of poetical form but partially explain it. It is much more the earnestness of a soul that cannot be content with once asking for the blessings and then passing on, but dwells upon them with repeated supplication, not because it thinks that it shall be heard for its ‘much speaking,’ but because it longs for them so eagerly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And besides that, though the three clauses do express the same general idea, they express it under various modifications, and must be all taken together before we get the whole of the Psalmist’s thought of sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Notice again that he speaks of his evil as ‘transgressions’ and as ‘sin,’ first using the plural and then the singular. He regards it first as being broken up into a multitude of isolated acts, and then as being all gathered together into one knot, as it were, so that it is one thing. In one aspect it is ‘my transgressions’-’that thing that I did about Uriah, that thing that I did about Bathsheba, those other things that these dragged after them.’ One by one the acts of wrongdoing pass before him. But he does not stop there. They are not merely a number of deeds, but they have, deep down below, a common root from which they all came-a centre in which they all inhere. And so he says, not only ‘Blot out my ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "transgressions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ but ‘Wash me from mine ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "iniquity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ He does not merely generalise, but he sees and he feels what you and I have to feel, if we judge rightly of our evil actions, that we cannot take them only in their plurality as so many separate deeds, but that we must recognise them as coming from a common source, and we must lament before God not only our ‘sins’ but our ‘sin’-not only the outward acts of transgression, but that alienation of heart from which they all come; not only sin in its manifold manifestations as it comes out in the life, but in its inward roots as it coils round our hearts. You are not to confess acts alone, but let your contrition embrace the principle from which they come.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Further, in all the petitions we see that the idea of his own single responsibility for the whole thing is uppermost in David’s mind. It is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " transgression, it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " iniquity, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sin. He has not learned to say with Adam of old, and with some so-called wise thinkers to-day: ‘I was tempted, and I could not help it.’ He does not talk about ‘circumstances,’ and say that they share the blame with him. He takes it all to himself. ‘It was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " did it. True, I was tempted, but it was my soul that made the occasion a temptation. True, the circumstances led me astray, but they would not have led me astray if I had been right, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "where",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as well as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I ought to be.’ It is a solemn moment when that thought first rises in its revealing power to throw light into the dark places of our souls. But it is likewise a blessed moment, and without it we are scarcely aware of ourselves. Conscience quickens consciousness. The sense of transgression is the first thing that gives to many a man the full sense of his own individuality. There is nothing that makes us feel how awful and incommunicable is that mysterious personality by which every one of us lives alone after all companionship, so much as the contemplation of our relations to God’s law. ‘Every man shall bear his own burden.’ ‘Circumstances,’ yes; ‘bodily organisation,’ yes; ‘temperament,’ yes; ‘the maxims of society,’ ‘the conventionalities of the time,’ yes,-all these things have something to do with shaping our single deeds and with influencing our character; but after we have made all allowances for these influences which affect ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", let us ask the philosophers who bring them forward as diminishing or perhaps annihilating responsibility, ‘And what about that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which these things influence?’ After all, let me remember that the deed is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that every one of us shall, as Paul puts it, give account of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " unto God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Passing from that, let me point for one moment to another set of ideas that are involved in these petitions. The three words which the Psalmist employs for sin give prominence to different aspects of it. ‘Transgression’ is not the same as ‘iniquity,’ and ‘iniquity’ is not the same as ‘sin.’ They are not aimless, useless synonyms, but they have each a separate thought in them. The word rendered ‘transgression’ literally means rebellion, a breaking away from and setting oneself against lawful authority. That translated ‘iniquity’ literally means that which is twisted, bent. The word in the original for ‘sin’ literally means missing a mark, an aim. And this threefold view of sin is no discovery of David’s, but is the lesson which the whole Old Testament system had laboured to print deep on the national consciousness. That lesson, taught by law and ceremonial, by denunciation and remonstrance, by chastisement and deliverance, the penitent king has learned. To all men’s wrongdoings these descriptions apply, but most of all to his. Sin is ever, and his sin especially is, rebellion, the deflection of the life from the straight line which God’s law draws so clearly and firmly, and hence a missing the aim.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Think how profound and living is the consciousness of sin which lies in calling it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rebellion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is not merely, then, that we go against some abstract propriety, or break some impersonal law of nature when we do wrong, but that we rebel against a rightful Sovereign. In a special sense this was true of the Jew, whose nation stood under the government of a divine king, so that sin was treason, and breaches of the law acts of rebellion against God. But it is as true of us all. Our theory of morals will be miserably defective, and our practice will be still more defective, unless we have learned that morality is but the garment of religion, that the definition of virtue is obedience to God, and that the true sin in sin is not the yielding to impulses that belong to our nature, but the assertion in the act of yielding, of our independence of God and of our opposition to His will. And all this has application to David’s sin. He was God’s viceroy and representative, and he sets to his people the example of revolt, and lifts the standard of rebellion. It is as if the ruler of a province declared war against the central authority of which he was the creature, and used against it the very magazines and weapons with which it had intrusted him. He had rebelled, and in an eminent degree, as Nathan said to him, given to the enemies of God occasion to blaspheme.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Not less profound and suggestive is that other name for sin, that which is twisted, or bent, mine ‘iniquity.’ It is the same metaphor which lies in our own word ‘wrong,’ that which is wrung or warped from the straight line of right. To that line, drawn by God’s law, our lives should run parallel, bending neither to the right hand nor to the left. But instead of the firm directness of such a line, our lives show wavering deformity, and are like the tremulous strokes in a child’s copy-book. David had the pattern before him, and by its side his unsteady purpose, his passionate lust, had traced this wretched scrawl. The path on which he should have trodden was a straight course to God, unbending like one of these conquering Roman roads, that will turn aside for neither mountain nor ravine, nor stream nor bog. If it had been thus straight, it would have reached its goal. Journeying on that way of holiness, he would have found, and we shall find, that on it no ravenous beast shall meet us, but with songs and everlasting joy upon their lips the happy pilgrims draw ever nearer to God, obtaining joy and gladness in all the march, until at last ‘sorrow and sighing shall flee away.’ But instead of this he had made for himself a crooked path, and had lost his road and his peace in the mazes of wandering ways. ‘The labour of the foolish wearieth every one of them, because he knoweth not how to come to the city.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Another very solemn and terrible thought of what sin is, lies in that final word for it, which means ‘missing an aim.’ How strikingly that puts a truth which siren voices are constantly trying to sing us out of believing! Every sin is a blunder as well as a crime. And that for two reasons, because, first, God has made us for Himself, and to take anything besides for our life’s end or our heart’s portion is to divert ourselves from our true destiny; and because, second, that being so, every attempt to win satisfaction or delight by such a course is and must be a failure. Sin misses the aim if we think of our proper destination. Sin misses its own aim of happiness. A man never gets what he hoped for by doing wrong, or, if he seem to do so, he gets something more that spoils it all. He pursues after the fleeing form that seems so fair, and when he reaches her side, and lifts her veil, eager to embrace the tempter, a hideous skeleton grins and gibbers at him. The siren voices sing to you from the smiling island, and their white arms and golden harps and the flowery grass draw you from the wet boat and the weary oar; but when a man lands he sees the fair form end in a slimy fish, and she slays him and gnaws his bones. ‘He knows not that the dead are there, and that her guests are in the depths of hell.’ Yes! every sin is a mistake, and the epitaph for the sinner is ‘Thou fool!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. These petitions also show us, in the second place, How David thinks of forgiveness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. These petitions also show us, in the second place, How David thinks of forgiveness.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As the words for sin expressed a threefold view of the burden from which the Psalmist seeks deliverance, so the triple prayer, in like manner, sets forth that blessing under three aspects. It is not merely pardon for which he asks. He is making no sharp dogmatic distinction between forgiveness and cleansing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The two things run into each other in his prayer, as they do, thank God! in our own experience, the one being inseparable, in fact, from the other. It is absolute deliverance from the power of sin, in all forms of that power, whether as guilt or as habit, for which he cries so piteously; and his accumulative petitions are so exhaustive, not because he is coldly examining his sin, but because he is intensely feeling the manifold burden of his great evil.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That first petition conceives of the divine dealing with sin as being the erasure of a writing, perhaps of an indictment. There is a special significance in the use of the word here, because it is also employed in the description of the Levitical ceremonial of the ordeal, where a curse was written on a scroll and blotted out by the priest. But apart from that the metaphor is a natural and suggestive one. Our sin stands written against us. The long gloomy indictment has been penned by our own hands. Our past is a blurred manuscript, full of false things and bad things. We have to spread the writing before God, and ask Him to remove the stained characters from its surface, that once was fair and unsoiled.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah, brethren! some people tell us that the past is irrevocable, that the thing once done can never be undone, that the life’s diary written by our own hands can never be cancelled. The melancholy theory of some thinkers and teachers is summed up in the words, infinitely sad and despairing when so used, ‘What I have written I have written.’ Thank God! we know better than that. We know who blots out the handwriting ‘that is against us, nailing it to His Cross.’ We know that of God’s great mercy our future may ‘copy fair our past,’ and the past may be all obliterated and removed. And as sometimes you will find in an old monkish library the fair vellum that once bore lascivious stories of ancient heathens and pagan deities turned into the manuscript in which a saint has penned his Contemplations, an Augustine his Confessions, or a Jerome his Translations, so our souls may become palimpsests. The old wicked heathen characters that we have traced there may be blotted out, and covered over by the writing of that divine Spirit who has said, ‘I will put My laws into their minds, and write them in their hearts.’ As you run your pen through the finished pages of your last year’s diaries, as you seal them up and pack them away, and begin a new page in a clean book on the first of January, so it is possible for every one of us to do with our lives. Notwithstanding all the influence of habit, notwithstanding all the obstinacy of long-indulged modes of thought and action, notwithstanding all the depressing effect of frequent attempts and frequent failures, we may break ourselves off from all that is sinful in our past lives, and begin afresh, saying, ‘God helping me! I will write another sort of biography for myself for the days that are to come.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We cannot erase these sad records from our past. The ink is indelible; and besides all that we have visibly written in these terrible autobiographies of ours, there is much that has sunk into the page, there is many a ‘secret fault,’ the record of which will need the fire of that last day to make it legible, Alas for those who learn the black story of their own lives for the first time then! Learn it now, my brother! and learn likewise that Christ can wipe it all clean off the page, clean out of your nature, clean out of God’s book. Cry to Him, with the Psalmist, ‘Blot out my transgressions!’ and He will calm and bless you with the ancient answer, ‘I have blotted out as a thick cloud thy transgressions, and as a cloud thy sins.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then there is another idea in the second of these prayers for forgiveness: ‘Wash me throughly from mine iniquity.’ That phrase does not need any explanation, except that the word expresses the antique way of cleansing garments by treading and beating. David, then, here uses the familiar symbol of a robe, to express the ‘habit’ of the soul, or, as we say, the character. That robe is all splashed and stained. He cries to God to make it a robe of righteousness and a garment of purity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And mark that he thinks the method by which this will be accomplished is a protracted and probably a painful one. He is not praying for a mere declaration of pardon, he is not asking only for the one complete, instantaneous act of forgiveness, but he is asking for a process of purifying which will be long and hard. ‘I am ready,’ says he, in effect, ‘to submit to any sort of discipline, if only I may be clean. Wash me, beat me, tread me down, hammer me with mallets, dash me against stones, rub me with smarting soap and caustic nitre-do anything, anything with me, if only those foul spots melt away from the texture of my soul!’ A solemn prayer, my brethren! if we pray it aright, which will be answered by many a sharp application of God’s Spirit, by many a sorrow, by much very painful work, both within our own souls and in our outward lives, but which will be fulfilled at last in our being clothed like our Lord, in garments which shine as the light.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We know, dear brethren! who has said, ‘I counsel thee to buy of Me white raiment, that the shame of thy nakedness may not appear.’ And we know well who were the great company before the throne of God, that had ‘washed their robes and made them white in the blood of the Lamb.’ ‘Though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool.’ ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wash me throughly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from mine iniquity.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The deliverance from sin is still further expressed by that third supplication, ‘Cleanse me from my sin.’ That is the technical word for the priestly act of declaring ceremonial cleanness-the cessation of ceremonial pollution, and for the other priestly act of making, as well as declaring, clean from the stains of leprosy. And with allusion to both of these uses, the Psalmist employs it here. That is to say, he thinks of his guilt not only as a blotted past record which he has written, not only as a garment spotted by the flesh which his spirit wears, but he thinks of it too as inhering in himself, as a leprosy and disease of his own personal nature. He thinks of it as being, like that, incurable, fatal, twin sister to and precursor of death; and he thinks of it as capable of being cleansed only by a sacerdotal act, only by the great High Priest and by His finger being laid upon it. And we know who it was that-when the leper, whom no man in Israel was allowed to touch on pain of uncleanness, came to His feet-put out His hand in triumphant consciousness of power, and touched him, and said, ‘I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "! be thou clean.’ Let this be thy prayer, ‘Cleanse me from my sin’; and Christ will answer, ‘Thy leprosy hath departed from thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. These petitions likewise show us whence the Psalmist draws his confidence for such a prayer. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. These petitions likewise show us whence the Psalmist draws his confidence for such a prayer.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘According to the multitude of Thy tender mercies, blot out my transgressions.’ His whole hope rests upon God’s own character, as revealed in the endless continuance of His acts of love. He knows the number and the greatness of his sins, and the very depth of his consciousness of sin helps him to a corresponding greatness in his apprehension of God’s mercy. As he says in another of his psalms, ‘Innumerable evils have compassed me about; they are more than the hairs of my head. . . . Many, O Lord my God! are Thy wonderful works. . . . They are more than can be numbered.’ This is the blessedness of all true penitence, that the more profoundly it feels its own sore need and great sinfulness, in that very proportion does it recognise the yet greater mercy and all-sufficient grace of our loving God, and from the lowest depths beholds the stars in the sky, which they who dwell amid the surface-brightness of the noonday cannot discern.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God’s own revealed character, His faithfulness and persistency, notwithstanding all our sins, in that mode of dealing with men which has blessed all generations with His tender mercies-these were David’s pleas. And for us who have the perfect love of God perfectly expressed in His Son, that same plea is incalculably strengthened, for we can say, ‘According to Thy tender mercy in Thy dear Son, for the sake of Christ, blot out my transgressions.’ Is the depth of our desire, and is the firmness of our confidence, proportioned to the increased clearness of our knowledge of the love of our God? Does the Cross of Christ lead us to as trustful a penitence as David had, to whom meditation on God’s providences and the shadows of the ancient covenant were chiefest teachers of the multitude of His tender mercies?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Remember further that a comparison of the narrative in the historical books seems to show, as I said, that this psalm followed Nathan’s declaration of the divine forgiveness, and that therefore these petitions of our text are the echo and response to that declaration.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus we see that the revelation of God’s love precedes, and is the cause of, the truest penitence; that our prayer for forgiveness is properly the appropriating, or the effort to appropriate, the divine promise of forgiveness; and that the assurance of pardon, so far from making a man think lightly of his sin, is the thing that drives it home to his conscience, and first of all teaches him what it really is. As long as you are tortured with thoughts of a possible hell because of guilt, as long as you are troubled by the contemplation of consequences affecting your happiness as ensuing upon your wrongdoing, so long there is a foreign and disturbing element in even your deepest and truest penitence. But when you know that God has forgiven-when you come to see the ‘multitude of Thy tender mercies,’ when the fear of punishment has passed out of your apprehension, then you are left with a heart at leisure from dread, to look the fact and not the consequences in the face, and to think of the moral nature, and not of the personal results, of your sin. And so one of the old prophets, with profound truth, says, ‘Thou shalt be ashamed and confounded, and never open thy mouth any more because of thy sin, when I am pacified towards thee for all thou hast done.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear friends! the wheels of God’s great mill may grind us small, without our coming to know or to hate our sin. About His chastisements, about the revelation of His wrath, that old saying is true to a great extent: ‘If you bray a fool in a mortar, his folly will not depart from him.’ You may smite a man down, crush him, make his bones to creep with the preaching of vengeance and of hell, and the result of it will often be, if it be anything at all, what it was in the case of that poor wretched Judas, who, because he only saw wrath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flung",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " himself into despair, and was lost, not because he had betrayed Christ, but because he believed that there was no forgiveness for the man that had betrayed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But Love comes, and ‘Love is Lord of all.’ God’s assurance, ‘I have forgiven,’ the assurance that we do not need to plead with Him, to bribe Him, to buy pardon by tears and amendment, but that it is already provided for us-the blessed vision of an all-mighty love treasured in a dying Saviour, the proclamation ‘God was in Christ, reconciling the world unto Himself, not imputing their trespasses unto them’-Oh! these are the powers that break, or rather that melt, our hearts; these are the keen weapons that wound to heal our hearts; these are the teachers that teach a ‘godly sorrow that needeth not to be repented of.’ Think of all the patient, pitying mercy of our Father, with which He has lingered about our lives, and softly knocked at the door of our hearts! Think of that unspeakable gift in which are wrapped up all His tender mercies-the gift of Christ who died for us all! Let it smite upon your heart with a rebuke mightier than all the thunders of law or terrors of judgment. Let it unveil for you not only the depths of the love of God, but the darkness of your own selfish rebellion from Him. Measure your crooked lives by the perfect rightness of Christ’s. Learn how you have missed the aim which He reached, who could say, ‘I delight to do Thy will, O my God!’ And let that same infinite love that teaches sin announce frank forgiveness and prophesy perfect purity. Then, with heart fixed upon Christ’s Cross, let your cry for pardon be the echo of the most sure promise of pardon which sounds from His dying lips; and as you gaze on Him who died that we might be freed from all iniquity, ask Him to blot out your transgressions, to wash you throughly from your iniquity, and to cleanse you from your sins. Ask, for you cannot ask in vain; ask earnestly, for you need it sorely; ask confidently, for He has promised before you ask; but ask, for unless you do, you will not receive. Ask, and the answer is sent already-’The blood of Jesus Christ cleanseth from all sin.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 51:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Have mercy upon me, O God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "O thou, who art the supreme Lawgiver, Governor, and Judge of the world, whom I have most highly offended many ways, and, therefore, may most justly be condemned to suffer the effects of thy severest displeasure; I cast myself down before thee, and humbly supplicate for mercy. O pity, help, and answer me in the desires I am now about to spread before thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "according to thy loving- kindness — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thy known clemency and infinite compassions. For I pretend to no merit: I know my desert is everlasting destruction of body and soul; but I humbly implore the interposition of thy free grace and unmerited goodness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "According to the multitude of thy tender mercies — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "רחמיךְ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rachameicha, thy bowels of mercies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "yearning over thy fallen, sinful, and miserable creatures. Thy mercies are infinite, and, therefore, sufficient for my relief: and such mercies, indeed, do I now need. “How reviving,” says Chandler, “is the belief and consideration of these abundant and tender compassions of God, to one in David’s circumstances; whose mind laboured under the burden of the most heinous, complicated guilt, and the fear of the divine displeasure and vengeance!” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blot out — ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מחה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mechee, deleto, absterge, destroy, wipe away, my transgressions — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, entirely and absolutely forgive them; so that no part of the guilt I have contracted may remain, and the punishment of it may be wholly remitted. The word properly signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to wipe out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or to wipe any thing absolutely clean, as a person wipes a dish: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 21:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blot out my transgressions — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As a debt is blotted or crossed out of the book, when either the debtor has paid it, or the creditor has remitted it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wipe them out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — That they may not appear to demand judgment against me, nor stare me in the face to my confusion and terror. Give me peace with thee, by turning away thine anger from me, and taking me again into thy favour; and give me peace in my own conscience, by assuring me thou hast done so.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "51:1-6 David, being convinced of his sin, poured out his soul to God in prayer for mercy and grace. Whither should backsliding children return, but to the Lord their God, who alone can heal them? he drew up, by Divine teaching, an account of the workings of his heart toward God. Those that truly repent of their sins, will not be ashamed to own their repentance. Also, he instructs others what to do, and what to say. David had not only done much, but suffered much in the cause of God; yet he flees to God's infinite mercy, and depends upon that alone for pardon and peace. He begs the pardon of sin. The blood of Christ, sprinkled upon the conscience, blots out the transgression, and, having reconciled us to God, reconciles us to ourselves. The believer longs to have the whole debt of his sins blotted out, and every stain cleansed; he would be thoroughly washed from all his sins; but the hypocrite always has some secret reserve, and would have some favorite lust spared. David had such a deep sense of his sin, that he was continually thinking of it, with sorrow and shame. His sin was committed against God, whose truth we deny by wilful sin; with him we deal deceitfully. And the truly penitent will ever trace back the streams of actual sin to the fountain of original depravity. He confesses his original corruption. This is that foolishness which is bound in the heart of a child, that proneness to evil, and that backwardness to good, which is the burden of the regenerate, and the ruin of the unregenerate. He is encouraged, in his repentance, to hope that God would graciously accept him. Thou desirest truth in the inward part; to this God looks, in a returning sinner. Where there is truth, God will give wisdom. Those who sincerely endeavour to do their duty shall be taught their duty; but they will expect good only from Divine grace overcoming their corrupt nature.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Have mercy opon me, O God - This is the utterance of a full heart; a heart crushed and broken by the consciousness of sin. The psalmist had been made to see his great guilt; and his first act is to cry out for mercy. There is no attempt to excuse his sin, or to apologise for it; there is no effort to vindicate his conduct; there is no complaint of the righteousness of that holy law which condemned him. It was \"guilt\" that was before his mind; guilt only; deep and dreadful guilt. The appeal properly expresses the state of a mind that is overwhelmed at the remembrance of crime, and that comes with earnestness to God to plead for pardon. The only hope of a sinner when crushed with the consciousness of sin is the mercy of God; and the plea for that mercy will be urged in the most earnest and impassioned language that the mind can employ. \"Accordingly to thy Iovingkindness.\" On the meaning of the word used here, see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The \"ground\" of his hope was the compassion of God:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) the \"measure\" of that hope was His boundless beneficence; or, in other words, he felt that there was need of \"all\" the compassion of a God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His sin was so great, his offence was so aggravated, that he could have no hope but in a Being of infinite compassion, and he felt that the need of mercy in his case could be measured and covered \"only\" by that infinite compassion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "According unto the multitude of thy tender mercies - The same idea occurs here also. The psalmist fixed his eye on the \"vastness\" of the divine mercy; on the numberless \"acts\" of that mercy toward the guilty; here he found his hope, and here alone. Every instance of extraordinary mercy which had occurred in the world furnished him now with an argument in his appeal to God; was an encouragement to him \"in\" that appeal; was a ground of hope that his appeal would not be rejected. So to us: every instance in which a great sinner has been forgiven is evidence that we may be forgiven also, and is an encouragement to us to come to God for pardon. See the notes at 1 Timothy 1:16.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "According unto the multitude of thy tender mercies - The same idea occurs here also. The psalmist fixed his eye on the \"vastness\" of the divine mercy; on the numberless \"acts\" of that mercy toward the guilty; here he found his hope, and here alone. Every instance of extraordinary mercy which had occurred in the world furnished him now with an argument in his appeal to God; was an encouragement to him \"in\" that appeal; was a ground of hope that his appeal would not be rejected. So to us: every instance in which a great sinner has been forgiven is evidence that we may be forgiven also, and is an encouragement to us to come to God for pardon. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Blot out my transgressions - In allusion to an account that is kept, or a charge made, when such an account is wiped away, erased, or blotted out. Compare Exodus 32:32-33; see the notes at Isaiah 43:25; notes at Isaiah 44:22; notes at Colossians 2:14. Never was a more earnest appeal made by a sinner than that which is made in this verse; never was there a more sincere cry for mercy. It shows us where we should \"begin\" in our prayers when we are pressed down with the consciousness of sin - with a cry for \"mercy,\" and not an appeal to \"justice;\" it shows us what is to be the \"ground\" and the \"measure\" of our hope - the mere compassion of an infinitely benevolent God; it shows us the place which we must take, and the argument on which we must rely - a place among sinners, and an argument that God has been merciful to great sinners, and that therefore he may be merciful to us. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Blot out my transgressions - In allusion to an account that is kept, or a charge made, when such an account is wiped away, erased, or blotted out. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 32:32-33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Never was a more earnest appeal made by a sinner than that which is made in this verse; never was there a more sincere cry for mercy. It shows us where we should \"begin\" in our prayers when we are pressed down with the consciousness of sin - with a cry for \"mercy,\" and not an appeal to \"justice;\" it shows us what is to be the \"ground\" and the \"measure\" of our hope - the mere compassion of an infinitely benevolent God; it shows us the place which we must take, and the argument on which we must rely - a place among sinners, and an argument that God has been merciful to great sinners, and that therefore he may be merciful to us. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 51",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 51:1-19. On the occasion, compare 2Sa 11:12. The Psalm illustrates true repentance, in which are comprised conviction, confession, sorrow, prayer for mercy, and purposes of amendment, and it is accompanied by a lively faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-4. A plea for mercy is a confession of guilt.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "blot out—as from a register.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "transgressions—literally, \"rebellions\" (Ps 19:13; 32:1).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "transgressions—literally, \"rebellions\" (Ps 19:13; 32:1).",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Have mercy upon me, O God, according to thy lovingkindness: according unto the multitude of thy tender mercies blot out my transgressions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Wash me throughly from mine iniquity, and cleanse me from my sin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 For I acknowledge my transgressions: and my sin is ever before me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 Against thee, thee only, have I sinned, and done this evil in thy sight: that thou mightest be justified when thou speakest, and be clear when thou judgest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 Behold, I was shapen in iniquity; and in sin did my mother conceive me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 Behold, thou desirest truth in the inward parts: and in the hidden part thou shalt make me to know wisdom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 Purge me with hyssop, and I shall be clean: wash me, and I shall be whiter than snow.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8 Make me to hear joy and gladness, that the bones which thou hast broken may rejoice.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "9 Hide thy face from my sins, and blot out all mine iniquities.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 Create in me a clean heart, O God; and renew a right spirit within me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11 Cast me not away from thy presence; and take not thy holy spirit from me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "12 Restore unto me the joy of thy salvation; and uphold me with thy free spirit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 51:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Have mercy upon me, O God.\" He appeals at once to the mercy of God, even before he mentions his sin. The sight of mercy is good for eyes that are sore with penitential weeping. Pardon of sin must ever be an act of pure mercy, and therefore to that attribute the awakened sinner flies. \"According to thy lovingkindness.\" Act, O Lord, like thyself; give mercy like thy mercy. Show mercy such as is congruous with thy grace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...To the chief musician; to be sung by him and other sacred musicians publicly in the temple through all ages; that his repentance might be as manifest and public as his crime and scandal was. When Nathan the prophet came unto him: after his conscience was awakened by Nathan’s words, 2 Samuel 12, and Nathan was gone, David falls very seriously upon the practice of sincere repentance, and digested his meditations into this Psalm. David prayeth to God for the remission of his original and actual sins, Psalm 51:1,2, whereof he maketh a deep confession, Psalm 51:3-5; and for the renovation of his Holy Spirit, to support himself and instruct others, Psalm 51:6-14; promising him also unfeigned and sincere thankfulness, Psalm 51:15-17; with a prayer for the good of the whole church, Psalm 51:18,19. Have mercy upon me;  pity, and help, and answer me, in the desires I am now spreading before thee. According to thy loving-kindness: I pretend to no merit, but humbly implore thy free grace and mercy. Thy mercies are infinite, and therefore sufficient for my relief, and such indeed do I need. Blot out;  either, 1. Out of my conscience and soul, where it hath left a stain and filthy character. Or, 2. Out of thy book of remembrance and accounts, in which all men’s sins are written, and out of Which all men shall be judged hereafter, Revelation 20:12; which is spoken of God after the manner of men. See Poole \"Isaiah 43:25\"; See Poole \"Isaiah 44:22\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "To the chief musician",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to be sung by him and other sacred musicians publicly in the temple through all ages; that his repentance might be as manifest and public as his crime and scandal was. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "When Nathan the prophet came unto him",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": after his conscience was awakened by Nathan’s words, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2 Samuel 12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Nathan was gone, David falls very seriously upon the practice of sincere repentance, and digested his meditations into this Psalm. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David prayeth to God for the remission of his original and actual sins, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 51:1,2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", whereof he maketh a deep confession, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 51:3-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and for the renovation of his Holy Spirit, to support himself and instruct others, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 51:6-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; promising him also unfeigned and sincere thankfulness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 51:15-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; with a prayer for the good of the whole church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 51:18,19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Have mercy upon me; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " pity, and help, and answer me, in the desires I am now spreading before thee. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "According to thy loving-kindness:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I pretend to no merit, but humbly implore thy free grace and mercy. Thy mercies are infinite, and therefore sufficient for my relief, and such indeed do I need. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Blot out; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. Out of my conscience and soul, where it hath left a stain and filthy character. Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. Out of thy book of remembrance and accounts, in which all men’s sins are written, and out of Which all men shall be judged hereafter, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 20:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which is spoken of God after the manner of men. ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "See Poole \"Isaiah 43:25\"",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "See Poole \"Isaiah 44:22\"",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Have mercy upon me, O God,.... David, under a sense of sin, does not run away from God, but applies unto him, and casts himself at his feet, and upon his mercy; which shows the view he had of his miserable condition, and that he saw there was mercy in God, which gave him hope; and upon his bended knees, and in the exercise of faith, he asks for it; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "according to thy lovingkindness; not according to his merits, nor according to the general mercy of God, which carnal men rely upon; but according to his everlasting and unchangeable love in Christ; from which as the source, and through whom as the medium, special mercy comes to the children of men. The acts of special mercy are according to the sovereign will of God: he is not moved to mercy neither by the merits nor misery of men, but by his free grace and favour; it is love that sets mercy to work: this is a most glaring gleam of Gospel light, which none of the inspired writers besides, except the Apostle Paul, saw, Ephesians 2:4; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "according to thy lovingkindness; not according to his merits, nor according to the general mercy of God, which carnal men rely upon; but according to his everlasting and unchangeable love in Christ; from which as the source, and through whom as the medium, special mercy comes to the children of men. The acts of special mercy are according to the sovereign will of God: he is not moved to mercy neither by the merits nor misery of men, but by his free grace and favour; it is love that sets mercy to work: this is a most glaring gleam of Gospel light, which none of the inspired writers besides, except the Apostle Paul, saw, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "according unto the multitude of thy tender mercies blot out my transgressions; for his sin was complicated, attended with many others; and, besides, upon a view of this, he was led to observe all his other sins; and particularly the corruption of his nature, his original sin, which he mentions, Psalm 51:5. These he desires might be \"blotted out\"; out of the book of account, out of God's debt book; that they might not stand against him, being debts he was not able to pay or make satisfaction for; and out of the table of his own heart and conscience, where they were ever before him, and seemed to be engraven; that they might be caused to pass from him, and he might have no more conscience of them; or that they might be blotted out, as a cloud by the clear shining of the sun of righteousness, with the healing of pardoning grace in his wings; or that they might be wiped away, as any faith is wiped from any person or thing: and all this \"according to the multitude of his tender mercies\". The mercy of God is plenteous and abundant; he is rich in it, and various are the instances of it; and it is exceeding tender, like that of a father to his children, or like that of a mother to the son of her womb; and from this abundant and tender mercy springs the forgiveness of sin, Luke 1:77. The psalmist makes mention of the multitude of the mercies of God, because of the multitude of his sins, which required a multitude of mercy to forgive, and to encourage his hope of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "according unto the multitude of thy tender mercies blot out my transgressions; for his sin was complicated, attended with many others; and, besides, upon a view of this, he was led to observe all his other sins; and particularly the corruption of his nature, his original sin, which he mentions, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". These he desires might be \"blotted out\"; out of the book of account, out of God's debt book; that they might not stand against him, being debts he was not able to pay or make satisfaction for; and out of the table of his own heart and conscience, where they were ever before him, and seemed to be engraven; that they might be caused to pass from him, and he might have no more conscience of them; or that they might be blotted out, as a cloud by the clear shining of the sun of righteousness, with the healing of pardoning grace in his wings; or that they might be wiped away, as any faith is wiped from any person or thing: and all this \"according to the multitude of his tender mercies\". The mercy of God is plenteous and abundant; he is rich in it, and various are the instances of it; and it is exceeding tender, like that of a father to his children, or like that of a mother to the son of her womb; and from this abundant and tender mercy springs the forgiveness of sin, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:77",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The psalmist makes mention of the multitude of the mercies of God, because of the multitude of his sins, which required a multitude of mercy to forgive, and to encourage his hope of it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<{a}",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "to",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " came unto him, after he had gone in to Bathsheba.>> Have mercy upon me, O God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cverse3",
        "text": "{b}",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " according to thy lovingkindness: according unto the multitude of thy tender mercies blot out my transgressions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) To reprove him, because he had committed horrible sins, and lain in the same without repentance more then a whole year.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) As his sins were many and great, so he requires that God would give him the feeling of his excellent and abundant mercies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Have mercy upon me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, Be gracious unto me, as the word is rendered in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It suggests the free bestowal of favour rather than the exercise of forgiving clemency, and is connected with the word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gracious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 57:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy lovingkindness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The origin and the bond of the covenant between Jehovah and Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "according unto the multitude of thy tender mercies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, according to the abundance of thy compassions. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The prayer for pardon is thus based upon God’s revelation of His character as “a God full of compassion and gracious, abundant in lovingkindness and truth; keeping lovingkindness for thousands, forgiving iniquity and transgression and sin, and that will by no means clear the guilty” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ");—a passage which seems to have supplied the Psalmist’s language. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Sin is described, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in three different aspects, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "transgression, iniquity, sin:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Heb. words thus rendered meaning respectively, (1) defection from God or rebellion against Him: (2) the perversion of right, depravity of conduct: (3) error, wandering from the right way, missing the mark in life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The removal of guilt is also triply described. (1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blot out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 51:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "): sin is regarded as a debt recorded in God’s book which needs to be erased and cancelled (cp. the use of the word in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): or the word may be used more generally (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wipe out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of cleansing away defilement so that no trace of it remains (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 21:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cp. the promise in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wash me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the word means properly to wash clothes, as a fuller does (LXX correctly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πλῦνον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is frequently used of ceremonial purifications (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.): here it denotes that inward cleansing of which external washings were the type. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He prays, ‘wash me ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thoroughly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abundantly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for “the depth of his guilt demands an unwonted and special grace.” But if transgressions abound (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so does mercy. (3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cleanse me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be clean",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 51:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); like ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wash",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a common term in the Levitical ritual, especially in the laws concerning leprosy, meaning sometimes ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to cleanse",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", sometimes ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to pronounce clean",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This use of it suggests the comparison of sin with leprosy. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 5:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Prayer for forgiveness and cleansing: its ground, God’s grace; its condition, man’s repentance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Have mercy upon me, O God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to thy loving-kindness. It is observable that the whole psalm is addressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and not to Jehovah (the \"Lord\" in ver. 15 is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Adonai",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though the psalmist felt himself unworthy to utter the covenant-name, and simply prostrated himself as a guilty man before his offended Maker. It is not correet to say that \"loving-kindness implies a covenant\" (Cheyne), since God is \"good to all, and his tender mercies are over all his works\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 145:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "According unto the multitude of thy tender mercies blot out my transgressions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". David's first prayer is for pity; his second, to have his offences \"blotted out,\" or \"wiped out\" - entirely removed from God's book (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He says \"my transgressions,\" in the plural, because \"his great sin did not stand alone - adultery was followed by treachery and murder\" (Canon Cook). Psalm 51:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Prayer for the remission of sin. Concerning the interchangeable names for sin, vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Although the primary occasion of the Psalm is the sin of adultery, still David says פּשׁעי, not merely because many other sins were developed out of it, as his guilt of blood in the case of Uriah, the scandal put into the mouths of the enemies of Jahve, and his self-delusion, which lasted almost a whole year; but also because each solitary sin, the more it is perceived in its fundamental character and, as it were, microscopically discerned, all the more does it appear as a manifold and entangled skein of sins, and stands forth in a still more intimate and terrible relation, as of cause and effect, to the whole corrupt and degenerated condition in which the sinner finds himself. In מחה sins are conceived of as a cumulative debt (according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", like a thick, dark cloud) written down (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") against the time of the payment by punishment. In כּבּסני (from כּבּס, πλύνειν, to wash by rubbing and kneading up, distinguished from רחץ, λούειν, to wash by rinsing) iniquity is conceived of as deeply ingrained dirt. In טהרני, the usual word for a declarative and de facto making clean, sin is conceived of as a leprosy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". the Kerמ runs הרב כּבּסני (imperat. Hiph., like הרף, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"make great or much, wash me,\" i.e., (according to Ges. ֗142, 3, b) wash me altogether, penitus et totum, which is the same as is expressed by the Chethמb הרבּה (prop. multum faciendo  equals  multum, prorsus, Ges. ֗131, 2). In כּרב (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and הרב is expressed the depth of the consciousness of sin; profunda enim malitia, as Martin Geier observes, insolitam raramque gratiam postulat. ",
        "children": []
      }
    ]
  }
]