[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold, I was shapen . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, I was born in iniquity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The later rabbis, combining this verse with the mystery hanging over the origin and name of David’s mother, represent him as born in adultery. (See Stanley, Jewish Church, chap. ii., p. 46, Note.) The word rendered conceived is certainly one generally used of animal desire. (The marginal warm me is erroneous.) But the verse is only a statement of the truth of experience so constantly affirmed in Scripture of hereditary corruption and the innate proneness to sin in every child of man. The argument for a personal origin to the psalm from this verse seems strong; but in Psalm 129:1, and frequently, the community is personified as an individual growing from youth to age, and so may here speak of its far-back idolatrous ancestry as the mother who conceived it in sin.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The later rabbis, combining this verse with the mystery hanging over the origin and name of David’s mother, represent him as born in adultery. (See Stanley, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Jewish Church, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "chap. ii., p. 46, Note.) The word rendered ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "conceived ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is certainly one generally used of animal desire. (The marginal ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "warm me ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is erroneous.) But the verse is only a statement of the truth of experience so constantly affirmed in Scripture of hereditary corruption and the innate proneness to sin in every child of man. The argument for a personal origin to the psalm from this verse seems strong; but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 129:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and frequently, the community is personified as an individual growing from youth to age, and so may here speak of its far-back idolatrous ancestry as the mother who conceived it in sin.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 51:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, I was shapen in iniquity — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "חוללתי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cholaleti, I was born, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "brought forth: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for it does not appear that the word ever signifies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I was shapen; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and then the ensuing words will contain the reason of it; the sense being, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because in sin did my mother conceive me, therefore I was brought forth in iniquity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, with great propensities and dispositions to sin. This verse is, both by Jewish and Christian, by ancient and later interpreters generally, and most justly, understood of what we call ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "original sin; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which David here mentions, not as an excuse for, but as an aggravation of, his transgression, inasmuch as the knowledge which he had of the total corruption of his nature, and its tendency to evil, ought to have made him more on his guard, and to have watched more carefully over his sensual passions and affections. And the sense of the place is this: Nor is this the only sin which I have reason to acknowledge and bewail before thee; for this filthy stream leads me to a corrupt fountain. And, upon a serious review of my heart and life, I find that I am guilty of innumerable other sins; and that this heinous crime, though drawn forth by external temptations, yet was indeed the proper fruit of my own vile nature, which, without the restraints of thy providence or grace, ever was and still will be inclinable and ready to commit ten thousand sins as occasion offers. Thus, as Dr. Dodd, after Chandler, justly observes, “The psalmist owns himself to be the corrupted, degenerate offspring, of corrupted, degenerate parents, agreeable to what was said long before he was born, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who can bring a clean thing out of an unclean? Not one, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nor is it unusual with good men, when confessing their own sins before God, to make mention of the sins of their parents, for their greater mortification and humiliation.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "51:1-6 David, being convinced of his sin, poured out his soul to God in prayer for mercy and grace. Whither should backsliding children return, but to the Lord their God, who alone can heal them? he drew up, by Divine teaching, an account of the workings of his heart toward God. Those that truly repent of their sins, will not be ashamed to own their repentance. Also, he instructs others what to do, and what to say. David had not only done much, but suffered much in the cause of God; yet he flees to God's infinite mercy, and depends upon that alone for pardon and peace. He begs the pardon of sin. The blood of Christ, sprinkled upon the conscience, blots out the transgression, and, having reconciled us to God, reconciles us to ourselves. The believer longs to have the whole debt of his sins blotted out, and every stain cleansed; he would be thoroughly washed from all his sins; but the hypocrite always has some secret reserve, and would have some favorite lust spared. David had such a deep sense of his sin, that he was continually thinking of it, with sorrow and shame. His sin was committed against God, whose truth we deny by wilful sin; with him we deal deceitfully. And the truly penitent will ever trace back the streams of actual sin to the fountain of original depravity. He confesses his original corruption. This is that foolishness which is bound in the heart of a child, that proneness to evil, and that backwardness to good, which is the burden of the regenerate, and the ruin of the unregenerate. He is encouraged, in his repentance, to hope that God would graciously accept him. Thou desirest truth in the inward part; to this God looks, in a returning sinner. Where there is truth, God will give wisdom. Those who sincerely endeavour to do their duty shall be taught their duty; but they will expect good only from Divine grace overcoming their corrupt nature.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Behold, I was shapen in iniquity - The object of this important verse is to express the deep sense which David had of his depravity. That sense was derived from the fact that this was not a sudden thought, or a mere outward act, or an offence committed under the influence of strong temptation, but that it was the result of an entire corruption of his nature - of a deep depravity of heart, running back to the very commencement of his being. The idea is, that he could not have committed this offence unless he had been thoroughly corrupt, and always corrupt. The sin was as heinous and aggravated \"as if\" in his very conception and birth there had been nothing but depravity. He looked at his, sin, and he looked back to his own origin, and he inferred that the one demonstrated that in the other there was no good thing, no tendency to goodness, no germ of goodness, but that there was evil, and only evil; as when one looks at a tree, and sees that it bears sour or poisonous fruit, he infers that it is in the very nature of the tree, and that there is nothing else in the tree, from its origin, but a tendency to produce just such fruit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of course, the idea here is not to cast reflections on the character of his mother, or to refer to her feelings in regard to his conception and birth, but the design is to express his deep sense of his own depravity; a depravity so deep as to demonstrate that it must have had its origin in the very beginning of his existence. The word rendered \"I was shapen\" - חוללתי  chôlaletiy - is from a word - חול  chûl - which means properly, \"to turn around, to twist, to whirl;\" and then it comes to mean \"to twist oneself with pain, to writhe;\" and then it is used especially with reference to the pains of childbirth. Isaiah 13:8; Isaiah 23:4; Isaiah 26:18; Isaiah 66:7-8; Micah 4:10. That is the meaning here. The idea is simply that he was \"born\" in iniquity; or that he was a sinner when he was born; or that his sin could be traced back to his very birth - as one might say that he was born with a love of music, or with a love of nature, or with a sanguine, a phlegmatic, or a melancholy temperament.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of course, the idea here is not to cast reflections on the character of his mother, or to refer to her feelings in regard to his conception and birth, but the design is to express his deep sense of his own depravity; a depravity so deep as to demonstrate that it must have had its origin in the very beginning of his existence. The word rendered \"I was shapen\" - חוללתי  chôlaletiy - is from a word - חול  chûl - which means properly, \"to turn around, to twist, to whirl;\" and then it comes to mean \"to twist oneself with pain, to writhe;\" and then it is used especially with reference to the pains of childbirth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 66:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That is the meaning here. The idea is simply that he was \"born\" in iniquity; or that he was a sinner when he was born; or that his sin could be traced back to his very birth - as one might say that he was born with a love of music, or with a love of nature, or with a sanguine, a phlegmatic, or a melancholy temperament.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There is not in the Hebrew word any idea corresponding to the word \"\"shapen,\"\" as if he had been \"formed\" or \"moulded\" in that manner by divine power; but the entire meaning of the word is exhausted by saying that his sin could be traced back to his \"very birth;\" that it was so deep and aggravated, that it could be accounted for - or that he could express his sense of it - in no other way, than by saying that he was \"born a sinner.\" How that occurred, or how it was connected with the first apostasy in Adam, or how the fact that he was thus born could be vindicated, is not intimated, nor is it alluded to. There is no statement that the sin of another was \"imputed\" to him; or that he was \"responsible\" for the sin of Adam; or that he was guilty \"on account of\" Adam's sin, for on these points the psalmist makes no assertion. It is worthy of remark, further, that the psalmist did not endeavor to \"excuse\" his guilt on the ground that he was \"\"born\"\" in iniquity; nor did he allude to that fact with any purpose of \"exculpating\" himself. The fact that he was thus born only deepened his sense of his own guilt, or showed the enormity of the offence which was the regular result or outbreak of that carly depravity. The points, therefore, which are established by this expression of the psalmist, so far as the language is designed to illustrate how human nature is conceived, are",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) that people are born with a propensity to sin; and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) that this fact does not excuse us in sin, but rather tends to aggravate and deepen our guilt.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The language goes no further than this in regard to the question of original sin or native depravity. The Septuagint agrees with this interpretation - ἰδού γὰρ ἐν ανομίαις συνελήφθην  idou gar en anomias sunelēfthēn. So the Vulgate: in iniquitatibus conceptus sum.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And in sin did my mother conceive me - Margin, as in Hebrew, \"warm me.\" This language simply traces his sin back to the time when he began to exist. The previous expression traced it to \"his birth;\" this expression goes back to the very beginning of \"life;\" when there were the first indications of life. The idea is, \"as soon as I began to exist I was a sinner; or, I had then a propensity to sin - a propensity, the sad proof and result of which is that enormous act of guilt which I have committed.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And in sin did my mother conceive me - Margin, as in Hebrew, \"warm me.\" This language simply traces his sin back to the time when he began to exist. The previous expression traced it to \"his birth;\" this expression goes back to the very beginning of \"life;\" when there were the first indications of life. The idea is, \"as soon as I began to exist I was a sinner; or, I had then a propensity to sin - a propensity, the sad proof and result of which is that enormous act of guilt which I have committed.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. His guilt was aggravated by his essential, native sinfulness, which is as contrary to God's requisitions of inward purity as are outward sins to those for right conduct.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This verse is both by Jewish and Christian, by ancient and later, interpreters, generally and most truly understood of original sin; which he here mentions as an aggravation of his crime: and the sense of the place is this, Nor is this the only sin which I have reason to acknowledge and bewail before thee; for this filthy stream leads me to a corrupt fountain; and upon a serious review of my heart and life I find that I am guilty of innumerable other sins, and that this heinous crime, though drawn forth by external temptations, yet was indeed the proper fruit of my own filthy and vile nature, which, without the restraints of thy providence or grace, ever was, and still is like to be, inclinable and ready to commit these and ten thousand other sins, as occasion offers itself; for which contrariety of my very nature to thine, thou mayst justly loathe and condemn me; and for which I humbly beg thy pardon and grace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Conceive me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "warm or cherish me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the womb, before I was ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shapen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "formed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Behold, I was shapen in iniquity,.... This cannot be understood of any personal iniquity of his immediate parents; since this respects his wonderful formation in the womb, in which both he and they were wholly passive, as the word here used is of that form; and is the amazing work of God himself, so much admired by the psalmist, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and cannot design any sinfulness then infused into him by his Maker, seeing God cannot be the author of sin; but of original sin and corruption, derived to him by natural generation: and the sense is, that as soon as ever the mass of human nature was shaped and quickened, or as soon as soul and body were united together, sin was in him, and he was in sin, or became a sinful creature; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in sin did my mother conceive me; by whom cannot be meant Eve; for though she is the mother of all living, and so of David, yet could not, with any propriety, be said to conceive him: this only could be said of his immediate parent, not even of his next grandmother, much less of Eve, at the distance of almost three thousand years. Nor does the sin in which he was conceived intend any sin of his parents, in begetting and conceiving him, being in lawful wedlock; which acts cannot be sinful, since the propagation of the human species by natural generation is a principle of nature implanted by God himself; and is agreeably to the first law of nature, given to man in a state of innocence, \"increase and multiply\", Genesis 1:28. Marriage is the institution of God in paradise; and in all ages has been accounted \"honourable in all, when the bed is undefiled\", Hebrews 13:4. Nor does it design his being conceived when his mother was in \"profluviis\", of which there is no proof, and is a mere imagination, and can answer no purpose; much less that he was conceived in adultery, as the contenders for the purity of human nature broadly intimate; which shows how much they are convicted by this text, to give into such an interpretation of it, at the expense of the character of an innocent person, of whom there is not the least suggestion of this kind in the Holy Scriptures; but on the contrary, she is represented as a religious woman, and David valued himself upon his relation to her as such, Psalm 86:16. Besides, had this been the case, as David would have been a bastard, he would not have been suffered to enter into the congregation of the Lord, according to the law in Deuteronomy 23:2; whereas he often did with great delight, Psalm 42:4. Moreover, it is beside his scope and design to expose the sins of others, much less his own parents, while he is confessing and lamenting his own iniquities: and to what purpose should he mention theirs, especially if he himself was not affected by them, and did not derive a corrupt nature from them? Nor is the sin he speaks of any actual sin of his own, and therefore he does not call it, as before, \"my\" iniquity and \"my\" sin; though it was so, he having sinned in Adam, and this being in his nature; but \"iniquity\" and \"sin\", it being common to him with all mankind. Hence we learn the earliness of the corruption of nature; it is as soon as man is conceived and shapen; and that it is propagated from one to another by natural generation; and that it is the case of all men: for if this was the case of David, who was born of religious parents, was famous for his early piety, and from whose seed the Messiah sprung, it may well be concluded to be the case of all. And this corruption of nature is the fountain, source, and spring of all sin, secret and open, private and public; and is mentioned here not as an extenuation of David's actual transgressions, but as an aggravation of them; he having been, from his conception and formation, nothing else but a mass of sin, a lump of iniquity; and, in his evangelical repentance for them, he is led to take notice of and mourn over the corruption of his nature, from whence they arose. The Heathens themselves affirm, that no man is born without sin (c). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and in sin did my mother conceive me; by whom cannot be meant Eve; for though she is the mother of all living, and so of David, yet could not, with any propriety, be said to conceive him: this only could be said of his immediate parent, not even of his next grandmother, much less of Eve, at the distance of almost three thousand years. Nor does the sin in which he was conceived intend any sin of his parents, in begetting and conceiving him, being in lawful wedlock; which acts cannot be sinful, since the propagation of the human species by natural generation is a principle of nature implanted by God himself; and is agreeably to the first law of nature, given to man in a state of innocence, \"increase and multiply\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Marriage is the institution of God in paradise; and in all ages has been accounted \"honourable in all, when the bed is undefiled\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Nor does it design his being conceived when his mother was in \"profluviis\", of which there is no proof, and is a mere imagination, and can answer no purpose; much less that he was conceived in adultery, as the contenders for the purity of human nature broadly intimate; which shows how much they are convicted by this text, to give into such an interpretation of it, at the expense of the character of an innocent person, of whom there is not the least suggestion of this kind in the Holy Scriptures; but on the contrary, she is represented as a religious woman, and David valued himself upon his relation to her as such, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 86:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Besides, had this been the case, as David would have been a bastard, he would not have been suffered to enter into the congregation of the Lord, according to the law in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 23:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; whereas he often did with great delight, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Moreover, it is beside his scope and design to expose the sins of others, much less his own parents, while he is confessing and lamenting his own iniquities: and to what purpose should he mention theirs, especially if he himself was not affected by them, and did not derive a corrupt nature from them? Nor is the sin he speaks of any actual sin of his own, and therefore he does not call it, as before, \"my\" iniquity and \"my\" sin; though it was so, he having sinned in Adam, and this being in his nature; but \"iniquity\" and \"sin\", it being common to him with all mankind. Hence we learn the earliness of the corruption of nature; it is as soon as man is conceived and shapen; and that it is propagated from one to another by natural generation; and that it is the case of all men: for if this was the case of David, who was born of religious parents, was famous for his early piety, and from whose seed the Messiah sprung, it may well be concluded to be the case of all. And this corruption of nature is the fountain, source, and spring of all sin, secret and open, private and public; and is mentioned here not as an extenuation of David's actual transgressions, but as an aggravation of them; he having been, from his conception and formation, nothing else but a mass of sin, a lump of iniquity; and, in his evangelical repentance for them, he is led to take notice of and mourn over the corruption of his nature, from whence they arose. The Heathens themselves affirm, that no man is born without sin (c). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) \"Nam vitiis nemo sine nascitur\". Horat. Sermon. l. 1. Satyr. 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) \"Nam vitiis nemo sine nascitur\". Horat. Sermon. l. 1. Satyr. 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Behold, I was shapen in iniquity; and in sin did my mother conceive me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, I was shapen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, Behold, I was born. Acts of sin have their root in the inherited sinfulness of mankind. It does not appear, as some have thought, that the Psalmist pleads the sinifulness of his nature as an excuse for his actual sins. Rather, in utter self-abasement, he feels compelled to confess and bewail not only his actual sins, but the deep infection of his whole nature (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Moreover this verse forms the introduction to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 51:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 51:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which, as the repetition of ‘behold’ indicates (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f), stands in close connexion and correlation with it. He contrasts his natural perversity and liability to error with the inward truth and wisdom which God desires, and which, he is confident, God can communicate to the pardoned and regenerate soul.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "5–8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He has inherited a sinful nature; and yet, so he is confident, God can and will make it conform to His desire. The emphatic ‘Behold!’ marks the beginning of a new stanza.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 5-12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The prayer now makes a stride in advance. It has been hitherto for the first step in justification - the wiping out of past transgressions. It is now for restoration, for a renewal of spiritual life, for a return to God's favour, and to the spiritual joy involved in it. First, however, an additional confession is made (vers. 5, 6). Not only have I committed acts of sin (vers. 1-4), but sin is thoroughly ingrained into my nature. I was conceived in it; I was brought forth in it; only the strongest remedies can cleanse me from it (ver. 7). But cleansing alone is not enough. I need renewal (ver. 10); I need thy Holy Spirit (ver. 11); I crave, above all, the sense of a restoration to thy favour - a return to the old feelings of \"joy and gladness\" (ver. 8), even \"the joy of thy salvation\" (ver. 12). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Behold, I was shapen in iniquity;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in iniquity was I brought forth. And in sin did my",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in iniquity was I brought forth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And in sin did my",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "mother conceive me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is doubtless true, as Professor Cheyne says, that \"the Old Testament contains no theory of the origin of sin\" - no formulated doctrine on the subject. But the fact of congenital depravity is stated, not only here, but also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 58:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; it is also implied in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Psalm 51:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "David here confesses his hereditary sin as the root of his actual sin. The declaration moves backwards from his birth to conception, it consequently penetrates even to the most remote point of life's beginning. חוללתּי stands instead of נולדתּי, perhaps (although elsewhere, i.e., in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 90:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the idea of painfulness is kept entirely in the background) with reference to the decree, \"with pain shalt thou bring forth children,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Kurtz); instead of הרתה אתי, with still more definite reference to that which precedes conception, the expression is יחמתני (for יחמתני, following the same interchange of vowel as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The choice of the verb decides the question whether by עון and חטא is meant the guilt and sin of the child or of the parents. יחם (to burn with desire) has reference to that, in coition, which partakes of the animal, and may well awaken modest sensibilities in man, without עיון and חטא on that account characterizing birth and conception itself as sin; the meaning is merely, that his parents were sinful human begins, and that this sinful state (habitus) has operated upon his birth and even his conception, and from this point has passed over to him. What is thereby expressed is not so much any self-exculpation, as on the contrary a self-accusation which glances back to the ultimate ground of natural corruption. He is sinful מלּדה וּמהריון (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 58:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is טמא מטּמא, an unclean one springing from an unclean (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), flesh born of flesh. That man from his first beginning onwards, and that this beginning itself, is stained with sin; that the proneness to sin with its guilt and its corruption is propagated from parents to their children; and that consequently in the single actual sin the sin-pervaded nature of man, inasmuch as he allows himself to be determined by it and himself resolves in accordance with it, become outwardly manifest-therefore the fact of hereditary sin is here more distinctly expressed than in any other passage in the Old Testament, since the Old Testament conception, according to its special character, which always fastens upon the phenomenal, outward side rather than penetrates to the secret roots of a matter, is directed almost entirely to the outward manifestation only of sin, and leaves its natural foundation, its issue in relation to primeval history, and its demonic background undisclosed. The הן in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is followed by a correlative second הן in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Geier correctly says: Orat ut sibi in peccatis concepto veraque cordis probitate carenti penitiorem ac mysticam largiri velit sapientiam, cujus medio liberetur a peccati tum reatu tum dominio. אמת is the nature and life of man as conformed to the nature and will of God (cf. ἀλήθεια, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). חכמה, wisdom which is most intimately acquainted with (eindringlich weiss) such nature and life and the way to attain it. God delights in and desires truth בטּחות. The Beth of this word is not a radical letter here as it is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the preposition. The reins utpote adipe obducti, here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 38:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to the Targum, Jerome, and Parchon, are called טחות (Psychol. S. 269; tr. p. 317). Truth in the reins (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", God's law in visceribus meis) is an upright nature in man's deepest inward parts; and in fact, since the reins are accounted as the seat of the tenderest feelings, in man's inmost experience and perception, in his most secret life both of conscience and of mind (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the parallel member סתם denotes the hidden inward part of man. Out of the confession, that according to the will of God truth ought to dwell and rule in man even in his reins, comes the wish, that God would impart to him (i.e., teach him and make his own), - who, as being born and conceived in sin, is commended to God's mercy, - that wisdom in the hidden part of his mind which is the way to such truth. ",
        "children": []
      }
    ]
  }
]