[{"header":"The Second Census"},{"num":26,"verse":"After the epidemic the Lord said to Moses and Eleazar son of Aaron, "},{"num":2,"verse":"“Take a census by families of the whole community of Israel, of all men twenty years old or older who are fit for military service.” "},{"num":3,"verse":"Moses and Eleazar obeyed and called together all the men of that age group. They assembled in the plains of Moab across the Jordan River from Jericho."},{"num":5,"verse":"The tribe of Reuben (Reuben was the oldest son of Jacob): the clans of Hanoch, Pallu, "},{"num":6,"verse":"Hezron, and Carmi. "},{"num":7,"verse":"These clans numbered 43,730 men. "},{"num":8,"verse":"The descendants of Pallu were Eliab "},{"num":9,"verse":"and his sons Nemuel, Dathan, and Abiram. (These are the Dathan and Abiram who were chosen by the community. They defied Moses and Aaron and joined the followers of Korah when they rebelled against the Lord. "},{"num":10,"verse":"The ground opened and swallowed them, and they died with Korah and his followers when fire destroyed 250 men; they became a warning to the people. "},{"num":11,"verse":"But the sons of Korah were not killed.)"},{"num":12,"verse":"The tribe of Simeon: the clans of Nemuel, Jamin, Jachin, "},{"num":13,"verse":"Zerah, and Shaul. "},{"num":14,"verse":"These clans numbered 22,200 men."},{"num":15,"verse":"The tribe of Gad: the clans of Zephon, Haggi, Shuni, "},{"num":16,"verse":"Ozni, Eri, "},{"num":17,"verse":"Arod, and Areli. "},{"num":18,"verse":"These clans numbered 40,500 men."},{"num":19,"verse":"The tribe of Judah: the clans of Shelah, Perez, Zerah, Hezron, and Hamul. (Two of Judah's sons, Er and Onan, had died in the land of Canaan.) "},{"num":22,"verse":"These clans numbered 76,500 men."},{"num":23,"verse":"The tribe of Issachar: the clans of Tola, Puah, "},{"num":24,"verse":"Jashub, and Shimron. "},{"num":25,"verse":"These clans numbered 64,300 men."},{"num":26,"verse":"The tribe of Zebulun: the clans of Sered, Elon, and Jahleel. "},{"num":27,"verse":"These clans numbered 60,500 men."},{"num":28,"verse":"The tribes of Joseph, who was the father of two sons, Manasseh and Ephraim."},{"num":29,"verse":"The tribe of Manasseh. Machir son of Manasseh was the father of Gilead, and the following clans traced their ancestry to Gilead: "},{"num":30,"verse":"the clans of Iezer, Helek, "},{"num":31,"verse":"Asriel, Shechem, "},{"num":32,"verse":"Shemida, and Hepher. "},{"num":33,"verse":"Zelophehad son of Hepher had no sons, but only daughters; their names were Mahlah, Noah, Hoglah, Milcah, and Tirzah. "},{"num":34,"verse":"These clans numbered 52,700 men."},{"num":35,"verse":"The tribe of Ephraim: the clans of Shuthelah, Becher, and Tahan. "},{"num":36,"verse":"The clan of Eran traced its descent from Shuthelah. "},{"num":37,"verse":"These clans numbered 32,500 men."},{"num":38,"verse":"The tribe of Benjamin: the clans of Bela, Ashbel, Ahiram, "},{"num":39,"verse":"Shephupham, and Hupham. "},{"num":40,"verse":"The clans of Ard and Naaman traced their descent from Bela. "},{"num":41,"verse":"These clans numbered 45,600 men."},{"num":42,"verse":"The tribe of Dan: the clan of Shuham, "},{"num":43,"verse":"which numbered 64,400 men."},{"num":44,"verse":"The tribe of Asher: the clans of Imnah, Ishvi, and Beriah. "},{"num":45,"verse":"The clans of Heber and Malchiel traced their descent from Beriah. "},{"num":46,"verse":"Asher had a daughter named Serah. "},{"num":47,"verse":"These clans numbered 53,400 men."},{"num":48,"verse":"The tribe of Naphtali: the clans of Jahzeel, Guni, "},{"num":49,"verse":"Jezer, and Shillem. "},{"num":50,"verse":"These clans numbered 45,400 men."},{"num":51,"verse":"The total number of the Israelite men was 601,730."},{"num":52,"verse":"The Lord said to Moses, "},{"num":53,"verse":"“Divide the land among the tribes, according to their size. "},{"num":54,"verse":"Divide the land by drawing lots, and give a large share to a large tribe and a small one to a small tribe.”"},{"num":57,"verse":"The tribe of Levi consisted of the clans of Gershon, Kohath, and Merari. "},{"num":58,"verse":"Their descendants included the subclans of Libni, Hebron, Mahli, Mushi, and Korah. Kohath was the father of Amram, "},{"num":59,"verse":"who was married to Levi's daughter Jochebed, who was born in Egypt. She bore Amram two sons, Aaron and Moses, and a daughter, Miriam. "},{"num":60,"verse":"Aaron had four sons, Nadab, Abihu, Eleazar, and Ithamar. "},{"num":61,"verse":"Nadab and Abihu died when they offered unholy fire to the Lord. "},{"num":62,"verse":"The male Levites who were one month old or older numbered 23,000. They were listed separately from the rest of the Israelites, because they were not given any property in Israel."},{"num":63,"verse":"All these clans were listed by Moses and Eleazar when they took a census of the Israelites in the plains of Moab across the Jordan River from Jericho. "},{"num":64,"verse":"There was not even one man left among those whom Moses and Aaron had listed in the first census in the Sinai Desert. "},{"num":65,"verse":"The Lord had said that all of them would die in the wilderness, and except for Caleb son of Jephunneh and Joshua son of Nun they all did."}]