[{"header":"The Men of Israel Are Counted a Second Time"},{"num":26,"verse":"After the plague, the Lord spoke to Moses and Eleazar the priest. Eleazar was the son of Aaron. The Lord said, "},{"num":2,"verse":"“Count all the men of Israel. Make a list of them by their families. Count all the men who are able to serve in Israel’s army. They must be 20 years old or more.” "},{"num":3,"verse":"At that time the Israelites were on the plains of Moab. They were by the Jordan River across from Jericho. Moses and Eleazar the priest spoke with them. They said, "},{"num":4,"verse":"“Count all the men 20 years old or more. Do it just as the Lord commanded Moses.”"},{"num":7,"verse":"These were the families of Reuben. The number of men was 43,730."},{"num":8,"verse":"Eliab was the son of Pallu. "},{"num":9,"verse":"Eliab’s sons were Nemuel, Dathan and Abiram. Dathan and Abiram were the same community officials who refused to obey Moses and Aaron. They were among the followers of Korah who refused to obey the Lord. "},{"num":10,"verse":"The ground opened its mouth. It swallowed them up along with Korah. The followers of Korah died when fire burned up 250 men. Their deaths were a warning to the rest of Israel. "},{"num":11,"verse":"But the family line of Korah didn’t die out completely."},{"num":14,"verse":"These were the families of Simeon. The number of the men counted was 22,200."},{"num":18,"verse":"These were the families of Gad. The number of the men counted was 40,500."},{"num":19,"verse":"Er and Onan were sons of Judah. But they died in Canaan."},{"num":22,"verse":"These were the families of Judah. The number of the men counted was 76,500."},{"num":25,"verse":"These were the families of Issachar. The number of the men counted was 64,300."},{"num":27,"verse":"These were the families of Zebulun. The number of the men counted was 60,500."},{"num":37,"verse":"These were the families of Ephraim. The number of the men counted was 32,500."},{"num":41,"verse":"These were the families of Benjamin. The number of the men counted was 45,600."},{"num":43,"verse":"All the men in Dan’s family were Shuhamites. The number of the men counted was 64,400."},{"num":47,"verse":"These were the families of Asher. The number of the men counted was 53,400."},{"num":50,"verse":"These were the families of Naphtali. The number of the men counted was 45,400."},{"num":51,"verse":"The total number of the men of Israel was 601,730."},{"num":52,"verse":"The Lord said to Moses, "},{"num":53,"verse":"“I will give the land to them. The amount of land each family receives will be based on the number of its men. "},{"num":54,"verse":"Give a larger share to a larger family. Give a smaller share to a smaller family. Each family will receive its share based on the number of men listed in it."},{"num":55,"verse":"“Be sure that you cast lots when you give out the land. What each family receives will be based on the number of men listed in its tribe. "},{"num":56,"verse":"Cast lots when you give out each share. Cast lots for the larger and smaller families alike.”"},{"num":62,"verse":"The number of male Levites a month old or more was 23,000. They weren’t listed along with the other men of Israel. That’s because they didn’t receive a share among them."},{"num":63,"verse":"These are the men counted by Moses and Eleazar the priest. At that time the Israelites were on the plains of Moab. They were by the Jordan River across from Jericho. "},{"num":64,"verse":"The men of Israel had been counted before in the Sinai Desert by Moses and Aaron the priest. But not one of them was among the men counted this time. "},{"num":65,"verse":"The Lord had told the Israelites at Kadesh Barnea that they would certainly die in the desert. Not one of them was left alive except Caleb and Joshua. Caleb was the son of Jephunneh, and Joshua was the son of Nun."}]