[{"header":"The Impartiality of God"},{"num":2,"verse":"Therefore you have no excuse or justification, everyone of you who [hypocritically] judges and condemns others; for in passing judgment on another person, you condemn yourself, because you who judge [from a position of arrogance or self-righteousness] are habitually practicing the very same things [which you denounce]. "},{"num":2,"verse":"And we know that the judgment of God falls justly and in accordance with truth on those who practice such things. "},{"num":3,"verse":"But do you think this, O man, when you judge and condemn those who practice such things, and yet do the same yourself, that you will escape God’s judgment and elude His verdict? "},{"num":4,"verse":"Or do you have no regard for the wealth of His kindness and tolerance and patience [in withholding His wrath]? Are you [actually] unaware or ignorant [of the fact] that God’s kindness leads you to repentance [that is, to change your inner self, your old way of thinking—seek His purpose for your life]? "},{"num":5,"verse":"But because of your callous stubbornness and unrepentant heart you are [deliberately] storing up wrath for yourself on the day of wrath when God’s righteous judgment will be revealed. "},{"num":6,"verse":"He will pay back to each person according to his deeds [justly, as his deeds deserve]: "},{"num":7,"verse":"to those who by persistence in doing good seek [unseen but certain heavenly] glory, honor, and immortality, [He will give the gift of] eternal life. "},{"num":8,"verse":"But for those who are selfishly ambitious and self-seeking and disobedient to the truth but responsive to wickedness, [there will be] wrath and indignation. "},{"num":9,"verse":"There will be tribulation and anguish [torturing confinement] for every human soul who does [or permits] evil, to the Jew first and also to the Greek, "},{"num":10,"verse":"but glory and honor and inner peace [will be given] to everyone who habitually does good, to the Jew first and also to the Greek. "},{"num":11,"verse":"For God shows no partiality [no arbitrary favoritism; with Him one person is not more important than another]."},{"num":12,"verse":"For all who have sinned without the Law will also perish without [regard to] the Law, and all who have sinned under the Law will be judged and condemned by the Law. "},{"num":13,"verse":"For it is not those who merely hear the Law [as it is read aloud] who are just or righteous before God, but it is those who [actually] obey the Law who will be justified [pronounced free of the guilt of sin and declared acceptable to Him]. "},{"num":14,"verse":"When Gentiles, who do not have the Law [since it was given only to Jews], do instinctively the things the Law requires [guided only by their conscience], they are a law to themselves, though they do not have the Law. "},{"num":15,"verse":"They show that the essential requirements of the Law are written in their hearts; and their conscience [their sense of right and wrong, their moral choices] bearing witness and their thoughts alternately accusing or perhaps defending them "},{"num":16,"verse":"on that day when, as my gospel proclaims, God will judge the secrets [all the hidden thoughts and concealed sins] of men through Christ Jesus."},{"header":"The Jew Is Condemned by the Law"},{"num":17,"verse":"But if you bear the name “Jew” and rely on the Law [for your salvation] and boast in [your special relationship to] God, "},{"num":18,"verse":"and [if you claim to] know His will and approve the things that are essential or have a sense of what is excellent, based on your instruction from the Law, "},{"num":19,"verse":"and [if you] are confident that you are a [qualified] guide to the blind [those untaught in theology], a light to those who are in darkness, "},{"num":20,"verse":"and [that you are] a corrector of the foolish, a teacher of the [spiritually] childish, having in the Law the embodiment of knowledge and of the truth— "},{"num":21,"verse":"well then, you who teach others, do you not teach yourself? You who preach against stealing, do you steal [in ways that are discrete, but just as sinful]? "},{"num":22,"verse":"You who say that one must not commit adultery, do you commit adultery? You who detest idols, do you rob [pagan] temples [of valuable idols and offerings]? "},{"num":23,"verse":"You who boast in the Law, do you [repeatedly] dishonor God by breaking the Law? "},{"num":24,"verse":"For, “the name of God is blasphemed among the Gentiles because of you,” just as it is written [in Scripture]."},{"num":25,"verse":"Circumcision [the sign of the covenant of Abraham] is indeed of value if you practice the Law; but if you habitually break the Law, your circumcision has become uncircumcision [it is meaningless in God’s sight]. "},{"num":26,"verse":"So if the uncircumcised man keeps the requirements of the Law, will not his uncircumcision be regarded [by God] as circumcision? "},{"num":27,"verse":"Then he who is physically uncircumcised but keeps [the spirit of] the Law will judge you who, even though you have the written code and circumcision, break the Law. "},{"num":28,"verse":"For he is not a [real] Jew who is only one outwardly, nor is [true] circumcision something external and physical. "},{"num":29,"verse":"But he is a Jew who is one inwardly; and [true] circumcision is circumcision of the heart, by the Spirit, not by [the fulfillment of] the letter [of the Law]. His praise is not from men, but from God."}]