[{"header":"Chapter 2"},{"num":1,"verse":"Judging Is Inexcusable. Therefore, you have no excuse, whoever you may be, when you pass judgment on others. For in judging others you condemn yourself, since you are doing the same things."},{"num":2,"verse":"We are all aware that God’s judgment on those who commit such deeds is just."},{"num":3,"verse":"How can you then suppose that you will escape the judgment of God for doing such things when you are condemning those who perform the same things?"},{"num":4,"verse":"How can you despise the riches of God’s kindness and forbearance and patience? How can you fail to realize that his kindness is meant to lead you to repentance?"},{"num":5,"verse":"By your obstinate refusal to repent you are storing up retribution for yourself on the day of wrath when God’s righteous judgment will be revealed."},{"num":6,"verse":"For God will repay everyone in accordance with what his deeds deserve."},{"num":7,"verse":"To those who seek after glory and honor and immortality by persevering in good works, he will grant eternal life."},{"num":8,"verse":"But for those who are slaves to selfish ambition and follow the path of wickedness and not of truth, wrath and fury will be their lot."},{"num":9,"verse":"There will be affliction and distress for everyone who does evil—Jews first and then Gentiles."},{"num":10,"verse":"However, glory, honor, and peace await everyone who does good—Jews first, and then Gentiles."},{"num":11,"verse":"For God shows no partiality."},{"num":12,"verse":"The Law and Conscience. All those who have sinned outside the Law will perish outside the Law, and all who sinned under the Law will be judged by the Law."},{"num":13,"verse":"For it is not those who hear the Law who are justified by God; rather, it is those who observe the Law who will be justified."},{"num":14,"verse":"Therefore, when Gentiles, who do not have the Law, act by nature in conformity with the Law, they are a law for themselves, even though they have no Law."},{"num":15,"verse":"They show that the requirements of the Law are inscribed in their hearts; and their own conscience will also bear witness for them, since their conflicting thoughts will accuse or even defend them"},{"num":16,"verse":"on the day when, according to the gospel, God will judge the thoughts of all through Jesus Christ."},{"num":17,"verse":"You call yourself a Jew and rely on the Law and are proud of your relationship to God,"},{"num":18,"verse":"and you know his will and are able to distinguish between right and wrong because you have been instructed in the Law,"},{"num":19,"verse":"and you are confident that you are a guide to the blind, a light for those in darkness,"},{"num":20,"verse":"an instructor of the foolish, and a teacher of the simple because in the Law you have the embodiment of knowledge and truth."},{"num":21,"verse":"You, then, who teach others, do you not teach yourself? You who preach against stealing, are you yourself a thief?"},{"num":22,"verse":"You who forbid adultery, are you yourself an adulterer? You who abhor idols, do you commit sacrilege?"},{"num":23,"verse":"You who boast of the Law, do you dishonor God by breaking it?"},{"num":24,"verse":"As it is written, “Because of you the name of God is reviled among the Gentiles.”"},{"num":25,"verse":"Circumcision and the Heart. Circumcision has value if you obey the Law. However, if you break the Law, you have become as if you had never been circumcised."},{"num":26,"verse":"In the same way, if one who is not circumcised keeps the precepts of the Law, will not his uncircumcision be regarded as circumcision?"},{"num":27,"verse":"Then the man who is not physically circumcised but nevertheless observes the Law will condemn you who have the written code and circumcision but break the Law."},{"num":28,"verse":"A man is not a Jew who is only one outwardly, nor is true circumcision external and physical."},{"num":29,"verse":"Rather, the Jew is one who is a Jew inwardly, and true circumcision is of the heart—spiritual, not literal. He receives his praise not from human beings but from God."}]