[{"header":"God Judges Fairly"},{"num":2,"verse":"If you judge someone else, you have no excuse for it. When you judge another person, you are judging yourself. You do the same things you blame others for doing. "},{"num":2,"verse":"We know that when God judges those who do evil things, he judges fairly. "},{"num":3,"verse":"Though you are only a human being, you judge others. But you yourself do the same things. So how do you think you will escape when God judges you? "},{"num":4,"verse":"Do you disrespect God’s great kindness and favor? Do you disrespect God when he is patient with you? Don’t you realize that God’s kindness is meant to turn you away from your sins?"},{"num":5,"verse":"But you are stubborn. In your heart you are not sorry for your sins. You are storing up anger against yourself. The day of God’s anger is coming. Then his way of judging fairly will be shown. "},{"num":6,"verse":"God “will pay back each person in keeping with what they have done.” (Psalm 62:12; Proverbs 24:12) "},{"num":7,"verse":"God will give eternal life to those who keep on doing good. They want glory, honor, and life that never ends. "},{"num":8,"verse":"But there are others who only look out for themselves. They don’t accept the truth. They go astray. God will pour out his great anger on them. "},{"num":9,"verse":"There will be trouble and suffering for everyone who does evil. That is meant first for the Jews. It is also meant for the Gentiles. "},{"num":10,"verse":"But there will be glory, honor and peace for everyone who does good. That is meant first for the Jews. It is also meant for the Gentiles. "},{"num":11,"verse":"God treats everyone the same."},{"num":12,"verse":"Some people do not know God’s law when they sin. They will not be judged by the law when they die. Others do know God’s law when they sin. They will be judged by the law. "},{"num":13,"verse":"Hearing the law does not make a person right with God. People are considered to be right with God only when they obey the law. "},{"num":14,"verse":"Gentiles do not have the law. Sometimes they just naturally do what the law requires. They are a law for themselves. This is true even though they don’t have the law. "},{"num":15,"verse":"They show that what the law requires is written on their hearts. The way their minds judge them proves this fact. Sometimes their thoughts find them guilty. At other times their thoughts find them not guilty. "},{"num":16,"verse":"This will happen on the day God appoints Jesus Christ to judge people’s secret thoughts. That’s part of my good news."},{"header":"The Jews and the Law"},{"num":17,"verse":"Suppose you call yourself a Jew. You trust in the law. You brag that you know God. "},{"num":18,"verse":"You know what God wants. You agree with what is best because the law teaches you. "},{"num":19,"verse":"You think you know so much more than the people you teach. You think you’re helping blind people. You think you are a light for those in the dark. "},{"num":20,"verse":"You think you can make foolish people wise. You act like you’re teaching little children. You think that the law gives you all knowledge and truth. "},{"num":21,"verse":"You claim to teach others, but you don’t even teach yourself! You preach against stealing. But you steal! "},{"num":22,"verse":"You say that people should not commit adultery. But you commit adultery! You hate statues of gods. But you rob temples! "},{"num":23,"verse":"You brag about the law. But when you break it, you rob God of his honor! "},{"num":24,"verse":"It is written, “The Gentiles say evil things against God’s name because of you.” (Isaiah 52:5; Ezekiel 36:22)"},{"num":25,"verse":"Circumcision has value if you obey the law. But if you break the law, it is just as if you hadn’t been circumcised. "},{"num":26,"verse":"And sometimes those who aren’t circumcised do what the law requires. Won’t God accept them as if they had been circumcised? "},{"num":27,"verse":"Many are not circumcised physically, but they obey the law. They will prove that you are guilty. You are breaking the law, even though you have the written law and are circumcised."},{"num":28,"verse":"A person is not a Jew if they are a Jew only on the outside. And circumcision is more than just something done to the outside of a man’s body. "},{"num":29,"verse":"No, a person is a Jew only if they are a Jew on the inside. And true circumcision means that the heart has been circumcised by the Holy Spirit. The person whose heart has been circumcised does more than obey the written law. The praise that matters for that kind of person does not come from other people. It comes from God."}]