[{"header":"Dismissal of the Transjordan Tribes"},{"num":22,"verse":"Joshua summoned the Reubenites, the Gadites, and the half tribe of Manasseh. "},{"num":2,"verse":"He said to them, “You have carried out everything that Moses, the servant of the Lord, commanded you, and you have obeyed my voice in everything that I commanded you. "},{"num":3,"verse":"You have not forsaken your brothers for many days now, right up till today, and you have carried out the commands of the Lord your God. "},{"num":4,"verse":"Now the Lord your God has given rest to your brothers, just as he promised them. So now return to your tents, to the land assigned as your possession, which Moses, the servant of the Lord, gave to you east of the Jordan. "},{"num":5,"verse":"But be very careful to follow the commandment and teaching that Moses, the servant of the Lord, decreed to you, to love the Lord your God, to walk in all his ways, to keep his commandments, to cling to him, and to serve him with all your heart and with all your soul.”"},{"num":6,"verse":"Then Joshua blessed them and dismissed them, and they went to their tents. "},{"num":7,"verse":"(To the half tribe of Manasseh Moses had made a grant of land in Bashan, and to the other half of that tribe Joshua had made a grant among their brothers west of the Jordan.) So when Joshua dismissed them to their tents, he blessed them "},{"num":8,"verse":"and said to them, “Return to your tents with very great wealth—with large herds of livestock, with silver, gold, bronze, and iron, and with a lot of clothing. Divide the plunder taken from your enemies with your brother Israelites.”"},{"num":9,"verse":"So the descendants of Reuben, the descendants of Gad, and the half tribe of Manasseh set out to return home. They left the people of Israel at Shiloh in the land of Canaan to travel to the land of Gilead, to the land assigned as their possession, which they had acquired there by the word of the Lord through Moses."},{"header":"The Threat of War"},{"num":10,"verse":"When they came to Geliloth by the Jordan, which is in the land of Canaan, the people of Reuben, the people of Gad, and the half tribe of Manasseh built an altar there by the Jordan, a conspicuously large altar. "},{"num":11,"verse":"The people of Israel heard about it and said, “See, the people of Reuben, the people of Gad, and the half tribe of Manasseh have built the altar on the frontier of the land of Canaan at Geliloth of the Jordan, on the side of the river that belongs to the people of Israel.” "},{"num":12,"verse":"When the people of Israel heard this, the whole commuity of the people of Israel gathered at Shiloh to go to war against them."},{"num":13,"verse":"Then the people of Israel sent the priest Phinehas son of Eleazar to the people of Reuben, to the people of Gad, and to the half tribe of Manasseh in the land of Gilead. "},{"num":14,"verse":"Together with him they sent ten tribal leaders, a leader for each fathers’ house for all the tribes of Israel. Each one was a head of his fathers’ house according to the divisions of Israel."},{"num":15,"verse":"They came to the people of Reuben, to the people of Gad, and to the half tribe of Manasseh in the land of Gilead, and they spoke with them. They said, "},{"num":16,"verse":"“This is what the whole community of the Lord has said: Why have you committed such an unfaithful act against the God of Israel by turning from the Lord today? When you built an altar for yourselves, you rebelled against the Lord today. "},{"num":17,"verse":"Was the sin of Peor so trivial—something from which we have not cleansed ourselves to this day, and for which a plague came on the community of the Lord— "},{"num":18,"verse":"so that today you have to turn away from the Lord? This is what will happen if you rebel against the Lord today: Tomorrow he will be furious against the whole community of Israel! "},{"num":19,"verse":"But by all means, if the land you have received as your possession is unclean, cross over to the Lord’s own land where the Dwelling of the Lord has its home and take your possession among us. But do not rebel against the Lord, and do not make us rebels by your act of building an altar for yourselves apart from the altar of the Lord our God! "},{"num":20,"verse":"When Achan son of Zerah acted unfaithfully in regard to the devoted things, did it not bring anger against the whole community of Israel? He was not the only one who perished because of his guilt!”"},{"header":"The Response of the Tribes"},{"num":21,"verse":"Then the people of Reuben, the people of Gad, and the half tribe of Manasseh responded to the heads of the divisions of Israel:"},{"header":"War Avoided"},{"num":30,"verse":"Phinehas the priest heard this, as did the tribal leaders of the community and the heads of the divisions of the tribes of Israel who were with him. They heard the words that the people of Reuben, the people of Gad, and the people of Manasseh spoke, and they were pleased. "},{"num":31,"verse":"So Phinehas, son of Eleazar the priest, said to the people of Reuben, to the people of Gad, and to the people of Manasseh, “Today we know that the Lord is among us since you did not act unfaithfully against the Lord. Now you have saved the people of Israel from the hand of the Lord.”"},{"num":32,"verse":"So the priest Phinehas son of Eleazar and the leaders returned from the people of Reuben and Gad in the land of Gilead to the people of Israel in the land of Canaan, and they brought them a report. "},{"num":33,"verse":"The report pleased the people of Israel, so the people of Israel blessed God, and they did not say anything more about going to war against them to destroy the land that the people of Reuben and the people of Gad were living in."},{"num":34,"verse":"The people of Reuben and the people of Gad named the altar “Witness” because they said, “It is a witness between us that the Lord is the one God.”"}]