[{"header":"Three Tribes Go Home"},{"num":22,"verse":"Then Joshua called a meeting of all the people from the tribes of Reuben, Gad, and half the tribe of Manasseh."},{"num":2,"verse":"Joshua said to them, “Moses was the Lord’s servant. You obeyed everything that Moses told you to do. And you also obeyed all of my commands."},{"num":3,"verse":"All this time you have supported all the other Israelites. You carefully obeyed all the commands that the Lord your God gave you."},{"num":4,"verse":"The Lord your God promised to give the Israelites peace. And now, he has kept his promise, so now you can go home. The Lord’s servant Moses gave you the land on the east side of the Jordan River. Now you can go home to that land."},{"num":5,"verse":"But remember—continue to obey the law that the Lord’s servant Moses gave you. You must love the Lord your God and obey his commands. You must continue to follow him and serve him the very best that you can.”"},{"num":6,"verse":"Then Joshua said goodbye to them, and they left and went home."},{"num":7,"verse":"Moses had given the land of Bashan to half of the Manasseh tribe. Joshua gave land on the west side of the Jordan River to the other half of the Manasseh tribe. Joshua blessed them and sent them home."},{"num":8,"verse":"He said, “You have become very rich. You have many animals. You have gold, silver, and expensive jewelry. You have many beautiful clothes. You have taken many things from your enemies. Go home and divide these things among yourselves.”"},{"num":9,"verse":"So the people from the tribes of Reuben, Gad, and Manasseh left the other Israelites at Shiloh in Canaan. They went back home to Gilead. This was their own land, the land that Moses gave them, as the Lord had commanded."},{"num":10,"verse":"They went to the place called Geliloth, near the Jordan River in the land of Canaan. There they built a beautiful altar."},{"num":11,"verse":"But the other Israelites who were still at Shiloh heard about the altar that these three tribes built. They heard that the altar was at the border of Canaan at the place called Geliloth. It was near the Jordan River on Israel’s side."},{"num":12,"verse":"All the Israelites became very angry with these three tribes. They met together and decided to fight against them."},{"num":13,"verse":"So the Israelites sent some men to talk to the people of Reuben, Gad, and Manasseh. The leader of these men was Phinehas, son of Eleazar the priest."},{"num":14,"verse":"They also sent ten of the leaders of the tribes there. There was one man from each family group of Israel who was at Shiloh."},{"num":15,"verse":"So these eleven men went to Gilead. They went to talk to the people of Reuben, Gad, and Manasseh. The eleven men said to them,"},{"num":16,"verse":"“All the Lord’s people sent us to ask you this: ‘Why did you do this thing against the God of Israel? Why did you stop following the Lord? Why did you build an altar for yourselves? You know that this is against the Lord’s command."},{"num":17,"verse":"Remember what happened at Peor? Was the sin we committed there not bad enough? Because of that sin, the Lord punished his people with a terrible sickness. And we are still suffering from that sin."},{"num":18,"verse":"And now you are doing the same thing. You are turning against the Lord. Will you refuse to follow the Lord? If you don’t stop what you are doing, he will be angry with everyone in Israel."},{"num":19,"verse":"“‘If your land is not a good place to worship God, come over to the Lord’s land. This is where the Lord’s Tent is. You can have some of the land and live here. But don’t turn against the Lord or against us by building another altar. We already have the altar of the Lord our God at the Meeting Tent."},{"num":20,"verse":"“‘Remember how Achan son of Zerah refused to obey the command about things that must be destroyed. That one man broke God’s law, but all the Israelites were punished. Achan died because of his sin, but also many other people died.’”"},{"num":21,"verse":"The people from the tribes of Reuben, Gad, and Manasseh answered the eleven men. They said,"},{"num":22,"verse":"“The Lord is our God! Again we say that the Lord is our God! And God knows why we did this thing. We want you to know also. You can judge what we did. If you think we did it because we are against the Lord or refuse to obey him, you can kill us today."},{"num":23,"verse":"Do you think we built our own altar because we want to turn away from the Lord? Do you think we built another altar for burnt offerings, grain offerings, and fellowship offerings? If that is why we built this altar, we ask the Lord himself to punish us."},{"num":24,"verse":"But that is not why we built it. We built it because we were afraid that in the future your descendants might not accept us as part of God’s people. So your children might say to our children, ‘You people have no reason to worship the Lord, the God of Israel."},{"num":25,"verse":"The Lord separated you people of Reuben and Gad from us by giving you the land on the other side of the Jordan River. So you are not part of the Lord’s people.’ If your children said that, it might make our children stop worshiping the Lord."},{"num":26,"verse":"“So we decided to build this altar. But we did not plan to use it for burning offerings and sacrifices."},{"num":27,"verse":"The real reason we wanted our altar was to show our people that we worship the same God you do. This altar will be the proof to you and us and to all our future children that we worship the Lord. We give our sacrifices, grain offerings, and fellowship offerings to the Lord. We wanted your children to grow up and know that we are also Israelites like yourselves."},{"num":28,"verse":"In the future, if it happens that your children say that we don’t belong to Israel, then our children can say, ‘Look, our fathers who lived before us made an altar. That altar is exactly like the Lord’s altar at the Holy Tent. We don’t use this altar for sacrifices—this altar is proof that we are part of Israel.’"},{"num":29,"verse":"“The truth is, we don’t want to be against the Lord. We don’t want to stop following him now. We know that the only true altar is the one that is in front of the Holy Tent. That altar belongs to the Lord our God.”"},{"num":30,"verse":"Phinehas the priest and the leaders with him heard what the people from Reuben, Gad, and Manasseh said. They were satisfied that they were telling the truth."},{"num":31,"verse":"So Phinehas the priest said, “Now we know that the Lord is with us and that you did not turn against him. We are happy that the Israelites will not be punished by the Lord.”"},{"num":32,"verse":"Then Phinehas and the leaders left that place and went home. They left the people of Reuben and Gad in the land of Gilead and went back to Canaan. They went back to the Israelites and told them what had happened."},{"num":33,"verse":"The Israelites were also satisfied. They were happy and thanked God. They decided not to go and fight against the people of Reuben, Gad, and Manasseh. They decided not to destroy the land where those people live."},{"num":34,"verse":"The people of Reuben and Gad named the altar “Proof That We Believe the Lord is God.”"}]