[{"header":"The Tribes East of the Jordan"},{"num":22,"verse":"Later, Joshua called together the descendants of Reuben, the descendants of Gad, and the half-tribe of Manasseh "},{"num":2,"verse":"and told them, “You have done everything that Moses the servant of the Lord commanded you, and you have listened to me in everything that I commanded you. "},{"num":3,"verse":"You haven’t abandoned your relatives these past days to the present, and you have met the obligation contained in the commands of the Lord your God. "},{"num":4,"verse":"Now the Lord has given peace to your relatives, just as he told them. Therefore, proceed to your tents—to the land that is yours to possess—that Moses the servant of the Lord gave you east of the Jordan River. "},{"num":5,"verse":"Only be very careful to keep the commands and the Law that Moses the servant of the Lord commanded you—that is, to love the Lord your God, to follow in all of his ways, to keep his commands, to stay close to him, and to serve him with all your heart and soul.” "},{"num":6,"verse":"That’s how Joshua blessed them. Then he sent them on their way and they returned to their tents."},{"num":7,"verse":"Now Moses had made an allotment in Bashan to one half-tribe of Manasseh, but Joshua made an allotment west of the Jordan River to the other half-tribe of their relatives. So when Joshua sent them on their way back to their tents, he also blessed them by saying "},{"num":8,"verse":"“Return to your tents with great wealth, plenty of livestock, silver, gold, bronze, iron, and lots of clothing. Divide the spoil from your enemies among your relatives.”"},{"num":9,"verse":"The descendants of Reuben, the descendants of Gad, and the half-tribe of Manasseh went back to the land of Gilead, leaving the Israelis at Shiloh in the land of Canaan, for their territorial possession that they had inherited in accordance with the command of the Lord given through Moses."},{"header":"An Unauthorized Altar is Constructed"},{"num":10,"verse":"After they arrived at an area of the Jordan River that is in the land of Canaan, the descendants of Reuben, the descendants of Gad, and the half-tribe of Manasseh constructed an altar there by the Jordan River, and it was very large. "},{"num":11,"verse":"When the Israelis heard about it, they announced, “Look here, the descendants of Reuben, the descendants of Gad, and the half-tribe of Manasseh have constructed an altar in Canaan’s frontier district of the Jordan River, on the side apportioned to the Israelis.” "},{"num":12,"verse":"When the Israelis heard that announcement, the entire community of the Israelis gathered together at Shiloh in preparation for war."},{"num":13,"verse":"Then the Israelis sent a delegation to the descendants of Reuben, the descendants of Gad, and the half-tribe of Manasseh in the land of Gilead. They sent Eleazar’s son Phinehas the priest, "},{"num":14,"verse":"and ten officials with him (one for each of the tribal families of Israel, each one of them a family leader among the tribes of Israel). "},{"num":15,"verse":"They approached the descendants of Reuben, the descendants of Gad, and the half-tribe of Manasseh in the land of Gilead and told them: "},{"num":16,"verse":"“This is what the entire community of the Lord has to say: ‘What is this treacherous act by which you have acted deceitfully against the God of Israel by turning away from following the Lord today, and by building yourselves an altar today, so you can rebel against the Lord? "},{"num":17,"verse":"Isn’t the evil that happened at Peor enough for us, from which we have yet to be completely cleansed even to this point, and because of which a plague came upon the community of the Lord? "},{"num":18,"verse":"Now then, are you turning away from following the Lord today? If you rebel against the Lord today, by tomorrow he will be angry with the entire community of Israel. "},{"num":19,"verse":"If the land of your inheritance remains unclean, then cross back over into the land that the Lord possesses, and receive an inheritance among us. Don’t rebel against the Lord and against us by constructing an altar for yourselves besides the altar of the Lord our God. "},{"num":20,"verse":"Didn’t Zerah’s son Achan act treacherously with respect to the things banned by God, and as a result God became angry at the entire community of Israel? And that man was not the only one to die because of his iniquity.’”"},{"num":21,"verse":"The descendants of Reuben, the descendants of Gad, and the half-tribe of Manasseh answered the officials of the tribes of Israel, "},{"num":22,"verse":"“The God of gods, the Lord, the God of gods, the Lord is the one who knows! And may Israel itself be aware that if this was an act of rebellion or an act of treachery against the Lord, may he not deliver us today! "},{"num":23,"verse":"If we have built an altar for ourselves intended to turn us away from following the Lord, or to offer burnt offerings, grain offerings, or peace offerings on it, may the Lord himself demand an accounting from us! "},{"num":24,"verse":"But we did this because we were concerned for a reason, since we thought, ‘Sometime in the future your descendants may say to our descendants, “What do you have in common with the Lord, the God of Israel? "},{"num":25,"verse":"The Lord has established the Jordan River to be a territorial border between us and you. Descendants of Reuben and descendants of Gad have no allotment from the Lord.” So your descendants may cause our descendants to stop fearing the Lord.’"},{"num":26,"verse":"“That’s why we said, ‘Let’s build an altar for ourselves, not for burnt offerings or sacrifice, "},{"num":27,"verse":"but instead it will serve as a reminder between us and you and between our generations after us, that we are to serve the Lord with our burnt offerings, sacrifices, and peace offerings. That way your descendants will not say to our descendants in the future, “You have no allotment from the Lord.”’"},{"num":28,"verse":"“That’s also why we said, ‘It may be if they say these things to us and to our descendants in the future, so we will respond, “Look at this replica of the altar of the Lord that our ancestors made, not for burnt offerings or sacrifice, but rather as a reminder between us and you. "},{"num":29,"verse":"May we never rebel against the Lord today by building an altar for burnt offerings, for grain offerings, or for sacrifice to replace the altar of the Lord our God which stands before his Tent.”’”"},{"num":30,"verse":"When Phinehas the priest, the leaders of the community, and the heads of the families of Israel who were with him heard what the descendants of Reuben, the descendants of Gad, and the descendants of Manasseh said, they were pleased. "},{"num":31,"verse":"So Eleazar’s son Phinehas the priest replied to the descendants of Reuben, the descendants of Gad, and the descendants of Manasseh, “Today we’ve demonstrated that the Lord is among us, because you have not acted treacherously against the Lord. Now you have delivered the Israelis from the anger of the Lord.”"},{"num":32,"verse":"So Eleazar’s son Phinehas the priest and the leaders returned from the descendants of Reuben, the descendants of Gad, and from the land of Gilead to the land of Canaan and to the people of Israel, bringing back word to them. "},{"num":33,"verse":"What they said pleased the people of Israel, so they blessed God and said no more about going up to attack them in war and to destroy the land where the descendants of Reuben and the descendants of Gad were living. "},{"num":34,"verse":"The descendants of Reuben and the descendants of Gad named the altar “Witness,” because they claimed, “It stands as a witness between us that the Lord is God.”"}]