[{"header":"Supervisors in God’s household"},{"num":3,"verse":"This saying is reliable: if anyone has a goal to be a supervisor in the church, they want a good thing."},{"num":2,"verse":"So the church’s supervisor must be without fault. They should be faithful to their spouse, sober, modest, and honest. They should show hospitality and be skilled at teaching."},{"num":3,"verse":"They shouldn’t be addicted to alcohol or be a bully. Instead, they should be gentle, peaceable, and not greedy."},{"num":4,"verse":"They should manage their own household well—they should see that their children are obedient with complete respect,"},{"num":5,"verse":"because if they don’t know how to manage their own household, how can they take care of God’s church?"},{"num":6,"verse":"They shouldn’t be new believers so that they won’t become proud and fall under the devil’s spell."},{"num":7,"verse":"They should also have a good reputation with those outside the church so that they won’t be embarrassed and fall into the devil’s trap."},{"header":"Servants in God’s household"},{"num":8,"verse":"In the same way, servants in the church should be dignified, not two-faced, heavy drinkers, or greedy for money."},{"num":9,"verse":"They should hold on to the faith that has been revealed with a clear conscience."},{"num":10,"verse":"They should also be tested and then serve if they are without fault."},{"num":11,"verse":"In the same way, women who are servants in the church should be dignified and not gossip. They should be sober and faithful in everything they do."},{"num":12,"verse":"Servants must be faithful to their spouse and manage their children and their own households well."},{"num":13,"verse":"Those who have served well gain a good standing and considerable confidence in the faith that is in Christ Jesus."},{"header":"Leading God’s household"},{"num":14,"verse":"I hope to come to you quickly. But I’m writing these things to you so that"},{"num":15,"verse":"if I’m delayed, you’ll know how you should behave in God’s household. It is the church of the living God and the backbone and support of the truth."},{"num":16,"verse":"Without question, the mystery of godliness is great: he was revealed as a human, declared righteous by the Spirit, seen by angels, preached throughout the nations, believed in around the world, and taken up in glory."}]