[{"header":"What a Church Leader Must Be Like"},{"num":3,"verse":"It is true that if a man wants to be a church leader, he wants to do a good work. "},{"num":2,"verse":"A church leader must be a good man. His life must be so no one can say anything against him. He must have only one wife and must be respected for his good living. He must be willing to take people into his home. He must be willing to learn and able to teach the Word of God. "},{"num":3,"verse":"He must not get drunk or want to fight. Instead, he must be gentle. He must not have a love for money. "},{"num":4,"verse":"He should be a good leader in his own home. His children must obey and respect him. "},{"num":5,"verse":"If a man cannot be a good leader in his own home, how can he lead the church? "},{"num":6,"verse":"A church leader must not be a new Christian. A new Christian might become proud and fall into sin which is brought on by the devil. "},{"num":7,"verse":"A church leader must be respected by people who are not Christians so nothing can be said against him. In that way, he will not be trapped by the devil."},{"header":"What the Church Helpers Must Be Like"},{"num":8,"verse":"Church helpers must also be good men and act so people will respect them. They must speak the truth. They must not get drunk. They must not have a love for money. "},{"num":9,"verse":"They must have their faith in Christ and be His follower with a heart that says they are right. "},{"num":10,"verse":"They must first be tested to see if they are ready for the work as church helpers. Then if they do well, they may be chosen as church helpers. "},{"num":11,"verse":"The wives of church helpers must be careful how they act. They must not carry stories from one person to another. They must be wise and faithful in all they do. "},{"num":12,"verse":"Church helpers must have only one wife. They must lead their home well and their children must obey them. "},{"num":13,"verse":"Those who work well as church helpers will be respected by others and their own faith in Christ Jesus will grow."},{"header":"Why Paul Writes to Timothy"},{"num":14,"verse":"I hope to come to you soon. I am writing these things "},{"num":15,"verse":"because it may be awhile before I get there. I wanted you to know how you should act among people in the church which is the house of the living God. The church holds up the truth. "},{"num":16,"verse":"It is important to know the secret of God-like living, which is: Christ came to earth as a Man. He was pure in His Spirit. He was seen by angels. The nations heard about Him. Men everywhere put their trust in Him. He was taken up into heaven."}]