[{"header":"Leaders in the Church"},{"num":3,"verse":"If any of you aspires to be an overseer in the church; you have set your heart toward a noble ambition, for the word is true! "},{"num":2,"verse":"Yet an elder needs to be one who is without blame before others."},{"num":3,"verse":"He cannot be a drunkard, or someone who lashes out at others, or argumentative, or someone who simply craves more money, but instead, recognized by his gentleness."},{"num":4,"verse":"His heart should be set on guiding his household with wisdom and dignity; bringing up his children to worship with devotion and purity. "},{"num":5,"verse":"For if he’s unable to properly lead his own household well, how could he properly lead God’s household?"},{"num":6,"verse":"He should not be a new disciple who would be vulnerable to living in the clouds of conceit and fall into pride, making him easy prey for Satan. "},{"num":7,"verse":"He should be respected by those who are unbelievers, having a beautiful testimony among them so that he will not fall into the traps of Satan and be disgraced."},{"num":8,"verse":"And in the same way the deacons must be those who are pure and true to their word, not addicted to wine, or with greedy eyes on the contributions. "},{"num":9,"verse":"Instead, they must faithfully embrace the mysteries of faith while keeping a clean conscience. "},{"num":10,"verse":"And each of them must be found trustworthy according to these standards before they are given the responsibility to minister as servant-leaders without blame."},{"num":11,"verse":"And the women also who serve the church should be dignified, faithful in all things, having their thoughts set on truth, and not known as those who gossip."},{"num":12,"verse":"A deacon’s heart must be toward his wife alone, leading his children and household with excellence. "},{"num":13,"verse":"For those who serve in this way will obtain an honorable reputation for themselves and a greater right to speak boldly in the faith that comes from Jesus Christ!"},{"num":14,"verse":"I’m writing all this with the expectation of seeing you soon. "},{"num":15,"verse":"But if I’m delayed in coming, you’ll already have these instructions on how to conduct the affairs of the church of the living God, his very household and the supporting pillar and firm foundation of the truth."},{"header":"The Mystery of Righteousness"}]