[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Serve him.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In Biblical Chaldee this word is only used of rendering Divine service or worship. The “Son of man” is therefore here spoken of as God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There was given him dominion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “All these kingdoms shall in their turns be destroyed, but the kingdom of the Messiah shall stand for ever. It was in allusion to this prophecy that the angel said of Jesus, before he was conceived in the womb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall reign over the house of Jacob for ever, and of his kingdom there shall be no end.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " After what manner these great changes will be effected, we cannot pretend to say, as God hath not been pleased to reveal it. We see the remains of the ten horns which arose out of the Roman empire. We see the little horn still subsisting, though not in full strength and vigour, but as we hope upon the decline, and tending toward a dissolution. And having seen so many of these particulars accomplished, we can have no reason to doubt that the rest also will be fulfilled in due season; though we cannot frame any conception how Christ will be manifested in glory; how the little horn, with the body of the fourth beast, will be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "given to the burning flame; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or how the saints will take the kingdom, and possess it for ever and ever. It is the nature of such prophecies, not to be perfectly understood till they are fulfilled. The best comment upon them will be their completion.” — Bishop Newton.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:9-14 These verses are for the comfort and support of the people of God, in reference to the persecutions that would come upon them. Many New Testament predictions of the judgment to come, have plain allusion to this vision; especially Re 20:11,12. The Messiah is here called the Son of man; he was made in the likeness of sinful flesh, and was found in fashion as a man, but he is the Son of God. The great event foretold in this passage, is Christ's glorious coming, to destroy every antichristian power, and to render his own kingdom universal upon earth. But ere the solemn time arrives, for manifesting the glory of God to all worlds in his dealings with his creatures, we may expect that the doom of each of us will be determined at the hour of our death; and before the end shall come, the Father will openly give to his incarnate Son, our Mediator and Judge, the inheritance of the nations as his willing subjects.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there was given him dominion - That is, by him who is represented as the \"Ancient of days.\" The fair interpretation of this is, that he received the dominion from him. This is the uniform representation in the New Testament. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word dominion here means rule or auhority - such as a prince exercises. He was set over a kingdom as a prince or ruler.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And glory - That is the glory or honor appropriate to one at the head of such an empire.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And a kingdom - That is, he would reign. He would have sovereignty. The nature and the extent of this kingdom is immediately designated as one that would be universal and perpetual. What is properly implied in this language as to the question whether it will be literal and visible, will be appropriately considered at the close of the verse. All that is necessary to be noticed here is, that it is everywhere promised in the Old Testament that the Messiah would be a king, and have a kingdom. Compare Psalm 2:1-12; Isaiah 9:6-7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And a kingdom - That is, he would reign. He would have sovereignty. The nature and the extent of this kingdom is immediately designated as one that would be universal and perpetual. What is properly implied in this language as to the question whether it will be literal and visible, will be appropriately considered at the close of the verse. All that is necessary to be noticed here is, that it is everywhere promised in the Old Testament that the Messiah would be a king, and have a kingdom. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:1-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "That all people, nations, and languages should serve him - It would be universal; would embrace all nations. The language here is such as would emphatically denote universality. See the notes at Daniel 3:4; Daniel 4:1. It implies that that kingdom would extend over all the nations of the earth, and we are to look for the fulfillment of this only in such a universal reign of the Messiah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That all people, nations, and languages should serve him - It would be universal; would embrace all nations. The language here is such as would emphatically denote universality. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It implies that that kingdom would extend over all the nations of the earth, and we are to look for the fulfillment of this only in such a universal reign of the Messiah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "His dominion is an everlasting dominion ... - The others, represented by the four beasts, would all pass away, but this would be permanent and eternal. Nothing would destroy it. It would not have, as most kingdoms of the earth have had, any such internal weakness or source of discord as would be the cause of its destruction, nor would there be any external power that would invade or overthrow it. This declaration affirms nothing as to the form in which the kingdom would exist, but merely asserts the fact that it would do so. Respecting the kingdom of the Messiah, to which this undoubtedly alludes, the same thing is repeatedly and uniformly affirmed in the New Testament. Compare Matthew 16:18; Hebrews 12:28; Revelation 11:15. The form and manner in which this will occur is more fully developed in the New Testament; in the vision seen by Daniel the fact only is stated.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "His dominion is an everlasting dominion ... - The others, represented by the four beasts, would all pass away, but this would be permanent and eternal. Nothing would destroy it. It would not have, as most kingdoms of the earth have had, any such internal weakness or source of discord as would be the cause of its destruction, nor would there be any external power that would invade or overthrow it. This declaration affirms nothing as to the form in which the kingdom would exist, but merely asserts the fact that it would do so. Respecting the kingdom of the Messiah, to which this undoubtedly alludes, the same thing is repeatedly and uniformly affirmed in the New Testament. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 16:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The form and manner in which this will occur is more fully developed in the New Testament; in the vision seen by Daniel the fact only is stated.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The question now arises, What would be a fulfillment of this prediction respecting the kingdom that will be given to the saints? What, from the language used in the vision, should we be legitimately authorized to expect to take place on the earth? In regard to these questions, there are but two views which can be taken, and the interpretation of the passage must sustain the one or the other.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) One is what supposes that this will be literally fulfilled in the sense that the Son of God, the Messiah, will reign personally on earth. According to this, he will come to set up a visible and glorious kingdom, making Jerusalem his capital, and swaying his scepter over the world. All nations and people will be subject to him; all authority will be wielded by his people under him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) According to the other view, there will be a spiritual reign of the Son of God over the earth; that is, the principles of his religion will everywhere prevail, and the righteous will rule, and the laws of the Redeemer will be obeyed everywhere. There will be such a prevalence of his gospel on the hearts of all - rulers and people; the gospel will so modify all laws, and control all customs, and remove all abuses, and all the forms of evil; men will be so generally under the influence of that gospel, that it may be said that He reigns on the earth, or that the government actually administered is his.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In regard to these different views, and to the true interpretation of the passage, it may be remarked,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That we are not to look for the literal fulfillment of this; we are not to expect that what is here described will literally occur. The whole is evidently a symbolic representation, and the fulfillment is to be found in something that the symbol would properly denote. No one can pretend that there is to be an actual sitting on the throne, by one in the form of an old man - \"the Ancient of days\" - or that there is to be a literal coming to him by one \"like the Son of man,\" to receive a kingdom. But if one part of the representation is not to be literally interpreted, why should the other be? It may be added, that it is nowhere said that this would literally occur.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) All that is fairly implied here is found in the latter interpretation. Such a prevalence of the principles of the gospel would meet the force of the language, and every part of the vision would find a real fulfillment in that.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The fact that it proceeds from God - represented as \"the Ancient of days.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) The fact that it is given by him, or that the kingdom is made over by him to the Messiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The fact that the Messiah would have such a kingdom; that is, that he would reign on the earth, in the hearts and lives of men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. Son of man—(See on [1093]Eze 2:1). Not merely Son of David, and King of Israel, but Head of restored humanity (corresponding to the world-wide horizon of Daniel's prophecy); the seed of the woman, crushing Antichrist, the seed of the serpent, according to the Prot-evangel in Paradise (Ge 3:15). The Representative Man shall then realize the original destiny of man as Head of the creation (Ge 1:26, 28); the center of unity to Israel and the Gentiles. The beast, which taken conjointly represents the four beasts, ascends from the sea (Da 7:2; Re 13:1); the Son of man descends from \"heaven.\" Satan, as the serpent, is the representative head of all that bestial; man, by following the serpent, has become bestial. God must, therefore, become man, so that man may cease to be beast-like. Whoever rejects the incarnate God will be judged by the Son of man just because He is the Son of man (Joh 5:27). This title is always associated with His coming again, because the kingdom that then awaits Him in that which belongs to Him as the Saviour of man, the Restorer of the lost inheritance. \"Son of man\" expresses His VISIBLE state formerly in his humiliation hereafter in His exaltation. He \"comes to the Ancient of days\" to be invested with the kingdom. Compare Ps 110:2: \"The Lord shall send the rod of thy strength (Messiah) out of Zion.\" This investiture was at His ascension \"with the clouds of heaven\" (Ac 1:9; 2:33, 34; Ps 2:6-9; Mt 28:18), which is a pledge of His return \"in like manner\" in the clouds\" (Ac 1:11; Mt 26:64), and \"with clouds\" (Re 1:7). The kingdom then was given to Him in title and invisible exercise; at His second coming it shall be in visible administration. He will vindicate it from the misrule of those who received it to hold for and under God, but who ignored His supremacy. The Father will assert His right by the Son, the heir, who will hold it for Him (Eze 1:27; Heb 1:2; Re 19:13-16). Tregelles thinks the investiture here immediately precedes Christ's coming forth; because He sits at God's right hand until His enemies are made His footstool, then the kingdom is given to the Son in actual investiture, and He comes to crush His so prepared footstool under His feet. But the words, \"with the clouds,\" and the universal power actually, though invisibly, given Him then (Eph 1:20-22), agree best with His investiture at the ascension, which, in the prophetic view that overleaps the interval of ages, is the precursor of His coming visibly to reign; no event of equal moment taking place in the interval.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there was given him dominion, and glory, and a kingdom,.... That is, a large, powerful, and glorious kingdom; not but that he had a kingdom before, but now it will be more extensive, and appear in greater glory: this will be fulfilled when the kingdoms of this world shall become his, and all nations shall serve and worship him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that all people, nations, and languages, should serve him; embrace his Gospel, submit to his ordinances serve and worship him in every religious duty; every people, of all nations, and of every language under heaven; which will be the case when the everlasting Gospel will be preached to them all with success, Revelation 14:6, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that all people, nations, and languages, should serve him; embrace his Gospel, submit to his ordinances serve and worship him in every religious duty; every people, of all nations, and of every language under heaven; which will be the case when the everlasting Gospel will be preached to them all with success, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "his dominion is an everlasting dominion; it shall never have an end, as the rest of the monarchies, signified by the four beasts, have had, or will have; see Psalm 14:6, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "his dominion is an everlasting dominion; it shall never have an end, as the rest of the monarchies, signified by the four beasts, have had, or will have; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "which shall not pass away; or be removed from one to another, like the above monarchies: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and his kingdom that which shall not be destroyed; or \"corrupted\" (z) abolished and brought to nothing, as the said monarchies were one by another; and, at last, all of them by the stone cut out of the mountain; see Daniel 2:44. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and his kingdom that which shall not be destroyed; or \"corrupted\" (z) abolished and brought to nothing, as the said monarchies were one by another; and, at last, all of them by the stone cut out of the mountain; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) \"corrumpetur\", Pagninus, Montanus; \"corrumpitur\", Junius & Tremellius, Piscator, Coccceus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) \"corrumpetur\", Pagninus, Montanus; \"corrumpitur\", Junius & Tremellius, Piscator, Coccceus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And there was given him {c} dominion, and glory, and a kingdom, that all people, nations, and languages, should serve him: his dominion is an everlasting dominion, which shall not pass away, and his kingdom that which shall not be destroyed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And there was given him ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " dominion, and glory, and a kingdom, that all people, nations, and languages, should serve him: his dominion ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an everlasting dominion, which shall not pass away, and his kingdom ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which shall not be destroyed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) This is meant of the beginning of Christ's kingdom, when God the Father gave unto him all dominion, as the the Mediator, with the intent that he would continually govern his Church which is here on earth, until the time that he brought them to eternal life.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A universal and never-ending dominion is given to him. The expressions in the first half of the verse resemble in part those used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:18-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Nebuchadnezzar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Serve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not necessarily mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "worship",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": like the word which has the same meaning in Heb. (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עבד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it may be used of obedience to either God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or a human ruler (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the Targ. of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:6-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.). With the second half of the verse comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and especially ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 34 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of the kingdom of God). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All peoples, nations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And there was given him dominion, and glory, and a kingdom, that all people, nations, and languages, should serve him: his dominion is an everlasting dominion, which shall not pass away, and his kingdom that which shall not be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "destroyed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The versions differ only slightly and verbally from this. The personal element is here made prominent. Compare with this ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Worthy is the Lamb that was slain to receive power, and riches, and wisdom, and strength, and honour, and glory, and blessing.\" The Messianic kingdom, and with it the Messiah, was to be everlasting. The resemblance is great, as might be expected, between this statement and that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"A kingdom which shall never be destroyed, and the kingdom shall not be left to other people.\" It is to be noted that even his dominion is bestowed upon him. The Ancient of days, whose sentence has deprived the other dynasties of theft empire, bestows boundless empire on the Messiah (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". and 72.). Jeremiah's account of the state of matters on the return from the Captivity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")is compared to this by Hitzig; but there it is not a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who is to come near before God, it is simply \"governor\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mashal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In Jeremiah we have to do with a subject-people living in the fear of the Lord, but under the yoke of a foreign power.  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Ecursus on",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The Son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of Man.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The title given here to the Messiah for the first time, appears prominently in the Book of Enoch, and becomes consecrated to us in the lips of our Lord, as the favourite title by which he designated himself as the Messiah. The phrase, \"son of man,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ben-adam",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is used of man as contrasted with God: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"God is not a man that he should lie, nor the son of man that he should repent;\" of man as weak: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Who art thou, that thou shouldest be afraid of a man that shall die, and of the son of man which shall be made as the grass?\" (so ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Again, it is used simply as equivalent to \"man:\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"No man shall abide there, neither shall son of man dwell in it\" (see also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The contrast, so far as there is a contrast, is between ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אִישׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בֶּן־אָדָם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the Psalms we have ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "benee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "adam",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "benee ish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " contrasted: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Surely men of low degree (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "benee adam",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are vanity, and men of high degree (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "benee ish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are a lie.\" This distinction does not apply to Aramaic, in which ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "enush is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the only generally used word for \"man.\" In the prophecies of Ezekiel the phrase becomes determinative of the prophet. The question is complicated, however, by the fact that in Eastern Aramaic ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "barnesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a contraction for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "bar-enasho",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is used very generally for \"men,\" as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "col-bar-nesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "everybody.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It also occurs in this sense in Targumic, though more rarely, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The title here, then, simply declares that one, having the appearance of a man, was seen coming in the clouds of heaven. The phrase in the Peshitta for \"the Son of man\" is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "batch d'nosh.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is implied that this mysterious Being had the form of a man, but further, it is implied that he was other than man. In the Book of Enoch the phrase has ceased to be descriptive merely, and has become an appellation. Thus Enoch 46.: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " And there I saw one who had a head of days, and his head was white like wool, and with him was another being, whose countenance had the appearance of a man, and his face was full of graciousness like one of the holy angels. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " And I asked the angel who went with me and showed me all the hidden things concerning that Son of man, who he was, and why he went with the Head of days. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " And he answered and said unto me, This is the Son of man, who hath righteousness, with whom dwelleth righteousness, and who reveals all the treasures of that which is hidden, because the Lord of spirits hath chosen him, and his lot before the Lord of spirits hath surpassed everything in uprightness for ever. This is clearly borrowed from the chapter before us. Elsewhere we have endeavoured to fix the date of this part of the Book of Enoch, as  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 210",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of course, in this view the Maccabean origin of Daniel is definitely set aside. If, however, we take the date assigned to this part by Mr. Charles, then we have a choice between approximately  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 90",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 70",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Even then the date seems too near the critical date of Daniel to explain the rapid development the idea has undergone. In Daniel the person \"like a son of man\" may be a personification of Israel, though not naturally so; here in Enoch we have to do with a super-angelic being. As to the question of the reference of the title, it has been doubted whether it is to be held as applying to the Messiah, the Messianic kingdom, or to the people of Israel. The last view is that of Hitzig and many other critics of his school. It practically involves a denial of the truth of the idea that the Jews ever had Messianic hopes. In the present case there is nothing to indicate any reference to Israel personified. While there might be some plausibility in arguing from each of the four beasts representing empires that this \"Son of man\" should represent an empire also; it must be observed that in all the other cases there is a peculiarity which marks off the animal as merely a symbol: the lion has wings; the bear has three ribs in its teeth; the leopard has four heads and four wings; and the last, unnamed, beast has ten heads and iron teeth. Further, this \"Son of man\" is brought to the Ancient of days, and does not merely appear as do the \"beasts.\" He has thus many of the characteristics of a person. The other view, that the \"Son of man\" indicates the Messianic kingdom, thus comes into line with the view of Hitzig. The view that it is the Messiah who is meant by the \"Son of man\" was held practically by all interpreters, Jewish and Christian, until the middle of last century. If we look at the phenomenon of prophetism, we shall find ourselves open to another view of the matter. From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we see that prophets did not necessarily ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the meaning of their own prophecies. It might well be, then, that to Daniel the distinction between the Messianic King and the Messianic kingdom was not one clearly apprehended. We see in the prophecies of the second Isaiah that the \"servant of the Lord\" is first the holy people, then the prophetic order, and latterly a person. There probably was a similar uncertainty here. If we grant this  indeffiniteness, the next question that rises is - What is the special aspect of the Messianic kingdom that is intended to be portrayed when this title is given to its King? If we are guided by what is incomparably the oldest interpretation, that of the second Book of Enoch, this title implies an incalculable dignity. When we come to our Lord's use of it in the Gospels, there is nothing to oppose this. Thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"And hath committed all judgment unto him, because he is the Son of man;\" so ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"The Son of man hath power on earth to forgive sins.\" This is not contradicted by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"The foxes have holes,...  but the Son of man hath not where to lay his head.\" The emphasis of the statement lies in the contrast between the inexpressible dignity of the Person and the poverty of his earthly circumstances. It is because the ideas of superhuman dignity had been associated with the title that our Lord had, in foretelling his approaching crucifixion,. to bring the two facts into close connection, \"The Son of man must be lifted up.\" So after Peter's confession, \"The Son of man must suffer many things.\" We see that the multitude of the Jews understood the title to have this lofty meaning, for they demand (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"How sayest thou, The Sen of man must be lifted up? Who is this Son of man?\" The attempts to make it imply something humiliating by dwelling on the fact that not ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "adam",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ish is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the word for \"man,\" but '",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "enosh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are beside the question, for these deductions apply to the Hebrew words, not to the Aramaic. And in Aramaic neither ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nor ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "adam",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is in common use as equivalent for \"man.\" It is as much beside the point as if one, knowing the difference between ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mann",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in German, should lay stress on the fact that in this phrase in English \"man\" has only one ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "n",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The connection of this surpassing dignity with humanity has probably deep roots in human nature. The late Professor Fuller saw reference here to the function occupied by Silik-mooloo-Khi as mediator between Hea and mankind, and to the further development of this in the Zoroastrian doctrine of a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sosiosh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or redeemer. The fall investigation of this is beside our present purpose. Daniel 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The giving of the kingdom to the Son of Man. - The judgment does not come to an end with the destruction of the world-power in its various embodiments. That is only its first act, which is immediately followed by the second, the erection of the kingdom of God by the Son of man. This act is introduced by the repetition of the formula, I saw in the night-visions (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (One) like a son of man came in the clouds of heaven. ענני עם, with the clouds, i.e., in connection with them, in or on them as the case may be, surrounded by clouds; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 13:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:64",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He who comes is not named, but is only described according to his appearance like a son of man, i.e., resembling a man (אנשׁ בּר as אדם בן  equals  אנושׁ or אדם). That this was a man is not implied in these words, but only that he was like a man, and not like a beast or some other creature. Now, as the beasts signify not beasts but kingdoms, so that which appeared in the form of a man may signify something else than a human individuum. Following the example of Aben Ezra, Paulus, and Wegscheider, Hofmann (Schriftbew. ii. 1. 80, and 2, p. 582f.), Hitzig, Weisse, Volkmar, Fries (Jahrbb.f. D. Theol. iv. p. 261), Baxmann, and Herzfeld (Gesch. des V. Isr. ii. p. 381) interpret this appearance in the form of a man not of the Messiah, as the Jewish and Christian interpreters in general do, but of the people of Israel, and adduce in support of this view the fact that, in the explanation of the vision, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the kingdom, the dominion, and the power, which according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the son of man received, was given to the people of the saints of the Most High. But ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " affords no valid support to this supposition, for the angel there gives forth his declaration regarding the everlasting kingdom of God, not in the form of an interpretation of Daniel's vision, as in the case of the four beasts in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but he only says that, after the destruction of the horn and its dominion, the kingdom and the power will be given to the people of the saints, because he had before (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. 22) spoken of the blasphemies of the horn against God, and of its war against the saints of the Most High. But the delivering of the kingdom to the people of God does not, according to the prophetic mode of contemplation, exclude the Messiah as its king, but much rather includes Him, inasmuch as Daniel, like the other prophets, knows nothing of a kingdom without a head, a Messianic kingdom without the King Messiah. But when Hofmann further remarks, that \"somewhere it must be seen that by that appearance in the form of a man is meant not the holy congregation of Israel, but an individual, a fifth king, the Messiah,\" Auberlen and Kranichfeld have, with reference to this, shown that, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the saints appear in their multiplicity engaged in war when the person who comes in the clouds becomes visible, and thus that the difference between the saints and that person is distinctly manifest. Hence it appears that the \"coming with the clouds of heaven\" can only be applied to the congregation of Israel, if we agree with Hofmann in the opinion that he who appeared was not carried by the clouds of heaven down to the earth, but from the earth up to heaven, in order that he might there receive the kingdom and the dominion. But this opinion is contradicted by all that the Scriptures teach regarding this matter. In this very chapter before us there is no expression or any intimation whatever that the judgment is held in heaven. No place is named. It is only said that judgment was held over the power of the fourth beast, which came to a head in the horn speaking blasphemies, and that the beast was slain and his body burned. If he who appears as a son of man with the clouds of heaven comes before the Ancient of days executing the judgment on the earth, it is manifest that he could only come from heaven to earth. If the reverse is to be understood, then it ought to have been so expressed, since the coming with the clouds of heaven in opposition to the rising up of the beasts out of the sea very distinctly indicates a coming down from heaven. The clouds are the veil or the \"chariot\" on which God comes from heaven to execute judgment against His enemies; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 97:2-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 19:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This passage forms the foundation for the declaration of Christ regarding His future coming, which is described after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a coming of the Son of man with, in, on the clouds of heaven; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:64",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 18:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Against this, Hofmann, in behalf of his explanation, can only adduce ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in total disregard of the preceding context, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The force of these considerations is also recognised by Hitzig. Since the people of the saints cannot come from heaven, he resorts to the expedient that the Son of man is a \"figure for the concrete whole, the kingdom, the saints - this kingdom comes down from heaven.\" The difficulties of such an idea are very obvious. Fries appears to be of opinion, with Hofmann, that there is an ascension to heaven of the people of the saints; for to him \"clear evidence\" that the \"Son of man\" is the people of Israel lies especially in the words, \"and came to the Ancient of days, and they brought him near before Him,\" which necessitates the adoption of the opposite terminus a quo from Matthew 24:30; Mark 14:62; Revelation 1:7; and hence makes the direct parallelism of Daniel 7:13 with the passages named impossible (?).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The force of these considerations is also recognised by Hitzig. Since the people of the saints cannot come from heaven, he resorts to the expedient that the Son of man is a \"figure for the concrete whole, the kingdom, the saints - this kingdom comes down from heaven.\" The difficulties of such an idea are very obvious. Fries appears to be of opinion, with Hofmann, that there is an ascension to heaven of the people of the saints; for to him \"clear evidence\" that the \"Son of man\" is the people of Israel lies especially in the words, \"and came to the Ancient of days, and they brought him near before Him,\" which necessitates the adoption of the opposite terminus a quo from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:62",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and hence makes the direct parallelism of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with the passages named impossible (?).)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "With all other interpreters, we must accordingly firmly maintain that he who appears with the clouds of heaven comes from heaven to earth and is a personal existence, and is brought before God, who judges the world, that he may receive dominion, majesty, and a kingdom. But in the words \"as a man\" it is not meant that he was only a man. He that comes with the clouds of heaven may, as Kranichfeld rightly observes, \"be regarded, according to current representations, as the God of Israel coming on the clouds, while yet he who appears takes the outward from of a man.\" The comparison (כ, as a man) proves accordingly much more, that this heavenly or divine being was in human form. This \"Son of man\" came near to the Ancient of days, as God appears in the vision of the judgment, Daniel 7:9, and was placed before Him. The subject to הקרבוּהי is undefined; Kran. thinks that it is the clouds just mentioned, others think it is the ministering angels. Analogous passages may be adduced in support of both views: for the first, the νεφέλη ὑπέλαβεν αὐτόν in Acts 1:9; but the parallel passages with intransitive verbs speak more in favour of the impersonal translation, \"they brought him\"  equals  he was brought. The words, \"dominion, and glory, and a kingdom were given to him,\" remind us of the expression used of Nebuchadnezzar, Daniel 2:37., but they are elevated by the description following to the conception of the everlasting dominion of God. God gave to Nebuchadnezzar, the founder and first bearer of the world-power, a kingdom, and might, and majesty, and dominion over all the inhabitants of the earth, men, and beasts, and birds, that he might govern all nations, and tribes, and tongues (Daniel 5:18-19), but not indeed in such a manner as that all nations and tribes should render him religious homage, nor was his dominion one of everlasting duration. These two things belong only to the kingdom of God. פּלח is used in biblical Chaldee only of the service and homage due to God; cf. Daniel 7:27; Daniel 3:12-13, Daniel 3:17., Ezra 7:19, Ezra 7:24. Thus it indicates here also the religious service, the reverence which belong to God, though in the Targg. it corresponds with the Heb. עבד in all its meanings, colere Deum, terram, laborare. Regarding the expression \"nations, tribes, and tongues,\" see under Daniel 7:3, Daniel 7:4. The eternity of the duration of the dominion is in this book the constant predicate of the kingdom of God and His Anointed, the Messiah; cf. Daniel 3:33; Daniel 4:31; Daniel 2:44. For further remarks regarding the Son of man, see at the close of this chapter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With all other interpreters, we must accordingly firmly maintain that he who appears with the clouds of heaven comes from heaven to earth and is a personal existence, and is brought before God, who judges the world, that he may receive dominion, majesty, and a kingdom. But in the words \"as a man\" it is not meant that he was only a man. He that comes with the clouds of heaven may, as Kranichfeld rightly observes, \"be regarded, according to current representations, as the God of Israel coming on the clouds, while yet he who appears takes the outward from of a man.\" The comparison (כ, as a man) proves accordingly much more, that this heavenly or divine being was in human form. This \"Son of man\" came near to the Ancient of days, as God appears in the vision of the judgment, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and was placed before Him. The subject to הקרבוּהי is undefined; Kran. thinks that it is the clouds just mentioned, others think it is the ministering angels. Analogous passages may be adduced in support of both views: for the first, the νεφέλη ὑπέλαβεν αὐτόν in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but the parallel passages with intransitive verbs speak more in favour of the impersonal translation, \"they brought him\"  equals  he was brought. The words, \"dominion, and glory, and a kingdom were given to him,\" remind us of the expression used of Nebuchadnezzar, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., but they are elevated by the description following to the conception of the everlasting dominion of God. God gave to Nebuchadnezzar, the founder and first bearer of the world-power, a kingdom, and might, and majesty, and dominion over all the inhabitants of the earth, men, and beasts, and birds, that he might govern all nations, and tribes, and tongues (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:18-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but not indeed in such a manner as that all nations and tribes should render him religious homage, nor was his dominion one of everlasting duration. These two things belong only to the kingdom of God. פּלח is used in biblical Chaldee only of the service and homage due to God; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 7:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 7:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thus it indicates here also the religious service, the reverence which belong to God, though in the Targg. it corresponds with the Heb. עבד in all its meanings, colere Deum, terram, laborare. Regarding the expression \"nations, tribes, and tongues,\" see under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The eternity of the duration of the dominion is in this book the constant predicate of the kingdom of God and His Anointed, the Messiah; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For further remarks regarding the Son of man, see at the close of this chapter. ",
            "children": []
          }
        ]
      }
    ]
  }
]