[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(26) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The judgment.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The language is similar to that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The destruction of the beast recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here omitted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Unto the end.—Comp. Daniel 6:26.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Unto the end.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 7:26-27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:26-27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But the judgment shall sit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — God, in the course of his providence, will sit (speaking after the manner of men) in judgment on this usurping, tyrannical, and persecuting power, which shall be judged, condemned, degraded, consumed, and destroyed, and his authority never more revived, to the end of the world: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the kingdom and dominion, &c., shall be given to the saints of the Most High",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — True religion shall universally prevail under the countenance and protection of Christian princes; and the kingdom of Christ shall be erected in power and glory in all parts of the earth. In other words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The stone cut out of the mountain without hands shall become itself a mountain, and fill the whole earth: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:44-45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of this chapter. If the reader will be at the pains to compare this vision of Daniel, concerning the four great wild beasts, and the exposition of it by the angel, with Nebuchadnezzar’s dream of the great image, as explained by Daniel, he will be struck with their perfect agreement with each other, and find the one illustrative of the other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:15-28 It is desirable to obtain the right and full sense of what we see and hear from God; and those that would know, must ask by faithful and fervent prayer. The angel told Daniel plainly. He especially desired to know respecting the little horn, which made war with the saints, and prevailed against them. Here is foretold the rage of papal Rome against true Christians. St. John, in his visions and prophecies, which point in the first place at Rome, has plain reference to these visions. Daniel had a joyful prospect of the prevalence of God's kingdom among men. This refers to the second coming of our blessed Lord, when the saints shall triumph in the complete fall of Satan's kingdom. The saints of the Most High shall possess the kingdom for ever. Far be it from us to infer from hence, that dominion is founded on grace. It promises that the gospel kingdom shall be set up; a kingdom of light, holiness, and love; a kingdom of grace, the privileges and comforts of which shall be the earnest and first-fruits of the kingdom of glory. But the full accomplishment will be in the everlasting happiness of the saints, the kingdom that cannot be moved. The gathering together the whole family of God will be a blessedness of Christ's coming.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus he said ... - That is, in explanation of the fourth symbol which appeared - the fourth beast, and of the events connected with his appearing. This explanation embraces the remainder of the chapter; and as the whole subject appeared difficult and momentous to Daniel before the explanation, so it may be said to be in many respects difficult, and in all respects momentous still. It is a question on which expositors of the Scriptures are by no means agreed, to what it refers, and whether it has been already accomplished, or whether it extends still into the future; and it is of importance, therefore, to determine, if possible, what is its true meaning. The two points of inquiry which are properly before us are, first, What do the words of explanation as used by the angel fairly imply - that is, what, according to the fair interpretation of these words, would be the course of events referred to, or what should we naturally expect to find as actually occurring on the earth in the fulfillment of this? and, secondly, To what events the prophecy is actually to be applied - whether to what has already occurred, or what is yet to occur; whether we can find anything in what is now past which would be an accomplishment of this, or whether it is to be applied to events a part of which are yet future? This will lead us into a statement of the points which it is affirmed would occur in regard to this kingdom: and then into an inquiry respecting the application.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What is fairly implied in the explanation of the angel? This would embrace the following points:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) There was to be a fourth kingdom on the earth: \"the fourth beast shall be the fourth kingdom upon earth,\" Daniel 7:23. This was to succeed the other three, symbolized by the lion, the bear, and the leopard. No further reference is made to them, but the characteristics of this are fully stated. Those characteristics, which have been explained in the notes at Daniel 7:7, are, as here repeated,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) There was to be a fourth kingdom on the earth: \"the fourth beast shall be the fourth kingdom upon earth,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This was to succeed the other three, symbolized by the lion, the bear, and the leopard. No further reference is made to them, but the characteristics of this are fully stated. Those characteristics, which have been explained in the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are, as here repeated,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) that it would be in important respects different from the others;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) that it would devour, or subdue the whole earth;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) that it would tread it down and break it in pieces; that is, it would be a universal dynasty, of a fierce and warlike character, that would keep the whole world subdued and subject by power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) out of this sovereignty or dominion, ten powers would arise Daniel 7:24 : \"and the ten horns out of this kingdom are ten kings that shall arise.\" Compare the notes at Daniel 7:7. That is, they would spring out of this one dominion, or it would be broken up into these minor sovereignties, yet all manifestly springing from the one kingdom, and wielding the same power. We should not naturally look for the fulfillment of this in a succession of kings, for that would have been symbolized by the beast itself representing the entire dominion or dynasty, but rather to a number of contemporaneous powers that had somehow sprung out of the one power, or that now possessed and wielded the power of that one dominion. If the kingdom here referred to should be broken up into such a number of powers, or if in any way these powers became possessed of this authority, and wielded it, such a fact would express what we are to expect to find in this kingdom.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) out of this sovereignty or dominion, ten powers would arise ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"and the ten horns out of this kingdom are ten kings that shall arise.\" Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That is, they would spring out of this one dominion, or it would be broken up into these minor sovereignties, yet all manifestly springing from the one kingdom, and wielding the same power. We should not naturally look for the fulfillment of this in a succession of kings, for that would have been symbolized by the beast itself representing the entire dominion or dynasty, but rather to a number of contemporaneous powers that had somehow sprung out of the one power, or that now possessed and wielded the power of that one dominion. If the kingdom here referred to should be broken up into such a number of powers, or if in any way these powers became possessed of this authority, and wielded it, such a fact would express what we are to expect to find in this kingdom.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) From the midst of these sovereignties or kingdoms there was to spring up another one of peculiar characteristics, Daniel 7:24-25. These characteristics are the following:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) From the midst of these sovereignties or kingdoms there was to spring up another one of peculiar characteristics, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:24-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". These characteristics are the following:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) That it would spring out of the others, or be, as it were, one form of the administration of the same power - as the eleventh horn sprang from the same source as the ten, and we are, therefore, to look for the exercise of this power somehow in connection with the same kingdom or dynasty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) This would not spring up contemporaneously with the ten, but would arise \"after them\" - and we are to look for the power as in some sense succeeding them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) It would be small at first - as was the horn Daniel 7:8, and we are to look for the fulfillment in some power that would be feeble at first.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) It would be small at first - as was the horn ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and we are to look for the fulfillment in some power that would be feeble at first.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) It would grow to be a mighty power for the little horn became so powerful as to pluck up three of the others Daniel 7:8, and it is said in the explanation Daniel 7:24, that he would subdue three of the kings.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) It would grow to be a mighty power for the little horn became so powerful as to pluck up three of the others ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and it is said in the explanation ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that he would subdue three of the kings.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) It would subdue \"three kings;\" that is, three of the ten, and we are to look for the fulfillment in some manifestation of that power by which, either literally three of them were overthrown, or by which about one-third of their power was taken away. The mention of the exact number of \"three,\" however, would rather seem to imply that we are to expect some such exact fulfillment, or some prostration of three sovereignties by the new power that would arise.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) It would be proud, and ambitious, and particularly arrogant against God: \"and he shall speak great words against the Most High,\" Daniel 7:25. The Chaldee here rendered against - לצד  letsad - means, literally, at, or against the part of it, and then against. Vulgate contra; Greek πρὸς  pros. This would be fulfilled in one who would blaspheme God directly; or who would be rebellious against his government and authority; or who would complain of his administration and laws; or who would give utterance to harsh and reproachful words against his real claims. It would find a fulfillment obviously in an open opposer of the claims and the authority of the true God; or in one the whole spirit and bearing of whose pretensions might be fairly construed as in fact an utterance of great words against him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) It would be proud, and ambitious, and particularly arrogant against God: \"and he shall speak great words against the Most High,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Chaldee here rendered against - לצד  letsad - means, literally, at, or against the part of it, and then against. Vulgate contra; Greek πρὸς  pros. This would be fulfilled in one who would blaspheme God directly; or who would be rebellious against his government and authority; or who would complain of his administration and laws; or who would give utterance to harsh and reproachful words against his real claims. It would find a fulfillment obviously in an open opposer of the claims and the authority of the true God; or in one the whole spirit and bearing of whose pretensions might be fairly construed as in fact an utterance of great words against him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26. consume … destroy—a twofold operation. Antichrist is to be gradually \"consumed,\" as the Papacy has been consuming for four hundred years past, and especially of late years. He is also to be \"destroyed\" suddenly by Christ at His coming; the fully developed man of sin (2Th 2:3) or false prophet making a last desperate effort in confederacy with the \"beast\" (Re 16:13, 14, 16) or secular power of the Roman empire (some conjecture Louis Napoleon): destroyed at Armageddon in Palestine.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But the judgment shall sit,.... As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the court shall sit, the Judge shall take the bench, and all things be prepared for the arraignment, trial, condemnation, and punishment, of the little horn or antichrist, when the above time is up; God the Father, the Ancient of days, and Christ, said to be like the Son of man, brought near to him, shall sit as Judges, attended by the holy angels: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall take away his dominion, to consume and to destroy it unto the end; either the angels, or rather the saints of the most High; particularly the Christian princes, into whose hearts God will put it to hate the whore, eat her flesh, and burn her with fire; so that there shall be an utter end of antichrist; he shall be stripped of all his power and authority; his destruction will be inevitable and irrecoverable; he shall never come out of it; it shall continue to the end of the world, to the end of time. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they shall take away his dominion, to consume and to destroy it unto the end; either the angels, or rather the saints of the most High; particularly the Christian princes, into whose hearts God will put it to hate the whore, eat her flesh, and burn her with fire; so that there shall be an utter end of antichrist; he shall be stripped of all his power and authority; his destruction will be inevitable and irrecoverable; he shall never come out of it; it shall continue to the end of the world, to the end of time. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But the {r} judgment shall sit, and they shall take away his dominion, to consume and to destroy it unto the end.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{r}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " judgment shall sit, and they shall take away his dominion, to consume and to destroy ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " unto the end.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) God by his power will restore things that were out of order, and destroy this little horn in such a way that it will never rise up again.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the judgement shall sit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 7:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " b, 11b.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they shall take away his dominion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his dominion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall be taken away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 7:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "destroy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "cause it to perish even unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the end",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. finally, for ever. ‘Even unto the end,’ as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "26–27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At the end of 3½ years his power will be taken away from him; and the persecuted saints will receive the kingdom of the entire world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Daniel 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this judgment is described (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but only as to its consequences for the world-power. The dominion of the horn in which the power of the fourth beast culminates is taken away and altogether annihilated. The destruction of the beast is here passed by, inasmuch as it is already mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; while, on the other hand, that which is said (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") about the taking away of its power and its dominion is strengthened by the inf. להשׁמדה (to destroy), וּלהובדה (and to consume), being added to יהעדּוּן (they shall take away), to which שׁלטנהּ (his dominion) is to be repeated as the object. סופא עד, to the end, i.e., not absolutely, but, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the end of the days, i.e., for ever.",
        "children": []
      }
    ]
  }
]