[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A leopard.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—More correctly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a panther.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " On the great vigilance and swiftness of the panther, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The third beast corresponds to the copper belly and thighs of the image (Daniel 2). It should be noticed that as unity characterises the first beast, and duality the second, so quadruplicity marks the third. It has four wings—wings as of a bird, not of an eagle—by which a degree of swiftness is implied inferior to that of the first beast. It has four heads, indicating four kingdoms, into which the third kingdom should develop itself. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same predominance of the number “four” is to be observed.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 7:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "After this I beheld, and lo, another like a leopard — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“This third kingdom is that of the Macedonians, or Grecians, who, under the command of Alexander the Great, overcame the Persians, and reigned next after them: and it is fitly compared to a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "leopard ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "upon several accounts. The leopard is remarkable for swiftness, and Alexander and the Macedonians were amazingly swift and rapid in their conquests. The leopard is a spotted animal, and so was a proper emblem, according to Bochart, of the different manners of the nations which Alexander commanded; or, according to Grotius, of the various manners of Alexander himself, who was sometimes merciful, and sometimes cruel; sometimes temperate, and sometimes drunken; sometimes abstemious, and sometimes incontinent. The leopard, as Bochart observes, is of small stature, but of great courage, so as not to be afraid to engage with the lion and the larger beasts; and so Alexander, a little king, in comparison, of small stature too, and with a small army, dared to attack the king of kings, that is, Darius, whose kingdom was extended from the Ægean sea to the Indies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Which had upon the back of it four wings of a fowl — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Babylonian empire was represented with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "wings, but this is described with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "four. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For, as Jerome says, nothing was swifter than the victories of Alexander, who ran through all the countries from Illyricum and the Adriatic sea to the Indian ocean and the river Ganges, not so much fighting as conquering; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "six ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "years (he should have said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "twelve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") subjugated part of Europe and all Asia to himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The beast had also four heads ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To denote the four kingdoms into which this same third kingdom should be divided, as it was after the death of Alexander, among his four captains; Cassander reigning over Macedon and Greece, Lysimachus over Thrace and Bithynia, Ptolemy over Egypt, and Seleucus over Syria. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And dominion was given to it — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which shows, as Jerome observes, that it was not owing to the fortitude of Alexander, but proceeded from the will of the Lord. And, indeed, unless he had been directed, preserved, and assisted by the mighty power of God, how could Alexander, with thirty thousand men, have overcome Darius with six hundred thousand, and in so short a time have brought all the countries, from Greece as far as to India, into subjection.” — Bishop Newton.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:1-8 This vision contains the same prophetic representations with Nebuchadnezzar's dream. The great sea agitated by the winds, represented the earth and the dwellers on it troubled by ambitious princes and conquerors. The four beasts signified the same four empires, as the four parts of Nebuchadnezzar's image. Mighty conquerors are but instruments of God's vengeance on a guilty world. The savage beast represents the hateful features of their characters. But the dominion given to each has a limit; their wrath shall be made to praise the Lord, and the remainder of it he will restrain.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After this I beheld, and, lo, another, like a leopard - That is, as before, after the bear had appeared - indicating that this was to be a succeeding kingdom or power. The beast which now appeared was a monster, and, as in the former cases, so in regard to this, there are several circumstances which demand explanation in order to understand the symbol. It may assist us, perhaps, in forming a correct idea of the symbol here introduced to have before us a representation of the animal as it appeared to Daniel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The animal itself: \"a leopard.\" The word used here - נמר  nemar - or in Hebrew נמר  nâmêr - denotes a panther or leopard, so called from his spots. This is a well-known beast of prey, distinguished for blood-thirstiness and cruelty, and these characteristics are especially applicable to the female panther. The animal is referred to in the Scriptures as emblematic of the following things, or as having the following characteristics:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) As next in dignity to the lion - of the same general nature. Compare Bochart, Hieroz. P. I. lib. iii. c. vii. Thus the lion and the panther, or leopard, are often united in the Scriptures. Compare Jeremiah 5:6; Hosea 13:7. See also in the Apocrypha, Ecclesiasticus 28:23. So also they are united in Homer, r",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) As next in dignity to the lion - of the same general nature. Compare Bochart, Hieroz. P. I. lib. iii. c. vii. Thus the lion and the panther, or leopard, are often united in the Scriptures. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See also in the Apocrypha, Ecclesiasticus 28:23. So also they are united in Homer, r",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Ὄυτε οἶν παρδάλιος τόσσον μένος, ὄυτε λέοντος.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Oute oun pardalios tosson menos, oute leontos.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Neither had the leopard nor the lion such strength.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) As distinguished for cruelty, or a fierce nature, as contrasted with the gentle and tame animal. Isaiah 11:6, \"and the leopard shall lie down with the kid.\" In Jeremiah 5:6, it is compared with the lion and the wolf: \"A lion out of the forest shall slay them, and a wolf of the evenings shall spoil them, a leopard shall watch over their cities.\" Compare Hosea 13:7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) As distinguished for cruelty, or a fierce nature, as contrasted with the gentle and tame animal. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"and the leopard shall lie down with the kid.\" In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is compared with the lion and the wolf: \"A lion out of the forest shall slay them, and a wolf of the evenings shall spoil them, a leopard shall watch over their cities.\" Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) As distinguished for swiftness or fleetness. Habakkuk 1:8 : \"their horses are swifter than the leopards.\" Compare also the quotations from the classics in Bochart as above, p. 788. His fleetness is often referred to - the celerity of his spring or bound especially - by the Greek and Roman writers.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) As distinguished for swiftness or fleetness. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"their horses are swifter than the leopards.\" Compare also the quotations from the classics in Bochart as above, p. 788. His fleetness is often referred to - the celerity of his spring or bound especially - by the Greek and Roman writers.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) As insidious, or as lying in wait, and springing unexpectedly upon the unwary traveler. Compare Hosea 13:7 : \"As a leopard by the way will I observe them;\" that is, I will \"watch\" (אשׁור  'âshûr) them. So Pliny says of leopards: Insidunt pardi condensa arborurn, occultatique earurn ramis in prcetereuntia desiliunt.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) As insidious, or as lying in wait, and springing unexpectedly upon the unwary traveler. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"As a leopard by the way will I observe them;\" that is, I will \"watch\" (אשׁור  'âshûr) them. So Pliny says of leopards: Insidunt pardi condensa arborurn, occultatique earurn ramis in prcetereuntia desiliunt.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) They are characterized by their spots. In the general nature of the animal there is a strong resemblance to the lion. Thus, an Arabic writer quoted by Bochart, deflates the leopard to be \"an animal resembling the lion, except that it is smaller, and has a skin marked by black spots.\" The proper idea in this representation, when used as a symbol, would be of a nation or kingdom that would have more nobleness than the one represented by the bear, but a less decisive headship over others than that represented by the lion; a nation that, was addicted to conquest, or that preyed upon others; a nation rapid in its movements, and springing upon others unawares, and perhaps in its spots denoting a nation or people made up, not of homogeneous elements, but of various different people. See below in the application of this.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) The four wings: which had upon the back of it four wings of a fowl. The first beast was seen with the wings of an eagle, but without any specified number; this appears with wings, but without specifying any particular kind of wings, though the number is mentioned. In both of them celerity of movement is undoubtedly intended - celerity beyond what would be properly denoted by the animal itself the lion or the leopard. If there is a difference in the design of the representation, as there would seem to be by mentioning the kind of wings in the one case, and the number in the other, it is probable that the former would denote a more bold and extended flight; the latter a flight more rapid, denoted by the four wings. We should look for the fulfillment of the former in a nation that extended its conquests over a broader space; in the latter, to a nation that moved with more celerity. But there is some danger of pressing these similitudes too far. Nothing is said in the passage about the arrangement of the wings, except that they were on the back of the animal. It is to be supposed that there were two on each side.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The four heads: \"the beast had also four heads.\" This representation must have been designed to signify either that the one power or kingdom denoted by the leopard was composed of four separate powers or nations now united in one; or that there were four successive kings or dynasties that made up its history; or that the power or kingdom actually appeared, as seen in its prevailing characteristic, as a distinct dominion, as having four heads, or as being divided into so many separate sovereignties. It seems to me that either one of these would be a proper and natural fulfillment of the design of the image, though the second suggested would be less proper than either of the others, as the heads appeared on the animal not in succession - as the little horn sprung up in the midst of the other ten, as represented in the fourth beast - but existed simultaneously. The general idea would be, that in some way the one particular sovereignty had four sources of power blended into one, or actually exerted the same kind of dominion, and constituted, in fact, the one kingdom as distinguished from the others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) The dominion given to it: \"and dominion was given to it.\" That is, it was appointed to rule where the former had ruled, and until it should be succeeded by another - the beast with the ten horns.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In regard to the application of this, though the angel did not explain it to Daniel, except in general that a kingdom was represented by it. Daniel 7:17, it would seem that there could be little difficulty, though there has been some variety in the views entertained. Maurer, Lengerke, and some others, refer it to the Medo-Persian empire - supposing that the second symbol referred to the kingdom of Media. But the objections to this are so obvious, and so numerous, that it seems to me the opinion cannot be entertained, for",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In regard to the application of this, though the angel did not explain it to Daniel, except in general that a kingdom was represented by it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it would seem that there could be little difficulty, though there has been some variety in the views entertained. Maurer, Lengerke, and some others, refer it to the Medo-Persian empire - supposing that the second symbol referred to the kingdom of Media. But the objections to this are so obvious, and so numerous, that it seems to me the opinion cannot be entertained, for",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. leopard—smaller than the lion; swift (Hab 1:8); cruel (Isa 11:6), the opposite of tame; springing suddenly from its hiding place on its prey (Ho 13:7); spotted. So Alexander, a small king, of a small kingdom, Macedon, attacked Darius at the head of the vast empire reaching from the Ægean Sea to the Indies. In twelve years he subjugated part of Europe, and all Asia from Illyricum and the Adriatic to the Ganges, not so much fighting as conquering [Jerome]. Hence, whereas Babylon is represented with two wings, Macedon has four, so rapid were its conquests. The various spots denote the various nations incorporated into his empire [Bochart]; or Alexander's own variation in character, at one time mild, at another cruel, now temperate, and now drunken and licentious.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "four heads—explained in Da 8:8, 22; the four kingdoms of the Diadochi or \"successors\" into which the Macedonian empire was divided at the death of Alexander, namely, Macedon and Greece under Cassander, Thrace and Bithynia under Lysimachus, Egypt under Ptolemy, and Syria under Seleucus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "dominion … given to it—by God; not by Alexander's own might. For how unlikely it was that thirty thousand men should overthrow several hundreds of thousands! Josephus [Antiquities, 11.6] says that Alexander adored the high priest of Jerusalem, saying that he at Dium in Macedonia had seen a vision of God so habited, inviting him to go to Asia, and promising him success.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "leopard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was the Grecian monarchy; a leopard is less than a lion, so was this monarchy at first, but yet durst fight with a lion; so did Alexander encounter Darius with a force very small to the other. A ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "leopard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also for his swiftness; therefore described with ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "four wings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on his back. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The beast had also four heads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because his commanders that succeeded him were four of his chief commanders, that divided that empire into four parts between them; and these were the four heads to whom dominion was given, Ptolemy, Seleucus, Philippus, Antigonus, or, as others, Perdiccas and Meleager, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 8:21,22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Dominion was given to it: Alexander did this by the mighty power of God; else how could he conquer Darius, that had six hundred thousand, with thirty thousand, and in so short a time go conqueror over Asia to the East Indies, I mean that part which now the Mogul possesseth, where he fought with Porus and beat him? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After this I beheld, and, lo another, like a leopard,.... Another beast, another monarchy, a third monarchy succeeding the Persian monarchy, and which rose up on the ruins of that; Darius king of the Persians being beaten by Alexander king of Macedon, who was the instrument of setting up the Grecian monarchy here intended; compared to a leopard, a smaller creature than a lion; signifying that this monarchy arose from a small beginning; and a crafty one, Alexander having many wise counsellors of his father's about him, though he himself was rash and hasty; and a spotted one, denoting the various virtues and vices of Alexander, and his inconstancy in them; sometimes exercising the one, and sometimes the other; or rather the different nations, and the manners of them, he conquered, of which this empire consisted; not to say anything of the cruelty and swiftness of this creature, which are both to be observed in this conqueror: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which had upon the back of it four wings of a fowl; denoting the swiftness of Alexander in his conquests; who in a few years made himself master of the whole world, at least as he thought, whose empire was greater than that of Nebuchadnezzar and the Chaldeans, to whom only two wings of an eagle are given, Daniel 7:4. Says Jerom, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "which had upon the back of it four wings of a fowl; denoting the swiftness of Alexander in his conquests; who in a few years made himself master of the whole world, at least as he thought, whose empire was greater than that of Nebuchadnezzar and the Chaldeans, to whom only two wings of an eagle are given, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Says Jerom, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"nothing was more swift than the conquest of Alexander, from Illyricum and the Adriatic sea, unto the Indian ocean, and the river Ganges; he rather ran through the world by victories than by battles, and in six years subdued part of Europe, all Asia even unto India,'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to which may be added all Egypt, Syria, and Palestine. Arimazes being master of a rock in Sogdiana, which was thought inaccessible and impregnable, Alexander sent a messenger to him to demand the delivery of it to him; but, among other things he proudly said, he asked the messenger, with a sneer, if Alexander could fly; which, when the messenger reported, nettled him much, that he should be insulted because he had not wings; and vowed that the next night he would make him believe that the Macedonians did fly; and accordingly they found ways and means to get to the top of it, which, when the governor saw, he declared that Alexander's soldiers had wings (f): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the beast also had four heads; which signify the four kingdoms into which the Grecian empire was divided after Alexander's death, under four of his generals, who were heads or governors of them: Macedonia under Antipater, or, as others, Cassander; Egypt under Ptolemy; Syria under Seleucus; and Asia under Antigonus, or, as others, Lysimachus: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and dominion was given to it; the dominion of the whole world, or, however, a very large dominion; and this was given of God, and according to his will, and the ordering of his providence; for to nothing else can it be ascribed, that with thirty thousand men Alexander should beat an army of six hundred thousand; and with such a handful of men subdue so many kingdoms and nations, and that in the space of a few years. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Curt. Hist. l. 7. c. 11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Curt. Hist. l. 7. c. 11. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "After this I beheld, and lo another, like a {h} leopard, which had upon the back of it {i} four wings of a fowl; the beast had also four heads; and {k} dominion was given to it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "After this I beheld, and lo another, like a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " leopard, which had upon the back of it ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " four wings of a fowl; the beast had also four heads; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " dominion was given to it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Meaning Alexander the king of Macedonia.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) That is, his four chief captains, which had the empire among them after his death. Selencus had Asia the great, Antigonus the less, Cassander and after him Antipater was king of Macedonia, and Ptolemeus had Egypt.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) It was not of himself nor of his own power that he gained all these countries: for his army contained only thirty thousand men, and he overcame in one battle Darius, who had one million, when he was so heavy with sleep that his eyes were hardly open, as the stories report: therefore this power was given to him from God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The third beast. A leopard.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon the back of it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Aram. word means both ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "back",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "side",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and, as the Heb. text (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "K’tib",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") has the mark of the plural, perhaps we ought to render ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "on its sides",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so Bevan, Behrmann).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of a fowl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e., as we should now say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "bird",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The leopard is a fierce, carnivorous animal, remarkable for the swiftness and agility of its attack (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the horses of the Chaldæans are said to be ‘swifter than leopards’). It is particularly dangerous to cattle; and “specially noted for the patience with which it waits, extended on the branch of a tree, or a rock near a watering place, expecting its prey, on which it springs with a deadly precision. Hence ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘as a leopard by the way will I observe them’; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” (G. E. Post, in Hastings’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dict. of the Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", s. v.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Here the four wings upon the leopard’s back indicate that it is invested with more than ordinary agility of movement; while the four heads, looking, it may be presumed, towards the four quarters of the earth, are meant apparently to indicate that the empire which it symbolised was to extend in every direction[270]. It was thus a fit emblem of the Persian empire, the founder of which, Cyrus, astonished the world by the extent and rapidity of his conquests.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[270] So at least Keil, Meinhold, Behrmann. Others, however, as von Lengerke, Ew., Hitz., Delitzsch, Kuenen, Bevan, Prince, think that the four heads denote the four kings of Persia referred to in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and dominion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "given to it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] emphasizing the vastness of its rule: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the corresponding empire is described as ‘ruling over all the earth.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "After this I beheld, and lo another, like a leopard, which had upon the back of it four wings of a fowl; the beast had also four heads; and dominion was given to it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The LXX. rendering is shorter, \"And after these things I saw another beast, like a leopard, and four wings stretched over it (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐπέτεινον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and there were four heads to the beast.\" The grammar of this is difficult to understand. As it stands, it must be translated as above; if, however, we might read ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐπὶτεινον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", we should avoid the solecism of uniting a neuter plural to a plural verb, rendering, \"and it stretched,\" etc. Paulus Tellensis renders as above, and adds a clause, \"and a tongue was given to it\" - a reading to all appearance due to the transposal of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "שׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is difficult, on the present text, to explain how the LXX. rendered \"wings of a fowl,\" \"stretched over it.\" If, however, the original word were that used in the Peshitta,  (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "paehatha",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it is explicable that this should have been read ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "פְרַשׁוּ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Theodotion and the Peshitta do not differ from the Massoretic text. The majority of critical commentators maintain this to be the Persian Empire. A leopard is a less animal than a bear, and therefore, according to the argument these critics used with regard to the second empire, it ought to mean that it symbolized a still smaller empire. That, however, is impossible. No Jew of the age of the Maccabees could have been under that impression. Moreover, we have the four wings declared to mean that the Persian power extended to all quarters of the world, and attention is directed to the fact that the statement is made concerning it, \"dominion was given to it.\" This assumes, what would be admitted by everybody to be contrary to fact, had the critics  not a further conclusion in view. The traditional interpretation is that the Hellenic Empire - that of Alexander the Great and his successors - is intended here. In defence of this we have the fact that four, as we have just said, is the numerical sign of the Greek power. In the following chapter we have the goat, with its one notable horn, which, on being broken off, is replaced by four. In the eleventh chapter we are told that Alexander's empire is to be divided to the four winds of heaven. But \"wings\" are not prophetically so much the symbol of extensive dominion, as of rapidity of movement. If Nebuchadnezzar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is a great eagle with long wings, it is because of the rapidity of his conquests. Jeremiah says of his horses, they are \"swifter than eagles.\" Again in Lamentations, \"Our persecutors are swifter than eagles.\" Wings, then, symbolize swiftness of motion. If we turn to the next chapter, the swiftness of Alexander's conquests is the point that most impresses the seer. Swiftness, compared either with the conquests of Nebuchadnezzar or of Alexander, was not the characteristic of the Persian conquests. Cyrus, in the course of thirty years, had subdued Asia Minor, probably Armenia; had relieved Media, Elam, and Persia from the alien yoke of the Manda; and had conquered Babylon. Nebuchadnezzar, after the battle of Carehemish, had advanced to the river of Egypt. We do not know the extent and direction of his many campaigns, but rapidity of movement characterized some of them we do know, and Alexander's conquests were made with extreme rapidity. Altogether the figure seems much more suitable for the empire of Alexander than for that of the Persians. Daniel 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The third beast, which Daniel saw after the second, was like a panther (leopard), which is neither so kingly as the lion nor so strong as the bear, but is like to both in rapacity, and superior to them in the springing agility with which it catches its prey; so that one may say, with Kliefoth, that in the subordination of the panther to the lion and the bear, the same gradation is repeated as that this is found (of the third kingdom) in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the copper (brass). Of the panther it is said, that it had four wings of a fowl and four heads. The representation of the beast with four wings increases the agility of its movements to the speed of the flight of a bird, and expresses the thought that the kingdom represented by that beast would extend itself in flight over the earth; not so royally as Nebuchadnezzar, - for the panther has not eagle's wings, but only the wings of a fowl, - but extending to all the regions of the earth, for it has four wings. At the same time the beast has four heads, not two only, as one might have expected with four wings. The number four thus shows that the heads have an independent signification, and do not stand in relation to the four wings, symbolizing the spreading out of the kingdom into the four quarters of the heavens (Bertholdt, Hv., Kran.). As little do the four wings correspond with the four heads in such a way that by both there is represented only the dividing of the kingdom into four other kingdoms (Hv.. Comment., Auberl.). Wings are everywhere an emblem of rapid motion; heads, on the contrary, where the beast signifies a kingdom, are the heads of the kingdom, i.e., the kings or rulers: hence it follows that the four heads of the panther are the four successive Persian kings whom alone Daniel knows (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Without regard to the false interpretations of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on which this opinion rests, it is to be noticed that the four heads do not rise up one after another, but that they all exist contemporaneously on the body of the beast, and therefore can only represent four contemporary kings, or signify that this kingdom is divided into four kingdoms. That the four wings are mentioned before the four heads, signifies that the kingdom spreads itself over the earth with the speed of a bird's flight, and then becomes a fourfold-kingdom, or divides itself into four kingdoms, as is distinctly shown in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - The last statement, and dominion was given to it, corresponds with that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it shall bear rule over all the earth, i.e., shall found an actual and strong world-empire.",
        "children": []
      }
    ]
  }
]