[[],[{"type":"header","content":"Absalom’s Defeat and Death"},{"type":"prose","content":"David now mustered the men who were with him and appointed generals and captains to lead them."}],[{"type":"prose","content":"He sent the troops out in three groups, placing one group under Joab, one under Joab’s brother Abishai son of Zeruiah, and one under Ittai, the man from Gath. The king told his troops, “I am going out with you.”"}],[{"type":"prose","content":"But his men objected strongly. “You must not go,” they urged. “If we have to turn and run—and even if half of us die—it will make no difference to Absalom’s troops; they will be looking only for you. You are worth 10,000 of us, and it is better that you stay here in the town and send help if we need it.”"}],[{"type":"prose","content":"“If you think that’s the best plan, I’ll do it,” the king answered. So he stood alongside the gate of the town as all the troops marched out in groups of hundreds and of thousands."}],[{"type":"prose","content":"And the king gave this command to Joab, Abishai, and Ittai: “For my sake, deal gently with young Absalom.” And all the troops heard the king give this order to his commanders."}],[{"type":"prose","content":"So the battle began in the forest of Ephraim,"}],[{"type":"prose","content":"and the Israelite troops were beaten back by David’s men. There was a great slaughter that day, and 20,000 men laid down their lives."}],[{"type":"prose","content":"The battle raged all across the countryside, and more men died because of the forest than were killed by the sword."}],[{"type":"prose","content":"During the battle, Absalom happened to come upon some of David’s men. He tried to escape on his mule, but as he rode beneath the thick branches of a great tree, his hair got caught in the tree. His mule kept going and left him dangling in the air."}],[{"type":"prose","content":"One of David’s men saw what had happened and told Joab, “I saw Absalom dangling from a great tree.”"}],[{"type":"prose","content":"“What?” Joab demanded. “You saw him there and didn’t kill him? I would have rewarded you with ten pieces of silver and a hero’s belt!”"}],[{"type":"prose","content":"“I would not kill the king’s son for even a thousand pieces of silver,” the man replied to Joab. “We all heard the king say to you and Abishai and Ittai, ‘For my sake, please spare young Absalom.’"}],[{"type":"prose","content":"And if I had betrayed the king by killing his son—and the king would certainly find out who did it—you yourself would be the first to abandon me.”"}],[{"type":"prose","content":"“Enough of this nonsense,” Joab said. Then he took three daggers and plunged them into Absalom’s heart as he dangled, still alive, in the great tree."}],[{"type":"prose","content":"Ten of Joab’s young armor bearers then surrounded Absalom and killed him."}],[{"type":"prose","content":"Then Joab blew the ram’s horn, and his men returned from chasing the army of Israel."}],[{"type":"prose","content":"They threw Absalom’s body into a deep pit in the forest and piled a great heap of stones over it. And all Israel fled to their homes."}],[{"type":"prose","content":"During his lifetime, Absalom had built a monument to himself in the King’s Valley, for he said, “I have no son to carry on my name.” He named the monument after himself, and it is known as Absalom’s Monument to this day."},{"type":"header","content":"David Mourns Absalom’s Death"}],[{"type":"prose","content":"Then Zadok’s son Ahimaaz said, “Let me run to the king with the good news that the  has rescued him from his enemies.”"}],[{"type":"prose","content":"“No,” Joab told him, “it wouldn’t be good news to the king that his son is dead. You can be my messenger another time, but not today.”"}],[{"type":"prose","content":"Then Joab said to a man from Ethiopia, “Go tell the king what you have seen.” The man bowed and ran off."}],[{"type":"prose","content":"But Ahimaaz continued to plead with Joab, “Whatever happens, please let me go, too.”“Why should you go, my son?” Joab replied. “There will be no reward for your news.”"}],[{"type":"prose","content":"“Yes, but let me go anyway,” he begged.Joab finally said, “All right, go ahead.” So Ahimaaz took the less demanding route by way of the plain and ran to Mahanaim ahead of the Ethiopian."}],[{"type":"prose","content":"While David was sitting between the inner and outer gates of the town, the watchman climbed to the roof of the gateway by the wall. As he looked, he saw a lone man running toward them."}],[{"type":"prose","content":"He shouted the news down to David, and the king replied, “If he is alone, he has news.”As the messenger came closer,"}],[{"type":"prose","content":"the watchman saw another man running toward them. He shouted down, “Here comes another one!”The king replied, “He also will have news.”"}],[{"type":"prose","content":"“The first man runs like Ahimaaz son of Zadok,” the watchman said.“He is a good man and comes with good news,” the king replied."}],[{"type":"prose","content":"Then Ahimaaz cried out to the king, “Everything is all right!” He bowed before the king with his face to the ground and said, “Praise to the  your God, who has handed over the rebels who dared to stand against my lord the king.”"}],[{"type":"prose","content":"“What about young Absalom?” the king demanded. “Is he all right?”Ahimaaz replied, “When Joab told me to come, there was a lot of commotion. But I didn’t know what was happening.”"}],[{"type":"prose","content":"“Wait here,” the king told him. So Ahimaaz stepped aside."}],[{"type":"prose","content":"Then the man from Ethiopia arrived and said, “I have good news for my lord the king. Today the  has rescued you from all those who rebelled against you.”"}],[{"type":"prose","content":"“What about young Absalom?” the king demanded. “Is he all right?”And the Ethiopian replied, “May all of your enemies, my lord the king, both now and in the future, share the fate of that young man!”"}],[{"type":"prose","content":"The king was overcome with emotion. He went up to the room over the gateway and burst into tears. And as he went, he cried, “O my son Absalom! My son, my son Absalom! If only I had died instead of you! O Absalom, my son, my son.”"}]]