[{"num":18,"verse":"And Dovid mustered HaAm that were with him, and set sarei alafim, and sarei me’ot over them."},{"num":2,"verse":"And Dovid sent forth a third part of the people under the yad Yoav, and a third part under the yad Avishai Ben Tzeruyah (Yoav’s brother), and a third part under the yad Ittai the Gitti. And HaMelech said unto HaAm, I will surely go forth with you myself also."},{"num":3,"verse":"But HaAm answered, Thou shalt not go forth; for if we flee away, they will not set their lev on us; neither if half of us die, will they set their lev on us; but now thou art worth ten thousand of us; therefore, now it is better that thou support us from the Ir [i.e., Machanayim]."},{"num":4,"verse":"And HaMelech said unto them, What seemeth you best I will do. And HaMelech stood by the side of the sha’ar, and kol haAm came out by hundreds and by thousands."},{"num":5,"verse":"And HaMelech commanded Yoav and Avishai and Ittai, saying, Deal gently for my sake with the na’ar, even with Avshalom. And kol HaAm heard when HaMelech gave all the sarim charge concerning Avshalom."},{"num":6,"verse":"HaAm went into the sadeh against Yisroel; the milchamah was in ya’ar (forest) of Ephrayim;"},{"num":7,"verse":"Where Am Yisroel were slain before the avadim of Dovid, and there was there a magefah gedolah that day of esrim elef."},{"num":8,"verse":"For the milchamah was there scattered over the face of kol ha’aretz; and the ya’ar devoured more people that day than the cherev devoured."},{"num":9,"verse":"And Avshalom met the avadim of Dovid. And Avshalom rode upon a pered (mule), and the pered went under the thick boughs of a great oak, and his rosh (head) caught hold of elah (tree, oak), and he was suspended between HaShomayim and ha’aretz; the pered under him went on."},{"num":10,"verse":"And a certain ish saw it, told Yoav, and said, Hinei, I saw Avshalom [ben Dovid] talui (hanged) b’elah (on a tree, oak) [ZECHARYAH 12:10]."},{"num":11,"verse":"And Yoav said unto the ish that told him, And, hinei, thou sawest him, and why didst thou not strike him down to the ground there? And I would have given thee ten shekels of kesef, and a khagorah."},{"num":12,"verse":"And the ish said unto Yoav, Though I should receive elef kesef in mine palm, yet would I not put forth mine yad against the ben HaMelech; for in ozneinu (our hearing) HaMelech charged thee and Avishai and Ittai, saying, Beware that none touch the na’ar Avshalom."},{"num":13,"verse":"Otherwise I should have dealt sheker against mine own nefesh; for there is no matter hid from HaMelech, and thou thyself wouldest have set thyself against me."},{"num":14,"verse":"Then said Yoav, I will not tarry thus with thee. And he took three shevatim in his yad, and thrust them through the lev Avshalom, while he was yet alive in the midst of the oak tree [Yn 19:34]."},{"num":15,"verse":"And ten ne’arim that bore the armor of Yoav surrounded Avshalom, struck and slaughtered him."},{"num":16,"verse":"Then Yoav blew the shofar, and HaAm returned from pursuing after Yisroel; for Yoav held back HaAm."},{"num":17,"verse":"And they took Avshalom, and cast him into a great pit in the forest, and laid a very great heap of avanim upon him; and all Yisroel fled, every ish to his ohel."},{"num":18,"verse":"Now Avshalom in his lifetime had taken and erected for himself a matzevet (monument), which is in the Emek HaMelech; for he said, I have no ben to keep my shem in remembrance; and he called the matzevet after shmo; and it is called unto this day, Avshalom’s Monument."},{"num":19,"verse":"Then said Achima’atz Ben Tzadok, Let me now run, and take news to HaMelech, how that Hashem hath in justice vindicated him of his oyevim."},{"num":20,"verse":"And Yoav said unto him, Thou shalt not be ish besorah (bearer of news) this day, but thou shalt bear tidings another day; but this day thou shalt bear no tidings, because the ben HaMelech is dead."},{"num":21,"verse":"Then said Yoav to Cushi, Go tell HaMelech what thou hast seen. And Cushi prostrated himself unto Yoav, and ran."},{"num":22,"verse":"Then said Achima’atz Ben Tzadok yet again to Yoav, But be what may, let me, now, also run after Cushi. And Yoav said, why wilt thou run, beni, seeing that thou hast no besorah to provide?"},{"num":23,"verse":"But howsoever, said he, let me run. And he said unto him, Rutz! (run!). Then Achima’atz ran by the derech of the plain, outran Cushi."},{"num":24,"verse":"And Dovid sat between the two she’arim (gates); and the tzofeh (watchman) went up to the gag (roof) over the sha’ar (gate) unto the chomah (wall), and lifted up his eyes, and looked, and hinei an ish running alone."},{"num":25,"verse":"And the tzofeh (watchman) cried, and told HaMelech. And HaMelech said, If he be alone, there is besorah (news) in his peh (mouth). And he came rapidly, and drew near."},{"num":26,"verse":"And the tzofeh (watchman) saw another man running; and the tzofeh called unto the sho’er (gatekeeper), and said, Hinei, another man running alone. And HaMelech said, This is mevaser (one bringing good news, evangelist)."},{"num":27,"verse":"And the tzofeh (watchman) said, I see the running of the foremost is like the running of Achima’atz Ben Tzadok. And HaMelech said, He is an ish tov, and cometh with besorah tovah (good news) [see 2Sm 18:10]."},{"num":28,"verse":"And Achima’atz called, and said unto HaMelech, Shalom. And he fell down to ha’aretz upon his face before HaMelech, and said, Baruch Hashem Eloheicha, which hath delivered up the anashim that lifted up their yad against adoni HaMelech."},{"num":29,"verse":"And HaMelech said, Is the na’ar Avshalom shalom? And Achima’atz answered, When Yoav sent eved HaMelech, avdecha, I saw a great tumult, but I knew not what it was."},{"num":30,"verse":"And HaMelech said unto him, Turn aside, and stand here. And he turned aside, and stood still."},{"num":31,"verse":"And, hinei, Cushi came; and Cushi said, Yitbaser (be informed of news), adoni HaMelech; for Hashem hath in justice vindicated thee this day from the yad of all them that rose up against thee."},{"num":32,"verse":"And HaMelech said unto Cushi, Is the na’ar Avshalom shalom? And Cushi answered, The enemies of adoni HaMelech, and all that rise against thee to do thee harm, be as that na’ar is."}]