[{"num":18,"verse":"Therefore David, when he had beheld his people, ordained chieftains of thousands, and (chieftains) of hundreds upon them."},{"num":2,"verse":"And he gave the third part of the people under the hand of Joab; and the third part under the hand of Abishai, the son of Zeruiah, the brother of Joab; and the third part under the hand of Ittai, that was of Gath. And the king said to the people, Also I shall go out with you. (And he sent out a third part of the people under Joab’s command; and a third part under Abishai, the son of Zeruiah, Joab’s brother; and a third part under Ittai the Gittite. And the king said to the people, And I shall go out with all of you.)"},{"num":3,"verse":"And the people answered, Thou shalt not go out; for whether we flee, it shall not pertain to them by great work of us; whether half the part fall down of us, they shall not reckon (it) enough, for thou art reckoned for ten thousand; therefore it is better, that thou be to us in the city in strong succour. (And the people answered, Thou shalt not go out with us; for if we flee, it shall not pertain to them to make any great effort against us; and even if half of us shall fall down, or shall die, they shall not reckon it enough/they shall not reckon it much, for thou art reckoned for ten thousand; and so it is better for us, if thou be in the city, and support us from here.)"},{"num":4,"verse":"And the king said to them, I shall do that, that seemeth rightful to you. Therefore the king stood beside the gate, and the people went out by their companies, by hundreds, and by thousands."},{"num":5,"verse":"And the king commanded to Joab, and to Abishai, and to Ittai, and said, Keep ye to me the child Absalom. And all the people heard the king commanding to all the princes for Absalom. (And the king commanded to Joab, and Abishai, and Ittai, and said, For my sake, do not ye harm the young man Absalom. And all the people heard the king commanding to all his officers about Absalom.)"},{"num":6,"verse":"Therefore the people went out into the field against Israel; and the battle was made in the forest of Ephraim."},{"num":7,"verse":"And the people of Israel was slain there of the host of David, and a great slaughter of twenty thousand was made in that day. (And many Israelites were killed there by David’s army, yea, there was a great slaughter of twenty thousand that day.)"},{"num":8,"verse":"And the battle was scattered there upon the face of all the land, and many more were of the people which the forest wasted, than they which the sword devoured in that day. (And the battle there was scattered over all the countryside, and the forest killed many more people that day, than they whom the sword devoured.)"},{"num":9,"verse":"Soothly it befelled, that Absalom, sitting on a mule, came against the servants of David; and when the mule had entered under a thick oak, and great, the head of Absalom cleaved to the oak; and when he was hanged betwixt heaven and earth, the mule, on which he sat, passed (forth). (And it befell, that Absalom, sitting on a mule, came toward David’s men; and when the mule had entered under a great thick oak, Absalom’s head got caught in the branches; and while he hung in the air above the ground, the mule, on which he sat, went forth.)"},{"num":10,"verse":"And some man saw this, and told it to Joab, and said, I saw Absalom hanged on an oak (and said, I saw Absalom hung up in an oak)."},{"num":11,"verse":"And Joab said to the man that told to him, If thou saw him, why piercedest thou not him through to the earth, and I should have given to thee ten shekels of silver, and a girdle? (And Joab said to the man who told him this, If thou saw him thus, why didest thou not pierce him through to the ground, and then I would have gladly given thee ten silver shekels, and a girdle.)"},{"num":12,"verse":"And he said to Joab, Though thou paidest in mine hands a thousand pieces of silver, I would not send mine hand into the son of the king; for while we heard, the king commanded to thee, and to Abishai, and to Ittai, and said, Keep ye to me the child Absalom. (And he said to Joab, Though thou paidest me a thousand pieces of silver, I would not raise my hand against the king’s son; for while we heard, the king commanded to thee, and to Abishai, and to Ittai, and said, For my sake, do not ye harm the young man Absalom.)"},{"num":13,"verse":"But and though I had done fool hardily against my life (But if I had acted so foolishly against my own life), this might not be hid from the king, and thou wouldest stand on the contrary side."},{"num":14,"verse":"And Joab said, Not as thou wilt, but I shall assail him before thee. Therefore Joab took three spears in his hand, and fixed those in(to) the heart of Absalom. And when he sprawled, yet cleaving in the oak (And yet while he sprawled, still caught up in the oak),"},{"num":15,"verse":"ten young squires of Joab ran, and smote, and killed him. (ten young squires of Joab ran over to him, and struck, or stabbed, and killed him.)"},{"num":16,"verse":"And Joab trumped with a clarion, and held with him the people, lest it pursued Israel fleeing, and he would spare the multitude. (And then Joab sounded with a trumpet, to hold back the army with him, lest they pursued the men of Israel fleeing away, for he would spare the multitude.)"},{"num":17,"verse":"And they took Absalom, and casted forth him into a great ditch in the forest, and bare together a full great heap of stones on him; and all Israel fled into their tabernacles. (And they took Absalom’s body, and threw it forth into a great ditch in the forest, and put a great heap of stones on it; and all Israel fled back to their homes.)"},{"num":18,"verse":"Forsooth Absalom, while he lived yet, had raised to him a memorial, which is in the valley of the king; for he said, I have no son, and this shall be the mind of my name; and he called the memorial by his name, and it is called The Hand, that is, (the) Work, of Absalom, till to this day. (And Absalom, while yet he lived, had raised up a memorial to himself, in the King’s Valley; for he said, I have no son, and this shall be in remembrance of my name; and he called the memorial after his own name, and unto this day it is still called The Work of Absalom.)"},{"num":19,"verse":"And Ahimaaz, the son of Zadok, said, I shall run, and I shall tell to the king, that the Lord hath made doom to him of the hand of his enemies. (And Ahimaaz, the son of Zadok, said, I shall run, and I shall tell the king, that the Lord hath made judgement for him, that is, hath avenged him, upon his enemies.)"},{"num":20,"verse":"To whom Joab said, Thou shalt not be a messenger in this day, but thou shalt tell in another day; I will not that thou tell this today, for the son of the king is dead (I do not desire that thou tell this news today, for the king’s son is dead)."},{"num":21,"verse":"And Joab said to Cushi, Go thou, and tell to the king those things that thou hast seen. Cushi worshipped Joab, and ran forth (Cushi bowed to Joab, and ran off)."},{"num":22,"verse":"And again Ahimaaz, the son of Zadok, said to Joab, What hindereth, if also I run after Cushi? And Joab said to him, What wilt thou run, my son? Come thou hither, thou shalt not be a bearer of good message (And Joab said to him, Why would thou run, my son? It is better to stay here, for thou shalt not be a bearer of good news)."},{"num":23,"verse":"The which answered, But what if I shall run? And Joab said to him, (Then) Run thou. Therefore Ahimaaz ran by the way of shortness, and speed, and passed Cushi."},{"num":24,"verse":"And David sat betwixt (the) two gates; soothly the espyer, that was in the highness of the gate on the wall, raised up his eyes, and he saw a man alone running; (And David sat between the two gates of the city; and the watchman, who was on the roof of the gate by the wall, raised up his eyes, and he saw a man running alone;)"},{"num":25,"verse":"and the espyer cried, and showed to the king. And the king said to him, If he is alone, good message is in his mouth. But while he hasted, and nighed near, (and the watchman cried aloud, and told the king. And the king said to himself, If he is alone, then he hath good news. But while he hastened, and drew near,)"},{"num":26,"verse":"the espyer saw another man running; and the espyer cried on high, and said, Another man running alone appeareth to me. And the king said to him, And this man is a good messenger. (the watchman saw another man running; and the watchman cried out on high, and said, Another man also running alone appeareth to me. And the king said to himself, This man must also have good news.)"},{"num":27,"verse":"Soothly the espyer said (And the watchman said), I behold the running of the former, as the running of Ahimaaz, the son of Zadok. And the king said, He is a good man, and he cometh bringing a good message."},{"num":28,"verse":"And Ahimaaz cried, and said to the king, Hail king! And he worshipped the king lowly before him to the earth, and said, Blessed be thy Lord God, that hath closed together the men, that raised their hands against my lord the king. (And Ahimaaz cried out, and said to the king, Hail king! And honouring the king, he bowed low to the ground before him, and said, Blessed be the Lord thy God, who hath given thee victory over the men who raised up their hands, that is, who rebelled, against my lord the king.)"},{"num":29,"verse":"And the king said, Whether peace is to the child Absalom? And Ahimaaz said, I saw, that is, I heard, a great noise, when Joab, thy servant, thou king, sent me, thy servant; I know none other thing. (And the king said, Is all well with the young man Absalom? And Ahimaaz said, I saw a great tumult/I heard a great noise, when thy servant Joab, O king, sent me, thy servant; I know nothing else.)"},{"num":30,"verse":"To whom the king said, Pass thou, and stand here. And when he had passed, and stood, (To whom the king said, Stand thou over there. And when he had stepped aside, and stood in silence,)"},{"num":31,"verse":"Cushi appeared; and he came and said, My lord the king, I bring good message; for the Lord hath deemed today for thee of the hand of all men that rised against thee. (Cushi appeared; and he came and said, My lord the king, I bring good news; for the Lord hath given thee victory today over all the men who rebelled against thee.)"},{"num":32,"verse":"And the king said to Cushi, Whether peace is to the child Absalom? To whom Cushi answered, and said, The enemies of my lord the king, and all men that rise against him into evil, be made as the child. (And the king said to Cushi, Is all well with the young man Absalom? To whom Cushi answered, May all the enemies of my lord the king, and all the men who rebel against him, be made like that young man!)"},{"num":33,"verse":"Therefore the king was sorry, and went up into the solar of the gate, and he wept, and spake thus going (And so the king was deeply grieved, and went up to the roof of the gate, and as he went, he wept, and spoke thus), My son, Absalom! Absalom, my son! who giveth to me, that I die for thee? Absalom, my son! my son, Absalom!"}]