[{"num":39,"verse":"This is how Jerusalem fell: When the Egyptian threat in the south was over, King Nebuchadnezzar of Babylon brought his army back to Jerusalem and resumed the siege. This began in the 10th month of the 9th year of Zedekiah’s reign as Judah’s king. "},{"num":2,"verse":"For the next 18 months, the siege continued until the 9th day of the 4th month of Zedekiah’s 11th year. On that sad summer day, Jerusalem finally fell when the Chaldeans broke through the city wall. "},{"num":3,"verse":"All the officials designated by Babylon’s king to exercise his authority entered the city and sat at the middle gate. These included Nergal-sar-ezer, Samgar-nebu, Sar-sekim (who was a chief officer), Nergal-sar-ezer (a high official), and all the other officials sent by the king of Babylon."},{"num":4,"verse":"When King Zedekiah of Judah and his troops saw the Babylonians break through the wall on the north side of the city, they fled under the cloak of darkness. They made their way out of the city by passing through the king’s garden and then through the gate between the two walls. Once they left, they headed toward the Jordan Valley. "},{"num":5,"verse":"But the Chaldean army discovered this and chased after Zedekiah, capturing him on the plains of Jericho. They took him to King Nebuchadnezzar of Babylon, who had set up his command post at Riblah in the old Aramean city of Hamath. It was here that the dreaded king pronounced judgment on Zedekiah for rebelling against him. "},{"num":6,"verse":"Zedekiah was forced to watch as his own sons and the nobles of Judah were slaughtered right in front of him. "},{"num":7,"verse":"This was the very last thing he saw, because Nebuchadnezzar then blinded the eyes of Zedekiah. This blinded and humiliated king was then placed in bronze shackles and carried off to Babylon. "},{"num":8,"verse":"Back in Jerusalem, the Chaldean troops burned down the king’s palace and the commoners’ houses and then tore down the walls of the city. "},{"num":9,"verse":"Those who were left in the city, along with those who had previously surrendered, were then deported to Babylon by Nebuzaradan (captain of the imperial guard). "},{"num":10,"verse":"But he left some of the poorest people in Judah and gave them vineyards and fields to care for."},{"num":11,"verse":"In these days of conquest, King Nebuchadnezzar learned about the prophet Jeremiah and gave this order to his captain of the imperial guard, Nebuzaradan:"},{"num":13,"verse":"So Nebuzaradan (the captain of the imperial guard), Nebushazban (a chief officer), Nergal-sar-ezer (a high-ranking official), and the other officials from Babylon "},{"num":14,"verse":"ordered Jeremiah released from the court of the guard and brought to them. They eventually handed him over to the care of Gedaliah (son of Ahikam and grandson of Shaphan), who took Jeremiah back to his home. And so it was that Jeremiah was allowed to remain in the land of Judah among his people."},{"num":15,"verse":"While Jeremiah was still confined in the court of the guard, the word of the Eternal came to him."}]