[{"header":"Jesus Enters Jerusalem as a King"},{"num":21,"verse":"Jesus and his followers were coming closer to Jerusalem. But first they stopped at Bethphage at the hill called the Mount of Olives. From there Jesus sent two of his followers into the town. "},{"num":2,"verse":"He said to them, “Go to the town you can see there. When you enter it, you will find a donkey tied there with its colt. Untie them and bring them to me. "},{"num":4,"verse":"This was to make clear the full meaning of what the prophet said:"},{"num":6,"verse":"The followers went and did what Jesus told them to do. "},{"num":7,"verse":"They brought the donkey and the colt to Jesus. They laid their coats on the donkeys, and Jesus sat on them. "},{"num":8,"verse":"Many people spread their coats on the road before Jesus. Others cut branches from the trees and spread them on the road. "},{"num":9,"verse":"Some of the people were walking ahead of Jesus. Others were walking behind him. All the people were shouting,"},{"num":10,"verse":"Then Jesus went into Jerusalem. The city was filled with excitement. The people asked, “Who is this man?”"},{"num":11,"verse":"The crowd answered, “This man is Jesus. He is the prophet from the town of Nazareth in Galilee.”"},{"header":"Jesus Goes to the Temple"},{"num":12,"verse":"Jesus went into the Temple. He threw out all the people who were buying and selling there. He turned over the tables that belonged to the men who were exchanging different kinds of money. And he upset the benches of those who were selling doves. "},{"num":13,"verse":"Jesus said to all the people there, “It is written in the Scriptures, ‘My Temple will be a house where people will pray.’ But you are changing God’s house into a ‘hideout for robbers.’”"},{"num":14,"verse":"The blind and crippled people came to Jesus in the Temple, and Jesus healed them. "},{"num":15,"verse":"The leading priests and the teachers of the law saw that Jesus was doing wonderful things. They saw the children praising him in the Temple. The children were saying, “Praise to the Son of David.” All these things made the priests and the teachers of the law very angry."},{"num":16,"verse":"They asked Jesus, “Do you hear the things these children are saying?”"},{"num":17,"verse":"Then Jesus left and went out of the city to Bethany, where he spent the night."},{"header":"The Power of Faith"},{"num":18,"verse":"Early the next morning, Jesus was going back to the city. He was very hungry. "},{"num":19,"verse":"He saw a fig tree beside the road. Jesus went to it, but there were no figs on the tree. There were only leaves. So Jesus said to the tree, “You will never again have fruit!” The tree immediately dried up."},{"num":20,"verse":"His followers saw this and were amazed. They asked, “How did the fig tree dry up so quickly?”"},{"num":21,"verse":"Jesus answered, “I tell you the truth. If you have faith and do not doubt, you will be able to do what I did to this tree. And you will be able to do more. You will be able to say to this mountain, ‘Go, mountain, fall into the sea.’ And if you have faith, it will happen. "},{"header":"Leaders Doubt Jesus’ Authority"},{"num":23,"verse":"Jesus went to the Temple. While he was teaching there, the leading priests and the elders of the people came to Jesus. They said to him, “Tell us! What authority do you have to do these things? Who gave you this authority?”"},{"num":24,"verse":"Jesus answered, “I will ask you a question, too. If you answer me, then I will tell you what authority I have to do these things. "},{"num":26,"verse":"But if we say, ‘It was from man,’ we are afraid of what the people will do because they all believe that John was a prophet.”"},{"num":27,"verse":"So they answered Jesus, “We don’t know.”"},{"header":"A Story About Two Sons"},{"header":"God Sends His Son"},{"num":41,"verse":"The priests and leaders said, “He will surely kill those evil men. Then he will lease the vineyard to some other farmers. They will give him his share of the crop at harvest time.”"},{"num":42,"verse":"Jesus said to them, “Surely you have read this in the Scriptures:"},{"num":45,"verse":"The leading priests and the Pharisees heard these stories that Jesus told. They knew he was talking about them. "},{"num":46,"verse":"They wanted to arrest him. But they were afraid of the people, because the people believed that Jesus was a prophet."}]