[{"header":"Internal unrest"},{"num":5,"verse":"Then there was a great protest of the people and their wives against their fellow Jews."},{"num":2,"verse":"Some said, “With our sons and daughters we are many, and we all need grain to eat and stay alive.”"},{"num":3,"verse":"Others said, “We have to mortgage our fields, our vineyards, and our houses in order to get grain during the famine.”"},{"num":4,"verse":"Still others said, “We have had to borrow money against our fields and vineyards in order to pay the king’s tax.”"},{"num":5,"verse":"“We are of the same flesh and blood as our kin, and our children are the same as theirs. Yet we are just about to force our sons and daughters into slavery, and some of our daughters are already slaves! There is nothing we can do since our fields and vineyards now belong to others.”"},{"num":6,"verse":"I was very angry when I heard their protest and these complaints."},{"num":7,"verse":"After thinking it over, I brought charges against the officials and the officers. I told them, “You are all taking interest from your own people!” I also called for a large assembly in order to deal with them."},{"num":8,"verse":"“To the best of our ability,” I said to them, “we have bought back our Jewish kin who had been sold to other nations. But now you are selling your own kin, who must then be bought back by us!” At this they were silent, unable to offer a response."},{"num":9,"verse":"So I continued, “What you are doing isn’t good! Why don’t you walk in the fear of our God? This will prevent the taunts of the nations that are our enemies!"},{"num":10,"verse":"I myself, along with my family and my servants, am lending them money and grain. But let’s stop charging this interest!"},{"num":11,"verse":"Give it back to them, right now. Return their fields, their vineyards, their olive orchards, and their houses. And give back the interest on money, grain, wine, and oil that you are charging them.”"},{"num":12,"verse":"They replied, “We’ll return everything, and we won’t charge anything else. We’ll do what you’ve asked.”"},{"num":13,"verse":"I also shook out the fold of my robe, saying, “So may God shake out everyone from their house and property if they don’t keep this promise. So may they be shaken out and emptied!”"},{"header":"Generous Governor Nehemiah"},{"num":14,"verse":"In addition, from the time that I was appointed to be their governor in the land of Judah (that is, from the twentieth to the thirty-second year of King Artaxerxes for a total of twelve years), neither I nor my family ate from the governor’s food allowance."},{"num":15,"verse":"The earlier governors who had come before me laid heavy burdens on the people. They took food and wine from them as well as forty shekels of silver. Even their servants oppressed the people. But because I was God-fearing, I didn’t behave in this way."},{"num":16,"verse":"Instead, I devoted myself to the work on this wall. We acquired no land, and all my servants were gathered there for the work."},{"num":17,"verse":"One hundred fifty Jews and officials, along with those who came to us from the surrounding nations, gathered around my table."},{"num":18,"verse":"One ox, six choice sheep, and birds were prepared each day. Every ten days there was a large amount of wine. Yet even with this I didn’t ask for the governor’s food allowance because of the heavy burden the people had to carry."},{"num":19,"verse":"Remember in my favor, my God, all that I’ve done for this people!"}]