[{"header":"Nehemiah’s Concern for the Poor"},{"num":5,"verse":"Some of the men and their wives complained about the Jews in power "},{"num":2,"verse":"and said, “We have large families, and it takes a lot of grain merely to keep them alive.”"},{"num":3,"verse":"Others said, “During the famine we even had to mortgage our fields, vineyards, and homes to them in order to buy grain.”"},{"num":4,"verse":"Then others said, “We had to borrow money from those in power to pay the government tax on our fields and vineyards. "},{"num":5,"verse":"We are Jews just as they are, and our children are as good as theirs. But we still have to sell our children as slaves, and some of our daughters have already been raped. We are completely helpless; our fields and vineyards have even been taken from us.”"},{"num":6,"verse":"When I heard their complaints and their charges, I became very angry. "},{"num":7,"verse":"So I thought it over and said to the leaders and officials, “How can you charge your own people interest?”"},{"num":8,"verse":"by saying, “We have tried to buy back all of our people who were sold into exile. But here you are, selling more of them for us to buy back!” The officials and leaders did not say a word, because they knew this was true."},{"num":9,"verse":"I continued, “What you have done is wrong! We must honor our God by the way we live, so the Gentiles can’t find fault with us. "},{"num":10,"verse":"My relatives, my friends, and I are also lending money and grain, but we must no longer demand payment in return. "},{"num":11,"verse":"Now give back the fields, vineyards, olive orchards, and houses you have taken and also the interest you have been paid.”"},{"num":12,"verse":"The leaders answered, “We will do whatever you say and return their property, without asking to be repaid.”"},{"num":13,"verse":"Then I emptied my pockets and said, “If you don’t keep your promise, that’s what God will do to you. He will empty out everything you own, even taking away your houses.”"},{"header":"Nehemiah Is Generous"},{"num":14,"verse":"I was governor of Judah from the twentieth year that Artaxerxes was king until the thirty-second year. And during these entire twelve years, my relatives and I refused to accept the food that I was allowed. "},{"num":15,"verse":"Each governor before me had been a burden to the people by making them pay for his food and wine and by demanding forty silver coins a day. Even their officials had been a burden to the people. But I respected God, and I didn’t think it was right to be so hard on them. "},{"num":16,"verse":"I spent all my time getting the wall rebuilt and did not buy any property. Everyone working for me did the same thing. "},{"num":17,"verse":"I usually fed a hundred fifty of our own Jewish people and their leaders, as well as foreign visitors from surrounding lands. "},{"num":18,"verse":"Each day one ox, six of the best sheep, and lots of chickens were prepared. Then every ten days, a large supply of wine was brought in. I knew what a heavy burden this would have been for the people, and so I did not ask for my food allowance as governor."},{"num":19,"verse":"I pray that God will bless me for everything I have done for my people."}]