[{"num":5,"verse":"Then there arose a great outcry from the common people and their wives against their brothers the [wealthier] Judeans. "},{"num":2,"verse":"Some of them said, “Counting our sons and daughters, there are a lot of us! Allow us to get grain for them, so that we can eat and stay alive.” "},{"num":3,"verse":"There were also some who said, “We are mortgaging our fields, vineyards and homes in order to buy grain, because of the famine.” "},{"num":4,"verse":"Yet others said, “We have borrowed money for the king’s taxes against our fields and vineyards. "},{"num":5,"verse":"Now our flesh is no different from the flesh of our kinsmen, and our children are the same as their children; yet we are bringing our sons and daughters into bondage as slaves. Some of our daughters have gone into slavery already, and it’s beyond our power to do anything about it, because other men have our fields and vineyards.”"},{"num":6,"verse":"When I heard their outcry and the reasons for it, I became very angry. "},{"num":7,"verse":"I thought the matter over and then took issue with the nobles and rulers. I charged them, “You are lending against pledges, everyone to his brother”; and I summoned a great assembly to deal with them. "},{"num":8,"verse":"I said to them, “We, to the limit of our ability, have redeemed our brothers the Judeans who sold themselves to the pagans. Now you are selling your own brothers, and we will have to buy them back!” They stayed silent; they couldn’t think of anything to say. "},{"num":9,"verse":"I also said, “What you are doing is not good! You should be living in fear of our God, so that our pagan enemies won’t have grounds for deriding us. "},{"num":10,"verse":"Moreover, my brothers and my servants, I too have loaned them money and grain. Please, let’s stop making it so burdensome to go into debt. "},{"num":11,"verse":"Please! Today! Give them back their fields, vineyards, olive groves and homes; also the hundred pieces of silver and the grain, wine and olive oil you demand from them as interest.”"},{"num":12,"verse":"They answered, “We will give it back. We will require nothing from them. Yes, we will do it, just as you say.” Then I called the cohanim and took an oath from them that they would do as they had promised. "},{"num":13,"verse":"Shaking out the fold in my garment, I said, “May God thus shake every man from his house and from his work who fails to live up to this promise — may he be shaken out like this and made empty.” The whole assembly said, “Amen!” and praised Adonai; and the people did as they had promised."},{"num":14,"verse":"Besides that, from the time I was appointed their governor in the land of Y’hudah, from the twentieth year until the thirty-second year of Artach’shashta the king — that is, for twelve years — neither I nor my colleagues drew on the governor’s living allowance. "},{"num":15,"verse":"The earlier governors, before me, had burdened the people, taxing them more than one-and-a-half pounds of silver shekels for food and wine; and even their servants lorded it over the people. But I didn’t, because I feared God. "},{"num":16,"verse":"Moreover, I put all my energy into working on this wall. We didn’t buy any land, and all my servants were gathered there for the work."},{"num":17,"verse":"There were 150 leaders and other Judeans who ate at my table, besides those who came to us from the surrounding nations. "},{"num":18,"verse":"Every day one ox, six choice sheep, and fowl were prepared for me, and every ten days a supply of all kinds of wine. Yet in spite of all this, I never claimed the governor’s allowance, because the people were already bearing the heavy burden of their labor. "},{"num":19,"verse":"My God, remember favorably everything I have done for this people!"}]