[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore will he give them up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—There is a suggestion here of a parable, setting forth the smallness of Bethlehem, which gave birth to the mighty Ruler that was to come from it. So the nation was to be brought very low before the nativity of the Virgin-born.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 5:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore will he give them up — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "לכן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "therefore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "should rather be here rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nevertheless. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The meaning is, Notwithstanding the promise of so great a blessing, God would give up his people into the hands of their enemies, or leave them to be exercised with troubles and afflictions, till the appointed time of their deliverance should come. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Until the time that she which travaileth hath brought forth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Until the daughter of Zion, compared here to a woman in travail, shall be delivered out of captivity. Or rather, till the church of God, of which the daughter of Zion was a type, shall bring forth spiritual children of Jew and Gentile extraction unto God, by the preaching of the gospel: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 4:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This prophecy will be more fully completed in the general conversion and restoration of the Jewish nation in the latter days: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 66:7-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then the remnant of his brethren — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The brethren of the Messiah, those of Judah and Benjamin especially, who were carried captive; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall return unto the children of Israel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, be converted with the children of Israel. Then the remnant of the dispersed Jews, upon their conversion, shall join themselves to the true Israelites, and make one church with them. Both the LXX. and Chaldee read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the remnant of their brethren: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but if we follow the present Hebrew, we may understand it of the believers that were to be added to the church; for Christ vouchsafes to call all believers his brethren: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-6 Having showed how low the house of David would be brought, a prediction of the Messiah and his kingdom is added to encourage the faith of God's people. His existence from eternity as God, and his office as Mediator, are noticed. Here is foretold that Bethlehem should be his birthplace. Hence it was universally known among the Jews, Mt 2:5. Christ's government shall be very happy for his subjects; they shall be safe and easy. Under the shadow of protection from the Assyrians, is a promise of protection to the gospel church and all believers, from the designs and attempts of the powers of darkness. Christ is our Peace as a Priest, making atonement for sin, and reconciling us to God; and he is our Peace as a King, conquering our enemies: hence our souls may dwell at ease in him. Christ will find instruments to protect and deliver. Those that threaten ruin to the church of God, soon bring ruin on themselves. This may include the past powerful effects of the preached gospel, its future spread, and the ruin of all antichristian powers. This is, perhaps, the most important single prophecy in the Old Testament: it respects the personal character of the Messiah, and the discoveries of himself to the world. It distinguishes his human birth from his existing from eternity; it foretells the rejection of the Israelites and Jews for a season, their final restoration, and the universal peace to prevail through the whole earth in the latter days. In the mean time let us trust our Shepherd's care and power. If he permits the assault of our enemies, he will supply helpers and assistance for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore - Since God has so appointed both to punish and to redeem, He, God, or the Ruler \"whose goings forth have been from of old from everlasting,\" who is God with God, \"shall give them up, that is, withdraw His protection and the nearness of His Presence, \"giving them up:\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) into the hands of their enemies. And indeed the far greater part never returned from the captivity, but remained, although willingly, in the enemy's land, outwardly shut out from the land of the promise and the hope of their fathers (as in 2 Chronicles 36:17).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) into the hands of their enemies. And indeed the far greater part never returned from the captivity, but remained, although willingly, in the enemy's land, outwardly shut out from the land of the promise and the hope of their fathers (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 36:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) But also, all were, more than before, \"given up\" Acts 7:42; Romans 1:24, Romans 1:26, Romans 1:28, to follow their own ways.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) But also, all were, more than before, \"given up\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to follow their own ways.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "God was less visibly present among them. Prophecy ceased soon after the return from the captivity, and many tokens of the nearness of God and means of His communications with them, the Ark and the Urim and Thummim were gone. It was a time of pause and waiting, wherein the fullness of God's gifts was withdrawn, that they might look on to Him who was to come. \"Until the time that she which travaileth hath brought forth,\" that is, until  the Virgin who should conceive and bear a Son and call His Name Emmanuel, God with us, shall give birth to Him who shall save them. And then shall be redemption and joy and assured peace. God provides against the fainting of hearts in the long time before our Lord should come.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Then - (And). There is no precise mark of time such as our word then expresses. He speaks generally of what should be after the Birth of the Redeemer. \"The remnant of His brethren shall return unto the children of Israel.\" \"The children of Israel\" are the true Israel, \"Israelites indeed\" John 1:47; they who are such, not in name (Romans 9:6, etc.) only, but indeed and in truth. His brethren are plainly the brethren of the Christ; either because Jesus vouchsafed to be born \"of the seed of David according to the flesh\" Romans 1:3, and of them \"as concerning the flesh Christ came, who is over all, God blessed forever\" Romans 9:5; or as such as He makes and accounts and \"is not ashamed to call, brethren\" Hebrews 2:11, being sons of God by grace, as He is the Son of God by nature. As He says, \"Whosoever shall do the will of My Father which is in Heaven, the same is My brother and sister and mother\" Matthew 12:50; and, \"My brethren are these who hear the word of God and do it\" Luke 8:21.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then - (And). There is no precise mark of time such as our word then expresses. He speaks generally of what should be after the Birth of the Redeemer. \"The remnant of His brethren shall return unto the children of Israel.\" \"The children of Israel\" are the true Israel, \"Israelites indeed\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; they who are such, not in name (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.) only, but indeed and in truth. His brethren are plainly the brethren of the Christ; either because Jesus vouchsafed to be born \"of the seed of David according to the flesh\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and of them \"as concerning the flesh Christ came, who is over all, God blessed forever\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or as such as He makes and accounts and \"is not ashamed to call, brethren\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", being sons of God by grace, as He is the Son of God by nature. As He says, \"Whosoever shall do the will of My Father which is in Heaven, the same is My brother and sister and mother\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and, \"My brethren are these who hear the word of God and do it\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 8:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The residue of these, the prophet says, shall return to, so as to be joined with , the children of Israel; as Malachi prophesies, \"He shall bring back the heart of the fathers to the children, and the heart of the children to the fathers\" (Malachi 3:24, Hebrew). In the first sense, Micah foretells the continual inflow of the Jews to that true Israel who should first be called. All in each generation, who are the true Israel, shall be converted, made one in Christ, saved. So, whereas, since Solomon, all had been discord, and, at last, the Jews were scattered abroad everywhere, all, in the true Prince of Peace, shall be one (see Hosea 1:11; Isaiah 11:10, etc.). This has been fulfilled in each generation since our Lord came, and shall be yet further in the end, when they shall haste and pour into the Church, and so \"all Israel shall be saved\" Romans 11:26.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The residue of these, the prophet says, shall return to, so as to be joined with , the children of Israel; as Malachi prophesies, \"He shall bring back the heart of the fathers to the children, and the heart of the children to the fathers\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Hebrew). In the first sense, Micah foretells the continual inflow of the Jews to that true Israel who should first be called. All in each generation, who are the true Israel, shall be converted, made one in Christ, saved. So, whereas, since Solomon, all had been discord, and, at last, the Jews were scattered abroad everywhere, all, in the true Prince of Peace, shall be one (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.). This has been fulfilled in each generation since our Lord came, and shall be yet further in the end, when they shall haste and pour into the Church, and so \"all Israel shall be saved\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But \"the promise of God was not only to Israel after the flesh, but to all\" also that were afar off, even as many as the Lord our God should call Acts 2:39. All these may be called the remnant of His brethren, even those that were, before, aliens from the commonwealth of Israel and afar off Ephesians 2:12-14, but now, in Christ Jesus, made one with them; all, brethren among themselves and to Christ their ruler. : \"Having taken on Him their nature in the flesh, He is not ashamed to call them so, as the Apostle speaketh, confirming it out of the Psalm, where in the Person of Christ he saith, \"I will declare Thy name unto My brethren\" Psalm 22:22. There is no reason to take the name, brethren, here in a narrower sense than so to comprehend all \"the remnant whom the Lord shall call\" Joel 2:32, whether Jews or Gentiles. The word \"brethren\" in its literal sense includes both, and, as to both, the words were fulfilled. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But \"the promise of God was not only to Israel after the flesh, but to all\" also that were afar off, even as many as the Lord our God should call ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". All these may be called the remnant of His brethren, even those that were, before, aliens from the commonwealth of Israel and afar off ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:12-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but now, in Christ Jesus, made one with them; all, brethren among themselves and to Christ their ruler. : \"Having taken on Him their nature in the flesh, He is not ashamed to call them so, as the Apostle speaketh, confirming it out of the Psalm, where in the Person of Christ he saith, \"I will declare Thy name unto My brethren\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There is no reason to take the name, brethren, here in a narrower sense than so to comprehend all \"the remnant whom the Lord shall call\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", whether Jews or Gentiles. The word \"brethren\" in its literal sense includes both, and, as to both, the words were fulfilled. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. \"Therefore (because of His settled plan) will God give up to their foes His people Israel, until,\" &c.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "she which travaileth hath brought forth—namely, \"the virgin\" mother, mentioned by Micah's contemporary, Isa 7:14. Zion \"in travail\" (Mic 4:9, 10) answers to the virgin in travail of Messiah. Israel's deliverance from her long travail-pains of sorrow will synchronize with the appearance of the Messiah as her Redeemer (Ro 11:26) in the last days, as the Church's spiritual deliverance synchronized with the virgin's giving birth to Him at His first advent. The ancient Church's travail-like waiting for Messiah is represented by the virgin's travail. Hence, both may be meant. It cannot be restricted to the Virgin Mary: for Israel is still \"given up,\" though Messiah has been \"brought forth\" eighteen and a half centuries ago. But the Church's throes are included, which are only to be ended when Christ, having been preached for a witness to all nations, shall at last appear as the Deliverer of Jacob, and when the times of the Gentiles shall be fulfilled, and Israel as a nation shall be born in a day (Isa 66:7-11; Lu 21:24; Re 12:1, 2, 4; compare Ro 8:22).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the remnant of his brethren shall return unto the children of Israel—(Compare Mic 4:7). The remainder of the Israelites dispersed in foreign lands shall return to join their countrymen in Canaan. The Hebrew for \"unto\" is, literally, \"upon,\" implying superaddition to those already gathered.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or nevertheless, as the particle will bear, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "will he, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God, the God of Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "give them up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the Chaldeans, to be wasted by them, and to be led into captivity, and to be afflicted there for their sins committed in their own land against God, until the time, until seventy years be expired, the time appointed for the punishing the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that she which travaileth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the daughter of Zion, compared here to a woman in travail, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "hath brought forth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be delivered out of captivity, compared here to a woman’s bringing forth, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 4:9,10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then the remnant of his brethren, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the brethren of the Messiah, those of Judah and Benjamin who were carried captive, shall return unto the children of Israel; being set free by Cyrus, shall return to their own land, and be there established; and they shall return with Israel rather than to: all this referring in the letter to their redemption out of Babylon, (which was the effect of the Messiah’s power and mercy towards them, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 4:10 5:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 5:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") hath a further reference to a more glorious redemption, and to intervening afflictions which should fall upon the Jews, from after their restitution and resettling in Canaan. unto the coming of the Messiah in the flesh when born of the Virgin; and that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " shall be fulfilled, when Messiah, Ben David, shall set up his kingdom, and deliver the whole Israel of God from their captivity under ignorance, sin, and hell, and shall bring in the Gentiles, that remnant of his brethren, and unite them to the true Israel, and make them one church to God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or nevertheless, as the particle will bear, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "will he, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God, the God of Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "give them up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the Chaldeans, to be wasted by them, and to be led into captivity, and to be afflicted there for their sins committed in their own land against God, until the time, until seventy years be expired, the time appointed for the punishing the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that she which travaileth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the daughter of Zion, compared here to a woman in travail, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "hath brought forth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be delivered out of captivity, compared here to a woman’s bringing forth, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 4:9,10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then the remnant of his brethren, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the brethren of the Messiah, those of Judah and Benjamin who were carried captive, shall return unto the children of Israel; being set free by Cyrus, shall return to their own land, and be there established; and they shall return with Israel rather than to: all this referring in the letter to their redemption out of Babylon, (which was the effect of the Messiah’s power and mercy towards them, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 4:10 5:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 5:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") hath a further reference to a more glorious redemption, and to intervening afflictions which should fall upon the Jews, from after their restitution and resettling in Canaan. unto the coming of the Messiah in the flesh when born of the Virgin; and that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " shall be fulfilled, when Messiah, Ben David, shall set up his kingdom, and deliver the whole Israel of God from their captivity under ignorance, sin, and hell, and shall bring in the Gentiles, that remnant of his brethren, and unite them to the true Israel, and make them one church to God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore will he give them up,.... Or \"notwithstanding\", as this particle signifies; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; though all this shall be, yet, previous to the birth of this person, the Lord would give up the Jews to trouble and distress, and into the hands of their enemies; and the time from this prophet to the birth of Christ was a time for the most part of great trouble to, the Jews; not only was their country invaded and their city besieged by Sennacherib in Hezekiah's time, but, some years after that, they were wholly carried captive into Babylon: and when they returned it was troublesome times with them; they met with many enemies that disturbed them while they were rebuilding the city and temple; and after that they endured much tribulation, in the times of Antiochus Epiphanes, or of the Maccabees; nor were they long in any quiet, nor in any settled state, unto the coming of the Messiah. Or else this is to be understood of what should be after his coming; for though Jesus was born at Bethlehem, according to this plain prophecy, and had all the characters of the Messiah in him, yet the Jews rejected him, and would not have him to reign over them: wherefore he, the Messiah, as Japhet interprets it, gave them up to judicial blindness and hardness of heart, and into the hands of their enemies the Romans; by whom they were destroyed or carried captive, and dispersed among the nations; in which condition they still remain, and will, until the times of the Gentiles be fulfilled; so long will Jerusalem be trodden under foot, or the Jews be given up to their will, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, as here expressed, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "until the time that she which travaileth hath brought forth: that is, according to the first sense until the Virgin Mary travailed in birth with the Messiah, and brought forth him her firstborn, Matthew 1:25; or according to the latter, until Zion, or, the church of God, travailed in prayer, in the ministry of the word, and brought forth many children to Christ, both among Jews and Gentiles; and the sense is, that the Jews shall be given up to distress and trouble, till the time of their conversion, see Isaiah 66:7; The Jews have a tradition in their Talmud, that ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "until the time that she which travaileth hath brought forth: that is, according to the first sense until the Virgin Mary travailed in birth with the Messiah, and brought forth him her firstborn, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or according to the latter, until Zion, or, the church of God, travailed in prayer, in the ministry of the word, and brought forth many children to Christ, both among Jews and Gentiles; and the sense is, that the Jews shall be given up to distress and trouble, till the time of their conversion, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 66:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; The Jews have a tradition in their Talmud, that ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the son of David would not come until the kingdom spreads itself over the whole world for nine months; as it is said, \"therefore will he give them up until the time that she that travaileth hath brought\" forth; which is the time of a woman's going with child.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This both Jarchi and Kimchi take notice of. In one place (p) it is called the kingdom of Aram or Syria; and in another (q) a blank is left for Edom, that is, Rome; for by the kingdom is meant the Roman empire, and which did extend all over the world before the coming of the Messiah Jesus, as appears from Luke 2:1; as well as from all profane history; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This both Jarchi and Kimchi take notice of. In one place (p) it is called the kingdom of Aram or Syria; and in another (q) a blank is left for Edom, that is, Rome; for by the kingdom is meant the Roman empire, and which did extend all over the world before the coming of the Messiah Jesus, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; as well as from all profane history; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "then the remnant of his brethren shall return to the children of Israel; that is, the brethren of the Messiah, as Kimchi and Abendana interpret it; who should return with the children of Israel, as both they and Jarchi explain it; to which the Targum agrees. Kimchi's note is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"\"the remnant of his brethren\"; they are the tribes of Judah and Benjamin, which remained when the ten tribes were carried captive; and the surnames, his brethren, relate to the Messiah.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So Abendana (r), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and \"the remnant his brethren\"; they are the tribes of Judah and Benjamin, they shall return with the children of Israel, who are the ten tribes; as if he should say, these and these shall return to their land, and King Messiah shall reign over them; and the surnames, his brethren, respect the Messiah.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And to the same purpose R. Isaac (s), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the remnant of the brethren of the Messiah, who are the children of Judah and Benjamin, that are left and remain of the calamities and persecutions of the captivities, shall return to their own land, together with the children of Israel, who are the ten tribes.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Meaning either the remnant, according to the election of grace, among the Gentiles; who with those among the Jews should be converted to Christ in the first times of the Gospel, those immediately following the birth of Christ; the Gospel being preached both to the Jews and Gentiles, and some of both were called and converted, and whom Christ owned as his brethren, and were not ashamed of; see Matthew 12:49 Hebrews 2:11; or the Lord's chosen people, and brethren of Christ, those of, he two tribes of Judah and Benjamin, and those of the ten tribes of Israel; who shall join and coalesce together in seeking the Messiah, embracing and professing him, and appointing him the one Head over them, when they will turn to the Lord, and all Israel shall be saved; see Jeremiah 50:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Meaning either the remnant, according to the election of grace, among the Gentiles; who with those among the Jews should be converted to Christ in the first times of the Gospel, those immediately following the birth of Christ; the Gospel being preached both to the Jews and Gentiles, and some of both were called and converted, and whom Christ owned as his brethren, and were not ashamed of; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or the Lord's chosen people, and brethren of Christ, those of, he two tribes of Judah and Benjamin, and those of the ten tribes of Israel; who shall join and coalesce together in seeking the Messiah, embracing and professing him, and appointing him the one Head over them, when they will turn to the Lord, and all Israel shall be saved; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) T. Bab. Yoma, fol. 10. 1.((q) T. Bab. Sanhedrin, fol. 98. 2.((r) Not. in Miclol Yophi in loc. (s) Chizzuk Emunah, par. 1. p. 281. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) T. Bab. Yoma, fol. 10. 1.((q) T. Bab. Sanhedrin, fol. 98. 2.((r) Not. in Miclol Yophi in loc. (s) Chizzuk Emunah, par. 1. p. 281. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore will he give them up, until the time that {d} she which travaileth hath brought forth: then the remnant of his brethren shall return unto the children of Israel.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore will he give them up, until the time ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " she which travaileth hath brought forth: then the remnant of his brethren shall return unto the children of Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) He compares the Jews to women with child, who for a time would have great sorrows, but at length they would have a comfortable deliverance; Joh 16:21.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. because the deliverance of Israel is to be a work of pure grace, and to proceed from the insignificant Bethlehem. It is assumed that the family of David will have sunk down as low as that of Jesse originally was—the same anticipation which we find expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘There shall come forth a shoot from the stump of Jesse.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will he give them up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Jehovah will deliver Israel into the hands of its foes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "she which travaileth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. she who is to bear. Probably (though this is not quite free from doubt) this is an allusion to Isaiah’s great prophecy of Immanuel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—a prophecy vague, it is true, and open to various interpretations, but most likely referring to the Messiah (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Micah 5:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "then the remnant of his brethren shall return",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and (until) the remnant of his brethren return",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ‘Return’ may be taken either in a physical or in a spiritual sense. If in the former, the ‘remnant’ will mean the exiles of Israel, wherever they might be scattered, including those of the Ten Tribes; if in the latter, it will refer rather to the Judæans who had escaped in the Judgment. The return of the long-lost tribes, and the thorough conversion of his own people, were equally upon the heart of the prophet.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or (if we explain ‘return’ = ‘be converted’), ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because God hath designed to punish before delivering, and this deliverance is to arise from the little Bethlehem, not from Jerusalem. This presupposes that the house of David will have lost the throne and have been reduced to a low condition. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will he give them up.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jehovah will give up the people to its enemies; this is the way in which the house of David shall come to low estate. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "She which travaileth hath brought forth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Many commentators have taken the travailing woman to be the afflicted community of Israel, or Zion; but we may not altogether reject the old interpretation which regards this as a prophecy of the birth of Christ from the Virgin, in accordance with the received Messianic exposition of Isaiah's great prediction, \"Behold, the virgin shall conceive\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Such an announcement comes in naturally after the announcement of the Ruler coming forth from Bethlehem. Israel shall be oppressed until the time ordained when \"she who is to bear\" shall bring forth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " until) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the remnant of his brethren shall return unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the children of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The remnant of his brethren are the rescued of the Judaeans, who are the brethren of Messiah according to the flesh; these in a literal sense shall return from exile together with the others, and in a spiritual sense shall be converted and be joined with the true Israelites, the true seeder Abraham. Micah 5:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Therefore will He give them up until the time when a travailing woman hath brought forth, and the remnant of His brethren will return, together with the sons of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And He will stand and feed in the strength of Jehovah, in the majesty of the name of Jehovah His God, and they will dwell, for now will He be great to the ends of the earth.\" \"Therefore\" (lâkhēn): i.e., \"because the great divine Ruler of Israel, from whom alone its redemption can proceed, will spring from the little Bethlehem, and therefore from the degraded family of David\" (Caspari). This is the correct explanation; for the reason why Israel is to be given up to the power of the nations of the world, and not to be rescued earlier, does not lie in the appearance of the Messiah as such, but in His springing from little Bethlehem. The birth of the Messiah in Bethlehem, and not in Jerusalem the city of David, presupposes that the family of David, out of which it is to spring, will have lost the throne, and have fallen into poverty. This could only arise from the giving up of Israel into the power of its enemies. Micah had already stated clearly enough in what precedes, that this fate would fall upon the nation and the royal house of David, on account of its apostasy from the Lord; so that he could overlook this here, and give prominence to the other side alone, namely to the fact that, according to the counsel of God, the future Deliverer and Ruler of Israel would also resemble His royal ancestor David in the fact that He was not to spring from Zion the royal city built on high, but from the insignificant country town of Bethlehem, and that for this very reason Israel was to remain so long under the power of the nations of the world. The suffix attached to יתּנם points to ישׂראל in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and נתן is applied, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 14:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the surrender of Israel into the power of its enemies as a punishment for its sins. This surrender is not the last of many oppressions, which are to take place in the period before the birth of the Messiah (the Roman oppression), but a calamity lasting from the present time, or the coming of the judgment threatened in ch. 3, until the time of the Messiah's coming; and יתּנם points back not merely to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but also to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The travailing woman (yōlēdâh) is not the community of Israel (Theodoret, Calvin, Vitringa, and others), but the mother of the Messiah (Cyril, and most of the Christian expositors, including even Ewald and Hitzig). The supposition that the congregation is personified here, is precluded not only by the fact that in the very same sentence the sons of Israel are spoken of in the plural, but still more by the circumstance that in that case the bringing forth would be only a figurative representation of the joy following the pain, in which the obvious allusion in the words to the Messiah, which is required by the context, and especially by the suffix to אחיו, which refers to the Messiah, and presupposes that His birth is referred to in יולדה ילדה, would entirely fall away. But Micah had all the more ground for speaking of this, inasmuch as Isaiah had already predicted the birth of the Messiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). יולדה has no article, and the travailing woman is thereby left indefinite, because the thought, \"till He is born,\" or \"till a mother shall bring Him forth,\" upon which alone the whole turns, did not require any more precise definition.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the second clause of the verse there commences the description of the blessing, which the birth of the Messiah will bring to Israel. The first blessing will be the return of those that remain of Israel to the Lord their God. אחיו, the brethren of the Ruler born at Bethlehem, are the Judaeans as the members of the Messiah's own tribe; just as, in 2 Samuel 19:13, David calls the Judaeans his brethren, his flesh and bone, in contrast with the rest of the Israelites. יתר אחיו, the remnant of his brethren, are those who are rescued from the judgment that has fallen upon Judah; yether, as in Zephaniah 2:9 and Zechariah 14:2, denoting the remnant, in distinction from those who have perished ( equals  שׁארית, Micah 2:12; Micah 4:7, etc.). ישׁוּבוּן, to return, not from exile to Canaan, but to Jehovah, i.e., to be concerted. על־בּגי ישׂ, not \"to the sons of Israel;\" for although שׁוּב, construed with על, is met with in the sense of outward return (e.g., Proverbs 26:11) as well as in that of spiritual return to the Lord (2 Chronicles 30:9), the former explanation would not give any suitable meaning here, not only because \"the sons of Israel,\" as distinguished from the brethren of the Messiah, could not possibly denote the true members of the nation of God, but also because the thought that the Judaeans are to return, or be converted, to the Israelites of the ten tribes, is altogether unheard of, and quite at variance with the idea which runs through all the prophetic Scriptures of the Old Testament, - namely, that after the division of the kingdom, Judah formed the kernel of the covenant nation, with which the rebellious Israelites were to be united once more. על signifies here together with, at the same time as (Hofmann, Caspari), as in Jeremiah 3:18 with the verb ילכוּ, and in Exodus 35:22 with בּוא; and \"the sons of Israel\" are the Israelites of the ten tribes, and, in this connection, those that are left of the ten tribes. There is no ground for the objection offered by Hengstenberg to this explanation, namely, that \"it is absurd that the ten tribes should appear to be the principal persons redeemed;\" for this is not implied in the words. The meaning \"together with,\" for על, is not derived from the primary meaning, thereupon, in addition to, insuper, as Ewald supposes (217, i), nor from the idea of accompanying, as Ges. and Dietrich maintain. The persons introduced with על are never the principal objects, as the two passages quoted sufficiently prove. The women in Exodus 35:22 (על הנּשׁים) are not the principal persons, taking precedence of the men; nor is the house of Israel placed above the house of Judah in Jeremiah 3:18. The use of על in the sense of together with has been developed rather from the idea of protecting, shielding, as in Genesis 32:12, slaying the mothers upon, i.e., together with, the children, the mothers being thought of as screening the children, as Hosea 10:14 and other passages clearly show. Consequently the person screening the other is the principal person, and not the one covered or screened. And so here, the brethren of the Messiah, like the sons of Judah in Jeremiah 3:18, which passages is generally so like the one before us that it might be regarded as an exposition of it, are those who first receive the blessing coming from the Messiah; and the sons of Israel are associated with them as those to whom this blessing only comes in fellowship with them. In Micah 5:3 there follows what the Messiah will do for Israel when it has returned to God. He will feed it (עמר simply belongs to the pictorial description, as in Isaiah 61:5) in the strength of Jehovah. The feeding, as a frequent figure for governing, reminds of David, whom the Lord had called from the flock to be the shepherd of His people (2 Samuel 5:2). This is done in the strength of Jehovah, with which He is invested, to defend His flock against wolves and robbers (see John 10:11-12).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the second clause of the verse there commences the description of the blessing, which the birth of the Messiah will bring to Israel. The first blessing will be the return of those that remain of Israel to the Lord their God. אחיו, the brethren of the Ruler born at Bethlehem, are the Judaeans as the members of the Messiah's own tribe; just as, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 19:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", David calls the Judaeans his brethren, his flesh and bone, in contrast with the rest of the Israelites. יתר אחיו, the remnant of his brethren, are those who are rescued from the judgment that has fallen upon Judah; yether, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", denoting the remnant, in distinction from those who have perished ( equals  שׁארית, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.). ישׁוּבוּן, to return, not from exile to Canaan, but to Jehovah, i.e., to be concerted. על־בּגי ישׂ, not \"to the sons of Israel;\" for although שׁוּב, construed with על, is met with in the sense of outward return (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 26:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as well as in that of spiritual return to the Lord (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 30:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the former explanation would not give any suitable meaning here, not only because \"the sons of Israel,\" as distinguished from the brethren of the Messiah, could not possibly denote the true members of the nation of God, but also because the thought that the Judaeans are to return, or be converted, to the Israelites of the ten tribes, is altogether unheard of, and quite at variance with the idea which runs through all the prophetic Scriptures of the Old Testament, - namely, that after the division of the kingdom, Judah formed the kernel of the covenant nation, with which the rebellious Israelites were to be united once more. על signifies here together with, at the same time as (Hofmann, Caspari), as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with the verb ילכוּ, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with בּוא; and \"the sons of Israel\" are the Israelites of the ten tribes, and, in this connection, those that are left of the ten tribes. There is no ground for the objection offered by Hengstenberg to this explanation, namely, that \"it is absurd that the ten tribes should appear to be the principal persons redeemed;\" for this is not implied in the words. The meaning \"together with,\" for על, is not derived from the primary meaning, thereupon, in addition to, insuper, as Ewald supposes (217, i), nor from the idea of accompanying, as Ges. and Dietrich maintain. The persons introduced with על are never the principal objects, as the two passages quoted sufficiently prove. The women in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (על הנּשׁים) are not the principal persons, taking precedence of the men; nor is the house of Israel placed above the house of Judah in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The use of על in the sense of together with has been developed rather from the idea of protecting, shielding, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", slaying the mothers upon, i.e., together with, the children, the mothers being thought of as screening the children, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and other passages clearly show. Consequently the person screening the other is the principal person, and not the one covered or screened. And so here, the brethren of the Messiah, like the sons of Judah in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which passages is generally so like the one before us that it might be regarded as an exposition of it, are those who first receive the blessing coming from the Messiah; and the sons of Israel are associated with them as those to whom this blessing only comes in fellowship with them. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " there follows what the Messiah will do for Israel when it has returned to God. He will feed it (עמר simply belongs to the pictorial description, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in the strength of Jehovah. The feeding, as a frequent figure for governing, reminds of David, whom the Lord had called from the flock to be the shepherd of His people (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This is done in the strength of Jehovah, with which He is invested, to defend His flock against wolves and robbers (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The word \"feed\" expresses what Christ is towards His people, the flock committed to His care. He does not rule over the church like a formidable tyrant, who oppresses his people by fear; but He is a shepherd, and leads His sheep with all the gentleness to be desired. And inasmuch as we are surrounded on all sides by enemies, the prophet adds, \"He will feed in the strength,\" etc.; i.e., as much power as there is in God, so much protection will there be in Christ, whenever it shall be necessary to defend the church, and guard it against its foes (Calvin).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This strength is not merely the divine authority with which earthly rulers are usually endowed (1 Samuel 2:10), but גּאון, i.e., the exaltation or majesty of the name of Jehovah, the majesty in which Jehovah manifests His deity on earth. The Messiah is El gibbōr (the Mighty God, Isaiah 9:5), and equipped with the spirit of might (rūăch gebhūrâh, Isaiah 11:2). \"Of His God;\" for Jehovah is the God of this Shepherd or Ruler, i.e., He manifests Himself as God to Him more than to any other; so that the majesty of Jehovah is revealed in what He does. In consequence of this feeding, they (the sons of Israel) sit (yâshâbhū), without being disturbed (cf. Micah 4:4; Leviticus 26:5-6; 2 Samuel 7:10), i.e., will live in perfect undisturbed peace under His pastoral care. For He (the Messiah) will now (עתּה, now, referring to the time when He feeds Israel, in contrast with the former oppression) be great (auctoritate et potentia valebit: Maurer) to the ends of the earth, i.e., His authority will extend over the whole earth. Compare the expression in Luke 1:32, οὗτος ἔσται μέγας, which has sprung from the passage before us, and the parallel in Malachi 1:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This strength is not merely the divine authority with which earthly rulers are usually endowed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but גּאון, i.e., the exaltation or majesty of the name of Jehovah, the majesty in which Jehovah manifests His deity on earth. The Messiah is El gibbōr (the Mighty God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and equipped with the spirit of might (rūăch gebhūrâh, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). \"Of His God;\" for Jehovah is the God of this Shepherd or Ruler, i.e., He manifests Himself as God to Him more than to any other; so that the majesty of Jehovah is revealed in what He does. In consequence of this feeding, they (the sons of Israel) sit (yâshâbhū), without being disturbed (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., will live in perfect undisturbed peace under His pastoral care. For He (the Messiah) will now (עתּה, now, referring to the time when He feeds Israel, in contrast with the former oppression) be great (auctoritate et potentia valebit: Maurer) to the ends of the earth, i.e., His authority will extend over the whole earth. Compare the expression in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", οὗτος ἔσται μέγας, which has sprung from the passage before us, and the parallel in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]