[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A covenant of the Lord with thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It may at first sight seem strange that we have these last meetings of David and Jonathan told us in such detail—the speaker’s very words quoted, and so many apparently trivial circumstances related.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The question, too, might be asked: Whence did the compiler of the book derive his intimate acquaintance with what took place at these meetings, when David was alone with Jonathan? But the difficulties are only surface ones, for we must never forget how intensely interesting to the chosen people were all the circumstances connected with their loved king’s life—never lose sight of the deathless interest with which they would hear and read the particulars of David’s rise through great suffering and long trial to the throne; and this period here related in such detail was the turning-point of a grand career. From this moment, David’s way diverged from the every-day life of ordinary duty and prosperity, and became, during a long and weary period, for him the way of almost uninterrupted suffering. The way of suffering and of trial is in all ages the royal road to true greatness. As to the source whence the compiler of the book derived his knowledge of what passed at these last meetings of the two friends, Ewald suggests that when in after years David drew to his Court the posterity of Jonathan, he often told them himself of these last events before their separation (events with which no one but the two friends could be acquainted).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The question, too, might be asked: Whence did the compiler of the book derive his intimate acquaintance with what took place at these meetings, when David was ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "alone ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "with Jonathan? But the difficulties are only surface ones, for we must never forget how intensely interesting to the chosen people were all the circumstances connected with their loved king’s life—never lose sight of the deathless interest with which they would hear and read the particulars of David’s rise through great suffering and long trial to the throne; and this period here related in such detail was the turning-point of a grand career. From this moment, David’s way diverged from the every-day life of ordinary duty and prosperity, and became, during a long and weary period, for him the way of almost uninterrupted suffering. The way of suffering and of trial is in all ages the royal road to true greatness. As to the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "source ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "whence the compiler of the book derived his knowledge of what passed at these last meetings of the two friends, Ewald suggests that when in after years David drew to his Court the posterity of Jonathan, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "he often told them himself of these last events before their separation ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(events with which no one but the two friends could be acquainted).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Slay me thyself.—“This supposes that Jonathan had the right to inflict capital punishment for crimes against his father as king.”—Lange. This was David’s last earnest request to the prince. If Jonathan felt there was any truth in the charges brought against him by Saul—if he deemed his friend a traitor to the reigning dynasty—let him slay the betrayer himself there and then.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Slay me thyself.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—“This supposes that Jonathan had the right to inflict capital punishment for crimes against his father as king.”—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Lange. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This was David’s last earnest request to the prince. If Jonathan felt there was any truth in the charges brought against him by Saul—if ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "he ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "deemed his friend a traitor to the reigning dynasty—let him slay the betrayer himself there and then.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 20:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 20:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt deal kindly with thy servant ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In giving me timely notice, and a true account of Saul’s disposition and intention toward me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A covenant of the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, a solemn covenant, not lightly undertaken, but seriously entered into, in the name and fear of God, and in his presence, calling him to be the witness of our sincerity therein, and the avenger of perfidiousness in him that breaks it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Slay me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I am contented thou shouldest kill me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For why — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Why shouldest thou betray me to thy father, by concealing his evil intentions from me?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:1-10 The trials David met with, prepared him for future advancement. Thus the Lord deals with those whom he prepares unto glory. He does not put them into immediate possession of the kingdom, but leads them to it through much tribulation, which he makes the means of fitting them for it. Let them not murmur at his gracious appointment, nor distrust his care; but let them look forward with joyful expectation to the crown which is laid up for them. Sometimes it appears to us that there is but a step between us and death; at all times it may be so, and we should prepare for the event. But though dangers appear most threatening, we cannot die till the purpose of God concerning us is accomplished; nor till we have served our generation according to his will, if we are believers. Jonathan generously offers David his services. This is true friendship. Thus Christ testifies his love to us, Ask, and it shall be done for you; and we must testify our love to him, by keeping his commandments.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The new moon, or beginning of each month, was celebrated with especial sacrifices and blowing of trumpets (marginal references.) The feast was kept with great solemnity as \"a day of gladness,\" and we may presume that the \"peace offerings\" offered on the occasion furnished the tables of those that offered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. David said unto Jonathan, Behold, to-morrow the new moon, and I should not fail to sit with the king at meat—The beginning of a new month or moon was always celebrated by special sacrifices, followed by feasting, at which the head of a family expected all its members to be present. David, both as the king's son-in-law and a distinguished courtier, dined on such occasions at the royal table, and from its being generally known that David had returned to Gibeah, his presence in the palace would be naturally expected. This occasion was chosen by the two friends for testing the king's state of feeling. As a suitable pretext for David's absence, it was arranged that he should visit his family at Beth-lehem, and thus create an opportunity of ascertaining how his non-appearance would be viewed. The time and place were fixed for Jonathan reporting to David; but as circumstances might render another interview unsafe, it was deemed expedient to communicate by a concerted signal.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou shalt deal kindly with thy servant, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in giving me timely notice, and a true account of Saul’s disposition and intention towards me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A covenant of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. a solemn covenant, not lightly undertaken, but seriously entered into, in the name and fear of God, and in his presence, calling him to be the witness of our sincerity therein, and the avenger of perfidiousness in him that breaks it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Slay me thyself; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I am contented thou shouldst kill me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Why shouldest thou bring me to thy father?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " why shouldst thou betray me to thy father, by concealing his evil intentions from me? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore thou shall deal kindly with thy servant,.... By informing him how his father's mind stood affected to him, that he might conduct himself accordingly, either by appearing at court, or by providing for his safety by flight: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for thou hast brought thy servant into a covenant of the Lord with thee; a covenant of friendship between Jonathan and David, of which Jonathan was the first mover, and so is said to bring or persuade him into it; called the covenant of the Lord, because made in his name and fear, and before him as a witness of it; and this David pleads as an argument with Jonathan, to deal kindly and faithfully by him in the present case: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "notwithstanding, if there be in me iniquity, slay me thyself: or pass sentence upon him to be slain; which, if guilty, he might have power to do in his father's absence, and which David desires might be done, notwithstanding the covenant of friendship between them, should he appear to deserve it by any action of his, of which he was not conscious; this expresses the strong sense he had of his own integrity, and served to confirm Jonathan in his opinion of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for why shouldest thou bring me to thy father? deliver him up into his hands to be put to a cruel death by him, or give him the trouble of doing it, when he might as well dispatch him at once. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for why shouldest thou bring me to thy father? deliver him up into his hands to be put to a cruel death by him, or give him the trouble of doing it, when he might as well dispatch him at once. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore thou shalt deal kindly with thy servant; for thou hast brought thy servant into a covenant of the LORD with thee: notwithstanding, if there be in me iniquity, slay me thyself; for why shouldest thou bring me to thy father?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou hast brought",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The initiative had been on Jonathan’s side (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). David calls their league of friendship “a covenant of Jehovah” as being ratified in His name by solemn oath. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Samuel 20:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 20:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou hast brought thy servant into a covenant of Jehovah with thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As the friendship between Jonathan and David had been cemented by the invocation of the name of Jehovah, it was one firm and assured, and David might look not merely for one act of kindness, but for constant truth and help. It was, moreover, Jonathan's own doing; and yet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "if there be in me,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " David says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "iniquity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " treason against Saul, if I have not been a faithful and true servant to him, but, on the contrary, have plotted evil against him, or now entertain any evil designs, then let the covenant be abrogated. David refuses to shelter himself under it if he has incurred guilt, and only asks that Jonathan, by the authority which he exercised as the king's son, should himself put him to death, and not deliver him up to Saul 1 Samuel 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "David made sure that Jonathan would grant this request on account of his friendship, as he had brought him into a covenant of Jehovah with himself. David calls the covenant of friendship with Jonathan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a covenant of Jehovah, because he had made it with a solemn invocation of Jehovah. But in order to make quite sure of the fulfilment of his request on the part of Jonathan, David added, \"But if there is a fault in me, do thou kill me (אתּה used to strengthen the suffix); for why wilt thou bring me to thy father?\" sc., that he may put me to death.",
        "children": []
      }
    ]
  }
]