[{"num":15,"verse":"Now the tax collectors and [notorious and especially wicked] sinners were all coming near to [Jesus] to listen to Him."},{"num":2,"verse":"And the Pharisees and the scribes kept muttering and indignantly complaining, saying, This man accepts and receives and welcomes [preeminently wicked] sinners and eats with them."},{"num":3,"verse":"So He told them this parable:"},{"num":4,"verse":"What man of you, if he has a hundred sheep and should lose one of them, does not leave the ninety-nine in the wilderness (desert) and go after the one that is lost until he finds it?"},{"num":5,"verse":"And when he has found it, he lays it on his [own] shoulders, rejoicing."},{"num":6,"verse":"And when he gets home, he summons together [his] friends and [his] neighbors, saying to them, Rejoice with me, because I have found my sheep which was lost."},{"num":7,"verse":"Thus, I tell you, there will be more joy in heaven over one [especially] wicked person who repents (changes his mind, abhorring his errors and misdeeds, and determines to enter upon a better course of life) than over ninety-nine righteous persons who have no need of repentance."},{"num":8,"verse":"Or what woman, having ten [silver] drachmas [each one equal to a day’s wages], if she loses one coin, does not light a lamp and sweep the house and look carefully and diligently until she finds it?"},{"num":9,"verse":"And when she has found it, she summons her [women] friends and neighbors, saying, Rejoice with me, for I have found the silver coin which I had lost."},{"num":10,"verse":"Even so, I tell you, there is joy among and in the presence of the angels of God over one [especially] wicked person who repents (changes his mind for the better, heartily amending his ways, with abhorrence of his past sins)."},{"num":11,"verse":"And He said, There was a certain man who had two sons;"},{"num":12,"verse":"And the younger of them said to his father, Father, give me the part of the property that falls [to me]. And he divided the estate between them."},{"num":13,"verse":"And not many days after that, the younger son gathered up all that he had and journeyed into a distant country, and there he wasted his fortune in reckless and loose [from restraint] living."},{"num":14,"verse":"And when he had spent all he had, a mighty famine came upon that country, and he began to fall behind and be in want."},{"num":15,"verse":"So he went and forced (glued) himself upon one of the citizens of that country, who sent him into his fields to feed hogs."},{"num":16,"verse":"And he would gladly have fed on and filled his belly with the carob pods that the hogs were eating, but [they could not satisfy his hunger and] nobody gave him anything [better]."},{"num":17,"verse":"Then when he came to himself, he said, How many hired servants of my father have enough food, and [even food] to spare, but I am perishing (dying) here of hunger!"},{"num":18,"verse":"I will get up and go to my father, and I will say to him, Father, I have sinned against heaven and in your sight."},{"num":19,"verse":"I am no longer worthy to be called your son; [just] make me like one of your hired servants."},{"num":20,"verse":"So he got up and came to his [own] father. But while he was still a long way off, his father saw him and was moved with pity and tenderness [for him]; and he ran and embraced him and kissed him [fervently]."},{"num":21,"verse":"And the son said to him, Father, I have sinned against heaven and in your sight; I am no longer worthy to be called your son [I no longer deserve to be recognized as a son of yours]!"},{"num":22,"verse":"But the father said to his bond servants, Bring quickly the best robe (the festive robe of honor) and put it on him; and give him a ring for his hand and sandals for his feet."},{"num":23,"verse":"And bring out that [wheat-]fattened calf and kill it; and let us revel and feast and be happy and make merry,"},{"num":24,"verse":"Because this my son was dead and is alive again; he was lost and is found! And they began to revel and feast and make merry."},{"num":25,"verse":"But his older son was in the field; and as he returned and came near the house, he heard music and dancing."},{"num":26,"verse":"And having called one of the servant [boys] to him, he began to ask what this meant."},{"num":27,"verse":"And he said to him, Your brother has come, and your father has killed that [wheat-]fattened calf, because he has received him back safe and well."},{"num":28,"verse":"But [the elder brother] was angry [with deep-seated wrath] and resolved not to go in. Then his father came out and began to plead with him,"},{"num":29,"verse":"But he answered his father, Look! These many years I have served you, and I have never disobeyed your command. Yet you never gave me [so much as] a [little] kid, that I might revel and feast and be happy and make merry with my friends;"},{"num":30,"verse":"But when this son of yours arrived, who has devoured your estate with immoral women, you have killed for him that [wheat-] fattened calf!"},{"num":31,"verse":"And the father said to him, Son, you are always with me, and all that is mine is yours."},{"num":32,"verse":"But it was fitting to make merry, to revel and feast and rejoice, for this brother of yours was dead and is alive again! He was lost and is found!"}]