[{"header":"The Lost Sheep"},{"num":15,"verse":"All the tax collectors and sinners were coming to Jesus to hear him. "},{"num":2,"verse":"But the Pharisees and the experts in the law were complaining, “This man welcomes sinners and eats with them.”"},{"num":3,"verse":"He told them this parable: "},{"num":4,"verse":"“Which one of you, if you had one hundred sheep and lost one of them, would not leave the ninety-nine in the wilderness and go after the one that was lost until he finds it? "},{"num":5,"verse":"And when he finds it, he joyfully puts it on his shoulders "},{"num":6,"verse":"and goes home. Then he calls together his friends and his neighbors, telling them, ‘Rejoice with me, because I have found my lost sheep!’ "},{"num":7,"verse":"I tell you, in the same way there will be more joy in heaven over one sinner who repents than over ninety-nine righteous people who do not need to repent."},{"header":"The Lost Coin"},{"num":8,"verse":"“Or what woman who has ten silver coins, if she loses one coin, would not light a lamp, sweep the house, and search carefully until she finds it? "},{"num":9,"verse":"And when she finds it, she calls together her friends and neighbors and says, ‘Rejoice with me, because I have found the lost coin.’ "},{"num":10,"verse":"In the same way, I tell you, there is joy in the presence of the angels of God over one sinner who repents.”"},{"header":"The Lost Son"},{"num":11,"verse":"Jesus said, “A certain man had two sons. "},{"num":12,"verse":"The younger of them said to his father, ‘Father, give me my share of the estate.’ So he divided his property between them. "},{"num":13,"verse":"Not many days later, the younger son gathered together all that he had and traveled to a distant country. There he wasted his wealth with reckless living. "},{"num":14,"verse":"After he had spent everything, there was a severe famine in that country, and he began to be in need. "},{"num":15,"verse":"He went and hired himself out to one of the citizens of that country, who sent him into his fields to feed pigs. "},{"num":16,"verse":"He would have liked to fill his stomach with the carob pods that the pigs were eating, but no one gave him anything."},{"num":17,"verse":"“When he came to his senses, he said, ‘How many of my father’s hired servants have more than enough bread, and I am dying from hunger! "},{"num":18,"verse":"I will get up, go to my father, and tell him, “Father, I have sinned against heaven and in your sight. "},{"num":19,"verse":"I am no longer worthy to be called your son. Make me like one of your hired servants.”’"},{"num":20,"verse":"“He got up and went to his father. While he was still far away, his father saw him and was filled with compassion. He ran, hugged his son, and kissed him. "},{"num":21,"verse":"The son said to him, ‘Father, I have sinned against heaven and in your sight. I am no longer worthy to be called your son.’"},{"num":22,"verse":"“But the father said to his servants, ‘Quick, bring out the best robe and put it on him. Put a ring on his finger and sandals on his feet. "},{"num":23,"verse":"Bring the fattened calf and kill it. Let us eat and celebrate, "},{"num":24,"verse":"because this son of mine was dead and is alive again. He was lost and is found.’ Then they began to celebrate."},{"num":25,"verse":"“His older son was in the field. As he approached the house, he heard music and dancing. "},{"num":26,"verse":"He called one of the servants and asked what was going on. "},{"num":27,"verse":"The servant told him, ‘Your brother is here! Your father killed the fattened calf, because he has received him back safe and sound.’ "},{"num":28,"verse":"The older brother was angry and refused to go in. His father came out and began to plead with him."},{"num":29,"verse":"“He answered his father, ‘Look, these many years I’ve been serving you, and I never disobeyed your command, but you never gave me even a young goat so that I could celebrate with my friends. "},{"num":30,"verse":"But when this son of yours arrived after wasting your property with prostitutes, you killed the fattened calf for him!’"},{"num":31,"verse":"“The father said to him, ‘Son, you are always with me, and all that I have is yours. "},{"num":32,"verse":"But it was fitting to celebrate and be glad, because this brother of yours was dead and is alive again. He was lost and is found.’”"}]