[{"header":"The Lost Sheep(A)"},{"num":15,"verse":"All the tax collectors and sinners came to listen to Jesus. "},{"num":2,"verse":"But the Pharisees and the experts in Moses’ Teachings complained, “This man welcomes sinners and eats with them.”"},{"num":3,"verse":"Jesus spoke to them using this illustration: "},{"num":4,"verse":"“Suppose a man has 100 sheep and loses one of them. Doesn’t he leave the 99 sheep grazing in the pasture and look for the lost sheep until he finds it? "},{"num":5,"verse":"When he finds it, he’s happy. He puts that sheep on his shoulders and "},{"num":6,"verse":"goes home. Then he calls his friends and neighbors together and says to them, ‘Let’s celebrate! I’ve found my lost sheep!’ "},{"num":7,"verse":"I can guarantee that there will be more happiness in heaven over one person who turns to God and changes the way he thinks and acts than over 99 people who already have turned to God and have his approval.”"},{"header":"The Lost Coin"},{"num":8,"verse":"“Suppose a woman has ten coins and loses one. Doesn’t she light a lamp, sweep the house, and look for the coin carefully until she finds it? "},{"num":9,"verse":"When she finds it, she calls her friends and neighbors together and says, ‘Let’s celebrate! I’ve found the coin that I lost.’ "},{"num":10,"verse":"So I can guarantee that God’s angels are happy about one person who turns to God and changes the way he thinks and acts.”"},{"header":"The Lost Son"},{"num":11,"verse":"Then Jesus said, “A man had two sons. "},{"num":12,"verse":"The younger son said to his father, ‘Father, give me my share of the property.’ So the father divided his property between his two sons."},{"num":13,"verse":"“After a few days, the younger son gathered his possessions and left for a country far away from home. There he wasted everything he had on a wild lifestyle. "},{"num":14,"verse":"He had nothing left when a severe famine spread throughout that country. He had nothing to live on. "},{"num":15,"verse":"So he got a job from someone in that country and was sent to feed pigs in the fields. "},{"num":16,"verse":"No one in the country would give him any food, and he was so hungry that he would have eaten what the pigs were eating."},{"num":17,"verse":"“Finally, he came to his senses. He said, ‘How many of my father’s hired men have more food than they can eat, while I’m starving to death here? "},{"num":18,"verse":"I’ll go at once to my father, and I’ll say to him, “Father, I’ve sinned against heaven and you. "},{"num":19,"verse":"I don’t deserve to be called your son anymore. Make me one of your hired men.” ’"},{"num":20,"verse":"“So he went at once to his father. While he was still at a distance, his father saw him and felt sorry for him. He ran to his son, put his arms around him, and kissed him. "},{"num":21,"verse":"Then his son said to him, ‘Father, I’ve sinned against heaven and you. I don’t deserve to be called your son anymore.’ "},{"num":22,"verse":"“The father said to his servants, ‘Hurry! Bring out the best robe, and put it on him. Put a ring on his finger and sandals on his feet. "},{"num":23,"verse":"Bring the fattened calf, kill it, and let’s celebrate with a feast. "},{"num":24,"verse":"My son was dead and has come back to life. He was lost but has been found.’ Then they began to celebrate."},{"num":25,"verse":"“His older son was in the field. As he was coming back to the house, he heard music and dancing. "},{"num":26,"verse":"He called to one of the servants and asked what was happening."},{"num":27,"verse":"“The servant told him, ‘Your brother has come home. So your father has killed the fattened calf to celebrate your brother’s safe return.’"},{"num":28,"verse":"“Then the older son became angry and wouldn’t go into the house. His father came out and begged him to come in. "},{"num":29,"verse":"But he answered his father, ‘All these years I’ve worked like a slave for you. I’ve never disobeyed one of your commands. Yet, you’ve never given me so much as a little goat for a celebration with my friends. "},{"num":30,"verse":"But this son of yours spent your money on prostitutes, and when he came home, you killed the fattened calf for him.’"},{"num":31,"verse":"“His father said to him, ‘My child, you’re always with me. Everything I have is yours. "},{"num":32,"verse":"But we have something to celebrate, something to be happy about. This brother of yours was dead but has come back to life. He was lost but has been found.’ ”"}]