[{"header":"The Story of the Lost Sheep"},{"num":15,"verse":"The tax collectors and sinners were all gathering around to hear Jesus. "},{"num":2,"verse":"But the Pharisees and the teachers of the law were whispering among themselves. They said, “This man welcomes sinners and eats with them.”"},{"num":3,"verse":"Then Jesus told them a story. "},{"num":4,"verse":"He said, “Suppose one of you has 100 sheep and loses one of them. Won’t he leave the 99 in the open country? Won’t he go and look for the one lost sheep until he finds it? "},{"num":5,"verse":"When he finds it, he will joyfully put it on his shoulders "},{"num":6,"verse":"and go home. Then he will call his friends and neighbors together. He will say, ‘Be joyful with me. I have found my lost sheep.’ "},{"num":7,"verse":"I tell you, it will be the same in heaven. There will be great joy when one sinner turns away from sin. Yes, there will be more joy than for 99 godly people who do not need to turn away from their sins."},{"header":"The Story of the Lost Coin"},{"num":8,"verse":"“Or suppose a woman has ten silver coins and loses one. Won’t she light a lamp and sweep the house? Won’t she search carefully until she finds the coin? "},{"num":9,"verse":"And when she finds it, she will call her friends and neighbors together. She will say, ‘Be joyful with me. I have found my lost coin.’ "},{"num":10,"verse":"I tell you, it is the same in heaven. There is joy in heaven over one sinner who turns away from sin.”"},{"header":"The Story of the Lost Son"},{"num":11,"verse":"Jesus continued, “There was a man who had two sons. "},{"num":12,"verse":"The younger son spoke to his father. He said, ‘Father, give me my share of the family property.’ So the father divided his property between his two sons."},{"num":13,"verse":"“Not long after that, the younger son packed up all he had. Then he left for a country far away. There he wasted his money on wild living. "},{"num":14,"verse":"He spent everything he had. Then the whole country ran low on food. So the son didn’t have what he needed. "},{"num":15,"verse":"He went to work for someone who lived in that country. That person sent the son to the fields to feed the pigs. "},{"num":16,"verse":"The son wanted to fill his stomach with the food the pigs were eating. But no one gave him anything."},{"num":17,"verse":"“Then he began to think clearly again. He said, ‘How many of my father’s hired servants have more than enough food! But here I am dying from hunger! "},{"num":18,"verse":"I will get up and go back to my father. I will say to him, “Father, I have sinned against heaven. And I have sinned against you. "},{"num":19,"verse":"I am no longer fit to be called your son. Make me like one of your hired servants.” ’ "},{"num":20,"verse":"So he got up and went to his father."},{"num":21,"verse":"“The son said to him, ‘Father, I have sinned against heaven and against you. I am no longer fit to be called your son.’"},{"num":22,"verse":"“But the father said to his servants, ‘Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet. "},{"num":23,"verse":"Bring the fattest calf and kill it. Let’s have a feast and celebrate. "},{"num":24,"verse":"This son of mine was dead. And now he is alive again. He was lost. And now he is found.’ So they began to celebrate."},{"num":25,"verse":"“The older son was in the field. When he came near the house, he heard music and dancing. "},{"num":26,"verse":"So he called one of the servants. He asked him what was going on. "},{"num":27,"verse":"‘Your brother has come home,’ the servant replied. ‘Your father has killed the fattest calf. He has done this because your brother is back safe and sound.’"},{"num":28,"verse":"“The older brother became angry. He refused to go in. So his father went out and begged him. "},{"num":29,"verse":"But he answered his father, ‘Look! All these years I’ve worked like a slave for you. I have always obeyed your orders. You never gave me even a young goat so I could celebrate with my friends. "},{"num":30,"verse":"But this son of yours wasted your money with some prostitutes. Now he comes home. And for him you kill the fattest calf!’"},{"num":31,"verse":"“ ‘My son,’ the father said, ‘you are always with me. Everything I have is yours. "},{"num":32,"verse":"But we had to celebrate and be glad. This brother of yours was dead. And now he is alive again. He was lost. And now he is found.’ ”"}]