[[],[{"type":"header","content":"The Sins of Israel"},{"type":"prose","content":"Then the word of the  came to me, saying, "}],[{"type":"prose","content":"“And you, son of man [Ezekiel], will you judge, will you judge the city of bloodshed? Then make her recognize all her repulsive acts. "}],[{"type":"prose","content":"You shall say, ‘Thus says the Lord , “A city that sheds blood in her midst, so that her time [of doom] will come, and makes idols to defile her, contrary to her ! "}],[{"type":"prose","content":"You have become guilty by the blood which you have shed, and you are defiled by the idols which you have made. Thus you have caused your day [of judgment and punishment] to approach and have arrived at [the completion of] your years; therefore, I have made you an object of scorn to the [pagan] nations and a thing to be mocked by all countries. "}],[{"type":"prose","content":"Those who are near and those who are far from you will mock you, you [infamous one] of ill repute, full of turmoil."}],[{"type":"prose","content":"“Behold, the princes of Israel, every one according to his power, have been intending to shed blood in you. "}],[{"type":"prose","content":"In you they have treated father and mother lightly. They have oppressed the stranger among you; and in your presence they have wronged the fatherless and the widow. "}],[{"type":"prose","content":"You have despised  scorned My sacred things and have profaned My Sabbaths. "}],[{"type":"prose","content":"In you are men who slander for the purpose of shedding blood, and in your presence they have eaten [food offered to idols] at the mountain shrines; in your midst they have committed acts of lewdness. "}],[{"type":"prose","content":"In you men have uncovered their fathers’ nakedness [the nakedness of mother or stepmother]; in you they have violated women who are [set apart as ceremonially] unclean during their menstrual impurity [or after childbirth]. "}],[{"type":"prose","content":"In you one has committed a shameful act with his neighbor’s wife, another has lewdly defiled his daughter-in-law, and another has violated his sister, his father’s daughter. "}],[{"type":"prose","content":"In you they have accepted bribes to shed blood; you have taken [forbidden] interest and [a percentage of] profits, and you have injured your neighbors for gain by oppression  extortion, and you have forgotten Me,” says the Lord ."}],[{"type":"prose","content":"“Behold, therefore, I strike My hands [together] at your dishonest gain which you have acquired and at the bloodshed which is among you. "}],[{"type":"prose","content":"Can your heart (courage) endure, or can your hands be strong in the days that I will deal with you? I the  have spoken, and will act. "}],[{"type":"prose","content":"I will scatter you among the nations and disperse you through the countries, and I will destroy your filthiness. "}],[{"type":"prose","content":"You will defile yourself in the sight of the [Gentile] nations, and you will know [without any doubt] that I am the .”’”"}],[{"type":"prose","content":"And the word of the  came to me, saying, "}],[{"type":"prose","content":"“Son of man, the house of Israel has become dross (metallic waste) to Me. All of them are (useless) bronze, tin, iron, and lead in the furnace; they are the dross of silver. "}],[{"type":"prose","content":"Therefore, thus says the Lord , ‘Because you have all become dross, therefore, behold, I will gather you [O Israel] into the midst of Jerusalem. "}],[{"type":"prose","content":"As they gather silver and bronze and iron and lead and tin into the furnace to blow fire on it in order to melt it, so I will gather you in My anger and in My wrath, and I will put you there and melt you. "}],[{"type":"prose","content":"I will gather you and blow on you with the fire of My wrath, and you will be melted in the midst of it. "}],[{"type":"prose","content":"As silver is melted in the furnace, so will you be melted in the midst of it; and you will know [without any doubt] that I the  have poured out My wrath on you [O Israel].’”"}],[{"type":"prose","content":"And the word of the  came to me, saying, "}],[{"type":"prose","content":"“Son of man, say to her, ‘You [Israel] are a land that is not pronounced clean or rained on in the day of indignation.’ "}],[{"type":"prose","content":"There is a conspiracy of her [false] prophets in her midst, like a roaring lion tearing the prey. They have devoured [human] life; they have taken [in their greed] treasure and precious things; they have made many widows among her. "}],[{"type":"prose","content":"Her priests have done violence to My law and have profaned My holy things. They have made no distinction between the holy (sacred) and the profane (secular), they have not taught [people] the difference between the unclean and the clean; and they hide their eyes from My Sabbaths, and I am profaned among them. "}],[{"type":"prose","content":"Her princes within her are like wolves tearing  devouring the prey, shedding blood and destroying lives in order to get dishonest gain. "}],[{"type":"prose","content":"Her prophets have smeared whitewash for them, seeing false visions and divining lies for them, saying, ‘Thus says the Lord ’—when the  has not spoken. "}],[{"type":"prose","content":"The people of the land have practiced oppression  extortion and have committed robbery; they have wronged the poor and needy and they have oppressed the stranger without justice. "}],[{"type":"prose","content":"I searched for a man among them who would build up the wall and stand in the gap before Me for [the sake of] the land, that I would not destroy it, but I found no one [not even one]. "}],[{"type":"prose","content":"Therefore I have poured out My indignation on them; I have consumed them with the fire of My wrath; I have repaid their way [by bringing it] upon their own heads,” says the Lord ."}]]