[[],[{"type":"header","content":"The Sins of Israel"},{"type":"prose","content":"Then the word of the  came to me, saying,"}],[{"type":"prose","content":"“And you, son of man, will you judge, will you judge the bloody city? Then inform her of all her abominations."}],[{"type":"prose","content":"And you shall say, ‘This is what the Lord  says: “A city shedding blood in her midst, so that her time is coming; and  that makes idols, contrary to her , for defilement!"}],[{"type":"prose","content":"You have become guilty by the blood which you have shed, and you have become defiled by your idols which you have made. So you have brought your days closer and have come to your years; therefore I have made you a disgrace to the nations, and an object of mocking to all the lands."}],[{"type":"prose","content":"Those who are near and those who are far from you will make fun of you, you of ill repute, full of turmoil."}],[{"type":"prose","content":"“Behold, the rulers of Israel, each according to his power, have been among you for the purpose of shedding blood."}],[{"type":"prose","content":"They have treated father and mother with contempt among you. They have oppressed the stranger in your midst; they have oppressed the orphan and the widow among you."}],[{"type":"prose","content":"You have despised My holy things and profaned My Sabbaths."}],[{"type":"prose","content":"Slanderous men have been among you for the purpose of shedding blood, and among you they have eaten at the mountain . In your midst they have committed outrageous sin."}],[{"type":"prose","content":"Among you they have uncovered  fathers’ nakedness; among you they have abused her who was unclean in her menstruation."}],[{"type":"prose","content":"And one has committed abomination with his neighbor’s wife, another has outrageously defiled his daughter-in-law, and another among you has  abused his sister, his father’s daughter."}],[{"type":"prose","content":"Among you they have taken bribes to shed blood; you have taken interest, you have injured your neighbors by oppression, and you have forgotten Me,” declares the Lord ."}],[{"type":"prose","content":"“Behold, then, I strike with My hand your profit which you have made and the bloodshed which is among you."}],[{"type":"prose","content":"Can your heart endure, or can your hands be strong for the days that I will deal with you? I, the , have spoken and will act."}],[{"type":"prose","content":"And I will scatter you among the nations and disperse you among the lands, and I will eliminate your uncleanness from you."}],[{"type":"prose","content":"Then you will defile yourself in the sight of the nations, and you will know that I am the .”’”"}],[{"type":"prose","content":"And the word of the  came to me, saying,"}],[{"type":"prose","content":"“Son of man, the house of Israel has become waste metal to Me; all of them are bronze, tin, iron, and lead in the smelting furnace; they are the waste metal of silver."}],[{"type":"prose","content":"Therefore, this is what the Lord  says: ‘Because all of you have become waste metal, therefore, behold, I am going to gather you into the midst of Jerusalem."}],[{"type":"prose","content":"As they gather silver, bronze, iron, lead, and tin into the smelting furnace to blow fire on it in order to melt , so I will gather  in My anger and in My wrath, and I will place you  and melt you."}],[{"type":"prose","content":"And I will gather you and blow on you with the fire of My wrath, and you will be melted in the midst of it."}],[{"type":"prose","content":"As silver is melted in the furnace, so you will be melted in the midst of it; and you will know that I, the , have poured out My wrath on you.’”"}],[{"type":"prose","content":"And the word of the  came to me, saying,"}],[{"type":"prose","content":"“Son of man, say to her, ‘You are a land that is not clean or rained on in the day of indignation.’"}],[{"type":"prose","content":"There is a conspiracy of her prophets in her midst like a roaring lion tearing the prey. They have devoured lives; they have taken treasure and precious things; they have made many widows in the midst of her."}],[{"type":"prose","content":"Her priests have done violence to My Law and have profaned My holy things; they have made no distinction between the holy and the common, and they have not taught the difference between the unclean and the clean; and they have closed their eyes from My Sabbaths, and I am defiled among them."}],[{"type":"prose","content":"Her leaders within her are like wolves tearing the prey, by shedding blood  destroying lives in order to make dishonest profit."}],[{"type":"prose","content":"And her prophets have coated with whitewash for them, seeing false visions and divining lies for them, saying, ‘This is what the Lord  says,’ when the  has not spoken."}],[{"type":"prose","content":"The people of the land have practiced extortion and committed robbery, and they have oppressed the poor and needy, and have oppressed the stranger without justice."}],[{"type":"prose","content":"I searched for a man among them who would build up a wall and stand in the gap before Me for the land, so that I would not destroy it; but I found no one."}],[{"type":"prose","content":"So I have poured out My indignation on them; I have consumed them with the fire of My wrath; I have brought their way upon their heads,” declares the Lord ."}]]