[[],[{"type":"header","content":"Israel’s History after the Exodus"},{"type":"prose","content":"These are the words which Moses spoke to all Israel [while they were still] beyond [that is, on the east side of] the Jordan [River] in the wilderness [across from Jerusalem], in the Arabah [the long, deep valley running north and south from the eastern arm of the Red Sea to beyond the Dead Sea] opposite Suph, between Paran and Tophel and Laban and Hazeroth and Dizahab (place of gold). "}],[{"type":"prose","content":"It is [only] eleven days’  from Horeb (Mount Sinai) by way of Mount Seir to Kadesh-barnea [on Canaan’s border; yet Israel wandered in the wilderness for forty years before crossing the border and entering Canaan, the promised land]. "}],[{"type":"prose","content":"In the fortieth year, on the first day of the eleventh month, Moses spoke to the children of Israel in accordance with all that the  had commanded him  to them, "}],[{"type":"prose","content":"after he had defeated Sihon the king of the Amorites, who lived in Heshbon, and Og the king of Bashan, who lived at Ashtaroth in Edrei. "}],[{"type":"prose","content":"Beyond (east of) the Jordan in the land of Moab, Moses began to explain this law, saying,"}],[{"type":"prose","content":"“The  our God spoke to us at Horeb, saying, ‘You have stayed long enough on this mountain. "}],[{"type":"prose","content":"Turn and resume your journey, and go to the hill country of the Amorites, and to all their neighbors in the Arabah, in the hill country and in the lowland (the Shephelah), in the Negev (South country) and on the coast of the [Mediterranean] Sea, the land of the Canaanites, and Lebanon, as far as the great river, the river Euphrates. "}],[{"type":"prose","content":"Look, I have set the land before you; go in and take possession of the land which the  swore (solemnly promised) to your fathers, to Abraham, to Isaac, and to Jacob, to give to them and to their descendants after them.’"}],[{"type":"prose","content":"“I spoke to you at that time, saying, ‘I am not able to bear  of you alone. "}],[{"type":"prose","content":"The  your God has multiplied you, and look, today you are as numerous as the stars of heaven. "}],[{"type":"prose","content":"May the , the God of your fathers, add to you a thousand times as many as you are and bless you, just as He has promised you! "}],[{"type":"prose","content":"How can I alone bear the weight  pressure and burden of you and your strife (contention)  complaining? "}],[{"type":"prose","content":"Choose for yourselves wise, understanding, experienced,  respected men from your tribes, and I will appoint them as heads (leaders) over you.’ "}],[{"type":"prose","content":"And you answered me, ‘The thing which you have said to do is good.’ "}],[{"type":"prose","content":"So I took the leaders of your tribes, wise and experienced men, and made them leaders over you, commanders of thousands, and hundreds, and fifties, and tens, and officers (administrators) for your tribes."}],[{"type":"prose","content":"“Then I commanded your judges at that time, saying, ‘Hear  between your brothers [your fellow countrymen], and judge righteously  fairly between a man and his brother, or the stranger (resident alien, foreigner) who is with him. "}],[{"type":"prose","content":"You shall not show partiality in judgment; you shall hear  pay attention to the [cases of the] least [important] as well as the great. You shall not fear man, for the judgment is God’s. The case that is too hard for you [to judge], you shall bring to me, and I will hear it.’ "}],[{"type":"prose","content":"I commanded you at that time [regarding] all the things that you should do."}],[{"type":"prose","content":"“Then we set out from Horeb (Sinai), and went through all that great and terrible wilderness which you saw on the way to the hill country of the Amorites, just as the  our God commanded us; and we came to Kadesh-barnea. "}],[{"type":"prose","content":"And I said to you, ‘You have come to the hill country of the Amorites which the  our God is about to give us. "}],[{"type":"prose","content":"Behold, the  your God has set the land before you; go up and take possession , just as the , the God of your fathers, has spoken to you. Do not fear or be dismayed.’"}],[{"type":"prose","content":"“Then all of you approached me and said, ‘Let us send men [into the land] before us, so that they may explore  search the area for us, and bring back to us word regarding the way we should go, and the cities we should enter.’ "}],[{"type":"prose","content":"The plan pleased me and I took twelve of your men, one man from each tribe. "}],[{"type":"prose","content":"They turned and went up into the hill country, and came to the Valley of Eshcol and spied it out. "}],[{"type":"prose","content":"Then they took some of the fruit of the land in their hands and brought it down to us; and they reported back to us, and said, ‘It is a good land which the  our God is about to give us.’"}],[{"type":"prose","content":"“Yet you were not willing to go up [to take possession of it], but rebelled against the command of the  your God. "}],[{"type":"prose","content":"You murmured  were ill-tempered (discontented) in your tents, and said, ‘Because the  hates us He has brought us from the land of Egypt to hand us over to the Amorites to destroy us. "}],[{"type":"prose","content":"Where can we go up? Our brothers (spies) have made our hearts melt [in fear]  demoralized us by saying, “The people are bigger and taller than we; the cities are large, and fortified [all the way up] to heaven. And besides, we saw the [giant-like] sons of the Anakim there.”’ "}],[{"type":"prose","content":"Then I said to you, ‘Do not be shocked, nor fear them. "}],[{"type":"prose","content":"The  your God who goes before you will fight for you Himself, just as He did for you in Egypt before your [very] eyes, "}],[{"type":"prose","content":"and in the wilderness where you saw how the  your God carried  protected you, just as a man carries his son, all along the way which you traveled until you arrived at this place.’ "}],[{"type":"prose","content":"Yet in spite of this word, you did not trust [that is, confidently rely on and believe] the  your God, "}],[{"type":"prose","content":"who went before you along the way, in fire by night and in a cloud by day, to seek a place for you to make camp and to show you the way in which you should go."}],[{"type":"prose","content":"“And the  heard the sound of your words, and He was angry and took an oath, saying, "}],[{"type":"prose","content":"‘Not one of these men, this evil generation, shall see the good land which I swore (solemnly promised) to give to your fathers, "}],[{"type":"prose","content":"except Caleb the son of Jephunneh; he shall see it, and to him and to his children I will give the land on which he has walked, because he has followed the  completely [and remained true to Him].’ "}],[{"type":"prose","content":"The  was angry with me also because of you, saying, ‘Not even you shall enter Canaan. "}],[{"type":"prose","content":"Joshua the son of Nun, who stands before you, he shall enter there. Encourage  strengthen him, for he shall cause Israel to inherit it. "}],[{"type":"prose","content":"Moreover, your little ones whom you said would become prey, and your sons, who today have no knowledge of good or evil, shall enter Canaan, and I will give it to them and they shall possess it. "}],[{"type":"prose","content":"But as for you, turn around and set out for the wilderness by way of the Red Sea (Sea of Reeds).’"}],[{"type":"prose","content":"“Then you answered and said to me, ‘We have sinned against the . We will go up and fight, just as the  our God has commanded us.’ So you equipped every man with weapons of war, and regarded it as easy to go up into the hill country. "}],[{"type":"prose","content":"But the  said to me, ‘Say to them, “Do not go up and do not fight, for I am not among you [because of your rebellion]; otherwise you will be [badly] defeated by your enemies.”’ "}],[{"type":"prose","content":"So I spoke to you, but you would not listen. Instead you rebelled against the command of the , and acted presumptuously and went up into the hill country. "}],[{"type":"prose","content":"Then the Amorites who lived in that hill country came out against you and chased you as bees do, and struck you down in Seir as far as Hormah. "}],[{"type":"prose","content":"And you returned and wept before the ; but the  would not listen to your voice nor pay attention to you. "}],[{"type":"prose","content":"So you stayed in Kadesh; many days you stayed there."}]]