[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(34) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "we have heard out of the law that Christ abideth for ever.. . . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The term “law” refers to the whole of the Old Testament Scripture, as we have seen in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (Comp. Note there.) They may have referred to such passages as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This remark is an instance of the knowledge of Rabbinic theology which interpreted such passages of a temporal Messianic reign. They had witnessed His triumphal entry into the royal city, and had joined in the acclamations which hailed Him as their King. They expected Him to free them from Roman bondage, and to rule over them in an earthly paradise to which there should be no end. The Christ they thought was to abide for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "How sayest thou, The Son of man must be lifted up?—His words have conveyed to them the idea of His death, and we find “lifted up” used not unfrequently in the Rabbinical writings in this sense; but they do not understand more than this. It contradicts all their visions of a Messianic reign. The Son of man to be lifted up! What meant, then, such words as these—“And there was given him dominion, and glory, and a kingdom, that all people, nations, and languages should serve him: his dominion is an everlasting dominion, which shall not pass away, and his kingdom that which shall not be destroyed” (Daniel 7:14)? They cannot reconcile these things, and they ask Him to explain them.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "How sayest thou, The Son of man must be lifted",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " up?—His words have conveyed to them the idea of His death, and we find “lifted up” used not unfrequently in the Rabbinical writings in this sense; but they do not understand more than this. It contradicts all their visions of a Messianic reign. The Son of man to be lifted up! What meant, then, such words as these—“And there was given him dominion, and glory, and a kingdom, that all people, nations, and languages should serve him: his dominion is an everlasting dominion, which shall not pass away, and his kingdom that which shall not be destroyed” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")? They cannot reconcile these things, and they ask Him to explain them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He had not at this time used the exact words they quote, if St. John has given to us the conversation in full, but they occur in John 3:14, and the title “Son of man” occurs in this context in John 12:23. It was, moreover, present to their thoughts from the passage in Daniel, and must have been familiarly known as used by Christ of Himself. (Comp. Note on John 1:51.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He had not at this time used the exact words they quote, if St. John has given to us the conversation in full, but they occur in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the title “Son of man” occurs in this context in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It was, moreover, present to their thoughts from the passage in Daniel, and must have been familiarly known as used by Christ of Himself. (Comp. Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Who is this Son of man?—“Who is this Son of man?” they would say. “We know who is the Son of man who is to abide for ever, but this Son of man who is to die we know not.” The words express that they are wavering in their attachment to Him. The question was asked probably on the Wednesday. It came midway between the “Hosanna” of the entry into Jerusalem and the “Crucify him!” of the trial.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Who is this Son of man?",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—“Who is ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "this",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Son of man?” they would say. “We know who is the Son of man who is to abide for ever, but this Son of man who is to die we know not.” The words express that they are wavering in their attachment to Him. The question was asked probably on the Wednesday. It came midway between the “Hosanna” of the entry into Jerusalem and the “Crucify him!” of the trial.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The words are remarkable as throwing light upon the sudden changes of feeling which swayed the multitude from the pole of faith to that of rejection. They heard words from Christ or saw works done by Him which carried conviction to all minds; but then there came some technical interpretation of an Old Testament passage declaring what the Messiah was to be, and in the cooler moments, when no word was speaking to the ear and no work presented itself to the eye, this test seemed fatal to the claim, and disbelief took the place of belief, and hatred that of love. We have met this again and again in the case of the priests and Pharisees. They did not, we may well believe, during the last days, leave any means untried by which they might move the fickle minds of the masses. (Comp. Matthew 27:20.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The words are remarkable as throwing light upon the sudden changes of feeling which swayed the multitude from the pole of faith to that of rejection. They heard words from Christ or saw works done by Him which carried conviction to all minds; but then there came some technical interpretation of an Old Testament passage declaring what the Messiah was to be, and in the cooler moments, when no word was speaking to the ear and no work presented itself to the eye, this test seemed fatal to the claim, and disbelief took the place of belief, and hatred that of love. We have met this again and again in the case of the priests and Pharisees. They did not, we may well believe, during the last days, leave any means untried by which they might move the fickle minds of the masses. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SON OF MANJohn 12:34",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SON OF MAN",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I have thought that a useful sermon may be devoted to the consideration of the remarkable name which our Lord gives to Himself-’the Son of Man.’ And I have selected this instance of its occurrence, rather than any other, because it brings out a point which is too frequently overlooked, viz. that the name was an entirely strange and enigmatical one to the people who heard it. This question of utter bewilderment distinctly shows us that, and negatives, as it seems to me, the supposition which is often made, that the name ‘Son of Man,’ upon the lips of Jesus Christ, was equivalent to Messiah. Obviously there is no such significance attached to it by those who put this question. As obviously, for another reason, the two names do not cover the same ground; for our Lord sedulously avoided calling Himself the Christ, and habitually called Himself the Son of Man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now one thing to observe about this name is that it is never found upon the lips of any but Jesus Christ. No man ever called him the Son of Man whilst He was upon earth, and only once do we find it applied to Him in the rest of Scripture, and that is on the occasion on which the first martyr, Stephen, dying at the foot of the old wall, saw ‘the heavens opened, and the Son of Man standing at the right hand of God.’ Two other apparent instances of the use of the expression occur, both of them in the Book of Revelation, both of them quotations from the Old Testament, and in both the more probable reading gives ‘a Son of Man,’ not ‘the Son of Man.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One more preliminary remark and I will pass to the title itself. The name has been often supposed to be taken from the remarkable prophecy in the Book of Daniel, of one ‘like a son of man,’ who receives from the Ancient of Days an everlasting kingdom which triumphs over those kingdoms of brute force which the prophet had seen. No doubt there is a connection between the prophecy and our Lord’s use of the name, but it is to be observed that what the prophet speaks of is not ‘the Son,’ but ‘one like a son of man’; or in other words, that what the prophecy dwells upon is simply the manhood of the future King in contradistinction to the bestial forms of Lion and Leopard and Bear, whose kingdoms go down before him. Of course Christ fulfils that prediction, and is the ‘One like a son of man,’ but we cannot say that the title is derived from the prophecy, in which, strictly speaking, it does not occur.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What, then, is the force of this name, as applied to Himself by our Lord?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " First, we have in it Christ putting out His hand, if I may say so, to draw us to Himself-identifying Himself with us. Then we have, just as distinctly, Christ, by the use of this name, in a very real sense distinguishing Himself from us, and claiming to hold a unique and solitary relation to mankind. And then we have Christ, by the use of this name in its connection with the ancient prophecy, pointing us onward to a wonderful future.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First then, Christ thereby identifies Himself with us. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First then, Christ thereby identifies Himself with us.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The name Son of Man, whatever more it means, declares the historical fact of His Incarnation, and the reality and genuineness, the completeness and fullness, of His assumption of humanity. And so it is significant to notice that the name is employed continually in the places in the Gospels where especial emphasis is to be placed, for some reason or other, upon our Lord’s manhood, as, for instance, when He would bring into view the depth of His humiliation. It is this name that He uses when He says: ‘Foxes have holes and the birds of the air have nests, but the Son of Man hath not where to lay His head.’ The use of the term there is very significant and profound; He contrasts His homelessness, not with the homes of men that dwell in palaces, but with the homes of the inferior creatures. As if He would say, ‘Not merely am I individually homeless and shelterless, but I am so because I am truly a man, the only creature that builds houses, and the only creature that has not a home. Foxes have holes, anywhere they can rest, the birds of the air have,’ not as our Bible gives it, ‘nests,’ but ‘roosting-places, any bough will do for them. All living creatures are at home in this material universe; I, as a Representative of humanity, wander a pilgrim and a sojourner.’ We are all restless and homeless; the creatures correspond to their environment. We have desires and longings, wild yearnings, and deep-seated needs, that ‘wander through eternity’; the Son of Man, the representative of manhood, ‘hath not where to lay His head.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then the same expression is employed on occasions when our Lord desires to emphasise the completeness of His participation in all our conditions. As, for instance, ‘the Son of Man came eating and drinking,’ knowing the ordinary limitations and necessities of corporeal humanity; having the ordinary dependence upon external things; nor unwilling to taste, with pure and thankful lip, whatever gladness may be found in man’s path through the supply of natural appetites.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And the name is employed habitually on occasions when He desires to emphasise His manhood as having truly taken upon itself the whole weight and weariness of man’s sin, and the whole burden of man’s guilt, and the whole tragicalness of the penalties thereof, as in the familiar passages, so numerous that I need only refer to them and need not attempt to quote them, in which we read of the Son of Man being ‘betrayed into the hands of sinners’; or in those words, for instance, which so marvellously blend the lowliness of the Man and the lofty consciousness of the mysterious relation which He bears to the whole world; ‘The Son of Man came, not to be ministered unto, but to minister, and to give His life a ransom for the many.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now if we gather all these instances together {and they are only specimens culled almost at random}, and meditate for a moment on the Name as illuminated by such words as these, they suggest to us, first, how truly and how blessedly He is ‘bone of our bone, and flesh of our flesh.’ All our human joys were His. He knew all human sorrow. The ordinary wants of human nature belonged to Him; He hungered, He thirsted, and was weary; He ate and drank and slept. The ordinary wants of the human heart He knew; He was hurt by hatred, stung by ingratitude, yearned for love; His spirit expanded amongst friends, and was pained when they fell away. He fought and toiled, and sorrowed and enjoyed. He had to pray, to trust, and to weep. He was a Son of Man, a true man among men. His life was brief; we have but fragmentary records of it for three short years. In outward form it covers but a narrow area of human experience, and large tracts of human life seem to be unrepresented in it. Yet all ages and classes of men, in all circumstances, however unlike those of the peasant Rabbi who died when he was just entering mature manhood, may feel that this man comes closer to them than all beside. Whether for stimulus for duty, or for grace and patience in sorrow, or for restraint in enjoyment, or for the hallowing of all circumstances and all tasks, the presence and example of the Son of Man are sufficient. Wherever we go, we may track His footsteps by the drops of His blood upon the sharp flints that we have to tread. In all narrow passes, where the briars tear the wool of the flock, we may see, left there on the thorns, what they rent from the pure fleece of the Lamb of God that went before. The Son of Man is our Brother and our Example.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And is it not beautiful, and does it not speak to us touchingly and sweetly of our Lord’s earnest desire to get very near us and to bring us very near to Him, that this name, which emphasises humiliation and weakness and the likeness to ourselves, should be the name that is always upon His lips? Just as, if I may compare great things with small, some teacher or philanthropist, that went away from civilised into savage life, might leave behind him the name by which he was known in Europe, and adopt some barbarous designation that was significant in the language of the savage tribe to whom he was sent, and say to them: ‘That is my name now, call me by that,’ so this great Leader of our souls, who has landed upon our coasts with His hands full of blessings, His heart full of love, has taken a name that makes Him one of ourselves, and is never wearied of speaking to our hearts, and telling us that it is that by which He chooses to be known. It is a touch of the same infinite condescension which prompted His coming, that makes Him choose as His favourite and habitual designation the name of weakness and identification, the name ‘Son of Man.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. But now turn to what is equally distinct and clear in this title. Here we have our Lord distinguishing Himself from us, and plainly claiming a unique relationship to the whole world. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. But now turn to what is equally distinct and clear in this title. Here we have our Lord distinguishing Himself from us, and plainly claiming a unique relationship to the whole world.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Just fancy how absurd it would be for one of us to be perpetually insisting on the fact that he was a man, to be taking that as his continual description of himself, and pressing it upon people’s attention as if there was something strange about it. The idea is preposterous; and the very frequency and emphasis with which the name comes from our Lord’s lips, lead one to suspect that there is something lying behind it more than appears on the surface. That impression is confirmed and made a conviction, if you mark the article which is prefixed, the Son of Man. A Son of man is a very different idea. When He says ‘the Son of Man’ He seems to declare that in Himself there are gathered up all the qualities that constitute humanity; that He is, to use modern language, the realised Ideal of manhood, the typical Man, in whom is everything that belongs to manhood, and who stands forth as complete and perfect. Appropriately, then, the name is continually used with suggestions of authority and dignity contrasting with those of humiliation. ‘The Son of Man is Lord of the Sabbath,’ ‘The Son of Man hath power on earth to forgive sins’ and the like. So that you cannot get away from this, that this Man whom the whole world has conspired to profess to admire for His gentleness, and His meekness, and His lowliness, and His religious sanity, stood forward and said: ‘I am complete and perfect, and everything that belongs to manhood you will find in Me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And it is very significant in this connection that the designation occurs more frequently in the first three Gospels than in the fourth; which is alleged to present higher notions of the nature and personality of Jesus Christ than are found in the other three. There are more instances in Matthew’s Gospel in which our Lord calls Himself the Son of Man, with all the implication of uniqueness and completeness which that name carries; there are more even in the Gospel of the Servant, the Gospel according to Mark, than in the Gospel of the Word of God, the Gospel according to John. And so I think we are entitled to say that by this name, which the testimony of all our four Gospels makes it certain, even to the most suspicious reader, that Christ applied to Himself, He declared His humanity, His absolutely perfect and complete humanity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In substance He is claiming the same thing for Himself that Paul claimed for Him when he called Him ‘the second Adam.’ There have been two men in the world, says Paul, the fallen Adam, with his infantile and undeveloped perfections, and the Christ, with His full and complete humanity. All other men are fragments, He is the ‘entire and perfect chrysolite.’ As one of our epigrammatic seventeenth-century divines has it, ‘Aristotle is but the rubbish of an Adam,’ and Adam is but the dim outline sketch of a Jesus. Between these two there has been none. The one Man as God meant him, the type of man, the perfect humanity, the realised ideal, the home of all the powers of manhood, is He who Himself claimed that place for Himself, and stepped into it with the strange words upon His lips, ‘I am meek and lowly of heart.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Who is this Son of Man?’ Ah, brethren! ‘who can bring a clean thing out of an unclean? Not one.’ A perfect Son of Man, born of a woman, ‘bone of our bone and flesh of our flesh,’ must be more than a Son of Man. And that moral completeness and that ideal perfection in all the faculties and parts of His nature which drove the betrayer to clash down the thirty pieces of silver in the sanctuary in despair that ‘he had betrayed innocent blood’; which made Pilate wash his hands ‘of the blood of this just person’; which stopped the mouths of the adversaries when He challenged them to convince Him of sin, and which all the world ever since has recognised and honoured, ought surely to lead us to ask the question, ‘Who is this Son of Man?’ and to answer it, as I pray we all may answer it, ‘Thou art the Christ, the Son of the living God!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This fact of His absolute completeness invests His work with an altogether unique relationship to the rest of mankind. And so we find the name employed upon His own lips in connections in which He desires to set Himself forth as the single and solitary medium of all blessing and salvation to the world-as, for instance, ‘The Son of Man came to give His life a ransom for the many’; ‘Ye shall see the heavens opened, and the angels of God ascending and descending on the Son of Man.’ He is what the ladder was in the vision to the patriarch, with his head upon the stone and the Syrian sky over him-the Medium of all communication between earth and heaven. And that ladder which joins heaven to earth, and brings all angels down on the solitary watchers, comes straight down, as the sunbeams do, to every man wherever he is. Each of us sees the shortest line from his own standing-place to the central light, and its beams come straight to the apple of each man’s eye. So because Christ is more than a man, because He is the Man, His blessings come to each of us direct and straight, as if they had been launched from the throne with a purpose and a message to us alone. Thus He who is in Himself perfect manhood touches all men, and all men touch Him, and the Son of Man, whom God hath sealed, will give to every one of us the bread from heaven. The unique relationship which brings Him into connection with every soul of man upon earth, and makes Him the Saviour, Helper, and Friend of us all, is expressed when He calls Himself the Son of Man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now one last word in regard to the predictive character of this designation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now one last word in regard to the predictive character of this designation.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Even if we cannot regard it as being actually a quotation of the prophecy in the Book of Daniel, there is an evident allusion to that prophecy, and to the whole circle of ideas presented by it, of an everlasting dominion, which shall destroy all antagonistic power, and of a solemn coming for judgment of One like a Son of Man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We find, then, the name occurring on our Lord’s lips very frequently in that class of passages with which we are so familiar, and which are so numerous that I need not quote them to you; in which He speaks of the second coming of the Son of Man; as, for instance, that one which connects itself most distinctly with the Book of Daniel, the words of high solemn import before the tribunal of the High Priest. ‘Hereafter shall ye see the Son of Man sitting at the right hand of power, and coming in the glories of heaven’; or as when He says, ‘He hath given Him authority to execute judgment also because He is the Son of Man’; or as when the proto-martyr, with his last words, declared in sudden burst of surprise and thrill of gladness, ‘I see the heavens opened, and the Son of Man standing at the right hand of God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Two thoughts are all that I can touch on here. The name carries with it a blessed message of the present activity and perpetual manhood of the risen Lord. Stephen does not see Him as all the rest of Scripture paints Him, sitting at the right hand of God, but standing there. The emblem of His sitting at the right hand of God represents triumphant calmness in the undisturbed confidence of victory. It declares the completeness of the work that He has done upon earth, and that all the history of the future is but the unfolding of the consequences of that work which by His own testimony waa finished when He bowed His head and died. But the dying martyr sees him standing, as if He had sprung to His feet in response to the cry of faith from the first of the long train of sufferers. It is as if the Emperor upon His seat, looking down upon the arena where the gladiators are contending to the death, could not sit quiet amongst the flashing axes of the lictors and the purple curtains of His throne, and see their death-struggles, but must spring to His feet to help them, or at least bend down with the look and with the reality of sympathy. So Christ, the Son of Man, bearing His manhood with Him,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Still bends on earth a Brother’s eye,’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "and is the ever-present Helper of all struggling souls that put their trust in Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then as to the other and main thought here in view-the second coming of that perfect Manhood to be our Judge. It is too solemn a subject for human lips to say much about. It has been vulgarised, and the power taken out of it by many well-meant attempts to impress it upon men’s hearts. But that coming is certain. That manhood could not end its relationship to us with the Cross, nor yet with the slow, solemn, upward progress which bore Him, pouring down blessings, up into the same bright cloud that had dwelt between the cherubim and had received Him into its mysterious recesses at the Transfiguration. That He should come again is the only possible completion of His work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That Judge is our Brother. So in the deepest sense we are tried by our Peer. Man’s knowledge at its highest cannot tell the moral desert of anything that any man does. You may judge action, you may sentence for breaches of law, you may declare a man clear of any blame for such, but for any one to read the secrets of another heart is beyond human power; and if He that is the Judge were only a man there would be wild work, and many a blunder in the sentences that were given. But when we think that it is the Son of Man that is our Judge, then we know that the Omniscience of divinity, that ponders the hearts and reads the motives, will be all blended with the tenderness and sympathy of humanity; that we shall be judged by One who knows all our frame, not only with the knowledge of a Maker, if I may so say, as from outside, but with the knowledge of a possessor, as from within; that we shall be judged by One who has fought and conquered in all temptations; and most blessed of all, that we shall be judged by One with whom we have only to plead His own work and His own love and His Cross that we may stand acquitted before His throne.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, brethren, in that one mighty Name all the past, present, and future are gathered and blended together. In the past His Cross fills the retrospect: for the future there rises up, white and solemn, His judgment throne. ‘The Son of Man is come to give His life a ransom for the many’; that is the centre point of all history. The Son of Man shall come to judge the world; that is the one thought that fills the future. Let us lay hold by true faith on the mighty work which He has done on the Cross, then we shall rejoice to see our Brother on the throne, when the ‘judgment is set and the books are opened.’ Oh, friends, cleave to Him ever in trust and love, in communion and imitation, in obedience and confession, that ye may be accounted worthy ‘to stand before the Son of Man’ in that day!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "John 12:34-36",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:34-36",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The people answered ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Understanding the phrase as implying some violent death shortly to come upon him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We have heard out of the law, that Christ abideth for ever ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— On hearing Jesus affirm that he was to be lifted up, or taken off by a violent death, they told him that it was inconsistent with the character of the Messiah, who, according to the law, (so they named the whole of their sacred writings,) was never to die. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And how sayest thou, The Son of man must be lifted up? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— How can these things be reconciled? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who is this Son of man? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Is he a different person from the Messiah, whom we have been taught to expect under the title of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of man? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If not, what sort of a Messiah must he be that is to die? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Jesus said ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Not answering them directly, but exhorting them to improve what they had heard already; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet a little while is the light with you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — As if he had said, Do not cavil at what I now say; but remember how short this opportunity is, which through the divine goodness you now enjoy; and improve by my instructions, who am the light of the world. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lest darkness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, spiritual blindness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "come upon you ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— By the just judgment of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If that should happen to you, ye will be in a miserable condition indeed: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For he that walketh in darkness, knoweth not whither he goeth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Knoweth neither the way he is walking in, nor the end he is walking toward: he knows not into what danger and misery he may fall the very next step he takes: and much more dreadful will it be for you to be deserted of God, and left to the darkness and folly of your own hearts. Observe, reader, he that is destitute of the light of the gospel, that is unacquainted with its discoveries and directions, wanders endlessly in mistakes and errors, in a thousand crooked paths, and is not aware of it: he is probably going to destruction, and knows not his danger: he is sleeping, or sporting, on the brink of the pit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "While you have the light, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "therefore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "believe in the light ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— While you enjoy the benefit of my doctrine, example, and miracles, which clearly prove my mission from God, believe on me; for it is thus alone you can become ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "children of light — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Children of God, wise, holy, and happy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "These things spake Jesus ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— When the Greeks applied themselves to him; and as the unbelieving Jews were greatly irritated by the actions and discourses of the day, and would not be awakened to conviction, he left them and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "departed ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "thence to a retired place. Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "απελθων εκρυβη απ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αυτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which Dr. Campbell renders, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He withdrew himself privately from them: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "observing, that he thinks our translation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he departed and did hide himself from them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“conveys a sense different from that of the original, which denotes simply, that in retiring he took care not to be observed by them.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:34-36 The people drew false notions from the Scriptures, because they overlooked the prophecies that spoke of Christ's sufferings and death. Our Lord warned them that the light would not long continue with them, and exhorted them to walk in it, before the darkness overtook them. Those who would walk in the light must believe in it, and follow Christ's directions. But those who have not faith, cannot behold what is set forth in Jesus, lifted up on the cross, and must be strangers to its influence as made known by the Holy Spirit; they find a thousand objections to excuse their unbelief.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We have heard out of the law - Out of the Old Testament; or rather we have been so taught by those who have interpreted the law to us.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That Christ - That the Messiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Abideth for ever - Will remain forever, or will live forever. The doctrine of many of them certainly was that the Messiah would not die; that he would reign as a prince forever over the people. This opinion was founded on such passages of Scripture as these: Psalm 110:4, \"Thou art a priest forever;\" Daniel 2:44; Daniel 8:13-14. In the interpretation of these passages they had overlooked such places as Isaiah 53:1-12; nor did they understand how the fact that he would reign for ever could be reconciled with the idea of his death. To us, who understand that his reign does not refer to a temporal, an earthly kingdom, it is easy.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Abideth for ever - Will remain forever, or will live forever. The doctrine of many of them certainly was that the Messiah would not die; that he would reign as a prince forever over the people. This opinion was founded on such passages of Scripture as these: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Thou art a priest forever;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:13-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In the interpretation of these passages they had overlooked such places as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:1-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; nor did they understand how the fact that he would reign for ever could be reconciled with the idea of his death. To us, who understand that his reign does not refer to a temporal, an earthly kingdom, it is easy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "How sayest thou ... - We have understood by the title \"the Son of man\" the same as the Messiah, and that he is to reign forever. How can he be put to death?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who is this Son of man? - \"The Son of man we understand to be the Messiah spoken of by Daniel, who is to reign forever. To him, therefore, you cannot refer when you say that he must be lifted up, or must die. Who is it - what other Son of man is referred to but the Messiah?\" Either ignorantly or willfully, they supposed he referred to some one else than the Messiah. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who is this Son of man? - \"The Son of man we understand to be the Messiah spoken of by Daniel, who is to reign forever. To him, therefore, you cannot refer when you say that he must be lifted up, or must die. Who is it - what other Son of man is referred to but the Messiah?\" Either ignorantly or willfully, they supposed he referred to some one else than the Messiah. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34. We have heard out of the law—the scriptures of the Old Testament (referring to such places as Ps 89:28, 29; 110:4; Da 2:44; 7:13, 14).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that Christ—the Christ \"endureth for ever.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and how sayest thou, The Son of Man must be lifted up, &c.—How can that consist with this \"uplifting?\" They saw very well both that He was holding Himself up as the Christ and a Christ to die a violent death; and as that ran counter to all their ideas of the Messianic prophecies, they were glad to get this seeming advantage to justify their unyielding attitude.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Here again ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is taken in a larger sense than in some places, where it is only significant of the books of Moses, in opposition to the prophets and other holy writings, as we had it before, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 10:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the places of Scripture which the people seem to refer to, seem to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 110:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Christ is called a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "priest for ever; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or else ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the kingdom of the Messiah is said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an everlasting dominion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which should ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not pass away, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a kingdom that should ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not be destroyed:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so also, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 2:44 Micah 4:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". These old prophecies of the Messiah the people could not reconcile to what our Saviour here told them of his death; the reason was, their not understanding the true notion of the Messiah, and of his kingdom, which they fancied not to be a spiritual and eternal kingdom, but a temporal kingdom here on earth. This made them ask, how, (that is, with what consistency to those prophecies), if he indeed were the Messias, he said, The Son of man should die; for that they understood by the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "lifted up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which maketh it very plain, that it was a phrase they used to express that kind of death by. They ask who he meant by the Son of man. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The people answered him,.... Not the Greeks, but the Jews, and these not such as were friends to Christ, but cavillers at him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "we have heard out of the law; not the five books of Moses, but the Prophets, and Hagiographa; even all the books of the Old Testament are called the law; See Gill on John 10:34; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "we have heard out of the law; not the five books of Moses, but the Prophets, and Hagiographa; even all the books of the Old Testament are called the law; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "that Christ abideth for ever; referring to those places which speak of the perpetuity of his priesthood and the everlasting duration of his kingdom, Psalm 110:4, in which last text express mention is made of the son of man, and that and the first may be more especially respected; from whence it appears, that these passages were understood of the Messiah by the ancient Jews: they knew he was designed in Psalm 110:4. He is David's Lord that was bid to sit at the right hand of Jehovah, after he was raised from the dead, and had ascended on high; whose Gospel went forth with power, and whose people, by it, were made willing to submit to him, to his righteousness, and the sceptre of his kingdom; and who also is a priest for ever; and which is appealed to as a proof of the nature, kind, and duration of Christ's priesthood, Hebrews 5:6; and so it may be observed it is expressly applied to him by Jewish writers: in Zechariah 4:14 it is said \"these are the two anointed ones, that stand by the Lord of the whole earth\"; of which this interpretation is given (f). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that Christ abideth for ever; referring to those places which speak of the perpetuity of his priesthood and the everlasting duration of his kingdom, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in which last text express mention is made of the son of man, and that and the first may be more especially respected; from whence it appears, that these passages were understood of the Messiah by the ancient Jews: they knew he was designed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He is David's Lord that was bid to sit at the right hand of Jehovah, after he was raised from the dead, and had ascended on high; whose Gospel went forth with power, and whose people, by it, were made willing to submit to him, to his righteousness, and the sceptre of his kingdom; and who also is a priest for ever; and which is appealed to as a proof of the nature, kind, and duration of Christ's priesthood, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so it may be observed it is expressly applied to him by Jewish writers: in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is said \"these are the two anointed ones, that stand by the Lord of the whole earth\"; of which this interpretation is given (f). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"These are Aaron and the Messiah; and it would not be known which of them is (most) beloved, but that he says,  Psalm 110:4, \"the Lord hath sworn, and will not repent, thou art a priest for ever\"; from whence it is manifest that the Messiah is more beloved than Aaron the righteous priest.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"These are Aaron and the Messiah; and it would not be known which of them is (most) beloved, but that he says,  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"the Lord hath sworn, and will not repent, thou art a priest for ever\"; from whence it is manifest that the Messiah is more beloved than Aaron the righteous priest.'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And so another of them (g), speaking of Melchizedek, says, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"this is that which is written Psalm 110:4, \"the Lord hath sworn\", &c. who is this? this is he that is just, and having salvation, the King Messiah, as it is said, Zechariah 9:9.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"this is that which is written ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"the Lord hath sworn\", &c. who is this? this is he that is just, and having salvation, the King Messiah, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 9:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "So the 45th Psalm is understood by them of the Messiah; the King, in  Psalm 45:1, is by Ben Melech, said to be the King Messiah; Psalm 45:2 is thus paraphrased by the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So the 45th Psalm is understood by them of the Messiah; the King, in  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is by Ben Melech, said to be the King Messiah; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is thus paraphrased by the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"thy beauty, O King Messiah, is more excellent than the children of men.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And Aben Ezra observes, that this Psalm is either concerning David, or the Messiah his son, whose name is David, Ezekiel 37:25 (h); and the passage in Psalm 72:17 is frequently interpreted of the Messiah and his name, and is brought as a proof of the antiquity of it (i); and  Psalm 89:36 is also applied to him; and as for Daniel 7:13, that is by many, both ancient and modern Jews, explained of the Messiah (k) and since then they understood these passages of him, it is easy to observe from whence they took this notion that the Messiah should abide for ever; but then they should have observed out of the same law, or Holy Scriptures, that the Messiah was to be stricken and cut off, was to be brought to the dust of death, and to pour out his soul unto death; all which is consistent with his abiding for ever, in his person and office; for though according to the said writings, he was to die and be buried, yet he was not to see corruption; he was to rise again, ascend on high, sit at the right hand of God, and rule till all his enemies became his footstool; his sufferings were to be in the way, and in order to his entrance into the glory that should always abide. The Jews have entertained a notion that Messiah the son of David shall not die, and they lay down this as a rule, that if anyone sets up for a Messiah, and does not prosper, but is slain, it is a plain case he is not the Messiah; so all the wise men at first thought that Ben Coziba was the Messiah, but when he was slain it was known to them that he was not (l). And upon this principle these Jews confront the Messiahship of Jesus, saying, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Aben Ezra observes, that this Psalm is either concerning David, or the Messiah his son, whose name is David, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 37:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (h); and the passage in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is frequently interpreted of the Messiah and his name, and is brought as a proof of the antiquity of it (i); and  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is also applied to him; and as for ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that is by many, both ancient and modern Jews, explained of the Messiah (k) and since then they understood these passages of him, it is easy to observe from whence they took this notion that the Messiah should abide for ever; but then they should have observed out of the same law, or Holy Scriptures, that the Messiah was to be stricken and cut off, was to be brought to the dust of death, and to pour out his soul unto death; all which is consistent with his abiding for ever, in his person and office; for though according to the said writings, he was to die and be buried, yet he was not to see corruption; he was to rise again, ascend on high, sit at the right hand of God, and rule till all his enemies became his footstool; his sufferings were to be in the way, and in order to his entrance into the glory that should always abide. The Jews have entertained a notion that Messiah the son of David shall not die, and they lay down this as a rule, that if anyone sets up for a Messiah, and does not prosper, but is slain, it is a plain case he is not the Messiah; so all the wise men at first thought that Ben Coziba was the Messiah, but when he was slain it was known to them that he was not (l). And upon this principle these Jews confront the Messiahship of Jesus, saying, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and how sayest thou, the son of man must be lifted up? for it seems Christ used the phrase the son of man in his discourse, though John has not recorded it; he attending to his sense, and not to his express words. The Jews rightly understood him, that by the son of man he meant the Messiah, and by his being lifted up, his death; but they did not understand, how the Messiah could die, and yet abide for ever; and therefore since he intended himself by the son of man, they concluded he talked very inconsistent with the Scriptures, and with the character he assumed, and ask very pertly, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who is this son of man? is there any other son of man besides the Messiah? and can the son of man, that is the Messiah, be lifted up, or die, who is to abide for ever? and if thou art to be lifted up, or die, thou art not the Messiah or Daniel's son of man, whose kingdom is everlasting: but how come the Jews themselves to say, that the days of the Messiah, according to some, are but forty years, according to others seventy, according to others, three hundred and sixty five (m)? yea, they say, he shall be as other men, marry, have children, and then die (n). And how comes it to pass that Messiah ben Joseph shall be slain (o)? the truth of the matter is this, they having lost the true sense of the prophecies concerning the Messiah, and observing some that seem to differ, and which they know not how to reconcile, have fancied two Messiahs, the one that will be much distressed and be overcome and be slain; the other, who will be potent and victorious. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Abot R. Nathan, c. 34. (g) R. Moses Hadarsan in Galatin. de cath. ver. l. 10. c. 6. (h) Vid. Tzeror Hammor, fol. 49. 2.((i) T. Bab. Pesachim, fol. 54. 1. Nedarim, fol. 39. 2. Bereshit Rabba, fol. 1, 2. Echa Rabbati, fol. 50. 2. Pirke Eliezer, c. 32. (k) Zohar in Gen. fol. 85. 4. Bemidbar Rabba, sect. 13. fol. 209. 4. Jarchi & Sandiah Gaon in Daniel 7.13. & R. Jeshua in Aben Ezra in ib. (l) Maimon Hilchot Melacim, c. 11. sect. 3, 4. Vid. Bereshit Rabba, sect. 98. fol. 86. 2.((m) T. Bab. Sanhedrin, fol. 99. 1.((n) Maimon. in Misn. Sanhedrin, c. 11. sect. 1.((o) T. Bab. Succa, fol. 52. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Abot R. Nathan, c. 34. (g) R. Moses Hadarsan in Galatin. de cath. ver. l. 10. c. 6. (h) Vid. Tzeror Hammor, fol. 49. 2.((i) T. Bab. Pesachim, fol. 54. 1. Nedarim, fol. 39. 2. Bereshit Rabba, fol. 1, 2. Echa Rabbati, fol. 50. 2. Pirke Eliezer, c. 32. (k) Zohar in Gen. fol. 85. 4. Bemidbar Rabba, sect. 13. fol. 209. 4. Jarchi & Sandiah Gaon in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".13. & R. Jeshua in Aben Ezra in ib. (l) Maimon Hilchot Melacim, c. 11. sect. 3, 4. Vid. Bereshit Rabba, sect. 98. fol. 86. 2.((m) T. Bab. Sanhedrin, fol. 99. 1.((n) Maimon. in Misn. Sanhedrin, c. 11. sect. 1.((o) T. Bab. Succa, fol. 52. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The people answered him, We have heard out of the law that Christ abideth for ever: and how sayest thou, The Son of man must be lifted up? who is this Son of man?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The people—rightly understanding ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐὰν ὑψ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκ τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of an exaltation to take place by the way of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—gather thence, that in accordance therewith no everlasting duration of life (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μένει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is destined for Him on the earth, and do not find this reconcilable with that which ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on their part (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμεῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") had heard out of the Scripture (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "νόμος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the Messiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἠκούσ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., namely, by reading, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). They reflect on the scriptural doctrine (comp. also the older book of Enoch) of the everlasting kingdom of the Messiah, which they apprehend as an earthly kingdom, and especially on passages like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and particularly ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "From the latter passage, not from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where He does not speak to the people, they put in the mouth of Christ the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν υἱὸν τοῦ ἀνθρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., as He had designated Himself so frequently by this Messianic appellation, in order at once to make manifest that He, although He so terms Himself, yet on account of the contradictory token of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑψωθῆναι ἐκ τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which He ascribes to Himself, cannot be the Danielian Son of man, He who was so characterized in the Scripture; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Son of man, by which name ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is wont to designate Himself, must in truth be quite another person.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὗτος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] this strange Son of man, who is in opposition to the Scripture, over whom that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑψωθῆναι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is said to be impending.[117] That the speakers, however, were unacquainted with the appellation ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ υἱὸς τοῦ ἀνθρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". for Jesus (Brückner) is, after the first half of the verse, not to be assumed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[117] The inquiry has in it something pert, saucy, as if they said: “A fine ‘Son of man’ art thou, who art not to remain for ever in life, but, as thou dost express it, art to be exalted!” To the Danielian Son of man an everlasting kingdom is given, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This also in answer to Hofmann, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Schriftbew",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". II. 1, p. 79.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The crowd apparently understood the allusion to His death, for they objected: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἡμεῖς ἠκούσαμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνθρώπου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “we have heard out of the law,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", out of Scripture (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Schechter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Studies in Judaism",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 15: “under the word Torah were comprised not only the Law, but also the contributions of later times expressing either the thoughts or the emotions of holy and sincere men”), “that the Christ abides for ever”; this impression was derived from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A different belief was also current. Their belief regarding the Messiah seemed so to contradict His allusion to death that it occurred to them that after all “the Son of Man” might not be identical with “the Messiah” as they had been supposing. So they ask, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τίς ἐστιν οὗτος ὁ υἱὸς τοῦ ἀνθρώπου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; This among other passages shows that the “Son of Man” was a title suggestive of Messiahship, but not quite definite in its meaning and not quite identical with “Messiah”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "34–36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Perplexity of the Multitude",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The people answered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "multitude therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "answered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of the law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In its widest sense, including the Psalms and the Prophets. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. The people rightly understand ‘lifted up from the earth’ to mean removal from the earth by death; and they argue—‘Scripture says that the Christ (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") will abide for ever. You claim to be the Christ, and yet ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " say that you will be lifted up and therefore ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " abide.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who is this Son of man?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘This’ is contemptuous: ‘a strange Messiah this, with no power to abide!’ (on ‘Son of Man’ see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). “Here we have the secret, unexplained by the Synoptists, why even when the scale is seeming to turn for a moment in favour of belief, it is continually swayed down again by the discovery of some new particular in which the current ideas respecting the Messiah are disappointed and contradicted.” S. p. 199. One moment the people are convinced by a miracle that Jesus is the Messiah, the next that it is impossible to reconcile His position with the received interpretations of Messianic prophecy. It did not occur to them to doubt the interpretations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἡμεῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This word has in it something of irony in this passage.[322]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκ τοῦ νόμου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of the Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", under which are comprehended the prophets and psalms.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μένει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abideth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Neither wilt Thou suffer Thine Holy One to see corruption;” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 45:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [6?], “Thy throne, O God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is for ever and ever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “They shall fear Thee as long as the sun and moon endureth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "throughout all generations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “His throne as the days of heaven;” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Who shall declare His generation?” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “He shall ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prolong",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His days.”—[323] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The Jews join together things which ought not to have been joined:[324] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “He was taken from prison and from judgment: and who shall declare His generation?” Death itself was His path to everlasting duration.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πῶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τίς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "how, who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") They ask a double question: concerning His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being lifted up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; concerning His being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “The hour is come, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should be glorified” [with which comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “When ye have lifted up the Son of man, then shall ye know that I am He”].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τίς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is, say they, the Son of man, if the Christ be not? And yet Thou sayest, that the Son of man is about to be lifted up; whereas the Christ does not die: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τίς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of what nature and character.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[322] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had always heard so and so, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in sooth, are wiser.—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[323] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς τὀν αἰῶνα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for ever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") They therefore were entertaining exalted sentiments concerning the Christ.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[324] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They ought not to have confounded together His everlasting dominion and His death: the former is distinct from, though to be preceded necessarily by the latter.—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 34.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The audience of Jesus on this occasion has swollen into a vast group. The few Greeks, with Philip and Andrew, the other disciples, the smaller circle of sympathetic ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "listeners",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the disturbed and feverish crowd, are all about him, as he claims by death itself to judge the world, to win all men, and east out the spirit and prince of the world from his usurped throne. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The multitude then",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "answered him, We heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - received information by public teaching - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "out of the Law that the Christ abideth forever.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Numerous passages may have been reasonably in their minds - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:13, 14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - in which the glories of an everlasting kingdom were predicted. In ver. 23 the Lord had in their hearing spoken of himself as \"Son of man.\" Meyer, by giving the dominant sense of glorification to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὑψώθω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", thinks ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the people must be contrasting, in pert criticism, the lowly \"Son of man\" before them with the \"Son of man\" of Daniel's vision. But it would be far more probable that the people accepted Christ's intimation of the manner of his death, and hence felt the incongruity of such a Son of man - One who dies, and therefore lives again - with the glowing pictures of Daniel or the 'Book of Henoch.' \"The Christ abideth forever.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And how sayest thou that the Son of man must be lifted up? Who is this Son of man?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They did not identify \"the Son of man\" with the Messiah. They probably supposed two manifestations. They may have doubted, as John the Baptist did, whether Jesus had fulfilled the whole conception of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐρχόμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was once more a vague, dull inquiry, \"Who art thou?\" We are still in doubt who thou art, and how thou canst claim to be the Christ of our prophecies. To be our Christ, and die, is a contradiction in terms. John 12:34",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The law",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on John 10:34. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]