[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12, 13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And if a leprosy break out abroad.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There were, however, two phases of this returned distemper which exempted the patient from uncleanness. If the leprosy suddenly covered the whole body so that the patient became perfectly white, in which case there could be no appearance of live flesh, then he was clean. This indicated the crisis, as the whole evil matter thus brought to the surface formed itself into a scale, which dried and peeled off.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-17 The plague of leprosy was an uncleanness, rather than a disease. Christ is said to cleanse lepers, not to cure them. Common as the leprosy was among the Hebrews, during and after their residence in Egypt, we have no reason to believe that it was known among them before. Their distressed state and employment in that land must have rendered them liable to disease. But it was a plague often inflicted immediately by the hand of God. Miriam's leprosy, and Gehazi's, and king Uzziah's, were punishments of particular sins; no marvel there was care taken to distinguish it from a common distemper. The judgment of it was referred to the priests. And it was a figure of the moral pollutions of men's minds by sin, which is the leprosy of the soul, defiling to the conscience, and from which Christ alone can cleanse. The priest could only convict the leper, (by the law is the knowledge of sin,) but Christ can cure the sinner, he can take away sin. It is a work of great importance, but of great difficulty, to judge of our spiritual state. We all have cause to suspect ourselves, being conscious of sores and spots; but whether clean or unclean is the question. As there were certain marks by which to know it was leprosy, so there are marks of such as are in the gall of bitterness. The priest must take time in making his judgment. This teaches all, both ministers and people, not to be hasty in censures, nor to judge anything before the time. If some men's sins go before unto judgment, the sins of others follow after, and so do men's good works. If the person suspected were found to be clean, yet he must wash his clothes, because there had been ground for the suspicion. We have need to be washed in the blood of Christ from our spots, though not leprosy spots; for who can say, I am pure from sin?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The disease here indicated appears to be that now known as Lepra commonis, the common White Leprosy, or Dry Tetter. It first shows itself in reddish pimples, the surface of which becomes white and scaly, spreading in a circular form until they meet each other and cover large patches of the body. It scarcely affects the general health, and for the most part disappears of itself, though it often lasts for years.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From his head even to his foot, wheresoever. the priest looketh - The first appearance of the Lepra Commonis may take place in any part of the body, especially, however, at the larger joints of the limbs; but the spots of elephantiasis are almost always first seen, on those parts which are habitually exposed, the face, ears and hands.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From his head even to his foot, wheresoever. the priest looketh - The first appearance of the Lepra Commonis may take place in any part of the body, especially, however, at the larger joints of the limbs; but the spots of elephantiasis are almost always first seen, on those parts which are habitually exposed, the face, ears and hands.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9-37. if the rising be white—This BRIGHT WHITE leprosy is the most malignant and inveterate of all the varieties the disease exhibits, and it was marked by the following distinctive signs: A glossy white and spreading scale, upon an elevated base, the elevation depressed in the middle, but without a change of color; the black hair on the patches participating in the whiteness, and the scaly patches themselves perpetually enlarging their boundary. Several of these characteristics, taken separately, belong to other blemishes of the skin as well; so that none of them was to be taken alone, and it was only when the whole of them concurred that the Jewish priest, in his capacity of physician, was to pronounce the disease a malignant leprosy. If it spread over the entire frame without producing any ulceration, it lost its contagious power by degrees; or, in other words, it ran through its course and exhausted itself. In that case, there being no longer any fear of further evil, either to the individual himself or to the community, the patient was declared clean by the priest, while the dry scales were yet upon him, and restored to society. If, on the contrary, the patches ulcerated and quick or fungous flesh sprang up in them, the purulent matter of which, if brought into contact with the skin of other persons, would be taken into the constitution by means of absorbent vessels, the priest was at once to pronounce it an inveterate leprosy. A temporary confinement was them declared to be totally unnecessary, and he was regarded as unclean for life [Dr. Good]. Other skin affections, which had a tendency to terminate in leprosy, though they were not decided symptoms when alone, were: \"a boil\" (Le 13:18-23); \"a hot burning,\"—that is, a fiery inflammation or carbuncle (Le 13:24-28); and \"a dry scall\" (Le 13:29-37), when the leprosy was distinguished by being deeper than the skin and the hair became thin and yellow.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And if a leprosy break out abroad in the skin,.... Or, if flowering it flowers (m); the man that has it on him looks like a plant or tree covered with white flowers, being spread all over him in white swellings, bright spots or scabs, as it follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the leprosy cover all the skin of him that hath the plague, from his head even to his foot; such an one as the leper was that came to Christ for healing, said to be full of leprosy, Luke 5:12; and such in a mystical sense is every sinner, whether sensible of it or not, even from the Crown of the head to the sole of the foot, full of the wounds, bruises, and putrefying sores of sin, Isaiah 1:6, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the leprosy cover all the skin of him that hath the plague, from his head even to his foot; such an one as the leper was that came to Christ for healing, said to be full of leprosy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and such in a mystical sense is every sinner, whether sensible of it or not, even from the Crown of the head to the sole of the foot, full of the wounds, bruises, and putrefying sores of sin, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "wheresoever the priest looketh; that is, he cannot look any where upon any part of him but he sees the signs of the leprosy on him; and from whence the Jewish writers gather, that a priest that inspects leprous persons ought to have a clear sight, and to have both his eyes, and that the inspection should not be made in a dark house. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m)  , Sept. \"florendo floruerit\", Montanus; so Drusius & Tigurine version. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m)  , Sept. \"florendo floruerit\", Montanus; so Drusius & Tigurine version. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And if a leprosy break out abroad in the skin, and the leprosy cover all the skin of him that hath the plague from his head even to his foot, wheresoever the priest looketh;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "ital",
        "text": "The case when the whole body is turned white",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (12–17)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A form of skin disease which is not infectious seems to be here indicated. A white efflorescence spreads over the whole body, which after a time peels off, and the skin resumes a healthy appearance. The presence of the raw flesh indicates disease (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Leviticus 13:14-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:14-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), but as soon as the whole surface becomes white, the priest shall pronounce him clean.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 12-17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If a leprosy break out abroad...  and cover all the skin.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There was a form of disease similar to true leprosy, and bearing the name of leprosy, and by some thought to be the final phase of true leprosy, which was yet not to cause legal uncleanness. It was distinguishable from the leprosy which caused uncleanness by a diffusion of the white flakes over the whole body, and by the absence of any patches bearing the appearance of raw flesh (verses 12, 13). Real leprosy might pass into this harmless kind or phase, and it was known to have done so as soon as the raw patches of flesh had disappeared (verses 16, 17). When this had taken place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the priest pronounced",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " him ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "clean",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Leviticus 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If, on the other hand, the leprosy broke out blooming on the skin, and covered the whole of the skin from head to foot \"with regard to the whole sight of the eyes of the priest,\" i.e., as far as his eyes could see, the priest was to pronounce the person clean. \"He has turned quite white,\" i.e., his dark body has all become white. The breaking out of the leprous matter in this complete and rapid way upon the surface of the whole body was the crisis of the disease; the diseased matter turned into a scurf, which died away and then fell off.",
        "children": []
      }
    ]
  }
]