[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 13:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If the leprosy have covered all the flesh ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— It may seem strange that a man who is all over leprous should be pronounced clean, and yet one who is but partially leprous should be unclean. To explain this it has been said, that when the disorder appeared only in some one part, or in a few parts, it discovered the ill humour that lurked within, and withal the inability of nature to expel it; but when it overspread all, it manifested the strength of nature, conquering the distemper, and purging out the ill humours into the outward parts. So that this sort of breaking out was rather a relief to the body than a disease; and there was no danger in the eruption. The most solid account, however, of this matter is, that this kind of leprosy was not infectious, and for that reason, he who was affected with it, is here pronounced clean. In confirmation of this we are told, that this white, or universal leprosy, is not attended with an itching, as in the other kinds.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-17 The plague of leprosy was an uncleanness, rather than a disease. Christ is said to cleanse lepers, not to cure them. Common as the leprosy was among the Hebrews, during and after their residence in Egypt, we have no reason to believe that it was known among them before. Their distressed state and employment in that land must have rendered them liable to disease. But it was a plague often inflicted immediately by the hand of God. Miriam's leprosy, and Gehazi's, and king Uzziah's, were punishments of particular sins; no marvel there was care taken to distinguish it from a common distemper. The judgment of it was referred to the priests. And it was a figure of the moral pollutions of men's minds by sin, which is the leprosy of the soul, defiling to the conscience, and from which Christ alone can cleanse. The priest could only convict the leper, (by the law is the knowledge of sin,) but Christ can cure the sinner, he can take away sin. It is a work of great importance, but of great difficulty, to judge of our spiritual state. We all have cause to suspect ourselves, being conscious of sores and spots; but whether clean or unclean is the question. As there were certain marks by which to know it was leprosy, so there are marks of such as are in the gall of bitterness. The priest must take time in making his judgment. This teaches all, both ministers and people, not to be hasty in censures, nor to judge anything before the time. If some men's sins go before unto judgment, the sins of others follow after, and so do men's good works. If the person suspected were found to be clean, yet he must wash his clothes, because there had been ground for the suspicion. We have need to be washed in the blood of Christ from our spots, though not leprosy spots; for who can say, I am pure from sin?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The disease here indicated appears to be that now known as Lepra commonis, the common White Leprosy, or Dry Tetter. It first shows itself in reddish pimples, the surface of which becomes white and scaly, spreading in a circular form until they meet each other and cover large patches of the body. It scarcely affects the general health, and for the most part disappears of itself, though it often lasts for years.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From his head even to his foot, wheresoever. the priest looketh - The first appearance of the Lepra Commonis may take place in any part of the body, especially, however, at the larger joints of the limbs; but the spots of elephantiasis are almost always first seen, on those parts which are habitually exposed, the face, ears and hands.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From his head even to his foot, wheresoever. the priest looketh - The first appearance of the Lepra Commonis may take place in any part of the body, especially, however, at the larger joints of the limbs; but the spots of elephantiasis are almost always first seen, on those parts which are habitually exposed, the face, ears and hands.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9-37. if the rising be white—This BRIGHT WHITE leprosy is the most malignant and inveterate of all the varieties the disease exhibits, and it was marked by the following distinctive signs: A glossy white and spreading scale, upon an elevated base, the elevation depressed in the middle, but without a change of color; the black hair on the patches participating in the whiteness, and the scaly patches themselves perpetually enlarging their boundary. Several of these characteristics, taken separately, belong to other blemishes of the skin as well; so that none of them was to be taken alone, and it was only when the whole of them concurred that the Jewish priest, in his capacity of physician, was to pronounce the disease a malignant leprosy. If it spread over the entire frame without producing any ulceration, it lost its contagious power by degrees; or, in other words, it ran through its course and exhausted itself. In that case, there being no longer any fear of further evil, either to the individual himself or to the community, the patient was declared clean by the priest, while the dry scales were yet upon him, and restored to society. If, on the contrary, the patches ulcerated and quick or fungous flesh sprang up in them, the purulent matter of which, if brought into contact with the skin of other persons, would be taken into the constitution by means of absorbent vessels, the priest was at once to pronounce it an inveterate leprosy. A temporary confinement was them declared to be totally unnecessary, and he was regarded as unclean for life [Dr. Good]. Other skin affections, which had a tendency to terminate in leprosy, though they were not decided symptoms when alone, were: \"a boil\" (Le 13:18-23); \"a hot burning,\"—that is, a fiery inflammation or carbuncle (Le 13:24-28); and \"a dry scall\" (Le 13:29-37), when the leprosy was distinguished by being deeper than the skin and the hair became thin and yellow.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If the leprosy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the sign or appearance of the leprosy; or the scab is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a leprosy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because at first view it seemed to be so to the priest, and to other beholders. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Have covered all his flesh:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when it appeared in some one part, it discovered the ill humour which lurked within, and withal the inability of nature to expel it; but when it overspread all, it manifested the strength of nature conquering the distemper, and purging out the ill humours into the outward parts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then the priest shall consider,.... Look wistly upon it, and well weigh the matter in his own mind, that he may make a true judgment and pronounce a right sentence: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, behold, if the leprosy have covered all his flesh; from head to foot, so that no quick, raw, or sound flesh appear in him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall pronounce him clean that hath the plague; not clean from a leprosy he is covered with; but that he is free from pollution by it, and under no obligation to bring his offering, or to perform, or have performed on him any of the rites and ceremonies used in cleansing of the leper: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it is all turned white; his skin and flesh with white bright spots, scabs and swellings, and no raw and red flesh appears: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he is clean; in a ceremonial sense: this may seem strange, that one that had a bright spot, or a white swelling, or a scab that spreads, a single one of these, or here and there one, should be unclean, and yet, if covered over with them, should be clean; the reason in nature is, because this shows a good healthful inward constitution, which throws out all its ill humours externally, whereby health is preserved; as we see in persons that have the measles or smallpox, or such like distempers, if they stick in the skin, and only here and there one rises up in a tumour, and to an head, it is a bad sign; but if they come out kindly and well, though they cover the whole body, things are very promising: the mystical or spiritual meaning of this is, that when a man sees himself to be a sinful creature, all over covered with sin, and no part free, and disclaims all righteousness of his own to justify him before God, but wholly trusts to, and depends upon the grace of God for salvation, and the righteousness of Christ for his acceptance with God; he becomes clean through the grace of God and the blood and righteousness of Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he is clean; in a ceremonial sense: this may seem strange, that one that had a bright spot, or a white swelling, or a scab that spreads, a single one of these, or here and there one, should be unclean, and yet, if covered over with them, should be clean; the reason in nature is, because this shows a good healthful inward constitution, which throws out all its ill humours externally, whereby health is preserved; as we see in persons that have the measles or smallpox, or such like distempers, if they stick in the skin, and only here and there one rises up in a tumour, and to an head, it is a bad sign; but if they come out kindly and well, though they cover the whole body, things are very promising: the mystical or spiritual meaning of this is, that when a man sees himself to be a sinful creature, all over covered with sin, and no part free, and disclaims all righteousness of his own to justify him before God, but wholly trusts to, and depends upon the grace of God for salvation, and the righteousness of Christ for his acceptance with God; he becomes clean through the grace of God and the blood and righteousness of Christ. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then the priest shall consider: and, behold, if the leprosy have covered all his flesh, he shall pronounce him {e} clean that hath the plague: it is all turned white: he is clean.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then the priest shall consider: and, behold, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "if",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the leprosy have covered all his flesh, he shall pronounce ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "him",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clean ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that hath",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the plague: it is all turned white: he ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clean.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) For it is not that contagious leprosy that infects, but a form of scales which does not leave the skin raw as leprosy does.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If, on the other hand, the leprosy broke out blooming on the skin, and covered the whole of the skin from head to foot \"with regard to the whole sight of the eyes of the priest,\" i.e., as far as his eyes could see, the priest was to pronounce the person clean. \"He has turned quite white,\" i.e., his dark body has all become white. The breaking out of the leprous matter in this complete and rapid way upon the surface of the whole body was the crisis of the disease; the diseased matter turned into a scurf, which died away and then fell off.",
        "children": []
      }
    ]
  }
]