[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the priest shall see the raw flesh.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sound flesh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It will be seen that it is the sound flesh only, and not the white hair, which renders the patient unclean.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 13:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The raw flesh — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is repeated again and again, because raw or living flesh might rather seem a sign of soundness, and the priest might easily be deceived by it, and therefore he was more narrowly to look into it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-17 The plague of leprosy was an uncleanness, rather than a disease. Christ is said to cleanse lepers, not to cure them. Common as the leprosy was among the Hebrews, during and after their residence in Egypt, we have no reason to believe that it was known among them before. Their distressed state and employment in that land must have rendered them liable to disease. But it was a plague often inflicted immediately by the hand of God. Miriam's leprosy, and Gehazi's, and king Uzziah's, were punishments of particular sins; no marvel there was care taken to distinguish it from a common distemper. The judgment of it was referred to the priests. And it was a figure of the moral pollutions of men's minds by sin, which is the leprosy of the soul, defiling to the conscience, and from which Christ alone can cleanse. The priest could only convict the leper, (by the law is the knowledge of sin,) but Christ can cure the sinner, he can take away sin. It is a work of great importance, but of great difficulty, to judge of our spiritual state. We all have cause to suspect ourselves, being conscious of sores and spots; but whether clean or unclean is the question. As there were certain marks by which to know it was leprosy, so there are marks of such as are in the gall of bitterness. The priest must take time in making his judgment. This teaches all, both ministers and people, not to be hasty in censures, nor to judge anything before the time. If some men's sins go before unto judgment, the sins of others follow after, and so do men's good works. If the person suspected were found to be clean, yet he must wash his clothes, because there had been ground for the suspicion. We have need to be washed in the blood of Christ from our spots, though not leprosy spots; for who can say, I am pure from sin?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Boil - Probably ulcer. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it would seem highly probable that the word expresses the ulcers of elephantiasis. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9-37. if the rising be white—This BRIGHT WHITE leprosy is the most malignant and inveterate of all the varieties the disease exhibits, and it was marked by the following distinctive signs: A glossy white and spreading scale, upon an elevated base, the elevation depressed in the middle, but without a change of color; the black hair on the patches participating in the whiteness, and the scaly patches themselves perpetually enlarging their boundary. Several of these characteristics, taken separately, belong to other blemishes of the skin as well; so that none of them was to be taken alone, and it was only when the whole of them concurred that the Jewish priest, in his capacity of physician, was to pronounce the disease a malignant leprosy. If it spread over the entire frame without producing any ulceration, it lost its contagious power by degrees; or, in other words, it ran through its course and exhausted itself. In that case, there being no longer any fear of further evil, either to the individual himself or to the community, the patient was declared clean by the priest, while the dry scales were yet upon him, and restored to society. If, on the contrary, the patches ulcerated and quick or fungous flesh sprang up in them, the purulent matter of which, if brought into contact with the skin of other persons, would be taken into the constitution by means of absorbent vessels, the priest was at once to pronounce it an inveterate leprosy. A temporary confinement was them declared to be totally unnecessary, and he was regarded as unclean for life [Dr. Good]. Other skin affections, which had a tendency to terminate in leprosy, though they were not decided symptoms when alone, were: \"a boil\" (Le 13:18-23); \"a hot burning,\"—that is, a fiery inflammation or carbuncle (Le 13:24-28); and \"a dry scall\" (Le 13:29-37), when the leprosy was distinguished by being deeper than the skin and the hair became thin and yellow.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The raw flesh is unclean:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is repeated again and again, because raw or living flesh might rather seem a sign of soundness, and the priest might easily be deceived by it, and therefore he was more narrowly to look into it, and to observe the place and manner and other circumstances in which it appeared. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the priest shall see the raw flesh,.... Or when he sees it, the person being brought to him to be viewed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and pronounce him to be unclean; or shall pronounce him to be unclean: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the raw flesh is unclean; made a man so in a ceremonial sense; See Gill on Leviticus 13:10, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the raw flesh is unclean; made a man so in a ceremonial sense; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "it is a leprosy; wherever any quick raw flesh appears in a swelling. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "it is a leprosy; wherever any quick raw flesh appears in a swelling. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the priest shall see the raw flesh, and pronounce him to be unclean: for the raw flesh is {f} unclean: it is a leprosy.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the priest shall see the raw flesh, and pronounce him to be unclean: ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "for",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the raw flesh ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " unclean: it ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a leprosy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) That is, declares that the flesh is not found, but is in danger of being leprous.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"But in the day when proud flesh appears upon him, he is unclean,...the proud flesh is unclean; it is leprosy.\" That is to say, if proud flesh appeared after the body had been covered with a white scurf, with which the diseased matter had apparently exhausted itself, the disease was not removed, and the person affected with it was to be pronounced unclean.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The third case: if the leprosy proceeded from an abscess which had been cured. In Leviticus 13:18 בּשׂר is first of all used absolutely, and then resumed with בּו, and the latter again is more closely defined in בּעורו: \"if there arises in the flesh, in him, in his skin, an abscess, and (it) is healed, and there arises in the place of the abscess a white elevation, or a spot of a reddish white, he (the person so affected) shall appear at the priest's.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The third case: if the leprosy proceeded from an abscess which had been cured. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " בּשׂר is first of all used absolutely, and then resumed with בּו, and the latter again is more closely defined in בּעורו: \"if there arises in the flesh, in him, in his skin, an abscess, and (it) is healed, and there arises in the place of the abscess a white elevation, or a spot of a reddish white, he (the person so affected) shall appear at the priest's.\"",
            "children": []
          }
        ]
      }
    ]
  }
]