[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It be not in sight deeper than the skin.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "its appearance is not deeper than the other skin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If the first symptom which manifests itself in the depression of the affected spot is absent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And that there is no black hair in it.—Better, but there is no black hair in it; that is, the healthy black colour of the hair is absent, which is a suspicious sign. The phrase, “there is no black hair in it,” is another way of saying “there is yellow hair in it.” The presence of yellow hair, however, on the first inspection, though suspicious, did not necessarily indicate by itself leprosy, since the hair sometimes turned yellow temporarily in the case of an ordinary ulcer, and resumed its natural black colour when the patient returned to his usual health. Hence, the absence of the black hair was simply a suspicious symptom, which required the attention of the priest, for which reason the patient had to be put in quarantine for seven days. The alteration of the word “black” into “yellow,” which has been adopted by those commentators who follow the LXX.,is therefore unnecessary. Indeed, if this reading be adopted, both the unfavourable symptoms mentioned in Leviticus 13:30, which indicate leprosy—viz., (1) the depression of the affected spot, and (2) the discolouring of the hair—would be absent. There would be no reason for quarantine, as the priest in the absence of these criteria would have to pronounce the man clean. (See Leviticus 13:37.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And that there is no black hair in it.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "but there is no black hair in it; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that is, the healthy black colour of the hair is absent, which is a suspicious sign. The phrase, “there is no black hair in it,” is another way of saying “there is yellow hair in it.” The presence of yellow hair, however, on the first inspection, though suspicious, did not necessarily indicate by itself leprosy, since the hair sometimes turned yellow temporarily in the case of an ordinary ulcer, and resumed its natural black colour when the patient returned to his usual health. Hence, the absence of the black hair was simply a suspicious symptom, which required the attention of the priest, for which reason the patient had to be put in quarantine for seven days. The alteration of the word “black” into “yellow,” which has been adopted by those commentators who follow the LXX.,is therefore unnecessary. Indeed, if this reading be adopted, both the unfavourable symptoms mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which indicate leprosy—viz., (1) the depression of the affected spot, and (2) the discolouring of the hair—would be absent. There would be no reason for quarantine, as the priest in the absence of these criteria would have to pronounce the man clean. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 13:31; Leviticus 13:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "No black hair — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For had that appeared, it had ended the doubt, the black hair being a sign of soundness and strength of nature, as this yellow hair was a sign of unsoundness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall be shaven — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For the more certain discovery of the growth or stay of the plague.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:18-44 The priest is told what judgment to make, if there were any appearance of a leprosy in old sores; and such is the danger of those who having escaped the pollutions of the world are again entangled therein. Or, in a burn by accident, ver. 24. The burning of strife and contention often occasions the rising and breaking out of that corruption, which proves that men are unclean. Human life lies exposed to many grievances. With what troops of diseases are we beset on every side; and thy all entered by sin! If the constitution be healthy, and the body lively and easy, we are bound to glorify God with our bodies. Particular note was taken of the leprosy, if in the head. If the leprosy of sin has seized the head; if the judgment be corrupted, and wicked principles, which support wicked practices, are embraced, it is utter uncleanness, from which few are cleansed. Soundness in the faith keeps leprosy from the head.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There is no black hair in it More probably, there is no yellow hair in it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9-37. if the rising be white—This BRIGHT WHITE leprosy is the most malignant and inveterate of all the varieties the disease exhibits, and it was marked by the following distinctive signs: A glossy white and spreading scale, upon an elevated base, the elevation depressed in the middle, but without a change of color; the black hair on the patches participating in the whiteness, and the scaly patches themselves perpetually enlarging their boundary. Several of these characteristics, taken separately, belong to other blemishes of the skin as well; so that none of them was to be taken alone, and it was only when the whole of them concurred that the Jewish priest, in his capacity of physician, was to pronounce the disease a malignant leprosy. If it spread over the entire frame without producing any ulceration, it lost its contagious power by degrees; or, in other words, it ran through its course and exhausted itself. In that case, there being no longer any fear of further evil, either to the individual himself or to the community, the patient was declared clean by the priest, while the dry scales were yet upon him, and restored to society. If, on the contrary, the patches ulcerated and quick or fungous flesh sprang up in them, the purulent matter of which, if brought into contact with the skin of other persons, would be taken into the constitution by means of absorbent vessels, the priest was at once to pronounce it an inveterate leprosy. A temporary confinement was them declared to be totally unnecessary, and he was regarded as unclean for life [Dr. Good]. Other skin affections, which had a tendency to terminate in leprosy, though they were not decided symptoms when alone, were: \"a boil\" (Le 13:18-23); \"a hot burning,\"—that is, a fiery inflammation or carbuncle (Le 13:24-28); and \"a dry scall\" (Le 13:29-37), when the leprosy was distinguished by being deeper than the skin and the hair became thin and yellow.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And that there is no black hair in it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for had that appeared, it had ended the doubt, the black hair being a sign of soundness and strength of nature, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 13:37",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:37",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the yellow hair was a sign of unsoundness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And if the priest look on the plague of the scall,.... As it may appear in another person, brought to him for inspection and examination: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, behold, it be not in the sight deeper than the skin; it do not seem to be got into the flesh, or lower than the skin: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and that there is no black hair in it; or, \"but no black hair in it\"; for, as Jarchi says, if there was a black hair in it, he would be clean, and there would be no need of shutting up; for black hair in scalls is a sign of cleanness, as it is said, Leviticus 13:37; it would be a clear case that such a man had no leprosy on him; for black hair is a token of a strong and healthful constitution; and there could remain no doubt about it, and it would require no further trial and examination: Ben Gersom says it means two black hairs; and further observes, that black hair in the midst of a scall is a sign of cleanness; but this being wanting: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and that there is no black hair in it; or, \"but no black hair in it\"; for, as Jarchi says, if there was a black hair in it, he would be clean, and there would be no need of shutting up; for black hair in scalls is a sign of cleanness, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it would be a clear case that such a man had no leprosy on him; for black hair is a token of a strong and healthful constitution; and there could remain no doubt about it, and it would require no further trial and examination: Ben Gersom says it means two black hairs; and further observes, that black hair in the midst of a scall is a sign of cleanness; but this being wanting: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "then the priest shall shut up him that hath the plague of the scall seven days; from the time of his viewing the scall; and so Ben Gersom, this is the seventh day from the time of looking upon the scall. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then the priest shall shut up him that hath the plague of the scall seven days; from the time of his viewing the scall; and so Ben Gersom, this is the seventh day from the time of looking upon the scall. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And if the priest look on the plague of the scall, and, behold, it be not in sight deeper than the skin, and that there is no black hair in it; then the priest shall shut up him that hath the plague of the scall seven days:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Leprosy upon the head or chin. - If the priest saw a mole upon the head or chin of a man or woman, the appearance of which was deeper than the skin, and on which the hair was yellow (צהב golden, reddish, fox-colour) and thin, he was to regard it as נתק. Leprosy on the head or chin is called נתק, probably from נתק to pluck or tear, from its plucking out the hair, or causing it to fall off; like κνήφη, the itch, from κνάω, to itch or scratch, and scabies, from scabere. But if he did not observe these two symptoms, if there was no depression of the skin, and the hair was black and not yellow, he was to shut up the person affected for seven days. In בּו אין שׁחר (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") there is certainly an error of the text: either שׁחר must be retained and אין dropped, or שׁהר must be altered into צהב, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The latter is probably the better of the two. ",
        "children": []
      }
    ]
  }
]