[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(49) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And if the plague be greenish.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If one of",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "these symptoms manifests itself in a woollen or linen garment, or in a leathern vessel, it must forthwith be shown to the priest. The Jewish canons define the colour of the green symptom to be like that of herbs, and that of the red to be like fair crimson.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:47-59 The garment suspected to be tainted with leprosy was not to be burned immediately. If, upon search, it was found that there was a leprous spot, it must be burned, or at least that part of it. If it proved to be free, it must be washed, and then might be used. This also sets forth the great evil there is in sin. It not only defiles the sinner's conscience, but it brings a stain upon all he has and all that he does. And those who make their clothes servants to their pride and lust, may see them thereby tainted with leprosy. But the robes of righteousness never fret, nor are moth-eaten.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Rather, \"And the clothing in which there is a stroke of leprosy, whether the stroke is in clothing of wool or in clothing of linen; or in yarn for warp or in yarn for woof, either for linen clothing or for woolen clothing; or in a skin of leather or in any article made of leather.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "47-59. The garment … that the … leprosy is in—It is well known that infectious diseases, such as scarlet fever, measles, the plague, are latently imbibed and carried by the clothes. But the language of this passage clearly indicates a disease to which clothes themselves were subject, and which was followed by effects on them analogous to those which malignant leprosy produces on the human body—for similar regulations were made for the rigid inspection of suspected garments by a priest as for the examination of a leprous person. It has long been conjectured and recently ascertained by the use of a lens, that the leprous condition of swine is produced by myriads of minute insects engendered in their skin; and regarding all leprosy as of the same nature, it is thought that this affords a sufficient reason for the injunction in the Mosaic law to destroy the clothes in which the disease, after careful observation, seemed to manifest itself. Clothes are sometimes seen contaminated by this disease in the West Indies and the southern parts of America [Whitlaw, Code of Health]; and it may be presumed that, as the Hebrews were living in the desert where they had not the convenience of frequent changes and washing, the clothes they wore and the skin mats on which they lay, would be apt to breed infectious vermin, which, being settled in the stuff, would imperceptibly gnaw it and leave stains similar to those described by Moses. It is well known that the wool of sheep dying of disease, if it had not been shorn from the animal while living, and also skins, if not thoroughly prepared by scouring, are liable to the effects described in this passage. The stains are described as of a greenish or reddish color, according, perhaps, to the color or nature of the ingredients used in preparing them; for acids convert blue vegetable colors into red and alkalis change then into green [Brown]. It appears, then, that the leprosy, though sometimes inflicted as a miraculous judgment (Nu 12:10; 2Ki 5:27) was a natural disease, which is known in Eastern countries still; while the rules prescribed by the Hebrew legislator for distinguishing the true character and varieties of the disease and which are far superior to the method of treatment now followed in those regions, show the divine wisdom by which he was guided. Doubtless the origin of the disease is owing to some latent causes in nature; and perhaps a more extended acquaintance with the archæology of Egypt and the natural history of the adjacent countries, may confirm the opinion that leprosy results from noxious insects or a putrid fermentation. But whatever the origin or cause of the disease, the laws enacted by divine authority regarding it, while they pointed in the first instance to sanitary ends, were at the same time intended, by stimulating to carefulness against ceremonial defilement, to foster a spirit of religious fear and inward purity.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And if the plague be greenish or reddish the garment, or in the skin,.... Either of these two colours were signs of leprosy in garments; but it is not agreed whether stronger or weaker colours are designed; the radicals of both these words being doubled, according to some, and particularly Aben Ezra, lessen the sense of them; and so our translators understand it; but, according to Ben Gersom, the signification is increased thereby, and the meaning is, if it be exceeding green or exceeding red; and this is evidently the sense of the Misnah (p); garments are defiled by green in greens, and by red in reds, that is, by the greenest and reddest; the green, the commentators say (q), is like that of the wings of peacocks and leaves of palm trees, and the red like crimson or scarlet; and now these garments or skins, in which the green or red spots appeared, must be white, and not coloured or dyed: the canon runs thus (r); skins and garments dyed are not defiled with plagues (of leprosy); a garment whose warp is dyed, and its woof white, or its woof dyed, and its warp white, all goes according to the sight; that is, according to what colour to the eye most prevails, whether white or dyed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "either in the warp or in the woof, or in anything of the skin; the same held good of these as of a garment, or anything else made of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it is a plague of leprosy; it has the signs of one, and gives great suspicion that it is one: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall be shewed unto the priest; by the person in whose possession it is, that it may be examined and judged of whether it is a leprosy or no. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Misn. Negaim, c. 11. sect. 4. (q) Maimon. & Bartenora in Misn. Edaiot, c. 7. sect. 8. (r) Misn. ut supra, (c.11.) sect. 3, 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Misn. Negaim, c. 11. sect. 4. (q) Maimon. & Bartenora in Misn. Edaiot, c. 7. sect. 8. (r) Misn. ut supra, (c.11.) sect. 3, 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And if the plague be greenish or reddish in the garment, or in the skin, either in the warp, or in the woof, or in any thing of {o} skin; it is a plague of leprosy, and shall be shewed unto the priest:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And if the plague be greenish or reddish in the garment, or in the skin, either in the warp, or in the woof, or in any thing of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " skin; it ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a plague of leprosy, and shall be shewed unto the priest:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Whether it be garment, vessel, or instrument.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 49-59.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The priest is to deal with the texture as nearly as may be in the same way that lie dealt with the human subject, in order to discriminate between a tempo-rare discoloration and a real leprosy. He ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall shut up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it that hath ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the plague seven days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (verse 50), may, as before, mean, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he shall bind up the place affected seven days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If the priest judges that it is leprosy, he is to burn the garment, if not, to tear out the piece affected, whether it be in the warp, or in the woof, that is, in whatever part it appears, and to wash the remainder twice. The expression, whether it be bare within or without, literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "whether it be bald in the head thereof or in the forehead thereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", means, \"whether the fault appear in the front or in the back of the texture.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Leviticus 13:49",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Leprosy in linen, woollen, and leather fabrics and clothes. - The only wearing apparel mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is either woollen or linen, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 31:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and among the ancient Egyptians and ancient Greeks these were the materials usually worn. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". שׁתי and ערב, \"the flax and the wool,\" i.e., for linen and woollen fabrics, are distinguished from clothes of wool or flax. The rendering given to these words by the early translators is στήμων and κρόκη, stamen et subtegmen (lxx, Vulg.), i.e., warp and weft. The objection offered to this rendering, that warp and weft could not be kept so separate from one another, that the one could be touched and rendered leprous without the other, has been met by Gussetius by the simple but correct remark, that the reference is to the yarn prepared for the warp and weft, and not to the woven fabrics themselves. So long as the yarn was not woven into a fabric, the warp-yarn and weft-yarn might very easily be separated and lie in different places, so that the one could be injured without the other. In this case the yarn intended for weaving is distinguished from the woven material, just as the leather is afterwards distinguished from leather-work (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 13:49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The signs of leprosy were, if the mole in the fabric was greenish or reddish. In that case the priest was to shut up the thing affected with leprosy for seven days, and then examine it. If the mole had spread in the meantime, it was a \"grievous leprosy.\" ממארת, from מאר irritavit, recruduit (vulnus), is to be explained, as it is by Bochart, as signifying lepra exasperata. הנּגע ממארת making the mole bad or angry; not, as Gesenius maintains, from מאר  equals  מרר acerbum faciens, i.e., dolorem acerbum excitans, which would not apply to leprosy in fabrics and houses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is not required by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 28:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All such fabrics were to be burned as unclean. ",
        "children": []
      }
    ]
  }
]