[{"num":6,"verse":"Then the Lord said to Moses, Now you shall see what I will do to Pharaoh; for [compelled] by a strong hand he will [not only] let them go, but he will drive them out of his land with a strong hand."},{"num":2,"verse":"And God said to Moses, I am the Lord."},{"num":3,"verse":"I appeared to Abraham, to Isaac, and to Jacob as God Almighty [El-Shaddai], but by My name the Lord [Yahweh—the redemptive name of God] I did not make Myself known to them [in acts and great miracles]."},{"num":4,"verse":"I have also established My covenant with them to give them the land of Canaan, the land of their temporary residence in which they were strangers."},{"num":5,"verse":"I have also heard the groaning of the Israelites whom the Egyptians have enslaved; and I have [earnestly] remembered My covenant [with Abraham, Isaac, and Jacob]."},{"num":6,"verse":"Accordingly, say to the Israelites, I am the Lord, and I will bring you out from under the burdens of the Egyptians, and I will free you from their bondage, and I will rescue you with an outstretched arm [with special and vigorous action] and by mighty acts of judgment."},{"num":7,"verse":"And I will take you to Me for a people, and I will be to you a God; and you shall know that it is I, the Lord your God, Who brings you out from under the burdens of the Egyptians."},{"num":8,"verse":"And I will bring you into the land concerning which I lifted up My hand and swore that I would give it to Abraham, Isaac, and Jacob; and I will give it to you for a heritage. I am the Lord [you have the pledge of My changeless omnipotence and faithfulness]."},{"num":9,"verse":"Moses told this to the Israelites, but they refused to listen to Moses because of their impatience and anguish of spirit and because of their cruel bondage."},{"num":10,"verse":"The Lord said to Moses,"},{"num":11,"verse":"Go in, tell Pharaoh king of Egypt to let the Israelites go out of his land."},{"num":12,"verse":"But Moses said to the Lord, Behold, [my own people] the Israelites have not listened to me; how then shall Pharaoh give heed to me, who am of deficient and impeded speech?"},{"num":13,"verse":"But the Lord spoke to Moses and Aaron, and gave them a command for the Israelites and for Pharaoh king of Egypt, to bring the Israelites out of the land of Egypt."},{"num":14,"verse":"These are the heads of their clans. The sons of Reuben, Israel’s firstborn: Hanoch, Pallu, Hezron, and Carmi; these are the families of Reuben."},{"num":15,"verse":"The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul the son of a Canaanite woman; these are the families of Simeon."},{"num":16,"verse":"These are the names of the sons of Levi according to their births: Gershon, Kohath, and Merari; and Levi lived 137 years."},{"num":17,"verse":"The sons of Gershon: Libni and Shimi, by their families."},{"num":18,"verse":"The sons of Kohath: Amram, Izhar, Hebron, and Uzziel; and Kohath lived 133 years."},{"num":19,"verse":"The sons of Merari: Mahli and Mushi. These are the families of Levi according to their generations."},{"num":20,"verse":"Amram took Jochebed his father’s sister as wife, and she bore him Aaron and Moses; and Amram lived 137 years."},{"num":21,"verse":"The sons of Izhar: Korah, Nepheg, and Zichri."},{"num":22,"verse":"The sons of Uzziel: Mishael, Elzaphan, and Sithri."},{"num":23,"verse":"Aaron took Elisheba, daughter of Amminadab and sister of Nahshon, as wife; she bore him Nadab, Abihu, Eleazar, and Ithamar."},{"num":24,"verse":"The sons of Korah: Assir, Elkanah, and Abiasaph. These are the families of the Korahites."},{"num":25,"verse":"Eleazar, Aaron’s son, took one of the daughters of Putiel as wife; and she bore him Phinehas. These are the heads of the fathers’ houses of the Levites by their families."},{"num":26,"verse":"These are the [same] Aaron and Moses to whom the Lord said, Bring out the Israelites from the land of Egypt by their hosts,"},{"num":27,"verse":"And who spoke to [the] Pharaoh king of Egypt about bringing the Israelites out of Egypt; these are that Moses and Aaron."},{"num":28,"verse":"On the day when the Lord spoke to Moses in Egypt,"},{"num":29,"verse":"The Lord said to Moses, I am the Lord; tell Pharaoh king of Egypt all that I say to you."},{"num":30,"verse":"But Moses said to the Lord, Behold, I am of deficient and impeded speech; how then shall Pharaoh listen to me?"}]