[{"num":6,"verse":"Adonai said to Moshe, “Now you will see what I am going to do to Pharaoh. With a mighty hand he will send them off; with force he will drive them from the land!”"},{"num":2,"verse":"God spoke to Moshe; he said to him, “I am Adonai. "},{"num":3,"verse":"I appeared to Avraham, Yitz’chak and Ya‘akov as El Shaddai, although I did not make myself known to them by my name, Yud-Heh-Vav-Heh [Adonai]. "},{"num":4,"verse":"Also with them I established my covenant to give them the land of Kena‘an, the land where they wandered about and lived as foreigners. "},{"num":5,"verse":"Moreover, I have heard the groaning of the people of Isra’el, whom the Egyptians are keeping in slavery; and I have remembered my covenant."},{"num":6,"verse":"“Therefore, say to the people of Isra’el: ‘I am Adonai. I will free you from the forced labor of the Egyptians, rescue you from their oppression, and redeem you with an outstretched arm and with great judgments. "},{"num":7,"verse":"I will take you as my people, and I will be your God. Then you will know that I am Adonai your God, who freed you from the forced labor of the Egyptians. "},{"num":8,"verse":"I will bring you into the land which I swore to give to Avraham, Yitz’chak and Ya‘akov — I will give it to you as your inheritance. I am Adonai.’”"},{"num":9,"verse":"Moshe said this to the people of Isra’el. But they wouldn’t listen to him, because they were so discouraged, and their slavery was so cruel."},{"num":10,"verse":"Adonai said to Moshe, "},{"num":11,"verse":"“Go in; and tell Pharaoh, king of Egypt, to let the people of Isra’el leave his land.” "},{"num":12,"verse":"Moshe said to Adonai, “Look, the people of Isra’el haven’t listened to me; so how will Pharaoh listen to me, poor speaker that I am?” "},{"num":13,"verse":"But Adonai spoke to Moshe and Aharon and gave them orders concerning both the people of Isra’el and Pharaoh, king of Egypt, to bring the people of Isra’el out of the land of Egypt."},{"num":14,"verse":"(ii) These were the heads of their families: the sons of Re’uven the firstborn of Isra’el were Hanokh, Pallu, Hetzron and Karmi. These were the families of Re’uven."},{"num":15,"verse":"The sons of Shim‘on were Y’mu’el, Yamin, Ohad, Yakhin, Tzochar and Sha’ul the son of a Kena‘ani woman. These were the families of Shim‘on."},{"num":16,"verse":"These are the names of the sons of Levi with their descendants: Gershon, K’hat and M’rari. Levi lived to be 137 years old. "},{"num":17,"verse":"The sons of Gershon were Livni and Shim‘i, with their families. "},{"num":18,"verse":"The sons of K’hat were ‘Amram, Yitz’har, Hevron and ‘Uzi’el. K’hat lived to be 133 years old. "},{"num":19,"verse":"The sons of M’rari were Machli and Mushi. These were the families of Levi with their descendants."},{"num":20,"verse":"‘Amram married Yokheved his father’s sister, and she bore him Aharon and Moshe. ‘Amram lived to be 137 years old. "},{"num":21,"verse":"The sons of Yitz’har were Korach, Nefeg and Zikhri. "},{"num":22,"verse":"The sons of ‘Uzi’el were Misha’el, Eltzafan and Sitri. "},{"num":23,"verse":"Aharon married Elisheva daughter of ‘Amminadav and sister of Nachshon, and she bore him Nadav, Avihu, El‘azar and Itamar. "},{"num":24,"verse":"The sons of Korach were Asir, Elkanah and Avi’asaf. These were the Korchi families. "},{"num":25,"verse":"El‘azar the son of Aharon married one of the daughters of Puti’el, and she bore him Pinchas. These were the heads of the families of Levi, family by family."},{"num":26,"verse":"These are the Aharon and Moshe to whom Adonai said, “Bring the people of Isra’el out of the land of Egypt, division by division,” "},{"num":27,"verse":"and who told Pharaoh king of Egypt, to let the people of Isra’el leave Egypt. These are the same Moshe and Aharon."},{"num":28,"verse":"On the day when Adonai spoke to Moshe in the land of Egypt, "},{"num":29,"verse":"(iii) he said, “I am Adonai. Tell Pharaoh, king of Egypt, everything I say to you.”"},{"num":30,"verse":"Moshe answered Adonai, “Look, I’m such a poor speaker that Pharaoh won’t listen to me.”"}]