[{"num":6,"verse":"Then the Lord said to Moses, “Now you are going to see what I will do to the king. I will force him to let my people go. In fact, I will force him to drive them out of his land.”"},{"header":"God Calls Moses"},{"num":2,"verse":"God spoke to Moses and said, “I am the Lord. "},{"num":3,"verse":"I appeared to Abraham, to Isaac, and to Jacob as Almighty God, but I did not make myself known to them by my holy name, the Lord. "},{"num":4,"verse":"I also made my covenant with them, promising to give them the land of Canaan, the land in which they had lived as foreigners. "},{"num":5,"verse":"Now I have heard the groaning of the Israelites, whom the Egyptians have enslaved, and I have remembered my covenant. "},{"num":6,"verse":"So tell the Israelites that I say to them, ‘I am the Lord; I will rescue you and set you free from your slavery to the Egyptians. I will raise my mighty arm to bring terrible punishment upon them, and I will save you. "},{"num":7,"verse":"I will make you my own people, and I will be your God. You will know that I am the Lord your God when I set you free from slavery in Egypt. "},{"num":8,"verse":"I will bring you to the land that I solemnly promised to give to Abraham, Isaac, and Jacob; and I will give it to you as your own possession. I am the Lord.’” "},{"num":9,"verse":"Moses told this to the Israelites, but they would not listen to him, because their spirit had been broken by their cruel slavery."},{"num":10,"verse":"Then the Lord said to Moses, "},{"num":11,"verse":"“Go and tell the king of Egypt that he must let the Israelites leave his land.”"},{"num":12,"verse":"But Moses replied, “Even the Israelites will not listen to me, so why should the king? I am such a poor speaker.”"},{"num":13,"verse":"The Lord commanded Moses and Aaron: “Tell the Israelites and the king of Egypt that I have ordered you to lead the Israelites out of Egypt.”"},{"header":"The Family Record of Moses and Aaron"},{"num":14,"verse":"Reuben, Jacob's first-born, had four sons: Hanoch, Pallu, Hezron, and Carmi; they were the ancestors of the clans that bear their names. "},{"num":15,"verse":"Simeon had six sons: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman; they were the ancestors of the clans that bear their names. "},{"num":16,"verse":"Levi had three sons: Gershon, Kohath, and Merari; they were the ancestors of the clans that bear their names. Levi lived 137 years. "},{"num":17,"verse":"Gershon had two sons: Libni and Shimei, and they had many descendants. "},{"num":18,"verse":"Kohath had four sons: Amram, Izhar, Hebron, and Uzziel. Kohath lived 133 years. "},{"num":19,"verse":"Merari had two sons: Mahli and Mushi. These are the clans of Levi with their descendants."},{"num":20,"verse":"Amram married his father's sister Jochebed, who bore him Aaron and Moses. Amram lived 137 years. "},{"num":21,"verse":"Izhar had three sons: Korah, Nepheg, and Zichri. "},{"num":22,"verse":"Uzziel also had three sons: Mishael, Elzaphan, and Sithri."},{"num":23,"verse":"Aaron married Elisheba, the daughter of Amminadab and sister of Nahshon; she bore him Nadab, Abihu, Eleazar, and Ithamar. "},{"num":24,"verse":"Korah had three sons: Assir, Elkanah, and Abiasaph; they were the ancestors of the divisions of the clan of Korah. "},{"num":25,"verse":"Eleazar, Aaron's son, married one of Putiel's daughters, who bore him Phinehas. These were the heads of the families and the clans of the tribe of Levi."},{"num":26,"verse":"Aaron and Moses were the ones to whom the Lord said, “Lead the tribes of Israel out of Egypt.” "},{"num":27,"verse":"They were the men who told the king of Egypt to free the Israelites."},{"header":"The Lord's Command to Moses and Aaron"},{"num":28,"verse":"When the Lord spoke to Moses in the land of Egypt, "},{"num":29,"verse":"he said, “I am the Lord. Tell the king of Egypt everything I tell you.”"},{"num":30,"verse":"But Moses answered, “You know that I am such a poor speaker; why should the king listen to me?”"}]