[{"num":6,"verse":"¶ Then the LORD said unto Moses, Now thou shalt see what I will do to Pharaoh; for with a strong hand he must let them go, and with a strong hand he shall drive them out of his land."},{"num":2,"verse":"And God spoke unto Moses and said unto him, I am the LORD;"},{"num":3,"verse":"and I appeared unto Abraham, unto Isaac, and unto Jacob, as God Almighty, but by my name the LORD (YHWH) I was not known to them."},{"num":4,"verse":"And I also established my covenant with them, to give them the land of Canaan, the land of their pilgrimage, in which they were strangers."},{"num":5,"verse":"And likewise I have heard the groaning of the sons of Israel, whom the Egyptians keep in bondage, and I have remembered my covenant."},{"num":6,"verse":"Therefore say unto the sons of Israel, I am the LORD, and I will bring you out from under the burdens of the Egyptians, and I will free you out of their bondage, and I will redeem you with a stretched out arm and with great judgments."},{"num":7,"verse":"And I will take you as my people, and I will be your God: and ye shall know that I am the LORD your God, who brought you out from under the burdens of the Egyptians."},{"num":8,"verse":"And I will bring you in unto the land, concerning which I raised my hand to give it to Abraham, to Isaac, and to Jacob; and I will give it unto you for a heritage: I am the LORD."},{"num":9,"verse":"In this manner Moses spoke unto the sons of Israel, but they did not hearken unto Moses because of their anguish of spirit and cruel bondage."},{"num":10,"verse":"¶ And the LORD spoke unto Moses, saying,"},{"num":11,"verse":"Go in, speak unto Pharaoh, king of Egypt, that he let the sons of Israel go out of his land."},{"num":12,"verse":"And Moses answered before the LORD, saying, Behold, the sons of Israel do not hearken unto me; how then shall Pharaoh hear me, seeing I am of uncircumcised lips?"},{"num":13,"verse":"Then the LORD spoke unto Moses and unto Aaron and gave them a commandment unto the sons of Israel and unto Pharaoh king of Egypt, to bring the sons of Israel out of the land of Egypt."},{"num":14,"verse":"¶ These are the heads of their fathers’ families: The sons of Reuben, the firstborn of Israel: Enoch, Pallu, Hezron, and Carmi; these are the families of Reuben."},{"num":15,"verse":"And the sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Saul the son of a Canaanite woman; these are the families of Simeon."},{"num":16,"verse":"And these are the names of the sons of Levi according to their lineages: Gershon, Kohath, and Merari. And the years of the life of Levi were one hundred thirty-seven years."},{"num":17,"verse":"The sons of Gershon: Libni, and Shimi, according to their families."},{"num":18,"verse":"And the sons of Kohath: Amram, Izhar, Hebron, and Uzziel. And the years of the life of Kohath were one hundred thirty-three years."},{"num":19,"verse":"And the sons of Merari: Mahali and Mushi; these are the families of Levi according to their lineages."},{"num":20,"verse":"And Amram took Jochebed, his father’s sister to wife; and she bore him Aaron and Moses. And the years of the life of Amram were one hundred thirty-seven years."},{"num":21,"verse":"And the sons of Izhar: Korah, Nepheg, and Zichri."},{"num":22,"verse":"And the sons of Uzziel: Mishael, Elzaphan, and Zithri."},{"num":23,"verse":"And Aaron took Elizabeth, daughter of Amminadab, sister of Naashon, to wife; and she bore him Nadab, Abihu, Eleazar, and Ithamar."},{"num":24,"verse":"And the sons of Korah: Assir, Elkanah, and Abiasaph; these are the families of the Korhites."},{"num":25,"verse":"And Eleazar, Aaron’s son, took one of the daughters of Putiel to wife; and she bore him Phinehas. These are the heads of the fathers of the Levites according to their families."},{"num":26,"verse":"These are that Aaron and Moses, to whom the LORD said, Bring out the sons of Israel from the land of Egypt according to their hosts."},{"num":27,"verse":"These are those who spoke to Pharaoh, king of Egypt, to bring out the sons of Israel from Egypt: these are that Moses and Aaron."},{"num":28,"verse":"And it came to pass on the day when the LORD spoke unto Moses in the land of Egypt,"},{"num":29,"verse":"that the LORD spoke unto Moses, saying, I am the LORD; speak thou unto Pharaoh king of Egypt all that I say unto thee."},{"num":30,"verse":"And Moses said before the LORD, Behold, I am of uncircumcised lips, and how shall Pharaoh hearken unto me?"}]