[{"num":6,"verse":"The Eternal One spoke to Moses."},{"num":9,"verse":"So Moses went and told these things to the Israelites, but they turned a deaf ear to him because they were in such low spirits and exhausted from their harsh labor."},{"num":10,"verse":"The Eternal One once again instructed Moses."},{"num":13,"verse":"The Eternal then addressed Moses and Aaron and gave them instructions about dealing with the Israelites and Pharaoh, king of Egypt. The instructions had to do with bringing the Israelites out of Egypt."},{"num":14,"verse":"These are the heads of their fathers’ families: The sons of Reuben, who was the firstborn of Israel—Hanoch and Pallu, Hezron and Carmi. This is the clan of Reuben. "},{"num":15,"verse":"Simeon’s sons—Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul (a Canaanite woman’s son). "},{"num":16,"verse":"Levi’s sons (according to the genealogical records)—Gershon, Kohath, and Merari. Levi lived to be 137 years old. "},{"num":17,"verse":"Gershon’s sons—Libni and Shimei; each became the head of a clan. "},{"num":18,"verse":"Kohath’s sons—Amram, Izhar, Hebron, and Uzziel. Kohath lived to be 133 years old. "},{"num":19,"verse":"Merari’s sons—Mahli and Mushi. These are the clans of Levi according to the genealogical records. "},{"num":20,"verse":"Amram married his father’s sister, Jochebed, and she gave birth to his sons Aaron and Moses. Amram lived to be 137 years old. "},{"num":21,"verse":"Izhar’s sons—Korah, Nepheg, and Zichri. "},{"num":22,"verse":"Uzziel’s sons—Mishael, Elzaphan, and Sithri. "},{"num":23,"verse":"Aaron married Elisheba (Amminadab’s daughter and Nahshon’s sister). Elisheba gave birth to his sons Nadab, Abihu, Eleazar, and Ithamar. "},{"num":24,"verse":"Korah’s sons—Assir, Elkanah, and Abiasaph. The clans of Korah descended from these. "},{"num":25,"verse":"Aaron’s son, Eleazar, married one of Putiel’s daughters, and she gave birth to his son Phinehas. These are the ancestors which founded the various clans of the Levites."},{"num":26,"verse":"These are the same Aaron and Moses whom the Eternal directed, “Lead the people of Israel out of the land of Egypt like a victorious army.” These two brothers spoke to Pharaoh, Egypt’s king, about releasing the Israelites from Egypt."},{"num":28,"verse":"One day the Eternal visited Moses in Egypt and said to him,"}]