[[],[{"type":"header","content":"Sheba’s Revolt"},{"type":"prose","content":"Now a worthless man happened to be there whose name was Sheba, the son of Bichri, a Benjaminite; and he blew the trumpet and said,"},{"type":"poetry","content":"“We have no share in David,"},{"type":"poetry","content":"Nor do we have an inheritance in the son of Jesse;"},{"type":"poetry","content":"Every man to his tents, Israel!”"}],[{"type":"prose","content":"So all the men of Israel withdrew from following David  followed Sheba the son of Bichri; but the men of Judah remained loyal to their king, from the Jordan even to Jerusalem."}],[{"type":"prose","content":"Then David came to his house in Jerusalem, and the king took the ten women, the concubines whom he had left behind to take care of the house, and put them in custody and provided them with food, but did not have relations with them. So they were locked up until the day of their death, living as widows."}],[{"type":"prose","content":"Now the king said to Amasa, “Summon the men of Judah for me  three days, and be present here yourself.”"}],[{"type":"prose","content":"So Amasa went to summon  Judah, but he was delayed longer than the set time which he had designated for him."}],[{"type":"prose","content":"And David said to Abishai, “Now Sheba the son of Bichri will do us more harm than Absalom; take your lord’s servants and pursue him, so that he does not find for himself fortified cities and escape from our sight.”"}],[{"type":"prose","content":"So Joab’s men went out after him, along with the Cherethites, the Pelethites, and all the warriors; and they left Jerusalem to pursue Sheba the son of Bichri."}],[{"type":"prose","content":"When they were at the large stone which is in Gibeon, Amasa came to meet them. Now Joab was dressed in his military attire, and over it  a belt with a sword in its sheath strapped on at his waist; and as he went forward, it fell out."}],[{"type":"prose","content":"And Joab said to Amasa, “Is it going well for you, my brother?” And Joab took hold of Amasa by the beard with his right hand to kiss him."},{"type":"header","content":"Amasa Murdered"}],[{"type":"prose","content":"But Amasa was not on guard against the sword which was in Joab’s hand, so he struck him in the belly with it and spilled out his intestines on the ground, and did not  him again, and he died. Then Joab and his brother Abishai pursued Sheba the son of Bichri."}],[{"type":"prose","content":"Now one of Joab’s young men stood by him and said, “Whoever favors Joab and whoever is for David, follow Joab!”"}],[{"type":"prose","content":"But Amasa was wallowing in  blood in the middle of the road. And when the man saw that all the people stood still, he removed Amasa from the road to the field and threw a garment over him when he saw that everyone who came by him stood still."},{"type":"header","content":"Revolt Put Down"}],[{"type":"prose","content":"As soon as he was removed from the road, all the men went on after Joab to pursue Sheba the son of Bichri."}],[{"type":"prose","content":"Now he went on through all the tribes of Israel to Abel, that is, Beth-maacah, and all the Berites; and they assembled and went after him as well."}],[{"type":"prose","content":"And they came and besieged him in Abel Beth-maacah, and they built up an assault ramp against the city, and it stood against the outer rampart; and all the people who were with Joab were wreaking destruction in order to topple the wall."}],[{"type":"prose","content":"Then a wise woman called out from the city, “Listen, listen! Please tell Joab, ‘Come here that I may speak with you.’”"}],[{"type":"prose","content":"So he approached her, and the woman said, “Are you Joab?” And he answered, “I am.” Then she said to him, “Listen to the words of your slave.” And he said, “I am listening.”"}],[{"type":"prose","content":"Then she spoke, saying, “In the past they used to say, ‘They will undoubtedly ask  at Abel,’ and that is how they ended ."}],[{"type":"prose","content":"I  of those who are ready for peace  faithful in Israel. You are trying to destroy a city, even a mother in Israel. Why would you swallow up the inheritance of the ?”"}],[{"type":"prose","content":"Joab replied, “Far be it, far be it from me that I would consume or destroy!"}],[{"type":"prose","content":"Such is not the case. But a man from the hill country of Ephraim, Sheba the son of Bichri by name, has raised his hand against King David. Only turn him over, and I will depart from the city.” And the woman said to Joab, “Behold, his head will be thrown to you over the wall.”"}],[{"type":"prose","content":"Then the woman wisely came to all the people. And they cut off the head of Sheba the son of Bichri and threw it to Joab. So he blew the trumpet, and they were dispersed from the city, each to his tent. Joab also returned to the king at Jerusalem."}],[{"type":"prose","content":"Now Joab was  of the entire army of Israel, and Benaiah the son of Jehoiada was over the Cherethites and the Pelethites;"}],[{"type":"prose","content":"and Adoram was over the forced labor, and Jehoshaphat the son of Ahilud was the secretary;"}],[{"type":"prose","content":"and Sheva was scribe, and Zadok and Abiathar were priests;"}],[{"type":"prose","content":"Ira the Jairite also was a priest to David."}]]