[{"header":"Renewal of the Covenant"},{"num":29,"verse":"These are the words of the covenant which the Lord commanded Moses to make with the children of Israel in the land of Moab, besides the covenant which He made with them in Horeb."},{"num":2,"verse":"Moses proclaimed to all Israel, and said to them:"},{"num":3,"verse":"the great temptations which your eyes have seen, those signs and great wonders. "},{"num":4,"verse":"Yet to this day the Lord has not given you a heart to know, eyes to see, and ears to hear. "},{"num":5,"verse":"I have led you forty years in the wilderness. Your clothes have not worn out on you, and your sandal has not worn out on your foot. "},{"num":6,"verse":"You have not eaten bread, nor have you drunk wine or strong drink, so that you might know that I am the Lord your God."},{"num":7,"verse":"When you came to this place, Sihon, the king of Heshbon, and Og, the king of Bashan, came out against us to battle, and we defeated them. "},{"num":8,"verse":"We took their land and gave it as an inheritance to the Reubenites, the Gadites, and to half of the tribe of Manasseh."},{"num":9,"verse":"Therefore, keep the words of this covenant and do them, so that you may prosper in all you do. "},{"num":10,"verse":"Today all of you stand before the Lord your God, the heads of your tribes, your elders, and your officers, with all the men of Israel, "},{"num":11,"verse":"your little ones, your wives, and your foreigners who are in your camp, from the one who chops your wood to the one who draws your water— "},{"num":12,"verse":"so that you should enter into a covenant with the Lord your God, and into His oath, which the Lord your God is making with you today. "},{"num":13,"verse":"Today He will establish that you are His people and that He is your God, just as He has said to you and He has sworn to your fathers, to Abraham, to Isaac, and to Jacob. "},{"num":14,"verse":"It is not with you alone that I am making this covenant and this oath, "},{"num":15,"verse":"but with him who stands here with us today before the Lord our God, and with him who is not here with us today "},{"num":16,"verse":"(for you know that we lived in the land of Egypt and how we came through the nations which you passed by, "},{"num":17,"verse":"and you have seen their abominations and their idols of wood and stone, of silver and gold, which were among them); "},{"num":18,"verse":"lest there be among you a man or woman or family or tribe whose heart turns away today from the Lord our God to go and serve the gods of these nations, and lest there be among you a root bearing poisonous and bitter fruit; "},{"num":19,"verse":"and it happens that, when he hears the words of this covenant, he blesses himself in his heart, saying, “I shall have peace, even though I walk in the stubbornness of my heart,” thus destroying the watered ground with the dry. "},{"num":20,"verse":"The Lord will not spare him; rather the anger of the Lord and His jealousy will smolder against that man. All the curses that are written in this book will rest on him, and the Lord will blot out his name from under heaven. "},{"num":21,"verse":"The Lord will single him out for disaster out of all the tribes of Israel, according to all the curses of the covenant that are written in this Book of the Law."},{"num":22,"verse":"The generation to come, your children who will rise up after you and the foreigner who will come from a far land, when they see the plagues of that land, and the sicknesses which the Lord has laid on it, will say, "},{"num":23,"verse":"“The whole land is brimstone and salt, a burning waste, unsown and unproductive, and no grass grows there, like the overthrow of Sodom and Gomorrah, Admah and Zeboyim, which the Lord overthrew in His anger and wrath.” "},{"num":24,"verse":"All nations will say, “Why has the Lord done such to this land? What does the heatedness of this great anger mean?”"},{"num":25,"verse":"Then men will say, “Because they have forsaken the covenant of the Lord God of their fathers, which He made with them when He brought them out of the land of Egypt. "},{"num":26,"verse":"For they went and served other gods, and worshipped them, gods which they did not know and which He had not given to them. "},{"num":27,"verse":"The anger of the Lord burned against this land, bringing on it all the curses that are written in this book. "},{"num":28,"verse":"The Lord rooted them out of their land in anger and in wrath and in great indignation, and threw them into another land, as it is today.”"},{"num":29,"verse":"The secret things belong to the Lord our God, but those things which are revealed belong to us and to our children forever, so that we may keep all the words of this law."}]