[{"header":"The Covenant in Moab"},{"num":29,"verse":"These are the words of the covenant which the Lord commanded Moses to make with the sons of Israel in the land of Moab, besides the covenant which He had made with them at Horeb."},{"num":2,"verse":"And Moses summoned all Israel and said to them, “You have seen all that the Lord did before your eyes in the land of Egypt to Pharaoh and all his servants, and to all his land;"},{"num":3,"verse":"the great trials which your eyes have seen, those great signs and wonders."},{"num":4,"verse":"Yet to this day the Lord has not given you a heart to know, nor eyes to see, nor ears to hear."},{"num":5,"verse":"And I have led you in the wilderness for forty years; your clothes have not worn out on you, and your sandal has not worn out on your foot."},{"num":6,"verse":"You have not eaten bread, nor have you drunk wine or other strong drink, in order that you might know that I am the Lord your God."},{"num":7,"verse":"When you reached this place, Sihon the king of Heshbon and Og the king of Bashan came out to meet us for battle, but we defeated them;"},{"num":8,"verse":"and we took their land and gave it as an inheritance to the Reubenites, the Gadites, and the half-tribe of the Manassites."},{"num":9,"verse":"So you will keep the words of this covenant and do them, in order that you may be successful in everything that you do."},{"num":10,"verse":"“You stand today, all of you, before the Lord your God: your heads, your tribes, your elders and your officers, that is, all the men of Israel,"},{"num":11,"verse":"your little ones, your wives, and the stranger who is within your camps, from the one who gathers your firewood to the one who draws your water,"},{"num":12,"verse":"so that you may enter into the covenant with the Lord your God, and into His oath which the Lord your God is making with you today,"},{"num":13,"verse":"in order that He may establish you today as His people, and that He may be your God, just as He spoke to you and as He swore to your fathers, to Abraham, Isaac, and Jacob."},{"num":14,"verse":"“Now it is not with you alone that I am making this covenant and this oath,"},{"num":15,"verse":"but both with those who stand here with us today in the presence of the Lord our God, and with those who are not with us here today"},{"num":16,"verse":"(for you know how we lived in the land of Egypt, and how we passed through the midst of the nations through which you passed;"},{"num":17,"verse":"moreover, you have seen their abominations and their idols made of wood and stone, silver and gold, which they had with them);"},{"num":18,"verse":"so that there will not be among you a man or woman, or family or tribe, whose heart turns away today from the Lord our God, to go to serve the gods of those nations; that there will not be among you a root bearing poisonous fruit and wormwood."},{"num":19,"verse":"And it shall be when he hears the words of this curse, that he will consider himself fortunate in his heart, saying, ‘I will do well though I walk in the stubbornness of my heart in order to destroy the watered land along with the dry.’"},{"num":20,"verse":"The Lord will not be willing to forgive him, but rather the anger of the Lord and His wrath will burn against that person, and every curse that is written in this book will lie upon him, and the Lord will wipe out his name from under heaven."},{"num":21,"verse":"Then the Lord will single him out for disaster from all the tribes of Israel, in accordance with all the curses of the covenant which is written in this Book of the Law."},{"num":22,"verse":"“Now the future generation, your sons who rise up after you and the foreigner who comes from a distant land, when they see the plagues of that land and the diseases with which the Lord has afflicted it, will say,"},{"num":23,"verse":"‘All its land is brimstone and salt, burned debris, unsown and unproductive, and no grass grows on it, like the overthrow of Sodom and Gomorrah, Admah and Zeboiim, which the Lord overthrew in His anger and in His wrath.’"},{"num":24,"verse":"All the nations will say, ‘Why has the Lord done all this to this land? Why this great outburst of anger?’"},{"num":25,"verse":"Then people will say, ‘It is because they abandoned the covenant of the Lord, the God of their fathers, which He made with them when He brought them out of the land of Egypt."},{"num":26,"verse":"And they went and served other gods and worshiped them, gods that they have not known and whom He had not assigned to them."},{"num":27,"verse":"Therefore, the anger of the Lord burned against that land, to bring upon it every curse which is written in this book;"},{"num":28,"verse":"and the Lord uprooted them from their land in anger, fury, and in great wrath, and hurled them into another land, as it is this day.’"},{"num":29,"verse":"“The secret things belong to the Lord our God, but the things revealed belong to us and to our sons forever, so that we may follow all the words of this Law."}]