[{"header":"Servants of the New Agreement"},{"num":3,"verse":"Are we starting to brag about ourselves again? Do we need letters of introduction to you or from you, like some other people? "},{"num":2,"verse":"You yourselves are our letter, written on our hearts, known and read by everyone. "},{"num":3,"verse":"You show that you are a letter from Christ sent through us. This letter is not written with ink but with the Spirit of the living God. It is not written on stone tablets but on human hearts."},{"num":4,"verse":"We can say this, because through Christ we feel certain before God. "},{"num":5,"verse":"We are not saying that we can do this work ourselves. It is God who makes us able to do all that we do. "},{"num":6,"verse":"He made us able to be servants of a new agreement from himself to his people. This new agreement is not a written law, but it is of the Spirit. The written law brings death, but the Spirit gives life."},{"num":7,"verse":"The law that brought death was written in words on stone. It came with God’s glory, which made Moses’ face so bright that the Israelites could not continue to look at it. But that glory later disappeared. "},{"num":8,"verse":"So surely the new way that brings the Spirit has even more glory. "},{"num":9,"verse":"If the law that judged people guilty of sin had glory, surely the new way that makes people right with God has much greater glory. "},{"num":10,"verse":"That old law had glory, but it really loses its glory when it is compared to the much greater glory of this new way. "},{"num":11,"verse":"If that law which disappeared came with glory, then this new way which continues forever has much greater glory."},{"num":12,"verse":"We have this hope, so we are very bold. "},{"num":13,"verse":"We are not like Moses, who put a covering over his face so the Israelites would not see it. The glory was disappearing, and Moses did not want them to see it end. "},{"num":14,"verse":"But their minds were closed, and even today that same covering hides the meaning when they read the old agreement. That covering is taken away only through Christ. "},{"num":15,"verse":"Even today, when they read the law of Moses, there is a covering over their minds. "},{"num":16,"verse":"But when a person changes and follows the Lord, that covering is taken away. "},{"num":17,"verse":"The Lord is the Spirit, and where the Spirit of the Lord is, there is freedom. "},{"num":18,"verse":"Our faces, then, are not covered. We all show the Lord’s glory, and we are being changed to be like him. This change in us brings ever greater glory, which comes from the Lord, who is the Spirit."}]