[{"header":"Greeting"},{"num":1,"verse":"From James, a servant of God and of the Lord Jesus Christ."},{"header":"When You Are Tested, Turn to God"},{"num":2,"verse":"My brothers and sisters, be very happy when you are tested in different ways. "},{"num":3,"verse":"You know that such testing of your faith produces endurance. "},{"num":4,"verse":"Endure until your testing is over. Then you will be mature and complete, and you won’t need anything."},{"num":5,"verse":"If any of you needs wisdom to know what you should do, you should ask God, and he will give it to you. God is generous to everyone and doesn’t find fault with them. "},{"num":6,"verse":"When you ask for something, don’t have any doubts. A person who has doubts is like a wave that is blown by the wind and tossed by the sea. "},{"num":7,"verse":"A person who has doubts shouldn’t expect to receive anything from the Lord. "},{"num":8,"verse":"A person who has doubts is thinking about two different things at the same time and can’t make up his mind about anything."},{"num":9,"verse":"Humble believers should be proud because being humble makes them important. "},{"num":10,"verse":"Rich believers should be proud because being rich should make them humble. Rich people will wither like flowers. "},{"num":11,"verse":"The sun rises with its scorching heat and dries up plants. The flowers drop off, and the beauty is gone. The same thing will happen to rich people. While they are busy, they will die."},{"num":12,"verse":"Blessed are those who endure when they are tested. When they pass the test, they will receive the crown of life that God has promised to those who love him. "},{"num":13,"verse":"When someone is tempted, he shouldn’t say that God is tempting him. God can’t be tempted by evil, and God doesn’t tempt anyone. "},{"num":14,"verse":"Everyone is tempted by his own desires as they lure him away and trap him. "},{"num":15,"verse":"Then desire becomes pregnant and gives birth to sin. When sin grows up, it gives birth to death."},{"num":16,"verse":"My dear brothers and sisters, don’t be fooled. "},{"num":17,"verse":"Every good present and every perfect gift comes from above, from the Father who made the sun, moon, and stars. The Father doesn’t change like the shifting shadows produced by the sun and the moon."},{"num":18,"verse":"God decided to give us life through the word of truth to make us his most important creatures."},{"num":19,"verse":"Remember this, my dear brothers and sisters: Everyone should be quick to listen, slow to speak, and should not get angry easily. "},{"num":20,"verse":"An angry person doesn’t do what God approves of. "},{"num":21,"verse":"So get rid of all immoral behavior and all the wicked things you do. Humbly accept the word that God has placed in you. This word can save you."},{"num":22,"verse":"Do what God’s word says. Don’t merely listen to it, or you will fool yourselves. "},{"num":23,"verse":"If someone listens to God’s word but doesn’t do what it says, he is like a person who looks at his face in a mirror, "},{"num":24,"verse":"studies his features, goes away, and immediately forgets what he looks like. "},{"num":25,"verse":"However, the person who continues to study God’s perfect laws that make people free and who remains committed to them will be blessed. People like that don’t merely listen and forget; they actually do what God’s laws say."},{"num":26,"verse":"If a person thinks that he is religious but can’t control his tongue, he is fooling himself. That person’s religion is worthless. "},{"num":27,"verse":"Pure, unstained religion, according to God our Father, is to take care of orphans and widows when they suffer and to remain uncorrupted by this world."}]