[{"num":1,"verse":"I, James, am writing this letter. I serve God and the Lord Jesus Christ."},{"header":"Facing All Kinds of Trouble"},{"num":2,"verse":"My brothers and sisters, you will face all kinds of trouble. When you do, think of it as pure joy. "},{"num":3,"verse":"Your faith will be tested. You know that when this happens it will produce in you the strength to continue. "},{"num":4,"verse":"And you must allow this strength to finish its work. Then you will be all you should be. You will have everything you need. "},{"num":5,"verse":"If any of you needs wisdom, you should ask God for it. He will give it to you. God gives freely to everyone and doesn’t find fault. "},{"num":6,"verse":"But when you ask, you must believe. You must not doubt. That’s because a person who doubts is like a wave of the sea. The wind blows and tosses them around. "},{"num":7,"verse":"They shouldn’t expect to receive anything from the Lord. "},{"num":8,"verse":"This kind of person can’t make up their mind. They can never decide what to do."},{"num":9,"verse":"Here’s what believers who are in low positions in life should be proud of. They should be proud that God has given them a high position in the kingdom. "},{"num":10,"verse":"But rich people should take pride in their low positions. That’s because they will fade away like wild flowers. "},{"num":11,"verse":"The sun rises. Its burning heat dries up the plants. Their blossoms fall. Their beauty is destroyed. In the same way, rich people will fade away. They fade away even as they go about their business."},{"num":12,"verse":"Blessed is the person who keeps on going when times are hard. After they have come through hard times, this person will receive a crown. The crown is life itself. The Lord has promised it to those who love him."},{"num":13,"verse":"When a person is tempted, they shouldn’t say, “God is tempting me.” God can’t be tempted by evil. And he doesn’t tempt anyone. "},{"num":14,"verse":"But each person is tempted by their own evil desires. These desires lead them on and drag them away. "},{"num":15,"verse":"When these desires are allowed to remain, they lead to sin. And when sin is allowed to remain and grow, it leads to death."},{"num":16,"verse":"My dear brothers and sisters, don’t let anyone fool you. "},{"num":17,"verse":"Every good and perfect gift is from God. This kind of gift comes down from the Father who created the heavenly lights. These lights create shadows that move. But the Father does not change like these shadows. "},{"num":18,"verse":"God chose to give us new birth through the message of truth. He wanted us to be the first harvest of his new creation."},{"header":"Listen to the Word and Do What It Says"},{"num":19,"verse":"My dear brothers and sisters, pay attention to what I say. Everyone should be quick to listen. But they should be slow to speak. They should be slow to get angry. "},{"num":20,"verse":"Human anger doesn’t produce the holy life God wants. "},{"num":21,"verse":"So get rid of everything that is sinful. Get rid of the evil that is all around us. Don’t be too proud to accept the word that is planted in you. It can save you."},{"num":22,"verse":"Don’t just listen to the word. You fool yourselves if you do that. You must do what it says. "},{"num":23,"verse":"Suppose someone listens to the word but doesn’t do what it says. Then they are like a person who looks at their face in a mirror. "},{"num":24,"verse":"After looking at themselves, they leave. And right away they forget what they look like. "},{"num":25,"verse":"But suppose someone takes a good look at the perfect law that gives freedom. And they keep looking at it. Suppose they don’t forget what they’ve heard, but they do what the law says. Then this person will be blessed in what they do."},{"num":26,"verse":"Suppose people think their beliefs and how they live are both right. But they don’t control what they say. Then they are fooling themselves. Their beliefs and way of life are not worth anything at all. "},{"num":27,"verse":"Here are the beliefs and way of life that God our Father accepts as pure and without fault. When widows are in trouble, take care of them. Do the same for children who have no parents. And don’t let the world make you impure."}]