[{"num":1,"verse":"From: James, a servant of God and of the Lord Jesus Christ."},{"num":2,"verse":"Dear brothers, is your life full of difficulties and temptations? Then be happy, "},{"num":3,"verse":"for when the way is rough, your patience has a chance to grow. "},{"num":4,"verse":"So let it grow, and don’t try to squirm out of your problems. For when your patience is finally in full bloom, then you will be ready for anything, strong in character, full and complete."},{"num":5,"verse":"If you want to know what God wants you to do, ask him, and he will gladly tell you, for he is always ready to give a bountiful supply of wisdom to all who ask him; he will not resent it. "},{"num":6,"verse":"But when you ask him, be sure that you really expect him to tell you, for a doubtful mind will be as unsettled as a wave of the sea that is driven and tossed by the wind; "},{"num":7,"verse":"and every decision you then make will be uncertain, as you turn first this way and then that. If you don’t ask with faith, don’t expect the Lord to give you any solid answer."},{"num":9,"verse":"A Christian who doesn’t amount to much in this world should be glad, for he is great in the Lord’s sight. "},{"num":10,"verse":"But a rich man should be glad that his riches mean nothing to the Lord, for he will soon be gone, like a flower that has lost its beauty and fades away, withered—killed by the scorching summer sun. So it is with rich men. They will soon die and leave behind all their busy activities."},{"num":12,"verse":"Happy is the man who doesn’t give in and do wrong when he is tempted, for afterwards he will get as his reward the crown of life that God has promised those who love him. "},{"num":13,"verse":"And remember, when someone wants to do wrong it is never God who is tempting him, for God never wants to do wrong and never tempts anyone else to do it. "},{"num":14,"verse":"Temptation is the pull of man’s own evil thoughts and wishes. "},{"num":15,"verse":"These evil thoughts lead to evil actions and afterwards to the death penalty from God. "},{"num":16,"verse":"So don’t be misled, dear brothers."},{"num":17,"verse":"But whatever is good and perfect comes to us from God, the Creator of all light, and he shines forever without change or shadow. "},{"num":18,"verse":"And it was a happy day for him when he gave us our new lives through the truth of his Word, and we became, as it were, the first children in his new family."},{"num":19,"verse":"Dear brothers, don’t ever forget that it is best to listen much, speak little, and not become angry; "},{"num":20,"verse":"for anger doesn’t make us good, as God demands that we must be."},{"num":21,"verse":"So get rid of all that is wrong in your life, both inside and outside, and humbly be glad for the wonderful message we have received, for it is able to save our souls as it takes hold of our hearts."},{"num":22,"verse":"And remember, it is a message to obey, not just to listen to. So don’t fool yourselves. "},{"num":23,"verse":"For if a person just listens and doesn’t obey, he is like a man looking at his face in a mirror; "},{"num":24,"verse":"as soon as he walks away, he can’t see himself anymore or remember what he looks like. "},{"num":25,"verse":"But if anyone keeps looking steadily into God’s law for free men, he will not only remember it but he will do what it says, and God will greatly bless him in everything he does."},{"num":26,"verse":"Anyone who says he is a Christian but doesn’t control his sharp tongue is just fooling himself, and his religion isn’t worth much. "},{"num":27,"verse":"The Christian who is pure and without fault, from God the Father’s point of view, is the one who takes care of orphans and widows, and who remains true to the Lord—not soiled and dirtied by his contacts with the world."}]