[{"header":"Trouble With Aram"},{"num":7,"verse":"Ahaz was the son of Jotham, who was the son of Uzziah. Rezin was the king of Aram, Pekah son of Remaliah was the king of Israel. When Ahaz was king of Judah, Rezin and Pekah went up to Jerusalem to attack it, but they were not able to defeat the city."},{"num":2,"verse":"The family of David received a message that said, “The armies of Aram and Ephraim have joined together in one camp.” When King Ahaz heard this message, he and the people became frightened. They shook with fear like trees of the forest blowing in the wind."},{"num":3,"verse":"Then the Lord told Isaiah, “You and your son Shear Jashub should go out and talk to Ahaz. Go to the place where the water flows into the Upper Pool, on the street that leads up to Laundryman’s Field."},{"num":4,"verse":"“Tell Ahaz, ‘Be careful, but be calm. Don’t be afraid. Don’t let those two men, Rezin and Remaliah’s son, frighten you! They are like two burning sticks. They might be hot now, but soon they will be nothing but smoke. Rezin, Aram, and Remaliah’s son became angry"},{"num":5,"verse":"and made plans against you. They said,"},{"num":6,"verse":"“Let’s go fight against Judah and divide it among ourselves. Then we will make Tabeel’s son the new king of Judah.”’”"},{"num":7,"verse":"But the Lord God says, “Their plan will not succeed. It will not happen"},{"num":8,"verse":"because Aram depends on its capital Damascus, and Damascus is led by its weak king Rezin. And don’t worry about Ephraim. Within 65 years it will be crushed, no longer a nation."},{"num":9,"verse":"Ephraim depends on its capital Samaria, and Samaria is led by Remaliah’s son. So you have no reason to fear. Believe this, or you will not survive.”"},{"header":"Immanuel—God Is With Us"},{"num":10,"verse":"Then the Lord spoke to Ahaz again"},{"num":11,"verse":"and said, “Ask for a sign from the Lord your God to prove to yourself that this is true. You can ask for any sign you want. The sign can come from a place as deep as Sheol or as high as the skies.”"},{"num":12,"verse":"But Ahaz said, “I will not ask for a sign as proof. I will not test the Lord.”"},{"num":13,"verse":"Then Isaiah said, “Family of David, listen very carefully! Is it not enough that you would test the patience of humans? Will you now test the patience of my God?"},{"num":14,"verse":"But the Lord will still show you this sign:"},{"num":17,"verse":"“But the Lord will bring troubled times to you. These troubles will be worse than anything that has happened since the time Israel separated from Judah. This will happen to your people and to your father’s family when God brings the king of Assyria to fight against you."},{"num":18,"verse":"“At that time the Lord will call for the ‘Fly’ that is now near the streams of Egypt, and he will call for the ‘Bee’ that is now in the country of Assyria. Those enemies will come to your country."},{"num":19,"verse":"They will settle in the deep valleys and in the caves, by the thornbushes and watering holes."},{"num":20,"verse":"The Lord will use Assyria to punish Judah. Assyria will be hired and used like a razor to shave off Judah’s beard and to remove the hair from his head and body."},{"num":21,"verse":"“At that time someone might keep only one young cow and two sheep alive."},{"num":22,"verse":"But there will be enough milk for them to eat milk curds. In fact, everyone left in the country will eat milk curds and honey."},{"num":23,"verse":"There are now fields that have 1000 grapevines, and each grapevine is worth 1000 pieces of silver. But those fields will be covered with weeds and thorns."},{"num":24,"verse":"That land will be wild and used only as a hunting ground where people go with bows and arrows."},{"num":25,"verse":"People once worked the soil and grew food on these hills, but at that time they will not go there, because the fields will be covered with weeds and thorns. It will be a place where cattle graze and sheep wander.”"}]