[{"num":7,"verse":"¶ And it came to pass in the days of Ahaz the son of Jotham, the son of Uzziah, king of Judah, that Rezin the king of Syria, and Pekah the son of Remaliah, king of Israel, went up toward Jerusalem to war against it, but could not prevail against it."},{"num":2,"verse":"And it was told the house of David, saying Syria is confederate with Ephraim. And his heart was moved and the heart of his people as the trees of the wood are moved with the wind."},{"num":3,"verse":"Then the LORD said unto Isaiah, Go forth now to meet Ahaz, thou and Shearjashub thy son, at the end of the conduit of the upper pool in the highway of the washer’s field"},{"num":4,"verse":"and say unto him, Take heed, and be quiet; do not fear, neither be fainthearted for the two tails of these smoking firebrands, for the fierce anger of Rezin with Syria, and of the son of Remaliah."},{"num":5,"verse":"Because Syria, Ephraim, and the son of Remaliah have taken evil counsel against thee saying,"},{"num":6,"verse":"Let us go up against Judah and vex it, and let us divide it between us and set a king in the midst of it, even the son of Tabeal:"},{"num":7,"verse":"Thus saith the Lord GOD, It shall not stand, neither shall it come to pass."},{"num":8,"verse":"For the head of Syria shall be Damascus, and the head of Damascus Rezin; and within sixty-five years Ephraim shall be broken, and it shall never again be a people."},{"num":9,"verse":"In the meantime the head of Ephraim shall be Samaria, and the head of Samaria, Remaliah’s son. If ye will not believe, surely ye shall not be established."},{"num":10,"verse":"¶ Moreover the LORD spoke again unto Ahaz, saying"},{"num":11,"verse":"Ask a sign of the LORD thy God; ask it either in the depth, or in the height above."},{"num":12,"verse":"But Ahaz said, I will not ask, neither will I tempt the LORD."},{"num":13,"verse":"Then said Isaiah, Hear ye now, O house of David, Is it a small thing for you to weary men, but will ye weary my God also?"},{"num":14,"verse":"Therefore the Lord himself shall give you a sign: Behold, the virgin shall conceive and bear a son and shall call his name Immanuel."},{"num":15,"verse":"He shall eat butter and honey that he may know to refuse the evil and choose the good."},{"num":16,"verse":"For before the child shall know to refuse the evil and choose the good; the land that thou dost abhor shall be forsaken of both her kings."},{"num":17,"verse":"¶ The LORD shall bring upon thee and upon thy people and upon thy father’s house days that have not come since the day that Ephraim departed from Judah; even unto the king of Assyria."},{"num":18,"verse":"And it shall come to pass in that day, that the LORD shall hiss for the fly that is in the uttermost part of the rivers of Egypt and for the bee that is in the land of Assyria."},{"num":19,"verse":"And they shall come and all of them shall rest in the desolate valleys and in the holes of the rocks and upon all thorns and upon all bushes."},{"num":20,"verse":"In the same day the Lord shall raze with a razor that is hired, namely, by them beyond the river by the king of Assyria, the head, and the hair of the feet and it shall also consume the beard."},{"num":21,"verse":"And it shall come to pass in that day that a man shall nourish a young cow and two sheep;"},{"num":22,"verse":"and it shall come to pass for the abundance of milk that they shall give, he shall eat butter; for butter and honey shall every one eat that is left in the land."},{"num":23,"verse":"And it shall come to pass in that day that in the place where there were a thousand vines that were worth a thousand shekels of silver, it shall even be for the briers and for the thorns."},{"num":24,"verse":"With arrows and with bows shall men come there because all the land shall become briers and thorns."},{"num":25,"verse":"But the fear of briers and thorns shall not come unto all the hills that were dug with the hoe, but they shall be for pasture of oxen and for the treading of the lesser cattle."}]