[{"header":"An Illustration from Marriage"},{"num":7,"verse":"Certainly you will understand what I am about to say, my friends, because all of you know about law. The law rules over people only as long as they live. "},{"num":2,"verse":"A married woman, for example, is bound by the law to her husband as long as he lives; but if he dies, then she is free from the law that bound her to him. "},{"num":3,"verse":"So then, if she lives with another man while her husband is alive, she will be called an adulteress; but if her husband dies, she is legally a free woman and does not commit adultery if she marries another man. "},{"num":4,"verse":"That is how it is with you, my friends. As far as the Law is concerned, you also have died because you are part of the body of Christ; and now you belong to him who was raised from death in order that we might be useful in the service of God. "},{"num":5,"verse":"For when we lived according to our human nature, the sinful desires stirred up by the Law were at work in our bodies, and all we did ended in death. "},{"num":6,"verse":"Now, however, we are free from the Law, because we died to that which once held us prisoners. No longer do we serve in the old way of a written law, but in the new way of the Spirit."},{"header":"Law and Sin"},{"num":7,"verse":"Shall we say, then, that the Law itself is sinful? Of course not! But it was the Law that made me know what sin is. If the Law had not said, “Do not desire what belongs to someone else,” I would not have known such a desire. "},{"num":8,"verse":"But by means of that commandment sin found its chance to stir up all kinds of selfish desires in me. Apart from law, sin is a dead thing. "},{"num":9,"verse":"I myself was once alive apart from law; but when the commandment came, sin sprang to life, "},{"num":10,"verse":"and I died. And the commandment which was meant to bring life, in my case brought death. "},{"num":11,"verse":"Sin found its chance, and by means of the commandment it deceived me and killed me."},{"num":12,"verse":"So then, the Law itself is holy, and the commandment is holy, right, and good. "},{"num":13,"verse":"But does this mean that what is good caused my death? By no means! It was sin that did it; by using what is good, sin brought death to me, in order that its true nature as sin might be revealed. And so, by means of the commandment sin is shown to be even more terribly sinful."},{"header":"The Conflict in Us"},{"num":14,"verse":"We know that the Law is spiritual; but I am a mortal, sold as a slave to sin. "},{"num":15,"verse":"I do not understand what I do; for I don't do what I would like to do, but instead I do what I hate. "},{"num":16,"verse":"Since what I do is what I don't want to do, this shows that I agree that the Law is right. "},{"num":17,"verse":"So I am not really the one who does this thing; rather it is the sin that lives in me. "},{"num":18,"verse":"I know that good does not live in me—that is, in my human nature. For even though the desire to do good is in me, I am not able to do it. "},{"num":19,"verse":"I don't do the good I want to do; instead, I do the evil that I do not want to do. "},{"num":20,"verse":"If I do what I don't want to do, this means that I am no longer the one who does it; instead, it is the sin that lives in me."},{"num":21,"verse":"So I find that this law is at work: when I want to do what is good, what is evil is the only choice I have. "},{"num":22,"verse":"My inner being delights in the law of God. "},{"num":23,"verse":"But I see a different law at work in my body—a law that fights against the law which my mind approves of. It makes me a prisoner to the law of sin which is at work in my body. "},{"num":24,"verse":"What an unhappy man I am! Who will rescue me from this body that is taking me to death? "},{"num":25,"verse":"Thanks be to God, who does this through our Lord Jesus Christ!"}]