[{"num":7,"verse":"Do you not know, brothers, (for I speak to those who know the Law) that the Law has dominion over a man for as long as he lives?"},{"num":2,"verse":"For the woman who is in subjection to a man, is bound by the Law to the man, while he lives. But if the man is dead, she is released from the Law of the man."},{"num":3,"verse":"So then, if while the man lives, she takes another man, she shall be called an adulteress. But, if the man is dead, she is free from the Law; so that she is not an adulteress, even though she takes another man."},{"num":4,"verse":"So you, my brothers, are also dead to the Law, by the body of Christ; so that you should belong to Another (that is, to Him Who was raised up from the dead) so that we should bring forth fruit unto God."},{"num":5,"verse":"For when we were in the flesh, the sufferings of sins (which were by the Law) were at work in our limbs, bringing forth fruit unto death."},{"num":6,"verse":"But now, we are delivered from the Law (that being dead in which we were held), so that we should serve in newness of Spirit, and not in the oldness of letter."},{"num":7,"verse":"What shall we then say? Is the Law sin? Absolutely not! No, I did not know sin, except through the Law. For I had not known lust until the Law had said, “You shall not lust”."},{"num":8,"verse":"But sin, taking opportunity through the commandment, wrought in me all manner of lusts. For without the Law, sin is dead."},{"num":9,"verse":"For I was once alive apart from the Law. But when the commandment came, sin revived, and I died."},{"num":10,"verse":"And this commandment, which was life to me, was found to be death."},{"num":11,"verse":"For sin, taking opportunity through the commandment, deceived me; and thereby killed me."},{"num":12,"verse":"Therefore, the Law is holy. And the commandment is holy, and just, and good."},{"num":13,"verse":"Was, then, that which is good made death to me? Absolutely not! But sin, so that it might appear sin, wrought death in me by that which is good, so that sin (through the commandment) might be excessively sinful."},{"num":14,"verse":"For we know that the Law is spiritual. But I am carnal, sold under sin."},{"num":15,"verse":"For I do not understand that which I do. For what I will to do, that do I not do. But what I hate, that I do."},{"num":16,"verse":"If, then, I do that which I do not want to do, I consent to the Law, that it is good."},{"num":17,"verse":"So, then, it is no more me who does it, but sin which dwells in me."},{"num":18,"verse":"For I know, that in me (that is, in my flesh) no good thing dwells. For to will is present with me. But I find no means to perform that which is good."},{"num":19,"verse":"For I do not do the good thing, which I want to do. But the evil, which I do not want to do, that I do."},{"num":20,"verse":"Now, if I do that which I do not want, it is no more I who do it, but the sin which dwells in me."},{"num":21,"verse":"I find, therefore, a law that when I would like to do good, evil is present with me."},{"num":22,"verse":"For I delight in the Law of God, concerning the inner man."},{"num":23,"verse":"But I see another law in my limbs, rebelling against the law of my mind, and leading me captive to the law of sin, which is in my limbs."},{"num":24,"verse":"O wretched man that I am! Who shall deliver me from the body of this death?"},{"num":25,"verse":"I thank God, through Jesus Christ our Lord! So then, I, myself, serve the Law of God in my mind, but the law of sin in my flesh."}]