[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the navel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the sinews, or muscles.Benson CommentaryJob 40:16. His strength is in his loins — He hath strength answerable to his bulk, but he is of a mild disposition, and his strength, by God’s wise and merciful providence, is not an offensive strength, consisting in, or put forth by, horns or claws, as it is in ravenous creatures, but only defensive, and seated in his loins. And his force is in the navel of his belly — From hence Bochart argues that behemoth cannot be the elephant, as is generally supposed: because the strength of an elephant consists not in his belly; for though his hide on the back is very hard, yet on the belly it is soft. And therefore the rhinoceros, contending with him, aims chiefly at his paunch, knowing, as it were, that to be a soft place, and more capable of being injured. On the other hand, the description, he urges, agrees well with the hippopotamus, which is remarkable, both for the strength of his belly and navel, as well as other parts of his body; the skin being so firm and thick as to be almost impenetrable, and able to resist the force of spears and darts.Matthew Henry's Concise Commentary40:15-24 God, for the further proving of his own power, describes two vast animals, far exceeding man in bulk and strength. Behemoth signifies beasts. Most understand it of an animal well known in Egypt, called the river-horse, or hippopotamus. This vast animal is noticed as an argument to humble ourselves before the great God; for he created this vast animal, which is so fearfully and wonderfully made. Whatever strength this or any other creature has, it is derived from God. He that made the soul of man, knows all the ways to it, and can make the sword of justice, his wrath, to approach and touch it. Every godly man has spiritual weapons, the whole armour of God, to resist, yea, to overcome the tempter, that his never-dying soul may be safe, whatever becomes of his frail flesh and mortal body.Barnes' Notes on the BibleLo now, his strength is in his loins - The inspection of the figure of the hippopotamus will show the accuracy of this. The strength of the elephant is in the neck; of the lion in the paw; of the horse and ox in the shoulders; but the principal power of the river-horse is in the loins; compare Nahum 2:1. This passage is one that proves that the elephant cannot be referred to.And his force is in the navel of his belly - The word which is here rendered \"navel\" (שׁריר  shârı̂yr) means properly \"firm, hard, tough,\" and in the plural form, which occurs here, means the \"firm,\" or \"tough\" parts of the belly. It is not used to denote the \"navel\" in any place in the Bible, and should not have been so rendered here. The reference is to the muscles and tendons of this part of the body, and perhaps particularly to the fact that the hippopotamus, by crawling so much on his belly among the stones of the stream or on land, acquires a special hardness or strength in those parts of the body. This clearly proves that the elephant is not intended. In that animal, this is the most tender part of the body. Pliny and Solinus both remark that the elephant has a thick, hard skin on the back, but that the skin of the belly is soft and tender. Pliny says (\"Hist. Nat.\" Lib. viii. c. 20), that the rhinoceros, when about to attack an elephant, \"seeks his belly, as if he knew that that was the most tender part.\" So Aelian, \"Hist.\" Lib. xvii. c. 44; see Bochart, as above. Jamieson-Fausset-Brown Bible Commentary16. navel—rather, \"muscles\" of his belly; the weakest point of the elephant, therefore it is not meant.Matthew Poole's Commentary He hath strength answerable to his bulk, but this strength by God’s wise and merciful providence is not an offensive strength, consisting in or put forth by horns or claws, as it is in ravenous creatures; but only defensive, and seated in his loins, as it is in other creatures, whereby he is rendered more serviceable to men by the carrying of vast burdens. His force is in the navel of his belly;  which though in the elephant it be weaker than his loins, whence the rhinoceros fighting with him aims at that part; yet hath a more than ordinary strength in it, as appears by the binding of the heaviest burdens under and about it. This also agrees to the hippopotamus in an eminent degree, whose whole skin is noted by ancient writers to be harder than any other creature’s, and almost impenetrable. Gill's Exposition of the Entire BibleLo now, his strength is in his loins,.... The strength of the elephant is well known, being able to carry a castle on its back, with a number of men therein; but what follows does not seem so well to agree with it; and his force is in the navel of his belly; since the belly of the elephant is very tender; by means of which the rhinoceros, its enemy, in its fight with it, has the advantage of it, by getting under its belly, and ripping it up with its horn (s). In like manner Eleazar the Jew killed one of the elephants of Antiochus, by getting between its legs, and thrusting his sword into its navel (t); which fell and killed him with the weight of it. On the other hand, the \"river horse\" is covered with a skin all over, the hardest and strongest of all creatures (u), as not to be pierced with spears or arrows (w); and of it dried were made helmets, shields, spears, and polished darts (x). That which Monsieur Thevenot (y) saw had several shot fired at it before it fell, for the bullets hardly pierced through its skin. We made several shot at him, says another traveller (z), but to no purpose; for they would glance from him as from a wall. And indeed the elephant is said to have such a hard scaly skin as to resist the spear (a): and Pliny (b), though he speaks of the hide of the river horse being so thick that spears are made of it; yet of the hide of the elephant, as having targets made of that, which are impenetrable. (s) Aelian. de Amimal. l. 17. c. 44. Plin. l. 8. c. 10, 20. Vid. Solin. c. 38. Diodor. Sic. l. 3. p. 167. & Strabo. Geograph. l. 16. p. 533. (t) Joseph. Ben Gorion. Hist. Heb. l. 3. c. 20. 1 Maccab. vi. 46. (u) Diodor. Sic. ut supra. (l. 3. p. 167) Plin. l. 8. c. 25. (w) Ptolem. Geograph. l. 7. c. 2. Fragment. Ctesiae ad Calcem Herodot. p. 701. Ed. Gronov. Boius apud Kircher. China cum Momument. p. 193. (x) Herodot. ut supra. (p. 701) Aristot. Hist. Animal. l. 2. c. 7. Plin. l. 11. c. 39. (y) Travels, part 1. c. 72. (z) Dampier's Voyages, vol. 2. part 2. p. 105. (a) Heliodor. Ethiop. Hist. l. 9. c. 18. (b) Nat. Hist. l. 11. c. 39. Vid. Vossium in Melam. de Situ Orbis, l. 1. c. 5. p. 28. Geneva Study BibleLo now, his strength is in his loins, and his force is in the navel of his belly.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in the sinews, or muscles.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 40:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "His strength is in his loins — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "He hath strength answerable to his bulk, but he is of a mild disposition, and his strength, by God’s wise and merciful providence, is not an offensive strength, consisting in, or put forth by, horns or claws, as it is in ravenous creatures, but only defensive, and seated in his loins. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And his force is in the navel of his belly — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "From hence Bochart argues that behemoth cannot be the elephant, as is generally supposed: because the strength of an elephant consists not in his belly; for though his hide on the back is very hard, yet on the belly it is soft. And therefore the rhinoceros, contending with him, aims chiefly at his paunch, knowing, as it were, that to be a soft place, and more capable of being injured. On the other hand, the description, he urges, agrees well with the hippopotamus, which is remarkable, both for the strength of his ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "belly ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "navel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as well as other parts of his body; the skin being so firm and thick as to be almost impenetrable, and able to resist the force of spears and darts.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "40:15-24 God, for the further proving of his own power, describes two vast animals, far exceeding man in bulk and strength. Behemoth signifies beasts. Most understand it of an animal well known in Egypt, called the river-horse, or hippopotamus. This vast animal is noticed as an argument to humble ourselves before the great God; for he created this vast animal, which is so fearfully and wonderfully made. Whatever strength this or any other creature has, it is derived from God. He that made the soul of man, knows all the ways to it, and can make the sword of justice, his wrath, to approach and touch it. Every godly man has spiritual weapons, the whole armour of God, to resist, yea, to overcome the tempter, that his never-dying soul may be safe, whatever becomes of his frail flesh and mortal body.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Lo now, his strength is in his loins - The inspection of the figure of the hippopotamus will show the accuracy of this. The strength of the elephant is in the neck; of the lion in the paw; of the horse and ox in the shoulders; but the principal power of the river-horse is in the loins; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This passage is one that proves that the elephant cannot be referred to.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "And his force is in the navel of his belly - The word which is here rendered \"navel\" (שׁריר  shârı̂yr) means properly \"firm, hard, tough,\" and in the plural form, which occurs here, means the \"firm,\" or \"tough\" parts of the belly. It is not used to denote the \"navel\" in any place in the Bible, and should not have been so rendered here. The reference is to the muscles and tendons of this part of the body, and perhaps particularly to the fact that the hippopotamus, by crawling so much on his belly among the stones of the stream or on land, acquires a special hardness or strength in those parts of the body. This clearly proves that the elephant is not intended. In that animal, this is the most tender part of the body. Pliny and Solinus both remark that the elephant has a thick, hard skin on the back, but that the skin of the belly is soft and tender. Pliny says (\"Hist. Nat.\" Lib. viii. c. 20), that the rhinoceros, when about to attack an elephant, \"seeks his belly, as if he knew that that was the most tender part.\" So Aelian, \"Hist.\" Lib. xvii. c. 44; see Bochart, as above. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "16. navel—rather, \"muscles\" of his belly; the weakest point of the elephant, therefore it is not meant.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " He hath strength answerable to his bulk, but this strength by God’s wise and merciful providence is not an offensive strength, consisting in or put forth by horns or claws, as it is in ravenous creatures; but only defensive, and seated in his loins, as it is in other creatures, whereby he is rendered more serviceable to men by the carrying of vast burdens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "His force is in the navel of his belly; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which though in the elephant it be weaker than his loins, whence the rhinoceros fighting with him aims at that part; yet hath a more than ordinary strength in it, as appears by the binding of the heaviest burdens under and about it. This also agrees to the hippopotamus in an eminent degree, whose whole skin is noted by ancient writers to be harder than any other creature’s, and almost impenetrable. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Lo now, his strength is in his loins,.... The strength of the elephant is well known, being able to carry a castle on its back, with a number of men therein; but what follows does not seem so well to agree with it; ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and his force is in the navel of his belly; since the belly of the elephant is very tender; by means of which the rhinoceros, its enemy, in its fight with it, has the advantage of it, by getting under its belly, and ripping it up with its horn (s). In like manner Eleazar the Jew killed one of the elephants of Antiochus, by getting between its legs, and thrusting his sword into its navel (t); which fell and killed him with the weight of it. On the other hand, the \"river horse\" is covered with a skin all over, the hardest and strongest of all creatures (u), as not to be pierced with spears or arrows (w); and of it dried were made helmets, shields, spears, and polished darts (x). That which Monsieur Thevenot (y) saw had several shot fired at it before it fell, for the bullets hardly pierced through its skin. We made several shot at him, says another traveller (z), but to no purpose; for they would glance from him as from a wall. And indeed the elephant is said to have such a hard scaly skin as to resist the spear (a): and Pliny (b), though he speaks of the hide of the river horse being so thick that spears are made of it; yet of the hide of the elephant, as having targets made of that, which are impenetrable. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(s) Aelian. de Amimal. l. 17. c. 44. Plin. l. 8. c. 10, 20. Vid. Solin. c. 38. Diodor. Sic. l. 3. p. 167. & Strabo. Geograph. l. 16. p. 533. (t) Joseph. Ben Gorion. Hist. Heb. l. 3. c. 20. 1 Maccab. vi. 46. (u) Diodor. Sic. ut supra. (l. 3. p. 167) Plin. l. 8. c. 25. (w) Ptolem. Geograph. l. 7. c. 2. Fragment. Ctesiae ad Calcem Herodot. p. 701. Ed. Gronov. Boius apud Kircher. China cum Momument. p. 193. (x) Herodot. ut supra. (p. 701) Aristot. Hist. Animal. l. 2. c. 7. Plin. l. 11. c. 39. (y) Travels, part 1. c. 72. (z) Dampier's Voyages, vol. 2. part 2. p. 105. (a) Heliodor. Ethiop. Hist. l. 9. c. 18. (b) Nat. Hist. l. 11. c. 39. Vid. Vossium in Melam. de Situ Orbis, l. 1. c. 5. p. 28. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Lo now, his strength is in his loins, and his force is in the navel of his belly.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16–18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These verses read,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "16.  Lo now, his strength is in his loins,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And his force in the sinews of his belly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "17.  He bendeth his tail like a cedar;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The muscles of his thighs are knit together.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "18.  His bones are pipes of brass;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "His limbs are like bars of iron.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Lo now, his strength is in his loins",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The strength of the hippopotamus is its principal characteristic. Weighing often two thousand kilogrammes, and of a short thick make, when roused to anger it has a force which is irresistible. In the water it upsets large beats; on land it forces its way through dense thickets and fences of all kinds. The loins are especially strong, being deep, broad, and immensely muscular",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": ". And his force is in the navel of his belly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in the muscles of his bell'i.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word used (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "שׁרידים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") occurs only in this place. It is a plural form, and therefore cannot designate a single object, like the navel. The root seems to be the Syriac ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "serir",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"firm,\" whence Schultens proposes to translate ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "שׁרירים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "firmitates.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Job 40:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15  Behold now the behmth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which I have made with thee:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He eateth grass like an ox.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  Behold now, his strength is in his loins,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his force in the sinews of his belly.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  He bendeth his tail like a cedar branch,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sinews of his legs are firmly interwoven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18  His bones are like tubes of brass,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His bones like bars of iron.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "בּהמות (after the manner of the intensive plur. הוללות, חכמות, which play the part of the abstract termination), which sounds like a plur., but without the numerical plural signification, considered as Hebrew, denotes the beast κατ ̓ ἐξοχήν, or the giant of beasts, is however Hebraized from the Egyptian p-ehe-mau, (muau), i.e., the (p) ox (ehe) of the water (mau as in the Hebraized proper name משׁה). It is, as Bochart has first of all shown, the so-called river or Nile horse, Hippopotamus amphibius (in Isaiah 30:6, בּהמות נגב, as emblem of Egypt, which extends its power, and still is active in the interest of others), found in the rivers of Africa, but no longer found in the Nile, which is not inappropriately called a horse; the Arab. water-hog is better, Italian bomarino, Eng. sea-cow ?, like the Egyptian p-ehe-mau. The change of p and b in the exchange of Egyptian and Semitic words occurs also elsewhere, e.g., pug' and בּוּץ, harpu and חרב (ἅρπη), Apriu and עברים (according to Lauth). Nevertheless p-ehe-mau (not mau-t, for what should the post-positive fem. art. do here?) is first of all only the בהמות translated back again into the Egyptian by Jablonsky; an instance in favour of this is still wanting. In Hieroglyph the Nile-horse is called apet; it was honoured as divine. Brugsch dwelt in Thebes in the temple of the Apet.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "בּהמות (after the manner of the intensive plur. הוללות, חכמות, which play the part of the abstract termination), which sounds like a plur., but without the numerical plural signification, considered as Hebrew, denotes the beast κατ ̓ ἐξοχήν, or the giant of beasts, is however Hebraized from the Egyptian p-ehe-mau, (muau), i.e., the (p) ox (ehe) of the water (mau as in the Hebraized proper name משׁה). It is, as Bochart has first of all shown, the so-called river or Nile horse, Hippopotamus amphibius (in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", בּהמות נגב, as emblem of Egypt, which extends its power, and still is active in the interest of others), found in the rivers of Africa, but no longer found in the Nile, which is not inappropriately called a horse; the Arab. water-hog is better, Italian bomarino, Eng. sea-cow ?, like the Egyptian p-ehe-mau. The change of p and b in the exchange of Egyptian and Semitic words occurs also elsewhere, e.g., pug' and בּוּץ, harpu and חרב (ἅρπη), Apriu and עברים (according to Lauth). Nevertheless p-ehe-mau (not mau-t, for what should the post-positive fem. art. do here?) is first of all only the בהמות translated back again into the Egyptian by Jablonsky; an instance in favour of this is still wanting. In Hieroglyph the Nile-horse is called apet; it was honoured as divine. Brugsch dwelt in Thebes in the temple of the Apet.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In the astronomical representations the hippopotamus is in the neighbourhood of the North Pole in the place of the dragon of the present day, and bears the name of hes-mut, in which mut  equals  t. mau, \"the mother.\" Hes however is obscure; Birch explains it by: raging.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Job 40:15 עמּך signifies nothing but \"with thee,\" so that thou hast it before thee. This water-ox eats חציר, green grass, like an ox. That it prefers to plunder the produce of the fields - in Arab. chadı̂r signifies, in particular, green barley - is accordingly self-evident. Nevertheless, it has gigantic strength, viz., in its plump loins and in the sinews (שׁרירי, properly the firm constituent parts,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " עמּך signifies nothing but \"with thee,\" so that thou hast it before thee. This water-ox eats חציר, green grass, like an ox. That it prefers to plunder the produce of the fields - in Arab. chadı̂r signifies, in particular, green barley - is accordingly self-evident. Nevertheless, it has gigantic strength, viz., in its plump loins and in the sinews (שׁרירי, properly the firm constituent parts,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Staring from its primary signification (made firm, fast), Arab. srı̂r, שׁרירא can signify e.g., also things put together from wood: a throne, a hand-barrow, bedstead and cradle, metaphor. the foundation. Wetzst. otherwise: \"The שׂרירי הבטן are not the sinews and muscles, still less 'the private parts' of others, but the four bearers of the animal body  equals  arkân el-batn, viz., the bones of the מתנים, Job 40:16, together with the two shoulder-blades. The Arab. sarı̂r is that on which a thing is supported or rests, on which it stands firmly, or moves about. Neshwn (i. 280) says: ‛sarı̂r is the substratum on which a thing rests,' and the sarı̂r er-ra's, says the same, is the place where the head rests upon the nape of the neck. The Kms gives the same signification primo loco, which shows that it is general; then follows in gen. Arab. muḍṭaja‛, \"the support of a thing.\")",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Staring from its primary signification (made firm, fast), Arab. srı̂r, שׁרירא can signify e.g., also things put together from wood: a throne, a hand-barrow, bedstead and cradle, metaphor. the foundation. Wetzst. otherwise: \"The שׂרירי הבטן are not the sinews and muscles, still less 'the private parts' of others, but the four bearers of the animal body  equals  arkân el-batn, viz., the bones of the מתנים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", together with the two shoulder-blades. The Arab. sarı̂r is that on which a thing is supported or rests, on which it stands firmly, or moves about. Neshwn (i. 280) says: ‛sarı̂r is the substratum on which a thing rests,' and the sarı̂r er-ra's, says the same, is the place where the head rests upon the nape of the neck. The Kms gives the same signification primo loco, which shows that it is general; then follows in gen. Arab. muḍṭaja‛, \"the support of a thing.\")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore: ligaments and muscles) of its clumsy belly. The brush of a tail, short in comparison with the monster itself, is compared to a cedar (a branch of it), ratione glabritiei, rotunditatis, spissitudinis et firmitatis (Bochart); since the beast is in general almost without hair, it looks like a stiff, naked bone, and yet it can bend it like an elastic cedar branch; חפץ is Hebraeo-Arab., ḥfḍ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]