[{"header":"David Goes to Different Places"},{"num":22,"verse":"David left Gath and ran away to the cave of Adullam. David’s brothers and relatives heard that David was at Adullam and went to see him there."},{"num":2,"verse":"Many people joined David. There were men who were in some kind of trouble, men who owed a lot of money, and men who were just not satisfied with life. All kinds of people joined David, and he became their leader. He had about 400 men with him."},{"num":3,"verse":"David left Adullam and went to Mizpah in Moab. David said to the king of Moab, “Please let my father and mother come and stay with you until I learn what God is going to do to me.”"},{"num":4,"verse":"So David left his parents with the king of Moab. They stayed with the king of Moab as long as David was at the fort."},{"num":5,"verse":"But the prophet Gad said to David, “Don’t stay in the fort. Go to the land of Judah.” So David left and went to Hereth Forest."},{"header":"Saul Destroys Ahimelech’s Family"},{"num":6,"verse":"Saul heard the report about David and his men while sitting under the tree on the hill at Gibeah. Saul had his spear in his hand. All of his officers were standing around him."},{"num":7,"verse":"Saul said to his officers who were standing around him, “Listen, men of Benjamin. Do you think that son of Jesse will give you fields and vineyards? He is not one of us, so don’t think he will give you anything or make you officers over 1000 or even 100 men!"},{"num":8,"verse":"No, but all of you are plotting against me. None of you told me about my son Jonathan and the agreement he made with the son of Jesse. None of you cares enough about me to tell me that my own son Jonathan encouraged David to turn against me and attack me. And that is what David is doing now.”"},{"num":9,"verse":"Doeg the Edomite was standing there with Saul’s officers. Doeg said, “I saw Jesse’s son at Nob. David came to see Ahimelech son of Ahitub."},{"num":10,"verse":"Ahimelech prayed to the Lord for David and gave him some food. He even gave David the sword of Goliath the Philistine.”"},{"num":11,"verse":"Then King Saul ordered some men to bring the priest to him. Saul told them to bring Ahimelech son of Ahitub and all his relatives who were priests at Nob. So all of them came to the king."},{"num":12,"verse":"Saul said to Ahimelech, “Listen now, son of Ahitub.”"},{"num":13,"verse":"Saul said to him, “Why did you and Jesse’s son make secret plans against me? You gave David bread and a sword. You prayed to God for him. And right now, David is waiting to attack me.”"},{"num":14,"verse":"Ahimelech answered, “David is very faithful to you. Not one of your other officers is as faithful as David. He is your own son-in-law and the captain of your bodyguards. Your own family respects David."},{"num":15,"verse":"That was not the first time I prayed to God for David. Not at all! Don’t blame me or any of my relatives. We are your servants. I know nothing about what is happening.”"},{"num":16,"verse":"But the king said, “Ahimelech, you and all your relatives must die.”"},{"num":17,"verse":"Then the king told the guards at his side, “Go and kill the priests of the Lord because they are on David’s side too. They knew he was running away, but they didn’t tell me.”"},{"num":18,"verse":"So the king gave the order to Doeg. Saul said, “Doeg, you go kill the priests.” So Doeg the Edomite went and killed the priests. That day he killed 85 men who were priests."},{"num":19,"verse":"Nob was the city of the priests. Doeg killed all the people of Nob. He used his sword and killed men, women, children and small babies. He even killed their cattle, donkeys, and sheep."},{"num":20,"verse":"But Abiathar son of Ahimelech escaped. He ran away and joined David."},{"num":21,"verse":"Abiathar told David that Saul had killed the Lord’s priests."},{"num":22,"verse":"Then David told Abiathar, “I saw Doeg the Edomite at Nob that day. I knew he would tell Saul! I am responsible for the death of your father’s family."},{"num":23,"verse":"Stay with me. Don’t be afraid, because the man who tried to kill you is the same man who wants to kill me. I will protect you if you stay with me.”"}]