[{"num":7,"verse":"The word that came to Jeremiah from Jehovah, saying,"},{"num":2,"verse":"Stand in the gate of Jehovah's house, and proclaim there this word, and say, Hear ye the word of Jehovah, all Judah, that enter in at these gates to worship Jehovah."},{"num":3,"verse":"Thus saith Jehovah of hosts, the God of Israel: Amend your ways and your doings, and I will cause you to dwell in this place."},{"num":4,"verse":"Confide ye not in words of falsehood, saying, Jehovah's temple, Jehovah's temple, Jehovah's temple is this."},{"num":5,"verse":"But if ye thoroughly amend your ways and your doings, if ye really do justice between a man and his neighbour,"},{"num":6,"verse":"[if] ye oppress not the stranger, the fatherless, and the widow, and shed no innocent blood in this place, neither walk after other gods to your hurt;"},{"num":7,"verse":"then will I cause you to dwell in this place, in the land that I gave to your fathers from of old even for ever."},{"num":8,"verse":"Behold, ye confide in words of falsehood that cannot profit."},{"num":9,"verse":"What? steal, murder, and commit adultery, and swear falsely, and burn incense unto Baal, and walk after other gods whom ye know not …"},{"num":10,"verse":"then ye come and stand before me, in this house which is called by my name, and say, We are delivered,—in order to do all these abominations!"},{"num":11,"verse":"Is this house, which is called by my name, a den of robbers in your eyes? Even I, behold, I have seen it, saith Jehovah."},{"num":12,"verse":"For go now unto my place which was in Shiloh, where I caused my name to dwell at the first, and see what I did to it, for the wickedness of my people Israel."},{"num":13,"verse":"And now, because ye have done all these works, saith Jehovah, and I spoke unto you, rising up early and speaking, and ye heard not, and I called you, and ye answered not;"},{"num":14,"verse":"I will even do unto the house which is called by my name, wherein ye trust, and unto the place which I gave to you and to your fathers, as I have done to Shiloh;"},{"num":15,"verse":"and I will cast you out of my sight, as I have cast out all your brethren, all the seed of Ephraim."},{"num":16,"verse":"And thou, pray not for this people, neither lift up cry nor prayer for them, and make not intercession to me; for I will not hear thee."},{"num":17,"verse":"Seest thou not what they do in the cities of Judah, and in the streets of Jerusalem?"},{"num":18,"verse":"The children gather wood, and the fathers kindle the fire, and the women knead dough, to make cakes to the queen of heaven, and to pour out drink-offerings unto other gods, that they may provoke me to anger."},{"num":19,"verse":"Is it I whom they provoke to anger? saith Jehovah; is it not themselves, to the shame of their own face?"},{"num":20,"verse":"Therefore thus saith the Lord Jehovah: Behold, mine anger and my fury shall be poured out upon this place; upon man, and upon beast, and upon the trees of the field, and upon the fruit of the ground; and it shall burn, and shall not be quenched."},{"num":21,"verse":"Thus saith Jehovah of hosts, the God of Israel: Add your burnt-offerings to your sacrifices, and eat the flesh."},{"num":22,"verse":"For I spoke not unto your fathers, nor commanded them concerning burnt-offerings and sacrifices, in the day that I brought them out of the land of Egypt;"},{"num":23,"verse":"but I commanded them this thing, saying, Hearken unto my voice, and I will be your God, and ye shall be my people; and walk in all the way that I command you, that it may be well with you."},{"num":24,"verse":"But they hearkened not, nor inclined their ear, but walked in the counsels, in the stubbornness of their evil heart, and went backward and not forward."},{"num":25,"verse":"Since the day that your fathers came forth out of the land of Egypt, unto this day, have I sent unto you all my servants the prophets, daily rising up early and sending them;"},{"num":26,"verse":"but they have not hearkened unto me, nor inclined their ear; and they have hardened their neck: they have done worse than their fathers."},{"num":27,"verse":"And thou shalt speak all these words unto them, but they will not hearken unto thee; and thou shalt call unto them, but they will not answer thee."},{"num":28,"verse":"And thou shalt say unto them, This is the nation which hath not hearkened unto the voice of Jehovah their God, nor received correction; fidelity is perished, and is cut off from their mouth."},{"num":29,"verse":"Cut off thy hair, and cast it away, and take up a lamentation on the heights; for Jehovah hath rejected and forsaken the generation of his wrath."},{"num":30,"verse":"For the children of Judah have done evil in my sight, saith Jehovah; they have set their abominations in the house which is called by my name, to defile it."},{"num":31,"verse":"And they have built the high places of Topheth, which is in the valley of the son of Hinnom, to burn their sons and their daughters in the fire; which I commanded not, neither did it come up into my mind."},{"num":32,"verse":"Therefore, behold, days are coming, saith Jehovah, when it shall no more be said, Topheth, and Valley of the son of Hinnom, but the valley of slaughter; for they shall bury in Topheth, till there be no place."},{"num":33,"verse":"And the carcases of this people shall be food for the fowl of the heavens, and for the beasts of the earth; and none shall scare [them] away."},{"num":34,"verse":"And I will cause to cease from the cities of Judah, and from the streets of Jerusalem, the voice of mirth and the voice of joy, the voice of the bridegroom and the voice of the bride; for the land shall become a waste."}]