[{"num":1,"verse":"I am the man that hath seen affliction in the rod of his indignation."},{"num":2,"verse":"He hath led me, and brought me into darkness, but not to light."},{"num":3,"verse":"Surely he is turned against me: he turneth his hand against me all the day."},{"num":4,"verse":"My flesh and my skin hath he caused to wax old, and he hath broken my bones."},{"num":5,"verse":"He hath built against me, and compassed me with gall and labor."},{"num":6,"verse":"He hath set me in dark places, as they that be dead forever."},{"num":7,"verse":"He hath hedged about me, that I cannot get out: he hath made my chains heavy."},{"num":8,"verse":"Also when I cry and shout, he shutteth out my prayer."},{"num":9,"verse":"He hath stopped up my ways with hewn stone, and turned away my paths."},{"num":10,"verse":"He was unto me as a bear lying in wait, and as a lion in secret places."},{"num":11,"verse":"He hath stopped my ways, and pulled me in pieces: he hath made me desolate."},{"num":12,"verse":"He hath bent his bow, and made me a mark for the arrow."},{"num":13,"verse":"He caused the arrows of his quiver to enter into my reins."},{"num":14,"verse":"I was a derision to all my people, and their song all the day."},{"num":15,"verse":"He hath filled me with bitterness, and made me drunken with wormwood."},{"num":16,"verse":"He hath also broken my teeth with stones, and hath covered me with ashes."},{"num":17,"verse":"Thus my soul was far off from peace: I forgot prosperity,"},{"num":18,"verse":"And I said, My strength and my hope is perished from the Lord,"},{"num":19,"verse":"Remembering mine affliction, and my mourning, the wormwood and the gall."},{"num":20,"verse":"My soul hath them in remembrance, and is humbled in me."},{"num":21,"verse":"I consider this in mine heart: therefore have I hope."},{"num":22,"verse":"It is the Lord’s mercies that we are not consumed, because his compassions fail not."},{"num":23,"verse":"They are renewed every morning: great is thy faithfulness."},{"num":24,"verse":"The Lord is my portion, saith my soul: therefore will I hope in him."},{"num":25,"verse":"The Lord is good unto them that trust in him, and to the soul that seeketh him."},{"num":26,"verse":"It is good both to trust, and to wait for the salvation of the Lord."},{"num":27,"verse":"It is good for a man that he bear the yoke in his youth."},{"num":28,"verse":"He sitteth alone, and keepeth silence, because he hath borne it upon him."},{"num":29,"verse":"He putteth his mouth in the dust, if there may be hope."},{"num":30,"verse":"He giveth his cheek to him that smiteth him: he is filled full with reproaches."},{"num":31,"verse":"For the Lord will not forsake forever."},{"num":32,"verse":"But though he send affliction, yet will he have compassion according to the multitude of his mercies."},{"num":33,"verse":"For he doth not punish willingly, nor afflict the children of men,"},{"num":34,"verse":"In stamping under his feet all the prisoners of the earth,"},{"num":35,"verse":"In overthrowing the right of a man before the face of the most High,"},{"num":36,"verse":"In subverting a man in his cause: the Lord seeth it not."},{"num":37,"verse":"Who is he then that saith, and it cometh to pass, and the Lord commandeth it not?"},{"num":38,"verse":"Out of the mouth of the most High proceedeth not evil and good?"},{"num":39,"verse":"Wherefore then is the living man sorrowful? man suffereth for his sin."},{"num":40,"verse":"Let us search and try our ways, and turn again to the Lord."},{"num":41,"verse":"Let us lift up our hearts with our hands unto God in the heavens."},{"num":42,"verse":"We have sinned, and have rebelled, therefore thou hast not spared."},{"num":43,"verse":"Thou hast covered us with wrath, and persecuted us: thou hast slain, and not spared."},{"num":44,"verse":"Thou hast covered thyself with a cloud, that our prayer should not pass through."},{"num":45,"verse":"Thou hast made us as the offscouring and refuse in the midst of the people."},{"num":46,"verse":"All our enemies have opened their mouth against us."},{"num":47,"verse":"Fear, and a snare is come upon us with desolation and destruction."},{"num":48,"verse":"Mine eye casteth out rivers of water, for the destruction of the daughter of my people."},{"num":49,"verse":"Mine eye droppeth without stay, and ceaseth not,"},{"num":50,"verse":"Till the Lord look down, and behold from heaven."},{"num":51,"verse":"Mine eye breaketh mine heart because of all the daughters of my city."},{"num":52,"verse":"Mine enemies chased me sore, like a bird, without cause."},{"num":53,"verse":"They have shut up my lifein the dungeon, and cast a stone upon me."},{"num":54,"verse":"Waters flowed over mine head, then thought I, I am destroyed."},{"num":55,"verse":"I called upon thy Name, O Lord, out of the low dungeon."},{"num":56,"verse":"Thou hast heard my voice: stop not thine ear from my sigh, and from my cry."},{"num":57,"verse":"Thou drewest near in the day that I called upon thee: thou saidest, Fear not."},{"num":58,"verse":"O Lord, thou hast maintained the cause of my soul, and hast redeemed my life."},{"num":59,"verse":"O Lord, thou hast seen my wrong, judge thou my cause."},{"num":60,"verse":"Thou hast seen all their vengeance, and all their devises against me:"},{"num":61,"verse":"Thou hast heard their reproach, O Lord, and all their imaginations against me."},{"num":62,"verse":"The lips also of those that rose against me, and their whispering against me continually."},{"num":63,"verse":"Behold, their sitting down, and their rising up, how I am their song."},{"num":64,"verse":"Give them a recompense, O Lord, according to the work of their hands."},{"num":65,"verse":"Give them sorrow of heart even thy curse to them."},{"num":66,"verse":"Persecute with wrath and destroy them from under the heaven, O Lord."}]