[{"num":26,"verse":"And when thou hast entered into the land which thy Lord God shall give to thee to wield, and thou hast gotten it, and hast dwelled therein,"},{"num":2,"verse":"thou shalt take the first fruits of all thy fruits, and thou shalt put them in a basket; and thou shalt go to the place which thy Lord God (shall) choose, that his name be inwardly called there."},{"num":3,"verse":"And thou shalt go to the priest, that shall be in those days, and thou shalt say to him, I acknowledge today before thy Lord God, that I have entered into the land, which he swore to our fathers, that he should give it to us (that he would give to us)."},{"num":4,"verse":"And the priest shall take the basket (out) of thine hand, and he shall set it (down) before the altar of thy Lord God."},{"num":5,"verse":"And thou shalt say in the sight of thy Lord God, (A) Syrian pursued (was) my father, that went down into Egypt, and was a pilgrim there in fewest number; and he increased into a great folk, and strong, and of multitude without number. (And thou shalt say before the Lord thy God, A wandering Syrian was my father, who went down into Egypt, and he, with a few others, were foreigners there; but they increased into a great and strong nation, and into a multitude without number.)"},{"num":6,"verse":"And [the] Egyptians tormented us, and pursued us, and they putted upon us most grievous burdens."},{"num":7,"verse":"And we cried to the Lord God of our fathers, which heard us (who heard us), and he beheld our meekness, and our travail, and our anguish;"},{"num":8,"verse":"and he led us out of Egypt in a mighty hand, and in an arm stretched out, in great dread, and in miracles, and in great wonders, (and he led us out of Egypt with a mighty hand, and an outstretched arm, with great and fearful miracles, and with great wonders,)"},{"num":9,"verse":"and he led us into this place; and he hath given to us a land flowing with milk and honey."},{"num":10,"verse":"And therefore I offer now to thee the first fruits of the fruits of the land which (thou,) the Lord, gave to me. And thou shalt leave them in the sight of thy Lord God. And when thy Lord God is worshipped, (And so now I offer the first fruits of the fruits of the land which thou, O Lord, hath given me. And thou shalt leave them before the Lord thy God. And when thou hast worshipped the Lord thy God,)"},{"num":11,"verse":"thou shalt eat in all the goods which thy Lord God gave to thee, and to thine house, thou, and the deacon, and the comeling that is with thee. (thou shalt make joy for all the good things which the Lord thy God hath given thee, and thy family, thou, and also the Levite, and the newcomer who is with thee.)"},{"num":12,"verse":"When thou hast fulfilled the tithe of all thy fruits, in the third year of thy tithes, thou shalt give (them) to the deacon, and to the comeling, and to the fatherless, either the motherless child, and to the widow, that they eat within thy gates, and be full-filled. (When thou hast taken the tithe of all thy fruits in the third year, which is the tithe-year, thou shalt give them to the Levite, and the newcomer, and the fatherless or the motherless child, and the widow, so that they can eat it within thy gates, and be filled full.)"},{"num":13,"verse":"And thou shalt speak in the sight of thy Lord God, and say, I have taken away that that is hallowed of mine house, and I gave it to the deacon, and to the comeling, and to the fatherless, either motherless child, and to the widow, as thou commandedest to me; I passed not (over) thy commandments, I forgot not thy behest. (And thou shalt say before the Lord thy God, I have brought forth from my house what was dedicated to thee, and I have given it to the Levite, and the newcomer, and the fatherless or the motherless child, and the widow, as thou hast commanded me; I have not passed over thy commandments, I have not forgotten thy charge, or thy orders.)"},{"num":14,"verse":"I ate not of those things in my mourning, neither I separated them in(to) any uncleanness, neither I spended of those anything in burying of a dead body (I did not eat any of it while mourning, I did not put any of it aside for unclean uses, and I did not spend any of it for burying a dead body). I obeyed to the voice of my Lord God, and I did all things as thou commandedest to me."},{"num":15,"verse":"Behold thou from thy saintuary, from the high dwelling place of heaven, and bless thou thy people Israel, and the land which thou hast given to us, as thou hast sworn to our fathers, the land flowing with milk and honey."},{"num":16,"verse":"Today Israel, thy Lord God commanded to thee, that thou do these behests and dooms, that thou keep and fulfill them of all thine heart, and of all thy soul. (Today Israel, the Lord thy God hath commanded thee, that thou obey these statutes and laws, or judgements, that thou keep and fulfill them with all thy heart, and with all thy soul.)"},{"num":17,"verse":"Thou hast chosen the Lord today, that he be God to thee, and that thou go in his ways, and that thou keep his ceremonies, and his behests, and his dooms, and obey to his commandment. (Thou hast chosen the Lord today, that he be thy God, and that thou go in his ways, and that thou keep his statutes, and his commandments, and his laws, or his judgements, and obey his bidding, or his orders.)"},{"num":18,"verse":"Lo! the Lord hath chosen thee today, that thou be a special people to him, as he hath spoken to thee, and that thou keep all his commandments; (Lo! the Lord hath chosen thee today, that thou be a special people to him, as he hath promised thee, and also that thou obey all his commandments;)"},{"num":19,"verse":"and he shall make thee higher than all folks, which he made into his praising, and name, and glory; that thou be an holy people to thy Lord God, as he hath spoken to thee. (and he shall grant thee more favour than all the nations which he hath made, to bring him praise, and fame, and glory/and thou shalt bring him praise, and fame, and glory; and thou shalt be a holy people to the Lord thy God, as he promised thee.)"}]