[{"num":5,"verse":"All the kings of the Amorites west of the Jordan and the Canaanite kings living by the ·Mediterranean Sea [Sea] heard that the Lord dried up the Jordan River until the ·Israelites [sons/children of Israel] had crossed it. ·After that they were scared [Their hearts melted] and ·too afraid to face [there was no breath/spirit in them because of] the ·Israelites [sons/children of Israel]."},{"header":"The Israelites Are Circumcised"},{"num":2,"verse":"At that time the Lord said to Joshua, “Make knives from flint stones and circumcise [Gen. 17:7–14] the ·Israelites [sons of Israel a second time].” "},{"num":3,"verse":"So Joshua made knives from flint stones and circumcised the ·Israelites [sons/children of Israel] at ·Gibeath Haaraloth [Hebrew for “Hill of Foreskins”]."},{"num":4,"verse":"This is why Joshua circumcised the men: After the Israelites left Egypt, all the men old enough to serve in the army died in the desert on the ·way [journey] ·out of [or after leaving] Egypt. "},{"num":5,"verse":"The men who had come out of Egypt had been circumcised, but none of those who were born in the desert on the trip from Egypt had been circumcised. "},{"num":6,"verse":"The ·Israelites [sons/children of Israel] had moved about in the ·desert [wilderness] for forty years. During that time all the fighting men who had left Egypt had died because they had not obeyed the Lord [Num. 13–14]. So the Lord swore they would not see the land he had promised their ancestors to give them, a ·fertile land [land flowing with milk and honey; a phrase describing the natural bounty of the land]. "},{"num":7,"verse":"Their sons ·took [were raised up in] their places. But none of the sons born on the trip from Egypt had been circumcised, so Joshua circumcised them. "},{"num":8,"verse":"After all the Israelites had been circumcised, they stayed in camp until they were healed."},{"num":9,"verse":"Then the Lord said to Joshua, “Today I have ·removed [rolled away] the shame [disgrace; reproach] of ·your slavery in Egypt [Egypt].” So that place was named Gilgal [sounds like Hebrew for “rolled away”; 4:19], which it is still named today."},{"num":10,"verse":"The ·people [sons/children] of Israel were camped at Gilgal [4:19] on the plains of Jericho. It was there, on the evening of the fourteenth day of the month, they celebrated the Passover Feast [Ex. 12]. "},{"num":11,"verse":"The day after the Passover, the people ate food grown on that land: ·bread made without yeast [unleavened bread] and roasted grain. "},{"num":12,"verse":"The day they ate this food, the manna stopped coming [Ex. 16:35]. The ·Israelites [sons/children of Israel] no longer got the manna from heaven. They ate the food grown in the land of Canaan that year."},{"num":13,"verse":"Joshua was near Jericho when he looked up and saw a man standing in front of him with a sword in his hand [Ex. 3:2—4:17; Judg. 6:11–23]. Joshua went to him and asked, “Are you ·a friend or an enemy [for us or for our enemies/adversaries]?”"},{"num":14,"verse":"The man answered, “·I am neither [No]. I have come as the commander of the Lord’s army [God himself who comes as a warrior; Ex. 15:3].”"},{"num":15,"verse":"The commander of the Lord’s army answered, “Take off your sandals, because the place where you are standing is holy [Ex. 3:5].” So Joshua did."}]