[{"header":"Chapter 9"},{"num":1,"verse":"The Worship of the First Covenant. Now [even] the first covenant had regulations for worship and an earthly sanctuary. "},{"num":2,"verse":"For a tabernacle was constructed, the outer one, in which were the lampstand, the table, and the bread of offering; this is called the Holy Place. "},{"num":3,"verse":"Behind the second veil was the tabernacle called the Holy of Holies, "},{"num":4,"verse":"in which were the gold altar of incense and the ark of the covenant entirely covered with gold. In it were the gold jar containing the manna, the staff of Aaron that had sprouted, and the tablets of the covenant. "},{"num":5,"verse":"Above it were the cherubim of glory overshadowing the place of expiation. Now is not the time to speak of these in detail."},{"num":6,"verse":"With these arrangements for worship, the priests, in performing their service, go into the outer tabernacle repeatedly, "},{"num":7,"verse":"but the high priest alone goes into the inner one once a year, not without blood that he offers for himself and for the sins of the people. "},{"num":8,"verse":"In this way the holy Spirit shows that the way into the sanctuary had not yet been revealed while the outer tabernacle still had its place. "},{"num":9,"verse":"This is a symbol of the present time, in which gifts and sacrifices are offered that cannot perfect the worshiper in conscience "},{"num":10,"verse":"but only in matters of food and drink and various ritual washings: regulations concerning the flesh, imposed until the time of the new order."},{"num":11,"verse":"Sacrifice of Jesus. But when Christ came as high priest of the good things that have come to be, passing through the greater and more perfect tabernacle not made by hands, that is, not belonging to this creation, "},{"num":12,"verse":"he entered once for all into the sanctuary, not with the blood of goats and calves but with his own blood, thus obtaining eternal redemption. "},{"num":13,"verse":"For if the blood of goats and bulls and the sprinkling of a heifer’s ashes can sanctify those who are defiled so that their flesh is cleansed, "},{"num":14,"verse":"how much more will the blood of Christ, who through the eternal spirit offered himself unblemished to God, cleanse our consciences from dead works to worship the living God."},{"num":15,"verse":"For this reason he is mediator of a new covenant: since a death has taken place for deliverance from transgressions under the first covenant, those who are called may receive the promised eternal inheritance. "},{"num":16,"verse":"Now where there is a will, the death of the testator must be established. "},{"num":17,"verse":"For a will takes effect only at death; it has no force while the testator is alive. "},{"num":18,"verse":"Thus not even the first covenant was inaugurated without blood. "},{"num":19,"verse":"When every commandment had been proclaimed by Moses to all the people according to the law, he took the blood of calves [and goats], together with water and crimson wool and hyssop, and sprinkled both the book itself and all the people, "},{"num":20,"verse":"saying, “This is ‘the blood of the covenant which God has enjoined upon you.’” "},{"num":21,"verse":"In the same way, he sprinkled also the tabernacle and all the vessels of worship with blood. "},{"num":22,"verse":"According to the law almost everything is purified by blood, and without the shedding of blood there is no forgiveness."},{"num":23,"verse":"Therefore, it was necessary for the copies of the heavenly things to be purified by these rites, but the heavenly things themselves by better sacrifices than these. "},{"num":24,"verse":"For Christ did not enter into a sanctuary made by hands, a copy of the true one, but heaven itself, that he might now appear before God on our behalf. "},{"num":25,"verse":"Not that he might offer himself repeatedly, as the high priest enters each year into the sanctuary with blood that is not his own; "},{"num":26,"verse":"if that were so, he would have had to suffer repeatedly from the foundation of the world. But now once for all he has appeared at the end of the ages to take away sin by his sacrifice. "},{"num":27,"verse":"Just as it is appointed that human beings die once, and after this the judgment, "},{"num":28,"verse":"so also Christ, offered once to take away the sins of many, will appear a second time, not to take away sin but to bring salvation to those who eagerly await him."}]