[{"header":"Chapter 9"},{"num":1,"verse":"The Ancient Worship. Now the first covenant also had regulations for worship and an earthly sanctuary."},{"num":2,"verse":"For a tabernacle was constructed. In the outer section, called the Holy Place, were located the lampstand, the table, and the consecrated bread."},{"num":3,"verse":"Behind the second veil was the tabernacle called the Holy of Holies"},{"num":4,"verse":"in which stood the gold altar of incense and the ark of the covenant overlaid on all sides with gold. In that ark were the gold jar containing the manna, and Aaron’s staff that had sprouted buds, and the tablets of the covenant."},{"num":5,"verse":"Above it were the cherubim of glory overshadowing the place of atonement (but we cannot discuss these things in detail now)."},{"num":6,"verse":"With these arrangements for worship having been made, the priests continually enter the first tabernacle to carry out their ritual duties."},{"num":7,"verse":"However, the high priest alone enters the second tabernacle, and he can do so only once a year, and not without the blood that he offers for himself and for the errors that the people had committed."},{"num":8,"verse":"By this the Holy Spirit reveals to us that as long as the first tabernacle remains standing, the way into the sanctuary has not been disclosed."},{"num":9,"verse":"This is a symbol of the present time, during which the gifts and sacrifices that are offered are unable to cleanse the conscience of the worshiper."},{"num":10,"verse":"They deal only with food and drink and various ceremonial washings, regulations in regard to the body that are imposed until the coming of the new order."},{"num":11,"verse":"Christ Has Come. But now Christ has arrived as the high priest of the good things that have come. He has passed through the greater and more perfect tabernacle not made by human hands, that is, not a part of this creation,"},{"num":12,"verse":"and he has entered once for all into the sanctuary not with the blood of goats and calves but with his own blood, thus obtaining eternal redemption."},{"num":13,"verse":"The blood of goats and bulls and the sprinkling of ashes of a heifer sanctify those who have been defiled and restore bodily purity."},{"num":14,"verse":"How much more, then, will the blood of Christ, who through the eternal Spirit offered himself without blemish to God, purify our conscience from acts that lead to death so that we may worship the living God."},{"num":15,"verse":"A Covenant Sealed with the Blood of Christ. For this reason, he is the mediator of a new covenant, so that those who have been called may receive the promised eternal inheritance, since his death has served to redeem the sins that were committed under the first covenant."},{"num":16,"verse":"Now when a will is involved, it is obligatory to prove the death of the one who made it."},{"num":17,"verse":"For a will takes effect only at death, since it has no force while the one who made it is still alive."},{"num":18,"verse":"Hence, not even the first covenant was inaugurated without blood."},{"num":19,"verse":"For when all the commandments of the Law had been proclaimed by Moses to all the people, he took the blood of calves and goats, together with water and scarlet wool and hyssop, and sprinkled both the book itself and all the people,"},{"num":20,"verse":"saying, “This is the blood of the covenant that God has commanded you to observe.”"},{"num":21,"verse":"And in the same way, he sprinkled with blood both the tabernacle and all the liturgical vessels."},{"num":22,"verse":"Indeed, under the Law almost everything is purified by blood, and without the shedding of blood there is no forgiveness."},{"num":23,"verse":"Therefore, it was necessary for the copies of the heavenly things to be purified with these rites, but the heavenly things themselves required still greater sacrifices."},{"num":24,"verse":"Once and for All. For Christ did not enter a sanctuary made by human hands, a mere copy of the true one, but he entered into heaven itself, so that he now appears in the presence of God on our behalf."},{"num":25,"verse":"Nor was it his purpose to offer himself again and again, as the high priest enters into the sanctuary year after year with the blood that is not his own."},{"num":26,"verse":"For then he would have had to suffer over and over again since the creation of the world. But as it is, he has appeared once and for all at the end of the ages to abolish sin by sacrificing himself."},{"num":27,"verse":"And just as human beings are destined to die but once, and after that to face judgment,"},{"num":28,"verse":"so Christ, having been offered once to take away the sins of many, will appear a second time, not to deal with sin but to bring salvation to those who are eagerly waiting for him."}]