[{"header":"The sanctuary under the old agreement"},{"num":1,"verse":"Now the first agreement had certain rules for the service of God, and it had a sanctuary, a holy place in this world for the eternal God. A tent was erected: in the outer compartment were placed the lamp-standard, the table and the sacred loaves. Inside, beyond the curtain, was the inner tent called the holy of holies in which were the golden censer and the gold inlaid ark of the agreement, containing the golden jar of manna, Aaron’s budding staff and the stone tablets inscribed with the words of the actual agreement. Above these things were fixed representations of the cherubim of glory, casting their shadow over the ark’s covering, known as the mercy seat. (All this is full of meaning but we cannot enter now into a detailed explanation.)"},{"num":6,"verse":"Under this arrangement the outer tent was habitually used by the priests in the regular discharge of their religious duties. But the inner tent was entered once a year only, by the High Priest, alone, bearing a sacrifice of shed blood to be offered for his own sins and those of the people."},{"header":"The old arrangements stood as symbols until Christ, the truth, came"},{"num":8,"verse":"By these things the Holy Spirit means us to understand that the way to the holy of holies was not yet open, that is, so long as the first tent and all that it stands for still exist. For in this outer tent we see a picture of the present time, in which both gifts and sacrifices are offered and yet are incapable of cleansing the soul of the worshipper. The ceremonies are concerned with food and drink, various washings and rules for bodily conduct, and were only intended to be valid until the time when Christ should establish the truth."},{"num":11,"verse":"For now Christ has come among us, the High Priest of the good things which were to come, and has passed through a greater and more perfect tent which no human hand has made (for it was no part of this world of ours). It was not with goats’ or calves’ blood but with his own blood that he entered once and for all into the holy of holies, having won for us men eternal reconciliation with God. And if the blood of bulls and goats and the ashes of a burnt heifer were, when sprinkled on the unholy, sufficient to make the body pure, then how much more will the blood of Christ himself, who in his eternal spirit offered himself to God as the perfect sacrifice, purify your souls from the deeds of death, that you may serve the living God!"},{"header":"The death of Christ gives him power to administer the new agreement"},{"num":15,"verse":"Christ is consequently the administrator of an entirely new agreement, having the power, by virtue of his death, to redeem transgressions committed under the first agreement: to enable those who obey God’s call to enjoy the promises of the eternal inheritance. For, as in the case of a will, the agreement is only valid after death. While the testator lives, a will has no legal power. And indeed we find that even the first agreement of God’s will was not put into force without the shedding of blood. For when Moses had told the people every command of the Law he took calves’ and goats’ blood with water and scarlet wool, and sprinkled both the book and all the people with a sprig of hyssop, saying: ‘This is the blood of the covenant which God has commanded you’."},{"num":21,"verse":"Moses also sprinkled with blood the tent itself and all the sacred vessels. And you will find that in the Law almost all cleansing is made by means of blood—as the common saying has it: “No shedding of blood, no remission of sin.”"},{"header":"Christ has achieved the real appearance before God for us"},{"num":23,"verse":"It was necessary for the earthly reproductions of heavenly realities to be purified by such methods, but the actual heavenly things could only be made pure in God’s sight by higher sacrifices than these. Christ did not therefore enter into any holy places made by human hands (however truly these may represent heavenly realities), but he entered Heaven itself to make his appearance before God as High Priest on our behalf. There is no intention that he should offer himself regularly, like the High Priest entering the holy of holies every year with the blood of another creature. For that would mean that he would have to suffer death every time he entered Heaven from the beginning of the world! No, the fact is that now, at this point in time, the end of the present age, he has appeared once and for all to abolish sin by the sacrifice of himself. And just as surely as it is appointed for all men to die and after that pass to their judgment, so it is certain that Christ was offered once to bear the sins of many and after that, to those who look for him, he will appear a second time, not this time to deal with sin, but to bring them to full salvation."}]