[[],[{"type":"header","content":"Hannah’s Song of Thanksgiving"},{"type":"prose","content":"Hannah prayed and said,"}],[{"type":"prose","content":"Elkanah [and his wife Hannah] returned to Ramah to his house. But the child [Samuel] served the  under the guidance of Eli the priest."},{"type":"header","content":"The Sin of Eli’s Sons"}],[{"type":"prose","content":"The sons of Eli [Hophni and Phinehas] were worthless (dishonorable, unprincipled) men; they did not know [nor respect] the  "}],[{"type":"prose","content":"and the custom of the priests with [the sacrifices of] the people. When any man was offering a sacrifice, the priest’s servant would come while the meat was boiling, with a three-pronged [meat] fork in his hand; "}],[{"type":"prose","content":"then he would thrust it into the pan, or kettle, or caldron, or pot; everything that the fork brought up the priest would take for himself. This is what they did in Shiloh to all [the sacrifices of] the Israelites who came there. "}],[{"type":"prose","content":"Also, before they burned (offered) the fat, the priest’s servant would come and say to the man who was sacrificing, “Give the priest meat to roast, since he will not accept boiled meat from you, only raw.” "}],[{"type":"prose","content":"If the man said to him, “Certainly they are to burn (offer) the fat first, and then you may take as much as you want,” then the priest’s servant would say, “No! You shall give  now or I will take it by force.” "}],[{"type":"prose","content":"So the sin of the [two] young men [Hophni and Phinehas] was very great before the , for the men treated the offering of the  disrespectfully."},{"type":"header","content":"Samuel before the Lord as a Boy"}],[{"type":"prose","content":"Now Samuel was ministering before the , as a child dressed in a linen ephod [a sacred item of priestly clothing]. "}],[{"type":"prose","content":"Moreover, his mother would make him a little robe and would bring it up to him each year when she came up with her husband to offer the yearly sacrifice. "}],[{"type":"prose","content":"Then Eli would bless Elkanah and his wife and say, “May the  give you children by this woman in place of the one she asked for which was dedicated to the .” Then they would return to their own home."}],[{"type":"prose","content":"And [the time came when] the  visited Hannah, so that she conceived and gave birth to three sons and two daughters. And the boy Samuel grew before the ."},{"type":"header","content":"Eli Rebukes His Sons"}],[{"type":"prose","content":"Now Eli was very old; and he heard about everything that his sons were doing to all [the people of] Israel, and how they were lying with the women who served at the entrance to the Tent of Meeting (tabernacle). "}],[{"type":"prose","content":"Eli said to them, “Why do you do such things, the evil things that I hear from all these people? "}],[{"type":"prose","content":"No, my sons; for the report that I keep hearing from the passers-by among the  people is not good. "}],[{"type":"prose","content":"If one man does wrong  sins against another, God will intercede (arbitrate) for him; but if a man does wrong to the , who can intercede for him?” But they would not listen to their father, for it was the  will to put them to death."}],[{"type":"prose","content":"But the boy Samuel continued to grow in stature and in favor both with the  and with men."}],[{"type":"prose","content":"Then a man of God (prophet) came to Eli and said to him, “Thus says the : ‘Did I  plainly reveal Myself to the house of your father (ancestor) when they were in Egypt  to Pharaoh’s house? "}],[{"type":"prose","content":"Moreover, I selected him out of all the tribes of Israel to be My priest, to go up to My altar, to burn incense, to wear an ephod before Me. And [from then on] I gave to the house of your father all the fire  of the sons of Israel. "}],[{"type":"prose","content":"Why then do you kick at (despise) My sacrifice and My offering which I commanded in My dwelling place, and honor your sons more than Me, by fattening yourselves with the choicest part of every offering of My people Israel?’ "}],[{"type":"prose","content":"Therefore the  God of Israel declares, ‘I did indeed say that your house and that of [Aaron] your father would walk [in priestly service] before Me forever.’ But now the  declares, ‘Far be it from Me—for those who honor Me I will honor, and those who despise Me will be insignificant  contemptible. "}],[{"type":"prose","content":"Behold, the time is coming when I will cut off your strength and the strength of your father’s house, so that there will not be an old man in your house. "}],[{"type":"prose","content":"You will look at the distress of  house (the tabernacle), in  all the good which God will do for Israel, and there will never again be an old man in your house. "}],[{"type":"prose","content":"Yet I will not cut off every man of yours from My altar; your eyes will fail  and your soul will grieve, and all those born in your house will die as men [in the prime of life]. "}],[{"type":"prose","content":"This will be the sign to you which shall come concerning your two sons, Hophni and Phinehas: on the same day both of them shall die. "}],[{"type":"prose","content":"But I will raise up for Myself a faithful priest who will do according to what is in My heart and in My soul; and I will build him a permanent  enduring house, and he will walk before My anointed forever. "}],[{"type":"prose","content":"And it will happen that everyone who is left in your house will come and bow down to him for a piece of silver and a loaf of bread and say, “Please assign me to one of the priest’s offices so I may eat a piece of bread.”’”"}]]