[{"header":"Hannah’s Song"},{"num":2,"verse":"Hannah prayed and said:"},{"num":11,"verse":"Then Elkanah went home to Ramah, but the young boy served the Lord as an attendant to Eli the priest."},{"header":"Eli’s Wicked Sons Contrasted With Samuel"},{"num":12,"verse":"Now the sons of Eli were wicked scoundrels. They did not know the Lord."},{"num":13,"verse":"The practice of the priests with the people was that whenever anyone offered a sacrifice, while the meat was still boiling, the priest’s servant would come with a three-pronged fork in his hand. "},{"num":14,"verse":"He would thrust it into the basin, kettle, caldron, or cooking pot. The priest would then take for himself everything that the fork brought up. This is the way they treated all the Israelites who came to Shiloh. "},{"num":15,"verse":"Before the people had even burned the fat, the priest’s servant would come and tell the person who was making the sacrifice, “Give me meat for the priest to roast, because he will not accept boiled meat from you, but only raw meat.”"},{"num":16,"verse":"If the man said to him, “Let us burn the fat first. Then take as much as you want,” the servant would say, “No, you must give it to me right now. If you do not, I will take it by force.” "},{"num":17,"verse":"So the sin of the young men was very serious in the sight of the Lord, because the men were treating the Lord’s offerings with contempt."},{"num":18,"verse":"But Samuel ministered before the Lord while he was still a young boy, dressed in a special vest made of linen. "},{"num":19,"verse":"His mother would make a little robe for him and bring it to him whenever she came up with her husband to offer the annual sacrifice. "},{"num":20,"verse":"Eli would bless Elkanah and his wife, and say, “May the Lord give you offspring from this woman in place of the son she asked for, whom she loaned to the Lord.” Then they would go back to their home. "},{"num":21,"verse":"The Lord came to Hannah with his blessing, and she conceived and gave birth to three sons and two daughters. The child Samuel grew up in the presence of the Lord."},{"num":22,"verse":"Now Eli was very old. He heard about everything that his sons were doing to all Israel and how they were sleeping with the women who served at the entrance to the Tent of Meeting. "},{"num":23,"verse":"So he said to them, “Why do you do such things? I keep hearing from all these people about your evil actions. "},{"num":24,"verse":"No, my sons, it is not a good report that I hear! The people are spreading this report everywhere. "},{"num":25,"verse":"If one man sins against another, God will mediate for him. But if a man sins against the Lord, who will mediate for him?” But they did not listen to the voice of their father, because the Lord desired to put them to death."},{"num":26,"verse":"The young man Samuel continued to grow, and he increased in favor with both the Lord and with men."},{"header":"The Lord’s Warning to Eli"}]