[{"num":2,"verse":"Then Hannah prayed out of her deepest feelings."},{"num":11,"verse":"So Elkanah and his family returned home to Ramah, while Samuel remained behind with Eli the priest to minister before the Eternal One."},{"num":12,"verse":"Although Eli’s sons served as priests, they were really worthless men with no understanding of the Eternal "},{"num":13,"verse":"or of their priestly duties. When someone presented meat as a ritual offering to the Lord, the priest would send a servant with a three-pronged fork to probe around in the pot or kettle as the sacrifice boiled; and whatever he brought up with the fork, the priest would keep as his own. They did this at Shiloh to all the Israelites who came to sacrifice."},{"num":15,"verse":"The priest’s servant would even tell those who were going to burn fat as a sacrifice,"},{"num":16,"verse":"And if the worshiper protested, saying the priest could take whatever he wanted after the fat was burned, the servant would say,"},{"num":17,"verse":"Because they despised the Eternal’s ritual offerings, the Eternal One judged that the sons of Eli had sinned greatly."},{"num":18,"verse":"Now Samuel was then a small boy, working in the house of the Eternal One. He wore a linen vest, one of the priestly garments. "},{"num":19,"verse":"His mother used to make him a new robe every year, and she would take it up to him when she and her husband came to perform the yearly sacrifice. "},{"num":20,"verse":"On that joyful occasion, Eli would bless Elkanah and Hannah."},{"num":21,"verse":"The Eternal One showed his favor toward Hannah again, and she conceived and gave birth to three sons and two daughters, and her son Samuel grew up in the presence of the Eternal One."},{"num":22,"verse":"Eli, who had grown old and tired, heard what his sons were doing to all those Israelites who came to Shiloh to perform their sacrifices. He heard that they were even having sexual relations with the women who worked at the door of the meeting tent."},{"num":26,"verse":"The boy Samuel grew tall, wise in the ways of the Lord, and in favor with God and the people he served."},{"num":27,"verse":"A man sent by the True God came to Eli."}]