[[],[],[{"type":"prose","content":"A revealing of Jesus, the Messiah. God gave it to make plain to his servants what is about to happen. He published and delivered it by Angel to his servant John. And John told everything he saw: God’s Word—the witness of Jesus Christ!"}],[{"type":"prose","content":"How blessed the reader! How blessed the hearers and keepers of these oracle words, all the words written in this book!Time is just about up."}],[{"type":"header","content":"His Eyes Pouring Fire-Blaze"},{"type":"prose","content":"I, John, am writing this to the seven churches in Asia province: All the best to you from , and from the Seven Spirits assembled before his throne, and from Jesus Christ—Loyal Witness, Firstborn from the dead, Ruler of all earthly kings."},{"type":"poetry","content":"Glory and strength to Christ, who loves us,"},{"type":"poetry","content":"Who made us a Kingdom, Priests for his Father,"},{"type":"poetry","content":"Riding the clouds, he’ll be seen by every eye,"},{"type":"poetry","content":"People from all nations and all times"}],[{"type":"prose","content":"The Master declares, “I’m A to Z. I’m . I’m the Sovereign-Strong.”"}],[{"type":"prose","content":"I, John, with you all the way in the trial and the Kingdom and the passion of patience in Jesus, was on the island called Patmos because of God’s Word, the witness of Jesus. It was Sunday and I was in the Spirit, praying. I heard a loud voice behind me, trumpet-clear and piercing: “Write what you see into a book. Send it to the seven churches: to Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, Laodicea.” I turned and saw the voice."},{"type":"poetry","content":"I saw a gold menorah"},{"type":"poetry","content":"And in the center, the Son of Man,"},{"type":"poetry","content":"Eyes pouring fire-blaze,"},{"type":"poetry","content":"His voice a roar,"},{"type":"poetry","content":"His mouth a sharp-biting sword,"},{"type":"prose","content":"I saw this and fainted dead at his feet. His right hand pulled me upright, his voice reassured me:"}],[{"type":"prose","content":"“Don’t fear: I am First, I am Last, I’m Alive. I died, but I came to life, and my life is now forever. See these keys in my hand? They open and lock Death’s doors, they open and lock Hell’s gates. Now write down everything you see: things that are, things about to be. The Seven Stars you saw in my right hand and the seven-branched gold menorah—do you want to know what’s behind them? The Seven Stars are the Angels of the seven churches; the menorah’s seven branches are the seven churches.”"}]]