[{"header":"Prologue"},{"num":1,"verse":"This is a revelation from Jesus Christ, which God gave him to show his servants the events that must soon take place. He sent an angel to present this revelation to his servant John,"},{"num":2,"verse":"who faithfully reported everything he saw. This is his report of the word of God and the testimony of Jesus Christ."},{"num":3,"verse":"God blesses the one who reads the words of this prophecy to the church, and he blesses all who listen to its message and obey what it says, for the time is near."},{"header":"John’s Greeting to the Seven Churches"},{"num":4,"verse":"This letter is from John to the seven churches in the province of Asia."},{"num":5,"verse":"and from Jesus Christ. He is the faithful witness to these things, the first to rise from the dead, and the ruler of all the kings of the world."},{"num":6,"verse":"He has made us a Kingdom of priests for God his Father. All glory and power to him forever and ever! Amen."},{"num":8,"verse":"“I am the Alpha and the Omega—the beginning and the end,” says the Lord God. “I am the one who is, who always was, and who is still to come—the Almighty One.”"},{"header":"Vision of the Son of Man"},{"num":9,"verse":"I, John, am your brother and your partner in suffering and in God’s Kingdom and in the patient endurance to which Jesus calls us. I was exiled to the island of Patmos for preaching the word of God and for my testimony about Jesus."},{"num":10,"verse":"It was the Lord’s Day, and I was worshiping in the Spirit. Suddenly, I heard behind me a loud voice like a trumpet blast."},{"num":11,"verse":"It said, “Write in a book everything you see, and send it to the seven churches in the cities of Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, and Laodicea.”"},{"num":12,"verse":"When I turned to see who was speaking to me, I saw seven gold lampstands."},{"num":13,"verse":"And standing in the middle of the lampstands was someone like the Son of Man. He was wearing a long robe with a gold sash across his chest."},{"num":14,"verse":"His head and his hair were white like wool, as white as snow. And his eyes were like flames of fire."},{"num":15,"verse":"His feet were like polished bronze refined in a furnace, and his voice thundered like mighty ocean waves."},{"num":16,"verse":"He held seven stars in his right hand, and a sharp two-edged sword came from his mouth. And his face was like the sun in all its brilliance."},{"num":17,"verse":"When I saw him, I fell at his feet as if I were dead. But he laid his right hand on me and said, “Don’t be afraid! I am the First and the Last."},{"num":18,"verse":"I am the living one. I died, but look—I am alive forever and ever! And I hold the keys of death and the grave."},{"num":19,"verse":"“Write down what you have seen—both the things that are now happening and the things that will happen."},{"num":20,"verse":"This is the meaning of the mystery of the seven stars you saw in my right hand and the seven gold lampstands: The seven stars are the angels of the seven churches, and the seven lampstands are the seven churches."}]