[{"header":"Introduction and Salutation"},{"num":1,"verse":"The revelation of Jesus Christ, which God gave him to show his servants what must soon take place; he made it known by sending his angel to his servant John, "},{"num":2,"verse":"who testified to the word of God and to the testimony of Jesus Christ, even to all that he saw."},{"num":3,"verse":"Blessed is the one who reads aloud the words of the prophecy, and blessed are those who hear and who keep what is written in it; for the time is near."},{"num":4,"verse":"John to the seven churches that are in Asia:"},{"num":5,"verse":"and from Jesus Christ, the faithful witness, the firstborn of the dead, and the ruler of the kings of the earth."},{"num":6,"verse":"and made us to be a kingdom, priests serving his God and Father, to him be glory and dominion forever and ever. Amen."},{"num":8,"verse":"“I am the Alpha and the Omega,” says the Lord God, who is and who was and who is to come, the Almighty."},{"header":"A Vision of Christ"},{"num":9,"verse":"I, John, your brother who share with you in Jesus the persecution and the kingdom and the patient endurance, was on the island called Patmos because of the word of God and the testimony of Jesus. "},{"num":10,"verse":"I was in the spirit on the Lord’s day, and I heard behind me a loud voice like a trumpet "},{"num":11,"verse":"saying, “Write in a book what you see and send it to the seven churches, to Ephesus, to Smyrna, to Pergamum, to Thyatira, to Sardis, to Philadelphia, and to Laodicea.”"},{"num":12,"verse":"Then I turned to see whose voice it was that spoke to me, and on turning I saw seven golden lampstands, "},{"num":13,"verse":"and in the midst of the lampstands I saw one like the Son of Man, clothed with a long robe and with a golden sash across his chest. "},{"num":14,"verse":"His head and his hair were white as white wool, white as snow; his eyes were like a flame of fire, "},{"num":15,"verse":"his feet were like burnished bronze, refined as in a furnace, and his voice was like the sound of many waters. "},{"num":16,"verse":"In his right hand he held seven stars, and from his mouth came a sharp, two-edged sword, and his face was like the sun shining with full force."},{"num":17,"verse":"When I saw him, I fell at his feet as though dead. But he placed his right hand on me, saying, “Do not be afraid; I am the first and the last, "},{"num":18,"verse":"and the living one. I was dead, and see, I am alive forever and ever; and I have the keys of Death and of Hades. "},{"num":19,"verse":"Now write what you have seen, what is, and what is to take place after this. "},{"num":20,"verse":"As for the mystery of the seven stars that you saw in my right hand, and the seven golden lampstands: the seven stars are the angels of the seven churches, and the seven lampstands are the seven churches."}]