[[],[{"type":"prose","content":"To the Overseer. -- `Destroy not,' by David. -- A secret treasure, in Saul's sending, and they watch the house to put him to death. Deliver me from mine enemies, O my God, From my withstanders set me on high."}],[{"type":"prose","content":"Deliver me from workers of iniquity, And from men of blood save me."}],[{"type":"prose","content":"For, lo, they laid wait for my soul, Assembled against me are strong ones, Not my transgression nor my sin, O Jehovah."}],[{"type":"prose","content":"Without punishment they run and prepare themselves, Stir up to meet me, and see."}],[{"type":"prose","content":"And Thou, Jehovah, God of Hosts, God of Israel, Awake to inspect all the nations. Favour not any treacherous dealers of iniquity. Selah."}],[{"type":"prose","content":"They turn back at evening, They make a noise like a dog, And go round about the city."}],[{"type":"prose","content":"Lo, they belch out with their mouths, Swords [are] in their lips, for `Who heareth?'"}],[{"type":"prose","content":"And Thou, O Jehovah dost laugh at them, Thou dost mock at all the nations."}],[{"type":"prose","content":"O my Strength, unto Thee I take heed, For God [is] my tower -- the God of my kindness."}],[{"type":"prose","content":"God doth go before me, He causeth me to look on mine enemies."}],[{"type":"prose","content":"Slay them not, lest my people forget, Shake them by Thy strength, And bring them down, O Lord our shield."}],[{"type":"prose","content":"The sin of their mouth [is] a word of their lips, And they are captured in their pride, And from the curse and lying they recount."}],[{"type":"prose","content":"Consume in fury, consume and they are not, And they know that God is ruling in Jacob, To the ends of the earth. Selah."}],[{"type":"prose","content":"And they turn back at evening, They make a noise like a dog, And they go round about the city."}],[{"type":"prose","content":"They -- they wander for food, If they are not satisfied -- then they murmur."}],[{"type":"prose","content":"And I -- I sing [of] Thy strength, And I sing at morn [of] Thy kindness, For thou hast been a tower to me, And a refuge for me in a day of adversity."}],[{"type":"prose","content":"O my Strength, unto Thee I sing praise, For God [is] my tower, the God of my kindness!"}]]