[{"num":12,"verse":"Ephrayim feedeth on wind, and chasing after the east wind; he daily increaseth kazav (lies) and sod (desolation); and cuts brit with the Assyrians, and shemen is sent to Mitzrayim."},{"num":3,"verse":"Hashem hath also a charge against Yehudah, and will visit punishment on Ya’akov according to his ways; according to his doings will He repay him."},{"num":4,"verse":"In the beten (womb) he (Ya’akov) akav (took at the heel [of]) his brother and by his strength he sarah (struggled with, persevered) with Elohim;"},{"num":5,"verse":"Yea, he (Yisroel) sarah (had power over) the malach, and prevailed; he wept, and made techinnah unto Him; He found him at Beit-El, and there He spoke with us;"},{"num":6,"verse":"Even Hashem Elohei Tzva’os; Hashem is His [memorial] Name!"},{"num":7,"verse":"Therefore turn thou to Eloheicha; be shomer over chesed and mishpat and wait on Eloheicha tamid (continually)."},{"num":8,"verse":"A Kena’an (merchant), in whose hand are the scales of mirmar (deceit) He loveth to oppress."},{"num":9,"verse":"And Ephrayim boasts, Yet I am become an oisher, I have found me out wealth; in all my gain they shall find none avon (iniquity, offense) in me that would be chet (sin)."},{"num":10,"verse":"And I that am Hashem Eloheicha from Eretz Mitzrayim will yet make thee to dwell in oholim, as in the yamei mo’ed [i.e., Sukkot]."},{"num":11,"verse":"I have also spoken to the nevi’im, and I have multiplied chazon (vision, revelation, prophecy), and spoken parables by the nevi’im."},{"num":12,"verse":"Is there aven (iniquity) in Gil‘ad? Surely they are vanity; they sacrifice bullocks in Gilgal; yea, their mizbechot are as piles of stones in the furrows of the fields."},{"num":13,"verse":"And Ya’akov fled into the country of Aram, and Yisroel served for an isha, and for an isha he was shomer [over sheep]."},{"num":14,"verse":"And by a navi Hashem brought Yisroel out of Mitzrayim, and shomer [Yisroel] a navi was."},{"num":15,"verse":"Ephrayim has provoked bitter anger; therefore shall He leave his blood-guiltiness upon him, and his scorn shall Adonoi of him return and repay unto him."}]