[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Revelation",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THREE INSCRIPTIONS WITH ONE MEANING",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘HOLINESS TO THE LORD.’ - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘HOLINESS UNTO THE LORD.’ - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘HIS NAME SHALL BE IN THEIR FOREHEADS.’ - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You will have perceived my purpose in putting these three widely separated texts together. They all speak of inscriptions, and they are all obviously connected with each other. The first of them comes from the ancient times of the institution of the ceremonial ritual, and describes a part of the high priest’s official dress. In his mitre was a thin plate of gold on which was written, ‘Holiness to the Lord.’ The second of them comes from almost the last portion recorded of the history of Israel in the Old Testament, and is from the words of the great Prophet of the Restoration-his ideal presentation of the Messianic period, in which he recognises as one feature, that the inscription on the mitre of the high priest shall be written on ‘the bells of the horses.’ And the last of them is from the closing vision of the celestial kingdom, the heavenly and perfected form of the Christian Church. John, probably remembering the high priest and his mitre, with its inscription upon the forehead, says: ‘His servants shall do Him priestly service’-for that is the meaning of the word inadequately translated ‘serve Him’-’and see His face, and His name shall be in their foreheads.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These three things, then-the high priest’s mitre, the horses’ bells, the foreheads of the perfected saints-present three aspects of the Christian thought of holiness. Take them one by one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The high priest’s mitre. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The high priest’s mitre.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The high priest was the official representative of the nation. He stood before God as the embodied and personified Israel. For the purposes of worship Israel was the high priest, and the high priest was Israel. And so, on his forehead, not to distinguish him from the rest of the people, but to include all the people in his consecration, shone a golden plate with the motto, ‘Holiness to the Lord.’ So, at the very beginning of Jewish ritual there stands a protest against all notions that make ‘saint’ the designation of any abnormal or exceptional sanctity, and confine the name to the members of any selected aristocracy of devoutness and goodness. All Christian men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ex officio",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by the very fact of their Christianity, are saints, in the true sense of the word. And the representative of the whole of Israel stood there before God, with this inscription blazing on his forehead, as a witness that, whatsoever holiness may be, it belongs to every member of the true Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And what is it? It is a very unfortunate thing-indicating superficiality of thought-that the modern popular notion of ‘holiness’ identifies it with purity, righteousness, moral perfection. Now that idea ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in it, but is not the whole of it. For, not to spend time upon mere remarks on words, the meaning of the word thus rendered is in Hebrew, as well as in Greek and in our own English, one and the same. The root-meaning is ‘separated,’ ‘set apart,’ and the word expresses primarily, not moral character, but relation to God. That makes all the difference; and it incalculably deepens the conception, as well as puts us on the right track for understanding the only possible means by which there can ever be realised that moral perfection and excellence which has unfortunately monopolised the meaning of the word in most people’s minds. The first thought is ‘set apart to God.’ That is holiness, in its root and germ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And how can we be set apart for God? You may devote a dead thing for certain uses easily enough. How can a man be separated and laid aside?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Well, there is only one way, brethren, and that is by self-surrender. ‘Yield yourselves to God’ is but the other side, or, rather, the practical shape, of the Old and the New Testament doctrine of holiness. A man becomes God’s when he says, ‘Lord, take me and mould me, and fill me and cleanse me, and do with me what Thou wilt.’ In that self-surrender, which is the tap-root of all holiness, the first and foremost thing to be offered is that most obstinate of all, the will that is in us. And when we yield our wills in submission both to commandments and providences, both to gifts and to withdrawals, both to gains and to losses, both to joys and to sorrows, then we begin to write upon our foreheads ‘Holiness to the Lord.’ And when we go on to yield our hearts to Him, by enshrining Him sole and sovereign in their innermost chamber, and turning to Him the whole current of our lives and desires, and hopes and confidences, which we are so apt to allow to run to waste and be sucked up in the desert sands of the world, then we write more of that inscription. And when we fill our minds with joyful submission to His truth, and occupy our thoughts with His mighty Name and His great revelation, and carry Him with us in the hidden corners of our consciousness, even whilst we are busy about daily work, then we add further letters to it. And when the submissive will, and the devoted heart, and the occupied thoughts are fully expressed in daily life and its various external duties, then the writing is complete. ‘Holiness to the Lord’ is self-surrender of will and heart and mind and everything. And that surrender is of the very essence of Christianity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What is a saint? Some man or woman that has practised unheard-of austerities? Somebody that has lived an isolated and self-regarding life in convent or monastery or desert? No! a man or woman in the world who, moved by the mercies of God, yields self to God as ‘a living sacrifice.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So the New Testament writers never hesitate to speak even of such very imperfect Christians as were found in abundance in churches like Corinth and Galatia as being all ‘saints,’ every man of them. That is not because the writers were minimising their defects, or idealising their persons, but because, if they are Christians at all, they are saints; seeing that no man is a Christian who has not been drawn by Christ’s great sacrifice for him to yield himself a sacrifice for Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Of course that intrusive idea which has, in popular apprehension, so swallowed up the notion of holiness-viz. that of perfection of moral character or conduct-is included in this other, or rather is developed from it. For the true way to conquer self is to surrender self; and the more entire our giving up of ourselves, the more certainly shall we receive ourselves back again from His hands. ‘By the mercies of God, I beseech you, yield yourselves living sacrifices.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. I come to my next text-the horses’ bells. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. I come to my next text-the horses’ bells.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Zechariah has a vision of the ideal Messianic times, and, of course, as must necessarily be the case, his picture is painted with colours laid upon his palette by his experience, and he depicts that distant future in the guise suggested to him by what he saw around him. So we have to disentangle from his words the sentiment which he expresses, and to recognise the symbolic way in which he puts it. His thought is this,-the inscription on the high priest’s mitre will be written on the bells which ornament the harness of the horses, which in Israel were never used as with us, but only either for war or for pomp and display, and the use of which was always regarded with a certain kind of doubt and suspicion. Even these shall be consecrated in that far-off day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then he goes on with variations on the same air, ‘In that day there shall be upon the bells of the horses, \"Holiness unto the Lord,\"‘ and adds that ‘the pots in the Lord’s house’-the humble vessels that were used for the most ordinary parts of the Temple services-’shall be like the bowls before the altar,’ into which the sacred blood of the offerings was poured. The most external and secular thing bearing upon religion shall be as sacred as the sacredest. But that is not all. ‘Yea! every pot in Jerusalem and in Judah shall be holiness unto the Lord of hosts, and all they that sacrifice shall come and take of them,’ and put their offerings therein. That is to say, the coarse pottery vessels that were in every poverty-stricken house in the city shall be elevated to the rank of the sacred vessels of the Temple. Domestic life with all its secularities shall be hallowed. The kitchens of Jerusalem shall be as truly places of worship as is the inner shrine of the Most High.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " On the whole, the prophet’s teaching is that, in the ideal state of man upon earth, there will be an entire abolition of the distinction between ‘sacred’ and ‘secular’; a distinction that has wrought infinite mischief in the world, and in the lives of Christian people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me translate these words of our prophet into English equivalents. Every cup and tumbler in a poor man’s kitchen may be as sacred as the communion chalice that passes from lip to lip with the ‘blood of Jesus Christ’ in it. Every common piece of service that we do, down among the vulgarities and the secularities and the meannesses of daily life, may be lifted up to stand upon precisely the same level as the sacredest office that we undertake. The bells of the horses may jingle to the same tune as the trumpets of the priests sounded within the shrine, and on all, great and small, may be written, ‘Holiness to the Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But let us remember that that universally diffused sanctity will need to have a centre of diffusion, else there will be no diffusion, and that all life will become sacred when the man that lives it has ‘Holiness to the Lord’ written on his forehead, and not else. If that be the inscription on the driver’s heart, the horses that he drives will have it written on their bells, but they will not have it unless it be. Holy men make all things holy. ‘To the pure all things are pure,’ but unto them that are unclean and disobedient there is nothing pure. Hallow thyself, and all things are clean unto thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And so I come to my third text-the perfected saints’ foreheads. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And so I come to my third text-the perfected saints’ foreheads.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The connection between the first and the last of these texts is as plain and close as between the first and the second. For John in his closing vision gives emphasis to the priestly idea as designating in its deepest relations the redeemed and perfected Christian Church. Therefore he says, as I have already explained, ‘His servants shall do Him ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "priestly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " service, and His name shall be in their foreheads.’ The old official dress of the high priest comes into his mind, and he paints the future, just as Zechariah did, under the forms of the past, and sees before the throne the perfected saints, each man of them with that inscription clear and conspicuous.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is an advance in his words which I think it is not fanciful to note. It is only the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is written in the perfected saint’s forehead. Not the ‘Holiness unto the Lord,’ but just the bare name. What does that mean? Well, it means the same as your writing your name in one of your books does, or as when a man puts his initials on the back of his oxen, or as the old practice of branding the master’s mark upon the slave did. It means absolute ownership.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But it means something more. The name is the manifested personality, the revealed God, or, as we say in an abstract way, the character of God. That Name is to be in the foreheads of His perfected people. How does it come to be there? Read also the clause before the text-’His servants shall see His face, and His name shall be in their foreheads.’ That is to say, the perfected condition is not reached by surrender only, but by assimilation; and that assimilation comes by contemplation. The faces that are turned to Him, and behold Him, are smitten with the light and shine, and those that look upon them see ‘as it had been the face of an angel,’ as the Sanhedrim saw that of Stephen, when he beheld the Son of Man ‘standing at the right hand of God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " My last text is but a picturesque way of saying what the writer of it says in plain words when he declares, ‘We shall be like Him, for we shall see Him as He is.’ The name is to be ‘in their foreheads,’ where every eye can see it. Alas! alas! it is so hard for us to live out our best selves, and to show to the world what is in us. Cowardice, sheepishness, and a hundred other reasons prevent it. In this poor imperfect state no emotion ever takes shape and visibility without losing more or less of its beauty. But yonder the obstructions to self-manifestation will be done away; and ‘when He shall be manifested, we also shall be manifested with Him in glory.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Then shall the righteous blaze forth like the sun in My heavenly Father’s Kingdom.’ But the beginning of it all is ‘Holiness to the Lord’ written on our hearts; and the end of that is the vision which is impossible without holiness, and which leads on to the beholder’s perfect likeness to his Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:1-5 All streams of earthly comfort are muddy; but these are clear, and refreshing. They give life, and preserve life, to those who drink of them, and thus they will flow for evermore. These point to the quickening and sanctifying influences of the Holy Spirit, as given to sinners through Christ. The Holy Spirit, proceeding from the Father and the Son, applies this salvation to our souls by his new-creating love and power. The trees of life are fed by the pure waters of the river that comes from the throne of God. The presence of God in heaven, is the health and happiness of the saints. This tree was an emblem of Christ, and of all the blessings of his salvation; and the leaves for the healing of the nations, mean that his favour and presence supply all good to the inhabitants of that blessed world. The devil has no power there; he cannot draw the saints from serving God, nor can he disturb them in the service of God. God and the Lamb are here spoken of as one. Service there shall be not only freedom, but honour and dominion. There will be no night; no affliction or dejection, no pause in service or enjoyment: no diversions or pleasures or man's inventing will there be wanted. How different all this from gross and merely human views of heavenly happiness, even those which refer to pleasures of the mind!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall see his face - See the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They would be constantly in his presence, and be permitted continually to behold his glory.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his name shall be in their foreheads - They shall be designated as his. See the notes on Revelation 3:12; Revelation 7:3; Revelation 13:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And his name shall be in their foreheads - They shall be designated as his. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 7:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. see his face—revealed in divine glory, in Christ Jesus. They shall see and know Him with intuitive knowledge of Him, even as they are known by Him (1Co 13:9-12), and face to face. Compare 1Ti 6:16, with Joh 14:9. God the Father can only be seen in Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in—Greek, \"on their foreheads.\" Not only shall they personally and in secret (Re 3:17) know their sonship, but they shall be known as sons of God to all the citizens of the new Jerusalem, so that the free flow of mutual love among the members of Christ's family will not be checked by suspicion as here.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And they shall see his face; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is a phrase by which the happiness of the glorified saints is oft expressed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 5:8 1 Corinthians 13:12 Hebrews 12:14 1Jo 3:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 13:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Jo 3:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; they shall enjoy him immediately. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And his name shall be in their foreheads; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there shall be none that have the name of the beast on their foreheads; they shall have God’s name on their foreheads, and be so manifested to be the sons of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall see his face,.... The face of God, so as he is not to be seen now; they shall see him as he is; not only the angels, who always behold the face of God, but all the saints, risen and changed, being pure in heart, and perfectly holy; they shall see him face to face, they shall have intimate and familiar communion with him; they shall enjoy his favour, and have the freest and largest discoveries of his love; and they shall see the face of the Lamb; they shall behold Christ and his glory both with the eyes of their understanding, and with the eyes of their bodies; and this is a very desirable sight, and will be very glorious and delightful; it will be fully satisfying, and will make the saints like unto him; it will be free from all darkness and any interruption, and will always continue. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his name shall be in their foreheads; they shall be known to be his servants, as if his name was written and bore on their foreheads; it will be a clear case that they are the children and people of God; now they are, but it is not known, at least not so known as it will be in this state; and they will also in the fullest and freest manner own God to be their God, and the Lamb to be their Redeemer; they will be under no fear of man, nor be under any temptation to be ashamed of Christ, or of his service; see Revelation 14:1. Some think there is an allusion to the inscription on the mitre of the high priest's forehead, \"holiness to the Lord\", the saints being now openly, visibly, and perfectly holy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And his name shall be in their foreheads; they shall be known to be his servants, as if his name was written and bore on their foreheads; it will be a clear case that they are the children and people of God; now they are, but it is not known, at least not so known as it will be in this state; and they will also in the fullest and freest manner own God to be their God, and the Lamb to be their Redeemer; they will be under no fear of man, nor be under any temptation to be ashamed of Christ, or of his service; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Some think there is an allusion to the inscription on the mitre of the high priest's forehead, \"holiness to the Lord\", the saints being now openly, visibly, and perfectly holy. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they shall see his face; and his name shall be in their foreheads.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The ancient ideal of intimate confidence is also to be realised (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Iren. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Adv.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Har.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). With this phrase and that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " compare Browning’s lines: “Why, where’s the need of temple when the walls \" O’ the world are that … This one Face, far from vanish, rather grows \" Becomes my universe that feels and knows.” The idea here is that reproduced in the seventh and supreme degree of bliss in 4 Ezra 7 :[78] where the saints “shall rejoice with confidence, have boldness undismayed, and gladness unafraid, for they shall hasten to behold the face of him whom they served in life”. By Oriental usage, no condemned or criminal person was allowed to look on the king’s face (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), In the ancient ch. 64 of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "E. B. D.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (papyrus of Nu) the “triumphant Nu saith, ‘I have come to see him that dwelleth in his divine uraeus, face to face, and eye to eye.… Thou art in me, and I am in thee,’ ” The Apocalypse, however, shuns almost any approach to the inner union of the individual Christian and Christ which distinguished both Paul and the fourth gospel; it also eschews the identification of God and man which was often crudely affected by Egyptian eschatology. No allusion occurs to the supremacy of the saints over angels (Ap. Bar. 51:12, etc.), though John is careful elsewhere to keep the latter in their place (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He also ignores the problem of different degrees in bliss,—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὄψονται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In Chag. 5 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there is a story of a blind rabbi who blessed some departing visitors with the words, “Ye have visited a face that is seen and sees not: may ye be counted worthy to visit the Face which sees and is not seen”. The Christian prophet has a better hope and promise. Compare, however, Plutarch’s touching faith (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Iside",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 79) that the souls of men after death will “migrate to the unseen, the good,” when God becomes their king and leader and where “they, as it were, hang upon him and gaze without ever wearying, and yearn for that unspeakable, indescribable Beauty”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall see his face",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "locus classicus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for what constitutes the blessedness of heaven, the “Beatific Vision.” It is intimated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where there may be an allusion to the privilege of Moses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 33:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 34:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the last verse of Psalms 17 it may be questioned whether the final and immediate vision, or an earthly foretaste, is intended; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shew that it is only to “the spirits of just men made perfect” that the vision is endurable. In the N. T. we have the promise in St ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; St John’s I ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [shall be] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in their foreheads",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] So in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where, according to the true text, we see that “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” still means the Name of God, both the Father and the Son.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they shall see his face; and his name shall be in their foreheads.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Another consequence of there being no accursed thing  - no sin (see on ver. 3). All are pure it, heart, and therefore they see God. The same promise is made in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The last clause connects this chapter with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and shows that these who are here described are those who have overcome (cf. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Revelation 22:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See His face",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare 1 John 3:2; Matthew 5:8; Exodus 33:20; Psalm 17:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]