[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the coming against me ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " the wicked to devour my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my enemies and my foes to me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "themselves stumbled and fell. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would allow us to understand those who eat up flesh, as a figure for calumniators and detractors; but the context marks out the situation so clearly as that of a warrior, that we rather take it as a general metaphor for savage and violent attacks. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is an emphatic repetition—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my enemies, mine.Benson CommentaryPsalm 27:2-3. When my foes came upon me to eat up my flesh — Greedy to devour me: aiming at no less than my utter destruction, and confident they should effect it; they stumbled and fell — Not, I smote them and they fell, but they stumbled, namely, of their own accord, without my lifting a hand against them; and fell — They were so confounded and weakened that they could not go on with their enterprise. Thus they that came to take Christ were, by a word of his, made to stagger and fall to the ground, John 18:6. The ruin of some of the enemies of God’s people is an earnest of the complete conquest of them all. And, therefore, these being fallen, he is fearless of the rest. Though a host should encamp, &c. — Though my enemies be numerous as a host; though they be daring, and their attempts threatening; though they encamp against me, an army against one man; though they wage war upon me, yet my heart shall not fear — Hosts cannot hurt us, if the Lord of hosts protect us.Matthew Henry's Concise Commentary27:1-6 The Lord, who is the believer's light, is the strength of his life; not only by whom, but in whom he lives and moves. In God let us strengthen ourselves. The gracious presence of God, his power, his promise, his readiness to hear prayer, the witness of his Spirit in the hearts of his people; these are the secret of his tabernacle, and in these the saints find cause for that holy security and peace of mind in which they dwell at ease. The psalmist prays for constant communion with God in holy ordinances. All God's children desire to dwell in their Father's house. Not to sojourn there as a wayfaring man, to tarry but for a night; or to dwell there for a time only, as the servant that abides not in the house for ever; but to dwell there all the days of their life, as children with a father. Do we hope that the praising of God will be the blessedness of our eternity? Surely then we ought to make it the business of our time. This he had at heart more than any thing. Whatever the Christian is as to this life, he considers the favour and service of God as the one thing needful. This he desires, prays for and seeks after, and in it he rejoices.Barnes' Notes on the BibleWhen the wicked, even mine enemies and my foes, came upon me - This refers, doubtless, to some particular period of his past life when he was in very great danger, and when God interposed to save him. The margin here is, \"approached against me.\" The literal rendering would be, \"in the drawing near against me of the wicked to eat up my flesh.\" The reference is to some period when they purposed an attack upon him, and when he was in imminent danger from such a threatened attack.To eat up my flesh - As if they would eat me up. That is, they came upon me like ravening wolves, or hungry lions. We are not to suppose that they literally purposed to eat up his flesh, or that they were cannibals; but the comparison is one that is drawn from the fierceness of wild beasts rushing on their prey. Compare Psalm 14:4.They stumbled and fell - They were overthrown. They failed in their purpose. Either they were thrown into a panic by a false fear, or they were overthrown in battle. The language would be rather applicable to the former, as if by some alarm they were thrown into consternation. Either they differed among themselves and became confused, or God threw obstacles in their way and they were driven back. The general idea is, that God had interposed in some way to prevent the execution of their purposes. Jamieson-Fausset-Brown Bible Commentary2. eat … my flesh—(Job 19:22; Ps 14:4). The allusion to wild beasts illustrates their rapacity.they stumbled—\"they\" is emphatic; not I, but they were destroyed.Matthew Poole's Commentary To eat up my flesh;  greedy to devour me at one morsel. Compare Job 19:22 31:31. Gill's Exposition of the Entire BibleWhen the wicked, even mine enemies and my foes, came upon me,.... They are wicked men, men of malignant spirits, and evildoers, who are the enemies and foes of the people of God, and who hate them with an implacable hatred, and do everything they can to distress and afflict them; and such enemies David had, who were many and mighty; and these \"came upon\" him, or \"approached against\" him (c), they drew near to him to make war with him, as the word signifies (d); they attacked him in an hostile manner; and their view was, as he says, to eat up my flesh, as they eat bread, Psalm 14:4; to devour him at once, to make but one morsel of him, to destroy his life, to strip him of his substance, to take away his wives and children, as the Amalekites at Ziklag, 1 Samuel 30:1; they stumbled and fell; the Lord put stumbling blocks in their way, and retarded their march, and hindered them from executing their designs; and they fell into the hands of David, and were subdued under him, or fell by death; and these past instances of divine goodness the psalmist calls to mind, to keep up his heart and courage, and animate and strengthen him against the fears of men, of death and hell. (c)  \"cum appropinquaverint adversum me\", Pagninus; so Gejerus. (d) \"Belligerantibus contra me\", Junius & Tremellius; so Piscator & Ainsworth. Geneva Study BibleWhen the wicked, even mine enemies and my foes, came upon me to eat up my flesh, they stumbled and fell.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "my enemies, mine.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 27:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "When my foes came upon me to eat up my flesh — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Greedy to devour me: aiming at no less than my utter destruction, and confident they should effect it; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "they stumbled and fell — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Not, I smote them and they fell, but ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "they stumbled, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "namely, of their own accord, without my lifting a hand against them; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and fell — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "They were so confounded and weakened that they could not go on with their enterprise. Thus they that came to take Christ were, by a word of his, made to stagger and fall to the ground, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The ruin of some of the enemies of God’s people is an earnest of the complete conquest of them all. And, therefore, these being fallen, he is fearless of the rest. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Though a host should encamp, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "&c. — Though my enemies be numerous as a host; though they be daring, and their attempts threatening; though they encamp against me, an army against one man; though they wage war upon me, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "yet my heart shall not fear — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Hosts cannot hurt us, if the Lord of hosts protect us.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "27:1-6 The Lord, who is the believer's light, is the strength of his life; not only by whom, but in whom he lives and moves. In God let us strengthen ourselves. The gracious presence of God, his power, his promise, his readiness to hear prayer, the witness of his Spirit in the hearts of his people; these are the secret of his tabernacle, and in these the saints find cause for that holy security and peace of mind in which they dwell at ease. The psalmist prays for constant communion with God in holy ordinances. All God's children desire to dwell in their Father's house. Not to sojourn there as a wayfaring man, to tarry but for a night; or to dwell there for a time only, as the servant that abides not in the house for ever; but to dwell there all the days of their life, as children with a father. Do we hope that the praising of God will be the blessedness of our eternity? Surely then we ought to make it the business of our time. This he had at heart more than any thing. Whatever the Christian is as to this life, he considers the favour and service of God as the one thing needful. This he desires, prays for and seeks after, and in it he rejoices.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "When the wicked, even mine enemies and my foes, came upon me - This refers, doubtless, to some particular period of his past life when he was in very great danger, and when God interposed to save him. The margin here is, \"approached against me.\" The literal rendering would be, \"in the drawing near against me of the wicked to eat up my flesh.\" The reference is to some period when they purposed an attack upon him, and when he was in imminent danger from such a threatened attack.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "To eat up my flesh - As if they would eat me up. That is, they came upon me like ravening wolves, or hungry lions. We are not to suppose that they literally purposed to eat up his flesh, or that they were cannibals; but the comparison is one that is drawn from the fierceness of wild beasts rushing on their prey. Compare Psalm 14:4.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "They stumbled and fell - They were overthrown. They failed in their purpose. Either they were thrown into a panic by a false fear, or they were overthrown in battle. The language would be rather applicable to the former, as if by some alarm they were thrown into consternation. Either they differed among themselves and became confused, or God threw obstacles in their way and they were driven back. The general idea is, that God had interposed in some way to prevent the execution of their purposes. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. eat … my flesh—(Job 19:22; Ps 14:4). The allusion to wild beasts illustrates their rapacity.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "they stumbled—\"they\" is emphatic; not I, but they were destroyed.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "To eat up my flesh; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " greedy to devour me at one morsel. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 19:22 31:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "When the wicked, even mine enemies and my foes, came upon me,.... They are wicked men, men of malignant spirits, and evildoers, who are the enemies and foes of the people of God, and who hate them with an implacable hatred, and do everything they can to distress and afflict them; and such enemies David had, who were many and mighty; and these \"came upon\" him, or \"approached against\" him (c), they drew near to him to make war with him, as the word signifies (d); they attacked him in an hostile manner; and their view was, as he says, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "to eat up my flesh, as they eat bread, Psalm 14:4; to devour him at once, to make but one morsel of him, to destroy his life, to strip him of his substance, to take away his wives and children, as the Amalekites at Ziklag, 1 Samuel 30:1; ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "they stumbled and fell; the Lord put stumbling blocks in their way, and retarded their march, and hindered them from executing their designs; and they fell into the hands of David, and were subdued under him, or fell by death; and these past instances of divine goodness the psalmist calls to mind, to keep up his heart and courage, and animate and strengthen him against the fears of men, of death and hell. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(c)  \"cum appropinquaverint adversum me\", Pagninus; so Gejerus. (d) \"Belligerantibus contra me\", Junius & Tremellius; so Piscator & Ainsworth. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "When the wicked, even mine enemies and my foes, came upon me to eat up my flesh, they stumbled and fell.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When evil-doers came near against me to eat my flesh,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Even mine adversaries and my foes, they stumbled and fell.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This may refer to past experience, or it may be a confident anticipation of the discomfiture of his foes. According to a common Hebrew idiom the perfect tense may realise their defeat as an accomplished plished fact. See Appendix, Note IV. He compares his assailants to wild beasts, eager to devour him. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stumbled and fell",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 46:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When the wicked, even mine enemies and my foes, came upon me to eat up my flesh, they stumbled and fell.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A special occasion seems to be intended, so that the LXX. have rightly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἠσθένησαν καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἔπεσαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some unrecorded event in the war with Absalom before the final struggle, is probably alluded to. There is an emphasis ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "on",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " enemies,\" which implies that the adversaries were not the foes of the country, but David's personal foes. Psalm 27:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In this first strophe is expressed the bold confidence of faith. It is a hexastich in the caesural schema. Let darkness break in upon him, the darkness of night, of trouble, and of spiritual conflict, yet Jahve is his Light, and if he is in Him, he is in the light and there shines upon him a sun, that sets not and knows no eclipse. This sublime, infinitely profound name for God, אורי, is found only in this passage; and there is only one other expression that can be compared with it. viz., בּא אורך in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. φῶς ἐλήλυθα, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ישׁעי does not stand beside אורי as an unfigurative, side by side with a figurative expression; for the statement that God is light, is not a metaphor. David calls Him his \"salvation\" in regard to everything that oppresses him, and the \"stronghold (מעוז from עזז, with an unchangeable ) of his life\" in regard to everything that exposes him to peril. In Jahve he conquers far and wide; in Him his life is hidden as it were behind a fortress built upon a rock (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). When to the wicked who come upon him in a hostile way (קרב על differing from קרב אל), he attributes the intention of devouring his flesh, they are conceived of as wild beasts. To eat up any one's flesh signifies, even in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the same as to pursue any one by evil speaking (in Aramaic by slander, back-biting) to his destruction. In בּקרב (the Shebג of the only faintly closed syllable is raised to a Chateph, as in ולשׁכני, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", לשׁאול, and the like. The לי of איבי לּי may, as also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), be regarded as giving intensity to the notion of special, personal enmity; but a mere repetition of the subject (the enemy) without the repetition of their hostile purpose would be tame in the parallel member of the verse: לי is a variation of the preceding עלי, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:60",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the apodosis המּה כּשׁלוּ ונפלוּ, the overthrow of the enemy is regarded beforehand as an accomplished fact. The holy boldness and imperturbable repose are expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the very rhythm. The thesis or downward movement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is spondaic: he does not allow himself to be disturbed; the thesis in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is iambic: he can be bold. The rendering of Hitzig (as of Rashi): \"in this do I trust, viz., that Jahve is my light, etc.,\" is erroneous. Such might be the interpretation, if בזאת אני בוטח closed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but it cannot refer back over ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and why should the poet have expressed himself thus materially, instead of saying ביהוה? The fact of the case is this, בוטח signifies even by itself \"of good courage,\" e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and בזאת \"in spite of this\" (Coccejus: hoc non obstante), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", begins the apodosis, at the head of which we expect to find an adversative conjunction. ",
        "children": []
      }
    ]
  }
]