[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In thee shall Israel bless.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—In conformity with these words, the Israelites to this day use Jacob’s formula in blessing their children.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "48:8-22 The two good men own God in their comforts. Joseph says, They are my sons whom God has given me. Jacob says, God hath showed me thy seed. Comforts are doubly sweet to us when we see them coming from God's hand. He not only prevents our fears, but exceeds our hopes. Jacob mentions the care the Divine providence had taken of him all his days. A great deal of hardship he had known in his time, but God kept him from the evil of his troubles. Now he was dying, he looked upon himself as redeemed from all sin and sorrow for ever. Christ, the Angel of the covenant, redeems from all evil. Deliverances from misery and dangers, by the Divine power, coming through the ransom of the blood of Christ, in Scripture are often called redemption. In blessing Joseph's sons, Jacob crossed hands. Joseph was willing to support his first-born, and would have removed his father's hands. But Jacob acted neither by mistake, nor from a partial affection to one more than the other; but from a spirit of prophecy, and by the Divine counsel. God, in bestowing blessings upon his people, gives more to some than to others, more gifts, graces, and comforts, and more of the good things of this life. He often gives most to those that are least likely. He chooses the weak things of the world; he raises the poor out of the dust. Grace observes not the order of nature, nor does God prefer those whom we think fittest to be preferred, but as it pleases him. How poor are they who have no riches but those of this world! How miserable is a death-bed to those who have no well-grounded hope of good, but dreadful apprehensions of evil, and nothing but evil for ever!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph presumes that his father has gone astray through dulness of perception, and endeavors to rectify his mistake. He finds, however, that on the other hand a supernatural vision is now conferred on his parent, who is fully conscious of what he is about, and therefore, abides by his own act. Ephraim is to be greater than Menasseh. Joshua, the successor of Moses, was of the tribe of Ephraim, as Kaleb his companion was of Judah. Ephraim came to designate the northern kingdom of the ten tribes, as Judah denoted the southern kingdom containing the remaining tribes; and each name was occasionally used to denote all Israel, with a special reference to the prominent part. \"His seed shall be the fullness of the nations.\" This denotes not only the number but the completeness of his race, and accords with the future pre-eminence of his tribe. In thee, in Joseph, who is still identified with his offspring.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "At the point of death Jacob expresses his assurance of the return of his posterity to the land of promise, and bestows on Joseph one share or piece of ground above his brethren, which, says he, I took out of the hand of the Amorite with my sword and with my bow. This share is, in the original, שׁכם  shekem, Shekem, a shoulder or tract of land. This region included \"the parcel of the field where he had spread his tent\" Genesis 33:19. It refers to the whole territory of Shekem, which was conquered by his sword and his bow, inasmuch as the city itself was sacked, and its inhabitants put to the sword by his sons at the head of his armed retainers, though without his approval Genesis 34. Though he withdrew immediately after to Bethel Genesis 35, yet he neither fled nor relinquished possession of this conquest, as we find his sons feeding his flocks there when he himself was residing at Hebron Genesis 37:13. The incidental conquest of such a tract was no more at variance with the subsequent acquisition of the whole country than the purchase of a field by Abraham or a parcel of ground by Jacob himself. In accordance with this gift Joseph's bones were deposited in Shekem, after the conquest of the whole land by returning Israel. The territory of Shekem was probably not equal in extent to that of Ephraim, but was included within its bounds. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "At the point of death Jacob expresses his assurance of the return of his posterity to the land of promise, and bestows on Joseph one share or piece of ground above his brethren, which, says he, I took out of the hand of the Amorite with my sword and with my bow. This share is, in the original, שׁכם  shekem, Shekem, a shoulder or tract of land. This region included \"the parcel of the field where he had spread his tent\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 33:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It refers to the whole territory of Shekem, which was conquered by his sword and his bow, inasmuch as the city itself was sacked, and its inhabitants put to the sword by his sons at the head of his armed retainers, though without his approval ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Though he withdrew immediately after to Bethel ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", yet he neither fled nor relinquished possession of this conquest, as we find his sons feeding his flocks there when he himself was residing at Hebron ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The incidental conquest of such a tract was no more at variance with the subsequent acquisition of the whole country than the purchase of a field by Abraham or a parcel of ground by Jacob himself. In accordance with this gift Joseph's bones were deposited in Shekem, after the conquest of the whole land by returning Israel. The territory of Shekem was probably not equal in extent to that of Ephraim, but was included within its bounds. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": " - Jacob Blesses His Sons",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5. מכרה  mekêrāh, \"weapon;\" related: כיר  kārar or כרה  kārāh dig. \"Device, design?\" related: מכר  mākar \"sell,\" in Arabic \"take counsel. Habitation.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10. מחקק  mechoqēq, \"lawgiver, judge, dispenser of laws.\" This word occurs in six other places - Numbers 21:18; Deuteronomy 33:21; Jud. Deu 5:14; Psalm 60:9; Psalm 108:9; Isaiah 33:22; in five of which it clearly denotes ruler, or judge. The meaning \"sceptre\" is therefore doubtful. שׁילה  shı̂ylôh, Shiloh, a softened form of שׁילון  shı̂ylôn, a derivative of שׁל  shol, the ultimate root of שׁלה  shālâh, שׁלם  shālam, and possibly שׁלט  shālaṭ, and hence, denoting \"the peacemaker, the prince of peace.\" It is not employed as an appellative noun. But it is used afterward as the name of a town, now identified as Seilun. This town probably had its name, like many other ancient places from a person of the same name who built or possessed it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "10. מחקק  mechoqēq, \"lawgiver, judge, dispenser of laws.\" This word occurs in six other places - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 21:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Jud. Deu 5:14; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 60:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 108:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; in five of which it clearly denotes ruler, or judge. The meaning \"sceptre\" is therefore doubtful. שׁילה  shı̂ylôh, Shiloh, a softened form of שׁילון  shı̂ylôn, a derivative of שׁל  shol, the ultimate root of שׁלה  shālâh, שׁלם  shālam, and possibly שׁלט  shālaṭ, and hence, denoting \"the peacemaker, the prince of peace.\" It is not employed as an appellative noun. But it is used afterward as the name of a town, now identified as Seilun. This town probably had its name, like many other ancient places from a person of the same name who built or possessed it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From the special conference with Joseph we now pass to the parting address of Jacob to his assembled sons. This is at the same time prophetic and benedictory. Like all prophecy, it starts from present things, and in its widest expanse penetrates into the remotest future of the present course of nature.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From the special conference with Joseph we now pass to the parting address of Jacob to his assembled sons. This is at the same time prophetic and benedictory. Like all prophecy, it starts from present things, and in its widest expanse penetrates into the remotest future of the present course of nature.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. Joseph took them both—The very act of pronouncing the blessing was remarkable, showing that Jacob's bosom was animated by the spirit of prophecy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. in thy seed, as appears both from the relative ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here, and from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 48:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 48:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where his blessing of them is called the blessing of Joseph; and from the following words, where this is interpreted of ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephraim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Manasseh.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " And ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or in thy seed, i.e. using their names in the form or words of blessing, as eminent examples of blessedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he blessed them that day,.... That Joseph visited him, and this be did \"by faith\"; believing that what he had said concerning them would be accomplished, as the apostle observes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, in thee shall Israel bless; in Joseph, as the Targum of Jonathan, that is, in his seed, in his sons Ephraim and Manasseh, when the Israelites blessed any, they should make use of their names: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, God make thee as Ephraim and Manasseh: as great and honourable, as rich and wealthy, as fruitful and prosperous as they; and the Targum says, this custom continues with the Jews to this day, to put their hands on persons to bless them; if a son, they say,\"God make thee as Ephraim and Manasseh;''if a daughter,\"God make thee as Sarah and Rebekah:\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he set Ephraim before Manasseh; not only in this form of benediction, but in all that he had said and done before; he preferred him to Manasseh by putting his right hand upon him, and giving him the superior blessing: and it is no unusual thing for the younger to be set before the elder, both by God and man, but especially by the Lord, who seeth not as man seeth, and proceeds not according to carnal descent, or those rules men go by: there had been many instances before this, as Abel was preferred to Cain, Shem to Japheth, Abraham to Nahor, Isaac to Ishmael, and Jacob to Esau; as there were after it, as Moses to Aaron, and David to his brethren. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he set Ephraim before Manasseh; not only in this form of benediction, but in all that he had said and done before; he preferred him to Manasseh by putting his right hand upon him, and giving him the superior blessing: and it is no unusual thing for the younger to be set before the elder, both by God and man, but especially by the Lord, who seeth not as man seeth, and proceeds not according to carnal descent, or those rules men go by: there had been many instances before this, as Abel was preferred to Cain, Shem to Japheth, Abraham to Nahor, Isaac to Ishmael, and Jacob to Esau; as there were after it, as Moses to Aaron, and David to his brethren. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he blessed them that day, saying, In thee shall Israel bless, saying, God make thee as {h} Ephraim and as Manasseh: and he set Ephraim before Manasseh.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he blessed them that day, saying, In thee shall Israel bless, saying, God make thee as ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Ephraim and as Manasseh: and he set Ephraim before Manasseh.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) In whom God's graces should manifestly appear.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, as marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "By",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is that the blessing upon Ephraim and Manasseh shall be quoted as a formula for the invocation of Divine favour. Compare the blessing in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ruth 4:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bless",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The versions, LXX, Vulg., and Syriac, give the passive “shall be blessed.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jacob) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "blessed them that day, saying, In thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Joseph, who is still identified with his sons) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the nation) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "bless, saying, God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Elohim, the supreme source of all blessing) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "make thee as Ephraim and as Manasseh: and he set Ephraim Before Manasseh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - \"in the position of his hands, and the terms of the blessing\" (Keil). Genesis 48:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Joseph observed his father placing his right hand upon the head of Ephraim, the younger son, he laid hold of it to put it upon Manasseh's head, telling his father at the same time that he was the first-born; but Jacob replied, \"I know, my son, I:know: he also (Manasseh) will become a nation, and will become great, yet (ואוּלם as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") his younger brother will become greater than he, and his seed will become the fulness of nations.\" This blessing began to be fulfilled from the time of the Judges, when the tribe of Ephraim so increased in extent and power, that it took the lead of the northern tribes and became the head of the ten tribes, and its name acquired equal importance with the name Israel, whereas under Moses, Manasseh had numbered 20,000 more than Ephraim (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 26:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 26:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As a result of the promises received from God, the blessing was not merely a pious wish, but the actual bestowal of a blessing of prophetic significance and force. - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the writer sums up the entire act of blessing in the words of the patriarch: \"In thee (i.e., Joseph) will Israel (as a nation) bless, saying: God make thee as Ephraim and Manasseh\" (i.e., Joseph shall be so blessed in his two sons, that their blessing will become a standing form of benediction in Israel); \"and thus he placed Ephraim before Manasseh,\" viz., in the position of his hands and the terms of the blessing. Lastly, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Israel expressed to Joseph his firm faith in the promise, that God would bring back his descendants after his death into the land of their fathers (Canaan), and assigned to him a double portion in the promised land, the conquest of which passed before his prophetic glance as already accomplished, in order to insure for the future the inheritance of the adopted sons of Joseph. \"I give thee one ridge of land above thy brethren\" (i.e., above what thy brethren receive, each as a single tribe), \"which I take from the hand of the Amorites with my sword and bow\" (i.e., by force of arms). As the perfect is used prophetically, transposing the future to the present as being already accomplished, so the words לקחתּי אשׁר must also be understood prophetically, as denoting that Jacob would wrest the land from the Amorites, not in his own person, but in that of his posterity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: There is no force in Kurtz's objection, that this gift did not apply to Joseph as the father of Ephraim and Manasseh, but to Joseph personally; for it rests upon the erroneous assumption, that Jacob separated Joseph from his sons by their adoption. But there is not a word to that effect in Genesis 48:6, and the very opposite in Genesis 48:15, viz., that Jacob blessed Joseph in Ephraim and Manasseh. Heim's conjecture, which Kurtz approves, that by the land given to Joseph we are to understand the high land of Gilead, which Jacob had conquered from the Amorites, needs no refutation, for it is purely imaginary.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: There is no force in Kurtz's objection, that this gift did not apply to Joseph as the father of Ephraim and Manasseh, but to Joseph personally; for it rests upon the erroneous assumption, that Jacob separated Joseph from his sons by their adoption. But there is not a word to that effect in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 48:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the very opposite in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 48:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", viz., that Jacob blessed Joseph in Ephraim and Manasseh. Heim's conjecture, which Kurtz approves, that by the land given to Joseph we are to understand the high land of Gilead, which Jacob had conquered from the Amorites, needs no refutation, for it is purely imaginary.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The words cannot refer to the purchase of the piece of ground at Shechem (Genesis 33:19), for a purchase could not possibly be called a conquest by sword and bow; and still less to the crime committed by the sons of Jacob against the inhabitants of Shechem, when they plundered the town (Genesis 34:25.), for Jacob could not possibly have attributed to himself a deed for which he had pronounced a curse upon Simeon and Levi (Genesis 49:6-7), not to mention the fact, that the plundering of Shechem was not followed in this instance by the possession of the city, but by the removal of Jacob from the neighbourhood. \"Moreover, any conquest of territory would have been entirely at variance with the character of the patriarchal history, which consisted in the renunciation of all reliance upon human power, and a believing, devoted trust in the God of the promises\" (Delitzsch). The land, which the patriarchs desired to obtain in Canaan, they procured not by force of arms, but by legal purchase (cf. Genesis 24 and Genesis 33:19). It was to be very different in the future, when the iniquity of the Amorites was full (Genesis 15:16). But Jacob called the inheritance, which Joseph was to have in excess of his brethren, שׁכם (lit., shoulder, or more properly nape, neck; here figuratively a ridge, or tract of land), as a play upon the word Shechem, because he regarded the piece of land purchased at Shechem as a pledge of the future possession of the whole land. In the piece purchased there, the bones of Joseph were buried, after the conquest of Canaan (Joshua 24:32); and this was understood in future times, as though Jacob had presented the piece of ground to Joseph (vid., John 4:5). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The words cannot refer to the purchase of the piece of ground at Shechem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 33:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), for a purchase could not possibly be called a conquest by sword and bow; and still less to the crime committed by the sons of Jacob against the inhabitants of Shechem, when they plundered the town (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), for Jacob could not possibly have attributed to himself a deed for which he had pronounced a curse upon Simeon and Levi (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), not to mention the fact, that the plundering of Shechem was not followed in this instance by the possession of the city, but by the removal of Jacob from the neighbourhood. \"Moreover, any conquest of territory would have been entirely at variance with the character of the patriarchal history, which consisted in the renunciation of all reliance upon human power, and a believing, devoted trust in the God of the promises\" (Delitzsch). The land, which the patriarchs desired to obtain in Canaan, they procured not by force of arms, but by legal purchase (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 33:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It was to be very different in the future, when the iniquity of the Amorites was full (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But Jacob called the inheritance, which Joseph was to have in excess of his brethren, שׁכם (lit., shoulder, or more properly nape, neck; here figuratively a ridge, or tract of land), as a play upon the word Shechem, because he regarded the piece of land purchased at Shechem as a pledge of the future possession of the whole land. In the piece purchased there, the bones of Joseph were buried, after the conquest of Canaan (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and this was understood in future times, as though Jacob had presented the piece of ground to Joseph (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]