[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Nehemiah 9:9-10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:9-10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And didst see the affliction of our fathers in Egypt — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God’s providences over Isaac and Jacob are passed by, to come to his interpositions in their behalf, since they became a nation; that is, since he had made good his covenant with Abraham, in multiplying his seed as the stars of heaven; at the time of entering into which covenant he had foretold that his seed should suffer grievous affliction in Egypt; from which having rescued them, he completed their deliverance at the Red sea, when they cried to him, as is here mentioned. It was reasonable to remember this, now they were interceding for the perfecting of their deliverance out of Babylon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And showedst signs and wonders upon Pharaoh — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Many and mighty, such as were unprecedented and unparalleled, thereby ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "getting honour ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "upon him, and upon his servants and people, the deliverance of thy people being the destruction of their enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For thou knewest that they dealt proudly against them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Intending to make them their slaves for ever, as, for the present, they treated them with the utmost contempt and cruelty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:4-38 The summary of their prayers we have here upon record. Much more, no doubt, was said. Whatever ability we have to do any thing in the way of duty, we are to serve and glorify God according to the utmost of it. When confessing our sins, it is good to notice the mercies of God, that we may be the more humbled and ashamed. The dealings of the Lord showed his goodness and long-suffering, and the hardness of their hearts. The testimony of the prophets was the testimony of the Spirit in the prophets, and it was the Spirit of Christ in them. They spake as they were moved by the Holy Ghost, and what they said is to be received accordingly. The result was, wonder at the Lord's mercies, and the feeling that sin had brought them to their present state, from which nothing but unmerited love could rescue them. And is not their conduct a specimen of human nature? Let us study the history of our land, and our own history. Let us recollect our advantages from childhood, and ask what were our first returns? Let us frequently do so, that we may be kept humble, thankful, and watchful. Let all remember that pride and obstinacy are sins which ruin the soul. But it is often as hard to persuade the broken-hearted to hope, as formerly it was to bring them to fear. Is this thy case? Behold this sweet promise, A God ready to pardon! Instead of keeping away from God under a sense of unworthiness, let us come boldly to the throne of grace, that we may obtain mercy, and find grace to help in time of need. He is a God ready to pardon.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The host of heaven worshippeth thee - i. e the angels. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6-38. Thou, even thou, art Lord alone, &c.—In this solemn and impressive prayer, in which they make public confession of their sins, and deprecate the judgments due to the transgressions of their fathers, they begin with a profound adoration of God, whose supreme majesty and omnipotence is acknowledged in the creation, preservation, and government of all. Then they proceed to enumerate His mercies and distinguished favors to them as a nation, from the period of the call of their great ancestor and the gracious promise intimated to him in the divinely bestowed name of Abraham, a promise which implied that he was to be the Father of the faithful, the ancestor of the Messiah, and the honored individual in whose seed all the families of the earth should be blessed. Tracing in full and minute detail the signal instances of divine interposition for their deliverance and their interest—in their deliverance from Egyptian bondage—their miraculous passage through the Red Sea—the promulgation of His law—the forbearance and long-suffering shown them amid their frequent rebellions—the signal triumphs given them over their enemies—their happy settlement in the promised land—and all the extraordinary blessings, both in the form of temporal prosperity and of religious privilege, with which His paternal goodness had favored them above all other people, they charge themselves with making a miserable requital. They confess their numerous and determined acts of disobedience. They read, in the loss of their national independence and their long captivity, the severe punishment of their sins. They acknowledge that, in all heavy and continued judgments upon their nation, God had done right, but they had done wickedly. And in throwing themselves on His mercy, they express their purpose of entering into a national covenant, by which they pledge themselves to dutiful obedience in future.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And didst see the affliction of our fathers in Egypt,.... The hard bondage in which their lives were made bitter; and was not a mere spectator of it, but looked upon them in it with pity and compassion, and sent them a deliverer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and heardest their cry by the Red sea; which was before them, and the rocks on both sides of them, and the host of Pharaoh behind, pressing upon them, when he heard them, and wrought salvation for them, Exodus 14:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and heardest their cry by the Red sea; which was before them, and the rocks on both sides of them, and the host of Pharaoh behind, pressing upon them, when he heard them, and wrought salvation for them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And didst see the affliction of our fathers in Egypt, and heardest their cry by the Red sea;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9–11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Deliverance from Egypt",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "didst see",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thou sawest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words are probably based on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘And the Lord said, I have surely seen the affliction of my people.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heardest their cry by the Red sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘And, behold, the Egyptians marched after them … and the children of Israel cried out unto the Lord.’ 15, ‘And the Lord said unto Moses, Wherefore criest thou unto me.’ In both cases the verb ‘cry’ is the same root as the substantive here used.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Nehemiah 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fulfilment of this word by the deliverance of Israel from Egypt, and their guidance through the wilderness to Canaan.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nehemiah 9:9-11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:9-11",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And Thou sawest the affliction of our fathers in Egypt, and heardest their cry by the Red Sea: Nehemiah 9:10 And showedst signs and wonders upon Pharaoh and all his servants, and on all the people of his land, because Thou knewest that they dealt proudly against them, and madest Thyself a name, as this day. Nehemiah 9:11 And Thou dividedst the sea before them, and they went through the midst of the sea on dry land; and their persecutors Thou threwest into the deeps, as a stone into the mighty waters.\" In Nehemiah 9:9 are comprised two subjects, which are carried out in Nehemiah 9:10, Nehemiah 9:11 : (1) the affliction of the Israelites in Egypt, which God saw (comp. Exodus 3:7), and out of which He delivered them by the signs and wonders He showed upon Pharaoh (Nehemiah 9:10); (2) the crying for help at the Red Sea, when the Israelites perceived Pharaoh with his horsemen and chariots in pursuit (Exodus 14:10), and the help which God gave them by dividing the sea, etc. (Nehemiah 9:11). The words in Nehemiah 9:10 are supported by Deuteronomy 6:22, on the ground of the historical narrative, Exodus 7-10. The expression עליהם הזידוּ כּי is formed according to עליהם זדוּ אשׁר, Exodus 18:11. על הזיד occurs Exodus 21:14 in a general sense. On וגו שׁם לך ותּעשׂ comp. Jeremiah 32:20; Isaiah 58:12, Isaiah 58:14; 1 Chronicles 17:22. A name as this day - in that the miracles which God then did are still praised, and He continues still to manifest His almighty power. The words of Nehemiah 9:11 are supported by Exodus 14:21-22, Exodus 14:28, and Exodus 15:19. אבן כּמו בּמצולות are from Exodus 15:5; עזּים בּמים from Exodus 15 and Isaiah 43:16.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"And Thou sawest the affliction of our fathers in Egypt, and heardest their cry by the Red Sea: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And showedst signs and wonders upon Pharaoh and all his servants, and on all the people of his land, because Thou knewest that they dealt proudly against them, and madest Thyself a name, as this day. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And Thou dividedst the sea before them, and they went through the midst of the sea on dry land; and their persecutors Thou threwest into the deeps, as a stone into the mighty waters.\" In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are comprised two subjects, which are carried out in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : (1) the affliction of the Israelites in Egypt, which God saw (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and out of which He delivered them by the signs and wonders He showed upon Pharaoh (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); (2) the crying for help at the Red Sea, when the Israelites perceived Pharaoh with his horsemen and chariots in pursuit (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the help which God gave them by dividing the sea, etc. (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The words in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are supported by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 6:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", on the ground of the historical narrative, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 7-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The expression עליהם הזידוּ כּי is formed according to עליהם זדוּ אשׁר, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 18:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". על הזיד occurs ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in a general sense. On וגו שׁם לך ותּעשׂ comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 58:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 58:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 17:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A name as this day - in that the miracles which God then did are still praised, and He continues still to manifest His almighty power. The words of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 9:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are supported by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:21-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". אבן כּמו בּמצולות are from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; עזּים בּמים from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      }
    ]
  }
]