[{"num":13,"verse":"When Ephrayim spoke there was trembling; he was exalted in Yisroel; but when he became guilty in Ba’al, he died."},{"num":2,"verse":"And now they sin more and more, and have made for themselves massekhah (idol) of their kesef, and atzabim according to their faculty of binah (understanding), all of it the work of the craftsmen; they say of them, Let adam that sacrifice kiss calf-idols."},{"num":3,"verse":"Therefore they shall be like the anan boker (morning cloud) and as the early dew that disappears, like the motz (chaff) that is driven with the whirlwind out of the threshing floor, and as the smoke out of the window."},{"num":4,"verse":"Yet I am Hashem Eloheicha from Eretz Mitzrayim, and thou shalt know no Elohim but Me; for there is no Moshia besides Me."},{"num":5,"verse":"I did know thee in the midbar, in the eretz taluvot (land of burning heat)."},{"num":6,"verse":"According to their pasture [i.e., as I fed them], so were they filled; they were filled, and their lev became proud; therefore have they forgotten Me."},{"num":7,"verse":"Therefore I will be unto them as a lion; as a leopard by the derech will I lie in wait;"},{"num":8,"verse":"I will meet them as a dov (bear) that is bereaved of her cubs, and will rip open the covering of their lev, and there will I devour them like a lion; as the wild beast of the sadeh would tear them."},{"num":9,"verse":"O Yisroel, thou art destroyed; because thou art against Me, thine Ezer (Help)."},{"num":10,"verse":"Where now is thy melech that he may save thee? Where in all thy cities are thy shofetim of whom thou saidst, Give me a melech and sarim?"},{"num":11,"verse":"I gave thee a melech in Mine anger, and took him away in My wrath [Isa 53:10]."},{"num":12,"verse":"The avon (iniquity) of Ephrayim is bound up; his chattat is lurking."},{"num":13,"verse":"The chevlei yoledah (birth pangs of a woman in childbirth) shall come upon him; he is a ben lo chacham; for when it is time he does not come to the opening of the womb."},{"num":14,"verse":"Should I ransom them from the power of Sheol? Should I redeem them from mavet? O Mavet, where are the dever (pestilence, plague) of thee? O Sheol, where is thy destruction? Nocham (sorrow, compassion, pity) shall be hidden from Mine eyes."},{"num":15,"verse":"Even though he thrives among his achim, an east wind shall come, the Ruach Hashem shall come up from the midbar (desert), and his makor (spring, fountain) shall become dry, and his well shall be dried up; it shall plunder the otzar of every keli chemdah (precious vessel)."},{"num":14,"verse":"Shomron shall bear guilt; for she hath rebelled against her Elohim; they shall fall by the cherev; their olalim shall be dashed in pieces, and their women with child shall be ripped open."}]