[{"header":"Solomon’s Dedication of the Temple"},{"num":6,"verse":"Then Solomon said,"},{"num":3,"verse":"Then the king turned around and blessed all the assembly of Israel, while all the assembly of Israel was standing."},{"num":4,"verse":"He said, “Blessed be the Lord, the God of Israel, who spoke with His mouth to my father David, and fulfilled it with His hands, saying,"},{"num":5,"verse":"‘Since the day that I brought My people from the land of Egypt, I did not choose a city out of all the tribes of Israel in which to build a house, so that My name might be there, nor did I choose a man to be the leader over My people Israel;"},{"num":6,"verse":"but I have chosen Jerusalem so that My name might be there, and I have chosen David to be over My people Israel.’"},{"num":7,"verse":"Now it was in the heart of my father David to build a house for the name of the Lord, the God of Israel."},{"num":8,"verse":"But the Lord said to my father David, ‘Because it was in your heart to build a house for My name, you did well that it was in your heart."},{"num":9,"verse":"Nevertheless you shall not build the house, but your son who will be born to you, he shall build the house for My name.’"},{"num":10,"verse":"Now the Lord has fulfilled His word which He spoke; for I have risen in place of my father David and sit on the throne of Israel, as the Lord promised, and have built the house for the name of the Lord, the God of Israel."},{"num":11,"verse":"There I have placed the ark in which is the covenant of the Lord, which He made with the sons of Israel.”"},{"header":"Solomon’s Prayer of Dedication"},{"num":12,"verse":"Then he stood before the altar of the Lord in the presence of all the assembly of Israel and spread out his hands."},{"num":13,"verse":"For Solomon had made a bronze platform, five cubits long, five cubits wide, and three cubits high, and had set it in the midst of the courtyard; and he stood on it, knelt on his knees in the presence of all the assembly of Israel and spread out his hands toward heaven."},{"num":14,"verse":"He said, “Lord, God of Israel, there is no god like You in heaven or on earth, keeping Your covenant and Your faithfulness to Your servants who walk before You with all their heart;"},{"num":15,"verse":"You who have kept with Your servant, my father David, that which You promised him; You have spoken with Your mouth and have fulfilled it with Your hand, as it is this day."},{"num":16,"verse":"Now then, Lord, God of Israel, keep to Your servant David, my father, that which You promised him, saying, ‘You shall not lack a man to sit on the throne of Israel, if only your sons pay attention to their way, to walk in My Law as you have walked before Me.’"},{"num":17,"verse":"Now then, Lord, God of Israel, let Your word be confirmed which You have spoken to Your servant David."},{"num":18,"verse":"“But will God really dwell with mankind on the earth? Behold, heaven and the highest heaven cannot contain You; how much less this house which I have built!"},{"num":19,"verse":"Nevertheless, turn Your attention to the prayer of Your servant and to his plea, Lord, my God, to listen to the cry and to the prayer which Your servant prays before You;"},{"num":20,"verse":"that Your eye will be open toward this house day and night, toward the place of which You have said that You would put Your name there, to listen to the prayer which Your servant shall pray toward this place."},{"num":21,"verse":"Listen to the pleadings of Your servant and of Your people Israel when they pray toward this place; hear from Your dwelling place, from heaven; hear and forgive."},{"num":22,"verse":"“If someone sins against his neighbor and is made to take an oath, and he comes and takes an oath before Your altar in this house,"},{"num":23,"verse":"then hear from heaven and take action and judge Your servants, punishing the wicked by bringing his way on his own head, and justifying the righteous by repaying him according to his righteousness."},{"num":24,"verse":"“If Your people Israel are defeated before an enemy because they have sinned against You, and they return to You and praise Your name, and pray and plead before You in this house,"},{"num":25,"verse":"then hear from heaven and forgive the sin of Your people Israel, and bring them back to the land which You have given to them and to their fathers."},{"num":26,"verse":"“When the heavens are shut up and there is no rain because they have sinned against You, and they pray toward this place and praise Your name, and turn from their sin when You afflict them,"},{"num":27,"verse":"then hear in heaven and forgive the sin of Your servants and Your people Israel; indeed, teach them the good way in which they are to walk. And provide rain on Your land, which You have given to Your people as an inheritance."},{"num":28,"verse":"“If there is a famine in the land, if there is a plague, if there is blight or mildew, if there is locust or grasshopper, if their enemies besiege them in the land of their cities, whatever plague or whatever sickness there is,"},{"num":29,"verse":"whatever prayer or plea is made by anyone or by all Your people Israel, each knowing his own affliction and his own pain, and spreading his hands toward this house,"},{"num":30,"verse":"then hear from heaven, Your dwelling place, and forgive, and render to each according to all his ways, whose heart You know—for You alone know the hearts of the sons of mankind—"},{"num":31,"verse":"so that they may fear You, to walk in Your ways as long as they live in the land which You have given to our fathers."},{"num":32,"verse":"“Also concerning the foreigner who is not from Your people Israel, when he comes from a far country on account of Your great name and Your mighty hand and Your outstretched arm, when they come and pray toward this house,"},{"num":33,"verse":"then hear from heaven, from Your dwelling place, and do according to all for which the foreigner calls to You, so that all the peoples of the earth may know Your name, and fear You as do Your people Israel, and that they may know that this house which I have built is called by Your name."},{"num":34,"verse":"“When Your people go out to battle against their enemies, by whatever way You send them, and they pray to You toward this city which You have chosen and the house which I have built for Your name,"},{"num":35,"verse":"then hear from heaven their prayer and their pleading, and maintain their cause."},{"num":36,"verse":"“When they sin against You (for there is no one who does not sin), and You are angry with them and turn them over to an enemy, so that they take them away captive to a land far off or near,"},{"num":37,"verse":"if they take it to heart in the land where they are taken captive, and repent and plead to You in the land of their captivity, saying, ‘We have sinned, we have done wrong and have acted wickedly’;"},{"num":38,"verse":"if they return to You with all their heart and with all their soul in the land of their captivity, where they have been taken captive, and pray toward their land which You have given to their fathers and the city which You have chosen, and toward the house which I have built for Your name,"},{"num":39,"verse":"then hear from heaven, from Your dwelling place, their prayer and pleadings, and maintain their cause, and forgive Your people who have sinned against You."},{"num":40,"verse":"“Now, my God, please, let Your eyes be open and Your ears attentive to the prayer offered in this place."},{"num":41,"verse":"“Now then arise, Lord God, to Your resting place, You and the ark of Your might; let Your priests, Lord God, be clothed with salvation, and let Your godly ones rejoice in what is good."},{"num":42,"verse":"“Lord God, do not turn away the face of Your anointed; remember Your faithfulness to Your servant David.”"}]