[{"num":1,"verse":"This is the prayer prayed by Solomon on that occasion:"},{"num":3,"verse":"Then the king turned around to the people and they stood to receive his blessing:"},{"num":4,"verse":"“Blessed be the Lord God of Israel,” he said to them, “the God who talked personally to my father David and has now fulfilled the promise he made to him. For he told him, "},{"num":5,"verse":"‘I have never before, since bringing my people from the land of Egypt, chosen a city anywhere in Israel as the location of my Temple where my name will be glorified; and never before have I chosen a king for my people Israel. But now I have chosen Jerusalem as that city, and David as that king.’"},{"num":7,"verse":"“My father David wanted to build this Temple, "},{"num":8,"verse":"but the Lord said not to. It was good to have the desire, the Lord told him, "},{"num":9,"verse":"but he was not the one to build it: his son was chosen for that task. "},{"num":10,"verse":"And now the Lord has done what he promised, for I have become king in my father’s place, and I have built the Temple for the name of the Lord God of Israel "},{"num":11,"verse":"and placed the Ark there. And in the Ark is the Covenant between the Lord and his people Israel.”"},{"num":12,"verse":"As he spoke, Solomon was standing before the people on a platform in the center of the outer court, in front of the altar of the Lord. The platform was made of bronze, 7½ feet square and 4½ feet high. Now, as all the people watched, he knelt down, reached out his arms toward heaven, and prayed this prayer:"},{"num":14,"verse":"“O Lord God of Israel, there is no God like you in all of heaven and earth. You are the God who keeps his kind promises to all those who obey you and who are anxious to do your will. "},{"num":15,"verse":"And you have kept your promise to my father David, as is evident today. "},{"num":16,"verse":"And now, O God of Israel, carry out your further promise to him that ‘your descendants shall always reign over Israel if they will obey my laws as you have.’ "},{"num":17,"verse":"Yes, Lord God of Israel, please fulfill this promise too. "},{"num":18,"verse":"But will God really live upon the earth with men? Why, even the heaven and the heaven of heavens cannot contain you—how much less this Temple I have built!"},{"num":19,"verse":"“How I pray that you will heed my prayers, O Lord my God! Listen to my prayer that I am praying to you now! "},{"num":20,"verse":"Look down with favor day and night upon this Temple—upon this place where you have said that you would put your name. May you always hear and answer the prayers I will pray to you as I face toward this place. Listen to my prayers and to those of your people Israel when they pray toward this Temple; yes, hear us from heaven, and when you hear, forgive."},{"num":22,"verse":"“Whenever someone commits a crime and is required to swear to his innocence before this altar, "},{"num":23,"verse":"then hear from heaven and punish him if he is lying, or else declare him innocent."},{"num":24,"verse":"“If your people Israel are destroyed before their enemies because they have sinned against you, and if they turn to you and call themselves your people, and pray to you here in this Temple, "},{"num":25,"verse":"then listen to them from heaven and forgive their sins and give them back this land you gave to their fathers."},{"num":26,"verse":"“When the skies are shut and there is no rain because of our sins, and then we pray toward this Temple and claim you as our God, and turn from our sins because you have punished us, "},{"num":27,"verse":"then listen from heaven and forgive the sins of your people, and teach them what is right; and send rain upon this land that you have given to your people as their own property."},{"num":28,"verse":"“If there is a famine in the land, or plagues, or crop disease, or attacks of locusts or caterpillars, or if your people’s enemies are in the land besieging our cities—whatever the trouble is—"},{"num":29,"verse":"listen to every individual’s prayer concerning his private sorrow, as well as all the public prayers. "},{"num":30,"verse":"Hear from heaven where you live and forgive, and give each one whatever he deserves, for you know the hearts of all mankind. "},{"num":31,"verse":"Then they will reverence you forever and will continually walk where you tell them to go."},{"num":32,"verse":"“And when foreigners hear of your power, and come from distant lands to worship your great name, and to pray toward this Temple, "},{"num":33,"verse":"hear them from heaven where you live, and do what they request of you. Then all the peoples of the earth will hear of your fame and will reverence you, just as your people Israel do; and they too will know that this Temple I have built is truly yours."},{"num":34,"verse":"“If your people go out at your command to fight their enemies, and they pray toward this city of Jerusalem that you have chosen, and this Temple that I have built for your name, "},{"num":35,"verse":"then hear their prayers from heaven and give them success."},{"num":36,"verse":"“If they sin against you (and who has never sinned?) and you become angry with them, and you let their enemies defeat them and take them away as captives to some foreign nation near or far; "},{"num":37,"verse":"and if in that land of exile they turn to you again, and face toward this land you gave their fathers and this city and your Temple I have built, and plead with you with all their hearts to forgive them, "},{"num":39,"verse":"then hear from heaven where you live and help them, and forgive your people who have sinned against you."},{"num":40,"verse":"“Yes, O my God, be wide awake and attentive to all the prayers made to you in this place. "},{"num":41,"verse":"And now, O Lord God, arise and enter this resting place of yours where the Ark of your strength has been placed. Let your priests, O Lord God, be clothed with salvation, and let your people rejoice in your kind deeds. "},{"num":42,"verse":"O Lord God, do not ignore me—do not turn your face away from me, your anointed one. Oh, remember your love for David and your kindness to him.”"}]