[{"num":29,"verse":"Sudden perishing shall come [up]on that man, that with hard noll, that is, (with) an obstinate soul, despiseth a blamer (despiseth a rebuker); and health shall not follow him."},{"num":2,"verse":"The commonality shall be glad in the multiplying of just men; when wicked men have taken princehood, the people shall wail. (The community shall be glad when the righteous rule; but when the wicked rule, then the people shall wail.)"},{"num":3,"verse":"A man that loveth wisdom, maketh glad his father; but he that nourisheth a strumpet, shall lose his chattel. (A man who loveth wisdom, maketh his father glad; but he who feedeth a whore, shall lose his possessions.)"},{"num":4,"verse":"A just king raiseth [up] the land; an avaricious man shall destroy it."},{"num":5,"verse":"A man that speaketh by flattering and feigned words to his friend, spreadeth abroad a net to his steps."},{"num":6,"verse":"A snare shall wrap a wicked man doing sin; and a just man shall praise, and make joy. (A snare shall enwrap the wicked doing sin; but the righteous shall give praise, and make joy in their lives.)"},{"num":7,"verse":"A just man knoweth the cause of poor men; and an unpious man knoweth not knowing. (The righteous know of the concerns of the poor; but the wicked do not care to know.)"},{"num":8,"verse":"Men full of pestilence destroy a city; but wise men turn away strong vengeance."},{"num":9,"verse":"If a wise man striveth with a fool, whether he be wroth, or laugh, he shall not find rest."},{"num":10,"verse":"Men-quellers hate a simple man; but just men seek his soul. (Murderers hate honest people; but the righteous seek them out.)"},{"num":11,"verse":"A fool bringeth forth all his spirit; a wise man delayeth, and reserveth into (the) time (to) coming afterward."},{"num":12,"verse":"A prince that heareth willfully the words of leasing, shall have all his servants unfaithful. (A ruler who willingly listeneth to lies, shall have servants who all be unfaithful./If a ruler willingly listeneth to lies, then all of his servants shall be unfaithful.)"},{"num":13,"verse":"A poor man and a lender met themselves; the Lord is [the] lightener of ever either. (A poor person and a lender met together; the Lord lighteneth the burdens of both of them.)"},{"num":14,"verse":"If a king deemeth poor men in truth, his throne shall be made steadfast [into] without end. (If a king judgeth the poor with honesty, his throne shall be made secure forever.)"},{"num":15,"verse":"A rod and chastising shall give wisdom; but a child, that is left to his own will, shameth his mother."},{"num":16,"verse":"Great trespasses shall be multiplied in the multiplying of wicked men; and just men shall see the fallings of them. (Great trespasses shall be multiplied when the wicked rule; but the righteous shall see the falling of them.)"},{"num":17,"verse":"Teach thy son, and he shall comfort thee (and he shall be a comfort to thee); and he shall give delights to thy soul."},{"num":18,"verse":"When prophecy faileth, the people shall be destroyed; but he that keepeth the law, is blessed (but he who obeyeth the Law, is blessed)."},{"num":19,"verse":"A servant may not be taught (only) by words; for he understandeth that that thou sayest, and he despiseth to answer. (A servant will not be corrected with words alone; for he understandeth what thou sayest, but he still despiseth to answer thee.)"},{"num":20,"verse":"Thou hast seen a man swift to speak; folly shall be hoped more than his amending. (Thou hast seen a person quick to speak; more shall be hoped of from a fool, than for that person’s correction.)"},{"num":21,"verse":"He that nourisheth his servant delicately from childhood, shall find him (a) rebel afterward. (He who delicately careth for his servant from childhood, shall find him to be rebellious later.)"},{"num":22,"verse":"A wrathful man stirreth chidings; and he that is light to have indignation, shall be more inclined to sins. (An angry person stirreth up arguments; and he who is quick to have indignation, shall be more inclined to sin.)"},{"num":23,"verse":"Lowness followeth a proud man; and glory shall up-take a meek man of spirit. (Lowness followeth the proud; but honour shall come to those with a humble spirit.)"},{"num":24,"verse":"He that taketh part with a thief, hateth his soul; he heareth a man charging greatly, and showeth not. (He who taketh part with a thief, hateth his own soul; he heareth someone telling many lies, but he declareth it not.)"},{"num":25,"verse":"He that dreadeth a man, shall fall soon; he that hopeth in the Lord, shall be raised [up]. (He who feareth someone, shall soon fall; but he who hopeth in the Lord, shall be raised up.)"},{"num":26,"verse":"Many men seek the face of the prince; and the doom of all men shall go forth of the Lord. (Many people seek favour from a leader; but for all people judgement, or justice, shall come from the Lord.)"},{"num":27,"verse":"Just men have abomination of a wicked man; and wicked men have abomination of them, that be in a rightful way. (The righteous have abomination for the wicked; and the wicked have abomination for those who be on the right way.)"}]