[{"num":29,"verse":"A man often reproved, hardening the neck, Is suddenly broken, and there is no healing."},{"num":2,"verse":"In the multiplying of the righteous the people rejoice, And in the ruling of the wicked the people sigh."},{"num":3,"verse":"A man loving wisdom rejoiceth his father, And a friend of harlots destroyeth wealth."},{"num":4,"verse":"A king by judgment establisheth a land, And one receiving gifts throweth it down."},{"num":5,"verse":"A man taking a portion above his neighbour, Spreadeth a net for his own steps."},{"num":6,"verse":"In the transgression of the evil [is] a snare, And the righteous doth sing and rejoice."},{"num":7,"verse":"The righteous knoweth the plea of the poor, The wicked understandeth not knowledge."},{"num":8,"verse":"Men of scorning ensnare a city, And the wise turn back anger."},{"num":9,"verse":"A wise man is judged by the foolish man, And he hath been angry, And he hath laughed, and there is no rest."},{"num":10,"verse":"Men of blood hate the perfect, And the upright seek his soul."},{"num":11,"verse":"A fool bringeth out all his mind, And the wise till afterwards restraineth it."},{"num":12,"verse":"A ruler who is attending to lying words, All his ministers [are] wicked."},{"num":13,"verse":"The poor and the man of frauds have met together, Jehovah is enlightening the eyes of them both."},{"num":14,"verse":"a king that is judging truly the poor, His throne for ever is established."},{"num":15,"verse":"A rod and reproof give wisdom, And a youth let away is shaming his mother."},{"num":16,"verse":"In the multiplying of the wicked transgression multiplieth, And the righteous on their fall do look."},{"num":17,"verse":"Chastise thy son, and he giveth thee comfort, Yea, he giveth delights to thy soul."},{"num":18,"verse":"Without a Vision is a people made naked, And whoso is keeping the law, O his happiness!"},{"num":19,"verse":"By words a servant is not instructed though he understand, And there is nothing answering."},{"num":20,"verse":"Thou hast seen a man hasty in his words! More hope of a fool than of him."},{"num":21,"verse":"Whoso is bringing up his servant delicately, from youth, [At] his latter end also he is continuator."},{"num":22,"verse":"An angry man stirreth up contention, And a furious man is multiplying transgression."},{"num":23,"verse":"The pride of man humbleth him, And humility of spirit upholdeth honour."},{"num":24,"verse":"Whoso is sharing with a thief is hating his own soul, Execration he heareth, and telleth not."},{"num":25,"verse":"Fear of man causeth a snare, And the confident in Jehovah is set on high."},{"num":26,"verse":"Many are seeking the face of a ruler, And from Jehovah [is] the judgment of each."},{"num":27,"verse":"An abomination to the righteous [is] the perverse man, And an abomination to the wicked [is] the upright in the way!"}]