[{"num":14,"verse":"For the Lord will have mercy on Jacob [the captive Jews in Babylon] and will again choose Israel and set them in their own land; and foreigners [who are proselytes] will join them and will cleave to the house of Jacob (Israel)."},{"num":2,"verse":"And the peoples [of Babylonia] shall take them and bring them to their own country [of Judea] and help restore them. And the house of Israel will possess [the foreigners who prefer to stay with] them in the land of the Lord as male and female servants; and they will take captive [not by physical but by moral might] those whose captives they have been, and they will rule over their [former] oppressors."},{"num":3,"verse":"When the Lord has given you rest from your sorrow and pain and from your trouble and unrest and from the hard service with which you were made to serve,"},{"num":4,"verse":"You shall take up this [taunting] parable against the king of Babylon and say, How the oppressor has stilled [the restless insolence]! The golden and exacting city has ceased!"},{"num":5,"verse":"The Lord has broken the staff of the wicked, the scepter of the [tyrant] rulers,"},{"num":6,"verse":"Who smote the peoples in anger with incessant blows and trod down the nations in wrath with unrelenting persecution—[until] he who smote is persecuted and no one hinders any more."},{"num":7,"verse":"The whole earth is at rest and is quiet; they break forth into singing."},{"num":8,"verse":"Yes, the fir trees and cypresses rejoice at you [O kings of Babylon], even the cedars of Lebanon, saying, Since you have been laid low, no woodcutter comes up against us."},{"num":9,"verse":"Sheol (Hades, the place of the dead) below is stirred up to meet you at your coming [O tyrant Babylonian rulers]; it stirs up the shades of the dead to greet you—even all the chief ones of the earth; it raises from their thrones [in astonishment at your humbled condition] all the kings of the nations."},{"num":10,"verse":"All of them will [tauntingly] say to you, Have you also become weak as we are? Have you become like us?"},{"num":11,"verse":"Your pomp and magnificence are brought down to Sheol (the underworld), along with the sound of your harps; the maggots [which prey upon dead bodies] are spread out under you and worms cover you [O Babylonian rulers]."},{"num":12,"verse":"How have you fallen from heaven, O light-bringer and daystar, son of the morning! How you have been cut down to the ground, you who weakened and laid low the nations [O blasphemous, satanic king of Babylon!]"},{"num":13,"verse":"And you said in your heart, I will ascend to heaven; I will exalt my throne above the stars of God; I will sit upon the mount of assembly in the uttermost north."},{"num":14,"verse":"I will ascend above the heights of the clouds; I will make myself like the Most High."},{"num":15,"verse":"Yet you shall be brought down to Sheol (Hades), to the innermost recesses of the pit (the region of the dead)."},{"num":16,"verse":"Those who see you will gaze at you and consider you, saying, Is this the man who made the earth tremble, who shook kingdoms?—"},{"num":17,"verse":"Who made the world like a wilderness and overthrew its cities, who would not permit his prisoners to return home?"},{"num":18,"verse":"All the kings of the nations, all of them lie sleeping in glorious array, each one in his own sepulcher."},{"num":19,"verse":"But you are cast away from your tomb like a loathed growth or premature birth or an abominable branch [of the family] and like the raiment of the slain; and you are clothed with the slain, those thrust through with the sword, who go down to the stones of the pit [into which carcasses are thrown], like a dead body trodden underfoot."},{"num":20,"verse":"You shall not be joined with them in burial, because you have destroyed your land and have slain your people. May the descendants of evildoers nevermore be named!"},{"num":21,"verse":"Prepare a slaughtering place for his sons because of the guilt and iniquity of their fathers, so that they may not rise, possess the earth, and fill the face of the world with cities."},{"num":22,"verse":"And I will rise up against them, says the Lord of hosts, and cut off from Babylon name and remnant, and son and son’s son, says the Lord."},{"num":23,"verse":"I will also make it a possession of the hedgehog and porcupine, and of marshes and pools of water, and I will sweep it with the broom of destruction, says the Lord of hosts."},{"num":24,"verse":"The Lord of hosts has sworn, saying, Surely, as I have thought and planned, so shall it come to pass, and as I have purposed, so shall it stand—"},{"num":25,"verse":"That I will break the Assyrian in My land, and upon My mountains I will tread him underfoot. Then shall the [Assyrian’s] yoke depart from [the people of Judah], and his burden depart from their shoulders."},{"num":26,"verse":"This is the [Lord’s] purpose that is purposed upon the whole earth [regarded as conquered and put under tribute by Assyria]; and this is [His omnipotent] hand that is stretched out over all the nations."},{"num":27,"verse":"For the Lord of hosts has purposed, and who can annul it? And His hand is stretched out, and who can turn it back?"},{"num":28,"verse":"In the year that King Ahaz [of Judah] died there came this mournful, inspired prediction (a burden to be lifted up):"},{"num":29,"verse":"Rejoice not, O Philistia, all of you, because the rod [of Judah] that smote you is broken; for out of the serpent’s root shall come forth an adder [King Hezekiah of Judah], and its [the serpent’s] offspring will be a fiery, flying serpent."},{"num":30,"verse":"And the firstborn of the poor and the poorest of the poor [of Judah] shall feed on My meadows, and the needy will lie down in safety; but I will kill your root with famine, and your remnant shall be slain."},{"num":31,"verse":"Howl, O gate! Cry, O city! Melt away, O Philistia, all of you! For there is coming a smoke out of the north, and there is no straggler in his ranks and none stands aloof [in Hezekiah’s battalions]."},{"num":32,"verse":"What then shall one answer the messengers of the [Philistine] nation? That the Lord has founded Zion, and in her shall the poor and afflicted of His people trust and find refuge."}]