[{"num":14,"verse":"1 The return of the people from captivity. 4 The derision of the King of Babylon. 11 The death of the king. 29 The destruction of the Philistines."},{"num":1,"verse":"For the Lord will have compassion of Jacob, and will yet choose Israel, and cause them to rest in their own land: and the stranger shall join himself unto them, and they shall cleave to the house of Jacob."},{"num":2,"verse":"And the people shall receive them and bring them to their own place, and the house of Israel shall possess them in the land of the Lord, for servants and handmaids: and they shall take them prisoners, whose captives they were, and have rule over their oppressors."},{"num":3,"verse":"¶ And in that day when the Lord shall give thee rest from thy sorrow, and from thy fear, and from the sore bondage, wherein thou didst serve,"},{"num":4,"verse":"Then shalt thou take up this proverb against the King of Babel, and say, How hath the oppressor ceased? and the gold thirsty Babel rested?"},{"num":5,"verse":"The Lord hath broken the rod of the wicked, and the scepter of the rulers:"},{"num":6,"verse":"Which smote the people in anger with a continual plague, and ruled the nations in wrath: if any were persecuted, he did not let."},{"num":7,"verse":"The whole world is at rest and is quiet: they sing for joy."},{"num":8,"verse":"Also the fir trees rejoiced of thee, and the cedars of Lebanon, saying, Since thou art laid down, no hewer came up against us."},{"num":9,"verse":"Hell beneath is moved for thee to meet thee at thy coming, raising up the dead for thee, even all the princes of the earth, and hath raised from their thrones all the Kings of the nations."},{"num":10,"verse":"All they shall cry and say unto thee, Art thou become weak also as we? art thou become like unto us?"},{"num":11,"verse":"Thy pomp is brought down to the grave, and the sound of the viols: the worm is spread under thee, and the worms cover thee."},{"num":12,"verse":"How art thou fallen from heaven, O Lucifer, son of the morning? and cut down to the ground, which didst cast lots upon the nations?"},{"num":13,"verse":"Yet thou saidest in thine heart, I will ascend into heaven, and exalt my throne above beside the stars of God: I will sit also upon the mount of the congregation in the sides of the North."},{"num":14,"verse":"I will ascend above the height of the clouds, and I will be like the most high."},{"num":15,"verse":"But thou shalt be brought down to the grave, to the side of the pit."},{"num":16,"verse":"They that see thee, shall look upon thee and consider thee, saying, Is this the man that made the earth to tremble, and that did shake the kingdoms?"},{"num":17,"verse":"He made the world as a wilderness, and destroyed the cities thereof, and opened not the house of his prisoners."},{"num":18,"verse":"All the kings of the nations, even they all sleep in glory, everyone in his own house."},{"num":19,"verse":"But thou art cast out of thy grave like an abominable branch: like the raiment of those that are slain, and thrust through with a sword, which go down to the stones of the pit, as a carcass trodden under feet."},{"num":20,"verse":"Thou shalt not be joined with them in the grave, because thou hast destroyed thine own land, and slain thy people: the seed of the wicked shall not be renowned forever."},{"num":21,"verse":"Prepare a slaughter for his children, for the iniquity of their fathers: let them not rise up nor possess the land, nor fill the face of the world with enemies."},{"num":22,"verse":"¶ For I will rise up against them (saith the Lord of hosts) and will cut off from Babel the name and the remnant, and the son, and the nephew, saith the Lord:"},{"num":23,"verse":"And I will make it a possession to the hedgehog, and pools of water, and I will sweep it with the besom of destruction, saith the Lord of hosts."},{"num":24,"verse":"The Lord of hosts hath sworn, saying, Surely like as I have purposed, so shall it come to pass, and as I have consulted, it shall stand:"},{"num":25,"verse":"That I will break to pieces Assyria in my land, and upon my mountains will I tread him under foot, so that his yoke shall depart from them, and his burden shall be taken from off their shoulder."},{"num":26,"verse":"This is the counsel that is consulted upon the whole world, and this is the hand stretched out over all the nations,"},{"num":27,"verse":"Because the Lord of hosts hath determined, and who shall disannul it? and his hand is stretched out, and who shall turn it away?"},{"num":28,"verse":"¶ In the year that king Ahaz died, was this burden."},{"num":29,"verse":"Rejoice not, (thou whole Philistia) because the rod of him that did beat thee is broken: for out of the serpent’s root shall come forth a cockatrice, and the fruit thereof shall be a fiery flying serpent."},{"num":30,"verse":"For the first born of the poor shall be fed, and the needy shall lie down in safety: and I will kill thy root with famine, and it shall slay thy remnant."},{"num":31,"verse":"Howl, O gate, cry, O city: thou whole land of Philistia art dissolved, for there shall come from the North a smoke, and none shall be alone, at his time appointed."},{"num":32,"verse":"What shall then one answer the messengers of the Gentiles? that the Lord hath stablished Zion, and the poor of his people shall trust in it."}]