[{"num":16,"verse":"He came to Derbe and Lystra: and behold, a certain disciple was there, named Timothy, the son of a Jewess who believed; but his father was a Greek. "},{"num":2,"verse":"The brothers who were at Lystra and Iconium gave a good testimony about him. "},{"num":3,"verse":"Paul wanted to have him go out with him, and he took and circumcised him because of the Jews who were in those parts; for they all knew that his father was a Greek. "},{"num":4,"verse":"As they went on their way through the cities, they delivered the decrees to them to keep which had been ordained by the apostles and elders who were at Jerusalem. "},{"num":5,"verse":"So the assemblies were strengthened in the faith, and increased in number daily."},{"num":6,"verse":"When they had gone through the region of Phrygia and Galatia, they were forbidden by the Holy Spirit to speak the word in Asia. "},{"num":7,"verse":"When they had come opposite Mysia, they tried to go into Bithynia, but the Spirit didn’t allow them. "},{"num":8,"verse":"Passing by Mysia, they came down to Troas. "},{"num":9,"verse":"A vision appeared to Paul in the night. There was a man of Macedonia standing, begging him, and saying, “Come over into Macedonia and help us.” "},{"num":10,"verse":"When he had seen the vision, immediately we sought to go out to Macedonia, concluding that the Lord had called us to preach the Good News to them. "},{"num":11,"verse":"Setting sail therefore from Troas, we made a straight course to Samothrace, and the day following to Neapolis; "},{"num":12,"verse":"and from there to Philippi, which is a city of Macedonia, the foremost of the district, a Roman colony. We were staying some days in this city."},{"num":13,"verse":"On the Sabbath day we went outside of the city by a riverside, where we supposed there was a place of prayer, and we sat down and spoke to the women who had come together. "},{"num":14,"verse":"A certain woman named Lydia, a seller of purple, of the city of Thyatira, one who worshiped God, heard us. The Lord opened her heart to listen to the things which were spoken by Paul. "},{"num":15,"verse":"When she and her household were baptized, she begged us, saying, “If you have judged me to be faithful to the Lord, come into my house and stay.” So she persuaded us."},{"num":16,"verse":"As we were going to prayer, a certain girl having a spirit of divination met us, who brought her masters much gain by fortune telling. "},{"num":17,"verse":"Following Paul and us, she cried out, “These men are servants of the Most High God, who proclaim to us a way of salvation!” "},{"num":18,"verse":"She was doing this for many days."},{"num":19,"verse":"But when her masters saw that the hope of their gain was gone, they seized Paul and Silas, and dragged them into the marketplace before the rulers. "},{"num":20,"verse":"When they had brought them to the magistrates, they said, “These men, being Jews, are agitating our city "},{"num":21,"verse":"and advocate customs which it is not lawful for us to accept or to observe, being Romans.”"},{"num":22,"verse":"The multitude rose up together against them and the magistrates tore their clothes from them, then commanded them to be beaten with rods. "},{"num":23,"verse":"When they had laid many stripes on them, they threw them into prison, charging the jailer to keep them safely, "},{"num":24,"verse":"who, having received such a command, threw them into the inner prison, and secured their feet in the stocks."},{"num":25,"verse":"But about midnight Paul and Silas were praying and singing hymns to God, and the prisoners were listening to them. "},{"num":26,"verse":"Suddenly there was a great earthquake, so that the foundations of the prison were shaken; and immediately all the doors were opened, and everyone’s bonds were loosened. "},{"num":27,"verse":"The jailer, being roused out of sleep and seeing the prison doors open, drew his sword and was about to kill himself, supposing that the prisoners had escaped. "},{"num":28,"verse":"But Paul cried with a loud voice, saying, “Don’t harm yourself, for we are all here!”"},{"num":29,"verse":"He called for lights, sprang in, fell down trembling before Paul and Silas, "},{"num":30,"verse":"brought them out, and said, “Sirs, what must I do to be saved?”"},{"num":31,"verse":"They said, “Believe in the Lord Jesus Christ, and you will be saved, you and your household.” "},{"num":32,"verse":"They spoke the word of the Lord to him, and to all who were in his house."},{"num":33,"verse":"He took them the same hour of the night and washed their stripes, and was immediately baptized, he and all his household. "},{"num":34,"verse":"He brought them up into his house, and set food before them, and rejoiced greatly, with all his household, having believed in God."},{"num":35,"verse":"But when it was day, the magistrates sent the sergeants, saying, “Let those men go.”"},{"num":36,"verse":"The jailer reported these words to Paul, saying, “The magistrates have sent to let you go; now therefore come out and go in peace.”"},{"num":37,"verse":"But Paul said to them, “They have beaten us publicly without a trial, men who are Romans, and have cast us into prison! Do they now release us secretly? No, most certainly, but let them come themselves and bring us out!”"},{"num":38,"verse":"The sergeants reported these words to the magistrates, and they were afraid when they heard that they were Romans, "},{"num":39,"verse":"and they came and begged them. When they had brought them out, they asked them to depart from the city. "},{"num":40,"verse":"They went out of the prison, and entered into Lydia’s house. When they had seen the brothers, they encouraged them, then departed."}]