[{"num":4,"verse":"The sons of Judah were Pharez (The sons of Judah were Perez), and Hezron, and Carmi, and Hur, and Shobal."},{"num":2,"verse":"And Reaiah, the son of Shobal, begat Jahath; of whom were born Ahumai, and Lahad. These were the kindreds of Zorathites."},{"num":3,"verse":"And this is the generation of Etam (And these be the descendants of Etam); Jezreel, Ishma, and Idbash; and the name of the sister of them was Hazelelponi."},{"num":4,"verse":"And Penuel was the father of Gedor, and Ezer was the father of Hushah; these be the sons of Hur, the first begotten son of Ephratah, the father of Bethlehem."},{"num":5,"verse":"And Ashhur, the father of Tekoa, had two wives, Helah, and Naarah;"},{"num":6,"verse":"and Naarah childed to him Ahuzam, and Hepher, and Temeni, and Haahashtari; these be the sons of Naarah."},{"num":7,"verse":"And the sons of Helah were Zereth, Jezoar, and Ethnan."},{"num":8,"verse":"And Coz begat Anub, and Zobebah, and the kindreds of Aharhel, the son of Harum."},{"num":9,"verse":"And Jabez was noble before all his brethren; and his mother called his name Jabez, and said, For I childed him in sorrow. (And Jabez was more respected than all his brothers; and his mother called him Jabez, or He who maketh sorrow, saying, For I gave birth to him in pain.)"},{"num":10,"verse":"And Jabez called inwardly (to the) God of Israel, and said, If thou blessing shalt bless me, and shalt enlarge my terms, and if thine hand shall be with me, and thou shalt make me to be not oppressed of malice. And God gave to him that thing, that he prayed. (And Jabez inwardly called on the God of Israel, and said, If thou blessing shalt bless me, and shalt enlarge my borders, and thy hand shall be with me, and thou shalt keep me from being oppressed by malice, I shall be blessed indeed. And God gave him what he prayed for.)"},{"num":11,"verse":"And Chelub, the brother of Shuah, begat Mehir, that was the father of Eshton;"},{"num":12,"verse":"and Eshton begat Bethrapha, and Paseah, and Tehinnah, the father of the city [of] Nahash (the founder of Irnahash). These be the sons of Rechah."},{"num":13,"verse":"And the sons of Kenaz were Othniel, and Seraiah. And the sons of Othniel were Hathath,"},{"num":14,"verse":"and Meonothai, that begat Ophrah. And Seraiah begat Joab, the father of the valley of craftsmen; for they were craftsmen. (and Meonothai, who begat Ophrah. And Seraiah begat Joab, the founder of the Valley of Charashim, or the Ge-harashim Valley; for the people there were craftsmen.)"},{"num":15,"verse":"And the sons of Caleb, the son of Jephunneh, were Iru, and Elah, and Naam. And the sons of Elah were Kenaz (And the son of Elah was Kenaz)."},{"num":16,"verse":"Also the sons of Jehaleleel were Ziph, and Ziphah, Tiria, and Asareel."},{"num":17,"verse":"And the sons of Ezra were Jether, and Mered, and Epher, and Jalon; and he begat Marie, and Shammai, and Ishbah, the father of Eshtemoa."},{"num":18,"verse":"Also Jehudijah, his wife, childed Jered, the father of Gedor; and Heber, the father of Socho; and Jekuthiel, the father of Zanoah. And these were the sons of Bithiah, the daughter of Pharaoh, whom Mered took to wife."},{"num":19,"verse":"And the sons of the wife of Hodiah, the sister of Naham, father of Keilah, were (the) Garmite, and Eshtemoa, that was of Maachathites. (And the sons of Hodiah and his wife, Naham’s sister, were Daliah the father of Keilah the Garmite, and Eshtemoa the Maachathite.)"},{"num":20,"verse":"Also the sons of Shimon were Amnon, and Rinnah; the son of Hanan was Tilon (And the sons of Shimon were Amnon, and Rinnah, and Benhanan, and Tilon); and the sons of Ishi were Zoheth, and Benzoheth."},{"num":21,"verse":"The sons of Shelah, the son of Judah, were Er, the father of Lecah, and Laadah, the father of Mareshah; and these were the kindreds of the house of men working bis, in the house of an oath (and these were the families of the house of those who made fine linen, of the house of Ashbea/at Beth-ashbea),"},{"num":22,"verse":"and which made the sun to stand, and the men of lying, secure, and going, that were princes in Moab, and that turned again into Bethlehem; and these be [the] old words. (and Jokim, and the men of Chozeba, and Joash, and Saraph, who were the leaders in Moab, and Jashubilehem; and these be the old words.)"},{"num":23,"verse":"These be (the) potters dwelling in plantings, and in hedges, with kings in their works; and they dwelled there. (These be the potters, and those living among plants and hedges; and they lived there with the king, to be in his service./These be the potters, living in Netaim and Gederah; and they lived there, and worked for the king.)"},{"num":24,"verse":"The sons of Simeon were Nemuel, and Jamin, Jarib, Zerah, (and) Saul;"},{"num":25,"verse":"Shallum was his son; Mibsam was his son; Mishma was his son."},{"num":26,"verse":"The sons of Mishma; Hamuel, his son; and Zacchur, his son; [and] Shimei, his son."},{"num":27,"verse":"The sons of Shimei were sixteen, and six daughters; soothly his brethren had not many sons, and all the kindred might not be even to the sum of the sons of Judah. (And Shimei had sixteen sons, and six daughters; but his brothers did not have many children, and so all the kindred of Simeon was not equal to the number of people in the tribe of Judah.)"},{"num":28,"verse":"And they dwelled in Beersheba (And they lived in Beersheba), and in Moladah, and in Hazarshual,"},{"num":29,"verse":"and in Bilhah, and in Ezem, and in Tolad,"},{"num":30,"verse":"and in Bethuel, and in Hormah, and in Ziklag,"},{"num":31,"verse":"and in Bethmarcaboth, and in Hazarsusim, and in Bethbirei, and in Shaaraim; these were the cities of them, unto the time of king David."},{"num":32,"verse":"Also the towns of them were Etam, and Ain, and Rimmon, and Tochen, and Ashan; five cities."},{"num":33,"verse":"And all the villages of them by the compass of these cities, till to Baal; this is the dwelling of them, and the parting of their cities. (And all their villages around these cities, unto Baal; these be their dwelling places, and the division of their cities.)"},{"num":34,"verse":"Also Meshobab, and Jamlech, and Joshah, the son of Amaziah,"},{"num":35,"verse":"and Joel, and Jehu, the son of Josibiah, and the sons of Seraiah, the sons of Asiel, (and Joel, and Jehu, the son of Josibiah, the son of Seraiah, the son of Asiel,)"},{"num":36,"verse":"and Elioenai, and Jaakobah, and Jeshohaiah, and Asaiah, and Adiel, and Jesimiel, and Benaiah;"},{"num":37,"verse":"and Ziza, the son of Shiphi, the son of Allon, the son of Jedaiah, the son of Shimri, the son of Shemaiah."},{"num":38,"verse":"These be [the] princes named in their kindreds, and be multiplied greatly in the house of their allies. (These were the princes, or the leaders, named in their kindreds; and the house of their forefathers had greatly multiplied.)"},{"num":39,"verse":"And they went forth to enter into Gedor, unto the east of the valley, and to seek pastures to their sheep. (And they went forth unto the entrance of Gedor, east of the valley, to seek pastures for their sheep.)"},{"num":40,"verse":"And they found pastures full plenteous, and full good, and a full large land, and restful, and plenteous, wherein men of the generation of Ham had dwelled before. (And they found plentiful, and good pastures, and a very large, and restful, and plentiful land, where Ham’s descendants had lived before.)"},{"num":41,"verse":"Therefore these men, which we have described before by name, came in the days of Hezekiah, king of Judah; and smote the tabernacles of them, and the dwellers that were found there; and they destroyed them unto this present day; and they dwelled for them, for they found there full plenteous pastures. (And so these men, whom we have described above by name, came in the days of Hezekiah, the king of Judah; and struck the tents, or the camps, of those who they found there, and also the Meunites, and no trace remaineth of them, unto this present day; and they lived in their place, for they found plentiful pastures there.)"},{"num":42,"verse":"Also five hundred men of the sons of Simeon went in to the hill of Seir, and they had (for) princes Pelatiah, and Neariah, and Rephaiah, and Uzziel, the sons of Ishi; (And five hundred men of the sons of Simeon went to the hill country of Seir, and they had for leaders Pelatiah, and Neariah, and Rephaiah, and Uzziel, the sons of Ishi;)"},{"num":43,"verse":"and they smote the remnants of Amalekites, that might escape; and they dwelled there for them unto this day. (and they struck down the remnants of the Amalekites, who had escaped; and they have lived there in their place unto this day.)"}]