[[],[{"type":"prose","content":"Now when Jesus had finished instructing his twelve disciples, he went on from there to teach and proclaim his message in their cities."}],[{"type":"header","content":"Messengers from John the Baptist"},{"type":"prose","content":"When John heard in prison what the Messiah was doing, he sent word by his disciples "}],[{"type":"prose","content":"and said to him, “Are you the one who is to come, or are we to wait for another?” "}],[{"type":"prose","content":"Jesus answered them, “Go and tell John what you hear and see: "}],[{"type":"prose","content":"the blind receive their sight, the lame walk, the lepers are cleansed, the deaf hear, the dead are raised, and the poor have good news brought to them. "}],[{"type":"prose","content":"And blessed is anyone who takes no offense at me.”"}],[{"type":"header","content":"Jesus Praises John the Baptist"},{"type":"prose","content":"As they went away, Jesus began to speak to the crowds about John: “What did you go out into the wilderness to look at? A reed shaken by the wind? "}],[{"type":"prose","content":"What then did you go out to see? Someone dressed in soft robes? Look, those who wear soft robes are in royal palaces. "}],[{"type":"prose","content":"What then did you go out to see? A prophet? Yes, I tell you, and more than a prophet. "}],[{"type":"prose","content":"This is the one about whom it is written,"},{"type":"poetry","content":"‘See, I am sending my messenger ahead of you,"}],[{"type":"prose","content":"Truly I tell you, among those born of women no one has arisen greater than John the Baptist; yet the least in the kingdom of heaven is greater than he. "}],[{"type":"prose","content":"From the days of John the Baptist until now the kingdom of heaven has suffered violence, and the violent take it by force. "}],[{"type":"prose","content":"For all the prophets and the law prophesied until John came; "}],[{"type":"prose","content":"and if you are willing to accept it, he is Elijah who is to come. "}],[{"type":"prose","content":"Let anyone with ears listen!"}],[{"type":"prose","content":"“But to what will I compare this generation? It is like children sitting in the marketplaces and calling to one another,"}],[{"type":"poetry","content":"‘We played the flute for you, and you did not dance;"}],[{"type":"prose","content":"For John came neither eating nor drinking, and they say, ‘He has a demon’; "}],[{"type":"prose","content":"the Son of Man came eating and drinking, and they say, ‘Look, a glutton and a drunkard, a friend of tax collectors and sinners!’ Yet wisdom is vindicated by her deeds.”"}],[{"type":"header","content":"Woes to Unrepentant Cities"},{"type":"prose","content":"Then he began to reproach the cities in which most of his deeds of power had been done, because they did not repent. "}],[{"type":"prose","content":"“Woe to you, Chorazin! Woe to you, Bethsaida! For if the deeds of power done in you had been done in Tyre and Sidon, they would have repented long ago in sackcloth and ashes. "}],[{"type":"prose","content":"But I tell you, on the day of judgment it will be more tolerable for Tyre and Sidon than for you. "}],[{"type":"prose","content":"And you, Capernaum,"},{"type":"poetry","content":"will you be exalted to heaven?"},{"type":"prose","content":"For if the deeds of power done in you had been done in Sodom, it would have remained until this day. "}],[{"type":"prose","content":"But I tell you that on the day of judgment it will be more tolerable for the land of Sodom than for you.”"}],[{"type":"header","content":"Jesus Thanks His Father"},{"type":"prose","content":"At that time Jesus said, “I thank  you, Father, Lord of heaven and earth, because you have hidden these things from the wise and the intelligent and have revealed them to infants; "}],[{"type":"prose","content":"yes, Father, for such was your gracious will. "}],[{"type":"prose","content":"All things have been handed over to me by my Father; and no one knows the Son except the Father, and no one knows the Father except the Son and anyone to whom the Son chooses to reveal him."}],[{"type":"prose","content":"“Come to me, all you that are weary and are carrying heavy burdens, and I will give you rest. "}],[{"type":"prose","content":"Take my yoke upon you, and learn from me; for I am gentle and humble in heart, and you will find rest for your souls. "}],[{"type":"prose","content":"For my yoke is easy, and my burden is light.”"}]]