[[],[{"type":"prose","content":"And it came to pass, when Jesus ended directing his twelve disciples, he departed thence to teach and to preach in their cities."}],[{"type":"prose","content":"And John having heard in the prison the works of the Christ, having sent two of his disciples,"}],[{"type":"prose","content":"said to him, `Art thou He who is coming, or for another do we look?'"}],[{"type":"prose","content":"And Jesus answering said to them, `Having gone, declare to John the things that ye hear and see,"}],[{"type":"prose","content":"blind receive sight, and lame walk, lepers are cleansed, and deaf hear, dead are raised, and poor have good news proclaimed,"}],[{"type":"prose","content":"and happy is he who may not be stumbled in me.'"}],[{"type":"prose","content":"And as they are going, Jesus began to say to the multitudes concerning John, `What went ye out to the wilderness to view? -- a reed shaken by the wind?"}],[{"type":"prose","content":"`But what went ye out to see? -- a man clothed in soft garments? lo, those wearing the soft things are in the kings' houses."}],[{"type":"prose","content":"`But what went ye out to see? -- a prophet? yes, I say to you, and more than a prophet,"}],[{"type":"prose","content":"for this is he of whom it hath been written, Lo, I do send My messenger before thy face, who shall prepare thy way before thee."}],[{"type":"prose","content":"Verily I say to you, there hath not risen, among those born of women, a greater than John the Baptist, but he who is least in the reign of the heavens is greater than he."}],[{"type":"prose","content":"`And, from the days of John the Baptist till now, the reign of the heavens doth suffer violence, and violent men do take it by force,"}],[{"type":"prose","content":"for all the prophets and the law till John did prophesy,"}],[{"type":"prose","content":"and if ye are willing to receive [it], he is Elijah who was about to come;"}],[{"type":"prose","content":"he who is having ears to hear -- let him hear."}],[{"type":"prose","content":"`And to what shall I liken this generation? it is like little children in market-places, sitting and calling to their comrades,"}],[{"type":"prose","content":"and saying, We piped unto you, and ye did not dance, we lamented to you, and ye did not smite the breast."}],[{"type":"prose","content":"`For John came neither eating nor drinking, and they say, He hath a demon;"}],[{"type":"prose","content":"the Son of Man came eating and drinking, and they say, Lo, a man, a glutton, and a wine-drinker, a friend of tax-gatherers and sinners, and wisdom was justified of her children.'"}],[{"type":"prose","content":"Then began he to reproach the cities in which were done most of his mighty works, because they did not reform."}],[{"type":"prose","content":"`Wo to thee, Chorazin! wo to thee, Bethsaida! because, if in Tyre and Sidon had been done the mighty works that were done in you, long ago in sackcloth and ashes they had reformed;"}],[{"type":"prose","content":"but I say to you, to Tyre and Sidon it shall be more tolerable in a day of judgment than for you."}],[{"type":"prose","content":"`And thou, Capernaum, which unto the heaven wast exalted, unto hades shalt be brought down, because if in Sodom had been done the mighty works that were done in thee, it had remained unto this day;"}],[{"type":"prose","content":"but I say to you, to the land of Sodom it shall be more tolerable in a day of judgment than to thee.'"}],[{"type":"prose","content":"At that time Jesus answering said, `I do confess to Thee, Father, Lord of the heavens and of the earth, that thou didst hide these things from wise and understanding ones, and didst reveal them to babes."}],[{"type":"prose","content":"Yes, Father, because so it was good pleasure before Thee."}],[{"type":"prose","content":"`All things were delivered to me by my Father, and none doth know the Son, except the Father, nor doth any know the Father, except the Son, and he to whom the Son may wish to reveal [Him]."}],[{"type":"prose","content":"`Come unto me, all ye labouring and burdened ones, and I will give you rest,"}],[{"type":"prose","content":"take up my yoke upon you, and learn from me, because I am meek and humble in heart, and ye shall find rest to your souls,"}],[{"type":"prose","content":"for my yoke [is] easy, and my burden is light.'"}]]