[{"header":"While Teaching In Antioch, The Spirit Sends Saul And Barnabas On a Missionary Journey"},{"num":13,"verse":"Now there were prophets and teachers at Antioch in the church existing there— Barnabas and Simeon (the one being called Niger) and Lucius the Cyrenian, and Manaen (one brought-up-with Herod the tetrarch) and Saul. "},{"num":2,"verse":"And while they were ministering to the Lord and fasting, the Holy Spirit said, “Separate now Barnabas and Saul for Me, for the work which I have called them to”. "},{"num":3,"verse":"Then, having fasted and prayed and laid their hands on them, they sent them away."},{"header":"On Cyprus, Bar-Jesus The Magician Is Blinded, Sergius Paulus The Proconsul Believes"},{"num":4,"verse":"So indeed, having been sent-out by the Holy Spirit, they went down to Seleucia, and from there sailed-away to Cyprus. "},{"num":5,"verse":"And having come-to-be in Salamis, they were proclaiming the word of God in the synagogues of the Jews. And they also were having John as an assistant. "},{"num":6,"verse":"And having gone through the whole island as far as Paphos, they found a certain man who was a magician, a Jewish false-prophet for whom the name was Bar-Jesus— "},{"num":7,"verse":"who was with the proconsul, Sergius Paulus, an intelligent man. This one, having summoned Barnabas and Saul, sought to hear the word of God. "},{"num":8,"verse":"But the magician Elymas (for so his name is translated) was opposing them, seeking to turn away the proconsul from the faith. "},{"num":9,"verse":"But Saul (the one also called Paul), having been filled with the Holy Spirit, having looked-intently at him, "},{"num":10,"verse":"said “O son of the devil full of all deceit and all villainy, enemy of all righteousness, will you not cease perverting the straight ways of the Lord? "},{"num":11,"verse":"And now, behold— the hand of the Lord is upon you and you shall be blind, not seeing the sun for a time”. And at-once mistiness and darkness fell upon him. And going around, he was seeking ones-leading-by-the-hand. "},{"num":12,"verse":"Then the proconsul, having seen the thing having taken place, believed, being astounded at the teaching of the Lord."},{"header":"In Perga John Mark Leaves. Paul And Barnabas Go On To Pisidian Antioch"},{"num":13,"verse":"And having put-to-sea from Paphos, the ones around Paul came to Perga of Pamphylia. But John, having departed from them, returned to Jerusalem. "},{"num":14,"verse":"But they, having gone through from Perga, arrived at Pisidian Antioch. And having entered into the synagogue on the day of the Sabbath, they sat-down. "},{"num":15,"verse":"And after the reading of the Law and the Prophets, the synagogue-officials sent forth a message to them, saying, “Men, brothers, if there is any word of exhortation among you for the people, speak”."},{"header":"Paul Proclaims That John Announced The Coming of The Davidic Savior, Jesus"},{"num":16,"verse":"And Paul, having stood up, and having motioned with his hand, said “Men, Israelites, and the ones fearing God: listen. "},{"num":17,"verse":"The God of this people Israel chose our fathers. And He lifted-up the people during the stay in the land of Egypt, and with an uplifted arm led them out of it. "},{"num":18,"verse":"And for about a forty year period He put-up-with them in the wilderness. "},{"num":19,"verse":"And having brought-down seven nations in the land of Canaan, He gave them their land as-an-inheritance "},{"num":20,"verse":"about in [a total of] four-hundred and fifty years. And after these things He gave them judges until Samuel the prophet. "},{"num":21,"verse":"And from there they asked-for a king. And God gave them Saul— the son of Kish, a man from the tribe of Benjamin— for forty years. "},{"num":22,"verse":"And having removed him, He raised-up David for them for a king— concerning whom also having testified, He said, ‘I found David the son of Jesse, a man in-accordance-with My heart, who will do all My desires’. "},{"num":23,"verse":"From the seed of this one, in accordance with the promise, God brought a Savior for Israel, Jesus— "},{"num":24,"verse":"John having publicly-proclaimed a baptism of repentance for all the people of Israel before the presence of His coming. "},{"num":25,"verse":"And as John was completing his course, he was saying, ‘What do you suppose that I am? I am not the One. But behold— He is coming after me, of Whom I am not worthy to untie the sandal of His feet’."},{"header":"Fulfilling The Scriptures, The Rulers Killed Jesus And God Raised Him Up"},{"num":26,"verse":"“Men, brothers, sons of the family of Abraham, and the ones among you fearing God: the message of this salvation was sent-out to us. "},{"num":27,"verse":"For the ones dwelling in Jerusalem and their rulers, not having known this One and the voices of the prophets being read every Sabbath— having condemned Him, fulfilled them. "},{"num":28,"verse":"And having found no charge worthy of death, they asked Pilate that He be executed. "},{"num":29,"verse":"And when they fulfilled all the things having been written about Him, having taken Him down from the cross, they laid Him in a tomb. "},{"num":30,"verse":"But God raised Him from the dead— "},{"num":31,"verse":"Who appeared for many days to the ones having come up with Him from Galilee to Jerusalem, who now are His witnesses to the people. "},{"num":32,"verse":"And we are announcing-as-good-news-to you the promise having been made to the fathers— "},{"num":33,"verse":"that God has fulfilled this promise for us their children, having raised-up Jesus, as it has also been written in the second Psalm: ‘You are My Son. Today I have fathered You’ [Ps 2:7]. "},{"num":34,"verse":"And that He raised Him up from the dead as One no longer going to return to decay, He has spoken in this manner [in Isa 55:3]: that ‘I will give You the holy, trustworthy things of  David’. "},{"num":35,"verse":"Therefore also in another place it says, ‘You will not give Your holy One to see decay’ [Ps 16:10]. "},{"num":36,"verse":"For David, having served the purpose of God in his own generation, fell asleep and was put-with his fathers, and saw decay. "},{"num":37,"verse":"But He Whom God raised did not see decay."},{"header":"Forgiveness Is Now Being Proclaimed To You. Don’t Be Scoffers"},{"num":38,"verse":"“Therefore let it be known to you, men, brothers, that through this One forgiveness of sins is being proclaimed to you. And from all things from which you could not be declared-righteous by the Law of Moses— "},{"num":39,"verse":"by this One everyone believing is declared-righteous. "},{"num":40,"verse":"Therefore be watching-out that the thing having been spoken in the Prophets [in Hab 1:5] may not come upon you: "},{"num":41,"verse":"‘Look, scoffers, and marvel and perish. Because I am working a work in your days, a work which you will never believe if someone tells you in detail’”."},{"header":"At The Next Sabbath Meeting, The Jews Contradict Paul. He Turns To The Gentiles"},{"num":42,"verse":"And while they were going out, they were begging that these words might be spoken to them on the next Sabbath. "},{"num":43,"verse":"And the gathering having been released, many of the Jews and of the worshiping proselytes followed Paul and Barnabas— who, speaking to them, were persuading them to continue-in the grace of God. "},{"num":44,"verse":"Now on the coming Sabbath, almost the whole city was gathered together to hear the word of the Lord. "},{"num":45,"verse":"But the Jews, having seen the crowds, were filled with jealousy. And they were contradicting the things being spoken by Paul, blaspheming. "},{"num":46,"verse":"And Paul and Barnabas, having spoken-boldly, said, “It was necessary that the word of God be spoken to you first. Since you are rejecting it and judging yourselves not worthy of eternal life, behold— we are turning to the Gentiles. "},{"num":47,"verse":"For thus the Lord has commanded us [in Isa 49:6]: ‘I have placed you for a light to the Gentiles, that you may be a light for salvation as far as the last place of the earth’”. "},{"num":48,"verse":"And the Gentiles, having heard it, were rejoicing and glorifying the word of the Lord. And all who had been appointed to eternal life believed."},{"header":"The Jews Drive Paul And Barnabas Out of Their Districts"},{"num":49,"verse":"And the word of the Lord was being carried through the whole region. "},{"num":50,"verse":"But the Jews incited the prominent worshiping women and the leading men of the city, and aroused a persecution against Paul and Barnabas, and drove them out from their districts. "},{"num":51,"verse":"But the ones, having shaken-out the dust from their feet against them, went to Iconium. "},{"num":52,"verse":"And the disciples were being filled with joy and with the Holy Spirit."}]