[{"header":"Barnabas and Saul Travel to Cyprus"},{"num":13,"verse":"Now Barnabas, Simeon called Niger, Lucius from Cyrene, Manaen, who grew up with Herod the tetrarch, and Saul were prophets and teachers in the church at Antioch. "},{"num":2,"verse":"While they were worshiping the Lord and fasting, the Holy Spirit said, “Set Barnabas and Saul apart for me to do the work for which I called them.” "},{"num":3,"verse":"Then they fasted and prayed, laid their hands on them, and let them go. "},{"num":4,"verse":"After they had been sent out by the Holy Spirit, they went to Seleucia and from there sailed to Cyprus. "},{"num":5,"verse":"Arriving in Salamis, they began to preach God’s word in the Jewish synagogues. They also had John to help them."},{"num":6,"verse":"They went through the whole island as far as Paphos, where they found a Jewish occult practitioner and false prophet named Bar-jesus. "},{"num":7,"verse":"He was associated with the proconsul Sergius Paulus, who was an intelligent man. He sent for Barnabas and Saul because he wanted to hear the word of God. "},{"num":8,"verse":"But Elymas the occult practitioner (that is the meaning of his name) continued to oppose them and tried to turn the proconsul away from the faith. "},{"num":9,"verse":"But Saul, also known as Paul, filled with the Holy Spirit, looked him straight in the eye "},{"num":10,"verse":"and said, “You’re full of every form of deception and trickery, you son of the Devil, you enemy of all that is right! You’ll never stop perverting the straight ways of the Lord, will you? "},{"num":11,"verse":"The Lord is against you now, and you’ll be blind and unable to see the sun for a while!” At that moment a dark mist came over him, and he went around looking for someone to lead him by the hand. "},{"num":12,"verse":"When the proconsul saw what had happened, he believed, because he was astonished at the Lord’s teaching."},{"header":"Paul and Barnabas Go to Antioch in Pisidia"},{"num":13,"verse":"Then Paul and his men set sail from Paphos and arrived in Perga in Pamphylia, where John left them and went back to Jerusalem. "},{"num":14,"verse":"They left Perga and arrived in Antioch in Pisidia. On the Sabbath day, they went into the synagogue and sat down. "},{"num":15,"verse":"After the reading of the Law and the Prophets, the synagogue leaders asked them, “Brothers, if you have any message of encouragement for the people, you may speak.”"},{"num":16,"verse":"Then Paul stood up, motioned with his hand, and said:"},{"num":17,"verse":"The God of this people Israel chose our ancestors and made them a great people during their stay in the land of Egypt, and with a public display of power he led them out of there. "},{"num":18,"verse":"After he had put up with them for 40 years in the wilderness, "},{"num":19,"verse":"he destroyed seven nations in the land of Canaan. Then God gave their land to the Israelis as an inheritance "},{"num":20,"verse":"for about 450 years."},{"num":21,"verse":"When they demanded a king, God gave them Kish’s son Saul, from the tribe of Benjamin, for 40 years. "},{"num":22,"verse":"Then God removed Saul and made David their king, about whom he testified, ‘I have found that David, the son of Jesse, is a man after my own heart, who will carry out all my wishes.’ "},{"num":23,"verse":"It was from this man’s descendants that God, as he promised, brought to Israel a Savior, who is Jesus. "},{"num":24,"verse":"Before Jesus’ appearance, John had already preached a baptism of repentance to all the people in Israel. "},{"num":25,"verse":"When John was finishing his work, he said, ‘Who do you think I am? I’m not the Messiah. No, but he is coming after me, and I’m not worthy to untie the sandals on his feet.’"},{"num":26,"verse":"“My brothers, descendants of Abraham’s family, and those among you who fear God, it is to us that the message of this salvation has been sent. "},{"num":27,"verse":"For the people who live in Jerusalem and their leaders, not knowing who Jesus was, condemned him and so fulfilled the words of the prophets that are read every Sabbath. "},{"num":28,"verse":"Although they found no reason to sentence him to death, they asked Pilate to have him executed. "},{"num":29,"verse":"When they had finished doing everything that was written about him, they took him down from the tree and placed him in a tomb. "},{"num":30,"verse":"But God raised him from the dead, "},{"num":31,"verse":"and for many days he appeared to those who had come with him to Jerusalem from Galilee. These are now his witnesses to the people. "},{"num":32,"verse":"We’re telling you the good news: What God promised our ancestors "},{"num":33,"verse":"he has fulfilled for us, their descendants, by raising Jesus. As it is written in the second Psalm, ‘You are my Son. Today I have become your Father.’ "},{"num":34,"verse":"God raised him from the dead, never to experience decay, as he said, ‘I’ll give you the holy promises made to David.’ "},{"num":35,"verse":"In another Psalm he says, ‘You will not let your Holy One experience decay.’ "},{"num":36,"verse":"Now David, after he had served God’s purpose in his own generation, died and was buried with his ancestors, and so he experienced decay. "},{"num":37,"verse":"However, the man whom God raised did not experience decay."},{"num":38,"verse":"“Therefore, brothers, you must understand that through him the forgiveness of sins is proclaimed to you, "},{"num":39,"verse":"and that everyone who believes in him is justified and freed from everything that kept you from being justified by the Law of Moses. "},{"num":40,"verse":"So be careful that what the prophets said doesn’t happen to you:"},{"num":42,"verse":"As Paul and Barnabas were leaving, the people kept urging them to tell them the same things the next Sabbath. "},{"num":43,"verse":"When the meeting of the synagogue broke up, many Jews and devout converts to Judaism followed Paul and Barnabas, who kept talking to them and urging them to continue in the grace of God."},{"num":44,"verse":"The next Sabbath almost the whole town gathered to hear the word of the Lord. "},{"num":45,"verse":"But when the Jewish leaders saw the crowds, they were filled with jealousy and began to object to the statements made by Paul and even to abuse him."},{"num":46,"verse":"Then Paul and Barnabas boldly declared, “We had to speak God’s word to you first, but since you reject it and consider yourselves unworthy of eternal life, we are now going to turn to the gentiles. "},{"num":47,"verse":"For that is what the Lord ordered us to do: ‘I have made you a light to the gentiles to be the means of salvation to the very ends of the earth.’”"},{"num":48,"verse":"When the gentiles heard this, they began rejoicing and glorifying the word of the Lord. Meanwhile, all who had been destined to eternal life believed, "},{"num":49,"verse":"and the word of the Lord began to spread throughout the whole region. "},{"num":50,"verse":"But the Jewish leaders stirred up devout women of high social standing and the officials in the city, started a persecution against Paul and Barnabas, and drove them out of their territory. "},{"num":51,"verse":"So Paul and Barnabas shook the dust off their feet in protest against them and went to Iconium. "},{"num":52,"verse":"Meanwhile, the disciples continued to be full of joy and the Holy Spirit."}]