[{"num":13,"verse":"Now de there  were eimi in en Antioch Antiocheia in kata the ho local eimi church ekklēsia prophets prophētēs and kai teachers didaskalos,  · ho both te Barnabas Barnabas and kai Simeon Symeōn who ho was  called kaleō Niger Niger,  · kai Lucius Loukios the ho Cyrenian Kyrēnaios,  and te Manaen Manaēn, the  foster-brother syntrophos of  Herod hērōdēs the ho tetrarch tetraarchēs,  and kai Saul Saulos. "},{"num":2,"verse":"While  they autos were  performing leitourgeō their  service  · de to  the ho Lord kyrios and kai fasting nēsteuō,  the ho Holy hagios Spirit pneuma said legō,  · ho “ Set aphorizō apart  for  me egō · ho Barnabas Barnabas and kai Saul Saulos for eis the ho work ergon to  which hos I  have  called proskaleō them autos.” "},{"num":3,"verse":"Then tote after  fasting nēsteuō and kai praying proseuchomai · kai they  laid epitithēmi their ho hands cheir on  them autos and  sent apolyō them  off . "},{"num":4,"verse":"So oun they autos,  being  sent ekpempō out  by hypo the ho Holy hagios Spirit pneuma,  went  down katerchomai to eis Seleucia Seleukeia,  and te from  there ekeithen they  sailed apopleō to eis Cyprus Kypros. "},{"num":5,"verse":"And kai when  they  arrived ginomai in en Salamis Salamis,  they  began  to  proclaim katangellō the ho word logos of ho God theos in en the ho synagogues synagōgē of  the ho Jews Ioudaios,  and de they  also kai had echō John Iōannēs as  their  assistant hypēretēs. "},{"num":6,"verse":"When  they  had  gone dierchomai through  · de the ho whole holos island nēsos as achri far  as  Paphos Paphos,  they  met heuriskō a  certain tis man anēr, a  magician magos, a  Jewish Ioudaios false pseudoprophētēs prophet  named hos onoma Bar-Jesus Bariēsous, "},{"num":7,"verse":"who hos was eimi with syn the ho proconsul anthypatos Sergius Sergios Paulus Paulos, an  intelligent synetos man anēr.  This houtos man  summoned proskaleō Barnabas Barnabas and kai Saul Saulos and  wanted epizēteō to  hear akouō the ho word logos of ho God theos. "},{"num":8,"verse":"But de Elymas Elymas the ho magician magos ( for gar that  is  the  way houtōs his autos name onoma is  translated methermēneuō)  · ho opposed anthistēmi them autos,  trying zēteō to  turn diastrephō the ho proconsul anthypatos away apo from  the ho faith pistis. "},{"num":9,"verse":"But de Saul Saulos,  who ho is  also kai Paul Paulos,  filled pimplēmi with  the  Holy hagios Spirit pneuma,  looked atenizō intently  at eis him autos"},{"num":10,"verse":"and  said legō, “ O ō man  full plērēs of  all pas kinds  of  deceit dolos and kai all pas fraud rhadiourgia,  son hyios of  the  devil diabolos,  enemy echthros of  all pas righteousness dikaiosynē,  will  you  not ou stop pauō making diastrephō crooked  the ho straight  paths hodos of  the ho Lord kyrios?  · ho"},{"num":11,"verse":"And kai now nyn,  behold idou, the  hand cheir of  the  Lord kyrios is  upon epi you sy,  and kai you  will  be eimi blind typhlos,  not mē seeing blepō the ho sun hēlios for achri a  time kairos.”  And te immediately parachrēma fell piptō upon epi him autos mist achlys and kai darkness skotos,  and kai as  he  went periagō about  he  sought zēteō someone  to  lead cheiragōgos him  by  the  hand . "},{"num":12,"verse":"Then tote the ho proconsul anthypatos believed pisteuō, when he saw  what ho had  occurred ginomai,  for  he  was  astonished ekplēssō at epi the ho teaching didachē of  the ho Lord kyrios. "},{"num":13,"verse":"Then de Paul Paulos and  those ho with peri him  put anagō out  to  sea  from apo · ho Paphos Paphos and  came erchomai to eis Perga Pergē of ho Pamphylia Pamphylia.  John Iōannēs,  however de,  left apochōreō them autos and  returned hypostrephō to eis Jerusalem Hierosolyma; "},{"num":14,"verse":"but de they autos went dierchomai on  from apo · ho Perga Pergē and  arrived paraginomai at eis Pisidian Pisidia Antioch Antiocheia.  · ho · kai On  the ho sabbath sabbaton day hēmera they  went erchomai into eis the ho synagogue synagōgē · ho and  sat kathizō down . "},{"num":15,"verse":"After meta · de the ho reading anagnōsis from  the ho Law nomos and kai the ho Prophets prophētēs,  the ho rulers  of  the  synagogue archisynagōgos sent apostellō a message  to pros them autos,  saying legō, “ My  brothers anēr,  if ei there  is eimi any tis among en you hymeis with a  word logos of  encouragement paraklēsis for pros the ho people laos,  say legō it.” "},{"num":16,"verse":"So de Paul Paulos stood anistēmi up ,  and kai gesturing kataseiō with  his ho hand cheir,  said legō, “ Men anēr of  Israel Israēlitēs and kai you  who ho fear phobeomai · ho God theos,  listen akouō: "},{"num":17,"verse":"The ho God theos of ho this houtos people laos Israel Israēl chose eklegomai · ho our hēmeis fathers patēr and kai made  the ho people laos great hypsoō during en their ho stay paroikia in en the  land gē of  Egypt Aigyptos;  then kai with meta uplifted hypsēlos arm brachiōn he  led exagō them autos out ek of  it autos. "},{"num":18,"verse":"And kai for chronos about hōs forty tesserakontaetēs years  he  put tropophoreō up  with  their autos ways  in en the ho wilderness erēmos. "},{"num":19,"verse":"· kai After  he  had  destroyed kathaireō seven hepta nations ethnos in en the  land gē of  Canaan Chanaan,  he  gave kataklēronomeō them  · ho their autos land gē as  an  inheritance . "},{"num":20,"verse":"All this took  about hōs four  hundred tetrakosioi fifty pentēkonta years etos.  · kai · kai After meta this houtos he  gave didōmi them  judges kritēs until heōs Samuel Samouēl the ho prophet prophētēs. "},{"num":21,"verse":"Then kakeithen they  asked aiteō for  a  king basileus,  and kai God theos gave didōmi them autos · ho · ho Saul Saoul,  son hyios of  Kish Kis, a  man anēr from ek the  tribe phylē of  Benjamin Beniamin, who ruled  forty tesserakonta years etos. "},{"num":22,"verse":"· kai After  removing methistēmi him autos,  he  raised egeirō up  · ho David Dauid to  be eis their autos king basileus,  of  whom hos · kai he  said legō by  way  of  testimony martyreō: ‘ I  have  found heuriskō in  David Dauid the ho son  of ho Jesse Iessai a  man anēr after kata · ho my egō heart kardia,  who hos will  do poieō everything pas · ho I egō want thelēma him to.’ "},{"num":23,"verse":"It was  from apo the ho offspring sperma of  this  man houtos that  · ho God theos according kata to  promise epangelia brought agō to ho Israel Israēl a  savior sōtēr,  Jesus Iēsous. "},{"num":24,"verse":"Before pro his autos coming eisodos John Iōannēs had  proclaimed prokēryssō · ho a  baptism baptisma of  repentance metanoia to  all pas the ho people laos of  Israel Israēl. "},{"num":25,"verse":"And de as hōs John Iōannēs was  completing plēroō his ho ministry dromos,  he  said legō repeatedly , ‘ What tis do  you  suppose hyponoeō me egō to  be eimi?  I egō am eimi not ou he.  But alla behold idou, one  is  coming erchomai after meta me egō of  whom hos I  am eimi not ou worthy axios to  untie lyō the ho sandals hypodēma for  his ho feet pous.’ "},{"num":26,"verse":"“ My  brothers anēr,  sons hyios of  the  family genos of  Abraham Abraam,  and kai those ho among en you hymeis who  fear phobeomai · ho God theos, it is  to  us hēmeis that  the ho message logos of ho this houtos salvation sōtēria has  been  sent exapostellō. "},{"num":27,"verse":"For gar those ho who  live katoikeō in en Jerusalem Ierousalēm and kai · ho their autos rulers archōn,  because  they  did  not  recognize agnoeō him houtos nor kai understand  the ho utterances phōnē of  the ho prophets prophētēs,  which ho are  read anaginōskō every pas Sabbath sabbaton,  fulfilled plēroō them  by  condemning krinō him. "},{"num":28,"verse":"And kai though  they  found heuriskō no mēdeis crime aitia deserving  death thanatos,  they  asked aiteō Pilate Pilatos to  have  him autos executed anaireō. "},{"num":29,"verse":"And de when hōs they  had  carried teleō out  everything pas that ho was  written graphō about peri him autos,  they  took kathaireō him  down  from apo the ho tree xylon and  laid tithēmi him  in eis a  tomb mnēmeion. "},{"num":30,"verse":"· ho But de God theos raised egeirō him autos from ek the  dead nekros, "},{"num":31,"verse":"and  he hos was  seen horaō for epi many polys days hēmera by  those ho who  had  gone synanabainō up  with  him autos from apo · ho Galilee Galilaia to eis Jerusalem Ierousalēm,  who hostis are eimi now nyn his autos witnesses martys to pros the ho people laos. "},{"num":32,"verse":"And kai we hēmeis are  telling  you hymeis the  good  news euangelizō regarding  the ho promise epangelia that  was  made ginomai to pros the ho fathers patēr, "},{"num":33,"verse":"that hoti God theos has  fulfilled ekplēroō this houtos · ho for  us hēmeis,  · ho their autos children teknon,  by  raising anistēmi Jesus Iēsous;  as hōs also kai in en the ho second deuteros Psalm psalmos it  is  written graphō,  · ho ‘ You sy are eimi my egō Son hyios;  today sēmeron I egō have  begotten gennaō you sy.’ "},{"num":34,"verse":"But de regarding the fact  that hoti he  has  raised anistēmi Jesus autos from ek the  dead nekros,  no mēketi more  about mellō to  return hypostrephō to eis corruption diaphthora,  thus houtōs he  said legō: ‘ I  will  give didōmi to  you hymeis the ho sacred hosios and  sure pistos promises made  to  David Dauid.’  · ho"},{"num":35,"verse":"So dioti also kai in en another heteros psalm  he  says legō, ‘ You  will  not ou let didōmi · ho your sy Holy hosios One  see  corruption diaphthora.’ "},{"num":36,"verse":"For gar David Dauid,  after  he  had  served hypēreteō the ho purpose boulē of ho God theos in  his  own idios generation genea,  fell koimaō asleep  and kai was  laid prostithēmi with pros · ho his autos fathers patēr and kai saw  corruption diaphthora, "},{"num":37,"verse":"but de he  whom hos · ho God theos raised egeirō up  did  not ou see  corruption diaphthora. "},{"num":38,"verse":"Therefore oun let  it  be eimi known gnōstos to  you hymeis,  my  brothers anēr,  that hoti through dia this houtos one  forgiveness aphesis of  sins hamartia is  being  proclaimed katangellō to  you hymeis;  and kai from apo all pas from  which hos you  could dynamai not ou be  set  free dikaioō by en the  law nomos of  Moses Mōysēs, "},{"num":39,"verse":"by en this houtos man  everyone pas who ho believes pisteuō is  set  free dikaioō. "},{"num":40,"verse":"Take blepō care  then oun that  what ho was  spoken legō in en the ho prophets prophētēs does eperchomai not mē happen eperchomai to you. "},{"num":41,"verse":"‘Look,  you ho scoffers kataphronētēs;  · kai be  amazed thaumazō and kai perish aphanizō!  For hoti I egō am  doing ergazomai a  work ergon in en · ho your hymeis days hēmera, a  work ergon that hos you  will  not ou mē believe pisteuō,  even ean though  someone tis should  tell ekdiēgeomai you hymeis in  detail .’” "},{"num":42,"verse":"As  they autos went out,  · de the people  begged parakaleō that  these houtos things rhēma be  discussed laleō with  them autos on eis the ho next metaxy Sabbath sabbaton.  · ho"},{"num":43,"verse":"And de after  the meeting  of  the ho synagogue synagōgē broke  up lyō,  many polys · ho Jews Ioudaios and kai · ho devout sebō converts prosēlytos followed akoloutheō · ho Paul Paulos and kai · ho Barnabas Barnabas,  who hostis,  as  they  spoke proslaleō with  them autos,  were  persuading peithō them autos to  continue prosmenō in  the ho grace charis of ho God theos. "},{"num":44,"verse":"On  the ho · de following erchomai Sabbath sabbaton almost schedon the ho whole pas city polis assembled synagō together  to  hear akouō the ho word logos of  the ho Lord kyrios. "},{"num":45,"verse":"But de when  the ho Jews Ioudaios saw  the ho crowds ochlos,  they  were  filled pimplēmi with  jealousy zēlos;  and kai blaspheming blasphēmeō,  they  began  to  contradict antilegō what ho was  being  said laleō by hypo Paul Paulos. "},{"num":46,"verse":"Both te Paul Paulos and kai Barnabas Barnabas spoke  boldly parrēsiazomai · ho · ho and  said legō, “ It  was eimi necessary anankaios that  the ho word logos of ho God theos be  spoken laleō first prōton to  you hymeis.  Since epeidē you  reject apōtheō it autos and kai do krinō not ou consider krinō yourselves heautou worthy axios of ho eternal aiōnios life zōē,  we  are  now  turning strephō to eis the ho Gentiles ethnos. "},{"num":47,"verse":"For gar thus houtōs the ho Lord kyrios has  commanded entellō us hēmeis: ‘ I  have  appointed tithēmi you sy to eis be  a  light phōs for  the  Gentiles ethnos,  to ho bring eimi salvation sōtēria to heōs the  ends eschatos of  the ho earth gē.’” "},{"num":48,"verse":"When  the ho Gentiles ethnos heard akouō · de this,  they  began  rejoicing chairō and kai glorifying doxazō the ho word logos of  the ho Lord kyrios,  and kai as hosos many  as  were eimi appointed tassō to eis eternal aiōnios life zōē believed pisteuō. "},{"num":49,"verse":"So de the ho word logos of  the ho Lord kyrios was  being  spread diapherō throughout dia the ho whole holos region chōra. "},{"num":50,"verse":"But de the ho Jews Ioudaios incited parotrynō the ho devout sebō women gynē of ho honorable euschēmōn rank  and kai the ho leading prōtos men  of  the ho city polis,  and kai they  stirred epegeirō up  persecution diōgmos against epi · ho Paul Paulos and kai Barnabas Barnabas,  and kai drove ekballō them autos out  of apo · ho their autos district horion. "},{"num":51,"verse":"So de they ho shook ektinassō off  the ho dust koniortos from  their ho feet pous against epi them autos and  went erchomai on  to eis Iconium Ikonion. "},{"num":52,"verse":"And te the ho disciples mathētēs were  filled plēroō with  joy chara and kai with  the  Holy hagios Spirit pneuma. "}]