[{"header":"Saul and Barnabas Are Called to Be Missionaries"},{"num":13,"verse":"In the church in the city of Antioch there were preachers and teachers. They were Barnabas, Simeon Niger, Lucius of the country of Cyrene, Manaen of Herod’s family, and Saul. "},{"num":2,"verse":"While they were worshiping the Lord and eating no food so they could pray better, the Holy Spirit said, “Let Barnabas and Saul be given to Me for the work I have called them to.”"},{"header":"Paul and Barnabas Go to Antioch"},{"num":3,"verse":"These preachers and teachers went without food during that time and prayed. Then they laid their hands on Barnabas and Saul and sent them away. "},{"num":4,"verse":"They were sent by the Holy Spirit to the city of Seleucia. From there they went by ship to the island of Cyprus. "},{"num":5,"verse":"When they went to shore at the city of Salamis, they preached the Word of God in the Jewish place of worship. John Mark was with them as their helper."},{"num":6,"verse":"They went over Cyprus as far as the city of Paphos. While there, they found a Jew who did witchcraft. He was a false preacher named Barjesus. "},{"num":7,"verse":"Sergius Paulus was the leader of the country and a man who knew much. Barjesus was with Sergius Paulus. Sergius Paulus asked Barnabas and Saul to come to him so he might hear the Word of God. "},{"num":8,"verse":"But Elymas (as he called himself), the man who did witchcraft, worked against Barnabas and Saul. He tried to keep the leader of the country from putting his trust in the Lord."},{"num":9,"verse":"Saul, whose other name was Paul, was full of the Holy Spirit. He looked at Elymas. "},{"num":10,"verse":"Then Saul said, “You false preacher and trouble-maker! You son of the devil! You hate what is right! Will you always be turning people from the right ways of the Lord? "},{"num":11,"verse":"And now look! The hand of the Lord is on you. You will become blind. For a time you will not be able to see the sun.” At once it became dark to Elymas, and he could not see. He asked people to take him by the hand to lead him from place to place."},{"num":12,"verse":"The leader of the country put his trust in the Lord because he saw what had happened. He was surprised and wondered about the teaching of the Lord. "},{"num":13,"verse":"Paul and those with him went by ship from Paphos to the city of Perga in the country of Pamphylia. John Mark did not go with them but went back to Jerusalem."},{"header":"Paul Preaches in Antioch"},{"num":14,"verse":"From Perga they went on to the city of Antioch in the country of Pisidia. On the Day of Rest they went into the Jewish place of worship and sat down. "},{"num":15,"verse":"After the leaders had read from the Jewish Law and the writings of the early preachers, they sent to them saying, “Brothers, if you have any word of comfort and help for the people, say it now.” "},{"num":16,"verse":"Paul got up. He raised his hand and said, “Jewish men and you who honor God, listen! "},{"num":17,"verse":"The God of the Jews chose our early fathers and made them a great people during the time they lived in the land of Egypt. With a strong hand He took them out from there. "},{"num":18,"verse":"For about forty years He took care of them in the desert. "},{"num":19,"verse":"He destroyed the people of seven nations in the land of Canaan. Then He divided the land and gave it to them as their own. "},{"num":20,"verse":"For about 450 years He let them have special leaders. They had these leaders until the time of Samuel."},{"num":21,"verse":"“Then they wanted a king. God gave them Saul who was the son of Kish from the family group of Benjamin. He was king forty years. "},{"num":22,"verse":"When God took Saul as king from them, He made David to be their king. He said, ‘David, Jesse’s son, will please My heart. He will do all I want done.’"},{"num":23,"verse":"“From this man’s family, God gave to the Jews the One Who saves from the punishment of sin as He had promised. He is Jesus. "},{"num":24,"verse":"Before Jesus came, John had preached to all the Jews that they should be baptized because they were sorry for their sins and turned from them. "},{"num":25,"verse":"When John was near the end of his work, he asked, ‘Who do you think I am? I am not the Christ. No, but He is coming later and I am not good enough to get down and help Him take off His shoes!’"},{"num":26,"verse":"“Men and brothers, sons of the family of Abraham, and all of you who honor God, listen! This news of being able to be saved from the punishment of sin has been sent to you. "},{"num":27,"verse":"The people of Jerusalem and their leaders did not know Him. They did not understand the words from the early preachers. These words were read to them every Day of Rest. But they did the very thing the early preachers had said they would do by handing Him over to die. "},{"num":28,"verse":"They could find no reason that He should die, but they asked Pilate to have Him killed. "},{"num":29,"verse":"When everything was done that had been written about Him, they took Him down from the cross and laid Him in a grave. "},{"num":30,"verse":"But God raised Him from the dead. "},{"num":31,"verse":"For many days He was seen by those who came up with Him from Galilee to Jerusalem. These are the ones who tell the people about Him."},{"num":32,"verse":"“We bring you the Good News about the promise made to our early fathers. "},{"num":33,"verse":"God has finished this for us who are their children. He did this by raising Jesus from the dead. It is written in the second Psalm, ‘You are My Son. Today I have become Your Father.’  "},{"num":34,"verse":"God proved that Jesus was His Son by raising Him from the dead. He will never die again. He has said, ‘I will complete the promises made to David.’ "},{"num":35,"verse":"“In another Psalm He says, ‘You will not allow Your Holy One to go back to dust!’  "},{"num":36,"verse":"David was a good leader for the people of his day. He did what God wanted. Then he died and was put into a grave close to his father’s grave. His body went back to dust. "},{"num":37,"verse":"But God raised this One (Christ) to life. He did not go back to dust."},{"num":38,"verse":"“Men and brothers, listen to this. You may be forgiven of your sins by this One I am telling you about. "},{"num":39,"verse":"Everyone who puts his trust in Christ will be made right with God. You will be made free from those things the Law of Moses could not make you free from. "},{"num":40,"verse":"But look out! The writings of the early preachers tell of many things that you do not want to happen to you. "},{"num":41,"verse":"‘Listen, you who doubt and laugh at the truth will die. I will do a work during your days. It will be a work that you will not believe even if someone tells you about it.’” "},{"num":42,"verse":"As Paul and Barnabas went out of the Jewish place of worship, the people asked them to talk about these things on the next Day of Rest. "},{"num":43,"verse":"The people went from the place of worship. Many Jews and others who had become Jews followed Paul and Barnabas as they talked to the Jews. They told them to keep on trusting in the loving-favor of God."},{"header":"Paul and Barnabas Go to the People Who Are Not Jews"},{"num":44,"verse":"Almost all of the people of the town came to hear the Word of God on the next Day of Rest. "},{"num":45,"verse":"The Jews were filled with jealousy when they saw so many people. They spoke against the things Paul said by saying he was wrong. They also spoke against God. "},{"num":46,"verse":"Paul and Barnabas said to the people in plain words, “We must preach the Word of God to you first. But because you put it aside, you are not good enough for life that lasts forever. So we will go to the people who are not Jews. "},{"num":47,"verse":"The Lord gave us a work to do. He said, ‘You are to be a light to the people who are not Jews. You are to preach so that men over all the earth can be saved from the punishment of their sins.’” "},{"num":48,"verse":"The people who were not Jews were glad when they heard this. They were thankful for the Word of God. Those who were chosen for life that lasts forever believed. "},{"num":49,"verse":"The Word of God was preached over all that land."},{"num":50,"verse":"The Jews worked on the feelings of the women who were religious and respected. They worked on the leading men of the city also. They worked against Paul and Barnabas and made them leave their city. "},{"num":51,"verse":"But Paul and Barnabas shook the dust off from their feet against them and went to the city of Iconium. "},{"num":52,"verse":"The missionaries were filled with joy and with the Holy Spirit."}]