[{"header":"King Joahaz of Judah(A)"},{"num":36,"verse":"The people of Judah chose Josiah's son Joahaz and anointed him king in Jerusalem. "},{"num":2,"verse":"Joahaz was twenty-three years old when he became king of Judah, and he ruled in Jerusalem for three months. "},{"num":3,"verse":"King Neco of Egypt took him prisoner and made Judah pay 7,500 pounds of silver and 75 pounds of gold as tribute. "},{"num":4,"verse":"Neco made Joahaz' brother Eliakim king of Judah and changed his name to Jehoiakim. Joahaz was taken to Egypt by Neco."},{"header":"King Jehoiakim of Judah(C)"},{"num":5,"verse":"Jehoiakim was twenty-five years old when he became king of Judah, and he ruled in Jerusalem for eleven years. He sinned against the Lord his God. "},{"num":6,"verse":"King Nebuchadnezzar of Babylonia invaded Judah, captured Jehoiakim, and took him to Babylonia in chains. "},{"num":7,"verse":"Nebuchadnezzar carried off some of the treasures of the Temple and put them in his palace in Babylon. "},{"num":8,"verse":"Everything that Jehoiakim did, including his disgusting practices and the evil he committed, is recorded in The History of the Kings of Israel and Judah. His son Jehoiachin succeeded him as king."},{"header":"King Jehoiachin of Judah(F)"},{"num":9,"verse":"Jehoiachin was eighteen years old when he became king of Judah, and he ruled in Jerusalem for three months and ten days. He too sinned against the Lord. "},{"num":10,"verse":"When spring came, King Nebuchadnezzar took Jehoiachin to Babylonia as a prisoner and carried off the treasures of the Temple. Then Nebuchadnezzar made Jehoiachin's uncle Zedekiah king of Judah and Jerusalem."},{"header":"King Zedekiah of Judah(H)"},{"num":11,"verse":"Zedekiah was twenty-one years old when he became king of Judah, and he ruled in Jerusalem for eleven years. "},{"num":12,"verse":"He sinned against the Lord and did not listen humbly to the prophet Jeremiah, who spoke the word of the Lord."},{"header":"The Fall of Jerusalem(J)"},{"num":13,"verse":"Zedekiah rebelled against King Nebuchadnezzar, who had forced him to swear in God's name that he would be loyal. He stubbornly refused to repent and return to the Lord, the God of Israel. "},{"num":14,"verse":"In addition, the leaders of Judah, the priests, and the people followed the sinful example of the nations around them in worshiping idols, and so they defiled the Temple, which the Lord himself had made holy. "},{"num":15,"verse":"The Lord, the God of their ancestors, had continued to send prophets to warn his people, because he wanted to spare them and the Temple. "},{"num":16,"verse":"But they made fun of God's messengers, ignoring his words and laughing at his prophets, until at last the Lord's anger against his people was so great that there was no escape."},{"num":17,"verse":"So the Lord brought the king of Babylonia to attack them. The king killed the young men of Judah even in the Temple. He had no mercy on anyone, young or old, man or woman, sick or healthy. God handed them all over to him. "},{"num":18,"verse":"The king of Babylonia looted the Temple, the Temple treasury, and the wealth of the king and his officials, and took everything back to Babylon. "},{"num":19,"verse":"He burned down the Temple and the city, with all its palaces and its wealth, and broke down the city wall. "},{"num":20,"verse":"He took all the survivors to Babylonia, where they served him and his descendants as slaves until the rise of the Persian Empire. "},{"num":21,"verse":"And so what the Lord had foretold through the prophet Jeremiah was fulfilled: “The land will lie desolate for seventy years, to make up for the Sabbath rest that has not been observed.”"},{"header":"Cyrus Commands the Jews to Return(O)"},{"num":22,"verse":"In the first year that Cyrus of Persia was emperor, the Lord made what he had said through the prophet Jeremiah come true. He prompted Cyrus to issue the following command and send it out in writing to be read aloud everywhere in his empire:"},{"num":23,"verse":"“This is the command of Cyrus, Emperor of Persia. The Lord, the God of Heaven, has made me ruler over the whole world and has given me the responsibility of building a temple for him in Jerusalem in Judah. Now, all of you who are God's people, go there, and may the Lord your God be with you.”"}]