[{"num":36,"verse":"Therefore the people of the land took Jehoahaz, the son of Josiah, and ordained him king for his father in Jerusalem. (And so the people of the land took Jehoahaz, Josiah’s son, and made him king in place of his father in Jerusalem.)"},{"num":2,"verse":"Jehoahaz was of three and twenty years, when he began to reign, and he reigned three months in Jerusalem."},{"num":3,"verse":"And when the king of Egypt had come to Jerusalem, he removed him, and he condemned the land in an hundred talents of silver and in a talent of gold. (And when the king of Egypt came to Jerusalem, he removed Jehoahaz, and made the people of the land pay him, the king of Egypt, tribute, or taxes, of a hundred talents of silver, and a talent of gold.)"},{"num":4,"verse":"And he ordained for him Eliakim, his brother, (to be) king upon Judah and Jerusalem; and he turned his name (and he changed his name), and called him Jehoiakim. And he took that Jehoahaz (back) with himself, and he brought him into Egypt."},{"num":5,"verse":"Jehoiakim was of five and twenty years, when he began to reign, and he reigned eleven years in Jerusalem, and he did evil before the Lord his God."},{"num":6,"verse":"And Nebuchadnezzar, king of Chaldees (the king of the Chaldeans, that is, the king of Babylon), went up against this Jehoiakim, and he led him bound with chains into Babylon."},{"num":7,"verse":"To which Babylon he translated also the vessels of the house of the Lord, and he set those in his temple. (And he also carried away the vessels of the House of the Lord, and he put them in his temple in Babylon.)"},{"num":8,"verse":"Soothly the residue of [the] words of Jehoiakim (And the rest of the deeds of Jehoiakim), and of his abominations which he wrought, and which were found in him, be contained in the book of [the] kings of Israel and of Judah. And Jehoiachin, his son, reigned for him."},{"num":9,"verse":"Jehoiachin was of eight years (Jehoiachin was eighteen years old), when he began to reign, and he reigned three months and ten days in Jerusalem, and he did evil in the sight of the Lord."},{"num":10,"verse":"And when the circle of the year was turned about, Nebuchadnezzar the king sent men, which also brought him into Babylon, when the most precious vessels of the house of the Lord were borne out together (And at the turn of the year, King Nebuchadnezzar sent men to Jerusalem, who brought Jehoiachin back to Babylon, and the most precious vessels, from the House of the Lord, were brought back with him). And Nebuchadnezzar ordained Zedekiah, his father’s brother, king upon Judah and Jerusalem."},{"num":11,"verse":"Zedekiah was of one and twenty years, when he began to reign, and he reigned eleven years in Jerusalem."},{"num":12,"verse":"And he did evil in the sight of the Lord his God, and he was not ashamed of the face of Jeremy, the prophet, that spake to him by the mouth of the Lord. (And he did evil before the Lord his God, and he was not ashamed before the face of the prophet Jeremiah, who spoke to him the words of the Lord.)"},{"num":13,"verse":"Also he went [away] from king Nebuchadnezzar, which made him to swear by God, that is, to promise steadfastly to be true to him; and Zedekiah made hard his noll and his heart, that he would not turn again to the Lord God of Israel. (And he also rebelled against King Nebuchadnezzar, who had made him to swear by God, that is, to promise steadfastly to be true to him; and Zedekiah stiffened his neck, that is, he became stubborn, and he hardened his heart, and he would not return to the Lord God of Israel.)"},{"num":14,"verse":"But also all the princes of priests, and the people, trespassed wickedly, by all the abominations of heathen men; and they defouled the house of the Lord, which he had hallowed to himself in Jerusalem. (But also all the leaders of the priests, and the people, wickedly trespassed, by all the abominations of the heathen; and they defiled the House of the Lord, which he had consecrated in Jerusalem.)"},{"num":15,"verse":"And the Lord God of their fathers sent to them by the hand of his messengers, and the Lord rose up by night, and he admonished them each day; for-thy that he would spare his people, and his dwelling place."},{"num":16,"verse":"And they mocked the messengers of God, and they despised his words, and they scorned his prophets; till the great vengeance of the Lord ascended upon his people, and no cure, or healing, were to them. (But they mocked God’s messengers, and they despised his words/and they defied his words, and they scorned his prophets; until the great vengeance of the Lord descended upon his people, and then there was no cure, or healing, for them.)"},{"num":17,"verse":"And he brought on them the king of Chaldees; and [he] killed the young men of them by sword in the house of [the] saintuary; he had not mercy of a young man, and of a virgin, and of an eld man, and soothly neither of a man nigh the death for eldness, but he betook all in the hand of that king of Chaldees. (And he brought in upon them the king of the Chaldeans; and he killed their young men with the sword in the House of the sanctuary; and he had no mercy for a young man, or a virgin, or an old man, or a man near death because of old age, but he delivered them all into the hands of that king of the Chaldeans.)"},{"num":18,"verse":"And he translated into Babylon all the vessels of the house of the Lord (And he carried away to Babylon all the vessels of the House of the Lord), both the greater and the less(er) vessels, and the treasures of the temple, and of the king of Judah, and of the princes thereof."},{"num":19,"verse":"And (the) enemies burnt the house of the Lord; and they destroyed the wall of Jerusalem; they burnt all the towers; and they destroyed whatever thing was precious therein. (And the enemies burned down the House of the Lord; and they destroyed the wall of Jerusalem; they burned down all the towers; and they destroyed whatever precious things were there.)"},{"num":20,"verse":"If any man escaped the sword, he was led (away) into Babylon, and served the king and his sons; this subjection (this subjugation)/this thralldom continued upon the men of Judah, till the king of Persia reigned,"},{"num":21,"verse":"and till the word of the Lord by the mouth of Jeremy was fulfilled, and till the land hallowed his sabbaths (and until the word of the Lord given by Jeremiah was fulfilled, and until the land consecrated its sabbaths). Soothly Judah in all the days of (its) desolation, or of the destroying or forsaking thereof, it made sabbath, till that seventy years were fulfilled."},{"num":22,"verse":"Forsooth in the first year of Cyrus, king of Persia, to fulfill the word of the Lord, which he had spoken by the mouth of Jeremy, the Lord raised (up) the spirit of Cyrus, king of Persia, that commanded to be preached in all his realm, yea, by writing, and said, (But in the first year of Cyrus, the king of Persia, to fulfill the word of the Lord, which he had spoken by the mouth of Jeremiah, the Lord raised up the spirit of Cyrus, the king of Persia, who commanded to be preached in all his kingdom, by word of mouth, and in writing, the following edict,)"},{"num":23,"verse":"(I) Cyrus, king of Persia, saith these things, The Lord God of heaven hath given to me all the realms of [the] earth, and he commanded to me, that I should build to him an house in Jerusalem, which is in Judah. Who of you is in all his people? the Lord his God be with him, and go he up thither (To every man among you who is of his people, the Lord his God be with him, and go he up there now to Jerusalem)."}]