[{"header":"Chapter 22"},{"num":1,"verse":"Sacrifice of the Son. Some time later God tested Abraham. He said to him, “Abraham, Abraham!” He replied, “Here I am!”"},{"num":2,"verse":"God said, “Take your son, your only son, the one you love, Isaac, and go to the land of Moriah and offer him as a burnt offering on the mountain that I will show you.”"},{"num":3,"verse":"Abraham rose early in the morning, saddled a donkey, and took two servants and his son Isaac with him. He also took the wood for the burnt offering and set out toward the place about which God had spoken."},{"num":4,"verse":"On the third day, Abraham looked up and saw that place from a distance."},{"num":5,"verse":"Abraham said to his servants, “Stay here with the donkey. I and the boy will go over there. We will worship and then we will return to you.”"},{"num":6,"verse":"Abraham took the wood for the burnt offering and loaded it upon his son Isaac. He himself carried the fire and the knife. They then set out together."},{"num":7,"verse":"Isaac turned to his father Abraham and said, “My father!”"},{"num":8,"verse":"Abraham answered, “God himself will provide the lamb for the burnt offering, my son!” And the two of them went on together."},{"num":9,"verse":"They then arrived at the place of which God had spoken. There Abraham built an altar and piled up the wood. He tied up his son Isaac and placed him upon the altar so that he was lying upon the wood."},{"num":10,"verse":"Then Abraham reached out and took the knife to kill his son."},{"num":11,"verse":"But the angel of the Lord called out from heaven and said, “Abraham! Abraham!”"},{"num":12,"verse":"The angel said, “Do not reach out your hand against the boy! Do not harm him in any way! Now I know that you fear God and you have not even withheld your son, your only son, from me.”"},{"num":13,"verse":"Abraham looked up and saw a ram that had its horns caught in a bush. Abraham took the ram and offered it as a burnt offering instead of his son."},{"num":14,"verse":"Abraham called that place, “The Lord will provide,” for he said, “On the mountain the Lord provided.”"},{"num":15,"verse":"The angel of the Lord called Abraham from heaven again"},{"num":16,"verse":"and said, “I swear by my own self, thus says the Lord: because you have done this and did not withhold your son from me, your only son,"},{"num":17,"verse":"I will bless you with every blessing and I will make your descendants very numerous, like the stars of the heavens or the sand on the shore of the sea. Your descendants shall take possession of the cities of your enemies."},{"num":18,"verse":"All the nations of the earth shall be blessed through your descendants, because you have obeyed my command.”"},{"num":19,"verse":"Abraham returned to his servants, and together they set out toward Beer-sheba, where Abraham made his dwelling."},{"num":20,"verse":"Children of Abraham’s Brother. Afterward, Abraham received this news: “Behold, Milcah has borne sons to your brother Nahor:"},{"num":21,"verse":"Uz the firstborn, Buz his brother, Kemuel (the father of Aram),"},{"num":22,"verse":"Chesed, Hazo, Pildash, Jidlaph, and Bethuel.”"},{"num":23,"verse":"Bethuel became the father of Rebekah. Milcah gave birth to these eight sons for Nahor, the brother of Abraham."},{"num":24,"verse":"His concubine, Reumah, also bore Tebah, Gaham, Tahash, and Maacah."}]