[{"header":"The Command to Sacrifice Isaac"},{"num":22,"verse":"After these things God tested Abraham. He said to him, ‘Abraham!’ And he said, ‘Here I am.’ "},{"num":2,"verse":"He said, ‘Take your son, your only son Isaac, whom you love, and go to the land of Moriah, and offer him there as a burnt-offering on one of the mountains that I shall show you.’ "},{"num":3,"verse":"So Abraham rose early in the morning, saddled his donkey, and took two of his young men with him, and his son Isaac; he cut the wood for the burnt-offering, and set out and went to the place in the distance that God had shown him. "},{"num":4,"verse":"On the third day Abraham looked up and saw the place far away. "},{"num":5,"verse":"Then Abraham said to his young men, ‘Stay here with the donkey; the boy and I will go over there; we will worship, and then we will come back to you.’ "},{"num":6,"verse":"Abraham took the wood of the burnt-offering and laid it on his son Isaac, and he himself carried the fire and the knife. So the two of them walked on together. "},{"num":7,"verse":"Isaac said to his father Abraham, ‘Father!’ And he said, ‘Here I am, my son.’ He said, ‘The fire and the wood are here, but where is the lamb for a burnt-offering?’ "},{"num":8,"verse":"Abraham said, ‘God himself will provide the lamb for a burnt-offering, my son.’ So the two of them walked on together."},{"num":9,"verse":"When they came to the place that God had shown him, Abraham built an altar there and laid the wood in order. He bound his son Isaac, and laid him on the altar, on top of the wood. "},{"num":10,"verse":"Then Abraham reached out his hand and took the knife to kill his son. "},{"num":11,"verse":"But the angel of the Lord called to him from heaven, and said, ‘Abraham, Abraham!’ And he said, ‘Here I am.’ "},{"num":12,"verse":"He said, ‘Do not lay your hand on the boy or do anything to him; for now I know that you fear God, since you have not withheld your son, your only son, from me.’ "},{"num":13,"verse":"And Abraham looked up and saw a ram, caught in a thicket by its horns. Abraham went and took the ram and offered it up as a burnt-offering instead of his son. "},{"num":14,"verse":"So Abraham called that place ‘The Lord will provide’; as it is said to this day, ‘On the mount of the Lord it shall be provided.’"},{"num":15,"verse":"The angel of the Lord called to Abraham a second time from heaven, "},{"num":16,"verse":"and said, ‘By myself I have sworn, says the Lord: Because you have done this, and have not withheld your son, your only son, "},{"num":17,"verse":"I will indeed bless you, and I will make your offspring as numerous as the stars of heaven and as the sand that is on the seashore. And your offspring shall possess the gate of their enemies, "},{"num":18,"verse":"and by your offspring shall all the nations of the earth gain blessing for themselves, because you have obeyed my voice.’ "},{"num":19,"verse":"So Abraham returned to his young men, and they arose and went together to Beer-sheba; and Abraham lived at Beer-sheba."},{"header":"The Children of Nahor"},{"num":20,"verse":"Now after these things it was told Abraham, ‘Milcah also has borne children, to your brother Nahor: "},{"num":21,"verse":"Uz the firstborn, Buz his brother, Kemuel the father of Aram, "},{"num":22,"verse":"Chesed, Hazo, Pildash, Jidlaph, and Bethuel.’ "},{"num":23,"verse":"Bethuel became the father of Rebekah. These eight Milcah bore to Nahor, Abraham’s brother. "},{"num":24,"verse":"Moreover, his concubine, whose name was Reumah, bore Tebah, Gaham, Tahash, and Maacah."}]