[{"num":22,"verse":"And it came to pass after these things, that G-d did test Avraham, and said unto him, Avraham: and he said, Hineini (Behold, here I am)."},{"num":2,"verse":"And He said, Take now thy son, thine ben yachid (only son) Yitzchak, whom thou lovest, and get thee into eretz Moriah; and offer him there for a burnt offering upon one of the mountains which I will tell thee of."},{"num":3,"verse":"And Avraham rose up early in the morning, and saddled his donkey, and took two of his servants with him, and Yitzchak his son, and cut the wood for the burnt offering, and rose up, and went unto the place of which G-d had told him."},{"num":4,"verse":"Then on Yom HaShlishi Avraham lifted up his eyes, and saw the place afar off. [1C 15:3]"},{"num":5,"verse":"And Avraham said unto his servants, Abide ye here with the donkey; and I and the young man will go over there and nishtachaveh (we will worship) and we will come back again to you."},{"num":6,"verse":"And Avraham took atzei haolah (the wood of the burnt offering), and laid it upon Yitzchak his son; and he took the eish (fire) in his hand, and a knife; and they went both of them together."},{"num":7,"verse":"And Yitzchak spoke unto Avraham his father, and said, Avi (My father): and he said, Hineini, beni (Here am I, my son). And he said, Hinei, the eish (fire) and the wood: but where is the seh (lamb) for a burnt offering? [YESHAYAH 53:7]"},{"num":8,"verse":"And Avraham said, My son, G-d will provide Himself a seh (lamb) for a burnt offering: so they went both of them together."},{"num":9,"verse":"And they came to the place which G-d had told him of; and Avraham built a mizbe’ach there, and laid the wood in order, and made the akedah (binding) of Yitzchak his son, and laid him on the mizbe’ach upon the wood."},{"num":10,"verse":"And Avraham stretched forth his hand, and took the knife to slay his son."},{"num":11,"verse":"And the Malach Hashem called unto him out of Shomayim, and said, Avraham, Avraham: and he said, Hineini."},{"num":12,"verse":"And he said, Lay not thine hand upon the young man, neither do thou any thing unto him: for now I know that thou fearest G-d, seeing thou hast not withheld thy son, thine ben yachid from Me."},{"num":13,"verse":"And Avraham lifted up his eyes, and looked, and hinei behind him a ram caught in a thicket by his horns: and Avraham went and took the ram, and offered him up for a burnt offering TAKHAT (instead of ) his son. [YESHAYAH 53:8]"},{"num":14,"verse":"And Avraham called the name of that place Hashem Yireh: as it is said to this day, In the mount of Hashem it shall be provided."},{"num":15,"verse":"And the Malach Hashem called unto Avraham out of Shomayim the second time,"},{"num":16,"verse":"And said, By Myself have I sworn, saith Hashem, for because thou hast done this thing, and hast not withheld thy son, thine ben yachid:"},{"num":17,"verse":"That in blessing I will bless thee, and in multiplying I will multiply thy zera as the stars of the skies, and as the sand which is upon the sea shore; and thy zera shall possess the gate of his enemies;"},{"num":18,"verse":"And in thy zera shall kol goyei ha’aretz be blessed; because thou hast obeyed My voice."},{"num":19,"verse":"So Avraham returned unto his servants, and they rose up and went together to Beer Sheva; and Avraham dwelt at Beer Sheva."},{"num":20,"verse":"And it came to pass after these things, that it was told Avraham, saying, Hinei, Milcah, she hath also born children unto thy brother Nachor;"},{"num":21,"verse":"Utz his bechor (firstborn), and Buz his brother, and Kemuel the father of Aram,"},{"num":22,"verse":"And Kesed, and Hazo, and Pildash, and Yidlaph, and Betuel."},{"num":23,"verse":"And Betuel fathered Rivkah: these eight Milcah did bear to Nachor, Avraham’s brother."},{"num":24,"verse":"And his pilegesh, whose name was Reumah, she bare also Tevach, and Gacham, and Tachash, and Maachah."}]