[{"num":34,"verse":"This is the message that came to Jeremiah from the Lord when Nebuchadnezzar, king of Babylon, and all his armies from all the kingdoms he ruled, came and fought against Jerusalem and the cities of Judah:"},{"num":2,"verse":"Go tell Zedekiah, king of Judah, that the Lord says this: I will give this city to the king of Babylon and he shall burn it. "},{"num":3,"verse":"You shall not escape; you shall be captured and taken before the king of Babylon; he shall pronounce sentence against you and you shall be exiled to Babylon. "},{"num":4,"verse":"But listen to this, O Zedekiah, king of Judah: God says you won’t be killed in war and carnage "},{"num":5,"verse":"but that you will die quietly among your people, and they will burn incense in your memory, just as they did for your fathers. They will weep for you and say, “Alas, our king is dead!” This I have decreed, says the Lord."},{"num":6,"verse":"So Jeremiah delivered the message to King Zedekiah. "},{"num":7,"verse":"At this time the Babylonian army was besieging Jerusalem, Lachish, and Azekah—the only walled cities of Judah still standing."},{"num":8,"verse":"This is the message that came to Jeremiah from the Lord after King Zedekiah of Judah had freed all the slaves in Jerusalem—"},{"num":9,"verse":"(for King Zedekiah had ordered everyone to free his Hebrew slaves, both men and women. He had said that no Jew should be the master of another Jew for all were brothers. "},{"num":10,"verse":"The princes and all the people had obeyed the king’s command and freed their slaves, but the action was only temporary. "},{"num":11,"verse":"They changed their minds and made their servants slaves again. "},{"num":12,"verse":"That is why the Lord gave the following message to Jerusalem.)"},{"num":13,"verse":"The Lord, the God of Israel, says: I made a covenant with your fathers long ago when I brought them from their slavery in Egypt. "},{"num":14,"verse":"I told them that every Hebrew slave must be freed after serving six years. But this was not done. "},{"num":15,"verse":"Recently you began doing what was right, as I commanded you, and freed your slaves. You had solemnly promised me in my Temple that you would do it. "},{"num":16,"verse":"But now you refuse and have defiled my name by shrugging off your oath and have made them slaves again."},{"num":17,"verse":"Therefore, says the Lord, because you will not listen to me and release them, I will release you to the power of death by war and famine and disease. And I will scatter you over all the world as exiles. "},{"num":18,"verse":"Because you have refused the terms of our contract, I will cut you apart just as you cut apart the calf when you walked between its halves to solemnize your vows. Yes, I will butcher you, whether you are princes, court officials, priests, or people—for you have broken your oath. "},{"num":20,"verse":"I will give you to your enemies, and they shall kill you. I will feed your dead bodies to the vultures and wild animals. "},{"num":21,"verse":"And I will surrender Zedekiah, king of Judah, and his officials to the army of the king of Babylon, though he has departed from the city for a little while. "},{"num":22,"verse":"I will summon the Babylonian armies back again, and they will fight against it and capture this city and burn it. And I will see to it that the cities of Judah are completely destroyed and left desolate without a living soul."}]