[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Woe unto him that buildeth . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The prophet now turns to Jehoiakim, and apparently reproduces what he had before uttered in denouncing the selfish bearing of that king. The feelings of the people, already suffering from the miseries of foreign invasion, were outraged by the revival of the forced labour of the days of Solomon, pressing in this instance not on the “strangers” of alien blood (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 5:13-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 2:17-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but on the Israelites themselves. We are reminded of the general characteristics of Eastern, and perhaps of all other, despotism. Like the modern rulers of Constantinople, Jehoiakim went on building palaces when his kingdom was on the verge of ruin, and his subjects were groaning under their burdens.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His chambers.—Strictly speaking, the upper storeys of the house. This is dwelt on as aggravating the severity of the work.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "His chambers.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Strictly speaking, the upper storeys of the house. This is dwelt on as aggravating the severity of the work.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Without wages.—The labourers were treated as slaves, and, like the Israelites in their Egyptian bondage (Exodus 16:3), received their food, but nothing more.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Without wages.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The labourers were treated as slaves, and, like the Israelites in their Egyptian bondage (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), received their food, but nothing more.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 22:13-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 22:13-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wo unto him that buildeth his house by unrighteousness,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c. — “The prophet proceeds to denounce God’s judgments against Jehoiakim, (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) who, it seems, built himself a stately palace in those calamitous times, and took no care to pay the wages of the workmen; but maintained his own luxury by the oppression of those who were to live by their labour: a crying sin, and too common among the great men of the world, severely prohibited both in the Old and New Testament.” — Lowth. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 24:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That saith, I will build me a wide house and large chambers ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עליות מרוחים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chambers to the wind; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, exposed, or open, to wind on every side. They used to enjoy the cool air in these chambers; the windows being so placed that they might receive the wind from whatever quarter it came. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shalt thou reign because thou closest thyself in cedar? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Will a house, finely adorned and furnished, be a fortress and defence to thee against thy enemies, that come to deprive thee of thy kingdom? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Did not thy father eat and drink, and do justice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Did not Josiah live, and enjoy comfort in life as well as thou dost, though he did not indulge himself in such delicacies, and had not such magnificent apartments? Did he not live in sufficient plenty, and in a state suitable to his character, and yet strictly observed justice, both in his private and public capacity, and not betake himself to such sordid methods of injustice and oppression for the support of his grandeur? He did no wrong to any of his subjects, never oppressed them, or put any hardship upon them, but was careful to preserve to all their just rights and properties. Nay, he not only did not abuse his power for the support of wrong, but used it for the maintaining of right; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he judged the cause of the poor and needy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Was ready to hear the cause of the meanest of his subjects, and do them justice; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and then it was well with him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The blessing of God was upon him as the reward of his justice and integrity. He was comfortable in himself, and was useful to and respected by his subjects, and prospered in all that he put his hand to. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Was not this to know me, saith the Lord? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Did he not hereby make it appear, that he rightly knew, worshipped, and served me, and consequently was known and owned by me? Observe, reader, the right knowledge of God implies the doing our duty to our fellow-creatures, as well as to God, particularly that duty which our place and station in the world require us to perform.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:10-19 Here is a sentence of death upon two kings, the wicked sons of a very pious father. Josiah was prevented from seeing the evil to come in this world, and removed to see the good to come in the other world; therefore, weep not for him, but for his son Shallum, who is likely to live and die a wretched captive. Dying saints may be justly envied, while living sinners are justly pitied. Here also is the doom of Jehoiakim. No doubt it is lawful for princes and great men to build, beautify, and furnish houses; but those who enlarge their houses, and make them sumptuous, need carefully to watch against the workings of vain-glory. He built his houses by unrighteousness, with money gotten unjustly. And he defrauded his workmen of their wages. God notices the wrong done by the greatest to poor servants and labourers, and will repay those in justice, who will not, in justice, pay those whom they employ. The greatest of men must look upon the meanest as their neighbours, and be just to them accordingly. Jehoiakim was unjust, and made no conscience of shedding innocent blood. Covetousness, which is the root of all evil, was at the bottom of all. The children who despise their parents' old fashions, commonly come short of their real excellences. Jehoiakim knew that his father found the way of duty to be the way of comfort, yet he would not tread in his steps. He shall die unlamented, hateful for oppression and cruelty.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Far worse is the second example. Shallum was no heartless tyrant like Jehoiakim, who lived in splendor amid the misery of the nation, and perished so little cared for that his body was cast aside without burial.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His chambers - Really, his upper chambers. From the absence of machinery the raising of materials for the upper stories was a difficult task, especially when massive stones were used.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His work - Giveth him not his wages. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "His work - Giveth him not his wages. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. Not only did Jehoiakim tax the people (2Ki 23:35) for Pharaoh's tribute, but also took their forced labor, without pay, for building a splendid palace; in violation of Le 19:13; De 24:14, 15. Compare Mic 3:10; Hab 2:9; Jas 5:4. God will repay in justice those who will not in justice pay those whom they employ.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " We have not here any certain guidance to let us know whether the prophet intended Jehoahaz or Jehoiakim; both of them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "did evil in the sight of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as we read in their story. The sin here reflected upon is manifestly injustice and oppression, but possibly, in the former part of the verse, all unjust and oppressive acts by which either of these princes endeavoured to promote their grandeur may be understood; for we need not take ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "building his house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in a strict, literal sense, but signifying the promotion of his family, or establishing his state and dignity. In the latter part, a special oppression, withholding workmen’s wages, is the sin upon which the woe is denounced; a sin contrary to the law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 19:13 Deu 24:14,15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and against which the judgment of God is also denounced under the New Testament, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jam 5:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jam 5:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". An evident demonstration of God’s love to mankind, securing by his law just dealings between man and man, and revenging acts of injustice, and particularly where men take advantage of their greatness above and superiority over others, to trample them under their feet, and to withhold their just rights from them: though such persons may be out of the reach of human justice, yet God hath denounced a woe against them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Woe unto him that buildeth his house by righteousness, and his chambers by wrong,.... This respects Jehoiakim, the then reigning king; who, not content with the palace the kings of Judah before him had lived in, built another; or however enlarged that, and made great alterations in it; but this he did either with money ill gotten, or perverted to a wrong use, which ought to have been otherwise laid out; or by not paying for the materials of whom they were bought, or the workmen for their workmanship; and perhaps this may be the reason why so much notice is taken of the king's house or palace in the former part of the chapter, and why it is threatened with desolation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that useth his neighbour's service without wages, and giveth him not for his work; or, \"that serveth himself of his neighbour freely\"; or, \"makes him serve freely\" (g); \"and giveth him not his work\" (h); makes him, work for nothing; gives him no wages for it, but keeps back the hire of the labourers; which is a crying sin in any person, and much more in a king; see James 5:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that useth his neighbour's service without wages, and giveth him not for his work; or, \"that serveth himself of his neighbour freely\"; or, \"makes him serve freely\" (g); \"and giveth him not his work\" (h); makes him, work for nothing; gives him no wages for it, but keeps back the hire of the labourers; which is a crying sin in any person, and much more in a king; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g)   \"qui socium suum servire facit gratis\", Schmidt; \"amici sui servitutem exigenti gratis\", Junius & Tremellius. (h)    \"et opus ejus non dabit ei\", Montanus; \"mercedem operis\", Pagninus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(g)   \"qui socium suum servire facit gratis\", Schmidt; \"amici sui servitutem exigenti gratis\", Junius & Tremellius. (h)    \"et opus ejus non dabit ei\", Montanus; \"mercedem operis\", Pagninus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Woe to him that buildeth his house by {i} unrighteousness, and his chambers by wrong; that useth his neighbour's service without wages, and giveth him not for his work;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Woe to him that buildeth his house by ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " unrighteousness, and his chambers by wrong; ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " useth his neighbour's service without wages, and giveth him not for his work;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) By bribes and extortion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that buildeth his house by unrighteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Jehoiakim, as though it were not enough to involve the land in a heavy tribute to the king of Egypt (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), exacted forced labour from his own subjects that he might have a sumptuous palace built for himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chambers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "upper chambers,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and so in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jeremiah 22:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 22:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". They were on the flat roof of the house, had latticed windows (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and so enjoyed free circulation of air.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "13–19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See introd. summary to section. It probably belongs to the early years of Jehoiakim, but see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jeremiah 22:18-19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 22:18-19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Shallum, or Jehoahaz, in his short reign of three months, had no opportunity of distinguishing himself for good or for evil It was otherwise with Jehoiakim, whose eleven years were marked by the worst characteristics of idolatry and despotism. He \"had, besides, a passion for building splendid and costly houses; and as he esteemed his own position secure under the protection of a superior power, he did not scruple severely to oppress his helpless subjects, and wring from them as much money as possible\" (Ewald, 'History of Israel,' 4:252; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:33-35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The building mania, to which Oriental sovereigns have always been prone, had seized upon Jehoiakim. The architecture of the original palace no longer, perhaps, suited the higher degree of civilization; the space was as confined as that of a Saxon mansion would have appeared to a Norman. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That buildeth his house by unrighteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the second half-verse explains, by not paying the workmen (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jeremiah 22:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The woe uttered upon Jehoiakim. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Woe unto him that buildeth his house with unrighteousness and his upper chambers with wrong, that maketh his fellow labour for nought, and giveth him not his hire; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That saith: I will build me a wide house and spacious upper chambers, and cutteth him out many windows, and covereth it with cedars, and painteth it with vermilion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Art thou a king of thou viest in cedar? Did not thy father eat and drink, and do right and justice? Then it went well with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He did justice to the poor and wretched, then it was well. Is not this to know me? saith Jahveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For on nothing are thine eyes and thy heart set but on gain and on the blood of the innocent, to shed it, and on oppression and violence, to do them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore thus saith Jahveh concerning Jehoiakim the son of Josiah king of Judah: They shall not mourn for him, saying: Alas, my brother! and alas, sister! they shall not mourn for him: Alas, lord! and alas for his glory! ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". An ass's burial shall his burial be, dragged and cast far away from the gates of Jerusalem.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The prediction as to Jehoiakim begins with a woe upon the unjust oppression of the people. The oppression consisted in his building a magnificent palace with the sweat and blood of his subjects, whom he compelled to do forced labour without giving the labourers wages. The people must have felt this burden all the more severely that Jehoiakim, to obtain the throne, had bound himself to pay to Pharaoh a large tribute, the gold and silver for which he raised from the population according to Pharaoh's own valuation, 2 Kings 23:33. With \"Woe to him that buildeth,\" etc., cf. Habakkuk 2:12; Micah 3:10. \"That maketh his fellow labour,\" lit., through his neighbour he works, i.e., he causes the work to be done by his neighbour (fellow-man) for nought, without giving him wages, forces him to unpaid statute-labour. עבד בּ as in Leviticus 25:39, Leviticus 25:46. פּעל, labour, work, gain, then wages, cf. Job 7:2. Jehoiakim sought to increase the splendour of his kingship by palace-building. To this the speech points, put in his mouth at Jeremiah 22:14 : I will build me בּית מדּות, a house of extensions, i.e., a palace in the grand style, with spacious halls, vast chambers. מרוּח from רוח, to find vent, cheer up, 1 Samuel 16:23; not airy, but spacious, for quite a modest house might have airy chambers. וקרע is a continuation of the participle; literally: and he cuts himself out windows, makes huge openings in the walls for windows. This verb is used in Jeremiah 4:30 of opening up the eyes with paint. חלּוני presents some difficulty, seeing that the suffix of the first person makes no sense. It has therefore been held to be a contracted plural form (Gesen. Lehrgeb. S. 523) or for a dual (Ew. 177, a), but without any proof of the existence of such formations, since גּובי, Amos 7:1; Nahum 3:17, is to be otherwise explained (see on Amos 7:1). Following on the back of J. D. Mich., Hitz., Graf, and Bttcher (ausf. Gramm. 414) propose to connect the ו before ספוּן with this word and to read חלּוניו: and tears open for himself his windows; in support of which it is alleged that one cod. so reads. But this one cod. can decide nothing, and the suffix his is superfluous, even unsuitable, seeing that there can be no thought of another person's building; whereas the copula cannot well be omitted before ספוּן. For the rule adduced for this, that the manner of the principal action is frequently explained by appending infinitives absoll. (Ew. 280, a), does not meet the present case; the covering with cedar, etc., does not refer to the windows, and so cannot be an explanation of the cutting out for himself. We therefore hold, with Bttcher (Proben, S. 40), that חלּוני is an adjective formation, with the force of: abundant in windows, since this formation is completely accredited by כּילי and חרי (cf. Ew. 164, c); and the objection alleged against this by Graf, that then no object is specified for \"cutteth out,\" is not of much weight, it being easy to supply the object from the preceding \"house:\" and he cuts it out for himself abounding in windows. There needs be no change of וספוּן into וספון. For although the infin. absol. would be quite in place as continuation of the verb. fin. (cf. Ew. 351, c), yet it is not necessary. The word is attached in zeugma to וקרע or חלּוני: and he covers with cedar, to: faces or overlays, for this verb does not mean to plank or floor, for which צפּה is the usual word, but hide, cover, and is used 1 Kings 6:9; 1 Kings 7:3, for roofing. The last statement is given in infin. absol.: וּמשׁוח :.los, and besmears it, paints it (the building) with שׁשׁר, red ochre, a brilliant colour (lxx μίλτος, i.e., acc. to Kimchi, red lead; see Gesen. thess s.v.). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prediction as to Jehoiakim begins with a woe upon the unjust oppression of the people. The oppression consisted in his building a magnificent palace with the sweat and blood of his subjects, whom he compelled to do forced labour without giving the labourers wages. The people must have felt this burden all the more severely that Jehoiakim, to obtain the throne, had bound himself to pay to Pharaoh a large tribute, the gold and silver for which he raised from the population according to Pharaoh's own valuation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". With \"Woe to him that buildeth,\" etc., cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"That maketh his fellow labour,\" lit., through his neighbour he works, i.e., he causes the work to be done by his neighbour (fellow-man) for nought, without giving him wages, forces him to unpaid statute-labour. עבד בּ as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:46",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". פּעל, labour, work, gain, then wages, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jehoiakim sought to increase the splendour of his kingship by palace-building. To this the speech points, put in his mouth at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : I will build me בּית מדּות, a house of extensions, i.e., a palace in the grand style, with spacious halls, vast chambers. מרוּח from רוח, to find vent, cheer up, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 16:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; not airy, but spacious, for quite a modest house might have airy chambers. וקרע is a continuation of the participle; literally: and he cuts himself out windows, makes huge openings in the walls for windows. This verb is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 4:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of opening up the eyes with paint. חלּוני presents some difficulty, seeing that the suffix of the first person makes no sense. It has therefore been held to be a contracted plural form (Gesen. Lehrgeb. S. 523) or for a dual (Ew. 177, a), but without any proof of the existence of such formations, since גּובי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is to be otherwise explained (see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Following on the back of J. D. Mich., Hitz., Graf, and Bttcher (ausf. Gramm. 414) propose to connect the ו before ספוּן with this word and to read חלּוניו: and tears open for himself his windows; in support of which it is alleged that one cod. so reads. But this one cod. can decide nothing, and the suffix his is superfluous, even unsuitable, seeing that there can be no thought of another person's building; whereas the copula cannot well be omitted before ספוּן. For the rule adduced for this, that the manner of the principal action is frequently explained by appending infinitives absoll. (Ew. 280, a), does not meet the present case; the covering with cedar, etc., does not refer to the windows, and so cannot be an explanation of the cutting out for himself. We therefore hold, with Bttcher (Proben, S. 40), that חלּוני is an adjective formation, with the force of: abundant in windows, since this formation is completely accredited by כּילי and חרי (cf. Ew. 164, c); and the objection alleged against this by Graf, that then no object is specified for \"cutteth out,\" is not of much weight, it being easy to supply the object from the preceding \"house:\" and he cuts it out for himself abounding in windows. There needs be no change of וספוּן into וספון. For although the infin. absol. would be quite in place as continuation of the verb. fin. (cf. Ew. 351, c), yet it is not necessary. The word is attached in zeugma to וקרע or חלּוני: and he covers with cedar, to: faces or overlays, for this verb does not mean to plank or floor, for which צפּה is the usual word, but hide, cover, and is used ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 6:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for roofing. The last statement is given in infin. absol.: וּמשׁוח :.los, and besmears it, paints it (the building) with שׁשׁר, red ochre, a brilliant colour (lxx μίλτος, i.e., acc. to Kimchi, red lead; see Gesen. thess s.v.). ",
            "children": []
          }
        ]
      }
    ]
  }
]