[{"header":"David Is Kind to Mephibosheth"},{"num":9,"verse":"Then David said, “Is there anyone left of the family of Saul, to whom I may show kindness because of Jonathan?” "},{"num":2,"verse":"Now there was a servant in Saul’s house whose name was Ziba. They called him to David, and the king said to him, “Are you Ziba?” And he said, “I am your servant.” "},{"num":3,"verse":"The king said, “Is there not still someone of the family of Saul to whom I may show the kindness of God?” And Ziba said to the king, “There is still a son of Jonathan who cannot walk because of his feet.” "},{"num":4,"verse":"So the king said to him, “Where is he?” Ziba answered the king, “See, he is in the family of Machir the son of Ammiel in Lo-debar.” "},{"num":5,"verse":"Then King David sent men to bring him from the family of Machir the son of Ammiel, from Lo-debar. "},{"num":6,"verse":"Mephibosheth the son of Saul’s son Jonathan came to David and fell on his face to the ground in respect. David said, “Mephibosheth.” And he answered, “Here is your servant!” "},{"num":7,"verse":"David said to him, “Do not be afraid. For I will be sure to show kindness to you because of your father Jonathan. I will return to you all the land of your grandfather Saul. And you will eat at my table always.” "},{"num":8,"verse":"Again Mephibosheth put his face to the ground and said, “Who am I? Why should you care for a dead dog like me?”"},{"num":9,"verse":"Then the king called Saul’s servant Ziba and said to him, “I have given to your owner’s grandson all that belonged to Saul and his family. "},{"num":10,"verse":"You and your sons and your servants will grow food on the land for him. You will bring in the food so your owner’s grandson may eat. But Mephibosheth your owner’s grandson will always eat at my table.” Now Ziba had fifteen sons and twenty servants. "},{"num":11,"verse":"Then Ziba said to the king, “Your servant will do all that my lord the king tells your servant to do.” So Mephibosheth ate at David’s table as one of the king’s sons. "},{"num":12,"verse":"Mephibosheth had a young son whose name was Mica. And all who lived in Ziba’s house were Mephibosheth’s servants. "},{"num":13,"verse":"So Mephibosheth lived in Jerusalem, for he always ate at the king’s table. Both his feet had been hurt and he could not walk."}]