[{"header":"David’s Kindness to Mephibosheth"},{"num":9,"verse":"And David said, “Is there still any one left of the house of Saul, that I may show him kindness for Jonathan’s sake?” "},{"num":2,"verse":"Now there was a servant of the house of Saul whose name was Ziba, and they called him to David; and the king said to him, “Are you Ziba?” And he said, “Your servant is he.” "},{"num":3,"verse":"And the king said, “Is there not still some one of the house of Saul, that I may show the kindness of God to him?” Ziba said to the king, “There is still a son of Jonathan; he is crippled in his feet.” "},{"num":4,"verse":"The king said to him, “Where is he?” And Ziba said to the king, “He is in the house of Machir the son of Am′mi-el, at Lo-debar.” "},{"num":5,"verse":"Then King David sent and brought him from the house of Machir the son of Am′mi-el, at Lo-debar. "},{"num":6,"verse":"And Mephib′osheth the son of Jonathan, son of Saul, came to David, and fell on his face and did obeisance. And David said, “Mephib′osheth!” And he answered, “Behold, your servant.” "},{"num":7,"verse":"And David said to him, “Do not fear; for I will show you kindness for the sake of your father Jonathan, and I will restore to you all the land of Saul your father; and you shall eat at my table always.” "},{"num":8,"verse":"And he did obeisance, and said, “What is your servant, that you should look upon a dead dog such as I?”"},{"num":9,"verse":"Then the king called Ziba, Saul’s servant, and said to him, “All that belonged to Saul and to all his house I have given to your master’s son. "},{"num":10,"verse":"And you and your sons and your servants shall till the land for him, and shall bring in the produce, that your master’s son may have bread to eat; but Mephib′osheth your master’s son shall always eat at my table.” Now Ziba had fifteen sons and twenty servants. "},{"num":11,"verse":"Then Ziba said to the king, “According to all that my lord the king commands his servant, so will your servant do.” So Mephib′osheth ate at David’s table, like one of the king’s sons. "},{"num":12,"verse":"And Mephib′osheth had a young son, whose name was Mica. And all who dwelt in Ziba’s house became Mephib′osheth’s servants. "},{"num":13,"verse":"So Mephib′osheth dwelt in Jerusalem; for he ate always at the king’s table. Now he was lame in both his feet."}]