[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) They confess themselves but sojourners (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and thus make it plain that they are still seeking their true home (14); and yet, if. they had sought nothing more than an earthly home, there is one already, which was once theirs, and to which they might return (15); hence it is no earthly but a heavenly-country that they desire. This is the general current of thought in these verses, presenting a very close analogy to the argument of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; here, as there, words which otherwise might appear to have but an earthly reference are seen to have a higher and a spiritual import. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:8-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we have before us only the land of inheritance, but in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the heavenly rest; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " words which as read in Genesis might seem to refer to a wandering life in the land of Canaan are taken as a confession of sojourning upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is not necessary to suppose that the desires and yearnings of “the fathers” expressed themselves in the definite forms which later revelation has made familiar; in all that is essential the hope existed, whilst the mode of the fulfilment was unknown. Through faith the patriarchs were willing to connect their whole life and that of their children with waiting at God’s bidding for the fulfilment of a promise—wandering and sojourning until God’s own time should come when He would grant a home in a country of their own. And yet each of these servants of God recognised that relation to God in which lay the foundation of the promise to him to be personal and abiding. If these two thoughts be united, it will be easy to see how each one for himself would be led to regard the state of wandering in which he spent his life as an emblem of a state of earthly waiting for an enduring home; the sojourning in the land was a constant symbol of the sojourning upon earth. Hence (see the passages quoted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the same language is used from age to age after Canaan is received as an inheritance. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 22:31-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But now.—See Hebrews 8:6; the meaning is not “at this present time,” but “as the case stands in truth.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "But now.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the meaning is not “at this present time,” but “as the case stands in truth.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Wherefore God is not ashamed.—Rather, Wherefore God is not ashamed of them (compare Hebrews 2:11). Because of this lofty desire, or rather, because of the faith and love towards Him in which the desire was founded, and of which therefore the longing for a heavenly country was the expression, God is not ashamed of them, to be called (literally surnamed) their God (Genesis 17:7; Genesis 26:24; Genesis 28:13; Exodus 3:6; et al.). That He is not ashamed of them He has shown, “for He prepared for them a city.” Before the desire existed the home had been provided. (Comp. Matthew 25:34.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Wherefore God is not ashamed.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Wherefore God is not ashamed of them",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Because of this lofty desire, or rather, because of the faith and love towards Him in which the desire was founded, and of which therefore the longing for a heavenly country was the expression, God is not ashamed of them, to be called (literally ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "surnamed",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") their God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 17:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "et al.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " That He is not ashamed of them He has shown, “for He prepared for them a city.” Before the desire existed the home had been provided. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hebrews",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE FUTURE WHICH VINDICATES GOD",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "THESE are bold words. They tell us that unless God has provided a future condition of social blessedness for those whom He calls His, their life’s experience on earth is a blot on His character and administration. He needs heaven for His vindication. The preparation of the City is the reason why He is not ‘ashamed to be called their God.’ If there were not such a preparation, He had need to be ashamed. Then my text, further, by its first word ‘wherefore,’ carries our thoughts back to what has been said beforehand; and that is, ‘They desire a better country, that is, a heavenly.’ Therefore God ‘is not ashamed of them,’ as the Revised Version has it, with a fuller rendering, ‘to be called their God.’ That is to say, the attitude of the men who look ever forward, through the temporal, to the things unseen and eternal, is worthy of their relation with Him, and it alone is worthy. And if people professing to be His, and professing that He is theirs, do not so live, they would be a disgrace to God, and He would be ashamed to own them for His.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So there are two lines of thought suggested by our text; two sets of obligations which are deduced by the writer of this Epistle from that solemn name - ‘The God of Abraham, and of Isaac, and of Jacob.’ The one set of obligations refers to Him; the other to us. There are, then, three things here for our consideration - the name; what it pledges God to do; and what it binds men to seek. Let me ask you to look at these three things with me.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First of all, then, regard the significance of the name round which the whole argument of our verse turns.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The writer lays hold of that wonderful designation, by which the God of the whole earth knit Himself, in special relationship of unity and mutual possession, to these three poor men - Abraham, Isaac, and Jacob, and he would have us ponder that name, as meaning a great deal more than the fact that these three were His worshippers, and that He was their God, in the sense in which Moloch was the God of the Phoenicians; Jupiter, the god of the Romans; or Zeus of the Greeks. There is a far deeper and sacreder relation involved than that. ‘The God of Abraham, and of Isaac, and of Jacob’ means not only that His name was in some measure known as a designation, and in some measure honoured by external worship, by the patriarchs, but it involved much in regard to Him, and much in regard to them. It is the name which He took for Himself, not which men gave to Him, and, therefore, it expresses what He had made Himself to these men. That is to say, the name implies a direct act of self-revelation on the part of God. It implies condescending approach and nearness of communion. It implies possession, mutual and reciprocal, as all possession of spirit by spirit must be. It implies still more wonderfully and profoundly that, just as in regard to the relations between ourselves, so, in regard to the loftiest of all relations, God owns men, and men possess God, because, on both sides of the relationship, there is the same love. Other forms of connection between men and God differ from this deepest of all in that the attitude on the one side corresponds to, but is different from, the attitude on the other. If we think of God as the object of trust, on His side there is faithfulness, on our side there is faith. If we think of Him as the object of adoration, on His side there is loftiness, on our side there is lowliness. If we think of Him as the Supreme Governor, His commandment is answered by our obedience. But if we think of Him as ours, and of ourselves as His, the bond is identical on either part. And though there be all the difference that there is between a drop of dew and the boundless ocean, between the little love that refreshes and bedews my heart, and the great abyss of the same that lies, not stagnant though calm, in His, yet my love is like God’s, and God’s love is like mine. And that is the deepest meaning of the name, ‘the God of Abraham, and of Isaac, and of Jacob’: - mutual possession based upon common and identical love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And then, of course, in so far as we are concerned, the name carries with it the most blessed depths of the devout life, in all its sacredness of intimacy, in all its sweetness of communion, in all its perfectness of dependence, in all its victory over self, in all its triumphant appropriation, as its very own, of the common and universal good. It is much to be able to say ‘Our God, our help in ages past.’ It is more to be able to say ‘My Lord and my God.’ And that appropriation deprives no other of his possession of God. I do not rob you of one beam of the sunshine when it irradiates my vision. We take in of the common land that which belongs to us, and no other man is the poorer or has the less for his. My God is thy God; and when we each realise our individual and personal relation ‘to Him, as expressed by these two little words, then we are able to say, in close union, ‘Our God, the God and Father of us all.’ So much, then, for the name.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now a word or two, in the second place, as to what that name pledges God to do.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "He is ‘not ashamed’ of it, ‘for He hath prepared for them a city.’ Now I do not need to enter at all upon the question as to whether the three patriarchs to whom my text has original reference had any notion of a future life. It matters nothing where .or how they thought that that coming blessing towards which they were ever looking was to be realised. The point of the text is that, in any case, they were servants of a future promised to them by God, as they believed, and that that future shaped their whole life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Think of what their life was. How all their days, from the moment when Abraham left his home, to the moment when the dying Jacob said, with a passion of unfilled expectancy, which yet had in it no hesitancy or doubt or rebuke, ‘I have waited for Thy salvation, O Lord,’ that future shaped their whole career! And then, if the end of all was that they lay down in the dust and died, having been lured on from step to step by dazzling illusions dangled before them, which were nothing but dreams, what about the God who did it? and what about their relation to Him! Would there be anything in such a God deserving to be worshipped, Might He not be ashamed of ‘being called their God’ if that was all that they got thereby? God needs the City for His own vindication.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now that seems to be a daring way of putting it, hut it is only another form of expressing a very plain thought, that the facts of the religious life here on earth are such as necessarily do involve a future of blessedness, and a heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I need not, I suppose, dwell for more than just in a sentence upon the first plain way in which this truth may be illustrated - namely, that nothing but a future life of blessedness, such as we usually connote by the simple name ‘heaven,’ saves God’s veracity and the truthfulness of His promises. If we believe that the awful silence of the universe has ever been broken by a divine voice; if we believe that God has said anything to men - apart, I mean, from the revelation of Himself made by our nature and in our daily experience - we must believe that He has promised a life to come. And unless such a life do await those who, humbly and with many faults and imperfections, have yet clung to Him as theirs, and yielded themselves to Him as His possession, then",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘The pillared firmament is rottenness, And earth’s base built on stubble.’",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘The pillared firmament is rottenness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And earth’s base built on stubble.’",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Let God be true and every man a lie. Unless there is a heaven, He has flashed before us an illusion like that which has tempted many a wanderer into the bog to perish. He has fooled us with a mirage, which at the distance looked like palm-trees and cool, flashing lakes, and when we reach it is only burning sand, strewn with bleached bones of the generations that have been cheated before us. ‘God is not ashamed... for He hath prepared a city.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But, then, there is another thought, closely con-netted with the preceding, and yet capable of being dealt with separately, and that is that there is a blot ineffaceable on the divine character unless the desires which He Himself has implanted have a reality corresponding to them. That is true, of course, in the most absolute sense, in regard to all the physical necessities and yearnings which the animal nature possesses. In all that region God never sends mouths but He sends meat to fill them; and need is the precursor and the prophecy of supply. So it is in regard to the whole creation; so it is in regard to that in us which we share in common with them. Care never irks the full-fed beast. No ungratified desires torture the frame of the short-lived creatures. ‘Foxes have holes, and the birds of air have their roosting-places’; and all beings dwell in an environment absolutely corresponding to their capacities, and fitted to satisfy their necessities. But amongst ‘them stalks the exile of creation, man; blessed, though he sometimes thinks he is cursed, with longings which the world has nothing to satisfy; and with ideals which are never capable of realisation amidst the imperfections and fleetingnesses of time. And is that to be all? If so, then God is a tyrant and not a god, and there is little to love in such a character, and He might be ashamed, if He is not, to have made men like that, so ill-fitted for their abode, and to have bestowed upon them the possibility of imagining that to which realisation shall be for ever denied.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And if that is true in regard of many of the desires of life, apart altogether from religion, it becomes still more manifestly and eminently true in regard of Christian experience and devout emotions. For if there is any one thing which an acceptance of Christianity in the heart and life is sure to do, it is to kindle and make dominant longings, yearnings rising sometimes to pain, which the world is utterly unable to satisfy. Is it ever to be so? Then, oh then, better for us that we should never have known that name; better for us that we had nourished a blind life within our brains; better for us that we had never been born. But ‘He hath prepared for them a city,’ where wishes shall be embodied, and the ideal shall be reality, and desires shall be fulfilled, and everything that has dwelt, silently and secretly, in the chambers of the imagination shall come forth into the sunlight. Morning dreams are proverbially true. ‘We are not of the night, nor of the darkness: we are the children of the day,’ and our dreams are one day to pass into the sober certainty of waking bliss.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Then there is another thought still, and that is that it would be a blot ineffaceable on the divine character if all the discipline of life were to have no field in the future on which its results could be manifested. These three poor men were schooled by many sorrows. What were they all for? For the City. And in like manner the facts of our earthly life and our Christian experiences are equally inexplicable and confounding unless beyond these dim and trifling things of time there lie the sunlit and solemn fields of eternity, in which whatsoever of force, valor, worthiness, manhood, we have made our own here shall expatiate for ever more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I do not mean that life is so sad and weary that we need to call another world into existence to redress the iralante of the old. I think that is only very partially true, for we are always apt in such considerations to minimize the pleasures on the whole, and to exaggerate the pains on the whole, of the earthly life. But I mean that the one true view of all that befalls us here on earth is discipline; and that discipline implies an end for which it is applied, and a realm in which its results are to be manifested. And if God carefully trains us, passes us through varieties of condition, in order to evolve in us a character conformed to His will; puts us to the long threescore years and ten of the apprenticeship, and then has no workshop in which to occupy us afterwards, we are reduced to a state of utter intellectual bewilderment, and life is an inextricable tangle and puzzle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "You may go into certain prehistoric depots, where you will find lying by thousands flint weapons which have been carefully chipped and shaped and polished, and then, apparently, left in a heap, and never anything done with them. Is the world a great cemetery of weapons prepared and then tossed aside like that? We need a heaven where the faithfulness of the servant shall be exchanged for the joy of the Lord, and he that was faithful in a few things shall be made ruler over many things.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now a word about my last thought; and that is, what this name binds Christian people to seek.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "My text in its former part says, ‘They desire a better country, that is, a heavenly: wherefore God is not ashamed to be called their God.’ If Abraham, instead of stopping under the oak tree at Mature, had gone down into Sodom with Lot, and taken up his quarters there; or if he had become a naturalized citizen of Hebron, and struck up alliances with the children of Heth, would the Sodomites or the Hebronites or the Hittites have thought any the better of him therefore? As long as he kept apart from them, he witnessed to the promise, and God looked upon him and blessed him. But if, professing to look for ‘the city which hath the foundations,’ he had not been content to dwell in tabernacles, God would have been ashamed of him to be called his God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Translate that into plain English, and it is this. As long as Christian people live like pilgrims and strangers, they are worthy of being called God’s, and God is glad to be called theirs. And as long as they do so, the world will know a religious man when it sees him, and, though it may not like him, it will at least respect him. But a secularized Church or individuals who say that they are Christians, and who have precisely the same estimates of good and evil as the world has, and live by the same maxims, and pursue the same aims, and never lift their eyes to look at the City beyond the river, these are a disgrace to God and to themselves, and to the religion which they say they profess.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I cannot but feel - and feel, I think, in growing degree - that one main clause of the woful feebleness of our average Christianity is that our hopes and visions of the City which hath the foundations have become dim, and that, to a very large extent, the thoughts of ‘the rest that remaineth for the people of God’ is dormant in the minds of the mass of professing Christian people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Oh, dear friends! if we will yield to that sweet, strong appeal that is made to us in the frame, and, feeling that God is ours and we are His, will turn our hearts and thoughts more than, alas! we have done, to that blessed hope, Jesus will not be ashamed to call us brethren, nor God be ashamed to be called our God. Let us beware that we are not ashamed to be called His, nor to ‘declare plainly that we seek a country.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:8-19 We are often called to leave worldly connexions, interests, and comforts. If heirs of Abraham's faith, we shall obey and go forth, though not knowing what may befall us; and we shall be found in the way of duty, looking for the performance of God's promises. The trial of Abraham's faith was, that he simply and fully obeyed the call of God. Sarah received the promise as the promise of God; being convinced of that, she truly judged that he both could and would perform it. Many, who have a part in the promises, do not soon receive the things promised. Faith can lay hold of blessings at a great distance; can make them present; can love them and rejoice in them, though strangers; as saints, whose home is heaven; as pilgrims, travelling toward their home. By faith, they overcome the terrors of death, and bid a cheerful farewell to this world, and to all the comforts and crosses of it. And those once truly and savingly called out of a sinful state, have no mind to return into it. All true believers desire the heavenly inheritance; and the stronger faith is, the more fervent those desires will be. Notwithstanding their meanness by nature, their vileness by sin, and the poverty of their outward condition, God is not ashamed to be called the God of all true believers; such is his mercy, such is his love to them. Let them never be ashamed of being called his people, nor of any of those who are truly so, how much soever despised in the world. Above all, let them take care that they are not a shame and reproach to their God. The greatest trial and act of faith upon record is, Abraham's offering up Isaac, Ge 22:2. There, every word shows a trial. It is our duty to reason down our doubts and fears, by looking, as Abraham did, to the Almighty power of God. The best way to enjoy our comforts is, to give them up to God; he will then again give them as shall be the best for us. Let us look how far our faith has caused the like obedience, when we have been called to lesser acts of self-denial, or to make smaller sacrifices to our duty. Have we given up what was called for, fully believing that the Lord would make up all our losses, and even bless us by the most afflicting dispensations?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But now they desire a better country, that is, an heavenly - That is, at the time referred to when they confessed that they were strangers and sojourners, they showed that they sought a better country than the one which they had left. They lived as if they had no expectation of a permanent residence on earth, and were looking to another world. The argument of the apostle here appears to be based upon what is apparent from the whole history, that they had a confident belief that the land of Canaan would be given to \"their posterity,\" but as for \"themselves\" they had no expectation of permanently dwelling there, but looked to a home in the heavenly country. Hence, they formed no plans for conquest; they laid claim to no title in the soil; they made no purchases of farms for cultivation; they lived and died without owning any land except enough to bury their dead. All this appears as if they looked for a final home in a \"better country, even a heavenly.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wherefore God is not ashamed to be called their God - Since they had such an elevated aim, he was willing to speak of himself as their God and Friend. They acted as became his friends, and he was not ashamed of the relation which he sustained to them. The language to which the apostle evidently refers here is what is found in Exodus 3:6, \"I am the God of Abraham, the God of Isaac, and the God of Jacob.\" We are not to suppose that God is ever \"ashamed\" of anything that he does. The meaning here is, that they had acted in such a manner that it was fit that he should show toward them the character of a Benefactor, Protector, and Friend.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Wherefore God is not ashamed to be called their God - Since they had such an elevated aim, he was willing to speak of himself as their God and Friend. They acted as became his friends, and he was not ashamed of the relation which he sustained to them. The language to which the apostle evidently refers here is what is found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"I am the God of Abraham, the God of Isaac, and the God of Jacob.\" We are not to suppose that God is ever \"ashamed\" of anything that he does. The meaning here is, that they had acted in such a manner that it was fit that he should show toward them the character of a Benefactor, Protector, and Friend.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For he hath prepared for them a city - Such as they had expected - a heavenly residence; Hebrews 11:10. There is evidently here a reference to heaven, represented as a city - the new Jerusalem - prepared for his people by God himself; compare the notes on Matthew 25:34. Thus, they obtained what they had looked for by faith. The wandering and unsettled patriarchs to whom the promise was made, and who showed all their lives that they regarded themselves as strangers and pilgrims, were admitted to the home of permanent rest, and their posterity was ultimately admitted to the possession of the promised land. Nothing could more certainly demonstrate that the patriarchs believed in a future state than this passage. They did not expect a permanent home on earth. They made no efforts to enter into the possession of the promised land themselves. They quietly and calmly waited for the time when God would give it to their posterity, and in the meantime for themselves they looked forward to their permanent home in the heavens.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For he hath prepared for them a city - Such as they had expected - a heavenly residence; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There is evidently here a reference to heaven, represented as a city - the new Jerusalem - prepared for his people by God himself; compare the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thus, they obtained what they had looked for by faith. The wandering and unsettled patriarchs to whom the promise was made, and who showed all their lives that they regarded themselves as strangers and pilgrims, were admitted to the home of permanent rest, and their posterity was ultimately admitted to the possession of the promised land. Nothing could more certainly demonstrate that the patriarchs believed in a future state than this passage. They did not expect a permanent home on earth. They made no efforts to enter into the possession of the promised land themselves. They quietly and calmly waited for the time when God would give it to their posterity, and in the meantime for themselves they looked forward to their permanent home in the heavens.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Even in this early period of the world, therefore, there was the confident expectation of the future state; compare the notes on Matthew 22:32. We may remark, that the life of the patriarchs was, in all essential respects, such as we should lead. They looked forward to heaven; they sought no permanent possessions here; they regarded themselves as strangers and pilgrims on the earth. So should we be. In our more fixed and settled habits of life; in our quiet homes; in our residence in the land in which we were born, and in the society of old and tried friends, we should yet regard ourselves as \"strangers and sojourners.\" We have here no fixed abode. The houses in which we dwell will soon be occupied by others; the paths in which we go will soon be trod by the feet of others; the fields which we cultivate will soon be plowed and sown and reaped by others. Others will read the books which we read; sit down at the tables where we sit; lie on the beds where we repose; occupy the chambers where we shall die, and from whence we shall be removed to our graves. If we have any permanent home, it is in heaven; and that we have, the faithful lives of the patriarchs teach us, and the unerring word of God everywhere assures us. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Even in this early period of the world, therefore, there was the confident expectation of the future state; compare the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ":32. We may remark, that the life of the patriarchs was, in all essential respects, such as we should lead. They looked forward to heaven; they sought no permanent possessions here; they regarded themselves as strangers and pilgrims on the earth. So should we be. In our more fixed and settled habits of life; in our quiet homes; in our residence in the land in which we were born, and in the society of old and tried friends, we should yet regard ourselves as \"strangers and sojourners.\" We have here no fixed abode. The houses in which we dwell will soon be occupied by others; the paths in which we go will soon be trod by the feet of others; the fields which we cultivate will soon be plowed and sown and reaped by others. Others will read the books which we read; sit down at the tables where we sit; lie on the beds where we repose; occupy the chambers where we shall die, and from whence we shall be removed to our graves. If we have any permanent home, it is in heaven; and that we have, the faithful lives of the patriarchs teach us, and the unerring word of God everywhere assures us. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. Proving the truth that the old fathers did not, as some assert, \"look only for transitory promises\" [Article VII, Book of Common Prayer].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "now—as the case is.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "is not ashamed—Greek, \"Is not ashamed of them.\" Not merely once did God call himself their God, but He is NOW not ashamed to have Himself called so, they being alive and abiding with Him where He is. For, by the law, God cannot come into contact with anything dead. None remained dead in Christ's presence (Lu 20:37, 38). He who is Lord and Maker of heaven and earth, and all things therein, when asked, What is Thy name? said, omitting all His other titles, \"I am the God of Abraham, and the God of Isaac, and the God of Jacob\" [Theodoret]. Not only is He not ashamed, but glories in the name and relation to His people. The \"wherefore\" does not mean that God's good pleasure is the meritorious, but the gracious, consequence of their obedience (that obedience being the result of His Spirit's work in them in the first instance). He first so \"called\" Himself, then they so called Him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for—proof of His being \"their God,\" namely, \"He hath prepared (in His eternal counsels, Mt 20:23; 25:34, and by the progressive acts of redemption, Joh 14:2) for them a city,\" the city in which He Himself reigns, so that their yearning desires shall not be disappointed (Heb 11:14, 16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a city—on its garniture by God (compare Re 21:10-27).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But now they desire a better country, that is, an heavenly:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " having deserted this world, as strangers in it, they sought, desired, and hoped for with the greatest earnestness and fervency, a city in the country of heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 11:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", in comparison with which they contemned and despised all others; a country where there is perfection of life, and fulness of glory: it excelleth all others as far as heaven doth earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Timothy 4:18 1 Peter 1:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The state, society, enjoyments, and place, they longed for, were all heavenly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Philippians 3:20,21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 3:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; nothing lower than this world would satisfy them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wherefore God is not ashamed to be called their God:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " faith having carried them thus estranged from this world to the grave, endearing to them the promises, and engaging of them for heaven only, therefore God did not disdain them, he did not think it any disrepute to him to own them his, but esteemed it an honour and reputation to him, took np his joy and delight in them: see him owning them when dead, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 3:6,15 Mt 22:31,32",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",15 Mt 22:31,32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; surnaming himself by them, and adopting them as his own, as Jacob did Joseph’s sons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 48:5,6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 48:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; so that though they are dead as to their bodies, yet they are alive as to their souls, and are owned by God in his name and title, and are assured, as to their dust, of a resurrection; for he will do it, giving them that rest that they never had in their pilgrimage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For he hath prepared for them a city; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that heavenly state and place which they sought for, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 11:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which infinitely transcended Cannan, and the Jerusalem in it, of which they were denizens while here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephesians 2:19 Philippians 3:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 3:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; the pleasant, peaceful, rich, and glorious metropolis of the living God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 12:22 13:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 13:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; which shall make abundant amends for all their sorrows, sufferings, and restless wanderings on earth, where they shall enjoy pleasures, riches, honours, and rest for evermore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Peter 1:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But now they desire a better country,.... Which is not to be understood of the then present time, in which the apostle wrote; for the patriarchs, of whom he speaks, were not then on earth, nor in any third place between heaven and earth; they were then in heaven; and though there are indeed in heaven desires after perfect happiness, in soul and body; yet this intends the desires of these saints when on earth, and which are common to all believers in the present state of things; who, as the patriarchs desired a better country than Chaldea, or even Canaan itself, so they desire a better country than this world; and such is heaven: it is on high; here are no noxious and pestilential vapours, no mists or fogs beclouding, no storms and tempests, but it is full of light and glory; having the delightful breezes of divine love, and the comfortable gales of the blessed Spirit; here is no heat of persecution, nor coldness, nor chills of affection; here is plenty of most delicious fruits, no hunger nor thirst; and here are riches, which are solid, satisfying, durable, safe and sure: many are the liberties and privileges here enjoyed; here is a freedom from a body subject to diseases and death, from a body of sin and death, from Satan's temptations, from all doubts, fears, and unbelief, and from all sorrows and afflictions; the inhabitants of it are the spirits of just men made perfect, angels, God, Father, Son, and Spirit, and Christ in human nature; upon all which accounts it is abundantly the better country, and as it is explained, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that is, an heavenly; an inheritance in heaven, an house eternal in the heavens, the kingdom of heaven; and it is no wonder that it should be desired by such who know it, and the nature of it: the word denotes a vehement desire; and it is such, that the saints desire to depart from this world, and go unto it; which shows that they are weaned from this, and have seen something glorious in another. Remarkable is the saying of Anaxagoras (u) who, when one said to him, hast thou no regard to thy country? answered, I have, and that the greatest, pointing with his fingers towards heaven; and, says Philo the Jew (w), the soul of every wise man has heaven for his country, and the earth as a strange place: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wherefore God is not ashamed to be called their God; their covenant God and Father; See Gill on Hebrews 8:10, even though he is the God of the whole earth; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "wherefore God is not ashamed to be called their God; their covenant God and Father; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", even though he is the God of the whole earth; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for he hath prepared for them a city; in his council and covenant, and by his Son; See Gill on Hebrews 11:10. This proves that he is not ashamed of the relation he stands in to them, since he has made a provision for them to dwell with him to all eternity. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for he hath prepared for them a city; in his council and covenant, and by his Son; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This proves that he is not ashamed of the relation he stands in to them, since he has made a provision for them to dwell with him to all eternity. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) Laert. in Vit. Anaxag. p. 92. (w) De Agricultura, p. 196. Vid. ib. de Confus. Ling. p. 331. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) Laert. in Vit. Anaxag. p. 92. (w) De Agricultura, p. 196. Vid. ib. de Confus. Ling. p. 331. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But now they desire a better country, that is, an heavenly: wherefore God is not ashamed to be called their God: for he hath prepared for them a city.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Νῦν δέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] the logical: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὀρέγεσθαί τινος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] elsewhere in the N. T. only ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διό",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wherefore, sc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". on account of their seeking after the heavenly country.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θεὸς ἐπικαλεῖσθαι αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Epexegesis to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτούς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is not ashamed of them, namely, to be called their God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Reference to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ εἶπεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "· ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐγώ εἰμι ὁ θεὸς τοῦ πατρός σου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θεὸς Ἀβραὰμ καὶ θεὸς Ἰσαὰκ καὶ θεὸς Ἰακώβ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ibid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ ἐπαισχύνεται κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". presupposes the idea of an intimate communion of God with the patriarchs. Comp. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 22:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 12:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 20:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. The fact instanced in proof of this communion is added in the concluding words: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡτοίμασεν γὰρ αὐτοῖς πόλιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] for He has prepared for them a city. By the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πόλις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is again meant, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the heavenly Jerusalem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡτοίμασεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", however, may equally well signify: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He has prepared it for them, that they may one day possess the same as a dwelling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Schlichting, Grotius, Owen, Calov, Böhme, de Wette, Delitzsch, Hofmann), as: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He has already conferred it upon them as a possession",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so Braun and Bleek).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] “But, as the case now is.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they desire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word means, “they are yearning for,” “they stretch forth their hands towards.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is not ashamed to be called their God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, “is not ashamed of them, to be called their God” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:6-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he hath prepared for them a city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The “inheritance incorruptible and undefiled, and that fadeth not away, reserved in heaven for us” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This digression is meant to shew that the faith and hopes of the Patriarchs reached beyond mere temporal blessings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Οὐκ ἐπαισχύνεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is not ashamed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although they are inhabitants of the earth, and strangers: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He is not ashamed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because He has bestowed on them great blessedness, such as it becomes God to confer, and has fulfilled the promises which were made to them; therefore, not only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is He not ashamed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but derives praise from it [glories in it]. A Meiosis. Or also, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He is not ashamed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they eagerly grasp at it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὀρέγονται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); provided that it does not seem (only it must not be thought) as if God’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "good pleasure",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (in them) was the meritorious consequence of their obedience.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπικαλεῖσθαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to be called",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") [to have Himself called.] A verb in the middle voice. First, He called Himself, then they so called Him: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " GOD ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of Abraham",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πόλιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in which He Himself reigns. [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How great may we suppose the splendour to be that must belong to it, since it is God Himself who shows it!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrews 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now they desire (νΰν ὀρέγονται)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Νῦν now is logical: as the case now stands. For ὀρέγονται desire, see on 1 Timothy 3:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Νῦν now is logical: as the case now stands. For ὀρέγονται desire, see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Is not ashamed (οὐκ ἐπαισχύνεται)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because they have commended themselves to God by their faith, so that he acknowledges them as his own. Comp. Hebrews 2:11; Mark 8:28, Mark 8:38; Romans 1:16; 2 Timothy 1:8, 2 Timothy 1:16.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Because they have commended themselves to God by their faith, so that he acknowledges them as his own. Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 8:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 8:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To be called their God (Θεὸς ἐπικαλεῖσθαι αὐτῶν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit. to be surnamed. Comp. Acts 4:36; Acts 10:5, Acts 10:18, Acts 10:32. God was called the God of Abraham, of Isaac, and of Jacob. See Exodus 3:6.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lit. to be surnamed. Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 4:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God was called the God of Abraham, of Isaac, and of Jacob. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For he hath prepared for them a city (ἡτοίμασιν γὰρ αὐτοῖς πόλιν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Comp. Matthew 25:34; John 14:2; Revelation 21:2. City is significant, as showing that the fulfillment of God's promise lies in introducing them into the perfection of social life. Comp. Revelation 3:12; Revelation 21:2, Revelation 21:10; Revelation 22:19. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 14:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". City is significant, as showing that the fulfillment of God's promise lies in introducing them into the perfection of social life. Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]