[{"header":"Jesus Prays for His Disciples"},{"num":17,"verse":"After Jesus finished saying this, he looked up to heaven and said, “Father, the hour has come. Give glory to your Son, so that the Son may give glory to you. "},{"num":2,"verse":"For you gave him authority over all people, so that he might give eternal life to all those you gave him. "},{"num":3,"verse":"And eternal life means to know you, the only true God, and to know Jesus Christ, whom you sent. "},{"num":4,"verse":"I have shown your glory on earth; I have finished the work you gave me to do. "},{"num":5,"verse":"Father! Give me glory in your presence now, the same glory I had with you before the world was made."},{"num":6,"verse":"“I have made you known to those you gave me out of the world. They belonged to you, and you gave them to me. They have obeyed your word, "},{"num":7,"verse":"and now they know that everything you gave me comes from you. "},{"num":8,"verse":"I gave them the message that you gave me, and they received it; they know that it is true that I came from you, and they believe that you sent me."},{"num":9,"verse":"“I pray for them. I do not pray for the world but for those you gave me, for they belong to you. "},{"num":10,"verse":"All I have is yours, and all you have is mine; and my glory is shown through them. "},{"num":11,"verse":"And now I am coming to you; I am no longer in the world, but they are in the world. Holy Father! Keep them safe by the power of your name, the name you gave me, so that they may be one just as you and I are one. "},{"num":12,"verse":"While I was with them, I kept them safe by the power of your name, the name you gave me. I protected them, and not one of them was lost, except the man who was bound to be lost—so that the scripture might come true. "},{"num":13,"verse":"And now I am coming to you, and I say these things in the world so that they might have my joy in their hearts in all its fullness. "},{"num":14,"verse":"I gave them your message, and the world hated them, because they do not belong to the world, just as I do not belong to the world. "},{"num":15,"verse":"I do not ask you to take them out of the world, but I do ask you to keep them safe from the Evil One. "},{"num":16,"verse":"Just as I do not belong to the world, they do not belong to the world. "},{"num":17,"verse":"Dedicate them to yourself by means of the truth; your word is truth. "},{"num":18,"verse":"I sent them into the world, just as you sent me into the world. "},{"num":19,"verse":"And for their sake I dedicate myself to you, in order that they, too, may be truly dedicated to you."},{"num":20,"verse":"“I pray not only for them, but also for those who believe in me because of their message. "},{"num":21,"verse":"I pray that they may all be one. Father! May they be in us, just as you are in me and I am in you. May they be one, so that the world will believe that you sent me. "},{"num":22,"verse":"I gave them the same glory you gave me, so that they may be one, just as you and I are one: "},{"num":23,"verse":"I in them and you in me, so that they may be completely one, in order that the world may know that you sent me and that you love them as you love me."},{"num":24,"verse":"“Father! You have given them to me, and I want them to be with me where I am, so that they may see my glory, the glory you gave me; for you loved me before the world was made. "},{"num":25,"verse":"Righteous Father! The world does not know you, but I know you, and these know that you sent me. "},{"num":26,"verse":"I made you known to them, and I will continue to do so, in order that the love you have for me may be in them, and so that I also may be in them.”"}]