[{"num":17,"verse":"These things said Rebbe, Melech HaMoshiach. And having lifted up his eyes to Shomayim, he said, Avi, the sha’ah (hour, time) has come. Give kavod to your Ben [HaElohim], that HaBen may give kavod to You,"},{"num":2,"verse":"Vi-bahlt (since) you have given him samchut (authority) over kol basar for this purpose: in order that all which you have given him, HaAv may give to them Chayyei Olam. [DANIEL 7:14]"},{"num":3,"verse":"And this is Chayyei Olam, that they may have da’as of the only Elohei HaEmes (G-d of Truth, True G-d) and Yehoshua, Rebbe, Melech HaMoshiach whom You sent."},{"num":4,"verse":"I have given You kavod on ha’aretz, having completed the melakhah which You have given me, that I should do."},{"num":5,"verse":"And now give me kavod, Avi, along with Yourself with the kavod which I was having with You before HaOlam came to be [Yn 1:1 3; Prov 8:30; 30:4]."},{"num":6,"verse":"I manifested Shemecha to the Bnei Adam whom You gave me out of the Olam Hazeh. They were Yours and to me You gave them, and regarding the dvar of You they have been shomer."},{"num":7,"verse":"Now they have da’as that all things whatsoever You have given to me are from You."},{"num":8,"verse":"Because the dvarim which You gave me, of these I have been shomer, and they received them, and they have da’as beemes that from You I came forth, and they have emunah that You sent me."},{"num":9,"verse":"I make a bakosha (petition, request) concerning them, I do not make a bakosha concerning the Olam Hazeh, but concerning the Ones You have given me, because they are Yours."},{"num":10,"verse":"And all things that are mine are Yours, and Your things are mine, and I have been given kavod in them."},{"num":11,"verse":"And I am no longer in the Olam Hazeh, but they are in the Olam Hazeh, and I am coming to You, Avi HaKadosh. Be shomer over them in Shmecha, which You have given me, that they may be Echad as we are Echad. [Ps 133:1; Dt 6:4; Gn 2:24]"},{"num":12,"verse":"When I was with them, I was keeping them in the Shem of You, which You have given me, and I kept shomer, and none of them perished or was lost, except the Ben HaAvaddon (the Son of Destruction, Perdition, the state of final spiritual ruin, Gehinnom), that the Kitvei Hakodesh might be fulfilled. [TEHILLIM 24:22; 41:9; 109:4,5,7,8]"},{"num":13,"verse":"And now to You I am coming, and I speak these things in the Olam Hazeh that they may have my simcha made shleimah in themselves."},{"num":14,"verse":"I have given to them the dvar of You and the Olam Hazeh has had sin’as chinom (hatred without cause) of them, because they are not of the Olam Hazeh, just as I am not of the Olam Hazeh."},{"num":15,"verse":"I do not make a bakosha that You take them out of the Olam Hazeh, but that You keep them from HaRah."},{"num":16,"verse":"They are not of the Olam Hazeh, just as I am not of the Olam Hazeh."},{"num":17,"verse":"Set them apart for a use that is kodesh in HaEmes (The Truth). [1Kgs 17:24; 2Sm 7:28] Your Dvar is HaEmes."},{"num":18,"verse":"As You sent me into the Olam Hazeh, so also I send them into the Olam Hazeh. [TEHILLIM 119:142, 160]"},{"num":19,"verse":"And for their sake, I set myself apart as kodesh that they also may be set apart for use that is kodesh in HaEmes."},{"num":20,"verse":"However, I do not make a bakosha concerning these only, but also concerning the ones becoming ma’aminim in me [as Moshiach] because of their Dvar,"},{"num":21,"verse":"That all may be echad, as You, Avi, are in me and I am in You, [YIRMEYAH 32:39] that also they may be in us, that the Olam Hazeh may have emunah (faith) that You sent me."},{"num":22,"verse":"The kavod which You have given me, I have given them, that they may be echad just as we are echad."},{"num":23,"verse":"I in them and You in me that they may become tamim (perfect) in Achdut (Unity) that the Olam Hazeh may have da’as that You sent me, and had ahavah for them, just as You have ahavah for me."},{"num":24,"verse":"Elohim Avi, as to that which You have given me, I desire that where I am, those also may be with me, that they may behold my kavod, which You have given me, because You had ahavah for me before the hivvased haOlam."},{"num":25,"verse":"Avi HaTzaddik, indeed the world did not have da’as of You, but I knew You, and these ones knew that You sent me."},{"num":26,"verse":"And I have made known to them the Shem of You and will make it known, that the ahavah with which You loved me may be in them and I in them."}]