[[],[{"type":"header","content":"The Futility of Pleasure and Possessions"},{"type":"prose","content":"I said to myself, “Come now, I will test you with pleasure  gratification; so enjoy yourself  have a good time.” But behold, this too was vanity (futility, meaninglessness). "}],[{"type":"prose","content":"I said of laughter, “It is madness,” and of pleasure, “What does it accomplish?” "}],[{"type":"prose","content":"I explored with my mind how to gratify myself with wine while [at the same time] having my mind remain steady  guide me wisely; and how to take control of foolishness, until I could see what was good for the sons of men to do under heaven all the days of their lives. "}],[{"type":"prose","content":"I made great works: I built houses for myself; I planted vineyards for myself; "}],[{"type":"prose","content":"I made gardens and orchards for myself and I planted in them all kinds of fruit trees; "}],[{"type":"prose","content":"I made pools of water for myself from which to water the forest  make the trees bud. "}],[{"type":"prose","content":"I bought male and female slaves and had slaves born in my house. I also possessed herds and flocks larger than any who preceded me in Jerusalem. "}],[{"type":"prose","content":"Also, I collected for myself silver and gold and the treasure of kings and provinces. I provided for myself male singers and female singers, and the delights  pleasures of men—many concubines."}],[{"type":"prose","content":"So I became great and excelled more than all who preceded me in Jerusalem. My wisdom also remained with me. "}],[{"type":"prose","content":"Whatever my eyes looked at with desire I did not refuse them. I did not withhold from my heart any pleasure, for my heart was pleased because of all my labor; and this was my reward for all my labor. "}],[{"type":"prose","content":"Then I considered all which my hands had done and labored to do, and behold, all was vanity and chasing after the wind and there was no profit (nothing of lasting value) under the sun."},{"type":"header","content":"Wisdom Excels Folly"}],[{"type":"prose","content":"So I turned to consider [secular] wisdom, madness, and folly; for what will the man do who succeeds the king? Nothing  what has already been done. "}],[{"type":"prose","content":"Then I saw that [even secular] wisdom [that brings sorrow] is better than [the pleasures of] folly  self-indulgence as light excels darkness. "}],[{"type":"prose","content":"The wise man’s eyes are in his head, but the fool walks in darkness; and yet I know that [in the end] one fate happens to them both. "}],[{"type":"prose","content":"Then I said to myself, “As it happens to the fool, so death will also happen to me. What use is it then for me to be extremely wise?” Then I said in my heart, “This too is vanity (meaningless).” "}],[{"type":"prose","content":"For there is no [more] lasting remembrance of the wise man than of the fool, since in the days to come all will be long forgotten. And how does the wise man die? Even as the fool! "}],[{"type":"prose","content":"So I hated life, for the work which had been done under the sun caused me only great sorrow; because all is futility and chasing after the wind."},{"type":"header","content":"The Futility of Labor"}],[{"type":"prose","content":"So I hated all the fruit (gain) of my labor for which I had labored under the sun, because I must leave it to the man who will succeed me. "}],[{"type":"prose","content":"And who knows whether he will be a wise man or a fool? Yet he will have control over all the fruit of my labor for which I have labored by acting wisely under the sun. This too is vanity (futility, self-conceit). "}],[{"type":"prose","content":"So I turned aside and let my heart despair over all the fruit of my labor for which I had labored under the sun. "}],[{"type":"prose","content":"For there is a man who has labored with wisdom and knowledge and skill, yet gives his legacy to one who has not labored for it. This too is vanity and a great evil. "}],[{"type":"prose","content":"For what does a man get from all his labor and from the striving  sorrow of his heart with which he labors under the sun? "}],[{"type":"prose","content":"For all his days his work is painful and sorrowful; even at night his mind does not rest. This too is vanity (worthless)."}],[{"type":"prose","content":"There is nothing better for a man than to eat and drink and assure himself that there is good in his labor. Even this, I have seen, is from the hand of God. "}],[{"type":"prose","content":"For who can eat and who can have enjoyment without Him? "}],[{"type":"prose","content":"For to the person who pleases Him God gives wisdom, knowledge, and joy; but to the sinner He gives the work of gathering and collecting so that he may give to one who pleases God. This too is vanity and chasing after the wind."}]]