[{"num":2,"verse":"I said to myself, Come, I will make you experience pleasure; enjoy what is good! But this too was pointless!"},{"num":2,"verse":"Merriment, I thought, is madness; pleasure, of no use at all."},{"num":3,"verse":"I tried cheering myself with wine and by embracing folly—with wisdom still guiding me—until I might see what is really worth doing in the few days that human beings have under heaven."},{"num":4,"verse":"I took on great projects: I built houses for myself, planted vineyards for myself."},{"num":5,"verse":"I made gardens and parks for myself, planting every kind of fruit tree in them."},{"num":6,"verse":"I made reservoirs for myself to water my lush groves."},{"num":7,"verse":"I acquired male servants and female servants; I even had slaves born in my house. I also had great herds of cattle and sheep, more than any who preceded me in Jerusalem."},{"num":8,"verse":"I amassed silver and gold for myself, the treasures of kings and provinces. I acquired male and female singers for myself, along with every human luxury, treasure chests galore!"},{"num":9,"verse":"So I became far greater than all who preceded me in Jerusalem. Moreover, my wisdom stood by me."},{"num":10,"verse":"I refrained from nothing that my eyes desired. I refused my heart no pleasure. Indeed, my heart found pleasure from the results of my hard work; that was the reward from all my hard work."},{"num":11,"verse":"But when I surveyed all that my hands had done, and what I had worked so hard to achieve, I realized that it was pointless—a chasing after wind. Nothing is to be gained under the sun."},{"num":12,"verse":"My reflections then turned to wisdom, madness, and folly. What can the king’s heir do but what has already been done?"},{"num":13,"verse":"I saw that wisdom is more beneficial than folly, as light is more beneficial than darkness."},{"num":15,"verse":"So I thought to myself, What happens to the fool will also happen to me. So why have I been so very wise? I said to myself, This too is pointless."},{"num":16,"verse":"There is no eternal memory of the wise any more than the foolish, because everyone is forgotten before long. How can the wise die just like the fool?"},{"num":17,"verse":"So I hated life, because the things that happen under the sun were troublesome to me. Definitely, everything is pointless—just wind chasing."},{"num":18,"verse":"I hated the things I worked so hard for here under the sun, because I will have to leave them to someone who comes after me."},{"num":19,"verse":"And who knows whether that one will be wise or foolish? Either way, that person will have control over the results of all my hard work and wisdom here under the sun. That too is pointless."},{"num":20,"verse":"I then gave myself up to despair, as I thought about all my laborious hard work under the sun,"},{"num":21,"verse":"because sometimes those who have worked hard with wisdom, knowledge, and skill must leave the results of their hard work as a possession to those who haven’t worked hard for it. This too is pointless—it’s a terrible wrong."},{"num":22,"verse":"I mean, What do people get for all their hard work and struggles under the sun?"},{"num":23,"verse":"All their days are pain, and their work is aggravation; even at night, their hearts don’t find rest. This too is pointless."},{"num":24,"verse":"There’s nothing better for human beings than to eat, drink, and experience pleasure in their hard work. I also saw that this is from God’s hand—"},{"num":25,"verse":"Who can eat and find enjoyment otherwise?—"},{"num":26,"verse":"because God gives wisdom, knowledge, and joy to those who please God. But to those who are offensive, God gives the task of hoarding and accumulating, but only so as to give it all to those who do please God. This too is pointless and a chasing after wind."}]