[{"header":"Greeting"},{"num":1,"verse":"From Paul, an apostle who is not sent from human authority or commissioned through human agency, but sent through Jesus Christ and God the Father who raised him from the dead;"},{"num":2,"verse":"and from all the brothers and sisters with me."},{"num":3,"verse":"Grace and peace to you from God the Father and the Lord Jesus Christ."},{"num":4,"verse":"He gave himself for our sins, so he could deliver us from this present evil age, according to the will of our God and Father."},{"num":5,"verse":"To God be the glory forever and always! Amen."},{"header":"The gospel challenged in Galatia"},{"num":6,"verse":"I’m amazed that you are so quickly deserting the one who called you by the grace of Christ to follow another gospel."},{"num":7,"verse":"It’s not really another gospel, but certain people are confusing you and they want to change the gospel of Christ."},{"num":8,"verse":"However, even if we ourselves or a heavenly angel should ever preach anything different from what we preached to you, they should be under a curse."},{"num":9,"verse":"I’m repeating what we’ve said before: if anyone preaches something different from what you received, they should be under a curse!"},{"header":"Paul’s leadership"},{"num":10,"verse":"Am I trying to win over human beings or God? Or am I trying to please people? If I were still trying to please people, I wouldn’t be Christ’s slave."},{"num":11,"verse":"Brothers and sisters, I want you to know that the gospel I preached isn’t human in origin."},{"num":12,"verse":"I didn’t receive it or learn it from a human. It came through a revelation from Jesus Christ."},{"num":13,"verse":"You heard about my previous life in Judaism, how severely I harassed God’s church and tried to destroy it."},{"num":14,"verse":"I advanced in Judaism beyond many of my peers, because I was much more militant about the traditions of my ancestors."},{"num":15,"verse":"But God had set me apart from birth and called me through his grace. He was pleased"},{"num":16,"verse":"to reveal his Son to me, so that I might preach about him to the Gentiles. I didn’t immediately consult with any human being."},{"num":17,"verse":"I didn’t go up to Jerusalem to see the men who were apostles before me either, but I went away into Arabia and I returned again to Damascus."},{"num":18,"verse":"Then after three years I went up to Jerusalem to visit Cephas and stayed with him fifteen days."},{"num":19,"verse":"But I didn’t see any other of the apostles except James the brother of the Lord."},{"num":20,"verse":"Before God, I’m not lying about the things that I’m writing to you!"},{"num":21,"verse":"Then I went into the regions of Syria and Cilicia,"},{"num":22,"verse":"but I wasn’t known personally by the Christian churches in Judea."},{"num":23,"verse":"They only heard a report about me: “The man who used to harass us now preaches the faith that he once tried to destroy.”"},{"num":24,"verse":"So they were glorifying God because of me."}]