[{"num":1,"verse":"From the apostle Paul and from all the Lord’s followers with me."},{"num":3,"verse":"I pray that God the Father and our Lord Jesus Christ will be kind to you and will bless you with peace! "},{"num":4,"verse":"Christ obeyed God our Father and gave himself as a sacrifice for our sins to rescue us from this evil world. "},{"num":5,"verse":"God will be given glory forever and ever. Amen."},{"header":"The Only True Message"},{"num":6,"verse":"I am shocked that you have so quickly turned from God, who chose you because of his wonderful kindness. You have believed another message, "},{"num":7,"verse":"when there is really only one true message. But some people are causing you trouble and want to make you turn away from the good news about Christ. "},{"num":8,"verse":"I pray that God will punish anyone who preaches anything different from our message to you! It doesn’t matter if that person is one of us or an angel from heaven. "},{"num":9,"verse":"I have said it before, and I will say it again. I hope God will punish anyone who preaches anything different from what you have already believed."},{"num":10,"verse":"I am not trying to please people. I want to please God. Do you think I am trying to please people? If I were doing that, I would not be a servant of Christ."},{"header":"How Paul Became an Apostle"},{"num":11,"verse":"My friends, I want you to know that no one made up the message I preach. "},{"num":12,"verse":"It wasn’t given or taught to me by some mere human. My message came directly from Jesus Christ when he appeared to me."},{"num":13,"verse":"You know how I used to live as a Jew. I was cruel to God’s church and even tried to destroy it. "},{"num":14,"verse":"I was a much better Jew than anyone else my own age, and I obeyed every law that our ancestors had given us. "},{"num":15,"verse":"But even before I was born, God had chosen me. He was kind and had decided "},{"num":16,"verse":"to show me his Son, so that I would announce his message to the Gentiles. I didn’t talk this over with anyone. "},{"num":17,"verse":"I didn’t say a word, not even to the men in Jerusalem who were apostles before I was. Instead, I went at once to Arabia, and afterwards I returned to Damascus."},{"num":18,"verse":"Three years later I went to visit Peter in Jerusalem and stayed with him for fifteen days. "},{"num":19,"verse":"The only other apostle I saw was James, the Lord’s brother. "},{"num":20,"verse":"And in the presence of God I swear I am telling the truth."},{"num":21,"verse":"Later, I went to the regions of Syria and Cilicia. "},{"num":22,"verse":"But no one who belonged to Christ’s churches in Judea had ever seen me in person. "},{"num":23,"verse":"They had only heard that the one who had been cruel to them was now preaching the message that he had once tried to destroy. "},{"num":24,"verse":"And because of me, they praised God."}]