[{"num":1,"verse":"1 Straight after the salutation, 6 He reprehendeth the Galatians for revolting, 9 from his Gospel, 15 which he received from God, 17 before he had communicated with any of the Apostles."},{"num":1,"verse":"Paul an Apostle (not of men, neither by man, but by Jesus Christ, and God the Father which hath raised him from the dead.)"},{"num":2,"verse":"And all the brethren which are with me unto the Churches of Galatia:"},{"num":3,"verse":"Grace be with you, and peace from God the Father, and from our Lord Jesus Christ,"},{"num":4,"verse":"Which gave himself for our sins, that he might deliver us from this present evil world according to the will of God even our Father,"},{"num":5,"verse":"To whom be glory forever and ever, Amen."},{"num":6,"verse":"I marvel that ye are so soon removed away unto another Gospel, from him that had called you in the grace of Christ,"},{"num":7,"verse":"Which is not another Gospel, save that there be some which trouble you, and intend to pervert the Gospel of Christ."},{"num":8,"verse":"But though that we, or an Angel from heaven preach unto you otherwise than that which we have preached unto you, let him be accursed."},{"num":9,"verse":"As we said before, so say I now again, If any man preach unto you otherwise than that ye have received, let him be accursed."},{"num":10,"verse":"For now preach I man’s doctrine, or God’s? or go I about to please men? for if I should yet please men, I were not the servant of Christ."},{"num":11,"verse":"Now I certify you, brethren, that the Gospel which was preached of me, was not after man."},{"num":12,"verse":"For neither received I it of man, neither was I taught it, but by the revelation of Jesus Christ."},{"num":13,"verse":"For ye have heard of my conversation in time past, in the Jewish religion, how that I persecuted the Church of God extremely, and wasted it,"},{"num":14,"verse":"And profited in the Jewish religion above many of my companions of mine own nation, and was much more zealous of the traditions of my fathers."},{"num":15,"verse":"But when it pleased God (which had separated me from my mother’s womb, and called me by his grace.)"},{"num":16,"verse":"To reveal his Son in me, that I should preach him among the Gentiles immediately, I communicated not with flesh and blood:"},{"num":17,"verse":"Neither came I again to Jerusalem to them which were Apostles before me, but I went into Arabia, and turned again unto Damascus."},{"num":18,"verse":"Then after three years I came again to Jerusalem, to visit Peter, and abode with him fifteen days."},{"num":19,"verse":"And none other of the Apostles saw I, save James the Lord’s brother."},{"num":20,"verse":"Now the things which I write unto you, behold, I witness before God, that I lie not."},{"num":21,"verse":"After that, I went into the coasts of Syria and Cilicia: for I was unknown by face unto the Churches of Judea which were in Christ."},{"num":22,"verse":"But they had heard only some say, He which persecuted us in time past, now preacheth the faith which before he destroyed."},{"num":23,"verse":"And they glorified God for me."}]