[{"header":"Introduction"},{"num":1,"verse":"From Paul, an apostle of Jesus Christ. My apostleship was not granted to me by men, for I was appointed by Jesus Christ, and God the Father, who raised him from the dead. "},{"num":2,"verse":"All the brothers and sisters join with me as I write this letter to the churches throughout the region of central Turkey."},{"num":3,"verse":"May God’s undeserved kindness and total well-being that flow from our Father God and from the Lord Jesus be yours. "},{"num":4,"verse":"He’s the Anointed One who offered himself as the sacrifice for our sins! He has rescued us from this evil world system and set us free, just as our Father God desired. "},{"num":5,"verse":"May all the glory be to God alone, throughout time and eternity. Amen!"},{"header":"One Gospel"},{"num":6,"verse":"I am shocked over how quickly you have strayed away from the One who called you in the grace of Christ. I’m astounded that you now embrace a distorted gospel! "},{"num":7,"verse":"That is a fake “gospel” that is simply not true. There is only one gospel—the good news of Christ! Yet you have allowed those who mingle law with grace to confuse you."},{"num":8,"verse":"But even if we or an angel from heaven should preach a gospel different than the one we preached to you, let them be under God’s curse!"},{"num":9,"verse":"Let me make it clear: Anyone, no matter who they are, that brings you a different gospel than the gospel that you have received, let them be condemned and cursed!"},{"num":10,"verse":"I’m obviously not trying to flatter you or water down my message to be popular with men, but my supreme passion is to please God. For if all I attempt to do is please people, I would fail to be a true servant of Christ."},{"header":"How Paul Became an Apostle"},{"num":11,"verse":"Beloved ones, let me repeat emphatically that the gospel entrusted to me was not given to me by any man. "},{"num":12,"verse":"No one taught me this revelation, for it was given to me directly by the unveiling of Jesus Christ."},{"num":13,"verse":"By now you have heard stories of how severely I harassed and persecuted Christians and how systematically I endeavored to destroy God’s church, all because of my radical devotion to the Jewish religion. "},{"num":14,"verse":"My zeal and passion for the doctrines of Judaism distinguished me among my people, for I was far more advanced in my religious instruction than others my age."},{"num":15,"verse":"But then God called me by his grace, and chose me from my birth to be his. "},{"num":16,"verse":"He was pleased to unveil his Son in me so that I would proclaim him to the peoples of the world. After I had this encounter, I kept it a secret for some time, sharing it with no one. "},{"num":17,"verse":"And I had no desire to run to Jerusalem and try to impress those who had become apostles before me. Instead, I withdrew into the Arabian Desert. Then I returned to Damascus, where I had first encountered Jesus. "},{"num":18,"verse":"I remained there for three years until I eventually went up to Jerusalem, met the apostle Peter, and stayed with him for a couple of weeks. "},{"num":19,"verse":"The only other apostle I met during that time was Jacob, the Lord’s brother."},{"num":20,"verse":"Everything I’m describing to you I confess before God to be the absolute truth. "},{"num":21,"verse":"After my stay in Jerusalem, I went to Syria and southeast Turkey, "},{"num":22,"verse":"but I remained unknown to the churches in Judea. "},{"num":23,"verse":"The only thing they heard about me was this: “Our former enemy, who once brutally persecuted us, is now preaching the good news of the faith that he tried to destroy!” "},{"num":24,"verse":"Because of the transformation that took place in my life, they praised God even more!"}]