[{"header":"Be Careful About Criticizing Others(A)"},{"num":7,"verse":"“Don’t judge others, and God will not judge you."},{"num":2,"verse":"If you judge others, you will be judged the same way you judge them. God will treat you the same way you treat others."},{"num":3,"verse":"“Why do you notice the small piece of dust that is in your friend’s eye, but you don’t notice the big piece of wood that is in your own?"},{"num":4,"verse":"Why do you say to your friend, ‘Let me take that piece of dust out of your eye’? Look at yourself first! You still have that big piece of wood in your own eye."},{"num":5,"verse":"You are a hypocrite! First, take the wood out of your own eye. Then you will see clearly to get the dust out of your friend’s eye."},{"num":6,"verse":"“Don’t give something that is holy to dogs. They will only turn and hurt you. And don’t throw your pearls to pigs. They will only step on them."},{"header":"Ask God for What You Need(B)"},{"num":7,"verse":"“Continue to ask, and God will give to you. Continue to search, and you will find. Continue to knock, and the door will open for you."},{"num":8,"verse":"Yes, whoever continues to ask will receive. Whoever continues to look will find. And whoever continues to knock will have the door opened for them."},{"num":9,"verse":"“Do any of you have a son? If he asked for bread, would you give him a rock?"},{"num":10,"verse":"Or if he asked for a fish, would you give him a snake? Of course not!"},{"num":11,"verse":"You people are so bad, but you still know how to give good things to your children. So surely your heavenly Father will give good things to those who ask him."},{"header":"A Very Important Rule"},{"num":12,"verse":"“Do for others what you would want them to do for you. This is the meaning of the Law of Moses and the teaching of the prophets."},{"header":"The Way to Heaven and the Way to Hell(C)"},{"num":13,"verse":"“You can enter true life only through the narrow gate. The gate to hell is very wide, and there is plenty of room on the road that leads there. Many people go that way."},{"num":14,"verse":"But the gate that opens the way to true life is narrow. And the road that leads there is hard to follow. Only a few people find it."},{"header":"What People Do Shows What They Are(D)"},{"num":15,"verse":"“Be careful of false prophets. They come to you and look gentle like sheep. But they are really dangerous like wolves."},{"num":16,"verse":"You will know these people because of what they do. Good things don’t come from people who are bad, just as grapes don’t come from thornbushes, and figs don’t come from thorny weeds."},{"num":17,"verse":"In the same way, every good tree produces good fruit, and bad trees produce bad fruit."},{"num":18,"verse":"A good tree cannot produce bad fruit, and a bad tree cannot produce good fruit."},{"num":19,"verse":"Every tree that does not produce good fruit is cut down and thrown into the fire."},{"num":20,"verse":"You will know these false people by what they do."},{"num":21,"verse":"“Not everyone who calls me Lord will enter God’s kingdom. The only people who will enter are those who do what my Father in heaven wants."},{"num":22,"verse":"On that last Day many will call me Lord. They will say, ‘Lord, Lord, by the power of your name we spoke for God. And by your name we forced out demons and did many miracles.’"},{"num":23,"verse":"Then I will tell those people clearly, ‘Get away from me, you people who do wrong. I never knew you.’"},{"header":"Two Kinds of People(E)"},{"num":24,"verse":"“Whoever hears these teachings of mine and obeys them is like a wise man who built his house on rock."},{"num":25,"verse":"It rained hard, the floods came, and the winds blew and beat against that house. But it did not fall because it was built on rock."},{"num":26,"verse":"“Whoever hears these teachings of mine and does not obey them is like a foolish man who built his house on sand."},{"num":27,"verse":"It rained hard, the floods came, and the winds blew and beat against that house. And it fell with a loud crash.”"},{"num":28,"verse":"When Jesus finished speaking, the people were amazed at his teaching."},{"num":29,"verse":"He did not teach like their teachers of the law. He taught like someone who has authority."}]