[{"header":"Measuring Your Measure"},{"num":7,"verse":"“Stop judging, so that you may not be judged. "},{"num":2,"verse":"For with the judgment you judge, you will be judged; and with the measure you use, it will be measured to you."},{"num":3,"verse":"“Why do you look at the speck in your brother’s eye, but do not notice the beam in your own eye? "},{"num":4,"verse":"Or how will you say to your brother, ‘Let me take the speck out of your eye,’ and look, the beam is in your own eye? "},{"num":5,"verse":"Hypocrite, first take the beam out of your own eye, and then you will see clearly to take the speck out of your brother’s eye."},{"num":6,"verse":"“Do not give what is holy to dogs or throw your pearls before pigs; otherwise they will trample them under their feet, then turn and rip you to shreds."},{"num":7,"verse":"“Ask, and it shall be given to you. Seek, and you shall find. Knock, and it shall be opened to you. "},{"num":8,"verse":"For everyone who asks receives, and the one who seeks finds, and to the one who knocks it shall be opened."},{"num":9,"verse":"“For what man among you, when his son asks him for bread, will give him a stone? "},{"num":10,"verse":"Or when he asks for a fish, will give him a snake? "},{"num":11,"verse":"If you then, being evil, know how to give good gifts to your children, how much more will your Father in heaven give good things to those who ask Him! "},{"num":12,"verse":"So in all things, do to others what you would want them to do to you—for this is the Torah and the Prophets."},{"num":13,"verse":"“Enter through the narrow gate; for the gate is wide and the way is broad that leads to destruction, and those who enter through it are many. "},{"num":14,"verse":"How narrow is the gate and difficult the way that leads to life, and those who find it are few.”"},{"header":"Judging the Fruit"},{"num":15,"verse":"“Watch out for false prophets, who come to you in sheep’s clothing but inwardly are ravenous wolves. "},{"num":16,"verse":"You will recognize them by their fruit. Grapes aren’t gathered from thorn bushes or figs from thistles, are they? "},{"num":17,"verse":"Even so, every good tree produces good fruit, but the rotten tree produces bad fruit. "},{"num":18,"verse":"A good tree cannot produce bad fruit, nor can a rotten tree produce good fruit. "},{"num":19,"verse":"Every tree that does not produce good fruit is chopped down and thrown into the fire. "},{"num":20,"verse":"So then, you will recognize them by their fruit."},{"num":21,"verse":"“Not everyone who says to Me, ‘Lord, Lord!’ will enter the kingdom of heaven, but he who does the will of My Father in heaven. "},{"num":22,"verse":"Many will say to Me on that day, ‘Lord, Lord, didn’t we prophesy in Your name, and drive out demons in Your name, and perform many miracles in Your name?’ "},{"num":23,"verse":"Then I will declare to them, ‘I never knew you. Get away from Me, you workers of lawlessness!’”"},{"header":"Building on a Firm Foundation"},{"num":24,"verse":"“Therefore everyone who hears these words of Mine and does them will be like a wise man who built his house on the rock. "},{"num":25,"verse":"And the rain fell, and the floods came, and the winds blew and beat against that house; and yet it did not fall, for its foundation had been built on the rock. "},{"num":26,"verse":"Everyone who hears these words of Mine and does not act on them will be like a foolish man who built his house on the sand. "},{"num":27,"verse":"And the rain fell, and the floods came, and the winds blew and beat against that house; and it fell—and great was its fall.”"},{"num":28,"verse":"Now when Yeshua had finished these words, the crowds were astounded at His teaching, "},{"num":29,"verse":"for He was teaching them as one having authority and not as their Torah scholars."}]