[{"num":30,"verse":"The words of him that gathereth, of the son spewing. The prophecy which a man spake, with whom God was, and which man was comforted by God dwelling with him, and said, (The words of Agur, the son of Jakeh. The prophecy which a man spoke unto Ithiel, yea, unto Ithiel and Ucal,)"},{"num":2,"verse":"I am the most fool of men; and the wisdom of men is not with me. (I am the most foolish of men; and I have no common sense.)"},{"num":3,"verse":"I learned not wisdom; and I knew not the knowing of holy men."},{"num":4,"verse":"Who ascended into heaven, and came down (again)? Who held together the spirit in his hands? who bound together waters as in a cloth? (Who held together the wind in his hands? who bound up the waters in a cloak?) Who raised (up) all the ends of [the] earth? What is the name of him? and what is the name of his son, if thou knowest?"},{"num":5,"verse":"Each word of God is a shield set afire, to all that hope in him. (Each word of God is fired, and he is a shield for all who hope in him.)"},{"num":6,"verse":"Add thou not anything to the words of him, and thou be reproved, and be found a liar. (Do not thou add anything to his words, lest thou be rebuked, and be found a liar.)"},{"num":7,"verse":"I prayed (of) thee two things; deny not thou them to me, before that I die."},{"num":8,"verse":"Make thou far from me vanity and words of leasing; give thou not to me begging and riches; but give thou only necessaries to my lifelode; (Make thou far from me emptiness and futility, or uselessness, and words of lying, or lies; give thou not to me begging or riches; but give thou only the necessities for my sustenance;)"},{"num":9,"verse":"lest peradventure I be full-filled, and be drawn to deny, and say, Who is the Lord? and lest I be compelled by neediness, and steal, and forswear the name of my God. (lest perhaps I be filled full, and be drawn to deny, and then say, Who is the Lord? or lest I be compelled by neediness, and steal, and forswear the name of my God.)"},{"num":10,"verse":"Accuse thou not a servant to his lord, lest peradventure he curse thee, and thou fall down."},{"num":11,"verse":"(There is) A generation that curseth his father, and that blesseth not his mother. (There be people who curse their fathers, and do not bless their mothers.)"},{"num":12,"verse":"(There is) A generation that seemeth clean to itself, and nevertheless is not washed from his filths. (There be people who seem clean to themselves, yet nevertheless be not washed from their filths.)"},{"num":13,"verse":"(There is) A generation whose eyes be high, and the eyelids thereof be raised [up] into high things. (There be people whose eyes be haughty, and whose glances be raised up, or disdainful.)"},{"num":14,"verse":"(There is) A generation that hath swords for teeth, and eateth with his cheek teeth; that it eat [the] needy men of [the] earth, and the poor-alls of men. (There be people who have swords for teeth, and eat with their molars; and they eat the needy of the earth, and those who be all-poor, or without anything.)"},{"num":15,"verse":"The waterleach hath two daughters, saying, Bring (me), bring (me). Three things be unable to be (ful)filled, and the fourth, that saith never, It sufficeth (and the fourth, that never saith, It sufficeth);"},{"num":16,"verse":"hell; and the mouth of the womb; and the earth that is never filled with water; but fire (that) saith never, It sufficeth. (Sheol, or the land of the dead/the grave; and the mouth of the womb; and the land that is never filled with water; and the fire that never saith, It sufficeth.)"},{"num":17,"verse":"(Let the) Crows of the strand peck out that eye, that scorneth the father, and that despiseth the child-bearing of his mother; and (let) the young of an eagle eat that eye."},{"num":18,"verse":"Three things be hard to me, and utterly I know not the fourth thing (and the fourth thing I utterly know not);"},{"num":19,"verse":"the way of an eagle in (the) heaven(s); the way of a serpent on a stone; the way of a ship in the middle of the sea; and the way of a man in (his) young waxing age."},{"num":20,"verse":"Such is the way of a woman adulteress, which eateth, and wipeth her mouth, and saith, I wrought not evil. (Such is the way of an adulterous woman, who eateth, and wipeth her mouth, and then saith, I have done nothing wrong.)"},{"num":21,"verse":"The earth is moved by three things, and by the fourth thing, which it may not sustain;"},{"num":22,"verse":"by a servant, when he reigneth; by a fool, when he is filled with meat (by a fool, when he is filled full with food);"},{"num":23,"verse":"by an hateful woman, when she is taken in matrimony; and by an handmaid, when she is heir of her lady (and by a servantess, when she is her lady’s heir)."},{"num":24,"verse":"Four [things] be the least things of [the] earth, and those be wiser than wise men;"},{"num":25,"verse":"ants, a feeble people, that make ready meat in harvest to themselves; (ants, a weak, or a lowly, people, that store-up food for themselves at harvest time;)"},{"num":26,"verse":"a hare, a people unmighty, that setteth his bed in a stone; (rock badgers, also an unmighty people, who make their beds among the rocks;)"},{"num":27,"verse":"a locust, (that) hath no king, and (yet) all goeth out by companies;"},{"num":28,"verse":"a lizard, enforceth with hands, and dwelleth in the houses of kings. (and a lizard, that endeavoureth with his hands, and liveth in palaces.)"},{"num":29,"verse":"Three things there be, that go well (And there be three things, that go well), and the fourth thing, that goeth richly, or wellsomely."},{"num":30,"verse":"A lion, strongest of beasts, shall not dread, at the meeting of any man; (A lion, the strongest of beasts, that shall not fear the meeting of any man;)"},{"num":31,"verse":"a cock, girded [up] the loins; and a ram, (and a king,) and none there is that shall against-stand him. (a strutting rooster; and a ram; and a king for whom there is no one who shall stand up against him.)"},{"num":32,"verse":"He that appeareth a fool, after that he is raised [up] on high; for if he had understood, he had set (his) hand on his mouth. (Now, if thou hath been a fool, and hath raised up thyself on high, and hath imagined evil; then set thy hand upon thy mouth, and be silent.)"},{"num":33,"verse":"Forsooth he that thrusteth strongly teats, to draw out milk, thrusteth out butter; and he that smiteth greatly, draweth out blood; and he that stirreth ires, bringeth forth discords. (For he who strongly thrusteth teats to draw out milk, thrusteth out butter; and he who greatly striketh, draweth out blood; and he who stirreth up anger, bringeth forth discords.)"}]