[{"header":"Jeremiah Thrown Into a Cistern"},{"num":38,"verse":"Now Shephatiah the son of Mattan, and Gedaliah the son of Pashhur, and Jukal the son of Shelemiah, and Pashhur the son of Malkijah heard the words that Jeremiah had spoken to all the people, saying: "},{"num":2,"verse":"Thus says the Lord: He who remains in this city will die by the sword, by famine, and by pestilence. But he who goes out to the Chaldeans shall live, for he shall have his life as plunder, and shall live. "},{"num":3,"verse":"Thus says the Lord: This city shall surely be given into the hand of the king of Babylon’s army, and he will capture it."},{"num":4,"verse":"Therefore the officials said to the king, “We beseech you, let this man be put to death, for he thus weakens the hands of the men of war who remain in this city and the hands of all the people, in speaking such words to them; for this man does not seek the welfare of this people, but their harm.”"},{"num":5,"verse":"Then Zedekiah the king said, “Here he is; he is in your hand; for the king cannot do anything against you.”"},{"num":6,"verse":"Then they took Jeremiah and cast him into the cistern of Malkijah the son of Hammelech that was in the court of the prison, and they let Jeremiah down with cords. And in the cistern there was no water, only mud, so Jeremiah sank in the mud."},{"num":7,"verse":"Now Ebed-Melek the Ethiopian, one of the eunuchs who was in the king’s house, heard that they had put Jeremiah in the cistern. Now the king was sitting in the Gate of Benjamin. "},{"num":8,"verse":"Ebed-Melek went forth out of the king’s house and spoke to the king, saying, "},{"num":9,"verse":"“My lord the king, these men have done evil in all that they have done to Jeremiah the prophet whom they have cast into the cistern. And he will die by hunger in the place where he is, for there is no more bread in the city.”"},{"num":10,"verse":"Then the king commanded Ebed-Melek the Ethiopian, saying, “Take thirty men with you from here and take up Jeremiah the prophet out of the cistern before he dies.”"},{"num":11,"verse":"So Ebed-Melek took the men under his authority and went into the house of the king under the storeroom and took from there worn-out clothes and worn-out rags and let them down by cords into the cistern to Jeremiah. "},{"num":12,"verse":"Then Ebed-Melek the Ethiopian said to Jeremiah, “Now put these worn-out clothes and worn-out rags under your armpits under the cords,” so Jeremiah did accordingly. "},{"num":13,"verse":"Then they drew Jeremiah up with cords and took him up out of the cistern, and Jeremiah remained in the court of the prison."},{"header":"Jeremiah Warns Zedekiah Again"},{"num":14,"verse":"Then Zedekiah the king sent and had Jeremiah the prophet brought to him at the third entrance that is in the house of the Lord. And the king said to Jeremiah, “I will ask you something; hide nothing from me.”"},{"num":15,"verse":"Then Jeremiah said to Zedekiah, “If I declare it to you, shall you not surely put me to death? And if I give you counsel, you will not listen to me.”"},{"num":16,"verse":"So Zedekiah the king swore secretly to Jeremiah, saying, “As the Lord lives, who made our souls, I surely will not put you to death, nor will I give you into the hand of these men who seek your life.”"},{"num":17,"verse":"Then Jeremiah said to Zedekiah, “Thus says the Lord, the God of Hosts, the God of Israel: If you will surrender to the officers of the king of Babylon, then your soul will live and this city will not be burned with fire. Thus you and your household will live. "},{"num":18,"verse":"But if you do not surrender to the king of Babylon’s officials, then this city will be given into the hand of the Chaldeans, and they will burn it with fire, and you will not escape out of their hand.”"},{"num":19,"verse":"Then Zedekiah the king said to Jeremiah, “I am afraid of the Jews who have fallen over to the Chaldeans, lest they deliver me into their hand and mock me.”"},{"num":20,"verse":"But Jeremiah said, “They will not deliver you. Please obey the voice of the Lord which I speak to you, so it will be well with you and your soul will live. "},{"num":21,"verse":"But if you refuse to surrender, this is the word that the Lord has shown me: "},{"num":22,"verse":"Then all the women who are left in the house of the king of Judah will be brought out to the officers of the king of Babylon; and those women shall say:"},{"num":23,"verse":"“So they will bring out all your wives and your children to the Chaldeans. And you will not escape out of their hand, but will be taken by the hand of the king of Babylon; and you will cause this city to be burned with fire.”"},{"num":24,"verse":"Then Zedekiah said to Jeremiah, “Let no man know of these words, and you will not die. "},{"num":25,"verse":"But if the officials hear that I have talked with you and they come to you and say to you, ‘Declare to us now what you said to the king and what the king said to you; do not hide it from us and we will not put you to death,’ "},{"num":26,"verse":"then you will say to them, ‘I presented my supplication before the king, that he would not cause me to return to the house of Jonathan, to die there.’ ”"},{"num":27,"verse":"Then all the officials came to Jeremiah and asked him. And he told them according to all these words that the king had commanded; so they stopped speaking with him, for the matter was not overheard."},{"num":28,"verse":"So Jeremiah remained in the court of the prison until the day that Jerusalem was captured."}]