[{"header":"Jeremiah in a Dry Water Well"},{"num":38,"verse":"Now Shaphatiah the son of Mattan, Gedaliah the son of Pashhur, Jucal the son of Shelemiah, and Pashhur the son of Malchijah heard Jeremiah telling all the people, "},{"num":2,"verse":"“The Lord says, ‘He who stays in this city will die by the sword and by hunger and by disease. But he who goes over to the Babylonians will live. He will get away with his life and live.’ "},{"num":3,"verse":"The Lord says, ‘For sure this city will be given to the army of the king of Babylon, and he will take it.’” "},{"num":4,"verse":"Then the leaders said to the king, “Now let this man be put to death. For he is making the hearts of the men of war weak who are left in this city, and of all the people, by saying such words to them. This man does not care about the well-being of these people, but instead wants them hurt.” "},{"num":5,"verse":"So King Zedekiah said, “He is in your hands. The king can do nothing against you.” "},{"num":6,"verse":"So they took Jeremiah and put him into the well of Malchijah the king’s son, in the open space of the prison, letting him down with ropes. There was no water in the well, but only mud. And Jeremiah went down into the mud. "},{"num":7,"verse":"But Ebedmelech, an Ethiopian servant of the king who had been made so he could not have children, heard in the king’s house that they had put Jeremiah into the well. Now the king was sitting in the Gate of Benjamin. "},{"num":8,"verse":"And Ebedmelech went from the king’s house and said to him, "},{"num":9,"verse":"“My lord the king, these men have been very sinful in all they have done to Jeremiah the man of God. They have put him in the well. And he will die there of hunger, for there is no more bread in the city.” "},{"num":10,"verse":"Then the king told Ebed-melech the Ethiopian, “I am giving you the power to take thirty men with you, and bring Jeremiah the man of God up from the well before he dies.” "},{"num":11,"verse":"So Ebed-melech as the leader took the men with him and went into the king’s house to a place under the store-room. He took from there old pieces of cloth and worn-out clothes and let them down by ropes to Jeremiah in the well. "},{"num":12,"verse":"Then Ebedmelech the Ethiopian said to Jeremiah, “Put the clothes and pieces of cloth between your arms and the ropes,” and Jeremiah did so. "},{"num":13,"verse":"Then they pulled Jeremiah up with the ropes and lifted him out of the well. And Jeremiah stayed in the open space of the prison."},{"header":"Zedekiah Asks Jeremiah about Future Happenings"},{"num":14,"verse":"King Zedekiah sent for Jeremiah the man of God and had him brought to him at the third door of the house of the Lord. And the king said to him, “I am going to ask you something. Do not hide anything from me.” "},{"num":15,"verse":"Jeremiah said to Zedekiah, “If I tell you, will you not kill me? Even if I speak wise words to you, you will not listen to me.” "},{"num":16,"verse":"But King Zedekiah promised Jeremiah in secret, “As the Lord lives, Who gave us life, for sure I will not kill you or give you over to these men who want to kill you.”"},{"num":17,"verse":"Then Jeremiah said to Zedekiah, “This is what the Lord God of All, the God of Israel, says: ‘If you will go out to the captains of the king of Babylon, then you will live. This city will not be burned with fire, and you and those of your house will live. "},{"num":18,"verse":"But if you will not go out to the captains of the king of Babylon, then this city will be given to the Babylonians. They will burn it with fire, and you will not get away from them.’” "},{"num":19,"verse":"King Zedekiah said to Jeremiah, “I am afraid of the Jews who have gone over to the Babylonians. I am afraid I will be given over to them, and that they will make it hard for me.” "},{"num":20,"verse":"But Jeremiah said, “They will not give you to them. Obey the Lord by doing what I tell you. Then it will go well with you and you will live. "},{"num":21,"verse":"But if you will not go out, this is the word which the Lord has shown me: "},{"num":22,"verse":"‘All of the women left in the house of the king of Judah are going to be brought out to the captains of the king of Babylon. And these women will say, “Your trusted friends have lied to you and have become stronger than you. Now when your feet have gone down into the mud, they turn away from you.” "},{"num":23,"verse":"All your wives and your sons will be led out to the Babylonians. And you yourself will not get away from them. The king of Babylon will take hold of you, and this city will be burned with fire.’”"},{"num":24,"verse":"Then Zedekiah said to Jeremiah, “Let no one know about these words and you will not die. "},{"num":25,"verse":"The leaders might hear that I have talked with you, and come and say to you, ‘Tell us what you said to the king, and what the king said to you. Do not hide it from us, and we will not kill you.’ "},{"num":26,"verse":"Then you must tell them, ‘I was asking the king not to make me return to the house of Jonathan to die there.’” "},{"num":27,"verse":"All the leaders did come to Jeremiah to ask him questions. So he said to them everything the king had told him to say. And they stopped speaking with him, because the words he and the king had spoken together had not been heard by anyone else. "},{"num":28,"verse":"So Jeremiah stayed in the open space of the prison until the day Jerusalem was taken."}]