[{"header":"Spies Sent to Jericho"},{"num":2,"verse":"Joshua son of Nun secretly sent out two spies from ·Acacia [Shittim; a Hebrew word meaning “acacia”] and said to them, “Go and ·look at [check out] the land, particularly at the city of Jericho.”"},{"num":2,"verse":"Someone told the king of Jericho, “[Look; Behold] Some men from Israel have come here tonight to spy out the land.”"},{"num":3,"verse":"So the king of Jericho sent this message to Rahab: “Bring out the men who came to you and entered your house. They have come to spy out our whole land.”"},{"num":4,"verse":"But the woman had hidden the two men. She said, “They did come here, but I didn’t know where they came from. "},{"num":5,"verse":"In the evening, when it was time to close the city gate, they left. I don’t know where they went, but if you go quickly, maybe you can catch them.” "},{"num":6,"verse":"(The woman had taken the men up to the roof and had hidden them there under stalks of flax that she had spread out.) "},{"num":7,"verse":"So the king’s men went out looking for the spies on the road that leads to the ·crossings [fords] of the Jordan River. The city gate was closed just after the king’s men left the city."},{"num":8,"verse":"Before the spies went to sleep for the night, Rahab went up to the roof. "},{"num":9,"verse":"She said to them, “I know the Lord has given this land to your people. ·You frighten us very much [A terror of you has fallen on us]. Everyone living in this land is ·terribly afraid of [melting away before] you "},{"num":10,"verse":"because we have heard how the Lord dried up the ·Red Sea [or Sea of Reeds] when you came out of Egypt [Ex. 14:15–31]. We have heard how you ·destroyed [or devoted to the Lord for destruction; see 6:17; Deut. 20:15–18] Sihon and Og, two Amorite kings who lived ·east of [beyond] the Jordan. "},{"num":11,"verse":"When we heard this, ·we were very frightened [our hearts melted]. ·Now our men are afraid to fight you [And there rose up no spirit/breath in a man because of you] because the Lord your God ·rules [is God in] the heavens above and the earth below! "},{"num":12,"verse":"So now, ·promise [swear to] me ·before [or by] the Lord that you will show ·kindness [loyalty] to my family just as I showed ·kindness [loyalty] to you. Give me ·some proof [a sure sign; a solemn pledge] that you will do this. "},{"num":13,"verse":"Allow my father, mother, brothers, sisters, and all of their families to live. ·Save [Rescue; Preserve] us from death.”"},{"num":14,"verse":"The men agreed and said, “It will be our lives for your lives if you don’t tell anyone what we are doing. When the Lord gives us the land, we will be ·kind [loyal] and ·true [faithful] to you.”"},{"num":15,"verse":"The house Rahab lived in was built on the city wall, so she used a rope to let the men down through a window. "},{"num":16,"verse":"She said to them, “Go into the hills so the ·king’s men [pursuers] will not find you. Hide there for three days. After the ·king’s men [pursuers] return, you may go on your way.”"},{"num":17,"verse":"The men said to her, “You must do as we say. If not, we ·cannot be responsible for keeping [will be free from] this oath you have made us swear. "},{"num":18,"verse":"When we return to this land, you must tie this ·red [scarlet] rope in the window through which you let us down. Bring your father, mother, brothers, and all your ·family [father’s house] into your house. "},{"num":19,"verse":"If anyone leaves your house and is killed, ·it is his own fault [his blood is on his head]. We ·cannot be responsible for him [are innocent]. If anyone in your house ·is hurt [has a hand laid on them], ·we will be responsible [his blood will be on our head]. "},{"num":20,"verse":"But if you tell anyone about this, we will be free from the oath you made us swear.”"},{"num":21,"verse":"Rahab answered, “·I agree to this [Let it be according to your words].” So she sent them away, and they left. Then she tied the ·red [scarlet] rope in the window."},{"num":22,"verse":"The men left and went into the hills where they stayed for three days. The ·king’s men [pursuers] looked for them all along the road, but after three days, they returned to the city without finding them. "},{"num":23,"verse":"Then the two men started back. They left the hills and crossed the river and came to Joshua son of Nun and told him everything that had happened to them. "},{"num":24,"verse":"They said, “The Lord surely has given ·us all of the land [all the land into our hand]. All the people in that land are ·terribly afraid of [melting away before] us.”"}]