[{"header":"Spies Sent to Jericho"},{"num":2,"verse":"Joshua son of Nun secretly sent out two spies from Acacia. Joshua said to them, “Go and look at the land. Look closely at the city of Jericho.”"},{"num":2,"verse":"Someone told the king of Jericho, “Some men from Israel have come here tonight. They are spying out the land.”"},{"num":3,"verse":"So the king of Jericho sent this message to Rahab: “Bring out the men who came to you and entered your house. They have come to spy out our whole land.”"},{"num":4,"verse":"Now the woman had hidden the two men. She said, “They did come here. But I didn’t know where they came from. "},{"num":5,"verse":"In the evening, when it was time to close the city gate, they left. I don’t know where they went. Go quickly. Maybe you can catch them.” "},{"num":6,"verse":"(But the woman had taken the men up to the roof. She had hidden them there under stalks of flax. She had spread the flax out there to dry.) "},{"num":7,"verse":"So the king’s men went out looking for the spies from Israel. They went to the places where people cross the Jordan River. The city gate was closed just after the king’s men left the city."},{"num":8,"verse":"The spies were ready to sleep for the night. So Rahab went to the roof and talked to them. "},{"num":9,"verse":"She said, “I know the Lord has given this land to your people. You frighten us very much. Everyone living in this land is terribly afraid of you. "},{"num":10,"verse":"We are afraid because we have heard how the Lord helped you. We heard how he dried up the Red Sea when you came out of Egypt. We heard how you destroyed Sihon and Og. They were the two Amorite kings who lived east of the Jordan. "},{"num":11,"verse":"When we heard this, we became very frightened. Now our men are afraid to fight you. This is because the Lord your God rules the heavens above and the earth below! "},{"num":12,"verse":"So now, make me a promise before the Lord. Promise that you will show kindness to my family just as I showed you kindness. Give me some proof that you will do this. "},{"num":13,"verse":"Promise me you will allow my family to live. Save my father, mother, brothers, sisters and all of their families from death.”"},{"num":14,"verse":"The men agreed. They said, “We will trade our lives for your lives. Don’t tell anyone what we are doing. When the Lord gives us our land, we will be kind to you. You may trust us.”"},{"num":15,"verse":"The house Rahab lived in was built on the city wall. So she used a rope to let the men down through a window. "},{"num":16,"verse":"She said to them, “Go into the hills. The king’s men will not find you there. Hide there for three days. After the king’s men return, you may go on your way.”"},{"num":17,"verse":"The men said to her, “You must do as we say. If not, we cannot be responsible for keeping our promise. "},{"num":18,"verse":"You are using a red rope to help us escape. When we return to this land, you must tie it in the window through which you let us down. Bring your father, mother, brothers and all your family into your house. "},{"num":19,"verse":"We can keep everyone safe who stays in this house. If anyone in your house is hurt, we will be responsible. If anyone goes out of your house and is killed, it is his own fault. We cannot be responsible for him. "},{"num":20,"verse":"But you must not tell anyone about this agreement. If you do, we are free from it.”"},{"num":21,"verse":"Rahab answered, “I agree to this.” So she sent them away, and they left. Then she tied the red rope in the window."},{"num":22,"verse":"The men left and went into the hills. There they stayed for three days. The king’s men looked for them all along the road. But after three days, the king’s men returned to the city without finding them. "},{"num":23,"verse":"Then the two men started back to Joshua. They left the hills and crossed the river. They went to Joshua son of Nun and told him everything that had happened to them. "},{"num":24,"verse":"They said to Joshua, “The Lord surely has given us all of the land. All the people in that land are terribly afraid of us.”"}]