[[],[{"type":"header","content":"Sonship in Christ"},{"type":"prose","content":"Now what I mean [when I talk about children and their guardians] is this: as long as the heir is a child, he does not differ at all from a slave even though he is the [future owner and] master of all [the estate]; "}],[{"type":"prose","content":"but he is under [the authority of] guardians and household administrators  managers until the date set by his father [when he is of legal age]. "}],[{"type":"prose","content":"So also we [whether Jews or Gentiles], when we were children (spiritually immature), were kept like slaves under the elementary [man-made religious or philosophical] teachings of the world. "}],[{"type":"prose","content":"But when [in God’s plan] the proper time had fully come, God sent His Son, born of a woman, born under the [regulations of the] Law, "}],[{"type":"prose","content":"so that He might redeem  liberate those who were under the Law, that we [who believe] might be adopted as sons [as God’s children with all rights as fully grown members of a family]. "}],[{"type":"prose","content":"And because you [really] are [His] sons, God has sent the Spirit of His Son into our hearts, crying out, “Abba! Father!” "}],[{"type":"prose","content":"Therefore you are no longer a slave (bond-servant), but a son; and if a son, then also an heir through [the gracious act of] God [through Christ]."}],[{"type":"prose","content":"But at that time, when you did not know [the true] God  were unacquainted with Him, you [Gentiles] were slaves to those [pagan] things which by [their very] nature were not  could not be gods . "}],[{"type":"prose","content":"Now, however, since you have come to know [the true] God [through personal experience], or rather to be known by God, how is it that you are turning back again to the weak and worthless elemental principles [of religions and philosophies], to which you want to be enslaved all over again? "}],[{"type":"prose","content":"[For example,] you observe [particular] days and months and seasons and years. "}],[{"type":"prose","content":"I fear for you, that perhaps I have labored [to the point of exhaustion] over you in vain."}],[{"type":"prose","content":"Believers, I beg of you, become as I am [free from the bondage of Jewish ritualism and ordinances], for I  as you are [a Gentile]. You did me no wrong [when I first came to you; do not do it now]. "}],[{"type":"prose","content":"On the contrary, you know that it was because of a physical illness that I [remained and] preached the gospel to you the first time; "}],[{"type":"prose","content":"and even though my physical condition was a trial to you, you did not regard it with contempt, or scorn  reject me; but you received me as an angel of God, even as Christ Jesus . "}],[{"type":"prose","content":"What then has become of that sense of blessing  the joy that you once had [from your salvation and your relationship with Christ]? For I testify of you that, if possible, you would have torn out your own eyes and given them to me [to replace mine]. "}],[{"type":"prose","content":"So have I become your enemy by telling you the truth? "}],[{"type":"prose","content":"These men [the Judaizers] eagerly seek you [to entrap you with honeyed words and attention, to win you over to their philosophy], not honorably [for their purpose is not honorable or worthy of consideration]. They want to isolate you [from us who oppose them] so that you will seek them. "}],[{"type":"prose","content":"Now it is always pleasant to be eagerly sought after [provided that it is] for a good purpose, and not just when I am with you [seeking you myself—but beware of the others doing it]. "}],[{"type":"prose","content":"My little children, for whom I am again in [the pains of] labor until Christ is [completely and permanently] formed within you— "}],[{"type":"prose","content":"how I wish that I were with you now and could change my tone, because I am perplexed in regard to you."}],[{"type":"header","content":"Bond and Free"},{"type":"prose","content":"Tell me, you who are bent on being under the Law, do you not listen to [what] the Law [really says]? "}],[{"type":"prose","content":"For it is written that Abraham had two sons, one by the slave woman [Hagar] and one by the free woman [Sarah]. "}],[{"type":"prose","content":"But the child of the slave woman was born according to the flesh  had an ordinary birth, while the son of the free woman was born in fulfillment of the promise. "}],[{"type":"prose","content":"Now these facts are about to be used [by me] as an allegory [that is, I will illustrate by using them]: for these  can represent two covenants: one [covenant originated] from Mount Sinai [where the Law was given] that bears children [destined] for slavery; she is Hagar. "}],[{"type":"prose","content":"Now Hagar is (represents) Mount Sinai in Arabia and she corresponds to the present Jerusalem, for she is in slavery with her children. "}],[{"type":"prose","content":"But the Jerusalem above [that is, the way of faith, represented by Sarah] is free; she is our mother. "}],[{"type":"prose","content":"For it is written [in the Scriptures],"}],[{"type":"prose","content":"And we, [believing] brothers and sisters, like Isaac, are children [not merely of physical descent, like Ishmael, but are children born] of promise [born miraculously]. "}],[{"type":"prose","content":"But as at that time the child [of ordinary birth] born according to the flesh persecuted the son  according to [the promise and working of] the Spirit, so it is now also. "}],[{"type":"prose","content":"But what does the Scripture say?"}],[{"type":"prose","content":"So then, believers, we [who are born again—reborn from above—spiritually transformed, renewed, and set apart for His purpose] are not children of a slave woman [the natural], but of the free woman [the supernatural]."}]]