[{"num":4,"verse":"What I am saying is that as long as the heir is a minor he is no different from a slave, even though he is the legal owner of the estate; "},{"num":2,"verse":"rather, he is subject to guardians and caretakers until the time previously set by his father. "},{"num":3,"verse":"So it is with us — when we were “children” we were slaves to the elemental spirits of the universe; "},{"num":4,"verse":"but when the appointed time arrived, God sent forth his Son. He was born from a woman, born into a culture in which legalistic perversion of the Torah was the norm, "},{"num":5,"verse":"so that he might redeem those in subjection to this legalism and thus enable us to be made God’s sons. "},{"num":6,"verse":"Now because you are sons, God has sent forth into our hearts the Spirit of his Son, the Spirit who cries out, “Abba!” (that is, “Dear Father!”). "},{"num":7,"verse":"So through God you are no longer a slave but a son, and if you are a son you are also an heir."},{"num":8,"verse":"In the past, when you did not know God, you served as slaves beings which in reality are non-gods. "},{"num":9,"verse":"But now you do know God, and, more than that, you are known by God. So how is it that you turn back again to those weak and miserable elemental spirits? Do you want to enslave yourselves to them once more? "},{"num":10,"verse":"You observe special days, months, seasons and years! "},{"num":11,"verse":"I fear for you that my work among you has been wasted!"},{"num":12,"verse":"Brothers, I beg of you: put yourselves in my place — after all, I put myself in your place. It isn’t that you have done me any wrong — "},{"num":13,"verse":"you know that it was because I was ill that I proclaimed the Good News to you at first; "},{"num":14,"verse":"and even though my physical condition must have tempted you to treat me with scorn, you did not display any sign of disdain or disgust. No, you welcomed me as if I had been an angel of God, as if I had been the Messiah Yeshua himself! "},{"num":15,"verse":"So what has become of the joy you felt? For I bear you witness that had it been possible, you would have gouged out your eyes and given them to me. "},{"num":16,"verse":"Have I now become your enemy because I tell you the truth? "},{"num":17,"verse":"True, these teachers are zealous for you, but their motives are not good. They want to separate you from us so that you will become zealous for them. "},{"num":18,"verse":"To be zealous is good, provided always that the cause is good. Indeed, whether I am present with you or not, "},{"num":19,"verse":"my dear children, I am suffering the pains of giving birth to you all over again — and this will go on until the Messiah takes shape in you. "},{"num":20,"verse":"I wish I could be present with you now and change my tone of voice. I don’t know what to do with you."},{"num":21,"verse":"Tell me, you who want to be in subjection to the system that results from perverting the Torah into legalism, don’t you hear what the Torah itself says? "},{"num":22,"verse":"It says that Avraham had two sons, one by the slave woman and one by the free woman. "},{"num":23,"verse":"The one by the slave woman was born according to the limited capabilities of human beings, but the one by the free woman was born through the miracle-working power of God fulfilling his promise. "},{"num":24,"verse":"Now, to make a midrash on these things: the two women are two covenants. One is from Mount Sinai and bears children for slavery — this is Hagar. "},{"num":25,"verse":"Hagar is Mount Sinai in Arabia; she corresponds to the present Yerushalayim, for she serves as a slave along with her children. "},{"num":26,"verse":"But the Yerushalayim above is free, and she is our mother; "},{"num":27,"verse":"for the Tanakh says,"},{"num":28,"verse":"You, brothers, like Yitz’chak, are children referred to in a promise of God. "},{"num":29,"verse":"But just as then the one born according to limited human capability persecuted the one born through the Spirit’s supernatural power, so it is now. "},{"num":30,"verse":"Nevertheless, what does the Tanakh say? “Get rid of the slave woman and her son, for by no means will the son of the slave woman inherit along with the son of the free woman!” "},{"num":31,"verse":"So, brothers, we are children not of the slave woman, but of the free woman."}]