[{"header":"God Sent His Son To Redeem Us So We All Could Be Adopted As Sons And Heirs"},{"num":4,"verse":"Now I say— for as much time as the heir is a child, he is no different from a slave. Being the [future] owner of all, "},{"num":2,"verse":"nevertheless he is under guardians and stewards until the pre-appointed day of the father. "},{"num":3,"verse":"In this manner also we, when we were children, were enslaved under the elemental things of the world. "},{"num":4,"verse":"But when the fullness of time came, God sent-forth His Son— having come from a woman, having come under the Law "},{"num":5,"verse":"in order that He might redeem the ones under the Law, in order that we [all] might receive the adoption. "},{"num":6,"verse":"And because you are sons, God sent-forth the Spirit of His Son into our hearts crying-out, “Abba! Father!” "},{"num":7,"verse":"So then you are no longer a slave, but a son— and if a son, also an heir through God!"},{"header":"Why Turn Back To Being Slaves Again? I Fear For You"},{"num":8,"verse":"But at that time not knowing God, you were-slaves to the ones by nature not being gods. "},{"num":9,"verse":"But now having known God, yet rather having been known by God, how is it you are turning-back again to the weak and poor elemental things to which again you are wanting to be-slaves anew? "},{"num":10,"verse":"You are observing days and months and seasons and years. "},{"num":11,"verse":"I am fearing for you, that I somehow have labored in-vain for you."},{"header":"I Beg You, Become As I Am. Have I Become Your Enemy By Speaking The Truth To You?"},{"num":12,"verse":"I beg you, brothers, become as I, because I also became as you. You did me no wrong. "},{"num":13,"verse":"And you know that I first announced-the-good-news to you because of a weakness of the flesh. "},{"num":14,"verse":"And you did not treat-with-contempt nor loathe your trial in-connection-with my flesh, but you welcomed me as an angel of God, as Christ Jesus. "},{"num":15,"verse":"Where then is your blessedness? For I testify concerning you that, if possible, you would have given your eyes to me, having torn them out! "},{"num":16,"verse":"So then, have I become your enemy while speaking-the-truth to you? "},{"num":17,"verse":"They are zealously-seeking you— not commendably, but they want to shut you out in-order-that you might be zealously-seeking them."},{"header":"I Am Again Suffering Birth Pains For You Until Christ Is Formed In You"},{"num":18,"verse":"Now it is good to be zealously-sought in a commendable thing at-all-times, and not only during my being present with you— "},{"num":19,"verse":"my children, as to whom again I am suffering-birth-pains until which time Christ is formed in you. "},{"num":20,"verse":"But I was [just now] wishing to be present with you now and to change my tone, because I am perplexed with you."},{"header":"Listen To The Law. We Are Children of The Free Promise, Not of The Slave Covenant"},{"num":21,"verse":"Tell me, the ones wanting to be under the Law, do you not hear the Law? "},{"num":22,"verse":"For it has been written that Abraham had two sons— one by the slave-woman and one by the free woman. "},{"num":23,"verse":"But the one by the slave-woman has been born according to the flesh, and the one by the free woman through the promise— "},{"num":24,"verse":"which things are being allegorized, for these women are two covenants. One is from Mount Sinai, bearing children for slavery, which is Hagar "},{"num":25,"verse":"(now Hagar is Mount Sinai in Arabia). And she corresponds to the present Jerusalem, for she is a slave with her children. "},{"num":26,"verse":"But the Jerusalem above is free— which is our mother. "},{"num":27,"verse":"For it has been written, “Celebrate, barren one, the one not giving-birth. Break-forth and shout, the one not suffering-birth-pains. Because many more are the children of the desolate than of the one having the husband!”[Isa 54:1] "},{"num":28,"verse":"And you, brothers, are children of the promise in accordance with Isaac. "},{"num":29,"verse":"But just as at-that-time the one having been born according to the flesh was persecuting the one born according to the Spirit, so also now. "},{"num":30,"verse":"But what does the Scripture say? “Send-out the slave-woman and her son. For the son of the slave-woman shall by no means inherit with the son of the free woman” [Gen 21:10]. "},{"num":31,"verse":"Therefore, brothers, we are not children of a slave-woman, but of the free woman."}]