[{"num":4,"verse":"·I want to tell you this [or This is what I mean; I am saying]: While those who will inherit their fathers’ property are still children, they are no different from slaves. It does not matter that the children ·own everything [or are masters/lords over the whole estate]. "},{"num":2,"verse":"They must obey ·those chosen to care for them [their guardians and administrators/trustees] until the time set by their father. "},{"num":3,"verse":"It is the same for us. We were once like children, slaves to the ·useless rules [or spiritual forces; or elementary principles/powers] of this world. "},{"num":4,"verse":"But when the ·right [appropriate; or appointed; fullness of] time came, God sent his Son who was born of a woman and ·lived [born] under the law. "},{"num":5,"verse":"God did this so he could ·buy freedom for [redeem] those who were under the law and so we could ·become his children [or receive adoption as heirs; a Roman legal term for adopting an heir to carry on one’s name]."},{"num":6,"verse":"Since you are God’s ·children [or sons], God sent the Spirit of his Son into your hearts, and the Spirit cries out, “Abba [Aramaic for “Father,” a term of intimacy], Father.” "},{"num":7,"verse":"So you are no longer a slave; you are God’s ·child [or son], and ·because you are his child, God will give you the blessing he promised [if a son/child, then also an heir through God]."},{"header":"Paul’s Love for the Christians"},{"num":8,"verse":"In the past you did not know God. You were slaves to gods that were not real. "},{"num":9,"verse":"But now you know the true God. Really, it is God who knows you. So ·why do [how can] you turn back to those weak and ·useless [bankrupt; poor] ·rules [or spiritual forces; or elementary principles/powers; v. 3] you followed before? Do you want to be slaves to those things again? "},{"num":10,"verse":"You still ·follow teachings about [are observing/keeping] special days, months, seasons, and years [probably Jewish Sabbaths and festivals, which Paul’s opponents claimed must be observed to be saved]. "},{"num":11,"verse":"I am afraid for you, that my work for you has been wasted."},{"num":12,"verse":"Brothers and sisters, I became like you [living like a Gentile to win them to Christ; 1 Cor. 9:21], so I beg you to become like me [depending on God’s grace, not the Jewish law, for salvation]. You ·were very good to me before [did me no wrong]. "},{"num":13,"verse":"You remember that it was because of an illness that I came to you the first time, preaching the ·Good News [Gospel]. "},{"num":14,"verse":"Though my sickness was a ·trouble for you [trial for you; or test of your concern], you did not ·hate [despise] me or ·make me leave [reject me]. Instead, you welcomed me as an angel from God, as if I were Christ Jesus himself! "},{"num":15,"verse":"But where is that ·joy [happiness; blessedness] you had then? I am ready to testify that you would have taken out your eyes and given them to me if that were possible. "},{"num":16,"verse":"Now am I your enemy because I tell you the truth?"},{"num":17,"verse":"Those people [the false teachers; 1:7] ·are working hard to persuade you [or show great interest in you; or are eager to win your favor; are zealous for you], but ·this is not good for you [for no good purpose; or their intentions are not good]. They want to persuade you to ·turn against [reject; exclude] us and ·follow only [care only for; be zealous for] them. "},{"num":18,"verse":"It is good ·for people to show interest in you [or to be passionate/enthusiastic; to be zealous/the object of zeal], but only if their ·purpose [intention] is good. This is always true, not just when I am with you. "},{"num":19,"verse":"My little children, again I feel the pain of childbirth for you until ·you truly become like Christ [Christ is formed in you]. "},{"num":20,"verse":"I wish I could be with you now and could change ·the way I am talking to you [or my tone of voice; my voice], because I ·do not know what to think about [or don’t know how to help; or am perplexed/at wit’s end about] you."},{"header":"The Example of Hagar and Sarah"},{"num":21,"verse":"Some of you still want to be under the law. Tell me, do you know what the law says? "},{"num":22,"verse":"[For] The Scriptures say that Abraham had two sons. The mother of one son was a slave woman, and the mother of the other son was a free woman. "},{"num":23,"verse":"Abraham’s son from the slave woman was born ·in the normal human way [or through human effort/plan; according to the flesh; Ishmael; Gen. 16]. But the son from the free woman was born ·because of the promise God made to Abraham [through the promise; Isaac; Gen. 17; 21]."},{"num":24,"verse":"This story ·teaches something else [or may be read allegorically/figuratively/as an illustration]: The two women are ·like the two agreements between God and his people [two covenants]. One is ·the law that God made on Mount Sinai [from Mount Sinai; the mountain in Arabia where God delivered his law to Israel through Moses; Ex. 19—31], ·and the people who are under this agreement are like slaves […bearing children for slavery]. ·The mother named Hagar is like that agreement [This is Hagar]. "},{"num":25,"verse":"She is like Mount Sinai in Arabia and ·is a picture of [corresponds to; represents] the ·earthly city of [present] Jerusalem. This city and ·its people [her children] are ·slaves to the law [slaves]. "},{"num":26,"verse":"But the ·heavenly Jerusalem, which is above [Jerusalem above], is like the free woman. She is our mother. "},{"num":27,"verse":"[For] It is written in the Scriptures:"},{"num":28,"verse":"My brothers and sisters, you are ·God’s children because of his promise [children of the promise], as Isaac was then. "},{"num":29,"verse":"[For just as] The son who was born ·in the normal way [or through human effort/plan; according to the flesh] treated the other son badly. It is the same today [a reference to Jewish persecution of Christians]. "},{"num":30,"verse":"But what does the Scripture say? “Throw out the slave woman and her son. The son of the slave woman will not share in the inheritance with the son of the free woman [Gen. 21:10].” "},{"num":31,"verse":"So, my brothers and sisters, we are not children of the slave woman, but of the free woman."}]