[[],[{"type":"prose","content":"My point is this: heirs, as long as they are minors, are no better than slaves, though they are the owners of all the property; "}],[{"type":"prose","content":"but they remain under guardians and trustees until the date set by the father. "}],[{"type":"prose","content":"So with us; while we were minors, we were enslaved to the elemental spirits of the world. "}],[{"type":"prose","content":"But when the fullness of time had come, God sent his Son, born of a woman, born under the law, "}],[{"type":"prose","content":"in order to redeem those who were under the law, so that we might receive adoption as children. "}],[{"type":"prose","content":"And because you are children, God has sent the Spirit of his Son into our hearts, crying, “Abba! Father!” "}],[{"type":"prose","content":"So you are no longer a slave but a child, and if a child then also an heir, through God."}],[{"type":"header","content":"Paul Reproves the Galatians"},{"type":"prose","content":"Formerly, when you did not know God, you were enslaved to beings that by nature are not gods. "}],[{"type":"prose","content":"Now, however, that you have come to know God, or rather to be known by God, how can you turn back again to the weak and beggarly elemental spirits? How can you want to be enslaved to them again? "}],[{"type":"prose","content":"You are observing special days, and months, and seasons, and years. "}],[{"type":"prose","content":"I am afraid that my work for you may have been wasted."}],[{"type":"prose","content":"Friends, I beg you, become as I am, for I also have become as you are. You have done me no wrong. "}],[{"type":"prose","content":"You know that it was because of a physical infirmity that I first announced the gospel to you; "}],[{"type":"prose","content":"though my condition put you to the test, you did not scorn or despise me, but welcomed me as an angel of God, as Christ Jesus. "}],[{"type":"prose","content":"What has become of the goodwill you felt? For I testify that, had it been possible, you would have torn out your eyes and given them to me. "}],[{"type":"prose","content":"Have I now become your enemy by telling you the truth? "}],[{"type":"prose","content":"They make much of you, but for no good purpose; they want to exclude you, so that you may make much of them. "}],[{"type":"prose","content":"It is good to be made much of for a good purpose at all times, and not only when I am present with you. "}],[{"type":"prose","content":"My little children, for whom I am again in the pain of childbirth until Christ is formed in you, "}],[{"type":"prose","content":"I wish I were present with you now and could change my tone, for I am perplexed about you."}],[{"type":"header","content":"The Allegory of Hagar and Sarah"},{"type":"prose","content":"Tell me, you who desire to be subject to the law, will you not listen to the law? "}],[{"type":"prose","content":"For it is written that Abraham had two sons, one by a slave woman and the other by a free woman. "}],[{"type":"prose","content":"One, the child of the slave, was born according to the flesh; the other, the child of the free woman, was born through the promise. "}],[{"type":"prose","content":"Now this is an allegory: these women are two covenants. One woman, in fact, is Hagar, from Mount Sinai, bearing children for slavery. "}],[{"type":"prose","content":"Now Hagar is Mount Sinai in Arabia and corresponds to the present Jerusalem, for she is in slavery with her children. "}],[{"type":"prose","content":"But the other woman corresponds to the Jerusalem above; she is free, and she is our mother. "}],[{"type":"prose","content":"For it is written,"},{"type":"poetry","content":"“Rejoice, you childless one, you who bear no children,"},{"type":"poetry","content":"for the children of the desolate woman are more numerous"}],[{"type":"prose","content":"Now you, my friends, are children of the promise, like Isaac. "}],[{"type":"prose","content":"But just as at that time the child who was born according to the flesh persecuted the child who was born according to the Spirit, so it is now also. "}],[{"type":"prose","content":"But what does the scripture say? “Drive out the slave and her child; for the child of the slave will not share the inheritance with the child of the free woman.” "}],[{"type":"prose","content":"So then, friends, we are children, not of the slave but of the free woman. "}]]