[[],[{"type":"prose","content":"And I say, so long time as the heir is a babe, he differeth nothing from a servant -- being lord of all,"}],[{"type":"prose","content":"but is under tutors and stewards till the time appointed of the father,"}],[{"type":"prose","content":"so also we, when we were babes, under the elements of the world were in servitude,"}],[{"type":"prose","content":"and when the fulness of time did come, God sent forth His Son, come of a woman, come under law,"}],[{"type":"prose","content":"that those under law he may redeem, that the adoption of sons we may receive;"}],[{"type":"prose","content":"and because ye are sons, God did send forth the spirit of His Son into your hearts, crying, `Abba, Father!'"}],[{"type":"prose","content":"so that thou art no more a servant, but a son, and if a son, also an heir of God through Christ."}],[{"type":"prose","content":"But then, indeed, not having known God, ye were in servitude to those not by nature gods,"}],[{"type":"prose","content":"and now, having known God -- and rather being known by God -- how turn ye again unto the weak and poor elements to which anew ye desire to be in servitude?"}],[{"type":"prose","content":"days ye observe, and months, and times, and years!"}],[{"type":"prose","content":"I am afraid of you, lest in vain I did labour toward you."}],[{"type":"prose","content":"Become as I [am] -- because I also [am] as ye brethren, I beseech you; to me ye did no hurt,"}],[{"type":"prose","content":"and ye have known that through infirmity of the flesh I did proclaim good news to you at the first,"}],[{"type":"prose","content":"and my trial that [is] in my flesh ye did not despise nor reject, but as a messenger of God ye did receive me -- as Christ Jesus;"}],[{"type":"prose","content":"what then was your happiness? for I testify to you, that if possible, your eyes having plucked out, ye would have given to me;"}],[{"type":"prose","content":"so that your enemy have I become, being true to you?"}],[{"type":"prose","content":"they are zealous for you -- [yet] not well, but they wish to shut us out, that for them ye may be zealous;"}],[{"type":"prose","content":"and [it is] good to be zealously regarded, in what is good, at all times, and not only in my being present with you;"}],[{"type":"prose","content":"my little children, of whom again I travail in birth, till Christ may be formed in you,"}],[{"type":"prose","content":"and I was wishing to be present with you now, and to change my voice, because I am in doubt about you."}],[{"type":"prose","content":"Tell me, ye who are willing to be under law, the law do ye not hear?"}],[{"type":"prose","content":"for it hath been written, that Abraham had two sons, one by the maid-servant, and one by the free-woman,"}],[{"type":"prose","content":"but he who [is] of the maid-servant, according to flesh hath been, and he who [is] of the free-woman, through the promise;"}],[{"type":"prose","content":"which things are allegorized, for these are the two covenants: one, indeed, from mount Sinai, to servitude bringing forth, which is Hagar;"}],[{"type":"prose","content":"for this Hagar is mount Sinai in Arabia, and doth correspond to the Jerusalem that now [is], and is in servitude with her children,"}],[{"type":"prose","content":"and the Jerusalem above is the free-woman, which is mother of us all,"}],[{"type":"prose","content":"for it hath been written, `Rejoice, O barren, who art not bearing; break forth and cry, thou who art not travailing, because many [are] the children of the desolate -- more than of her having the husband.'"}],[{"type":"prose","content":"And we, brethren, as Isaac, are children of promise,"}],[{"type":"prose","content":"but as then he who was born according to the flesh did persecute him according to the spirit, so also now;"}],[{"type":"prose","content":"but what saith the Writing? `Cast forth the maid-servant and her son, for the son of the maid-servant may not be heir with the son of the free-woman;'"}],[{"type":"prose","content":"then, brethren, we are not a maid-servant's children, but the free-woman's."}]]