[{"num":4,"verse":"How is the gold become dim! the most pure gold changed! the stones of the sanctuary poured out at the top of all the streets!"},{"num":2,"verse":"The sons of Zion, so precious, comparable to fine gold, how are they esteemed as earthen pitchers, the work of the hands of the potter!"},{"num":3,"verse":"Even the jackals offer the breast, they give suck to their young; the daughter of my people is become cruel, like the ostriches in the wilderness."},{"num":4,"verse":"The tongue of the sucking child cleaveth to the roof of his mouth for thirst; the young children ask bread, no man breaketh it unto them."},{"num":5,"verse":"They that fed delicately are desolate in the streets; they that were brought up in scarlet embrace dung-hills."},{"num":6,"verse":"And the punishment of the iniquity of the daughter of my people is greater than the reward of the sin of Sodom, which was overthrown as in a moment, and no hands were violently laid upon her."},{"num":7,"verse":"Her Nazarites were purer than snow, whiter than milk; they were more ruddy in body than rubies, their figure was as sapphire."},{"num":8,"verse":"Their visage is darker than blackness, they are not known in the streets; their skin cleaveth to their bones, it is withered, it is become like a stick."},{"num":9,"verse":"The slain with the sword are happier than the slain with hunger; for these pine away, stricken through for want of the fruits of the field."},{"num":10,"verse":"The hands of pitiful women have boiled their own children: they were their meat in the ruin of the daughter of my people."},{"num":11,"verse":"Jehovah hath accomplished his fury; he hath poured out his fierce anger, and hath kindled a fire in Zion, which hath consumed the foundations thereof."},{"num":12,"verse":"The kings of the earth, and all the inhabitants of the world, would not have believed that the adversary and the enemy should enter into the gates of Jerusalem."},{"num":13,"verse":"[It is] for the sins of her prophets, [and] the iniquities of her priests, who have shed the blood of the righteous in the midst of her."},{"num":14,"verse":"They wandered about blind in the streets; they were polluted with blood, so that men could not touch their garments."},{"num":15,"verse":"They cried unto them, Depart! Unclean! Depart! depart, touch not! When they fled away, and wandered about, it was said among the nations, They shall no more sojourn [there]."},{"num":16,"verse":"The face of Jehovah hath divided them; he will no more regard them. They respected not the persons of the priests, they favoured not the aged."},{"num":17,"verse":"Our eyes still failed for our vain help; in our watching, we have watched for a nation that did not save."},{"num":18,"verse":"They hunted our steps, that we could not go in our streets: our end is near, our days are fulfilled; for our end is come."},{"num":19,"verse":"Our pursuers were swifter than the eagles of the heavens; they chased us hotly upon the mountains, they laid wait for us in the wilderness."},{"num":20,"verse":"The breath of our nostrils, the anointed of Jehovah, was taken in their pits; of whom we said, Under his shadow we shall live among the nations."},{"num":21,"verse":"Rejoice and be glad, daughter of Edom, that dwellest in the land of Uz: the cup shall pass also unto thee; thou shalt be drunken, and make thyself naked."},{"num":22,"verse":"The punishment of thine iniquity is accomplished, O daughter of Zion; he will no more carry thee away into captivity. He will visit thine iniquity, O daughter of Edom; he will discover thy sins."}]