[{"num":4,"verse":"¶ How is the gold become dim! how is the most fine gold changed! the stones of the sanctuary are scattered through the crossings of every street."},{"num":2,"verse":"The sons of Zion, precious and esteemed more than pure gold, how are they taken for earthen vessels, the work of the hands of the potter!"},{"num":3,"verse":"Even the sea monsters draw out the breast; they give suck to their young ones; the daughter of my people is cruel like the ostriches in the wilderness."},{"num":4,"verse":"The tongue of the sucking child cleaves to the roof of his mouth for thirst; the young children ask for bread, and there was no one to break it unto them."},{"num":5,"verse":"Those that did feed delicately are made desolate in the streets; those that were brought up in scarlet embrace dunghills."},{"num":6,"verse":"For the iniquity of the daughter of my people has increased more than the sin of Sodom, that was overthrown as in a moment, and companies did not camp upon her."},{"num":7,"verse":"Her Nazarites were whiter than snow; they were more radiant than milk; their composure had more fire than the precious stones cut from sapphire:"},{"num":8,"verse":"Their visage is blacker than a coal; they are not known in the streets; their skin cleaves to their bones; it is withered; it is dry like a stick."},{"num":9,"verse":"Those slain with the sword are better than those slain with hunger; for these pine away, stricken through for want of the fruits of the earth."},{"num":10,"verse":"The hands of the compassionate women have cooked their own children; they were their food in the destruction of the daughter of my people."},{"num":11,"verse":"The LORD has accomplished his fury; he has poured out his fierce anger and has kindled a fire in Zion, and it has devoured the foundations thereof."},{"num":12,"verse":"The kings of the earth and all the inhabitants of the world never believed that the adversary and the enemy would enter in through the gates of Jerusalem."},{"num":13,"verse":"¶ Mem For the sins of her prophets and the iniquities of her priests, that have shed the blood of the just in the midst of her,"},{"num":14,"verse":"They have wandered blindly in the streets; they were polluted in blood, so that no one could touch their garments."},{"num":15,"verse":"They cried unto them, Depart ye; it is unclean; depart, depart, touch not because they were contaminated; and when they were thrust through, they said among the Gentiles, They shall never dwell here again."},{"num":16,"verse":"The anger of the LORD has separated them; he will never look upon them again. They did not respect the countenance of the priests, nor did they have compassion on the elders."},{"num":17,"verse":"As for us, our eyes have failed in seeking our vain help; in our watching we have watched for people that cannot save us."},{"num":18,"verse":"They hunt our steps that we cannot walk in our streets; our end came near; our days were fulfilled; for our end is come."},{"num":19,"verse":"Our persecutors were swifter than the eagles of the heaven; they pursued us upon the mountains; they laid wait for us in the wilderness."},{"num":20,"verse":"The breath of our nostrils, the anointed of the LORD, was taken in their pits, of whom we had said, Under his shadow we shall live among the Gentiles."},{"num":21,"verse":"¶ Schin Rejoice and be glad, O daughter of Edom that dwellest in the land of Uz; the cup shall also pass even unto thee; thou shalt be drunken and shalt vomit."},{"num":22,"verse":"The punishment of thine iniquity is accomplished, O daughter of Zion; he will never cause thee to be carried away again; he will visit thine iniquity, O daughter of Edom; he will uncover thy sins."}]