[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And exhorted them all.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The tense implies continuous action; and the verb in the Greek is that from which Barnabas took his name as the “Son of Comfort” or “Counsel.” (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 4:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With purpose of heart.—The preacher had seen the grace of God, and had rejoiced at it; but he knew, as all true teachers know, that it is possible for man’s will to frustrate that grace, and that its co-operation, as manifested in deliberate and firm resolve, was necessary to carry on the good work to its completion. The word for “purpose” meets us again in Acts 27:13.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "With purpose of heart.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The preacher had seen the grace of God, and had rejoiced at it; but he knew, as all true teachers know, that it is possible for man’s will to frustrate that grace, and that its co-operation, as manifested in deliberate and firm resolve, was necessary to carry on the good work to its completion. The word for “purpose” meets us again in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 27:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They would cleave unto the Lord.—The noun is probably used in its dominant New Testament sense, as pointing to the Lord Jesus as the new object of the faith and love of those who had turned to Him.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "They would cleave unto the Lord.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The noun is probably used in its dominant New Testament sense, as pointing to the Lord Jesus as the new object of the faith and love of those who had turned to Him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Acts",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE EXHORTATION OF BARNABAS 1 Acts 11:23",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE EXHORTATION OF BARNABAS 1 ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 11:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The first purely heathen converts had been brought into the Church by the nameless men of Cyprus and Cyrene, private persons with no office or commission to preach, who, in simple obedience to the instincts of a Christian heart, leaped the barrier which seemed impassable to the Church in Jerusalem, and solved the problem over which Apostles were hesitating. Barnabas is sent down to see into this surprising new phenomenon, and his mission, though probably not hostile, was, at all events, one of inquiry and doubt. But like a true man, he yielded to facts, and widened his theory to suit them. He saw the tokens of Christian life in these Gentile converts, and that compelled him to admit that the Church was wider than some of his friends in Jerusalem thought. A pregnant lesson for modern theorists who, on one ground or another of doctrine or of orders, narrow the great conception of Christ’s Church! Can you see ‘the grace of God’ in the people? Then they are in the Church, whatever becomes of your theories, and the sooner you let them out so as to fit the facts, the better for you and for them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Satisfied as to their true Christian character, Barnabas sets himself to help them to grow. Now, remember how recently they had been converted; how, from their Gentile origin, they can have had next to no systematic instruction; how the taint of heathen morals, such as were common in that luxurious, corrupt Antioch, must have clung to them; how unformed must have been their loose Church organisation- and remembering all this, think of this one exhortation as summing up all that Barnabas had to say to them. He does not say, Do this, or Believe that, or Organise the other; but he says, Stick to Jesus Christ the Lord. On this commandment hangs all the law; it is the one all-inclusive summary of the duties of the Christian life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, brethren and fathers, I venture to take these words now, as containing large lessons for us all, appropriate at all times, and especially in a sermon on such an occasion as the present.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We may deal with the thoughts suggested by these words very simply, just looking at the points as they lie-what Barnabas ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saw",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", what he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "felt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", what he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. What Barnabas saw. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. What Barnabas saw.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The grace of God here has very probably the specific meaning of the miracle-working gift of the Holy Spirit. That is rendered probable by the analogy of other instances recorded in the Acts of the Apostles, such as Peter’s experience at Caesarea, where all his hesitations and reluctance were swept away when ‘the Holy Ghost fell on them as on us at the beginning, and they spake with tongues.’ If so, what convinced Barnabas that these uncircumcised Gentiles were Christians like himself, may have been their similar possession of the visible and audible effects of that gift of God. But the language does not compel this interpretation; and the absence of all distinct reference to these extraordinary powers as existing there, among the new converts at Antioch, may be intended to mark a difference in the nature of the evidence. At any rate, the possibly intentional generality of the expression is significant and fairly points to an extension of the spiritual gifts much beyond the limits of miraculous powers. There are other ways by which the grace of God may be seen and heard, thank God! than by speaking with tongues and working miracles; and the first lesson of our text is that wherever that grace is made visible by its appropriate manifestations, there we are to recognise a brother.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Augustine said, ‘Where Christ is there is the Church,’ and that is true, but vague; for the question still remains, ‘And where ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ?’ The only satisfying answer is, Christ is wherever Christlike men manifest a life drawn from, and kindred with, His life. And so the true form of the dictum for practical purposes comes to be: ‘Where the grace of Christ is visible, there is the Church.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That great truth is sinned against and denied in many ways. Most chiefly, perhaps, by the successors in modern garb of the more Jewish portion of that Church at Jerusalem who sent Barnabas to Antioch. They had no objection to Gentiles entering the Church, but they must come in by the way of circumcision; they quite believed that it was Christ who saved, and His grace which sanctified, but they thought that His grace would only flow in a given channel; and so do their modern representatives, who exalt sacraments, and consequently priests, to the same place as the Judaizers in the early Church did the rite of the old Covenant. Such teachers have much to say about the notes of the Church, and have elaborated a complicated system of identification by which you may know the genuine article, and unmask impostors. The attempt is about as wise as to try to weave a network fine enough to keep back a stream. The water will flow through the closest meshes, and when Christ pours out the Spirit, He is apt to do it in utter disregard of notes of the Church, and of channels of sacramental grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We Congregationalists, who have no orders, no sacraments, no Apostolic succession; who in order not to break loose from Christ and conscience have had to break loose from ‘Catholic tradition,’ and have been driven to separation by the true schismatics, who have insisted on another bond of Church unity than union to Christ, are denied nowadays a place in His Church.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The true answer to all that arrogant assumption and narrow pedantry which confine the free flow of the water of life to the conduits of sacraments and orders, and will only allow the wind that bloweth where it listeth to make music in the pipes of their organs, is simply the homely one which shivered a corresponding theory to atoms in the fair open mind of Barnabas.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Spirit of Christ at work in men’s hearts, making them pure and gentle, simple and unworldly, refining their characters, elevating their aims, toning their whole being into accord with the music of His life, is the true proof that men are Christians, and that communities of such men are Churches of His. Mysterious efficacy is claimed for Christian ordinances. Well, the question is a fair one: Is the type of Christian character produced within these sacred limits, which we are hopelessly outside, conspicuously higher and more manifestly Christlike than that nourished by no sacraments, and grown not under glass, but in the unsheltered open? Has not God set His seal on these communities to which we belong? With many faults for which we have to be, and are, humble before Him, we can point to the lineaments of the family likeness, and say, ‘Are they Hebrews? so are we. Are they Israelites? so are we. Are they the seed of Abraham? so are we.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Once get that truth wrought into men’s minds, that the true test of Christianity is the visible presence of a grace in character which is evidently God’s, and whole mountains of prejudice and error melt away. We are just as much in danger of narrowing the Church in accordance with our narrowness as any ‘sacramentarian’ of them all. We are tempted to think that no good thing can grow up under the baleful shadow of that tree, a sacerdotal Christianity. We are tempted to think that all the good people are Dissenters, just as Churchmen are to think that nobody can be a Christian who prays without a prayer-book. Our own type of denominational character-and there is such a thing-comes to be accepted by us as the all but exclusive ideal of a devout man; and we have not imagination enough to conceive, nor charity enough to believe in, the goodness which does not speak our dialect, nor see with our eyes. Dogmatical narrowness has built as high walls as ceremonial Christianity has reared round the fold of Christ, And the one deliverance for us all from the transformed selfishness, which has so much to do with shaping all these wretched narrow theories of the Church, is to do as this man did-open our eyes with sympathetic eagerness to see God’s grace in many an unexpected place, and square our theories with His dealings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It used to be an axiom that there was no life in the sea beyond a certain limit of a few hundred feet. It was learnedly and conclusively demonstrated that pressure and absence of light, and I know not what beside, made life at greater depths impossible. It was proved that in such conditions creatures could not live. And then, when that was settled, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Challenger",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " put down her dredge five miles, and brought up healthy and good-sized living things, with eyes in their heads, from that enormous depth. So, then, the savant had to ask, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " can there be life? instead of asserting that there cannot be; and, no doubt, the answer will be forth coming some day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We have all been too much accustomed to set arbitrary limits to the diffusion of the life of Christ among men. Let us rather rejoice when we see forms of beauty, which bear the mark of His hand, drawn from depths that we deemed waste, and thankfully confess that the bounds of our expectation, and the framework of our institutions, do not confine the breadth of His working, nor the sweep of His grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. What Barnabas felt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. What Barnabas felt.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He was glad.’ It was a triumph of Christian principle to recognise the grace of God under new forms, and in so strange a place. It was a still greater triumph to hail it with rejoicing. One need not have wondered if the acknowledgment of a fact, dead in the teeth of all his prejudices, and seemingly destructive of some profound convictions, had been somewhat grudging. Even a good, true man might have been bewildered and reluctant to let go so much as was destroyed by the admission-’Then hath God granted to the Gentiles also repentance unto life,’-and might have been pardoned if he had not been able to do more than acquiesce and hold his peace. We are scarcely just to these early Jewish Christians when we wonder at their hesitation on this matter, and are apt to forget the enormous strength of the prejudices and sacred conviction which they had to overcome. Hence the context seems to consider that the quick recognition of Christian character on the part of Barnabas, and his gladness at the discovery, need explanation, and so it adds, with special reference to these, as it would seem, ‘for he was a good man, full of the Holy Ghost and of faith,’ as if nothing short of such characteristics could have sufficiently emancipated him from the narrowness that would have refused to discern the good, or the bitterness that would have been offended at it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, dear brethren, we may well test ourselves with this question: Does the discovery of the working of the grace of God outside the limits of our own Churches and communions excite a quick, spontaneous emotion of gladness in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hearts? It may upset some of our theories; it may teach us that things which we thought very important, ‘distinctive principles’ and the like, are not altogether as precious as we thought them; it may require us to give up some pleasant ideas of our superiority, and of the necessary conformity of all good people to our type. Are we willing to let them all go, and without a twinge of envy or a hanging back from prejudice, to welcome the discovery that ‘God fulfils Himself in many ways’? Have we schooled ourselves to say honestly, ‘Therein I do rejoice, yea, and will rejoice’?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is much to overcome if we would know this Christlike gladness. The good and the bad in us may both oppose it. The natural deeper interest in the well-being of the Churches of our own faith and order, the legitimate ties which unite us with these, our conscientious convictions, our friendships, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "esprit de corps",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " born of fighting shoulder to shoulder, will, of course, make our sympathies flow most quickly and deeply in denominational channels. And then come in abundance of less worthy motives, some altogether bad and some the exaggeration of what is good, and we get swallowed up in our own individual work, or in that of our ‘denomination,’ and have but a very tepid joy in anybody else’s prosperity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In almost every town of England, your Churches, and those to which I belong, with Presbyterians and Wesleyans, stand side by side. The conditions of our work make some rivalry inevitable, and none of us, I suppose, object to that. It helps to keep us all diligent: a sturdy adherence to our several ‘distinctive principles’ and an occasional hard blow in fair fight on their behalf we shall all insist upon. Our brotherhood is all the more real for frank speech, and ‘the animated No!’ is an essential in all intercourse which is not stagnant or mawkish. There is much true fellowship and much good feeling among all these. But we want far more of an honest rejoicing in each other’s success, a quicker and truer manly sympathy with each other’s work, a fuller consciousness of our solidarity in Christ, and a clearer exhibition of it before the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And on a wider view, as our eyes travel over the wide field of Christendom, and our memories go back over the long ages of the story of the Church, let gladness, and not wonder or reluctance, be the temper with which we see the graces of Christian character lifting their meek blossoms in corners strange to us, and breathing their fragrance over the pastures of the wilderness. In many a cloister, in many a hermit’s cell, from amidst the smoke of incense, through the dust of controversies, we should see, and be glad to see, faces bright with the radiance caught from Christ. Let us set a jealous watch over our hearts that self-absorption, or denominationalism, or envy do not make the sight a pain instead of a joy; and let us remember that the eye-salve which will purge our dim sight to behold the grace of God in all its forms is that grace itself, which ever recognises its own kindred, and lives in the gladness of charity, and the joy of beholding a brother’s good. If we are to have eyes to know the grace of God when we see it, and a heart to rejoice when we know it, we must get them as Barnabas got his, and be good men, because we are full of the Holy Ghost, and full of the Holy Ghost because we are full of faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. What Barnabas said. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. What Barnabas said.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He exhorted them all, that with purpose of heart they would cleave unto the Lord.’ The first thing that strikes one about this all-sufficient directory for Christian life is the emphasis with which it sets forth ‘the Lord’ as the one object to be grasped and held. The sum of all objective Religion is Christ-the sum of all subjective Religion is cleaving to Him. A living Person to be laid hold of, and a personal relation to that Person, such is the conception of Religion, whether considered as revelation or as inward life, which underlies this exhortation. Whether we listen to His own words about Himself, and mark the altogether unprecedented way in which He was His own theme, and the unique decisiveness and plainness with which He puts His own personality before us as the Incarnate Truth, the pattern for all human conduct, the refuge and the rest for the world of weary ones; or whether we give ear to the teaching of His Apostles; from whatever point of view we approach Christianity, it all resolves itself into the person of Jesus Christ. He is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Revelation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of God; theology, properly so called, is but the formulating of the facts which He gives us; and for the modern world the alternative is, Christ the manifested God, or no God at all, other than the shadow of a name. He is the perfect ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Exemplar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of humanity! The law of life and the power to fulfil the law are both in Him; and the superiority of Christian morality consists not in this or that isolated precept, but in the embodiment of all goodness in His life, and in the new motive which He supplies for keeping the commandment. Wrenched away from Him, Christian morality has no being. He is the sacrifice for the world, the salvation of which flows from what He does, and not merely from what He taught or was. His personality is the foundation of His work, and the gospel of forgiveness and reconciliation is all contained in the name of Jesus.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a constant tendency to separate the results of Christ’s life and death, whether considered as revelation, atonement, or ethics, from Him, and unconsciously to make these the sum of our Religion, and the object of our faith. Especially is this the case in times of restless thought and eager canvassing of the very foundations of religious belief, like the present. Therefore it is wholesome for us all to be brought back to the pregnant simplicity of the thought which underlies this text, and to mark how vividly these early Christians apprehended a living Lord as the sum and substance of all which they had to grasp.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a whole world between the man to whom God’s revelation consists in certain doctrines given to us by Jesus Christ, and the man to whom it consists in that Christ Himself. Grasping a living person is not the same as accepting a proposition. True, the propositions are about Him, and we do not know Him without them. But equally true, we need to be reminded that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is our Saviour and not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that God has revealed Himself to us not in words and sentences but in a life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For, alas! the doctrinal element has overborne the personal among all Churches and all schools of thought, and in the necessary process of formulating and systematising the riches which are in Jesus, we are all apt to confound the creeds with the Christ, and so to manipulate Christianity until, instead of being the revelation of a Person and a gospel, it has become a system of divinity. Simple, devout souls have to complain that they cannot find even a dead Christ, to say nothing of a living one, for the theologians have ‘taken away their Lord, and they know not where they have laid Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is, therefore, to be reckoned as a distinct gain that one result of the course of more recent thought, both among friends and foes, has been to make all men feel more than before, that all revelation is contained in the living person of Jesus Christ. So did the Church believe before creeds were. So it is coming to feel again, with a consciousness enriched and defined by the whole body of doctrine, which has flowed from Him during all the ages. That solemn, gracious Figure rises day by day more clearly before men, whether they love Him or no, as the vital centre of this great whole of doctrines, laws, institutions, which we call Christianity. Round the story of His life the final struggle is to be waged. The foe feels that, so long as that remains, all other victories count for nothing. We feel that if that goes, there is nothing to keep. The principles and the precepts will perish alike, as the fair palace of the old legend, that crumbled to dust when its builder died. But so long as He stands before mankind as He is painted in the Gospel, it will endure. If all else were annihilated, Churches, creeds and all, leave us these four Gospels, and all else would be evolved again. The world knows now, and the Church has always known, though it has not always been true to the significance of the fact, that Jesus Christ is Christianity, and that because He lives, it will live also.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And consequently the sum of all personal religion is this simple act described here as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cleaving to Him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Need I do more than refer to the rich variety of symbols and forms of expression under which that thought is put alike by the Master and by His servants? Deepest of all are His own great words, of which our text is but a feeble echo, ‘Abide in Me, and I in you.’ Fairest of all is that lovely emblem of the vine, setting forth the sweet mystery of our union with Him. Far as it is from the outmost pliant tendril to the root, one life passes to the very extremities, and every cluster swells and reddens and mellows because of its mysterious flow. ‘So also is Christ.’ We remember how often the invitation flowed from His lips, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " unto Me; how He was wont to beckon men away from self and the world with the great command, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Follow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Me; how He explained the secret of all true life to consist in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eating",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him. We may recall, too, the emphasis and perpetual reiteration with which Paul speaks of being ‘in Jesus’ as the condition of all blessedness, power, and righteousness; and the emblems which he so often employs of the building bound into a whole on the foundation from which it derives its stability, of the body compacted and organised into a whole by the head from which it derives its life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We begin to be Christians, as this context tells us, when we ‘turn to the Lord.’ We continue to be Christians, as Barnabas reminded these ignorant beginners, by ‘cleaving to the Lord.’ Seeing, then, that our great task is to preserve that which we have as the very foundation of our Christian life, clearly the truest method of so keeping it will be the constant repetition of the act by which we got it at first. In other words, faith joined us to Christ, and continuously reiterated acts of faith keep us united to Him. So, if I may venture, fathers and brethren, to cast my words into the form of exhortation, even to such an audience as the present, I would earnestly say, Let us cleave to Christ by continual renewal of our first faith in Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The longest line may be conceived of as produced simply by the motion of its initial point. So should our lives be, our progress not consisting in leaving our early acts of faith behind us, but in repeating them over and over again till the points coalesce in one unbroken line which goes straight to the Throne and Heart of Jesus. True, the repetition should be accompanied with fuller knowledge, with calmer certitude, and should come from a heart ennobled and encircled by a Christ-possessing past. As in some great symphony the theme which was given out in low notes on one poor instrument recurs over and over again, embroidered with varying harmonies, and unfolding a richer music, till it swells into all the grandeur of the triumphant close, so our lives should be bound into a unity, and in their unity bound to Christ by the constant renewal of our early faith, and the fathers should come round again to the place which they occupied when as children they first knew Him that is ‘from the beginning’ to the end one and the same.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such constant reiteration is needed, too, because yesterday’s trust has no more power to secure to-day’s union than the shreds of cloth and nails which hold last year’s growth to the wall will fasten this year’s shoots. Each moment must be united to Christ by its own act of faith, or it will be separated from Him. So living in the Lord we shall be strong and wise, happy and holy. So dying in the Lord we shall be of the dead who are blessed. So sleeping in Jesus we shall at the last be found in Him at that day, and shall be raised up together, and made to sit together in heavenly places in Christ Jesus.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But more specially let us cleave to Christ by habitual contemplation. There can be no real continuous closeness of intercourse with Him, except by thought ever recurring to Him amidst all the tumult of our busy days. I do not mean professional thinking or controversial thinking, of which we ministers have more than enough. There is another mood of mind in which to approach our Lord than these, a mood sadly unfamiliar, I am afraid, in these days: when poor Mary has hardly a chance of a reputation for ‘usefulness’ by the side of busy, bustling Martha-that still contemplation of the truth which we possess, not with the view of discovering its foundations, or investigating its applications, or even of increasing our knowledge of its contents, but of bringing our own souls more completely under its influence, and saturating our being with its fragrance. The Church has forgotten how to meditate. We are all so occupied arguing and deducing and elaborating, that we have no time for retired, still contemplation, and therefore lose the finest aroma of the truth we profess to believe. Many of us are so busy thinking about Christianity that we have lost our hold of Christ. Sure I am that there are few things more needed by our modern religion than the old exhortation, ‘Come, My people, enter into thy chambers and shut thy doors about thee.’ Cleave to the Lord by habitual play of meditative thought on the treasures hidden in His name, and waiting like gold in the quartz, to be the prize of our patient sifting and close gaze.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And when the great truths embodied in Him stand clear before us, then let us remember that we have not done with them when we have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " them. Next must come into exercise the moral side of faith, the voluntary act of trust, the casting ourselves on Him whom we behold, the making our own of the blessings which He holds out to us. Flee to Christ as to our strong habitation to which we may continually resort. Hold tightly by Christ with a grasp which nothing can slacken {that whitens your very knuckles as you clutch Him}, lean on Christ all your weight and all your burdens. Cleave to the Lord with full purpose of heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us cleave to the Lord by constant outgoings of our love to Him. That is the bond which unites human spirits together in the only real union, and Scripture teaches us to see in the sweetest, sacredest, closest tie that men and women can know, a real, though faint, shadow of the far deeper and truer union between Christ and us. The same love which is the bond of perfectness between man and man, is the bond between us and Christ. In no dreamy, semi-pantheistic fusion of the believer with his Lord do we find the true conception of the unity of Christ and His Church, but in a union which preserves the individualities lest it should slay the love. Faith knits us to Christ, and faith is the mother of love, which maintains the blessed union. So let us not be ashamed of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "emotional",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " side of our religion, nor deem that we can cleave to Christ unless our hearts twine their tendrils round Him, and our love pours its odorous treasures on His sacred feet, not without weeping and embraces. Cold natures may carp, but Love is justified of her children, and Christ accepts the homage that has a heart in it. Cleaving to the Lord is not merely love, but it is impossible without it. The order is Faith, Love, Obedience-that threefold cord knits men to Christ, and Christ to men. For the understanding, a continuous grasp of Him as the object of thought. For the heart, a continuous outgoing to Him as the object of our love. For the will, a continuous submission to Him as the Lord of our obedience. For the whole nature, a continuous cleaving to Him as the object of our faith and worship.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such is the true discipline of the Christian life. Such is the all-sufficient command; as for the newest convert from heathenism, with little knowledge and the taint of his old vices in his soul, so for the saint fullest of wisdom and nearest the Light.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all-sufficient. If Barnabas had been like some of us, he would have had a very different style of exhortation. He would have said, ‘This irregular work has been well done, but there are no authorised teachers here, and no provision has been made for the due administration of the sacraments of the Church. The very first thing of all is to give these people the blessing of bishops and priests.’ Some of us would have said, ‘Valuable work has been done, but these good people are terribly ignorant. The best thing would be to get ready as soon as possible some manual of Christian doctrine, and in the meantime provide for their systematic instruction in at least the elements of the faith.’ Some of us would have said, ‘No doubt they have been converted, but we fear there has been too much of the emotional in the preaching. The moral side of Christianity has not been pressed home, and what they chiefly need is to be taught that it is not feeling, but righteousness. Plain, practical instruction in Christian duty is the one thing they want.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Barnabas knew better. He did not despise organisation, nor orthodoxy, nor practical righteousness, but he knew that all three, and everything else that any man needed for his perfecting would come, if only the converts kept near to Christ, and that nothing else was of any use if they did not. That same conviction should for us settle the relative importance which we attach to these subordinate and derivative things, and to the primary and primitive duty. Obedience to it will secure them. They, without it, are not worth securing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We spend much pains and effort nowadays in perfecting our organisations and consolidating our resources, and I have not a word to say against that. But heavier machinery needs more power in the engine, and that means greater capacity in your boilers and more fire in your furnace. The more complete our organisation, the more do we need a firm hold of Christ, or we shall be overweighted by it, shall be in danger of burning incense to our own net, shall be tempted to trust in drill rather than in courage, in mechanism rather than in the life drawn from Christ. On the other hand, if we put as our first care the preservation of the closeness of our union with Christ, that life will shape a body for itself, and ‘to every seed its own body.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " True conceptions of Him, and a definite theology, are good and needful. Let us cleave to Him with mind and heart, and we shall receive all the knowledge we need, and be guided into the deep things of God. In Him are hid all the treasures of wisdom and knowledge, and the basis of all theology is the personal possession of Him who is ‘the wisdom of God’ and ‘the Light of the world.’ Every one that loveth is born of God and knoweth God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pectus facit Theologum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Plain, straightforward morality and everyday righteousness are better than all emotion and all dogmatism and all churchism, says the world, and Christianity says much the same; but plain, straightforward righteousness and everyday morality come most surely when a man is keeping close to Christ. In a word, everything that can adorn the character with beauty, and clothe the Church with glorious apparel, whatsoever things are lovely and of good report, all that the world or God calls virtue and crowns with praise, they are all in their fulness in Him, and all are most surely derived from Him by keeping fast hold of His hand, and preserving the channels clear through which His manifold grace may flow into our souls. The same life is strength in the arm, pliancy in the fingers, swiftness in the foot, light in the eye, music on the lips; so the same grace is Protean in its forms, and to His servants who trust Him Christ ever says, ‘What would ye that I should do unto you? Be it even as thou wilt.’ The same mysterious power lives in the swaying branch, and in the veined leaf, and in the blushing clusters. With like wondrous transformations of the one grace, the Lord pours Himself into our spirits, filling all needs and fitting for all circumstances. Therefore for us all, individuals and Churches, this remains the prime command, ‘With purpose of heart cleave unto the Lord.’ Dear brethren in the ministry, how sorely we need this exhortation! Our very professional occupation with Christ and His truth is full of danger for us; we are so accustomed to handle these sacred themes as a means of instructing or impressing others that we get to regard them as our weapons, even if we do not degrade them still further by thinking of them as our stock-in-trade and means of oratorical effect. We must keep very firm hold of Christ for ourselves by much solitary communion, and so retranslating into the nutriment of our own souls the message we bring to men, else when we have preached to others we ourselves may he cast away. All the ordinary tendencies which draw men from Him work on us, and a host of others peculiar to ourselves, and all around us run strong currents of thought which threaten to sweep many away. Let us tighten our grasp of Him in the face of modern doubt; and take heed to ourselves that neither vanity, nor worldliness, nor sloth; neither the gravitation earthward common to all, nor the temptations proper to our office; neither unbelieving voices without nor voices within, seduce us from His side. There only is our peace, there our wisdom, there our power.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Subtly and silently the separating forces are ever at work upon us, and all unconsciously to ourselves our hold may relax, and the flow of this grace into our spirits may cease, while yet we mechanically keep up the round of outward service, nor even suspect that our strength is departed from us. Many a stately elm that seems full of vigorous life, for all its spreading boughs and clouds of dancing leaves, is hollow at the heart, and when the storm comes goes down with a crash, and men wonder, as they look at the ruin, how such a mere shell of life with a core of corruption could stand so long. It rotted within, and fell at last, because its roots did not go deep down to the rich soil, where they would have found nourishment, but ran along near the surface among gravel and stones. If we would stand firm, be sound within, and bring forth much fruit, we must strike our roots deep in Him who is the anchorage of our souls, and the nourisher of all our being.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Hearken, beloved brethren, in this great work of the ministry, not to the exhortation of the servant, but to the solemn command of the Master, ‘Abide in Me, and I in you. As the branch cannot bear fruit of itself, except it abide in the vine, no more can ye, except ye abide in Me.’ And let us, knowing our own weakness, take heed of the self-confidence that answers, ‘Though all should forsake Thee, yet will not I,’ and turn the vows which spring to our lips into the lowly prayer, ‘My soul cleaveth unto the dust, quicken Thou me according to Thy word.’ Then, thinking rather of His cleaving to us than of our cleaving to Him, let us resolutely take as the motto of our lives the grand words: ‘I follow after, if that I may lay hold of that for which I am also laid hold of by Christ Jesus!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1  Preached before the Congregational Union of England and Wales.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:19-24 The first preachers of the gospel at Antioch, were dispersed from Jerusalem by persecution; thus what was meant to hurt the church, was made to work for its good. The wrath of man is made to praise God. What should the ministers of Christ preach, but Christ? Christ, and him crucified? Christ, and him glorified? And their preaching was accompanied with the Divine power. The hand of the Lord was with them, to bring that home to the hearts and consciences of men, which they could but speak to the outward ear. They believed; they were convinced of the truth of the gospel. They turned from a careless, carnal way of living, to live a holy, heavenly, spiritual life. They turned from worshipping God in show and ceremony, to worship him in the Spirit and in truth. They turned to the Lord Jesus, and he became all in all with them. This was the work of conversion wrought upon them, and it must be wrought upon every one of us. It was the fruit of their faith; all who sincerely believe, will turn to the Lord, When the Lord Jesus is preached in simplicity, and according to the Scriptures, he will give success; and when sinners are thus brought to the Lord, really good men, who are full of faith and of the Holy Ghost, will admire and rejoice in the grace of God bestowed on them. Barnabas was full of faith; full of the grace of faith, and full of the fruits of the faith that works by love.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Had seen the grace of God - The favor, or mercy of God, in converting sinners to himself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Was glad - Approved of what had been done in preaching the gospel to the Gentiles, and rejoiced that God had poured down his Spirit on them. The effect of a revival is to produce joy in the hearts of all those who love the Saviour.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And exhorted them all - Entreated them. They would be exposed to many trials and temptations, and he sought to secure their firm adherence to the cause of religion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That with purpose of heart - With a firm mind; with a fixed, settled resolution that they would make this their settled plan of life, their main object. A purpose, πρόθεσις  prothesis, is a resolution of the mind, a plan, or intention, Romans 8:28; Ephesians 1:11; Ephesians 3:11; 2 Timothy 1:9; 2 Timothy 3:10. It is especially a resolution of the mind in regard to future conduct, and the doctrine of Barnabas here was, undoubtedly, that it should be a regular, fixed, determined plan or design in their minds that they would henceforward adhere to God. Such a plan should be formed by all Christians in the beginning of their Christian life, and without such a plan there can be no evidence of piety. We may also remark that such a plan is one of the heart. It is not simply of the understanding, but is of the entire mind, including the will and affections. It is the leading principle; the strongest affection; the guiding purpose of the will to adhere to God, and, unless this is the prevalent, governing desire of the heart, there can be no evidence of conversion.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That with purpose of heart - With a firm mind; with a fixed, settled resolution that they would make this their settled plan of life, their main object. A purpose, πρόθεσις  prothesis, is a resolution of the mind, a plan, or intention, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 3:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is especially a resolution of the mind in regard to future conduct, and the doctrine of Barnabas here was, undoubtedly, that it should be a regular, fixed, determined plan or design in their minds that they would henceforward adhere to God. Such a plan should be formed by all Christians in the beginning of their Christian life, and without such a plan there can be no evidence of piety. We may also remark that such a plan is one of the heart. It is not simply of the understanding, but is of the entire mind, including the will and affections. It is the leading principle; the strongest affection; the guiding purpose of the will to adhere to God, and, unless this is the prevalent, governing desire of the heart, there can be no evidence of conversion.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They would cleave - Greek: that they would remain; that is, that they would adhere constantly and faithfully attached to the Lord. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They would cleave - Greek: that they would remain; that is, that they would adhere constantly and faithfully attached to the Lord. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. when he … had seen the grace of God—in the new converts.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "was glad—owned and rejoiced in it at once as divine, though they were uncircumcised.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "exhorted them all that with purpose of heart—as opposed to a hasty and fickle discipleship.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they would cleave unto the Lord—the Lord Jesus.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The grace of God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which appeared in their conversion, being made manifest by their professions, and answered by their pious lives and conversations; for all which they might cry, Grace, grace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "By ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the grace of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is also to be understood the increasing of the church, and adding to it such as should be saved. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Was glad; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is matter of joy in heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 15:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and of all such as are learning their lesson, and preparing for that blissful place. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With purpose of heart; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " firm and fixed resolution, that come what can come, tribulation or distress, life or death, they would keep close to the profession of the truth of Christ. This ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "purpose of heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the same with the whole heart elsewhere; which must ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cleave unto the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be joined, or stick close, to God’s truth and ways. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who when he came, and had seen the grace of God,.... The many instances of the powerful and efficacious grace of God in regeneration and conversion; the great goodness, love, and favour of God in enlightening, quickening, and converting so many souls; and the wonderful gifts of the Spirit bestowed upon many of them, fitting them for public use and service: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "was glad; rejoiced at heart, and gave glory to God, as every good man will, at the success of the gospel in the conversion of sinners, let it be by what instrument or means it will, and at the gifts and grace bestowed on them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and exhorted them all; in whom he saw the grace of God implanted, who had received the doctrine of the grace of God, and had gifts of grace qualifying them for usefulness, in some nation or another: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that with purpose of heart they would cleave unto the Lord; that is, with a fixed resolution in the grace and strength of Christ, they would hold to his person, exercising grace upon him, abide by his truths and ordinances, keep close to his people, adhere to his cause and interest, and hold on and out unto the end. The Arabic version takes \"the purpose of heart\" to be meant of Barnabas, and reads the words thus, \"and he exhorted them according to the usual firmness of his heart, that they would continue in the faith of the Lord\"; in the doctrine and grace of faith in Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that with purpose of heart they would cleave unto the Lord; that is, with a fixed resolution in the grace and strength of Christ, they would hold to his person, exercising grace upon him, abide by his truths and ordinances, keep close to his people, adhere to his cause and interest, and hold on and out unto the end. The Arabic version takes \"the purpose of heart\" to be meant of Barnabas, and reads the words thus, \"and he exhorted them according to the usual firmness of his heart, that they would continue in the faith of the Lord\"; in the doctrine and grace of faith in Christ. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Who, when he came, and had seen the grace of God, was glad, and exhorted them all, that with purpose of heart they would cleave unto the Lord.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 11:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν χάριν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": if we add ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see critical notes, “the grace that was of God” Hort, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ecclesia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 60, so Alford.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παρεκάλει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": a true son of encouragement, exhortation—see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 4:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", imperfect because Barnabas remained at Antioch, and the result is indicated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 11:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προσετέθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This mention of Barnabas and the part played by the primitive Church is referred by Clemen to his Redactor Antijudaicus, p. 109. If we read ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ Κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". with R.V. margin we could render “to abide by the purpose of their heart in the Lord,” so Hort, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "u. s.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 60; Rendall; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Symmachus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Weiss). ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῷ Κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Christ; with this verse cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where St. Luke similarly insists upon the due qualification of divine gifts; Ramsay, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "St. Paul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 45.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and had seen the grace of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] exhibited in the faith, and consequent turning to Christ, of these Gentiles.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was glad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] He saw nothing in the new movement which could call for disapproval, and that more members should be added to the Church was a source of joy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and exhorted them all, that with purpose of heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (in the purpose of their heart) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they would cleave unto the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Their determination was at present formed, and they had turned to the Lord; the purport of Barnabas’ exhortation was that continuing in the same determination they should hold fast their faith and allow nothing to shake their attachment to Christ. The heathen converts to Christianity had much to endure for Christ’s sake, and to the weak there were many temptations to relapse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 11:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Παρεκάλει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exhorted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The best kind of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exhortation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is stimulated by joy.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προθέσει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with stedfast purpose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 27:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Supposing that they had obtained their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "purpose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” The contrary is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “An evil heart of unbelief, in departing from the living God.”—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προσμένειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to adhere to, cleave to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To be converted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is the act: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to adhere",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is the state.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " come for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "came",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "exhorted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "exhorted.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Had seen the grace of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had seen the number and the truth of the conversions of Gentiles effected by God's grace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He exhorted them all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "παρεκάλει πάντας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); thus showing himself a true ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "υἱὸς παρακλήσεως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", son of exhortation (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 4:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Cleave unto the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "προσμένειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to abide, continue, persevere in (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is simply ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μένε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The frequent exhortations to perseverance and steadfastness should warn us of the great danger of falling away from the faith, under the pressure of temptation. Acts 11:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Purpose (προθέσει)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Originally, placing in public; setting before. Hence of the shew-bread, the loaves set forth before the Lord (see on Mark 2:26). Something set before one as an object of attainment: a purpose. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Originally, placing in public; setting before. Hence of the shew-bread, the loaves set forth before the Lord (see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 2:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Something set before one as an object of attainment: a purpose. ",
            "children": []
          }
        ]
      }
    ]
  }
]