[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the Lord spake unto Aaron.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As half of the staff of the priesthood had thus been struck down, and the other half were not allowed to mourn over the departed, the chief of the survivors might have thought that God was altogether displeased with the newly created pontificate. To comfort him, therefore, as well as to restore the prestige of this sacred office in the eyes of the people, who had witnessed the disobedience and punishment of the spiritual functionaries, the Lord, who hitherto made all such communications to Moses, now honours Aaron with speaking to him immediately.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:8-11 Do not drink wine or strong drink. During the time they ministered, the priests were forbidden it. It is required of gospel ministers, that they be not given to wine, 1Ti 3:3. It is, Lest ye die; die when ye are in drink. The danger of death, to which we are continually exposed, should engage all to be sober.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The anointing oil ... is upon you - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 8:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The holy oil, as the symbol of the Holy Spirit, the Spirit of Life and immortality and joy, was the sign of the priests being brought near to Yahweh. It was therefore by its meaning connected both with the general law which forbade the high priest ever to put on signs of mourning on account of death ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 21:10-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and with the special reason for the prohibition on this occasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8-11. Do not drink wine nor strong drink—This prohibition, and the accompanying admonitions, following immediately the occurrence of so fatal a catastrophe [Le 10:1, 2], has given rise to an opinion entertained by many, that the two disobedient priests were under the influence of intoxication when they committed the offense which was expiated only by their lives. But such an idea, though the presumption is in its favor, is nothing more than conjecture.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord spake unto Aaron,.... Because he was a prophet, Aben Ezra says; but the reason rather seems to be, because be was the high priest, and now invested with his office, and in the execution of it, and therefore the following law respecting the priest's drinking of wine was given: some say, as the same writer observes, that God spake to him by Moses; but it rather seems that he spoke to Aaron immediately: according to Jarchi, this order was delivered to him as a reward for his silence, and to do honour to him on that account: saying; as follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD spake unto Aaron, saying,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord spake unto Aaron, saying, Jehovah still further commanded Aaron and his sons not to drink wine and strong drink when they entered the tabernacle to perform service there, on pain of death, as a perpetual statute for their generations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that they might be able to distinguish between the holy and common, the clean and unclean, and also to instruct the children of Israel in all the laws which God had spoken to them through Moses (ו...ו, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", et...et, both...and also). Shecar was an intoxicating drink made of barley and dates or honey. הל, profanus, common, is a wider or more comprehensive notion than טמא, unclean. Everything was common (profane) which was not fitted for the sanctuary, even what was allowable for daily use and enjoyment, and therefore was to be regarded as clean. The motive for laying down on this particular occasion a prohibition which was to hold good for all time, seems to lie in the event recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although we can hardly infer from this, as some commentators have done, that Nadab and Abihu offered the unlawful incense-offering in a state of intoxication. The connection between their act and this prohibition consisted simply in the rashness, which had lost the clear and calm reflection that is indispensable to right action. ",
        "children": []
      }
    ]
  }
]