[{"header":"Israel Turned Away From God"},{"num":20,"verse":"One day some of the elders of Israel came to me to ask the Lord for advice. This was on the tenth day of the fifth month of the seventh year of exile. The elders sat down in front of me."},{"num":2,"verse":"Then the word of the Lord came to me. He said,"},{"num":3,"verse":"“Son of man, speak to the elders of Israel. Tell them ‘This is what the Lord God says: Have you come to ask me what you should do? I, the Lord God, tell you that, as surely as I live, I will not listen to you.’"},{"num":4,"verse":"Should you judge them? Will you judge them, son of man? You must tell them about the terrible things their fathers have done."},{"num":5,"verse":"You must tell them, ‘This is what the Lord God says: On the day I chose Israel, I raised my hand to Jacob’s family and made a promise to them in Egypt. When I let them know who I was, I raised my hand and said, “I am the Lord your God.”"},{"num":6,"verse":"On that day I promised to take you out of Egypt and lead you to the land I was giving to you. That was a good land filled with many good things. It was the most beautiful of all countries!"},{"num":7,"verse":"“‘I told the family of Israel to throw away their horrible idols. I told them not to become filthy with those filthy statues from Egypt. I said, “I am the Lord your God.”"},{"num":8,"verse":"But they turned against me and refused to listen to me. They did not throw away their horrible idols. They did not leave their filthy statues in Egypt. So I decided to destroy them in Egypt—to let them feel the full force of my anger."},{"num":9,"verse":"But I did not destroy them. I had already told the Egyptians that I would bring my people out of Egypt. I did not want to ruin my good name, so I did not destroy Israel in front of those other people."},{"num":10,"verse":"I brought the family of Israel out of Egypt. I led them into the desert."},{"num":11,"verse":"Then I gave them my laws and told them all my rules. All those who obey them will live."},{"num":12,"verse":"I also told them about all the special days of rest, which were a special sign between us. They showed that I am the Lord and that I was making them special to me."},{"num":13,"verse":"“‘But the family of Israel turned against me in the desert. They did not follow my laws. They refused to obey my rules—even though people who obey my laws live because of them. They treated my special days of rest as if they were not important. They worked on those days many times. I decided to destroy them in the desert—to let them feel the full force of my anger."},{"num":14,"verse":"But I did not destroy them. The other nations saw me bring Israel out of Egypt. I did not want to ruin my good name, so I did not destroy Israel in front of those other people."},{"num":15,"verse":"I made another promise to those people in the desert. I promised that I would not bring them into the land I was giving them. That was a good land filled with many good things. It was the most beautiful of all countries!"},{"num":16,"verse":"“‘The people of Israel refused to obey my rules or to follow my laws. They treated my days of rest as if they were not important. They did all these things because their hearts belonged to their filthy idols."},{"num":17,"verse":"But I felt sorry for them, so I did not destroy them. I did not completely destroy them in the desert."},{"num":18,"verse":"I spoke to their children and told them, “Don’t be like your parents. Don’t make yourselves filthy with their filthy idols. Don’t follow their laws or obey their commands."},{"num":19,"verse":"I am the Lord. I am your God. Obey my laws and keep my commands. Do the things I tell you."},{"num":20,"verse":"Show that my days of rest are important to you. Remember, they are a special sign between us. I am the Lord, and these days show you that I am your God.”"},{"num":21,"verse":"“‘But the children turned against me and did not obey my laws. They did not keep my commands—even though people who obey my laws live because of them. They treated my special days of rest as though they were not important. So I decided to destroy them completely in the desert—to let them feel the full force of my anger."},{"num":22,"verse":"But I stopped myself. The other nations saw me bring Israel out of Egypt. I did not want to ruin my good name, so I did not destroy Israel in front of those other people."},{"num":23,"verse":"So I made another promise to those people in the desert. I promised to scatter them among the nations, to send them to many different countries."},{"num":24,"verse":"“‘The people of Israel did not obey my commands. They refused to obey my laws. They treated my special days of rest as though they were not important, and they worshiped the filthy idols of their fathers."},{"num":25,"verse":"So I gave them laws that were not good. I gave them commands that would not bring life."},{"num":26,"verse":"I let them make themselves filthy with their gifts. They even began to sacrifice their own firstborn children. In this way I would destroy them. Then they would know that I am the Lord.’"},{"num":27,"verse":"So now, son of man, speak to the family of Israel. Tell them, ‘This is what the Lord God says: The people of Israel said bad things about me and made evil plans against me."},{"num":28,"verse":"But I still brought them to the land I promised to give them. They saw all the hills and green trees, so they went to all those places to worship. They took their sacrifices and anger offerings to all those places. They offered their sacrifices that made a sweet smell, and they offered their drink offerings at those places."},{"num":29,"verse":"I asked the people of Israel why they were going to the high places. But that high place is still there today.’"},{"num":30,"verse":"“Since Israel did those things, speak to them and tell them, ‘This is what the Lord God says: You people have made yourselves filthy by doing the things your ancestors did. You have acted like a prostitute. You have left me to be with the horrible gods your ancestors worshiped."},{"num":31,"verse":"You are giving the same kind of gifts. You are putting your children in the fire as a gift to your false gods. You are still making yourself filthy with these filthy idols today! Do you really think that I should let you come to me and ask me for advice? I am the Lord God. By my life, I swear that I will not answer your questions or give you advice!"},{"num":32,"verse":"You keep saying you want to be like the other nations. You live like the people in other nations. You serve pieces of wood and stone idols!’”"},{"num":33,"verse":"The Lord God says, “By my life, I swear that I will rule over you as king. But I will raise my powerful arm and punish you. I will show my anger against you!"},{"num":34,"verse":"I will bring you out of these other nations. I scattered you among these nations, but I will gather you together and bring you back from these countries. But I will raise my powerful arm and punish you. I will show my anger against you!"},{"num":35,"verse":"I will lead you into a desert as I did before, but this will be a place where other nations live. We will stand face to face, and I will judge you."},{"num":36,"verse":"I will judge you as I judged your ancestors in the desert near Egypt.” This is what the Lord God said."},{"num":37,"verse":"“I will judge you guilty and punish you according to the agreement."},{"num":38,"verse":"I will remove all those who turned against me and sinned against me. I will remove them from your homeland. They will never again come to the land of Israel. Then you will know that I am the Lord.”"},{"num":39,"verse":"Now, family of Israel, this is what the Lord God says: “Whoever wants to worship their filthy idols, let them go and worship them. But later, don’t think you will get any advice from me. You will not ruin my name anymore—not when you continue to give your gifts to your filthy idols!”"},{"num":40,"verse":"The Lord God says, “People must come to my holy mountain—the high mountain in Israel—to serve me! The whole family of Israel will be on their land; they will be there in their country. There you can come to ask me for advice, and you must come there to bring me your offerings. You must bring the first part of your crops to me there. You must bring all your holy gifts to me in that place."},{"num":41,"verse":"Then I will be pleased with the sweet smell of your sacrifices. That will happen when I bring you back. I scattered you among many nations, but I will gather you together and make you my special people again. And all the nations will see it."},{"num":42,"verse":"Then you will know that I am the Lord. You will know this when I bring you back to the land of Israel, the land I promised to give to your ancestors."},{"num":43,"verse":"In that country you will remember all the evil things you did that made you filthy, and you will be ashamed."},{"num":44,"verse":"Family of Israel, you did many evil things, and you should be destroyed because of them. But to protect my good name, I will not give you the punishment you really deserve. Then you will know that I am the Lord.” This is what the Lord God said."},{"num":45,"verse":"Then the word of the Lord came to me. He said,"},{"num":46,"verse":"“Son of man, look toward the Negev, the southern part of Judah. Speak against the Negev Forest."},{"num":47,"verse":"Say to the Negev Forest, ‘Listen to the word of the Lord. This is what the Lord God said: Look, I am ready to start a fire in your forest. The fire will destroy every green tree and every dry tree. The flame that burns will not be put out. All the land from south to north will be burned by the fire."},{"num":48,"verse":"Then all people will see that I, the Lord, have started the fire. The fire will not be put out!’”"},{"num":49,"verse":"Then I said, “Oh, Lord God! If I say this, the people will say that I am only telling them stories.”"}]