[{"header":"God’s Dealings with Israel Rehearsed"},{"num":20,"verse":"Now in the seventh year, in the fifth month, on the tenth of the month, men from the elders of Israel came to inquire of the Lord, and they sat before me."},{"num":2,"verse":"Then the word of the Lord came to me, saying,"},{"num":3,"verse":"“Son of man, speak to the elders of Israel and say to them, ‘This is what the Lord God says: “Do you yourselves come to inquire of Me? As I live,” declares the Lord God, “I certainly will not be inquired of by you.”’"},{"num":4,"verse":"Will you judge them, will you judge them, son of man? Make known to them the abominations of their fathers;"},{"num":5,"verse":"and say to them, ‘This is what the Lord God says: “On the day when I chose Israel and swore to the descendants of the house of Jacob and made Myself known to them in the land of Egypt, when I swore to them, saying, I am the Lord your God,"},{"num":6,"verse":"on that day I swore to them, to bring them out from the land of Egypt into a land that I had selected for them, flowing with milk and honey, which is the glory of all the lands."},{"num":7,"verse":"And I said to them, ‘Throw away, each of you, the detestable things of his eyes, and do not defile yourselves with the idols of Egypt; I am the Lord your God.’"},{"num":8,"verse":"But they rebelled against Me and were not willing to listen to Me; they did not throw away, each of them, the detestable things of their eyes, nor did they abandon the idols of Egypt."},{"num":9,"verse":"But I acted for the sake of My name, that it would not be defiled in the sight of the nations among whom they lived, in whose sight I made Myself known to them by bringing them out of the land of Egypt."},{"num":10,"verse":"So I took them out of the land of Egypt and brought them into the wilderness."},{"num":11,"verse":"I gave them My statutes and informed them of My ordinances, which, if a person follows them, then he will live by them."},{"num":12,"verse":"Also I gave them My Sabbaths to be a sign between Me and them, so that they might know that I am the Lord who sanctifies them."},{"num":13,"verse":"But the house of Israel rebelled against Me in the wilderness. They did not walk in My statutes and they rejected My ordinances, which, if a person follows them, then he will live by them; and they greatly profaned My Sabbaths. Then I resolved to pour out My wrath on them in the wilderness, to annihilate them."},{"num":14,"verse":"But I acted for the sake of My name, so that it would not be defiled before the eyes of the nations, before whose eyes I had brought them out."},{"num":15,"verse":"Also I swore to them in the wilderness that I would not bring them into the land which I had given them, flowing with milk and honey, which is the glory of all the lands,"},{"num":16,"verse":"because they rejected My ordinances, and as for My statutes, they did not walk in them; they also profaned My Sabbaths, because their heart continually followed their idols."},{"num":17,"verse":"Yet My eye spared them rather than destroying them, and I did not bring about their annihilation in the wilderness."},{"num":18,"verse":"“Instead, I said to their children in the wilderness, ‘Do not walk in the statutes of your fathers or keep their ordinances or defile yourselves with their idols."},{"num":19,"verse":"I am the Lord your God; walk in My statutes and keep My ordinances and follow them."},{"num":20,"verse":"Sanctify My Sabbaths; and they shall be a sign between Me and you, so that you may know that I am the Lord your God.’"},{"num":21,"verse":"But the children rebelled against Me; they did not walk in My statutes, nor were they careful to follow My ordinances which, if a person follows them, then he will live by them; they profaned My Sabbaths. So I resolved to pour out My wrath on them, to use up My anger against them in the wilderness."},{"num":22,"verse":"But I withdrew My hand and acted for the sake of My name, so that it would not be defiled in the sight of the nations in whose sight I had brought them out."},{"num":23,"verse":"Also I swore to them in the wilderness that I would scatter them among the nations and disperse them among the lands,"},{"num":24,"verse":"because they had not complied with My ordinances, but had rejected My statutes and had profaned My Sabbaths, and their eyes were on the idols of their fathers."},{"num":25,"verse":"I also gave them statutes that were not good, and ordinances by which they could not live;"},{"num":26,"verse":"and I pronounced them unclean because of their gifts, in that they made all their firstborn pass through the fire so that I might make them desolate, in order that they might know that I am the Lord.”’"},{"num":27,"verse":"“Therefore speak to the house of Israel, son of man, and say to them, ‘This is what the Lord God says: “Again, in this your fathers have blasphemed Me by being disloyal to Me."},{"num":28,"verse":"When I had brought them into the land which I swore to give to them, then they saw every high hill and every tree thick with branches, and there they offered their sacrifices and there they presented the provocation of their offering. There also they made their soothing aroma and there they poured out their drink offerings."},{"num":29,"verse":"Then I said to them, ‘What is the high place to which you go?’ So its name is called Bamah to this day.”’"},{"num":30,"verse":"Therefore, say to the house of Israel, ‘This is what the Lord God says: “Will you defile yourselves in the way of your fathers and adulterously pursue their detestable things?"},{"num":31,"verse":"And when you offer your gifts, when you make your sons pass through the fire, you are defiling yourselves with all your idols to this day. So shall I be inquired of by you, house of Israel? As I live,” declares the Lord God, “I certainly will not be inquired of by you."},{"num":32,"verse":"And whatever comes into your mind certainly will not come about, when you say: ‘We will be like the nations, like the families of the lands, serving wood and stone.’"},{"header":"God Will Restore Israel to Her Land"},{"num":33,"verse":"“As I live,” declares the Lord God, “with a mighty hand and with an outstretched arm and with wrath poured out, I assuredly shall be king over you."},{"num":34,"verse":"I will bring you out from the peoples and gather you from the lands where you are scattered, with a mighty hand and with an outstretched arm and with wrath poured out;"},{"num":35,"verse":"and I will bring you into the wilderness of the peoples, and there I will enter into judgment with you face to face."},{"num":36,"verse":"Just as I entered into judgment with your fathers in the wilderness of the land of Egypt, so I will enter into judgment with you,” declares the Lord God."},{"num":37,"verse":"“I will make you pass under the rod, and I will bring you into the bond of the covenant;"},{"num":38,"verse":"and I will purge from you the rebels and those who revolt against Me; I will bring them out of the land where they reside, but they will not enter the land of Israel. So you will know that I am the Lord."},{"num":39,"verse":"“As for you, house of Israel,” this is what the Lord God says: “Go, serve, everyone of you his idols; but later you will certainly listen to Me, and My holy name you will no longer defile with your gifts and your idols."},{"num":40,"verse":"For on My holy mountain, on the high mountain of Israel,” declares the Lord God, “there the entire house of Israel, all of them, will serve Me in the land; there I will accept them and there I will demand your contributions and the choicest of your gifts, with all your holy things."},{"num":41,"verse":"As a soothing aroma I will accept you when I bring you out from the peoples and gather you from the lands where you are scattered; and I will show Myself to be holy among you in the sight of the nations."},{"num":42,"verse":"And you will know that I am the Lord, when I bring you into the land of Israel, into the land which I swore to give to your forefathers."},{"num":43,"verse":"And there you will remember your ways and all your deeds by which you have defiled yourselves; and you will loathe yourselves in your own sight for all the evil things that you have done."},{"num":44,"verse":"Then you will know that I am the Lord, when I have dealt with you in behalf of My name, not according to your evil ways or according to your corrupt deeds, house of Israel,” declares the Lord God.’”"},{"num":45,"verse":"Now the word of the Lord came to me, saying,"},{"num":46,"verse":"“Son of man, set your face toward the south, and speak prophetically against the south and prophesy against the forest land of the Negev,"},{"num":47,"verse":"and say to the forest of the Negev, ‘Hear the word of the Lord: this is what the Lord God says: “Behold, I am going to kindle a fire in you, and it will consume every green tree in you, as well as every dry tree; the blazing flame will not go out and the entire surface from south to north will be scorched by it."},{"num":48,"verse":"And all mankind will see that I, the Lord, have kindled it; it will not go out.”’”"},{"num":49,"verse":"Then I said, “Oh, Lord God! They are saying of me, ‘Is he not just speaking in riddles?’”"}]