[{"num":3,"verse":"When the seventh month arrived, after the people of Isra’el had resettled in the towns, the people gathered with one accord in Yerushalayim. "},{"num":2,"verse":"Then Yeshua the son of Yotzadak with his fellow cohanim, and Z’rubavel the son of Sh’alti’el with his kinsmen, organized rebuilding the altar of the God of Isra’el; so that they could offer burnt offerings on it, as is written in the Torah of Moshe the man of God. "},{"num":3,"verse":"They set up the altar on its former bases. Despite feeling threatened by the peoples of the [surrounding] countries; they offered on it burnt offerings to Adonai, the morning and evening burnt offerings."},{"num":4,"verse":"They observed the festival of Sukkot as written, offering daily the number of burnt offerings prescribed for each day, "},{"num":5,"verse":"and afterwards the regular burnt offering, the offerings for Rosh-Hodesh and those for all the designated times set apart for Adonai, as well as those of everyone who volunteered a voluntary offering to Adonai. "},{"num":6,"verse":"From the first day of the seventh month, they began offering burnt offerings to Adonai, even though the foundation of Adonai’s temple had not yet been laid. "},{"num":7,"verse":"They also gave money for the stone-workers and carpenters, as well as food, drink and olive oil for the people of Tzidon and Tzor bringing cedar logs from the L’vanon to the sea and on to Yafo, in accordance with the authorization granted by Koresh king of Persia."},{"num":8,"verse":"In the second year after their arrival at the house of God in Yerushalayim, in the second month, Z’rubavel the son of Sh’alti’el, Yeshua the son of Yotzadak, the rest of their kinsmen the cohanim and L’vi’im, and all who had come out of exile to Yerushalayim began the project. They appointed the L’vi’im aged twenty and up to direct work in the house of Adonai. "},{"num":9,"verse":"Yeshua and his sons and brothers, Kadmi’el and his sons, and Y’hudah’s sons together directed the workers in the house of God; also the sons of Henadad, with their sons and their kinsmen the L’vi’im."},{"num":10,"verse":"When the builders laid the foundation of the temple of Adonai, the cohanim in their robes, with trumpets, and the L’vi’im the sons of Asaf, with cymbals, took their places to praise Adonai, as David king of Isra’el had instructed. "},{"num":11,"verse":"They sang antiphonally, praising and giving “thanks to Adonai, for he is good, for his grace continues forever” toward Isra’el. All the people raised a great shout of praise to Adonai, because the foundation of the house of Adonai had been laid. "},{"num":12,"verse":"But many of the cohanim, L’vi’im and heads of fathers’ clans, the old men who had seen the first house standing on its foundation, wept out loud when they saw this house; while others shouted out loud for joy — "},{"num":13,"verse":"so that the people couldn’t distinguish the noise of the joyful shouting from the noise of the people’s weeping; for the people were shouting so loudly that the noise could be heard at a great distance."}]