[{"header":"The People Rebuild the Altar"},{"num":3,"verse":"The Israelites had made their homes in their towns. In the seventh month all of them gathered together in Jerusalem. "},{"num":2,"verse":"Then Joshua began to build the altar for burnt offerings to honor the God of Israel. Joshua was the son of Jozadak. The other priests helped Joshua. So did Zerubbabel and his men. They built the altar according to what is written in the Law of Moses. Moses was a man of God. Zerubbabel was the son of Shealtiel. "},{"num":3,"verse":"The people who built the altar were afraid of the nations around them. But they built it anyway. They set it up where it had stood before. They sacrificed burnt offerings on it to the Lord. They offered the morning and evening sacrifices on it. "},{"num":4,"verse":"Then they celebrated the Feast of Booths. They did it according to what is written in the Law. They sacrificed the number of burnt offerings required for each day. "},{"num":5,"verse":"After they celebrated the Feast of Booths, they sacrificed the regular burnt offerings. They offered the New Moon sacrifices. They also offered the sacrifices for all the appointed sacred feasts of the Lord. And they sacrificed the offerings the people chose to give him. "},{"num":6,"verse":"On the first day of the seventh month they began to offer burnt offerings to the Lord. They did it even though the foundation of the Lord’s temple hadn’t been laid yet."},{"header":"The People Begin to Rebuild the Temple"},{"num":7,"verse":"The people gave money to those who worked with stone and those who worked with wood. They gave food and drink and olive oil to the people of Sidon and Tyre. Then those people brought cedar logs down from Lebanon to the Mediterranean Sea. They floated them down to Joppa. Cyrus, the king of Persia, authorized them to do it."},{"num":8,"verse":"It was the second month of the second year after they had arrived at the house of God in Jerusalem. Zerubbabel, the son of Shealtiel, began the work. Joshua, the son of Jozadak, helped him. So did everyone else. That included the priests and Levites. It also included the rest of those who had returned to Jerusalem. They had been prisoners in the land of Babylon. Levites who were 20 years old or more were appointed to be in charge of building the Lord’s house. "},{"num":9,"verse":"Those who joined together to direct the work included Joshua and his sons and brothers. They also included Kadmiel and his sons. And they included the sons of Henadad and their sons and brothers. All those men were Levites. Kadmiel and his sons were members of the family line of Hodaviah."},{"num":10,"verse":"The builders laid the foundation of the Lord’s temple. Then the priests came. They were wearing their special clothes. They brought their trumpets with them. The Levites who belonged to the family line of Asaph also came. They brought their cymbals with them. The priests and Levites took their places to praise the Lord. They did everything just as King David had required them to. "},{"num":11,"verse":"They sang to the Lord. They praised him. They gave thanks to him. They said,"},{"num":12,"verse":"But many of the older priests and Levites and family leaders wept out loud. They had seen the first temple. So when they saw the foundation of the second temple being laid, they wept. Others shouted with joy. "},{"num":13,"verse":"No one could tell the difference between the shouts of joy and the sounds of weeping. That’s because the people made so much noise. The sound was heard far away."}]