[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:1-7 It is an instance of the grace of God, that, having wrought divers miracles to punish sin, he would work one more to prevent it. Twelve rods or staves were to be brought in. It is probable that they were the staves which the princes used as ensigns of their authority; old dry staves, that had no sap in them. They were to expect that the rod of the tribe, or prince, whom God chose to the priesthood, should bud and blossom. Moses did not object that the matter was sufficiently settled already; he did not undertake to determine it; but left the case before the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The whole number of rods was twelve exclusive of Aaron's, as the Vulgate expressly states. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. the rod of Aaron was among their rods—either one of the twelve, or, as many suppose, a thirteenth in the midst (Heb 9:4). The rods were of dry sticks or wands, probably old, as transmitted from one head of the family to a succeeding.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Moses laid up the rods before the Lord in the tabernacle of witness. In that part of the tabernacle where the testimony or witness was, that is, the law, which was in the ark, over which was the mercy seat, with the cherubim between which Jehovah dwelt, and this was the most holy place; and the rods being laid here, might be said to be laid before the Lord, who, by making a difference in one of those rods from the rest, would decide the controversy about the priesthood, which was the end of their being laid before him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Moses laid up the rods before the LORD in the tabernacle of witness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Before the Lord,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in front of the ark. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the tabernacle of witness.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"In the tent of the testimony.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בּאֹהֶל הָעֵדֻת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Numbers 17:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Moses carried out this command. And when he went into the tabernacle the following morning, behold Aaron's rod of the house of Levi had sprouted, and put forth shoots, and had borne blossoms and matured almonds. And Moses brought all the rods out of the sanctuary, and gave every man his own; the rest, as we may gather from the context, being all unchanged, so that the whole nation could satisfy itself that God had chosen Aaron. Thus was the word fulfilled which Moses had spoken at the commencement of the rebellion of the company of Korah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that in a way which could not fail to accredit him before the whole congregation as sent of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So far as the occurrence itself is concerned, there can hardly be any need to remark, that the natural interpretation which has lately been attempted by Ewald, viz., that Moses had laid several almond rods in the holy place, which had just been freshly cut off, that he might see the next day which of them would flower the best during the night, is directly at variance with the words of the text, and also with the fact, that a rod even freshly cut off, when laid in a dry place, would not bear ripe fruit in a single night. The miracle which God wrought here as the Creator of nature, was at the same time a significant symbol of the nature and meaning of the priesthood. The choice of the rods had also a bearing upon the object in question. A man's rod was the sign of his position as ruler in the house and congregation; with a prince the rod becomes a sceptre, the insignia of rule (Genesis 49:10). As a severed branch, the rod could not put forth shoots and blossom in a natural way. But God could impart new vital powers even to the dry rod. And so Aaron had naturally no pre-eminence above the heads of the other tribes. But the priesthood was founded not upon natural qualifications and gifts, but upon the power of the Spirit, which God communicates according to the choice of His wisdom, and which He had imparted to Aaron through his consecration with holy anointing oil. It was this which the Lord intended to show to the people, by causing Aaron's rod to put forth branches, blossom, and fruit, through a miracle of His omnipotence; whereas the rods of the other heads of the tribes remained as barren as before. In this way, therefore, it was not without deep significance that Aaron's rod not only put forth shoots, by which the divine election might be recognised, but bore even blossom and ripe fruit. This showed that Aaron was not only qualified for his calling, but administered his office in the full power of the Spirit, and bore the fruit expected of him. The almond rod was especially adapted to exhibit this, as an almond-tree flowers and bears fruit the earliest of all the trees, and has received its name of שׁקד, \"awake,\" from this very fact (cf. Jeremiah 1:11).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So far as the occurrence itself is concerned, there can hardly be any need to remark, that the natural interpretation which has lately been attempted by Ewald, viz., that Moses had laid several almond rods in the holy place, which had just been freshly cut off, that he might see the next day which of them would flower the best during the night, is directly at variance with the words of the text, and also with the fact, that a rod even freshly cut off, when laid in a dry place, would not bear ripe fruit in a single night. The miracle which God wrought here as the Creator of nature, was at the same time a significant symbol of the nature and meaning of the priesthood. The choice of the rods had also a bearing upon the object in question. A man's rod was the sign of his position as ruler in the house and congregation; with a prince the rod becomes a sceptre, the insignia of rule (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As a severed branch, the rod could not put forth shoots and blossom in a natural way. But God could impart new vital powers even to the dry rod. And so Aaron had naturally no pre-eminence above the heads of the other tribes. But the priesthood was founded not upon natural qualifications and gifts, but upon the power of the Spirit, which God communicates according to the choice of His wisdom, and which He had imparted to Aaron through his consecration with holy anointing oil. It was this which the Lord intended to show to the people, by causing Aaron's rod to put forth branches, blossom, and fruit, through a miracle of His omnipotence; whereas the rods of the other heads of the tribes remained as barren as before. In this way, therefore, it was not without deep significance that Aaron's rod not only put forth shoots, by which the divine election might be recognised, but bore even blossom and ripe fruit. This showed that Aaron was not only qualified for his calling, but administered his office in the full power of the Spirit, and bore the fruit expected of him. The almond rod was especially adapted to exhibit this, as an almond-tree flowers and bears fruit the earliest of all the trees, and has received its name of שׁקד, \"awake,\" from this very fact (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "God then commanded (Numbers 17:10, Numbers 17:11) that Aaron's rod should be taken back into the sanctuary, and preserved before the testimony, \"for a sign for the rebellious, that thou puttest an end to their murmuring, and they die not.\" The preservation of the rod before the ark of the covenant, in the immediate presence of the Lord, was a pledge to Aaron of the continuance of his election, and the permanent duration of his priesthood; though we have no need to assume, that through a perpetual miracle the staff continued green and blossoming. In this way the staff became a sign to the rebellious, which could not fail to stop their murmuring.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God then commanded (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 17:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") that Aaron's rod should be taken back into the sanctuary, and preserved before the testimony, \"for a sign for the rebellious, that thou puttest an end to their murmuring, and they die not.\" The preservation of the rod before the ark of the covenant, in the immediate presence of the Lord, was a pledge to Aaron of the continuance of his election, and the permanent duration of his priesthood; though we have no need to assume, that through a perpetual miracle the staff continued green and blossoming. In this way the staff became a sign to the rebellious, which could not fail to stop their murmuring.",
            "children": []
          }
        ]
      }
    ]
  }
]