[{"header":"Paul Goes through Macedonia and Greece"},{"num":20,"verse":"When the riot was over, Paul sent for the followers and encouraged them. He then told them good-by and left for Macedonia. "},{"num":2,"verse":"As he traveled from place to place, he encouraged the followers with many messages. Finally, he went to Greece "},{"num":3,"verse":"and stayed there for three months."},{"num":4,"verse":"With him were Sopater, son of Pyrrhus from Berea, and Aristarchus and Secundus from Thessalonica. Gaius from Derbe was also with him, and so were Timothy and the two Asians, Tychicus and Trophimus. "},{"num":5,"verse":"They went on ahead to Troas and waited for us there. "},{"num":6,"verse":"After the Festival of Thin Bread, we sailed from Philippi. Five days later we met them in Troas and stayed there for a week."},{"header":"Paul’s Last Visit to Troas"},{"num":7,"verse":"On the first day of the week we met to break bread together. Paul spoke to the people until midnight because he was leaving the next morning. "},{"num":8,"verse":"In the upstairs room where we were meeting, there were a lot of lamps. "},{"num":9,"verse":"A young man by the name of Eutychus was sitting on a window sill. While Paul was speaking, the young man got very sleepy. Finally, he went to sleep and fell three floors all the way down to the ground. When they picked him up, he was dead."},{"num":10,"verse":"Paul went down and bent over Eutychus. He took him in his arms and said, “Don’t worry! He’s alive.” "},{"num":11,"verse":"After Paul had gone back upstairs, he broke bread, and ate with us. He then spoke until dawn and left. "},{"num":12,"verse":"Then the followers took the young man home alive and were very happy."},{"header":"The Voyage from Troas to Miletus"},{"num":13,"verse":"Paul decided to travel by land to Assos. The rest of us went on ahead by ship, and we were to take him aboard there. "},{"num":14,"verse":"When he met us in Assos, he came aboard, and we sailed on to Mitylene. "},{"num":15,"verse":"The next day we came to a place near Chios, and the following day we reached Samos. The day after that we sailed to Miletus. "},{"num":16,"verse":"Paul had decided to sail on past Ephesus, because he did not want to spend too much time in Asia. He was in a hurry and wanted to be in Jerusalem in time for Pentecost."},{"header":"Paul Says Good-By to the Church Leaders of Ephesus"},{"num":17,"verse":"From Miletus, Paul sent a message for the church leaders at Ephesus to come and meet with him. "},{"num":18,"verse":"When they got there, he said:"},{"num":36,"verse":"After Paul had finished speaking, he knelt down with all of them and prayed. "},{"num":37,"verse":"Everyone cried and hugged and kissed him. "},{"num":38,"verse":"They were especially sad because Paul had told them, “You will never see me again.”"}]