[{"num":20,"verse":"Now after the disturbance abated, Paul called the disciples to him, and embraced them, and left for Macedonia."},{"num":2,"verse":"And when he had gone through those parts, and had encouraged them with many words, he came into Greece."},{"num":3,"verse":"And after staying there for three months, he was about to sail for Syria. But he decided to return through Macedonia because the Jews had set a trap for him."},{"num":4,"verse":"And Sopater of Berea accompanied him into Asia, as well as Aristarchus and Secundus of Thessalonica, and Gaius of Derbe, and Timothy, and the Asians, Tychicus and Trophimus."},{"num":5,"verse":"These went ahead and awaited us at Troas."},{"num":6,"verse":"And after the days of Unleavened Bread, we sailed from Philippi. And five days later we joined them at Troas, where we stayed for seven days."},{"num":7,"verse":"And the first day of the week (the disciples having come together to break bread), Paul, ready to leave the next day, preached to them, and continued preaching until midnight."},{"num":8,"verse":"And there were many lights in the upper room where they were gathered together."},{"num":9,"verse":"And a certain young man named Eutychus had fallen into a dead sleep while sitting in a window. And as Paul preached at length, he was overcome with sleep and fell down from the third story and was taken up dead."},{"num":10,"verse":"But Paul went down, and laid himself on him, and embraced him, saying, “Do not trouble yourselves. For his life is in him.”"},{"num":11,"verse":"Then, after having come up again and broken bread and eaten, he talked a long while (till daybreak) and left."},{"num":12,"verse":"And they brought the boy (alive). And they were not a little comforted."},{"num":13,"verse":"But we went ahead to the ship and sailed to Assos, so that we might receive Paul there. For so had he arranged and would himself go on foot."},{"num":14,"verse":"Now when he had met us in Assos, and we had received him, we went to Mitylene."},{"num":15,"verse":"And we sailed from there the next day and came opposite Chios. And the next day we arrived at Samos and stayed in Trogyllium. The next day we came to Miletus."},{"num":16,"verse":"For Paul had determined to sail past Ephesus, because he did not want to spend time in Asia. For he hurried to be at Jerusalem, if possible, on the day of Pentecost."},{"num":17,"verse":"Therefore he sent word to Ephesus from Miletus and called the elders of the church."},{"num":18,"verse":"When they had come, he said to them, “You know how I have lived with you at all times, from the first day that I came into Asia;"},{"num":19,"verse":"“serving the Lord with all modesty, and with many tears and temptations (which came to me by the plotting of the Jews)."},{"num":20,"verse":"“And how I kept back nothing that was profitable, but have showed you, and taught you openly, and throughout every house;"},{"num":21,"verse":"“witnessing the repentance toward God and faith toward our Lord Jesus Christ to both the Jews and the Greeks."},{"num":22,"verse":"“And now behold I go, bound in the Spirit, to Jerusalem. And I do not know what things shall come to me there,"},{"num":23,"verse":"“except that the Holy Ghost witnesses in every city, saying that bonds and afflictions await me."},{"num":24,"verse":"“But these things do not move me. Nor is my life dear to me. So that I may fulfill my course, and the ministry which I have received from the Lord Jesus (to testify the Gospel of the grace of God) with joy."},{"num":25,"verse":"“And now behold, I know that hereafter all of you among whom I have gone preaching the Kingdom of God shall no longer see my face."},{"num":26,"verse":"“Therefore I testify to you this day that I am innocent of the blood of all."},{"num":27,"verse":"“For I have kept nothing back but have declared to you the whole counsel of God."},{"num":28,"verse":"“Therefore, attend to yourselves, and to all the flock, among which the Holy Ghost has made you overseers, to shepherd the church of God, which He has purchased with His own blood."},{"num":29,"verse":"“For I know this: that after my departing, grievous wolves shall enter in among you, not sparing the flock."},{"num":30,"verse":"“Moreover, men shall arise from your own selves, speaking perverse things to draw disciples away with them."},{"num":31,"verse":"“Therefore watch. And remember that for three years I did not cease to warn everyone, both night and day, with tears."},{"num":32,"verse":"“And now brothers, I commend you to God, and to the word of His grace, which is able to build further, and to give you an inheritance among all those who are sanctified."},{"num":33,"verse":"“I have coveted no one’s silver or gold or apparel."},{"num":34,"verse":"“Yes, you know that these hands have ministered to my needs, and to those who were with me."},{"num":35,"verse":"“I have shown you all things; how that in so doing you ought to support the weak, and to remember the words of the Lord Jesus, how He said, ‘It is more blessed to give than to receive.’”"},{"num":36,"verse":"And when he had spoken this, he kneeled down and prayed with them all."},{"num":37,"verse":"Then they all wept abundantly, and fell on Paul’s neck, and kissed him,"},{"num":38,"verse":"being most tormented by the words he spoke of seeing his face no more. And they accompanied him to the ship."}]