[{"num":20,"verse":"As soon as the uproar ended, Paul gathered the disciples together, encouraged them once more, said farewell, and left on foot. He decided to pass through Macedonia, "},{"num":2,"verse":"encouraging believers wherever he found them, and came to Greece. "},{"num":3,"verse":"He spent three months there, and then he planned to set sail once again for Syria. But he learned that a group of Jewish opponents was plotting to kill him, so he decided to travel through Macedonia."},{"num":4,"verse":"There was a large group of us traveling with him at this time, and we decided it was best, in light of the plot, to split up and then reunite in the city of Troas. This group included Paul, a Berean named Sopater (son of Pyrrhus), two Thessalonians named Aristarchus and Secundus, a Derbean named Gaius, two Asians named Tychicus and Trophimus, and Timothy. "},{"num":6,"verse":"Some of us waited until the Days of Unleavened Bread were over; then we went to Philippi where we boarded a ship for Troas. The other group left immediately on foot, passing through Macedonia. When my group landed in Troas five days later, Paul’s group had already arrived. We stayed in Troas another week."},{"num":7,"verse":"The Sunday night before our Monday departure, we gathered to celebrate the breaking of bread."},{"num":9,"verse":"A young fellow named Eutychus, seeking some fresh air, moves to an open window. Paul keeps on talking. Eutychus perches in the open window itself. Paul keeps talking. Eutychus drifts off to sleep. Paul continues talking until Eutychus, now overcome by deep sleep, drops out of the window and falls three stories to the ground, where he is found dead. "},{"num":10,"verse":"Paul joins us downstairs, bends over, and takes Eutychus in his arms."},{"num":11,"verse":"Then Paul goes back upstairs, celebrates the breaking of bread, and—just as you might guess—keeps on conversing until first light. Then he leaves. "},{"num":12,"verse":"(I should add that Eutychus had been taken home long before, his friends more than a little relieved that the boy was alive!)"},{"num":13,"verse":"Again Paul wanted us to split up. He wanted to go by land by himself while we went by ship to Assos. "},{"num":14,"verse":"There he came on board with us, and we sailed on to Mitylene. "},{"num":15,"verse":"From there we sailed near Chios, passing by it the next day, docking briefly at Samos the day after that, then arriving at Miletus the following day. "},{"num":16,"verse":"This route kept us safely out of Ephesus and didn’t require Paul to spend any time at all in Asia, since he wanted to arrive in Jerusalem quickly—before Pentecost, he hoped."},{"num":17,"verse":"In Miletus he sent word to the church in Ephesus, asking the elders to come down to meet with him. "},{"num":18,"verse":"When they arrived, he talked with them."},{"num":36,"verse":"Once again, imagine this scene:"},{"num":37,"verse":"There’s the sound of weeping, and then more weeping, and then more still. One by one, we embrace Paul and kiss him, "},{"num":38,"verse":"our sadness multiplied because of his words about this being our last good-bye. We walk with him to the ship, and he sets sail."}]