[{"num":1,"verse":"2 Ahaziah by a fall falleth sick, and consulteth with Baal-Zebub. 3 He is reproved by Elijah. 10 The captains over fifty were sent to Elijah, whereof two were burnt with fire from heaven by his prayer. 17 Ahaziah dieth, and Jehoram his brother succeedeth him."},{"num":1,"verse":"Then Moab rebelled against Israel after the death of Ahab:"},{"num":2,"verse":"And Ahaziah fell through the lattice window in his upper chamber which was in Samaria: so he was sick: then he sent messengers, to whom he said, Go, and inquire of Baal-Zebub the god of Ekron, if I shall recover of this my disease."},{"num":3,"verse":"Then the Angel of the Lord said to Elijah the Tishbite, Arise, and go up to meet the messengers of the king of Samaria, and say unto them, Is it not because there is no God in Israel, that ye go to inquire of Baal-Zebub the god of Ekron?"},{"num":4,"verse":"Wherefore thus saith the Lord, Thou shalt not come down from the bed on which thou art gone up, but shalt die the death. So Elijah departed."},{"num":5,"verse":"And the messengers returned unto him, to whom he said, Why are ye now returned?"},{"num":6,"verse":"And they answered him, There came a man and met us, and said unto us, Go, and return unto the king which sent you, and say unto him, Thus saith the Lord, Is it not because there is no God in Israel, that thou sendest to inquire of Baal-Zebub the God of Ekron? Therefore thou shalt not come down from the bed, on which thou art gone up, but shalt die the death."},{"num":7,"verse":"And he said unto them, What manner of man was he which came and met you, and told you these words?"},{"num":8,"verse":"And they said unto him, He was an hairy man, and girded with a girdle of leather about his loins. Then said he, It is Elijah the Tishbite."},{"num":9,"verse":"Therefore the King sent unto him a captain over fifty with his fifty men, who went up unto him: for behold, he sat on the top of a mountain, and he said unto him, O man of God, the king hath commanded that thou come down."},{"num":10,"verse":"But Elijah answered, and said to the captain over the fifty, If that I be a man of God, let fire come down from the heaven, and devour thee and thy fifty. So fire came down from the heaven and devoured him and his fifty."},{"num":11,"verse":"Again also he sent unto him another captain over fifty with his fifty. Who spake, and said unto him, O man of God, thus the King commandeth, Come down quickly."},{"num":12,"verse":"But Elijah answered, and said unto them, If I be a man of God, let fire come down from the heaven and devour thee and thy fifty. So fire came down from the heaven, and devoured him and his fifty."},{"num":13,"verse":"¶ Yet again he sent the third captain over fifty with his fifty. And the third captain over fifty went up, and came, and fell on his knees before Elijah, and besought him, and said unto him, O man of God, I pray thee, let my life and the life of these thy fifty servants be precious in thy sight."},{"num":14,"verse":"Behold, there came fire down from the heaven, and devoured the two former captains over fifty with their fifties: therefore let my life now be precious in thy sight."},{"num":15,"verse":"And the Angel of the Lord said unto Elijah, Go down with him, be not afraid of his presence. So he arose, and went down with him unto the king."},{"num":16,"verse":"And he said unto him, Thus saith the Lord, Because thou hast sent messengers to inquire of Baal-Zebub the god of Ekron, (was it not because there was no God in Israel to inquire of his word?) therefore thou shalt not come down off the bed, on which thou art gone up, but shalt die the death."},{"num":17,"verse":"So he died according to the word of the Lord which Elijah had spoken. And Jehoram began to reign in his stead in the second year of Jehoram the son of Jehoshaphat king of Judah, because he had no son."},{"num":18,"verse":"Concerning the rest of the acts of Ahaziah, that he did, are they not written in the book of the Chronicles of the kings of Israel?"}]