[{"header":"The Lord Speaks to Ahaziah"},{"num":1,"verse":"Now Moab turned against Israel after the death of Ahab. "},{"num":2,"verse":"Ahaziah fell through the window of his second-floor room in Samaria, and lay sick. So he sent men with news, saying to them, “Go and ask Baalzebub the god of Ekron if I will get well again from this sickness.” "},{"num":3,"verse":"But the angel of the Lord said to Elijah the Tishbite, “Get up and go meet the men sent from the king of Samaria. Say to them, ‘Are you going to ask Baal-zebub the god of Ekron because there is no God in Israel?’ "},{"num":4,"verse":"This is what the Lord says. ‘You will not leave the bed on which you lie. You will die for sure.’” Then Elijah left."},{"num":5,"verse":"When the men returned to Ahaziah, he said to them, “Why have you returned?” "},{"num":6,"verse":"They said, “A man came up to meet us. He said to us, ‘Go and return to the king who sent you. Tell him, “This is what the Lord says. ‘Are you asking Baal-zebub the god of Ekron because there is no God in Israel? So you will not leave the bed on which you lie. You will die for sure.’”’” "},{"num":7,"verse":"Ahaziah said to them, “What kind of man was he who came to meet you and said this to you?” "},{"num":8,"verse":"They answered, “He was a man with much hair. He wore a piece of leather around his body.” Ahaziah said, “It is Elijah the Tishbite.”"},{"num":9,"verse":"Then the king sent a captain with fifty of his men to take Elijah. The captain went up to him and saw Elijah sitting on the top of the hill. He said to him, “O man of God, the king says, ‘Come down.’” "},{"num":10,"verse":"Elijah said to the captain of fifty men, “If I am a man of God, let fire come down from heaven and destroy you and your fifty men.” Then fire came down from heaven and destroyed him and his fifty men. "},{"num":11,"verse":"So Ahaziah sent to him another captain with fifty men. The captain said to Elijah, “O man of God, the king says, ‘Be quick to come down.’” "},{"num":12,"verse":"Elijah answered them, “If I am a man of God, let fire come down from heaven and destroy you and your fifty men.” Then the fire of God came down from heaven and destroyed him and his fifty men. "},{"num":13,"verse":"So Ahaziah sent to him a third captain with fifty men. When the third captain of fifty men went up, he came and put his face to the ground in front of Elijah. He begged him and said, “O man of God, I beg you. Let my life and the lives of these fifty servants of yours be of great worth in your eyes. "},{"num":14,"verse":"Fire came down from heaven and destroyed the first two captains with their armies of fifty. But now let my life be of great worth in your eyes.” "},{"num":15,"verse":"The angel of the Lord said to Elijah, “Go down with him. Do not be afraid of him.” So Elijah got up and went with him to the king. "},{"num":16,"verse":"Then Elijah said to Ahaziah, “This is what the Lord says. ‘You have sent men to ask of Baal-zebub the god of Ekron. Is it because there is no God in Israel to ask of His Word? So now you will not leave the bed on which you lie. You will die for sure.’”"},{"num":17,"verse":"So Ahaziah died, just as the word of the Lord had said through Elijah. Because Ahaziah had no son, Jehoram his brother became king in his place, in the second year of Jehoram the son of Jehoshaphat, king of Judah. "},{"num":18,"verse":"Now the rest of the acts of Ahaziah, are they not written in the Book of the Chronicles of the Kings of Israel?"}]