[{"header":"Samuel Anoints Saul"},{"num":9,"verse":"Now there was a man of Benjamin, whose name was Kish, the son of Abiel, the son of Zeror, the son of Bekorath, the son of Aphiah, a Benjamite, a mighty man of power. "},{"num":2,"verse":"He had a son, whose name was Saul, a choice and handsome man, and there was not a better looking man among the children of Israel. From his shoulders and up he was taller than any of the people."},{"num":3,"verse":"Now the donkeys of Kish, the father of Saul, were lost. And Kish said to his son Saul, “Take now one of the servants with you, and arise, go find the donkeys.” "},{"num":4,"verse":"He passed through the mountains of Ephraim, and passed through the land of Shalisha, but they did not find them. And they passed through the land of Shaalim, but they were not there. Then he passed through the land of the Benjamites, but they did not find them."},{"num":5,"verse":"When they came to the land of Zuph, Saul said to his servant that was with him, “Come, and let us return lest my father stop caring about the donkeys and worry about us.”"},{"num":6,"verse":"He said to him, “Look, there is in this city a man of God, and he is highly respected. All that he speaks surely comes about. Now let us go there. Perhaps he can show us the way that we should go.”"},{"num":7,"verse":"Then Saul said to his servant, “But listen, if we go, what will we bring the man? For the bread is gone from our satchels, and there is no present to bring to the man of God. What do we have?”"},{"num":8,"verse":"And the servant answered Saul again, and said, “Look, I have here in my hand a quarter of a shekel of silver. I will give it to the man of God, to tell us our way.” "},{"num":9,"verse":"(Formerly in Israel, when a man went to inquire of God, thus he said, “Come, and let us go to the seer.” For he that is now called a prophet was formerly called a seer.)"},{"num":10,"verse":"Then Saul said to his servant, “Well said. Come, let us go.” So they went to the city where the man of God was."},{"num":11,"verse":"As they went up the hill to the city, they found young women going out to draw water and said to them, “Is the seer here?”"},{"num":12,"verse":"And they answered them and said, “He is. See, he is ahead of you. Hurry now, for today he came to the city, because there is a sacrifice for the people in the high place today. "},{"num":13,"verse":"As soon as you come into the city, you will find him before he goes up to the high place to eat. For the people will not eat until he comes, because he must bless the sacrifice. Afterwards those invited will eat. Now therefore, go up, for about this time of the day you will find him there.”"},{"num":14,"verse":"So they went up into the city. And when they entered, Samuel was coming toward them to go up to the high place."},{"num":15,"verse":"Now the Lord had revealed in the ear of Samuel one day before Saul came, saying, "},{"num":16,"verse":"“Tomorrow about this time I will send you a man out of the land of Benjamin. And you will anoint him to be leader over My people Israel, that he may save My people out of the hand of the Philistines. For I have looked upon My people, because their cry has come unto Me.”"},{"num":17,"verse":"When Samuel saw Saul, the Lord said to him, “Here is the man of whom I spoke to you! This one will rule over My people.”"},{"num":18,"verse":"Then Saul drew near to Samuel in the gate, and said, “Tell me, please, where is the seer’s house?”"},{"num":19,"verse":"Samuel answered Saul, and said, “I am the seer. Go up before me to the high place, for you will eat with me today. And tomorrow I will let you go, and will tell you then all that is in your heart. "},{"num":20,"verse":"As for your donkeys that were lost three days ago, do not your worry about them for they have been found. And on whom is all the desire of Israel? Is it not on you and on all your father’s house?”"},{"num":21,"verse":"And Saul answered and said, “Am not I a Benjamite, of the smallest of the tribes of Israel? And my family the least of all the families of the tribe of Benjamin? Why do you speak to me this way?”"},{"num":22,"verse":"And Samuel took Saul and his servant, and brought them into the hall, and gave them a place at the head of those invited, which were about thirty men. "},{"num":23,"verse":"Samuel said to the cook, “Bring the portion which I gave you, of which I said to you, ‘Set it aside.’ ”"},{"num":24,"verse":"Then the cook took up the thigh and what was on it and set it before Saul. And Samuel said, “Here is what was set aside. Set it before you and eat, because it has been kept for you until this time, since I said I have invited the people.” So Saul ate with Samuel that day."},{"num":25,"verse":"When they had come down from the high place into the city, Samuel spoke with Saul up on the roof. "},{"num":26,"verse":"They arose early, and it was at the rising of the dawn that Samuel called to Saul on the roof, saying, “Get up, that I may send you away.” So Saul arose, and both he and Samuel went to the street. "},{"num":27,"verse":"As they were going down to the outskirts of the city, Samuel said to Saul, “Tell the servant to pass on before us.” So he passed on. “But you stand still and I will proclaim to you the word of God.”"}]