[{"num":7,"verse":"1 Elisha prophesieth plenty of vittles, and other things to Samaria. 6 The Syrians run away and have no man following them. 17 The prince that would not believe the word of Elisha, is trodden to death."},{"num":1,"verse":"Then Elisha said, Hear ye the word of the Lord: thus saith the Lord, Tomorrow this time a measure of fine flour shall be sold for a shekel, and two measures of barley for a shekel in the gate of Samaria."},{"num":2,"verse":"Then a prince, on whose hand the king leaned, answered the man of God, and said, Though the Lord would make windows in the heaven, could this thing come to pass? And he said, Behold, thou shalt see it with thine eyes, but thou shalt not eat thereof."},{"num":3,"verse":"Now there were four leprous men at the entering in of the gate: and they said one to another, Why sit we here until we die?"},{"num":4,"verse":"If we say, We will enter into the city, the famine is in the city, and we shall die there: and if we sit here, we die also. Now therefore come, and let us fall into the camp of the Aramites: if they save our lives, we shall live: and if they kill us, we are but dead."},{"num":5,"verse":"So they rose up in the twilight, to go to the camp of the Aramites: and when they were come to the utmost part of the camp of the Aramites, lo, there was no man there."},{"num":6,"verse":"For the Lord had caused the camp of the Aramites to hear a noise of chariots and a noise of horses, and a noise of a great army, so that they said one to another, Behold, the King of Israel hath hired against us the kings of the Hittites, and the kings of the Egyptians to come upon us."},{"num":7,"verse":"Wherefore they arose, and fled in the twilight, and left their tents and their horses, and their asses, even the camp as it was, and fled for their lives."},{"num":8,"verse":"And when these lepers came to the utmost part of the camp, they entered into one tent, and did eat and drink, and carried thence silver and gold, and raiment, and went and hid it: after, they returned, and entered into another tent, and carried thence also, and went and hid it."},{"num":9,"verse":"Then said one to another, We do not well: this day is a day of good tidings, and we hold our peace. If we tarry till daylight, some mischief will come upon us. Now therefore, come, let us go, and tell the king’s household."},{"num":10,"verse":"So they came and called unto the porters of the city, and told them, saying, We came to the camp of the Aramites, and lo, there was no man there, neither voice of man, but horses tied and asses tied: and the tents are as they were."},{"num":11,"verse":"And the porters cried and declared to the king’s house within."},{"num":12,"verse":"Then the King arose in the night, and said unto his servants, I will show you now, what the Aramites have done unto us. They know that we are famished, therefore they are gone out of the camp to hide themselves in the field, saying, When they come out of the city, we shall catch them alive, and get into the city."},{"num":13,"verse":"And one of his servants answered, and said, Let me take now five of the horses that remain, and are left in the city, (behold, they are even as all the multitude of Israel that are left therein: behold, I say, they are as the multitude of the Israelites that are consumed) and we will send to see."},{"num":14,"verse":"So they took two chariots of horses, and the king sent after the host of the Aramites, saying, Go and see."},{"num":15,"verse":"And they went after them unto Jordan, and lo, all the way was full of clothes and vessels which the Aramites had cast from them in their haste: and the messengers returned, and told the king."},{"num":16,"verse":"Then the people went out and spoiled the camp of the Aramites: so a measure of fine flour was at a shekel, and two measures of barley at a shekel according to the word of the Lord."},{"num":17,"verse":"And the king gave the prince (on whose hand he leaned) the charge of the gate, and the people trode upon him in the gate, and he died, as the man of God had said, which spake it, when the king came down to him."},{"num":18,"verse":"And it came to pass, as the man of God had spoken to the King, saying, Two measures of barley at a shekel, and a measure of fine flour shall be at a shekel, tomorrow about this time in the gate of Samaria."},{"num":19,"verse":"But the prince had answered the man of God, and said, Though the Lord would make windows in the heaven, could it come so to pass? And he said, Behold, thou shalt see it with thine eyes, but thou shalt not eat thereof."},{"num":20,"verse":"And so it came unto him: for the people trode upon him in the gate, and he died."}]