[{"num":7,"verse":"Then Elisha said, “Listen to the word of the Lord. The Lord says, ‘Tomorrow about this time, a basket of fine flour will be sold for one piece of silver in the gate of Samaria. And two baskets of barley will be sold for a piece of silver.’” "},{"num":2,"verse":"The captain on whose arm the king rested said to the man of God, “See, if the Lord should make windows in heaven, could this thing be?” Elisha said, “You will see it with your own eyes. But you will not eat of it.”"},{"header":"The Syrians Leave"},{"num":3,"verse":"Now there were four men at the city gate with a bad skin disease. They said to one another, “Why do we sit here until we die? "},{"num":4,"verse":"If we go into the city, there is no food there and we will die. And if we sit here, we will die also. So now come, let us go over to the tents of the Syrians. If they do not kill us, we will live. And if they kill us, we will die there.” "},{"num":5,"verse":"So they got up in the evening to go to the Syrians. When they came to the tents of the Syrians, there was no one there. "},{"num":6,"verse":"For the Lord had made the Syrian army hear a sound of war-wagons and horses and an army of many soldiers. So they said to one another, “The king of Israel has paid the kings of the Hittites and the kings of the Egyptians to fight against us.” "},{"num":7,"verse":"And they ran away in the evening. They left their tents and their horses and donkeys. They left everything just as it was, and ran for their lives. "},{"num":8,"verse":"Then the men with a bad skin disease came to the tents. They went into one tent and ate and drank. They carried away silver and gold and clothing, and hid them. Then they returned and went into another tent and carried things away from it, and hid them."},{"num":9,"verse":"They said to one another, “We are not doing right. This is a day of good news, but we are keeping quiet. We will be punished if we wait until morning. So now let us go and tell those of the king’s house.” "},{"num":10,"verse":"And they came and called the men who watched the city gate. They said to them, “We went to the tents of the Syrians. But there was no one to be seen or heard there. Only the horses and donkeys were tied there. The tents were left just as they were.” "},{"num":11,"verse":"So the men at the gate called out, and the news was heard in the king’s house. "},{"num":12,"verse":"The king got up in the night and said to his servants, “I will tell you what the Syrians have done to us. They know that we are hungry. So they have left the tents to hide themselves in the field. They are saying, ‘When they come out of the city, we will take them alive and get into the city.’” "},{"num":13,"verse":"One of his servants said, “Let some men take five of the horses that are left. Those who are left in the city are not doing better than all those who have died. So let us send men out to see.” "},{"num":14,"verse":"So they took two war-wagons with horses. And the king sent them after the Syrian army, saying, “Go and see.” "},{"num":15,"verse":"They went after them to the Jordan. All the way was covered with clothes and objects which the Syrians had thrown away in their hurry. Then the men returned and told the king."},{"num":16,"verse":"So the people went out and took what the Syrians had left. Then a basket of fine flour was sold for a piece of silver. And two baskets of barley sold for a piece of silver, just as the word of the Lord had said. "},{"num":17,"verse":"Now the king chose the captain on whose arm he rested to watch the gate. But the people stepped on him at the gate. He died just as the man of God had said when the king came down to him. "},{"num":18,"verse":"It happened just as the man of God had told the king, saying, “About this time tomorrow at the gate of Samaria, two baskets of barley will sell for a piece of silver. And a basket of fine flour will sell for a piece of silver.” "},{"num":19,"verse":"Then the captain had said to the man of God, “See, if the Lord should make windows in heaven, could such a thing be?” And Elisha had said, “You will see it with your own eyes. But you will not eat of it.” "},{"num":20,"verse":"So it happened to him. The people stepped on him at the gate, and he died."}]