[{"num":1,"verse":"After Joshua died, the nation of Israel went to the Lord to receive his instructions."},{"num":2,"verse":"God’s answer came, “Judah. And I will give them a great victory.”"},{"num":3,"verse":"The leaders of the tribe of Judah, however, asked help from the tribe of Simeon. “Join us in clearing out the people living in the territory allotted to us,” they said, “and then we will help you conquer yours.” So the army of Simeon went with the army of Judah. "},{"num":4,"verse":"And the Lord helped them defeat the Canaanites and Perizzites, so that ten thousand of the enemy were slain at Bezek. King Adoni-bezek escaped, but the Israeli army soon captured him and cut off his thumbs and big toes."},{"num":7,"verse":"“I have treated seventy kings in this same manner and have fed them the scraps under my table!” King Adoni-bezek said. “Now God has paid me back.” He was taken to Jerusalem and died there."},{"num":8,"verse":"(Judah had conquered Jerusalem and massacred its people, setting the city on fire.) "},{"num":9,"verse":"Afterward the army of Judah fought the Canaanites in the hill country and in the Negeb, as well as on the coastal plains. "},{"num":10,"verse":"Then Judah marched against the Canaanites in Hebron (formerly called Kiriath-arba), destroying the cities of Sheshai, Ahiman, and Talmai. "},{"num":11,"verse":"Later they attacked the city of Debir (formerly called Kiriath-sepher)."},{"num":12,"verse":"“Who will lead the attack against Debir?” Caleb challenged them. “Whoever conquers it shall have my daughter Achsah as his wife!”"},{"num":13,"verse":"Caleb’s nephew, Othniel, son of his younger brother Kenaz, volunteered to lead the attack; and he conquered the city and won Achsah as his bride. "},{"num":14,"verse":"As they were leaving for their new home, she urged him to ask her father for an additional* piece of land. She dismounted from her donkey to speak to Caleb about it."},{"num":15,"verse":"And she replied, “You have been kind enough to give me land in the Negeb, but please give us springs of water too.”"},{"num":16,"verse":"When the tribe of Judah moved into its new land in the Negeb Desert south of Arad, the descendants of Moses’ father-in-law—members of the Kenite tribe—accompanied them. They left their homes in Jericho, “The City of Palm Trees,” and the two tribes lived together after that. "},{"num":17,"verse":"Afterwards the army of Judah joined Simeon’s, and they fought the Canaanites at the city of Zephath and massacred all its people. So now the city is named Hormah (meaning, “massacred”). "},{"num":18,"verse":"The army of Judah also conquered the cities of Gaza, Ashkelon, and Ekron, with their surrounding villages. "},{"num":19,"verse":"The Lord helped the tribe of Judah exterminate the people of the hill country, though they failed in their attempt to conquer the people of the valley, who had iron chariots."},{"num":20,"verse":"The city of Hebron was given to Caleb as the Lord had promised; so Caleb drove out the inhabitants of the city; they were descendants of the three sons of Anak."},{"num":21,"verse":"The tribe of Benjamin failed to exterminate the Jebusites living in their part of the city of Jerusalem, so they still live there today, mingled with the Israelis."},{"num":22,"verse":"As for the tribe of Joseph, they attacked the city of Bethel, formerly known as Luz, and the Lord was with them. First they sent scouts, "},{"num":24,"verse":"who captured a man coming out of the city. They offered to spare his life and that of his family if he would show them the entrance passage through the wall. "},{"num":25,"verse":"So he showed them how to get in, and they massacred the entire population except for this man and his family. "},{"num":26,"verse":"Later the man moved to Syria and founded a city there, naming it Luz, too, as it is still known today."},{"num":27,"verse":"The tribe of Manasseh failed to drive out the people living in Beth-shean, Taanach, Dor, Ibleam, Megiddo, with their surrounding towns; so the Canaanites stayed there. "},{"num":28,"verse":"In later years when the Israelis were stronger, they put the Canaanites to work as slaves, but never did force them to leave the country. "},{"num":29,"verse":"This was also true of the Canaanites living in Gezer; they still live among the tribe of Ephraim."},{"num":30,"verse":"And the tribe of Zebulun did not massacre the people of Kitron or Nahalol, but made them their slaves; "},{"num":31,"verse":"nor did the tribe of Asher drive out the residents of Acco, Sidon, Ahlab, Achzib, Helbah, Aphik, or Rehob; so the Israelis still live among the Canaanites, who were the original people of that land. "},{"num":33,"verse":"And the tribe of Naphtali did not drive out the people of Beth-shemesh or of Beth-anath, so these people continue to live among them as servants."},{"num":34,"verse":"As for the tribe of Dan, the Amorites forced them into the hill country and wouldn’t let them come down into the valley; "},{"num":35,"verse":"but when the Amorites later spread into Mount Heres, Aijalon, and Shaalbim, the tribe of Joseph conquered them and made them their slaves. "},{"num":36,"verse":"The boundary of the Amorites begins at the ascent of Scorpion Pass, runs to a spot called The Rock, and continues upward from there."}]