[{"header":"Tribes Possess the Land"},{"num":1,"verse":"Now it came to pass after the death of Joshua that Bnei-Yisrael inquired of Adonai saying, “Who will be the first to go up for us against the Canaanites to attack them?” "},{"num":2,"verse":"Adonai said, “Judah will go up. Behold, I have given the land into his hand.”"},{"num":3,"verse":"Judah then said to his brother Simeon, “Come up with me to my allotted territory, so that we may fight against the Canaanites; and I also will go with you into your allotted territory.” So Simeon went with him. "},{"num":4,"verse":"When Judah went up, Adonai delivered the Canaanites and the Perizzites into their hands; they struck down 10,000 of them at Bezek. "},{"num":5,"verse":"They found Adoni-bezek in Bezek, engaged him in battle, and defeated the Canaanites and the Perizzites."},{"num":6,"verse":"Though Adoni-bezek fled, they pursued him, caught him, and cut off his thumbs and his big toes. "},{"num":7,"verse":"So Adoni-bezek said, “70 kings, having their thumbs and big toes cut off, used to pick up scraps under my table. As I have done, so God has repaid me.” They brought him to Jerusalem and he died there."},{"num":8,"verse":"Then the children of Judah attacked Jerusalem, captured it, struck it with the edge of the sword and set the city on fire. "},{"num":9,"verse":"Afterward the children of Judah went down to fight against the Canaanites that dwelt in the hill country, in the Negev and in the lowland."},{"num":10,"verse":"Judah then marched against the Canaanites who dwelt in Hebron (the former name of Hebron was Kiriath-arba), and they defeated Sheshai, Ahiman, and Talmai. "},{"num":11,"verse":"From there Judah marched against the inhabitants of Debir (the former name of Debir was Kiriath-sepher). "},{"num":12,"verse":"Caleb said, “Whoever attacks Kiriath-sepher and captures it, to him will I give my daughter Achsah for a wife.” "},{"num":13,"verse":"So Othniel son of Kenaz, Caleb’s younger kinsman, captured it. So Caleb gave him his daughter Achsah as a wife. "},{"num":14,"verse":"Now it came about when she came to him, she had persuaded Othniel to ask her father for a field. When she got off her donkey, Caleb asked her, “What do you need?”"},{"num":15,"verse":"Give me a blessing,” she said. “For you have given me land in the Negev; you should also give me springs of water.” So Caleb gave her the Upper Springs and the Lower Springs."},{"num":16,"verse":"The children of the Kenite, Moses’ father-in-law, went up with the children of Judah from the City of Palms to the wilderness of Judah, which is in the Negev of Arad. They went and settled with the people."},{"num":17,"verse":"Then Judah went with his brother Simeon, and they defeated the Canaanites that inhabited Zephath. They utterly destroyed it, and thus the name of the city was called Hormah. "},{"num":18,"verse":"Also Judah captured Gaza with its territory, Ashkelon with its territory and Ekron with its territory. "},{"num":19,"verse":"Adonai was with Judah, and he possessed the hill country, but he could not drive out the inhabitants of the valley because they had iron chariots. "},{"num":20,"verse":"Then they gave Hebron to Caleb, as Moses had promised, so he drove out from there the three sons of Anak."},{"num":21,"verse":"But the children of Benjamin did not drive out the Jebusites who inhabited Jerusalem, so the Jebusites continued to live with the children of Benjamin in Jerusalem to this day."},{"num":22,"verse":"Also the house of Joseph marched against Bethel, and Adonai was with them. "},{"num":23,"verse":"The house of Joseph sent men to spy out Bethel (the former name of the city was Luz). "},{"num":24,"verse":"Now the scouts saw a man coming out from the city and they said to him, “Please show us the entrance into the city and we will deal kindly with you.” "},{"num":25,"verse":"So he showed them the entrance into the city, and they struck the city with the edge of the sword, but they let the man go free with all his family. "},{"num":26,"verse":"So the man went into the land of the Hittites, built a city, and named it Luz, which is its name to this day."},{"num":27,"verse":"Manasseh, however, did not drive out the inhabitants of Beth-shean and its villages, or Taanach and its villages, or the inhabitants of Dor and its villages, or the inhabitants of Ibleam and its villages, or the inhabitants of Megiddo and its villages. So the Canaanites resolved to dwell in that land. "},{"num":28,"verse":"When Israel became strong, they put the Canaanites to forced labor, but they did not drive them out."},{"num":29,"verse":"Nor did Ephraim drive out the Canaanites who were living in Gezer, so the Canaanites settled in Gezer among them. "},{"num":30,"verse":"Nor did Zebulun drive out the inhabitants of Kitron, or the inhabitants of Nahalol, so the Canaanites settled among them, but became subject to forced labor."},{"num":31,"verse":"Nor did Asher drive out the inhabitants of Acco or the inhabitants of Zidon, Achlab, Achzib, Helbah, Aphik or Rehob; "},{"num":32,"verse":"so the Asherites lived among the Canaanites who were dwelling in the land, because they did not drive them out."},{"num":33,"verse":"Nor did Naphtali drive out the inhabitants of Beth-shemesh, or the inhabitants of Beth-anath, but lived among the Canaanites dwelling in the land, though the inhabitants of Beth-shemesh and Beth-anath became forced labor for them."},{"num":34,"verse":"But the Amorites forced the children of Dan into the hill country, for they would not let them come down to the valley. "},{"num":35,"verse":"Also the Amorites persisted in dwelling in Mount Heres, in Aijalon and in Shaalbim, but when the hand of the house of Joseph prevailed, they became forced labor for them. "},{"num":36,"verse":"So the territory of the Amorites ran from the Ascent of Akrabbim from the Rock and upward."}]