[{"num":40,"verse":"And the Lord added to (this), and spake to Job (and spoke more to Job), and said,"},{"num":2,"verse":"Whether he, that striveth with God, shall have rest so lightly? Soothly he, that reproveth God, oweth for to answer to him. (Shall he, who argueth with God, now so easily have rest? Yea he, who rebuketh God, ought to answer him.)"},{"num":3,"verse":"And Job answered to the Lord, and said,"},{"num":4,"verse":"What may I answer, which have spoken lightly, that is, undiscreetly and follily? (What can I answer to thee, I who have spoken so freely, that is, so indiscreetly, and so foolishly?) I shall put mine hand upon my mouth."},{"num":5,"verse":"I spake one thing, which thing I would, that I had not said (I spoke one thing, which I wish, that I had not said); and I spake another thing, to which I shall no more add."},{"num":6,"verse":"Forsooth the Lord answered to Job from the whirlwind, and said, (Then the Lord answered Job out of the whirlwind, and said,)"},{"num":7,"verse":"Gird thou as a man thy loins, and I shall ask thee, and show thou to me. (Gird thou up thy loins like a man, and I shall ask thee, and thou shalt answer me.)"},{"num":8,"verse":"Whether thou shalt make void my doom, and shalt thou condemn me, that thou be made just? (Shalt thou make void my justice? that is, shalt thou say that I am unjust? and shalt thou condemn me, so that thou can be right?)"},{"num":9,"verse":"And if thou hast an arm, or power, as God hath, and if thou thunderest with like voice,"},{"num":10,"verse":"take thou fairness about thee, and be thou raised on high, and be thou glorious, and be thou clothed in fair clothes. (take thou beauty about thee, and be thou raised up on high, and be thou glorious, and be thou clothed in beautiful clothes.)"},{"num":11,"verse":"And destroy thou proud men in thy fierce vengeance (And destroy thou the proud with thy fierce vengeance), and behold thou, and make low each boaster."},{"num":12,"verse":"Behold thou all proud men, and shame thou them; and all-break thou (the) wicked men in their place."},{"num":13,"verse":"Hide thou them in dust together, and drench down their faces into a ditch. (Hide thou them in the dust together, and drown them down in a ditch.)"},{"num":14,"verse":"And then I shall acknowledge, that thy right hand may save thee. (And then I shall acknowledge, that thy right hand can save thee.)"},{"num":15,"verse":"Lo! behemoth, whom I made with thee, shall as an ox eat hay. (Lo! the behemoth, which I made with thee, eateth hay like an ox.)"},{"num":16,"verse":"His strength is in his loins, and his might is in the navel of his womb."},{"num":17,"verse":"He constraineth his tail as a cedar (His tail standeth up like a cedar); the sinews of his stones of engendering be folded together."},{"num":18,"verse":"His bones be as pipes of brass; the gristle of him is as plates of iron. (His bones be like brass pipes; his gristle is like iron plates.)"},{"num":19,"verse":"He is the beginning of the ways of God; he, that made him, shall set his sword to him. (He is the chief of God’s works; but he, who made him, shall set his sword against him.)"},{"num":20,"verse":"Hills bear herbs to this behemoth (The hills grow grass for this behemoth); all the beasts of the field play there."},{"num":21,"verse":"He sleepeth under shadow, in the private of a reed, in moist places. (He sleepeth under a shadow, hidden among the reeds of the marshes.)"},{"num":22,"verse":"Shadows cover his shadow; the sallows of the river compass him (about). (Shady trees cover him with their shadows; the willows of the river surround him.)"},{"num":23,"verse":"He shall swallow up the flood, and he shall not wonder (He shall swallow up the river, and he shall not be afraid); he hath trust, that (the) Jordan shall flow into his mouth."},{"num":24,"verse":"He shall take them by his eyes, as by an hook; and by sharp shafts he shall pierce his nostrils. (Who shall put out his eyes, and shall catch him? who shall pierce his nostrils with sharp shafts?)"}]