[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6, 7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Surely the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—In this, and the preceding verse, the future tense should be replaced by a present. Render ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doeth nothing,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is a trumpet sounded",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . . ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are not afraid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . . ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is there evil;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the prophet intends to express a continually-recurring fact. The word translated “evil” is commonly, but not universally, used for moral evil. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 44:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) “Evil which is sin the Lord hath not done, evil which is punishment for evil the Lord bringeth.” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Augustine.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Compare, as illustrations of the truth of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the revelation of the Divine purpose to Noah with reference to the Deluge, to Abraham with respect to Sodom, to Joseph about the famine in Egypt, and to Moses concerning Pharaoh. The prophets of the Lord have given full warning of the judgment of God upon all sin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-8 The distinguishing favours of God to us, if they do not restrain from sin, shall not exempt from punishment. They could not expect communion with God, unless they first sought peace with him. Where there is not friendship, there can be no fellowship. God and man cannot walk together, except they are agreed. Unless we seek his glory, we cannot walk with him. Let us not presume on outward privileges, without special, sanctifying grace. The threatenings of the word and providence of God against the sin of man are certain, and certainly show that the judgments of God are at hand. Nor will God remove the affliction he has sent, till it has done its work. The evil of sin is from ourselves, it is our own doing; but the evil of trouble is from God, and is his doing, whoever are the instruments. This should engage us patiently to bear public troubles, and to study to answer God's meaning in them. The whole of the passage shows that natural evil, or troubles, and not moral evil, or sin, is here meant. The warning given to a careless world will increase its condemnation another day. Oh the amazing stupidity of an unbelieving world, that will not be wrought upon by the terrors of the Lord, and that despise his mercies!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Is there evil in the city and the Lord hath not done it? - Evil is of two sorts, evil of sin, and evil of punishment. There is no other; for evil of nature, or evil of fortune, are evils, by God's Providence, punishing the evil of sin. Augustine, c. Adim. 26: \"Evil, which is sin, the Lord hath not done; evil, which is punishment for sin, the Lord bringeth.\" The Providence of God governing and controlling all things, man doth ill which he wills, so as to suffer ill which he wills not. Only, evil which is by God's Providence the punishment of sin is in this life remedial and through final impenitence alone becomes purely judicial.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rib.: \"Refer not, the prophet would say, the ills which ye suffer and will suffer, to any other causes, as people are accustomed to do. God, in His displeasure, sends them upon you. And that ye may know this the more certainly, whatever He shall send He will first reveal to the prophets and by them ye shall be forewarned. See then that ye despise not my words, or the words of the other prophets. People ascribe their sufferings to fortune, accident, any cause, rather than the displeasure of God. The intemperate will think anything the cause of their illness rather than their intemperance. People love the things of the world and cannot and will not be persuaded that so many evils are brought on them by the things which they love. So then God explains through the prophets the punishment which He purposes to bring on people.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Rib.: \"Refer not, the prophet would say, the ills which ye suffer and will suffer, to any other causes, as people are accustomed to do. God, in His displeasure, sends them upon you. And that ye may know this the more certainly, whatever He shall send He will first reveal to the prophets and by them ye shall be forewarned. See then that ye despise not my words, or the words of the other prophets. People ascribe their sufferings to fortune, accident, any cause, rather than the displeasure of God. The intemperate will think anything the cause of their illness rather than their intemperance. People love the things of the world and cannot and will not be persuaded that so many evils are brought on them by the things which they love. So then God explains through the prophets the punishment which He purposes to bring on people.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. When the sound of alarm is trumpeted by the watchman in the city, the people are sure to run to and fro in alarm (Hebrew, literally). Yet Israel is not alarmed, though God threatens judgments.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall there be evil in a city, and the Lord hath not done it?—This is the explanation of the preceding similes: God is the Author of all the calamities which come upon you, and which are foretold by His prophets. The evil of sin is from ourselves; the evil of trouble is from God, whoever be the instruments.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall a trumpet be blown, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when an alarm is sounded, by which notice is given of danger approaching, of an enemy invading the land, in the city, any city, but particularly in a frontier city, in which were watchmen on the walls and towers to give notice of an enemy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 52:8 Ezekiel 3:17 33:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 33:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and the people not be afraid; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " affected with the danger, to weigh how great it is, how near it is; whether it be best to prepare to resist it, or to flee from it? Such-like affections doth the alarm of war work in the minds of men ordinarily, and there is good reason for it: but though God hath sounded the alarm, yet brutish, stupid, and sinful Israel fear not, neither consult what is the best course to prevent the danger. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall there be evil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of affliction and sorrow, such as plague, famine, &c., in a city, or any where else, and the Lord, the eternal, holy, and righteous Governor of all in heaven and on earth, hath not done it, either immediately by his own hand, or mediately by the hands of those he employs? the evil of punishment he will execute and bring upon Israel; he will by the hands of the Assyrians in due time execute it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall a trumpet be blown in the city,.... Meaning not any trumpet blown, as the silver trumpet for the gathering of the people to worship, or the jubilee trumpet, which proclaimed liberty to them, or any other, expressive of joy and gladness; but the sound of the trumpet, the alarm of war, or what is blown by the watchmen on the walls, descrying an enemy, or some danger, near: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the people not be afraid? they must, they usually are, lest their lives, and their children's, should be taken away, and their substance become a prey to the enemy: or, \"and the people not run together\" (f); into some one place for shelter, or to consult together how to provide for their safety, and secure themselves from danger. So when the prophets of the Lord, by his order, lift up their voice like a trumpet, to show his people their transgressions; or when, as watchmen, they blow the trumpet, to give notice of approaching danger; can they hear such denunciations of his wrath for their sins, and not tremble at them, or not take some ways and methods to escape it? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall there be evil in a city, and the Lord hath not done it? which is not to be understood of the evil of sin, of which God is not the author, it being contrary to his nature and will; and though he permits it to be done by others, yet he never does it himself, nor so much as tempts men to it, James 1:13; unless the words should be rendered, as they may be, \"shall there be evil in a city, and shall not the Lord do\" or \"work\" (g)? shall sin be committed in a city, all sorts of sin, in the most bold and extravagant manner, and will not the Lord do something to show his resentment of it? is it not time for him to arise and work for his name's sake? will he not visit for these things, and be avenged on such a city, and the inhabitants of it? but this may be interpreted of the evil of affliction or judgment; which, wherever it comes, is by the order and appointment of God, and is inflicted by him; thus evil, as well as good, comes out of the mouth and hand of the most High; and he creates the evil of adversity, as well as makes peace and prosperity; see Job 2:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "shall there be evil in a city, and the Lord hath not done it? which is not to be understood of the evil of sin, of which God is not the author, it being contrary to his nature and will; and though he permits it to be done by others, yet he never does it himself, nor so much as tempts men to it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; unless the words should be rendered, as they may be, \"shall there be evil in a city, and shall not the Lord do\" or \"work\" (g)? shall sin be committed in a city, all sorts of sin, in the most bold and extravagant manner, and will not the Lord do something to show his resentment of it? is it not time for him to arise and work for his name's sake? will he not visit for these things, and be avenged on such a city, and the inhabitants of it? but this may be interpreted of the evil of affliction or judgment; which, wherever it comes, is by the order and appointment of God, and is inflicted by him; thus evil, as well as good, comes out of the mouth and hand of the most High; and he creates the evil of adversity, as well as makes peace and prosperity; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f)  \"non accurrit\", Drusius, Tarnovius. (g)   \"and shall not the Lord do somewhat?\" margin of our Bibles. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f)  \"non accurrit\", Drusius, Tarnovius. (g)   \"and shall not the Lord do somewhat?\" margin of our Bibles. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{f} Shall a trumpet be blown in the city, and the people not be afraid? shall there {g} be evil in a city, and the LORD hath not done it?",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Shall a trumpet be blown in the city, and the people not be afraid? shall there ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " be evil in a city, and the LORD hath not done ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Will the Prophet's threaten God's judgments and the people not be afraid?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Does any adversity come without God's appointment? Isa 45:7",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Is a horn",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " Is ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "a",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " horn",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blown in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "city, and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the people not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in alarm?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Of course they are: for they know it to be the signal of approaching danger. The horn was blown as a summons to repel an invader, &c. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "happen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "befall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a city, and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath not done",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it?] Will evil—i.e. calamity, misfortune, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—happen in a city without having its sufficient cause in Jehovah’s purpose? The Hebrews often took no account of what we term ‘secondary causes’; and a calamity, such as famine or pestilence, which might be the natural consequence of some physical antecedent, is thus referred here directly to Jehovah’s operation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "6–8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Similarly the horn is a signal of danger; calamity is a sign that Jehovah has willed it; and the appearance of a prophet is an indication that Jehovah has sent him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The prophet must needs speak: shall not his denunciation arouse alarm among the people, as the trumpet suddenly heard in a city excites the terror of the inhabitants (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:2-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? Shall there be evil in a city, and the Lord hath not done it? The \"evil\" is affliction, calamity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "malum poenae.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As states have no future, all temporal calamities in their case may rightly be regarded as the punishment of sin. Thus the ruin impending, on Israel was sent by the Lord, whose agent was the enemy now approaching. All phenomena are ascribed in the Bible to Divine operation, no second causes being allowed to interfere with this appropriation (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The verb \"do\" is often used absolutely, the context defining the result (see note on Haggai 2:4). Amos 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But this truth met with contradiction in the nation itself. The proud self-secure sinners would not hear such prophesying as this (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Amos therefore endeavours, before making any further announcement of the judgment of God, to establish his right and duty to prophesy, by a chain-like series of similes drawn from life. V. 3. \"Do two walk together without having agreed? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Does the lion roar in the forest, and he has no prey? does the young lion utter his cry out of his den, without having taken anything? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Does the bird fall into the trap on the ground, when there is no snare for him? does the trap rise up from the earth without making a capture? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or is the trumpet blown in the city, and the people are not alarmed? or does misfortune happen in the city, and Jehovah has not done it? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the Lord Jehovah does nothing at all, without having revealed His secret to His servants the prophets. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The lion has roared; who does not fear? the Lord Jehovah hath spoken; who must not prophesy?\" The contents of these verses are not to be reduced to the general thought, that a prophet could no more speak without a divine impulse than any other effect could take place without a cause. There was certainly no need for a long series of examples, such as we have in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:3-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to substantiate or illustrate the thought, which a reflecting hearer would hardly have disputed, that there was a connection between cause and effect. The examples are evidently selected with the view of showing that the utterances of the prophet originate with God. This is obvious enough in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The first clause, \"Do two men walk together, without having agreed as to their meeting?\" (nō‛Ad, to betake one's self to a place, to meet together at an appointed place or an appointed time; compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not merely to agree together), contains something more than the trivial truth, that two persons do not take a walk together without a previous arrangement. The two who walk together are Jehovah and the prophet (Cyril); not Jehovah and the nation, to which the judgment is predicted (Cocceius, Marck, and others). Amos went as prophet to Samaria or Bethel, because the Lord had sent him thither to preach judgment to the sinful kingdom. But God would not threaten judgment if He had not a nation ripe for judgment before Him. The lion which roars when it has the prey before it is Jehovah (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). טרף אין לו is not to be interpreted according to the second clause, as signifying \"without having got possession of its prey\" (Hitzig), for the lion is accustomed to roar when it has the prey before it and there is no possibility of its escape, and before it actually seizes it (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The most terrible feature in the roaring of a lion is that with this clarigatio, or, if you prefer it, with this classicum, it declares war. And after the roar there immediately follows both slaughter and laceration. For, as a rule, it only roars with that sharp roar when it has the prey in sight, upon which it immediately springs (Bochart, Hieroz. ii. 25ff., ed. Ros.).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "On the contrary, the perfect lâkjad in the second clause is to be interpreted according to the first clause, not as relating to the roar of satisfaction with which the lion devours the prey in its den (Baur), but as a perfect used to describe a thing which was as certain as if it had already occurred. A lion has made a capture not merely when it has actually seized the prey and torn it in pieces, but when the prey has approached so near that it cannot possibly escape. Kephı̄r is the young lion which already goes in pursuit of prey, and is to be distinguished from the young of the lion, gūr (catulus leonis), which cannot yet go in search of prey (cf. Ezekiel 19:2-3). The two similes have the same meaning. The second strengthens the first by the assertion that God not only has before Him the nation that is ripe for judgment, but that He has it in His power.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "On the contrary, the perfect lâkjad in the second clause is to be interpreted according to the first clause, not as relating to the roar of satisfaction with which the lion devours the prey in its den (Baur), but as a perfect used to describe a thing which was as certain as if it had already occurred. A lion has made a capture not merely when it has actually seized the prey and torn it in pieces, but when the prey has approached so near that it cannot possibly escape. Kephı̄r is the young lion which already goes in pursuit of prey, and is to be distinguished from the young of the lion, gūr (catulus leonis), which cannot yet go in search of prey (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The two similes have the same meaning. The second strengthens the first by the assertion that God not only has before Him the nation that is ripe for judgment, but that He has it in His power.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The similes in Amos 3:5 do not affirm the same as those in Amos 3:4, but contain the new thought, that Israel has deserved the destruction which threatens it. Pach, a snare, and mōqēsh, a trap, are frequently used synonymously; but here they are distinguished, pach denoting a bird-net, and mōqēsh a springe, a snare which holds the bird fast. The earlier translators have taken mōqēsh in the sense of yōqēsh, and understand it as referring to the bird-catcher; and Baur proposes to alter the text accordingly. But there is no necessity for this; and it is evidently unsuitable, since it is not requisite for a bird-catcher to be at hand, in order that the bird should be taken in a snare. The suffix lâh refers to tsippōr, and the thought is this: in order to catch a bird in the net, a springe (gin) must be laid for it. So far as the fact itself is concerned, mōqēsh is \"evidently that which is necessarily followed by falling into the net; and in this instance it is sinfulness\" (Hitzig); so that the meaning of the figure would be this: \"Can destruction possibly overtake you, unless your sin draws you into it?\" (cf. Jeremiah 2:35). In the second clause pach is the subject, and ועלה is used for the ascent or springing up of the net. Hitzig has given the meaning of the words correctly: \"As the net does not spring up without catching the bird, that has sent it up by flying upon it, can ye imagine that when the destruction passes by, ye will not be seized by it, but will escape without injury?\" (cf. Isaiah 28:15). Jehovah, however, causes the evil to be foretold. As the trumpet, when blown in the city, frightens the people out of their self-security, so will the voice of the prophet, who proclaims the coming evil, excite a salutary alarm in the nation (cf. Ezekiel 33:1-5). For the calamity which is bursting upon the city comes from Jehovah, is sent by Him as a punishment. This thought is explained in Amos 3:7, Amos 3:8, and with this explanation the whole series of figurative sentences is made perfectly clear. The approaching evil, which comes from the Lord, is predicted by the prophet, because Jehovah does not carry out His purpose without having (כּי אם, for when, except when he has, as in Genesis 32:27) first of all revealed it to the prophets, that they may warn the people to repent and to reform. Sōd receives a more precise definition from the first clause of the verse, or a limitation to the purposes which God is about to fulfil upon His people. And since (this is the connection of Amos 3:8) the judgment with which the Lord is drawing near fills every one with fear, and Jehovah has spoken, i.e., has made known His counsel to the prophets, they cannot but prophesy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The similes in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " do not affirm the same as those in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but contain the new thought, that Israel has deserved the destruction which threatens it. Pach, a snare, and mōqēsh, a trap, are frequently used synonymously; but here they are distinguished, pach denoting a bird-net, and mōqēsh a springe, a snare which holds the bird fast. The earlier translators have taken mōqēsh in the sense of yōqēsh, and understand it as referring to the bird-catcher; and Baur proposes to alter the text accordingly. But there is no necessity for this; and it is evidently unsuitable, since it is not requisite for a bird-catcher to be at hand, in order that the bird should be taken in a snare. The suffix lâh refers to tsippōr, and the thought is this: in order to catch a bird in the net, a springe (gin) must be laid for it. So far as the fact itself is concerned, mōqēsh is \"evidently that which is necessarily followed by falling into the net; and in this instance it is sinfulness\" (Hitzig); so that the meaning of the figure would be this: \"Can destruction possibly overtake you, unless your sin draws you into it?\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In the second clause pach is the subject, and ועלה is used for the ascent or springing up of the net. Hitzig has given the meaning of the words correctly: \"As the net does not spring up without catching the bird, that has sent it up by flying upon it, can ye imagine that when the destruction passes by, ye will not be seized by it, but will escape without injury?\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Jehovah, however, causes the evil to be foretold. As the trumpet, when blown in the city, frightens the people out of their self-security, so will the voice of the prophet, who proclaims the coming evil, excite a salutary alarm in the nation (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 33:1-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For the calamity which is bursting upon the city comes from Jehovah, is sent by Him as a punishment. This thought is explained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and with this explanation the whole series of figurative sentences is made perfectly clear. The approaching evil, which comes from the Lord, is predicted by the prophet, because Jehovah does not carry out His purpose without having (כּי אם, for when, except when he has, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") first of all revealed it to the prophets, that they may warn the people to repent and to reform. Sōd receives a more precise definition from the first clause of the verse, or a limitation to the purposes which God is about to fulfil upon His people. And since (this is the connection of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the judgment with which the Lord is drawing near fills every one with fear, and Jehovah has spoken, i.e., has made known His counsel to the prophets, they cannot but prophesy. ",
            "children": []
          }
        ]
      }
    ]
  }
]