[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Many shall be purified.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See Notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words imply that all shall be fulfilled, the time of persecution shall certainly arise, the righteous will be purified, while the wicked will become apostates. The wise (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and they only, will understand the true meaning and profit of tribulation as it is set forth in this prophecy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 12:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Many shall be purified, and made white, and tried — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same words are found, but in different order. They are words of general and ordinary use, expressive of the purification intended to be produced in the minds of men by afflictions. If we would ascertain their import, the first word is borrowed from wheat, which is cleansed from the chaff; the second from cloth, which is whitened by the fuller; and the third from metal, tried and separated from its dross by goldsmiths. I would refer the whole, says Wintle, to the righteous, who, it is here foretold, should be cleansed by various tribulations and trials; but the like discipline would have no effect on the wicked: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their wickedness would blind their minds, so that they would not understand, nor attend to these predictions, which the wise, that is, the considerate and divinely enlightened, should understand; should be fully instructed in themselves, and so should be able to teach them to others: see Wintle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:5-13 One of the angels asking how long it should be to the end of these wonders, a solemn reply is made, that it would be for a time, times, and a half, the period mentioned ch. 7:25, and in the Revelation. It signifies 1260 prophetic days or years, beginning from the time when the power of the holy people should be scattered. The imposture of Mohammed, and the papal usurpation, began about the same time; and these were a twofold attack upon the church of God. But all will end well at last. All opposing rule, principality, and power, shall be put down, and holiness and love will triumph, and be in honour, to eternity. The end, this end, shall come. What an amazing prophecy is this, of so many varied events, and extending through so many successive ages, even to the general resurrection! Daniel must comfort himself with the pleasing prospect of his own happiness in death, in judgment, and to eternity. It is good for us all to think much of going away from this world. That must be our way; but it is our comfort that we shall not go till God calls us to another world, and till he has done with us in this world; till he says, Go thou thy way, thou hast done thy work, therefore now, go thy way, and leave it to others to take thy place. It was a comfort to Daniel, and is a comfort to all the saints, that whatever their lot is in the days of their lives, they shall have a happy lot in the end of the days. And it ought to be the great care and concern of every one of us to secure this. Then we may well be content with our present lot, and welcome the will of God. Believers are happy at all times; they rest in God by faith now, and a rest is reserved for them in heaven at last.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Many shall be purified - In future times. That is, as the connection would seem to require, there will be a system introduced by which many will become purified, and made holy. Daniel might hope and expect that under the arrangements which God would make, many of the human race would be cleansed from sin. To what he would apply this we cannot determine, but it is a great truth of immense importance in regard to the human family, that, before the \"end,\" or the consummation, \"many\" will be made holy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And made white - White is the emblem of innocence or purity, and hence, the term is so often applied to the righteous. \"They have washed their robes, and made them white in the blood of the Lamb,\" \"they shall walk before me in white,\" etc. Hence, the angels are represented as appearing in white raiment. The meaning here is, that many on the earth would be made holy before the end would come. The mind of Daniel was thus directed onward to one of the most glorious truths pertaining to future times - that multitudes of the human race would be redeemed, and would be prepared for a holy heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And tried - Tried as in a furnace; that is, they will be subjected to persecutions, and to various other forms of suffering, that will test the strength of their faith, and the nature of their religion. This language, also, is of a general character, and would in itself apply to the times of Antiochus, but it is also fitted to describe what would occur in other ages. Perhaps the meaning is, that it would be a prominent thing in the future, in introducing the triumphs of religion; and in preparing the people of God for heaven, that they would be subjected to various forms of trial. There have been facts enough of this kind in the history of the church to justify this description, and to show that it would be a marked feature in spreading religion on the earth, that its friends would be persecuted. \"But the wicked shall do wickedly.\" They will continue to do wickedly. Notwithstanding all the judgments that will come upon men; notwithstanding all that will be done to purify the people of God, and, notwithstanding the fact that \"many\" will be of a different character - will be \"purified and made white, and tried,\" yet it will be a truth still, that there will be wicked men upon the earth, and that they will act out their nature.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This remark seems to have been thrown in by the angel to prevent the impression which Daniel might possibly get from what was said, not only that the true religion would generally prevail, but that wickedness would wholly cease in the earth. Such a time, perhaps, we are not authorized to look for; while we may hope and believe that there will be a period when the worship of God will pervade the world, and will supersede all other forms of worship, yet we have no reason to expect that every individual of the human family at any one time will be converted, and that none of the remains of the apostasy will be seen on the earth. There will be wicked men still, and they will act out their nature, despite all that is done to save them, and despite the fact that religion will have the ascendency in the hearts and lives of the great mass of mankind. For an illustration of this, see the notes at Revelation 9:20-21; notes at Revelation 20:7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This remark seems to have been thrown in by the angel to prevent the impression which Daniel might possibly get from what was said, not only that the true religion would generally prevail, but that wickedness would wholly cease in the earth. Such a time, perhaps, we are not authorized to look for; while we may hope and believe that there will be a period when the worship of God will pervade the world, and will supersede all other forms of worship, yet we have no reason to expect that every individual of the human family at any one time will be converted, and that none of the remains of the apostasy will be seen on the earth. There will be wicked men still, and they will act out their nature, despite all that is done to save them, and despite the fact that religion will have the ascendency in the hearts and lives of the great mass of mankind. For an illustration of this, see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:20-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And none of the wicked shall understand - This, also, is a general declaration. It means, that none of the wicked would understand the import of these prophecies, or the true nature of religion. Their depravity of heart would prevent it; their purpose to lead a wicked life would so cloud their understandings, and pervert their moral judgments, that they would have no correct appreciation of the government of God, and the nature of the Divine plans and dispensations. Compare the notes at 1 Corinthians 2:14. The fact here asserted has been always true, and always will be, that sin prevents a clear perception of Divine truth, and that wicked men have no appropriate views of the plans and purposes of God. To comprehend religion aright a man needs a pure heart; and no one under the influence of depraved feelings, and corrupt propensities and appetites, can expect to have a just appreciation of what is good. Doubtless it will be found to be true in the days of millennial glory, when the true religion shall spread over the world, and when the earth shall be filled with light, that there will be wicked men who will have no correct understanding of the nature of religion, and whose minds will be blind to all the evidences of the truth of revelation which shall be diffused around them. No man, unless he is converted, has any proper conception of the beauty of religion.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And none of the wicked shall understand - This, also, is a general declaration. It means, that none of the wicked would understand the import of these prophecies, or the true nature of religion. Their depravity of heart would prevent it; their purpose to lead a wicked life would so cloud their understandings, and pervert their moral judgments, that they would have no correct appreciation of the government of God, and the nature of the Divine plans and dispensations. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The fact here asserted has been always true, and always will be, that sin prevents a clear perception of Divine truth, and that wicked men have no appropriate views of the plans and purposes of God. To comprehend religion aright a man needs a pure heart; and no one under the influence of depraved feelings, and corrupt propensities and appetites, can expect to have a just appreciation of what is good. Doubtless it will be found to be true in the days of millennial glory, when the true religion shall spread over the world, and when the earth shall be filled with light, that there will be wicked men who will have no correct understanding of the nature of religion, and whose minds will be blind to all the evidences of the truth of revelation which shall be diffused around them. No man, unless he is converted, has any proper conception of the beauty of religion.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But the wise shall understand - They who serve God and love him, and who, therefore, come under the denomination of the truly wise. See the notes at Daniel 12:3. The meaning is, that religion - the love of God and a pure heart - will qualify them to perceive the import of Divine truth; to appreciate what is revealed, and to obtain a just view of passing events - or to \"understand the signs of the times.\" Humble and sincere piety - a heart and mind made pure and clear by the influence of Divine truth - is the best preparation for understanding the works and ways of God. Compare the notes at 1 Corinthians 2:9-12, 1 Corinthians 2:14-15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But the wise shall understand - They who serve God and love him, and who, therefore, come under the denomination of the truly wise. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning is, that religion - the love of God and a pure heart - will qualify them to perceive the import of Divine truth; to appreciate what is revealed, and to obtain a just view of passing events - or to \"understand the signs of the times.\" Humble and sincere piety - a heart and mind made pure and clear by the influence of Divine truth - is the best preparation for understanding the works and ways of God. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 2:9-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 2:14-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. There is no need of a fuller explanation as to the time; for when the predictions so far given shall have come to pass, the godly shall be \"purified\" by the foretold trials and shall understand that the end is at hand; but the wicked shall not understand, and so shall rush on to their own ruin (Da 11:33-35) [Maurer]. The \"end\" is primarily, of Antiochus' persuasion; antitypically, the end of Antichrist's. It is the very clearness in the main which renders necessary the obscurity. The fulfilment of God's decree is not a mere arithmetical problem which the profane may understand by arithmetical calculations, but a holy enigma to stimulate to a faithful observance of God's ways, and to a diligent study of the history of God's people [Auberlen]. To this Christ refers (Mt 24:15), \"Whose readeth, let him understand.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Of this purging and purifying you heard before, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 11:35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; the meaning is, the great afflictions of the church are to prepare them, by taking away their filth, for the Bridegroom, as gold and silver are tried and refined. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "None of the wicked shall understand; but the wise shall understand:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they shall be blinded, they know not what they do, viz. they shall not be bettered by the word, or rod, or any warnings of God, but be hardened to their ruin; but the godly shall be taught of God to understand the ways of God’s providence, foretold by the prophets, for this is it they are always minded of and commended for; particularly in this kind of wisdom: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Because it is obscure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Because they are concerned greatly to know their safety, and God’s honour lies in it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Many shall be purged, and made white, and tried,.... Though Christ does not give, in plain, clear, and explicit terms, an answer to the above question, when, and how, and what would be the end of the church's troubles and afflictions; yet he here points out the use of them, which for the present should be chiefly attended to; and, when duly considered, would be a means of causing the saints to endure them with more patience and cheerfulness: many should be hereby made more pure and holy, and more free from their spots, their chaff, and their dross; their corruptions, and the power of them, weakened; their graces tried, and become more bright and shining; and they themselves a greater ornament to the religion they profess: hereby they should be \"purified\", or cleansed from the chaff of their sins; or be separated, as the chaff is by the fan, from hypocrites and ungodly men, who would not be able to endure persecution for the sake of the Gospel: and \"be made white\"; as cloth is by the fuller; freed both from their own spots in their garments, being led to the blood of Christ to wash their garments, and make them white therein; which afflictions may be the means of guiding them to, under the direction of the blessed Spirit; and from such persons who were spots in their feasts of love: and \"be tried\", as gold and silver in the furnace, and so be rid of their own dross, and of the wicked of the earth, who are like unto it; see the note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But the wicked shall do wickedly; go on in a course of sin, and be never the better for the afflictive dispensations of Providence; these either mean formal professors, that turn apostates from the faith, and become openly wicked livers; or the profane world in common; and particularly furious persecutors of the saints: such as each of these there will be till the end of things come; see Revelation 22:11, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But the wicked shall do wickedly; go on in a course of sin, and be never the better for the afflictive dispensations of Providence; these either mean formal professors, that turn apostates from the faith, and become openly wicked livers; or the profane world in common; and particularly furious persecutors of the saints: such as each of these there will be till the end of things come; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and none of the wicked shall understand; neither the doctrines of the Gospel spiritually and experimentally; nor the providences of God, and what he is doing in the world; and particularly not the prophecy of this book, and especially what has been just delivered: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but the wise shall understand; more or less of each of these things, such as are wise unto salvation; that search the Scriptures, seek to God by prayer, and are much in meditation, and make use of every help for the understanding of divine things, and even of these prophecies; and especially towards the close of time, as the accomplishment of them draws near. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but the wise shall understand; more or less of each of these things, such as are wise unto salvation; that search the Scriptures, seek to God by prayer, and are much in meditation, and make use of every help for the understanding of divine things, and even of these prophecies; and especially towards the close of time, as the accomplishment of them draws near. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Many shall be purified, and made white, and tried; but the wicked shall do wickedly: and none of the wicked shall understand; but the wise shall understand.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ‘time of the end’ characterized: it will be an age of trial and probation, in which many will come out purified and ennobled, while others will only have their wickedness confirmed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Many shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "cleanse themselves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "make themselves white",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "be refined",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] by their sufferings, and their constancy under temptation, their characters will be ennobled and refined (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The two reflexives are not to be pressed unduly; but they imply that the martyrs, by their deliberate acceptance of suffering, are, to a certain degree, the agents in the purification of their characters.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but the wicked shall do wickedly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The trial will have no effect upon them, beyond giving them further opportunities of doing wickedly, and so confirming them in their wickedness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "none of the wicked shall understand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—i.e. act with understanding—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "they that be wise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall understand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] shall act with understanding. The wicked act blindly, not perceiving the consequences of their wickedness; the ‘wise,’ the religious teachers of the nation (the same word as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 12:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), shew insight into the ways and providence of God. For ‘understand,’ cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 82:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Many shall be purified, and made white, and tried; but the wicked shall do wickedly: and none of the wicked shall understand; but the wise shall understand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As before observed, the Septuagint takes the first words of this verse and joins them to the verse preceding, omitting, however, one of the three stages of the process. The rest of the verse is, \"And the sinners shall sin, and none of the sinners shall understand,  and the wise shall attend.\" The version of Theodotion is longer than the Massoretic, \"Many shall be chosen and made white, and tested, and sanctified; and none of the transgressors shall understand, and the wise shall understand.\" The additional stage is probably due to a \"doublet.\" The Peshitta rendering is, \"Many shall be chosen, and made white, and tried; and the wicked shall do wickedly: and none of the sinners shall understand; but those that then do good shall understand.\" The Vulgate rendering is, \"And many shall be chosen, and made white, and tried as by fire; and the wicked shall do wickedly: and none of the wicked shall understand; but the learned shall understand.\" It is to be observed that all the versions take the hithpael of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בָרַר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לָבַן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as if they were the passives of the kal - a view that shows the grammatical influence of the Aramaic dialects. This verse as a whole is paraphrased in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"He that is unjust, let him be unjust still: and he that is filthy, let him be filthy still: and he that is righteous, let him be righteous still: and he that is holy, let him be holy still.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Many shall be purified",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and made tchite.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If we keep strictly to the meaning of the hithpael, we ought to render, \"Many shall purify themselves and make themselves white,\" as the Revised renders. When men make a sincere effort after purity, then the Lord is ready to help them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"If any man will do his will, he shall know of the doctrine.\" Then, when men were thus striving after purity, would the meaning of Daniel's prophecy be made known. An age in which there is great religious fervour is never one in which men are conscious of prevailing goodness; on the contrary, it is one when men are conscious of prevailing evil in themselves and others. Hence the Book of Daniel could not have been written in the age of the Maccabees; by their very earnestness they would be conscious of moral and spiritual defects in themselves and others, and would not reckon their age one in which special revelations could be expected. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Tried.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The reference implied in the word used is trying by fire - after these saints have purified themselves they are tested by fire. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "But the wicked shall do wickedly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " No amount of affliction will of itself produce purity. The northern tribes were oppressed by Hazael, but that did not work any change in them. The most striking example of this in all history is the siege of Jerusalem, The sufferings of the siege made the besieged more utterly lawless than before. Our Lord interprets a portion of this passage as referring to this siege. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "None",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of the wicked shall understand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "but the wise shall understand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This again repeats the doctrine that effort after holiness is necessary to understanding God's ways. The historical instance above cited proves the truth of the statement here. The Christians, who were the wise in the sense of those that considered and sought after God, understood the signs of the times, and left Jerusalem; but none of the wicked understood, and so perished in the fall of the city. Daniel 12:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The first clause of this verse is interpreted from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The being purified is effected through tribulation and affliction, which the people shall endure to the end. The prophecy shall serve for the gaining of this object. It is true, indeed, that this perfection shall not be attained by all; they that are ungodly shall remain ungodly still, and therefore they do not come to the understanding of the words which all the wise shall gain. יבינוּ and יבינוּ לא stand in such distinct relation to the אבין לא (I understood not), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that they must be taken in the same sense in both places, i.e., not to have insight in general, but by supplying הדּברים as the object from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to have understanding of the prophecy. This is denied of the wicked or the godless. Only the wise shall gain it. Thus the angel says to Daniel for the purpose of calming him regarding his non-understanding: - Calm thyself, Daniel, if thou dost not understand these words. The prophecy shall be preserved for all times to the end of the days. These times shall bring many tribulations, to purify thy people; and though by these afflictions all shall not be converted, but the wicked shall remain wicked still and shall not understand the prophecy, yet the wise shall be purified and made white by the afflictions, and the longer they are tried the better shall they learn to understand the prophecy. Thus, though thou thyself understandest it not, yet it shall be a source of great blessing to the people of God, and in all times, even unto the end, they shall have more and more an understanding of it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus has Kliefoth rightly presented the meaning of both verses, and in confirmation of this interpretation has referred to 1 Peter 1:10,1 Peter 1:12, where, with reference to the passage before us (cf. Hengstenberg, Beitrag. i. p. 273f.), it is said that the prophets received the prophecies of the end not for themselves alone, but much rather for \"us,\" for those who come after. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus has Kliefoth rightly presented the meaning of both verses, and in confirmation of this interpretation has referred to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where, with reference to the passage before us (cf. Hengstenberg, Beitrag. i. p. 273f.), it is said that the prophets received the prophecies of the end not for themselves alone, but much rather for \"us,\" for those who come after. ",
            "children": []
          }
        ]
      }
    ]
  }
]