[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From the time.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It appears as if at this verse the prophecy recurs to the more immediate future, and that these words point to the same subject as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The language used respecting the “abomination” is almost verbally the same as that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and prevents us from arriving at any other conclusion. The great and apparently insoluble difficulty is the relation which the 1,290 or the 1,335 days occupy with regard to the 2,300 days, or the time, times, and the dividing of a time. Assuming that these four periods all commence at the same epoch (see Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the death of Antiochus closes the 1,290 days, and the 1,335 days point to some event which occurred forty-five days, or a month and a half, later. The principal objection to this view is that the exact date of the death of Antiochus is uncertain, and therefore all calculations based upon the precise day of his death must be untrustworthy. It is obvious that neither of the two periods mentioned in this and the following verse can be made to agree with three years and a half without setting the rules of arithmetic at defiance. Also the obscurity which rests over the greater portion of the history of Israel should guard us against assuming that we can explain all the contents of the last three chapters by means of what occurred in those times, and also against assuming our historical facts from Daniel, and then making use of them to illustrate his prophecies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 12:11-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And from the time that the daily sacrifice shall be taken away — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is here declared, that the whole time that these calamities would last, should run somewhat beyond ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a time, times, and half a time, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, thirty days beyond it; for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a time, times, and a half ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signify only twelve hundred and sixty days, whereas here twelve hundred and ninety is mentioned as the term of duration; for which space of time, but not longer, the daily sacrifice should be taken away, or prohibited, and an idol be placed in the temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed is he that waiteth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "survives, and cometh to the thousand three hundred and five and thirty days — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This period is forty-five days longer than the term last mentioned, or the twelve hundred and ninety days; and, if taken literally, and interpreted of the time of Antiochus’s persecution, is supposed to be spoken of the time of his death, when the Jewish nation was not only delivered from their calamities, but also from all fear of their being renewed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Those who extend these predictions to the times of Popery and Mohammedanism, suppose that the expressions made use of to describe Antiochus’s persecutions are here applied to the desolations made by antichrist, of which those made by Antiochus were a figure: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And indeed they are expressions evidently applicable to different events, and have been accomplished at different times. “The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "setting up of the abomination of desolation,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "says Bishop Newton, “appears to be a general phrase, and comprehensive of various events. It is applied by the writer of the first book of Maccabees, chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Ma 1:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the profanation of the temple by Antiochus, and his setting up the image of Jupiter Olympus upon the altar of God. It is applied by our Saviour, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the destruction of the city and temple by the Romans, under the conduct of Titus. It may, for the same reason, be applied to the Emperor Adrian’s building a temple to Jupiter Capitolinus, in the same place where the temple of God had stood; and to the misery of the Jews, and the desolation of Judea that followed. It may, with equal justice, be applied to the Mohammedans’ invading and desolating Christendom, and converting the churches into mosques: and this latter event seems to have been particularly intended in this passage. If this interpretation be true, the religion of Mohammed will prevail in the East for the space of twelve hundred and sixty years, and then a great and glorious revolution will follow; perhaps the restoration of the Jews, perhaps the destruction of antichrist: but another still greater and more glorious will succeed; and what can this be so probably as the full conversion of the Gentiles to the church of Christ, and the beginning of the millennium, or the reign of the saints upon earth? For, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed is he that waiteth and cometh to the thousand three hundred and five and thirty days. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Here, then, are three different periods assigned, twelve hundred and sixty, twelve hundred and ninety, and thirteen hundred and thirty-five years; but what is the precise time of their beginning, and consequently of their ending, as well as what are the great and signal events which will take place at the end of each period, we can only conjecture, time alone can with certainty discover. It is, indeed, no wonder, that we cannot fully understand and explain these things: for, as the angel said to Daniel himself, though ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "many should run to and fro, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "should inquire and examine into these things, and thereby ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "knowledge ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "should ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be increased; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "yet the full understanding of them is reserved for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "time of the end, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to which time the words are ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "closed up and sealed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But, however, the great uncertainty of these events, which remain yet to be fulfilled, cannot shake the credit and certainty of those which have already been accomplished.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Upon the whole, what an amazing prophecy is this! comprehending so many various events, and extending through so many successive ages, from the first establishment of the Persian empire, above five hundred and thirty years before Christ, to the general resurrection! And the farther it extends, and the more it comprehends, the more amazing and the more divine it must appear. What stronger and more convincing proofs can be given or required of a divine providence, and a divine revelation; that there is a God who directs and orders the transactions of the world; and that Daniel was a prophet divinely inspired by him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a man greatly beloved, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as he is often addressed by an angel! Our blessed Saviour hath bestowed upon him the appellation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel the prophet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that is authority sufficient for any Christian; but, in the course of these notes, such instances and attestations of his being a prophet have been produced as an infidel cannot deny, or if he denies cannot disprove. In short, we see how well Daniel deserves the character which his contemporary, Ezekiel, hath given of him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:14-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 28:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "piety ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wisdom; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and these usually go together: for, as the angel says above, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "None of the wicked shall understand, but the wise shall understand. Happy are they who both know the will of God and do it.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:5-13 One of the angels asking how long it should be to the end of these wonders, a solemn reply is made, that it would be for a time, times, and a half, the period mentioned ch. 7:25, and in the Revelation. It signifies 1260 prophetic days or years, beginning from the time when the power of the holy people should be scattered. The imposture of Mohammed, and the papal usurpation, began about the same time; and these were a twofold attack upon the church of God. But all will end well at last. All opposing rule, principality, and power, shall be put down, and holiness and love will triumph, and be in honour, to eternity. The end, this end, shall come. What an amazing prophecy is this, of so many varied events, and extending through so many successive ages, even to the general resurrection! Daniel must comfort himself with the pleasing prospect of his own happiness in death, in judgment, and to eternity. It is good for us all to think much of going away from this world. That must be our way; but it is our comfort that we shall not go till God calls us to another world, and till he has done with us in this world; till he says, Go thou thy way, thou hast done thy work, therefore now, go thy way, and leave it to others to take thy place. It was a comfort to Daniel, and is a comfort to all the saints, that whatever their lot is in the days of their lives, they shall have a happy lot in the end of the days. And it ought to be the great care and concern of every one of us to secure this. Then we may well be content with our present lot, and welcome the will of God. Believers are happy at all times; they rest in God by faith now, and a rest is reserved for them in heaven at last.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And from the time - Though the angel had said ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that his communication was closed, and that he imparted all that he was commissioned to communicate to Daniel, yet, as it would seem, in reply to the earnest request of Daniel, he volunteers an additional statement, in regard to certain important periods that were to occur in the future. The language, however, is very obscure; and it would appear, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the angel scarcely expected that Daniel would understand it. The statement relates to certain periods that would succeed the time when the daily sacrifice would be taken away. Two such periods are mentioned as marking important epochs in the future.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That the daily sacrifice shall be taken away - This is the point of reckoning - the terminus a quo. The \"taking away of the daily sacrifice\" refers, undoubtedly, to some act, or some state of things, by which it would be made to cease; by which the daily offerings at Jerusalem would be either temporarily suspended or totally abolished. See the notes at Daniel 8:11; Daniel 9:27; Daniel 11:31. The language here is applicable to either of two events: to the act of Antiochus, causing the daily sacrifice to cease in Jerusalem Daniel 8:11; Daniel 11:31, or to the final closing of those sacrifices by the death of the Messiah as the great offering to whom they referred, and the destruction of the temple and the altar by the Romans, Daniel 9:27. The view taken in the interpretation of this passage will depend on the question to which of these there is allusion here by the angel, or whether there is an allusion to both. The language evidently is applicable to both, and might be employed with reference to either.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That the daily sacrifice shall be taken away - This is the point of reckoning - the terminus a quo. The \"taking away of the daily sacrifice\" refers, undoubtedly, to some act, or some state of things, by which it would be made to cease; by which the daily offerings at Jerusalem would be either temporarily suspended or totally abolished. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The language here is applicable to either of two events: to the act of Antiochus, causing the daily sacrifice to cease in Jerusalem ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or to the final closing of those sacrifices by the death of the Messiah as the great offering to whom they referred, and the destruction of the temple and the altar by the Romans, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The view taken in the interpretation of this passage will depend on the question to which of these there is allusion here by the angel, or whether there is an allusion to both. The language evidently is applicable to both, and might be employed with reference to either.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And the abomination that maketh desolate set up - See these words explained in the notes at Daniel 8:13; Daniel 9:27; Daniel 11:31. The same remark may be made here which was made respecting the previous expression - that the language is applicable to two quite distinct events, and events which were separated by a long interval of time: to the act of Antiochus in setting up an image of Jupiter in the temple, and to a similar act on the part of the Romans when the temple was finally destroyed. The view which is taken of the time referred to here will depend on the question which of these is to be regarded as the stand-point or the terminus a quo, or whether the language is designedly so used that an important epoch was to occur in both cases within a specified period after these events. On these points there has been great diversity of opinion.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the abomination that maketh desolate set up - See these words explained in the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The same remark may be made here which was made respecting the previous expression - that the language is applicable to two quite distinct events, and events which were separated by a long interval of time: to the act of Antiochus in setting up an image of Jupiter in the temple, and to a similar act on the part of the Romans when the temple was finally destroyed. The view which is taken of the time referred to here will depend on the question which of these is to be regarded as the stand-point or the terminus a quo, or whether the language is designedly so used that an important epoch was to occur in both cases within a specified period after these events. On these points there has been great diversity of opinion.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There shall be a thousand two hundred and ninety days - If this is to be taken literally, it would be three years and two hundred and ten days, reckoning the year at 360 days, and is thirty days more than the three years and a half referred to in Daniel 12:7. Prof. Stuart, who supposes that the time is to be taken literally, and that the passage refers exclusively to Antiochus Epiphanes, explains the application of the language in the following manner: \"Antiochus took away the daily sacrifice as is here declared. This was in the latter part of May, 168 b.c. Profane history does not indeed give us the day, but it designates the year and the season. As we have already seen (compare the extract copied from Prof. Stuart on Daniel 7:24-28), about three and a half years elapsed, after the temple worship was entirely broken up, before Judas Maccabeus expurgated the temple and restored its rites. The terminus ad quem is not mentioned in the verse now before us; but still it is plainly implied. The end of the 1290 days must, of course, be marked by some signal event, just as the commencement of them is so marked. And as the suppression of the temple rites constitutes the definitive mark of the commencement, so it would seem plain that the restoration of the same rites must mark the conclusion of the period which is designated.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There shall be a thousand two hundred and ninety days - If this is to be taken literally, it would be three years and two hundred and ten days, reckoning the year at 360 days, and is thirty days more than the three years and a half referred to in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Prof. Stuart, who supposes that the time is to be taken literally, and that the passage refers exclusively to Antiochus Epiphanes, explains the application of the language in the following manner: \"Antiochus took away the daily sacrifice as is here declared. This was in the latter part of May, 168 b.c. Profane history does not indeed give us the day, but it designates the year and the season. As we have already seen (compare the extract copied from Prof. Stuart on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:24-28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), about three and a half years elapsed, after the temple worship was entirely broken up, before Judas Maccabeus expurgated the temple and restored its rites. The terminus ad quem is not mentioned in the verse now before us; but still it is plainly implied. The end of the 1290 days must, of course, be marked by some signal event, just as the commencement of them is so marked. And as the suppression of the temple rites constitutes the definitive mark of the commencement, so it would seem plain that the restoration of the same rites must mark the conclusion of the period which is designated.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The 'time of the end,' i. e., the period at the close of which the persecutions of Antiochus would cease, is distinctly adverted to in Daniel 7:25; Daniel 11:30-35; Daniel 12:7. The nature of the case, in the verse before us, shows that the same period is tacitly referred to in the words of the speaker. No doubt remains that his march (the march of Antiochus) from Antioch to Egypt, for hostile purposes, was in the spring of the year 168 b.c. He was delayed for some time on this march by ambassadors from Egypt, who met him in Coelo-Syria. Very naturally, therefore, we may conclude that he arrived opposite Jerusalem in the latter part of May, and that there and then he commissioned Apollonius to rifle and profane the temple. The exact time from the period when this was done, down to the time of the expurgation, seems to have been, and is designated as being, 1290 days.\" - Hints on Prophecy, pp. 94, 95. It is evident, however, that there is here no clear making out of the exact time by any historical records, though it is in itself not improbable. Still the great difficulty is, that in the supposition that the \"time, and times, and an half\" refers to Antiochus, as denoting the period of his persecutions, thus limiting it to three years and a half - a period which can be made out without material difficulty (compare the notes at Daniel 7:24-28) - that another time or period should be mentioned here of thirty days more, concerning which there is no corresponding event in the historical facts, or at least none that can now be demonstrated to have occurred. See the remarks at the close of the next verses. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The 'time of the end,' i. e., the period at the close of which the persecutions of Antiochus would cease, is distinctly adverted to in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:30-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The nature of the case, in the verse before us, shows that the same period is tacitly referred to in the words of the speaker. No doubt remains that his march (the march of Antiochus) from Antioch to Egypt, for hostile purposes, was in the spring of the year 168 b.c. He was delayed for some time on this march by ambassadors from Egypt, who met him in Coelo-Syria. Very naturally, therefore, we may conclude that he arrived opposite Jerusalem in the latter part of May, and that there and then he commissioned Apollonius to rifle and profane the temple. The exact time from the period when this was done, down to the time of the expurgation, seems to have been, and is designated as being, 1290 days.\" - Hints on Prophecy, pp. 94, 95. It is evident, however, that there is here no clear making out of the exact time by any historical records, though it is in itself not improbable. Still the great difficulty is, that in the supposition that the \"time, and times, and an half\" refers to Antiochus, as denoting the period of his persecutions, thus limiting it to three years and a half - a period which can be made out without material difficulty (compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:24-28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") - that another time or period should be mentioned here of thirty days more, concerning which there is no corresponding event in the historical facts, or at least none that can now be demonstrated to have occurred. See the remarks at the close of the next verses. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. from … sacrifice … taken way … abomination—(Da 11:31). As to this epoch, which probably is prophetically germinant and manifold; the profanation of the temple by Antiochus (in the month Ijar of the year 145 B.C., till the restoration of the worship by Judas Maccabeus on the twenty-fifth day of the ninth month [Chisleu] of 148 B.C., according to the Seleucid era, 1290 days; forty-five days more elapsed before Antiochus' death in the month Shebat of 148 B.C., so ending the Jews' calamities [Maurer]); by pagan Rome, after Christ's death; by Mohammed; by Antichrist, the culmination of apostate Rome. The \"abomination\" must reach its climax (see Auberlen's translation, \"summit,\" Da 9:27), and the measure of iniquity be full, before Messiah comes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thousand two hundred and ninety days—a month beyond the \"time, times, and a half\" (Da 12:7). In Da 12:12, forty-five days more are added, in all 1335 days. Tregelles thinks Jesus at His coming will deliver the Jews. An interval elapses, during which their consciences are awakened to repentance and faith in Him. A second interval elapses in which Israel's outcasts are gathered, and then the united blessing takes place. These stages are marked by the 1260, 1290, and 1335 days. Cumming thinks the 1260 years begin when Justinian in A. D. 533 subjected the Eastern churches to John II, bishop of Rome; ending in 1792, when the Code Napoleon was established and the Pope was dishonored. 1290 reach to 1822, about the time of the waning of the Turkish power, the successor to Greece in the empire of the East. Forty-five years more end in 1867, the end of \"the times of the Gentiles.\" See Le 26:24, \"seven times,\" that is, 7 X 360, or 2520 years: 652 B.C. is the date of Judah's captivity, beginning under Manasseh; 2520 from this date end in 1868, thus nearly harmonizing with the previous date, 1867. See on [1114]Da 8:14. The seventh millenary of the world [Clinton] begins in 1862. Seven years to 1869 (the date of the second advent) constitute the reign of the personal Antichrist; in the last three and a half, the period of final tribulation, Enoch (or else Moses) and Elijah, the two witnesses, prophesy in sackcloth. This theory is very dubious (compare Mt 24:36; Ac 1:7; 1Th 5:2; 2Pe 3:10); still the event alone can tell whether the chronological coincidences of such theories are fortuitous, or solid data on which to fix the future times. Hales makes the periods 1260, 1290, 1335, begin with the Roman destruction of Jerusalem and end with the precursory dawn of the Reformation, the preaching of Wycliffe and Huss.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And from the time that the daily sacrifice shall be taken away,.... This is in part an answer to the above questions, as they relate to the end of things: some dates are given, by which it might in general be known when and how these things would end: and these dates begin with the removal of the daily sacrifice; that is, the doctrine of atonement and satisfaction for sin by the sacrifice of Christ, the antitype of the daily sacrifice under the law; this was taken away by antichrist, when he got to his height; when he established the doctrine of works, and opposed the merits of men to the merits of Christ, and his own pardons, indulgences, penances, &c. to the satisfaction of Christ: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the abomination that maketh desolate; image worship; the abomination of the Mass, and other acts of idolatry and superstition: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "there shall be a thousand two hundred and ninety days; from the beginning of the reign of antichrist to the end of it are one thousand two hundred and sixty days or years, or forty two months, which is the same, according to Revelation 13:5, here thirty days or years are added, which begin where the other end, and is the time allotted for the conversion of the Jews, and other things, making way for the kingdom of Christ; and which the reign of antichrist was an hinderance of, but should now immediately take place. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "there shall be a thousand two hundred and ninety days; from the beginning of the reign of antichrist to the end of it are one thousand two hundred and sixty days or years, or forty two months, which is the same, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", here thirty days or years are added, which begin where the other end, and is the time allotted for the conversion of the Jews, and other things, making way for the kingdom of Christ; and which the reign of antichrist was an hinderance of, but should now immediately take place. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And from the time that the {l} daily sacrifice shall be taken away, and the abomination that maketh desolate set up, there {m} shall be a thousand two hundred and ninety days.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And from the time ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " daily ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "sacrifice",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shall be taken away, and the abomination that maketh desolate set up, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there {m} shall be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a thousand two hundred and ninety days.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) From the time that Christ by his sacrifice will take away the sacrifices and ceremonies of the Law.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Signifying that the time will be long until Christ's second coming, and yet the children of God ought not to be discouraged, even though it is deferred.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11, 12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The duration of the persecution defined.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "continual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (burnt-offering) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be taken away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the abomination that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "appalleth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "set up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] also as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): see the notes on these passages.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a thousand two hundred and ninety days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "terminus a quo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaiah 15 Chisleu [Dec.], b.c. 168 (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Ma 1:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and 1290 days, reckoned from this date, would end in June—according to Cornill, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Siebzig Wochen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 29, on June 6—b.c. 164. The death of Antiochus took place in the course of b.c. 164: the exact date of it is not known; but it is not improbable that it is pictured by the writer as synchronizing with the end of the 1290 days.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And from the time that the daily sacrifice shall be taken away, and the abomination that maketh desolate set up, there shall be a thousand two hundred and ninety days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Septuagint is, \"From ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " time the sacrifice is taken away for ever, and the abomination of desolation is prepared to be set up, are a thousand two hundred and ninety days.\" The translator must have had ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עֹלַת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ('",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "olath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") before him, and read it ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עלָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ('",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "olah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), else he could not have translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "תָּמִיֻד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"for ever,\" and written \"sacrifice\" also. The Hebrew copyist, following the usage of Palestine, which makes \"sacrifice\" understood after \"continual,\" had omitted it in the text followed by the Massoretes. Theodotion's rendering is, \"From the time of the change of the daily sacrifice (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν δελεχισμός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the abomination of desolation set up (\"given,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "δοθήσεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is a thousand two hundred and ninety days.\" The Peshitta and Vulgate do not call for remarks. This verse is a veritable cruz ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "interpretum. From the time that the daily sacrifice shall be taken away.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This event is referred to in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Whether the eleventh chapter is earlier or later is in our opinion scarcely doubtful. Also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we have the taking away of the daily sacrifice mentioned as one of the deeds of Antiochus. While the reference in ch. 11. and ch. 8. is to the action of Antiochus, it is not necessary to maintain that this refers to him; other oppressors might take away the daily sacrifice. This clause certainly seems to give the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "terminus a quo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but it is difficult to fix the date in question. Certainly from the fact that the words used here are used by the writer of the eleventh chapter to describe the actions of Antiochus, and that in 1 Macc. 1:54 there is also a similar identification, we might be inclined to take the event here mentioned as the starting-point of the twelve hundred and ninety days. But the acknowledged impossibility of fitting the days to the chronology militates against this view. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And the abomination that maketh desolate set up.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " At first sight the reader is inclined to follow Wieseler, and regard this as a statement of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "terminus ad quem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The grammatical difficulties against this  view are forcible. Although ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לְ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "... ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מִן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"from\" and \"to,\" are sometimes used for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ... ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מִן",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"from... until,\" it is rare, and the intrusion of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "וְ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"and,\" is strong against this interpretation. Yet it seems strange that two ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "termini a quo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should be assigned and no ter",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "minus ad quota. A thousand two hundred and ninety days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " While this seems to be the same period as that reckoned in the seventh verse, \"a time, times, and half a time,\" yet it is not absolutely coincident. It is thirty days more than three and a half times the prophetic year of three hundred and sixty, and eleven days more than three and a half mean solar years. As we have already said, if we take the profanation of the temple, 25th Casleu, 145 Seleucid era, as our starting-point, it is impossible to fix any great deliverance or any event of importance which happened some three years and seven months after. Antiochus may have died seven months after the news arrived of the reconsecration of the temple; but we have no data. As above stated, the death of Antiochus wrought but little alteration in the condition of the Jews. If we regard the days as literal days, there is one period that nearly coincides with the twelve hundred and ninety days - our Lord's ministry upon the earth. It is difficult to understand how our Lord's commencing his ministry was the removing of the daily sacrifice. Yet in the \"heavenlies\" it might be so. Further, we sometimes reckon \"from\" a period to come, as we can say, \"We are yet  -  weeks from harvest, midsummer, or Christmas.\" So the Crucifixion as the fulfilment of all the sacrifices of the Law may be regarded as their removal. Certainly in his crucifixion was the real abomination which maketh desolate set up. It suits the next verse. From our Lord's crucifixion to his ascension there would be exactly forty-five days if, as is commonly believed, his ascension, as his resurrection, took place on a Sunday. This, however, is merely a thought thrown out. If we take the date indicated by our Lord, the war against the Jews, dating from Vespasian's march to Ptolemais in the beginning of A.D.  to the capture of the temple and the cessation of the daily sacrifice (Josephus, 'Bell. Jud.,' 6:02. 1), is not far off twelve hundred and ninety days. From this to the final capture of the city is close upon forty-five days. If we, however, take a day for a year, then another series of possible solutions are before us, all more or less faulty. One has the merit of postponing the solution to a date still future. The capture of Jerusalem by the Arabs in A.D.  is made the starting-point; if we add to that twelve hundred and ninety years, we have A.D. . The Mohammedan power may have fallen by that time; anything may have happened then. All these various solutions, all more or less unsatisfactory, prove that no solution is possible. If the fulfilment is yet in the future, circumstances may convey to us the interpretation. We must remember the vision was sealed to \"the time of the end.\" Professor Fuller suggests that Babylonian discovery may at some future date throw light on Daniel's use of numbers. Daniel 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The angel gives to the prophet yet one revelation more regarding the duration of the time of tribulation and its end, which should help him to understand the earlier answer. The words, \"from the time that the daily sacrifice shall be taken away, and the abomination of the desolation,\" so distinctly point back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that they must here be referred, as there, to the wickedness of Antiochus in his desecrating the sanctuary of the Lord. The circumstance that the שׁקּוּץ (abomination) is here described as שׁמם and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as משׁמם, indicates no material distinction. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the subject spoken of is the proceedings of the enemy of God causing desolation, the abomination is viewed as משׁמם, bringing desolation; here, with reference to the end of those proceedings, as שׁמם, brought to desolation; cf. under ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All interpreters therefore have found in these two verses statements regarding the duration of the persecutions carried on by Antiochus Epiphanes, and have sought to compare them with the period of 2300 evening-mornings mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in order thus to reckon the duration of the time during which this enemy of God shall prosecute his wicked designs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But as the opinion is regarding the reckoning of the 2300 evening-mornings in Daniel 8:14 are very diverse from each other, so also are they here. First the interpretation of ולתת (and set up) is disputed. Wieseler is decidedly wrong in thinking that it designates the terminsu ad quem to הוּסר מעת (from the time shall be removed), as is generally acknowledged. Hitzig thinks that with ולתת the foregoing infin. הוּסר is continued, as Ecclesiastes 9:1; Jeremiah 17:10; Jeremiah 19:12, and therewith a second terminus a quo supposed. This, however, is only admissible if this second terminus stands in union with the first, and a second terminus ad quem also stands over against it as the parallel to the later terminus ad quem. Both here denote: the daily sacrifice shall be taken away forty-five days before the setting up of the βδέλυγμα ἐρημώσεως, and by so much the date in Daniel 12:12 comes below that of Daniel 12:11. According to this, both verses are to be understood thus: from the time of the taking away of the daily sacrifice as 1290 days, and from the time of the setting up of the abomination of desolation are 1335 days. But this interpretation is utterly destitute of support. In the first place, Hitzig has laid its foundation, that the setting up of the idol-abomination is separated from the cessation of the worship of Jehovah by forty-five days, only by a process of reasoning in a circle. In the second place, the המחכּה אשׁרי (blessed is he that waiteth), Daniel 12:12, decidedly opposes the combining of the 1335 days with the setting up of the idol-abomination; and further, the grammatical interpretation of ולתת is not justified. The passages quoted in its favour are all of a different character; there a clause with definite time always goes before, on which the infinitive clause depends. Kranichfeld seeks therefore to take הוּסר also not as an infinitive, but as a relative asyndetical connection of the praeter. proph. to עת, by which, however, no better result is gained. For with the relative interpretation of הוּסר: the time, since it is taken away ...  ולתת cannot so connect itself that this infinitive yet depends on עת. The clause beginning with ולתת cannot be otherwise interpreted than as a final clause dependent on וגו הוּסר מעת; thus here and in Daniel 2:16, as in the passages quoted by Hitzig, in the sense: to set (to set up) the abomination, so that the placing of the abomination of desolation is viewed as the object of the taking away of the תּמיד (daily sacrifice). From this grammatically correct interpretation of the two clauses it does not, however, follow that the setting up of the idol-abomination first followed later than the removal of the daily sacrifice, so that ולתת signified \"to set up afterwards,\" as Kliefoth seeks to interpret it for the purpose of facilitating the reckoning of the 1290 days. Both can be done at the same time, the one immediately after the other.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But as the opinion is regarding the reckoning of the 2300 evening-mornings in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are very diverse from each other, so also are they here. First the interpretation of ולתת (and set up) is disputed. Wieseler is decidedly wrong in thinking that it designates the terminsu ad quem to הוּסר מעת (from the time shall be removed), as is generally acknowledged. Hitzig thinks that with ולתת the foregoing infin. הוּסר is continued, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 9:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and therewith a second terminus a quo supposed. This, however, is only admissible if this second terminus stands in union with the first, and a second terminus ad quem also stands over against it as the parallel to the later terminus ad quem. Both here denote: the daily sacrifice shall be taken away forty-five days before the setting up of the βδέλυγμα ἐρημώσεως, and by so much the date in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " comes below that of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". According to this, both verses are to be understood thus: from the time of the taking away of the daily sacrifice as 1290 days, and from the time of the setting up of the abomination of desolation are 1335 days. But this interpretation is utterly destitute of support. In the first place, Hitzig has laid its foundation, that the setting up of the idol-abomination is separated from the cessation of the worship of Jehovah by forty-five days, only by a process of reasoning in a circle. In the second place, the המחכּה אשׁרי (blessed is he that waiteth), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", decidedly opposes the combining of the 1335 days with the setting up of the idol-abomination; and further, the grammatical interpretation of ולתת is not justified. The passages quoted in its favour are all of a different character; there a clause with definite time always goes before, on which the infinitive clause depends. Kranichfeld seeks therefore to take הוּסר also not as an infinitive, but as a relative asyndetical connection of the praeter. proph. to עת, by which, however, no better result is gained. For with the relative interpretation of הוּסר: the time, since it is taken away ...  ולתת cannot so connect itself that this infinitive yet depends on עת. The clause beginning with ולתת cannot be otherwise interpreted than as a final clause dependent on וגו הוּסר מעת; thus here and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as in the passages quoted by Hitzig, in the sense: to set (to set up) the abomination, so that the placing of the abomination of desolation is viewed as the object of the taking away of the תּמיד (daily sacrifice). From this grammatically correct interpretation of the two clauses it does not, however, follow that the setting up of the idol-abomination first followed later than the removal of the daily sacrifice, so that ולתת signified \"to set up afterwards,\" as Kliefoth seeks to interpret it for the purpose of facilitating the reckoning of the 1290 days. Both can be done at the same time, the one immediately after the other.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A terminus ad quem is not named in both of the definitions. This appears from the words \"blessed is he that waiteth ... .\" By this it is said that after the 1335 days the time of tribulation shall be past. Since all interpreters rightly understand that the 1290 and the 1335 days have the same terminus a quo, and thus that the 1290 days are comprehended in the 1335, the latter period extending beyond the former by only forty-five days; then the oppression cannot properly last longer than 1290 days, if he who reaches to the 1335 days is to be regarded as blessed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With regard to the reckoning of these two periods of time, we have already shown that neither the one nor the other accords with the 2300 evening-mornings, and that there is no ground for reckoning those 2300 evening-mornings for the sake of these verses before us as 1150 days. Moreover, we have there already shown how the diversity of the two statements is explained from this, that in Daniel 8:14 a different terminus a quo is named from that in Daniel 12:11.; and besides have remarked, that according to 1 Macc. 1:54, 59, cf. with 4:52, the cessation of the Mosaic order of worship by sacrifice lasted for a period of only three years and ten days. Now if these three years and ten days are reckoned according to the sun-year at 365 days, or according to the moon-year at 354 days with the addition of an intercalary month, they amount to 1105 or 1102 days. The majority of modern interpreters identify, it is true, the 1290 days with the 3 1/2 times ( equals  years), and these two statements agree so far, since 3 1/2 years make either 1279 or 1285 days. But the identifying of the two is not justified. In Daniel 12:11 the subject plainly is the taking away of the worship of Jehovah and the setting up of the worship of idols in its stead, for which the Maccabean times furnish an historical fulfilment; in Daniel 12:7,however, the angel speaks of a tribulation which extends so far that the strength of the holy people is altogether broken, which cannot be said of the oppression of Israel by Antiochus, since a stop was put to the conduct of this enemy by the courageous revolt of the Maccabees, and the power of valiant men put an end to the abomination of the desolation of the sanctuary. The oppression mentioned in Daniel 12:7 corresponds not only in fact, but also with respect to its duration, with the tribulation which the hostile king of the time of the end, who shall arise from the fourth world-kingdom, shall bring upon the holy people, since, as already remarked, the 3 1/2 times literally correspond with Daniel 7:25. But Daniel 12:11 and Daniel 12:12 treat of a different, namely, an earlier, period of oppression than Daniel 12:7, so the 1290 and the 1335 days are not reckoned after the 3 1/2 times (Daniel 12:11 and Daniel 7:35); and for the Maccabean period of tribulation there remain only the 2300 evening-mornings (Daniel 8:14) for comparison, if we count the evening-mornings, contrary to the usage of the words, as half-days, and so reduce them to 1150 days. But if herewith we take into consideration the historical evidence of the duration of the oppression under Antiochus, the 1290 days would agree with it only if we either fix the taking away of the legal worship from 185 to 188 days, i.e., six months and five or eight days, before the setting up of the idol-altar on Jehovah's altar of burnt-offering, or, if these two facta occurred simultaneously, extend the terminus ad quem by six months and five or eight days beyond the day of the re-consecration of the altar. For both suppositions historical evidence is wanting. The former is perhaps probable from 1 Macc. 4:45, cf. with v. 54; but, on the contrary, for the second, history furnishes no epoch-making event of such significance as that the cessation of the oppression could be defined by it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With regard to the reckoning of these two periods of time, we have already shown that neither the one nor the other accords with the 2300 evening-mornings, and that there is no ground for reckoning those 2300 evening-mornings for the sake of these verses before us as 1150 days. Moreover, we have there already shown how the diversity of the two statements is explained from this, that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a different terminus a quo is named from that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; and besides have remarked, that according to 1 Macc. 1:54, 59, cf. with 4:52, the cessation of the Mosaic order of worship by sacrifice lasted for a period of only three years and ten days. Now if these three years and ten days are reckoned according to the sun-year at 365 days, or according to the moon-year at 354 days with the addition of an intercalary month, they amount to 1105 or 1102 days. The majority of modern interpreters identify, it is true, the 1290 days with the 3 1/2 times ( equals  years), and these two statements agree so far, since 3 1/2 years make either 1279 or 1285 days. But the identifying of the two is not justified. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the subject plainly is the taking away of the worship of Jehovah and the setting up of the worship of idols in its stead, for which the Maccabean times furnish an historical fulfilment; in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",however, the angel speaks of a tribulation which extends so far that the strength of the holy people is altogether broken, which cannot be said of the oppression of Israel by Antiochus, since a stop was put to the conduct of this enemy by the courageous revolt of the Maccabees, and the power of valiant men put an end to the abomination of the desolation of the sanctuary. The oppression mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " corresponds not only in fact, but also with respect to its duration, with the tribulation which the hostile king of the time of the end, who shall arise from the fourth world-kingdom, shall bring upon the holy people, since, as already remarked, the 3 1/2 times literally correspond with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " treat of a different, namely, an earlier, period of oppression than ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so the 1290 and the 1335 days are not reckoned after the 3 1/2 times (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and for the Maccabean period of tribulation there remain only the 2300 evening-mornings (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") for comparison, if we count the evening-mornings, contrary to the usage of the words, as half-days, and so reduce them to 1150 days. But if herewith we take into consideration the historical evidence of the duration of the oppression under Antiochus, the 1290 days would agree with it only if we either fix the taking away of the legal worship from 185 to 188 days, i.e., six months and five or eight days, before the setting up of the idol-altar on Jehovah's altar of burnt-offering, or, if these two facta occurred simultaneously, extend the terminus ad quem by six months and five or eight days beyond the day of the re-consecration of the altar. For both suppositions historical evidence is wanting. The former is perhaps probable from 1 Macc. 4:45, cf. with v. 54; but, on the contrary, for the second, history furnishes no epoch-making event of such significance as that the cessation of the oppression could be defined by it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The majority of modern interpreters, in the reckoning of the 1290 and the 1335 days, proceed from Daniel 8:14, and with them Kliefoth holds, firstly, that the 2300 evening-mornings are 1150 days, the termination of which constitutes the epoch of the re-consecration of the temple, on the 25th of the month Kisleu of the year 148 of the Seleucidan aera (i.e., 164 b.c.); and secondly, he supposes that the terminus a quo of the 2300 evening-mornings (Daniel 8:14 and of the 1290 or 1335 days is the same, namely, the taking of Jerusalem by Apollonius (1 Macc. 1:29ff.), and the setting aside of the תּמיד which followed immediately after it was taken, about 140 days earlier than the setting up of the idol-altar. As the terminus ad quem of the 2300 evening-mornings the re-consecration of the temple is taken, with which the power of Antiochus over Israel was broken, and the beginning of the restoration made. No terminus ad quem is named in this passage before us, but perhaps it lies in the greater number of the days, as well as in this, that this passage speaks regarding the entire setting aside of the power of Antiochus-an evidence and a clear argument for this, that in Daniel 12:11, Daniel 12:12 a further terminus ad quem, reaching beyond the purification of the temple, is to be supposed. This terminus is the death of Antiochus. \"It is true,\" Kliefoth further argues, \"we cannot establish it to a day and an hour, that between the putting away of the daily sacrifice and the death of Antiochus 1290 days intervened, since of both facta we do not know the date of the day. But this we know from the book of the Maccabees, that the consecration of the temple took place on the 25th day of the month Kisleu in the 148th year of the Seleucidan aera, and that Antiochus died in the 149th year; and if we now add the 140 days, the excess of 2300 above 1290 after the consecration of the temple, we certainly come into the year 149. The circumstance also, that in the whole connection of this chapter the tendency is constantly toward the end of Antiochus, the Antichrist, induces us to place the death of that persecutor as the terminus ad quem of the 1290 days. Consequently we shall not err if, with Bleek, Kirmss, Hitzig, Delitzsch, Hofmann, Auberlen, Zndel, we suppose, that as the purifying of the temple is the end of the 2300 evening-mornings, so the death of Antiochus is the end of the 1290 days. The end of the 1335 days, Daniel 12:12, must then be an event which lies forty-five days beyond the death of Antiochus, and which certainly attests the termination of the persecution under Antiochus and the commencement of better days, and which at least bears clear evidence of the introduction of a better time, and of a settled and secure state of things. We are not able to adduce proof of such a definite event which took place exactly fort-five days after the death of Antiochus, simply because we do not know the date of the death of Antiochus. The circumstances, however, of the times after the death of Antiochus furnish the possibility of such an event. The successor of Antiochus Epiphanes, Antiochus Eupator, certainly wrote to the Jews, after they had vanquished his host under Lysias, asking from them a peace; but the alienation between them continued nevertheless, and did not absolutely end till the victory over Nicanor, 2 Macc. 11-15. Hence there was opportunity enough for an event of the kind spoken of, though we may not be able, from the scantiness and the chronological uncertainty of the records of these times, to prove it positively.\" Hereupon Kliefoth enters upon the conjectures advanced by Hitzig regarding the unknown joyful event, and finds that nothing important can be brought forward in opposition to this especially, that the termination of the 1335 days may be the point of time when the tidings of the death of Antiochus, who died in Babylonia, reached the Jews in Palestine, and occasioned their rejoicing, since it might easily require forty-five days to carry the tidings of that even to Jerusalem; and finally he throws out the question, whether on the whole the more extended period of 1335 days must have its termination in a single definite event, whether by the extension of the 1290 days by fort-five days the meaning may not be, that whoever lives beyond this period of 1290 days, i.e., the death of Antiochus, in patience and in fidelity to the truth, is to be esteemed blessed. \"The forty-five days were then only added to express the living beyond that time, and the form of this expression was chosen for the purpose of continuing that contained in Daniel 12:11.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The majority of modern interpreters, in the reckoning of the 1290 and the 1335 days, proceed from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and with them Kliefoth holds, firstly, that the 2300 evening-mornings are 1150 days, the termination of which constitutes the epoch of the re-consecration of the temple, on the 25th of the month Kisleu of the year 148 of the Seleucidan aera (i.e., 164 b.c.); and secondly, he supposes that the terminus a quo of the 2300 evening-mornings (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and of the 1290 or 1335 days is the same, namely, the taking of Jerusalem by Apollonius (1 Macc. 1:29ff.), and the setting aside of the תּמיד which followed immediately after it was taken, about 140 days earlier than the setting up of the idol-altar. As the terminus ad quem of the 2300 evening-mornings the re-consecration of the temple is taken, with which the power of Antiochus over Israel was broken, and the beginning of the restoration made. No terminus ad quem is named in this passage before us, but perhaps it lies in the greater number of the days, as well as in this, that this passage speaks regarding the entire setting aside of the power of Antiochus-an evidence and a clear argument for this, that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a further terminus ad quem, reaching beyond the purification of the temple, is to be supposed. This terminus is the death of Antiochus. \"It is true,\" Kliefoth further argues, \"we cannot establish it to a day and an hour, that between the putting away of the daily sacrifice and the death of Antiochus 1290 days intervened, since of both facta we do not know the date of the day. But this we know from the book of the Maccabees, that the consecration of the temple took place on the 25th day of the month Kisleu in the 148th year of the Seleucidan aera, and that Antiochus died in the 149th year; and if we now add the 140 days, the excess of 2300 above 1290 after the consecration of the temple, we certainly come into the year 149. The circumstance also, that in the whole connection of this chapter the tendency is constantly toward the end of Antiochus, the Antichrist, induces us to place the death of that persecutor as the terminus ad quem of the 1290 days. Consequently we shall not err if, with Bleek, Kirmss, Hitzig, Delitzsch, Hofmann, Auberlen, Zndel, we suppose, that as the purifying of the temple is the end of the 2300 evening-mornings, so the death of Antiochus is the end of the 1290 days. The end of the 1335 days, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", must then be an event which lies forty-five days beyond the death of Antiochus, and which certainly attests the termination of the persecution under Antiochus and the commencement of better days, and which at least bears clear evidence of the introduction of a better time, and of a settled and secure state of things. We are not able to adduce proof of such a definite event which took place exactly fort-five days after the death of Antiochus, simply because we do not know the date of the death of Antiochus. The circumstances, however, of the times after the death of Antiochus furnish the possibility of such an event. The successor of Antiochus Epiphanes, Antiochus Eupator, certainly wrote to the Jews, after they had vanquished his host under Lysias, asking from them a peace; but the alienation between them continued nevertheless, and did not absolutely end till the victory over Nicanor, 2 Macc. 11-15. Hence there was opportunity enough for an event of the kind spoken of, though we may not be able, from the scantiness and the chronological uncertainty of the records of these times, to prove it positively.\" Hereupon Kliefoth enters upon the conjectures advanced by Hitzig regarding the unknown joyful event, and finds that nothing important can be brought forward in opposition to this especially, that the termination of the 1335 days may be the point of time when the tidings of the death of Antiochus, who died in Babylonia, reached the Jews in Palestine, and occasioned their rejoicing, since it might easily require forty-five days to carry the tidings of that even to Jerusalem; and finally he throws out the question, whether on the whole the more extended period of 1335 days must have its termination in a single definite event, whether by the extension of the 1290 days by fort-five days the meaning may not be, that whoever lives beyond this period of 1290 days, i.e., the death of Antiochus, in patience and in fidelity to the truth, is to be esteemed blessed. \"The forty-five days were then only added to express the living beyond that time, and the form of this expression was chosen for the purpose of continuing that contained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "We cannot, however, concur in this view, because not only is its principal position without foundation, but also its contents are irreconcilable with historical facts. To change the 2300 evening-mornings into 1150 days cannot be exegetically justified, because according to the Hebrew mode of computation evening and morning do not constitute a half but a whole day. But if the 2300 evening-mornings are to be reckoned as so many days, then neither their terminus a quo nor their terminus ad quem stands in a definite relation to the 1290 days, from which a conclusion may be drawn regarding the terminus ad quem of the latter. Then the death of Antiochus Epiphanes does not furnish a turning-point for the commencement of a better time. According to 1 Macc. 6:18-54, the war against the Jews was carried on by his successor Eupator more violently than before. And on the news that Philippus, returning from Persia, sought to deprive him of the government, Lysias advised the king to make peace with the Jews, and to promise to them that they would be permitted to live according to their own laws. On this the Jews opened the citadel of Zion; but the king, after he had entered into it, violated his oath, and ordered its walls to be demolished. It was not till two years after the death of Antiochus Epiphanes that Judas gained a decisive victory over Nicanor, which was celebrated by the Jews by a joyful festival, which they resolved to keep every year in memory of that victory (1 Macc. 7:26-50). In these circumstances it is wholly impossible to suppose an event forty-five days after the death of Antiochus which could clearly be regarded as the beginning of a better time, and of a settled and secure state of things, or to regard the reception in Palestine of the news of the death of Antiochus as an event so joyful, that they were to be esteemed as blessed who should live to hear the tidings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "After all, we must oppose the opinion that the 1290 and the 1335 days are to be regarded as historical and to be reckoned chronologically, ad we are decidedly of opinion that these numbers are to be interpreted symbolically, notwithstanding that days as a measure of time are named. This much seems to be certain, that the 1290 days denote in general the period of Israel's sorest affliction on the part of Antiochus Epiphanes by the taking away of the Mosaic ordinance of worship and the setting up of the worship of idols, but without giving a statement of the duration of this oppression which can be chronologically reckoned. By the naming of \"days\" instead of \"times\" the idea of an immeasurable duration of the tribulation is set aside, and the time of it is limited to a period of moderate duration which is exactly measured out by God. But this is more strictly represented by the second definition, by which it is increased by 45 days: 1335 days, with the expiry of which the oppression shall so wholly cease, that every one shall be blessed who lives till these days come. For 45 days have the same relation to 1290 that 1 1/2 have to 43, and thus designate a proportionally very brief time. But as to this relation, the two numbers themselves show nothing. If we reduce them to the measure of time usual for the definition of longer periods, the 1290 days amount to 54 months, or 3 years and 7 months, and the 1335 days to 44 1/2 months, or 3 years and 8 1/2 months, since generally, and still more in symbolical definitions of time, the year is wont to be reckoned at 12 months, and the months at 30 days. Each of the two periods of time thus amounts to a little more than 3 1/2 years; the first exceeds by 1 month and the second by 2 1/2 months, only a little more than the half of 7 years - a period occurring several times in the O.T. as the period of divine judgments. By the reduction of the days to years and parts of a year the two expressions are placed in a distinct relation to the 3 1/2 times, which already appears natural by the connection of the two questions in Daniel 12:6, Daniel 12:8. On the one hand, by the circumstance that the 1290 days amount to somewhat more than 3 1/2 years, the idea that \"times\" stands for years is set aside; but on the other hand, by the use of \"days\" as a measure of time, the obscurity of the idea: time, times, and half a time, is lessened, and Daniel's inquiry as to the end of the terrible things is answered in a way which might help him to the understanding of the first answer, which was to him wholly unintelligible.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "After all, we must oppose the opinion that the 1290 and the 1335 days are to be regarded as historical and to be reckoned chronologically, ad we are decidedly of opinion that these numbers are to be interpreted symbolically, notwithstanding that days as a measure of time are named. This much seems to be certain, that the 1290 days denote in general the period of Israel's sorest affliction on the part of Antiochus Epiphanes by the taking away of the Mosaic ordinance of worship and the setting up of the worship of idols, but without giving a statement of the duration of this oppression which can be chronologically reckoned. By the naming of \"days\" instead of \"times\" the idea of an immeasurable duration of the tribulation is set aside, and the time of it is limited to a period of moderate duration which is exactly measured out by God. But this is more strictly represented by the second definition, by which it is increased by 45 days: 1335 days, with the expiry of which the oppression shall so wholly cease, that every one shall be blessed who lives till these days come. For 45 days have the same relation to 1290 that 1 1/2 have to 43, and thus designate a proportionally very brief time. But as to this relation, the two numbers themselves show nothing. If we reduce them to the measure of time usual for the definition of longer periods, the 1290 days amount to 54 months, or 3 years and 7 months, and the 1335 days to 44 1/2 months, or 3 years and 8 1/2 months, since generally, and still more in symbolical definitions of time, the year is wont to be reckoned at 12 months, and the months at 30 days. Each of the two periods of time thus amounts to a little more than 3 1/2 years; the first exceeds by 1 month and the second by 2 1/2 months, only a little more than the half of 7 years - a period occurring several times in the O.T. as the period of divine judgments. By the reduction of the days to years and parts of a year the two expressions are placed in a distinct relation to the 3 1/2 times, which already appears natural by the connection of the two questions in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On the one hand, by the circumstance that the 1290 days amount to somewhat more than 3 1/2 years, the idea that \"times\" stands for years is set aside; but on the other hand, by the use of \"days\" as a measure of time, the obscurity of the idea: time, times, and half a time, is lessened, and Daniel's inquiry as to the end of the terrible things is answered in a way which might help him to the understanding of the first answer, which was to him wholly unintelligible.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Such an answer contains the two definitions of the time under the supposition that the hostile undertakings of Antiochus against Judaism, in their progress and their issue, form a type of the persecution of the last enemy Antichrist against the church of the Lord, or that the taking away of the daily sacrifice and the setting up of the idol-abomination by Antiochus Epiphanes shows in a figure how the Antichrist at the time of the end shall take away the worship of the true God, renounce the God of his fathers, and make war his god, and thereby bring affliction upon the church of God, of which the oppression which Antiochus brought upon the theocracy furnished a historical pattern. But this typical relation of the two periods of oppression is clearly set forth in Daniel 11:21-12:3, since in the conduct and proceedings of the hostile king two stadia are distinguished, which so correspond to each other in all essential points that the first, Daniel 11:21-35, is related to the second, Daniel 11:35-12:3, as the beginning and the first attempt is related to the complete accomplishment. This also appears in the wars of this king against the king of the south (Daniel 11:25-29, cf. with Daniel 11:40-43), and in the consequences which this war had for his relation to the people of God. On his return from the first victorious war against the south, he lifted up his heart against the holy covenant (Daniel 11:28), and being irritated by the failure of the renewed war against the south and against the holy covenant, he desolated the sanctuary (vv. 30, 31); finally, in the war at the time of the end, when Egypt and the lands fell wholly under his power, and when, alarmed by tidings from the east and the north, he thought to destroy many, he erected his palace - tent in the Holy Land, so that he might here aim a destructive blow against all his enemies - in this last assault he came to his end (Daniel 11:40-45).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Such an answer contains the two definitions of the time under the supposition that the hostile undertakings of Antiochus against Judaism, in their progress and their issue, form a type of the persecution of the last enemy Antichrist against the church of the Lord, or that the taking away of the daily sacrifice and the setting up of the idol-abomination by Antiochus Epiphanes shows in a figure how the Antichrist at the time of the end shall take away the worship of the true God, renounce the God of his fathers, and make war his god, and thereby bring affliction upon the church of God, of which the oppression which Antiochus brought upon the theocracy furnished a historical pattern. But this typical relation of the two periods of oppression is clearly set forth in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:21-12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", since in the conduct and proceedings of the hostile king two stadia are distinguished, which so correspond to each other in all essential points that the first, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:21-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is related to the second, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:35-12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as the beginning and the first attempt is related to the complete accomplishment. This also appears in the wars of this king against the king of the south (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:25-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:40-43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and in the consequences which this war had for his relation to the people of God. On his return from the first victorious war against the south, he lifted up his heart against the holy covenant (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and being irritated by the failure of the renewed war against the south and against the holy covenant, he desolated the sanctuary (vv. 30, 31); finally, in the war at the time of the end, when Egypt and the lands fell wholly under his power, and when, alarmed by tidings from the east and the north, he thought to destroy many, he erected his palace - tent in the Holy Land, so that he might here aim a destructive blow against all his enemies - in this last assault he came to his end (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:40-45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet more distinctly the typical relation shows itself in the description of the undertakings of the enemy of God against the holy covenant, and their consequences for the members of the covenant nation. In this respect the first stadium of his enmity against the God of Israel culminates in the taking away of His worship, and in the setting up of the abomination of desolation, i.e., the worship of idols, in the sanctuary of the Lord. Against this abomination the wise of the people of God raise themselves up, and they bring by their rising up \"a little help,\" and accomplish a purification of the people (Daniel 11:31-35). In the second stadium, i.e., at the time of the end, the hostile king raises himself against the God of gods, and above every god (Daniel 11:37), and brings upon the people of God an oppression such as has never been from the beginning of the world till now; but this oppression ends, by virtue of the help of the archangel Michael, with the deliverance of the people of God and the consummation by the resurrection of the dead, of some to everlasting life, and of some to everlasting shame (Daniel 12:1-3).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yet more distinctly the typical relation shows itself in the description of the undertakings of the enemy of God against the holy covenant, and their consequences for the members of the covenant nation. In this respect the first stadium of his enmity against the God of Israel culminates in the taking away of His worship, and in the setting up of the abomination of desolation, i.e., the worship of idols, in the sanctuary of the Lord. Against this abomination the wise of the people of God raise themselves up, and they bring by their rising up \"a little help,\" and accomplish a purification of the people (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:31-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In the second stadium, i.e., at the time of the end, the hostile king raises himself against the God of gods, and above every god (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and brings upon the people of God an oppression such as has never been from the beginning of the world till now; but this oppression ends, by virtue of the help of the archangel Michael, with the deliverance of the people of God and the consummation by the resurrection of the dead, of some to everlasting life, and of some to everlasting shame (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If thus the angel of the Lord, after he said to Daniel that he might rest as to the non-understanding of his communication regarding the end of the wonderful things (Daniel 12:7), because the prophecy shall at the time of the end give to the wise knowledge for the purifying of many through the tribulation, so answers the question of Daniel as to the אלּה אחרית that he defines in symbolically significant numbers the duration of the sufferings from the removal of the worship of Jehovah to the commencement of better times, with which all oppression shall cease, then he gave therewith a measure of time, according to which all those who have understanding, who have lived through this time of oppression, or who have learned regarding it from history, may be able to measure the duration of the last tribulation and its end so far beforehand, as, according to the fatherly and wise counsel of God, it is permitted to us to know the times of the end and of our consummation. For, from the comparison of this passage with that in Daniel 8:14 regarding the duration of the crushing under feet of the holy people by the enemy rising from the Javanic world-kingdom, it is clear that as the 2300 evening-mornings do not contain a complete heptad of years, so the 1290 days contain only a little more than half a heptad. In this lies the comfort, that the severest time of oppression shall not endure much longer than half the time of the whole period of oppression. And if we compare with this the testimony of history regarding the persecution of the Old Covenant people under Antiochus, in consequence of which God permitted the suppression of His worship, and the substitution of idol-worship in its stead, for not fully 3 1/2 years, but only for 3 years and 10 days, then we are able to gather the assurance that He shall also shorten, for the sake of His elect, the 3 1/2 times of the last tribulation. We should rest here, that His grace is sufficient for us (2 Corinthians 12:9). For as God revealed to the prophets, who prophesied of the grace that should come unto us, the sufferings of Christ and the glory that should follow, that they might search and inquire what and what manner of time the Spirit of Christ who was in them did signify; so in the times of the accomplishment, we who are living are not exempted from searching and inquiring, but are led by the prophetic word to consider the signs of the times in the light of this word, and from that which is already fulfilled, as well as from the nature and manner of the fulfilment, to confirm our faith, for the endurance amid the tribulations which prophecy has made known to us, that God, according to His eternal gracious counsel, has measured them according to their beginning, middle, and end, that thereby we shall be purified and guarded for the eternal life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If thus the angel of the Lord, after he said to Daniel that he might rest as to the non-understanding of his communication regarding the end of the wonderful things (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), because the prophecy shall at the time of the end give to the wise knowledge for the purifying of many through the tribulation, so answers the question of Daniel as to the אלּה אחרית that he defines in symbolically significant numbers the duration of the sufferings from the removal of the worship of Jehovah to the commencement of better times, with which all oppression shall cease, then he gave therewith a measure of time, according to which all those who have understanding, who have lived through this time of oppression, or who have learned regarding it from history, may be able to measure the duration of the last tribulation and its end so far beforehand, as, according to the fatherly and wise counsel of God, it is permitted to us to know the times of the end and of our consummation. For, from the comparison of this passage with that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " regarding the duration of the crushing under feet of the holy people by the enemy rising from the Javanic world-kingdom, it is clear that as the 2300 evening-mornings do not contain a complete heptad of years, so the 1290 days contain only a little more than half a heptad. In this lies the comfort, that the severest time of oppression shall not endure much longer than half the time of the whole period of oppression. And if we compare with this the testimony of history regarding the persecution of the Old Covenant people under Antiochus, in consequence of which God permitted the suppression of His worship, and the substitution of idol-worship in its stead, for not fully 3 1/2 years, but only for 3 years and 10 days, then we are able to gather the assurance that He shall also shorten, for the sake of His elect, the 3 1/2 times of the last tribulation. We should rest here, that His grace is sufficient for us (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 12:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For as God revealed to the prophets, who prophesied of the grace that should come unto us, the sufferings of Christ and the glory that should follow, that they might search and inquire what and what manner of time the Spirit of Christ who was in them did signify; so in the times of the accomplishment, we who are living are not exempted from searching and inquiring, but are led by the prophetic word to consider the signs of the times in the light of this word, and from that which is already fulfilled, as well as from the nature and manner of the fulfilment, to confirm our faith, for the endurance amid the tribulations which prophecy has made known to us, that God, according to His eternal gracious counsel, has measured them according to their beginning, middle, and end, that thereby we shall be purified and guarded for the eternal life. ",
            "children": []
          }
        ]
      }
    ]
  }
]